{
  "url": "https://www.wikihow.com/Survive-Being-in-a-Mental-Hospital",
  "title": "How to Survive Being in a Mental Hospital",
  "steps": [
    {
      "title": "Understand your treatment plan and goals.",
      "content": "Understand your treatment plan and goals. Know what you are expected to accomplish to help you stay focused on healing and being released. Ask lots of questions about the doctors expectations for release. Ask about your progress frequently and what still needs to be done. [2] X Research source Know your diagnosis, and understand the associated symptoms you may be experiencing. Know the treatment goal and expected behavioral outcomes. Know what kind of treatment will be used to help you reach your treatment goals: individual psychotherapy, group counseling, family therapy, and/or medication. You may wish to write a draft mental health treatment plan for discussion with your treating team. Ask your treating team about discharge planning. [3] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source [4] X Research source"
    },
    {
      "title": "Participate in therapy sessions.",
      "content": "Participate in therapy sessions. Take advantage of all of the therapy options. You will likely have individual sessions, but you should take advantage of group sessions as often as possible also. Psychotherapy can help improve mood, increase empathy, and decrease anxiety. [5] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Eagerly participating in therapy may also be taken as a sign of your commitment to mental health and willingness to comply with treatment plans, which may contribute to an early discharge."
    },
    {
      "title": "Follow the rules.",
      "content": "Follow the rules. There will be a lot of rules. It is important to learn these and follow them. There will likely be rules about when and where you can eat, where your can spend your free time, participation in treatment activities, like therapy, when and where to take medication, when you may use the phone, how you physically interact with others, and when and where you may visit with family. Failure to comply with any of the rules may be deemed as noncompliance and could extend your hospitalization or movement to an even more regimented ward. If you disagree with the type of medication you are required to take, ask to talk to the doctor because you have concerns. A willingness to relationally discuss treatment options will be viewed more favorable than outright refusal."
    },
    {
      "title": "Exercise to improve physical and mental health.",
      "content": "Exercise to improve physical and mental health. Take this time away from friends and family to work on your physical fitness. Exercise will help improve your mood and may distract you from feeling stuck in the hospital. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Some hospitals may have outdoor space you can take advantage of to work out. If there isn't any outdoor space or a designated fitness room, ask a staff member to show you the best place to do some exercise."
    },
    {
      "title": "Catch up on reading.",
      "content": "Catch up on reading. Reading novels may improve brain health and increase empathy. [7] X Research source Discovering the joy of reading may set you up with a healthy habit to continue after being discharged. Reading self help books may be a good idea, given the circumstances, and may improve mood. Don't be surprised if you find you can't concentrate on reading or if you want a genre you might not typically read, such as comic books. Medications and the course of your illness may make it difficult to concentrate on a book."
    },
    {
      "title": "Learn a new skill or hobby.",
      "content": "Learn a new skill or hobby. Some hospitals may have classes you can participate in or structured activities, like crafting. Take advantage of these opportunities to learn something new or find a new hobby. Pass the time doing something interesting to make your stay more bearable. If the hospital does not offer classes or structured activities, you can request art supplies and books directing you how to create with different mediums."
    },
    {
      "title": "Practice Gratitude",
      "content": "Practice Gratitude to help make your stay more bearable. Despite being in hospital, there are many things to be grateful for - like the time you can spend outside, and the kindnesses of the nurses. Counting your blessings even in the hospital environment can make your stay more bearable."
    },
    {
      "title": "Practice your normal self-care, such as showering, cleaning your teeth twice a day, and keeping your room tidy.",
      "content": "Practice your normal self-care, such as showering, cleaning your teeth twice a day, and keeping your room tidy. These simple acts of self-care show that you are interested in your wellbeing and can shorten your stay."
    },
    {
      "title": "Avoid conflict.",
      "content": "Avoid conflict. People are hospitalized for a wide variety of reasons. Recognize some people who are hospitalized may be easily angered and may respond violently. Always avoid conflicts, especially with people you are unfamiliar with, to ensure your personal safety. [8] X Research source There are staff members stationed throughout the hospital or ward to prevent violent interactions. Always comply with their directions and discuss potential problems with them. If another patient is trying to elicit a reaction from you, and you are not able to ignore him or her, tell a staff member and ask permission to go to another area of the ward."
    },
    {
      "title": "Make friends.",
      "content": "Make friends. This may not be important it you're only hospitalized for a night or two, but stays of a couple of weeks or longer are much easier if you make a couple of friends. Some institutions limit phone use and outside visitors. Friends inside the hospital will help make your time in the hospital feel less lonely. Making a friend or two may even speed your recovery, but enhancing your emotional wellbeing. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source While making friends is generally good, this is not the place to find a romantic partner. Most hospitals have rules barring the sharing of personal information (eg. phone numbers, social media accounts, etc.) don't break these rules if they are in place, as this could not only be dangerous but could get you or others into trouble if found sharing personal information. Keep in mind that your new friends are also in the ward for their own reasons. Make sure to allow them some downtime away from you if you feel they need it."
    },
    {
      "title": "Establish and maintain healthy boundaries.",
      "content": "Establish and maintain healthy boundaries . Remember, everyone is in the hospital or ward for mental health reasons. Some of them will lack appropriate boundaries. This will make establishing healthy boundaries even more important for you. Decide whether you will loan out your personal items or not. If you would rather not, decline politely if someone asks to borrow anything. Don't let others guilt or bully you into loaning out items against your better judgement. Do not tolerate abuse or inappropriate behavior from others. If someone is behaving in a way that makes you uncomfortable ask him or her to please stop. If that doesn't work, leave the area and tell a staff member."
    },
    {
      "title": "If it is your first time in a mental health ward, you may endure teasing that is designed to 'knock you into shape' and teach you the unwritten etiquette of the wards.",
      "content": "If it is your first time in a mental health ward, you may endure teasing that is designed to 'knock you into shape' and teach you the unwritten etiquette of the wards. Seek help from your friends if you feel this is happening to you and ask for a peer worker to come and talk to you. A peer worker is someone who lives with mental illness and works in the mental health ward as an advocate for patients."
    }
  ]
}