{
  "url": "https://www.wikihow.com/Unclog-the-Inner-Ear-or-Eustachian-Tube",
  "title": "How to Unclog the Inner Ear or Eustachian Tube",
  "steps": [
    {
      "title": "Recognize the symptoms.",
      "content": "Recognize the symptoms. Whether from cold , allergies, or infection , swelling will prevent Eustachian tubes from opening and allowing air to pass. This results in pressure changes, and sometimes, the accumulation of fluid in the ear. When this happens, you will feel the following symptoms: [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Ear pain or a feeling of \"fullness\" in the ear. Ringing or popping sounds and sensations that don't come from the outside environment. Children may describe popping as a “tickling” sensation. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Trouble hearing clearly. Dizziness and trouble keeping balance. Symptoms might be heightened when you rapidly change altitude — for example when flying, riding an elevator, or hiking/driving through mountainous areas"
    },
    {
      "title": "Wriggle your jaw.",
      "content": "Wriggle your jaw. This very simple maneuver is known as the first technique of the Edmonds maneuver. Simply jut your jaw forward, then wriggle it back and forth, from side to side. [4] X Research source If the ear blockage is mild, this action can pop your Eustachian tube open and reestablish normal air flow."
    },
    {
      "title": "Perform the Valsalva maneuver.",
      "content": "Perform the Valsalva maneuver. [5] X Expert Source Payam Daneshrad, MD Board Certified Otolaryngologist Expert Interview. 30 September 2020. This maneuver, which attempts to force air through the blocked passage and reestablish air flow, should always be performed gently. [6] X Expert Source Payam Daneshrad, MD Board Certified Otolaryngologist Expert Interview. 30 September 2020. When you try to blow out through blocked passageways, the air pressure in your body is affected. The sudden rush of air when you release your breath can cause a rapid change in blood pressure and heart rate. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source [8] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Take a deep breath and hold it, closing your mouth and pinching your nostrils shut. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try to blow air out through your closed nostrils. If the maneuver is successful, you will hear a popping sound in your ears, and your symptoms will be relieved."
    },
    {
      "title": "Try the Toynbee maneuver.",
      "content": "Try the Toynbee maneuver. Like the Valsalva maneuver, the Toynbee maneuver is intended to open blocked Eustachian tubes. But instead of having the patient manipulate air pressure through breathing, it relies on the air pressure adjustment of swallowing. To perform this maneuver: [10] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Pinch your nose closed. Take a sip of water. Swallow. Repeat this process until you feel your ears pop and open back up."
    },
    {
      "title": "Blow up a balloon through your nose.",
      "content": "Blow up a balloon through your nose. It might look and feel silly, but this action, called the Otovent maneuver, can be effective for equalizing air pressure in your ears. Buy an “Otovent balloon” either online or at a medical supply store. This device is just a normal balloon that has a nozzle that fits into the nostril. If you have a nozzle around the house that will fit securely into the balloon opening and your nostril, you can make an Otovent balloon of your own at home. Insert the nozzle into one nostril, and pinch the other nostril closed with your finger. [11] X Research source Try to inflate the balloon using only your nostril, until it is about the size of a fist. Repeat the process on the other nostril. Repeat until you hear the “pop” of free air flow in the Eustachian canal."
    },
    {
      "title": "Swallow with your nose pinched.",
      "content": "Swallow with your nose pinched. [12] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source This is called the Lowery maneuver, and it’s a little harder than it sounds. Before swallowing, you have to build up air pressure in your body by bearing down like you’re trying to have a bowel movement. When you’re holding your breath and blocking your nose, it will feel like you’re trying to blow air out through all of your blocked orifices. Some people find it difficult to swallow under these circumstances because of the increased air pressure in the body. Be patient , though, and keep at it. With enough practice, it could pop your ears open."
    },
    {
      "title": "Place a heating pad or warm washcloth against your ear.",
      "content": "Place a heating pad or warm washcloth against your ear. This can both ease any pain you might experience and treat the blockage. The gentle heat of a warm compress can help break up congestion, unclogging the Eustachian tubes. If you use a heating pad, you should place a cloth between the heating pad and your skin to avoid burns."
    },
    {
      "title": "Use nasal decongestants.",
      "content": "Use nasal decongestants. [13] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Ear drops won't be able to unclog your congestion because the ear is blocked up. Because the ears and nose are connected through tubes, a nasal spray is an effective way to treat Eustachian tube blockage. Angle the nasal spray bottle through the nostril toward the back of the throat, almost perpendicular to the face. Sniff as you spray the decongestant, hard enough to draw the fluid into the back of the throat, but not hard enough to swallow it or pull it into the mouth. Try one of the equalizing maneuvers after using a nasal decongestant. They might be more effective at this time."
    },
    {
      "title": "Take antihistamines if your problem is caused by allergies.",
      "content": "Take antihistamines if your problem is caused by allergies . While antihistamines aren't usually a primary method of Eustachian blockage treatment, they may help alleviate the congestion from allergies. Talk to your doctor about whether this is a good option for you. Note that antihistamines are usually not recommended for people with ear infections."
    },
    {
      "title": "Ask for medicated nasal sprays.",
      "content": "Ask for medicated nasal sprays. [14] X Expert Source Payam Daneshrad, MD Board Certified Otolaryngologist Expert Interview. 30 September 2020. Though you can try to use normal, over-the-counter nasal sprays to treat your blockage, you may find more success with prescription decongestants. If you suffer from allergies, ask the doctor if she recommends a steroid and/or antihistamine nasal spray to help resolve the issue."
    },
    {
      "title": "Take antibiotics if you have an ear infection.",
      "content": "Take antibiotics if you have an ear infection. While Eustachian tube blockage is often short-lived and harmless, it can lead to painful and disorienting ear infections. [15] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source If your blockage progresses to that level, contact a medical professional for a prescription for antibiotics. Your doctor may not prescribe them unless you also have a fever of 102.2°F (39°C) or higher for 48 hours. Follow dosage instructions for antibiotics precisely. Finish the entire antibiotic cycle, even if your symptoms seem to resolve before you’ve finished it."
    },
    {
      "title": "Talk to your doctor about a myringotomy.",
      "content": "Talk to your doctor about a myringotomy. In severe cases of blockage, the doctor may recommend surgical treatment reestablish airflow to the middle ear. There are two types of surgery, and a myringotomy is quicker option. The doctor will make a tiny incision in the ear drum, then suction out any fluid that's trapped in the middle ear. It seems counter-intuitive, but you actually want the incision to heal slowly. If the cut stays open long enough, the Eustachian tube swelling can go down to normal. If it heals quickly (within three days), fluid may collect in the middle ear again, and the symptoms may persist."
    },
    {
      "title": "Consider getting pressure equalization tubes.",
      "content": "Consider getting pressure equalization tubes. This surgical method has a higher likelihood of success, but is a long, drawn-out process. Just as with a myringotomy, the doctor will make an incision in the eardrum and suction out the fluid that's accumulated in the middle ear. At this point, he will insert a small tube into the ear drum to ventilate the middle ear. As the eardrum heals, the tube will be pushed out on its own, but this can take six to 12 months. This method is recommended for patients who have chronic problems with blocked Eustachian tubes, so discuss it carefully with your doctor. You must protect your ears entirely from water while pressure equalization tubes are installed. Use earplugs or cotton balls while showering, and use specialized ear plugs while swimming. If water passes through the tube to the middle ear, it can cause an ear infection."
    },
    {
      "title": "Treat the underlying cause.",
      "content": "Treat the underlying cause. Clogged Eustachian tubes are usually the result of some type of illness that causes mucus and tissues swelling, blocking the normal passage of air. The most common causes of mucus accumulation and tissue swelling in this area are colds, the flu , sinus infections , and allergies. [16] X Research source Don't allow these conditions to get out of hand and progress to inner ear problems. Seek treatment for cold and flu as soon as symptoms appear, and talk to your doctor about ongoing care for recurring conditions like sinus infections and allergies."
    }
  ]
}