{
  "url": "https://www.wikihow.com/Throw-Ashes-in-the-Ocean",
  "title": "How to Throw Ashes in the Ocean",
  "steps": [
    {
      "title": "Scatter the ashes at least 3 nautical miles from land.",
      "content": "Scatter the ashes at least 3 nautical miles from land. This is stated by the US EPA, meaning you can’t just stand on the shore and scatter ashes into the breaking waves. While each state has its own rules and regulations, traveling at least 3 nautical miles away from the shore is what the US EPA expects you to do. [1] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source For example, in California you need to be at least 500 yards (460 m) from the shore to scatter ashes, while the water has to be 1,800 feet (550 m) deep for you to scatter them in Florida."
    },
    {
      "title": "Use a boat to transport the ashes and any people participating.",
      "content": "Use a boat to transport the ashes and any people participating. To get at least 3 nautical miles from shore, you’ll need to either use your own boat or borrow someone else’s. You can charter a boat operator for a couple hours, and there are even boat operators that specialize in the scattering of ashes. [2] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Make sure the boat is big enough to fit all of the people planning on attending. Go online to find options for boat rentals near your chosen destination."
    },
    {
      "title": "Put items made from decomposable materials in the water, if necessary.",
      "content": "Put items made from decomposable materials in the water, if necessary. Anything you’re putting in the water has to be able to decompose. If the container you’re using isn’t decomposable, you’ll need to bring it with you back to shore. [3] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Things such as plastic or metal flowers, tombs, gravestones, and monuments aren’t allowed to be released in the water. You can release flowers into the water, but they should be able to easily decompose."
    },
    {
      "title": "Notify the US EPA within 30 days of scattering the ashes.",
      "content": "Notify the US EPA within 30 days of scattering the ashes. This is one of the rules the US EPA states, and they require that you fill out a form to tell them the details of the event. The form asks for information such as the name of the deceased, the date the scattering took place, and the location of the spreading. [4] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Choose a suitable traveling container.",
      "content": "Choose a suitable traveling container. While this container will ideally be environmentally-safe, it's okay if it's just a plastic bag or something similar if you bring the container back to shore with you. Avoid bringing a material that will break easily, such as glass. [5] X Research source If you don't plan on distributing all of the ashes, remove a portion from their original container before the trip and leave the rest."
    },
    {
      "title": "Divide the ashes up if multiple people will be spreading them.",
      "content": "Divide the ashes up if multiple people will be spreading them. It’s best if you do this before coming together with everyone. You can separate them into plastic bags, cups, or any other kind of small container. Just make sure you don’t dispose of them in the water unless they will decompose. [6] X Research source Know how many people will be spreading the ashes ahead of time so you have the right amount of containers."
    },
    {
      "title": "Opt for a water-soluble scattering urn to place the ashes in the ocean.",
      "content": "Opt for a water-soluble scattering urn to place the ashes in the ocean. If you want the ashes placed in the ocean without having to physically spread them, you can purchase a water-soluble urn. After you place the urn in the water, it will dissolve and scatter the ashes in the water. [7] X Research source Do a quick online search to find urns that will dissolve in the water."
    },
    {
      "title": "Check which way the wind is blowing",
      "content": "Check which way the wind is blowing before spreading the ashes. While you’re on the boat, position yourself upwind so that your back is against the breeze. This way, when you scatter the ashes the wind won’t blow them back in your direction. [8] X Research source"
    },
    {
      "title": "Bring a small trowel or cups to scatter the ashes in the ocean.",
      "content": "Bring a small trowel or cups to scatter the ashes in the ocean. If there are only a couple people involved in the spreading of ashes, you can bring one container and use a small shovel or scoop to distribute them. For more people, using cups is an easy way to spread the ashes individually. [9] X Research source Fill the cups with ashes before getting on the boat to avoid having to separate them in cramped quarters or windy conditions."
    },
    {
      "title": "Use your hands to spread the ashes, if desired.",
      "content": "Use your hands to spread the ashes, if desired. Ashes are sterile and won’t harm you if ingested, making them completely safe to handle with your hands. If you do use your hands to spread them, bring a towel or napkin to wipe your hands off afterwards so you don't have to wipe the ashes all over your clothing. [10] X Research source"
    }
  ]
}