{
  "url": "https://www.wikihow.com/Tell-if-Tesla-Has-Full-Self-Driving",
  "title": "How to Tell if a Tesla Has Full Self-Driving",
  "steps": [
    {
      "title": "Full Self-Driving (FSD) refers to a handful of autonomous driving features.",
      "content": "Full Self-Driving (FSD) refers to a handful of autonomous driving features. Full Self-Driving isn’t actually 100% self-driving. You can’t just get in a FSD car and have it drive for you from point A to point B. However, a FSD Tesla can partially take over for you or help you drive in certain situations. [1] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source The FSD features include: [2] X Research source Navigate on Autopilot: your car will guide you on to ramps and signal for you. Auto Lane Change: your car will automatically change lanes on highways. Autopark: Your car will parallel or perpendicular park for you. Summon: Your car will self-navigate its way out of a parking spot. Smart Summon: Your car will avoid objects and find you in a parking lot. Traffic and Stop Sign Control: Your car automatically slows down and stops at red lights and stop signs."
    },
    {
      "title": "Full Self-Driving (FSD) is different from Autopilot.",
      "content": "Full Self-Driving (FSD) is different from Autopilot. Tesla’s Autopilot refers to two specific features, which are available on every Tesla made after 2020 for free. FSD features are an addition to Autopilot, kind of like Autopilot 2.0. Older models made before 2020 will require computer upgrades to access these features. [3] X Research source These two features include: [4] X Research source Traffic-Aware Cruise Control: Your car will match the speed of surrounding traffic. Autosteer: Your vehicle will help you stay in your lane when you’re in cruise control."
    },
    {
      "title": "Open the software menu in the Tesla to see if the car has FSD enabled.",
      "content": "Open the software menu in the Tesla to see if the car has FSD enabled. In your Tesla, click the car icon in the bottom right. At the bottom, select “Software.” This will pull up your vehicle’s software features. Depending on the model of your car, you may need to hit “additional vehicle information” after opening the software tab. Here is what the different labels indicate: [5] X Research source Autopilot Safety Features: Your vehicle has autopilot, but only kicks on in emergency situations. Highway Autopilot: The autopilot features are available on the highway only. Autopilot: The autopilot features are enabled. Enhanced Autopilot: You have autopilot in addition to some FSD features enabled (but not all of them). Full Self Driving Capability: Your vehicle has FSD turned on. If there is no reference to autopilot or FSD, your vehicle has no autopilot or FSD features."
    },
    {
      "title": "To check your subscriptions in the app, scroll to the bottom and select “view details.”",
      "content": "To check your subscriptions in the app, scroll to the bottom and select “view details.” Open the Tesla app that is paired with the vehicle and scroll all the way to the bottom. Tap “view details” to pull up your vehicle’s software information. [6] X Research source It will say “Full Self-Driving Capability” and/or “Autopilot” in the “view details” list. If you don’t see any reference to either of these settings, your vehicle has no autopilot or FSD features. You can also pull up your vehicle’s other specs in the “view details” tab, including the wheels, interior settings, paint job, and firmware."
    },
    {
      "title": "Typically, FSD is only kept in used cars via a private sale.",
      "content": "Typically, FSD is only kept in used cars via a private sale. Tesla technically only offers FSD on a per-owner, per-car basis, but it is possible if you purchase the Tesla directly from an individual. The software will stay loaded on the vehicle after the title and deed transfer is complete. [7] X Research source If you buy a used Tesla online or from a dealership and Full-Service Driving is offered as a part of the sale, it’s unclear if those FSD features will permanently stay with the vehicle."
    },
    {
      "title": "Yes, every Tesla can have full FSD, but you may have to upgrade your computer.",
      "content": "Yes, every Tesla can have full FSD, but you may have to upgrade your computer. The older Tesla models don’t have the built-in capacity for the newer FSD features. You must have a Full Self-Driving computer 3.0 or older. You can check to see if your vehicle has a 3.0 computer by opening your Tesla’s computer, selecting “controls,” then “software,” and finally “additional vehicle information.” [8] X Research source"
    },
    {
      "title": "Full Self-Driving is $199 a month if your vehicle has Basic Autopilot.",
      "content": "Full Self-Driving is $199 a month if your vehicle has Basic Autopilot. If you’ve got an older Tesla that doesn’t have the Full Self-Driving computer 3.0 or older, your car only comes with the Basic Autopilot package built in. Call your Tesla dealership and make an appointment to have the computer upgraded, and then it will cost $199 a month to turn on FSD. [9] X Research source [10] X Research source The upside of paying the monthly subscription, instead of the up-front flat cost, is that you can cancel the subscription at any time."
    },
    {
      "title": "Full Self-Driving costs $99 a month if your Tesla has Enhanced Autopilot.",
      "content": "Full Self-Driving costs $99 a month if your Tesla has Enhanced Autopilot. If you have a newer Tesla that came with the Enhanced Autopilot package, check with your local Tesla dealer to see if you need a computer upgrade (you may or may not depending on the model). Get the upgrade if necessary, and you’ll then be able to pay $99 a month for the FSD features. [11] X Research source You’ll need to make an appointment at your local Tesla dealership to get the computer upgraded, if you need one."
    },
    {
      "title": "Alternatively, you can play a flat rate of $12,000 once for FSD in your Tesla.",
      "content": "Alternatively, you can play a flat rate of $12,000 once for FSD in your Tesla. If you do not want to mess around with the monthly costs and you just want to pay a flat price for unlimited Full-Service Driving features, you can pay a $12,000 flat cost to turn the features on. The benefit of doing this is that you’ll be locked in for all FSD updates in the future, which may not be the case for the subscription models. [12] X Research source The cost of FSD has gradually increased every year or so since Tesla first rolled out this option, so don’t expect the cost to go down in the future. [13] X Research source"
    },
    {
      "title": "To upgrade to FSD in the app, tap “upgrades” and then select “subscribe.”",
      "content": "To upgrade to FSD in the app, tap “upgrades” and then select “subscribe.” Tap the checkbox next to “Full-Service Driving Capability” and hit the subscription button. Then, you can enter your payment details and choose your payment option. [14] X Research source The FSD features will only work if you’ve got a 3.0 computer or newer. If your Tesla was made after 2020, you don’t need to worry about upgrading the computer. [15] X Research source"
    },
    {
      "title": "To upgrade to FSD In your Tesla account, go to “manage” and then “buy upgrades.”",
      "content": "To upgrade to FSD In your Tesla account, go to “manage” and then “buy upgrades.” If you don’t want to use the app, sign into your Tesla account online. Tap “manage,” “buy upgrades,” and “subscribe.” Then, you can manually add the FSD features. [16] X Research source"
    }
  ]
}