{
  "url": "https://www.wikihow.com/Start-Reading-eBooks",
  "title": "How to Start Reading eBooks",
  "steps": [
    {
      "title": "Find an e-book application for your mobile phone.",
      "content": "Find an e-book application for your mobile phone. Whether you have an iPhone or Android, there are many applications designed for reading e-books. The most popular are OverDrive Media Console, Kindle App, Google Play Books, Bluefire Reader, and iBooks. Compare the features of each and select one catered to your needs. Use Open Fire Media if you plan to read content offered through libraries and schools. Download Bluefire Reader if you are going to read e-books from many different sources. Select Kindle App if you have an Amazon Prime membership—this opens up over 1 million books for you to borrow from the Kindle Owners' Lending Library."
    },
    {
      "title": "Download e-book software onto your computer.",
      "content": "Download e-book software onto your computer. If you want to read an e-book on your desktop or laptop, there many programs to choose from. The Kindle App, Calibre, and Adobe Digital Editions are the most popular free software and all have Windows and Mac versions. [1] X Research source If your browser is Firefox by Mozilla, you can download the EPUBReader to read ePub files right in your browser. [2] X Research source"
    },
    {
      "title": "Purchase an e-reader tablet if you plan to read for long hours.",
      "content": "Purchase an e-reader tablet if you plan to read for long hours. Devices like Kindle (Amazon) and Nook (Barnes & Noble) have longer battery lives than iPads, meaning you can travel without a charger for weeks. They also come with e-ink screens that prevent you from staring directly into the source of light, which is easier on the eyes. [3] X Research source Choose a tablet if you plan to read outside during the day often. Remember that e-tablets are only compatible with e-books purchased from their respective companies (Amazon, Barnes & Noble, Sony, etc.). Download conversion software to remove digital rights management (DRM) from e-books and read them on any device. However, bear in mind these are third-party programs that are not guaranteed to be effective."
    },
    {
      "title": "Invest in an iPad if you plan to read a variety of image-rich materials.",
      "content": "Invest in an iPad if you plan to read a variety of image-rich materials. With an iPad, you can purchase e-books from Kindle, Kobo, Nook, Google Play Books, and more, giving you much more variety in terms of suppliers. It's also better suited for image-rich materials like comic books. [4] X Research source Don't use an iPad to read for long periods of time, especially outdoors—it will strain your eyes with its LCD display."
    },
    {
      "title": "Purchase e-books using commercial services.",
      "content": "Purchase e-books using commercial services. There are plenty of places to purchase e-books, including Amazon's Kindle Store, Kobo, iBooks, Barnes & Noble, and Sony. Amazon is typically the cheapest, but look around and see which service has a selection of books suited to your tastes. If you lose a copy of your e-book on your computer or reader, return to the service you purchased it from and download it again from your personal library. If you're looking for free books, these services also have a limited number of options."
    },
    {
      "title": "Borrow e-books using a public or educational library.",
      "content": "Borrow e-books using a public or educational library. Local libraries and schools often have their own catalogue of e-books. For public libraries, you need a library card and PIN to download books to your device. For school libraries, you will need your student number and pin to log-in to the system and borrow materials. [5] X Research source Borrow e-books from libraries if you don't plan to take a while to read them. After the borrowing period is up, library e-books are automatically returned."
    },
    {
      "title": "Download public domain e-books through Project Gutenberg.",
      "content": "Download public domain e-books through Project Gutenberg. This project contains an archive of public domain books in e-book format. Simply browse their catalog ( https://www.gutenberg.org/catalog/ ) and choose something you like, or search their database for something specific. Choose a specific language if you are interested in reading books in different languages."
    },
    {
      "title": "Download an e-book organizer.",
      "content": "Download an e-book organizer. As you begin amassing an e-book collection through the methods above, you might find things get a bit cluttered. Download an organizer like Calibre, Alfa Ebooks Managers, Delicious Library, or Library Thing. These programs help you organize you collection alphabetically, by author, by publisher, or chronologically. [6] X Research source Tablets like Kindle and Nook come with management software, but only for e-books purchased through their distributors. Download a DRM removal plugin for organizers that support them, such as Calibre. This allows you to import e-books purchased through Kindle and Nook to the free organizer. DRM removal is typically only illegal if done with the intention to sell or share the file. [7] X Research source"
    }
  ]
}