{
  "url": "https://www.wikihow.com/Tell-if-Someone-Has-a-Dating-Profile",
  "title": "How to Tell if Someone Has a Dating Profile",
  "steps": [
    {
      "title": "This is probably the fastest solution, but some make cost money.",
      "content": "This is probably the fastest solution, but some make cost money. Some apps and websites will search through the code on dating profiles and look for evidence that someone has a profile. You just need their name, phone number, or email address. Unfortunately, some of the sites do tend to cost $5-10 per search; although some sites give you a free trial, others are just totally free. [1] X Research source Some of the most popular options include: [2] X Research source UserSearch: This lets you search for a username on dating sites, letting you know if one has been found. The results are free, and they don't need you to register. Cheatbuster: This only works for Tinder, but it’s supposedly got a 98% accuracy rating. Spokeo: This will pull up any social media sites associated with an email or name, but it can be tough to sift through the data if the person has a super common name, like John Williams. Socialcatfish: Like Spokeo, this will pull up any social media accounts and photos associated with a name. If you download one of these apps or programs and it asks if you want to access someone’s accounts, camera, or location data, do not use it. This kind of software is typically illegal."
    },
    {
      "title": "If they have a profile, it will say the email is taken when you sign up.",
      "content": "If they have a profile, it will say the email is taken when you sign up. Go to a dating site and sign up as if you’re making an account. Enter the person’s email and then make a password up. Try to move forward. If it lets you move on to the next screen, this person doesn’t have an account. If they do have an account (or at least used to), it will say, “this email is taken” or “your email is already in use.” [3] X Research source Many sites allow you to sign in with a phone number. If their email doesn’t pop up, try their phone number instead. This will only tell you if someone ever had a profile. It won’t tell you if they’re actively using the dating site. If you’re looking into your partner and the two of you met on a specific dating site, this won’t help. Do this on as many dating sites and apps as possible. The most popular dating sites include Tinder, Match, OkCupid, Bumble, Hinge, and Zoosk."
    },
    {
      "title": "If they’re on a site, try resetting the password to see if an email goes through.",
      "content": "If they’re on a site, try resetting the password to see if an email goes through. Some websites and apps won’t tell you if an email is in use at the sign-up screen. Instead, click the “I forgot my password” link. Enter the person’s email or phone number and click the “submit” button. If the person doesn’t have an account it will say “username incorrect” or something like that. [4] X Research source If a website does send out an email or text, that person will get the email or text to reset their password. In other words, they’ll know someone tried to get into their account. Like the profile-making trick, this only tells you if the person ever had a profile. It doesn’t tell you if they’re actively using it now."
    },
    {
      "title": "This takes time, but it’s ideal if you want 100% confirmation.",
      "content": "This takes time, but it’s ideal if you want 100% confirmation. Sign up for that site yourself to find out if someone is using a dating site. Change your location to the other person’s city or town, and adjust your age filter so that you only see people who are the other person’s age. It may take time to swipe and sort through all of the profiles, but you should eventually find them if they’re using the site. [5] X Research source You can ask a friend already on the dating site to do this for you instead. If you do make your profile, be fair to folks on the site by mentioning you aren’t looking for anything in your profile. This is easier if you live in a less populated area. It will take a lot longer to get through many profiles if you live in a big city."
    },
    {
      "title": "If they use the same username for everything, search for it online.",
      "content": "If they use the same username for everything, search for it online. Hop on to a search engine and enter the username in quotation marks so that you only see those results. Then, type “site:datingsite.com” to see if their profile pops up. Alternatively, you can try searching for them directly by typing the URL into your browser followed by “/@username” or “/username.” [6] X Research source So, if you have a person in your life who uses “Maxine41” for everything, you might search, “Maxine41” site:tinder.com or ”Bumble.com/@Maxine41”"
    },
    {
      "title": "If they have a photo they love, they’re probably using it on dating sites.",
      "content": "If they have a photo they love, they’re probably using it on dating sites. Go on their Facebook, Twitter, or Instagram and save their favorite photo. Then, go to a reverse image search page ( Google and TinEye are the most popular). Upload the photo and see where else it pops up online. If you see it on any dating sites, they have a profile on that site. [7] X Research source It’s unclear just how accurate this is. Many dating sites have privacy settings that may make sorting their images impossible, but this may work."
    },
    {
      "title": "If you can swap devices together, it’s better than snooping.",
      "content": "If you can swap devices together, it’s better than snooping. Many couples will turn over their phones and computers to one another specifically to make sure that both partners are being honest. This is preferable to snooping without permission, and it’s a healthier way to approach the topic if you’re genuinely worried. This is an increasingly common thing for couples to do, so just ask. [8] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source You might ask, “I don’t know if you’re comfortable with it, but I’d like to be open with one another regarding our social media and phone usage. Would you be okay with sharing?” If they ask why you want to do this, consider telling them the truth about why you’re nervous. If you aren’t ready for that conversation, you could tell them, “I just want to know we can trust each other.”"
    },
    {
      "title": "It’s unethical, but snooping through their computer will give you an answer.",
      "content": "It’s unethical, but snooping through their computer will give you an answer. This is a privacy violation that may have consequences for your relationship. Snooping implies you don’t trust your partner, which is already bad enough, but it’s also wrong to do this without their permission. Still, if you absolutely must know if they’re on a dating site, going through their browser history may give you an answer. [9] X Research source Search for the major dating sites manually (i.e. search “Tinder,” “Bumble,” etc.). If any results pop up, they’re browsing that site and probably have a profile. Depending on where you live, this may actually be illegal. Double-check the privacy laws where you live to see if you’re going to commit a crime before doing this."
    },
    {
      "title": "It’s a privacy violation, but you can check their phone for hookup apps.",
      "content": "It’s a privacy violation, but you can check their phone for hookup apps. This is a serious violation of your partner’s trust, and it’s wrong to snoop through someone’s belongings without permission. Still, this will tell you whether they’re using dating apps or not. If you have access to their phone, scroll through their app list to see if they have any of these apps. [10] X Research source If they’re actively hiding this from you, go into their settings and scan the “disabled apps” list. These apps on their phone have installed, but they’re hiding from the home screen and app list. This can be a crime depending on where you live. Make sure that you aren’t violating the law before you look through their phone."
    },
    {
      "title": "This isn’t a scientific solution, but there may be evidence they’re on dating apps.",
      "content": "This isn’t a scientific solution, but there may be evidence they’re on dating apps. If you can’t find them on dating apps or sites, look for evidence they’re hiding something from you. If they’re suddenly turning their phone on vibrate, taking it with them everywhere they go, or locking it whenever you’re around and they aren’t on it, it could be a sign that they’re hiding something. [11] X Research source they may be talking to someone they met outside of a dating app or website. If they’ve always been a bit possessive of their phone or they’re a bit of a social media addict and nothing has changed, don’t assume they’re hiding something from you."
    },
    {
      "title": "Discussing your fears will help you work through this as a couple.",
      "content": "Discussing your fears will help you work through this as a couple. Whether they are dating around or not, the fact that you’re worried about this means something. Your anxiety and fear may be founded, or it may not be. In either case, talk to your partner about how you’re feeling. You can ask them about dating profiles if you want, and then go on to talk about what you’re feeling. [12] X Research source You might say, “Hey, I’m not mad or anything, but I’ve been really nervous you’re using dating sites behind my back. Can we talk about it? It’s really making me upset.” If you two haven’t had the “exclusive” conversation , they may simply think you two are still being casual. It’s unfair to snoop around if they don’t even know they’re supposed to delete the app or profile yet! [13] X Research source"
    }
  ]
}