{
  "url": "https://www.wikihow.com/Write-a-Roommate-Wanted-Ad",
  "title": "How to Write a Roommate Wanted Ad",
  "steps": [
    {
      "title": "Figure out what you and your home have to offer.",
      "content": "Figure out what you and your home have to offer. It’s a good idea to brainstorm about what you can offer a potential roommate before you write an ad. This can help you more easily write the ad text and attach photographs that will attract quality roommates. [1] X Research source Some examples of what you might offer are: convenient location, your great personality, pets, cheap rent. [2] X Research source Write out a list of what you have to offer so that you can easily draw upon it when you write your ad."
    },
    {
      "title": "Think about what you are looking for in a roommate.",
      "content": "Think about what you are looking for in a roommate. You’ll also want to consider what you are looking for in a roommate before you compose your ad. This will help ensure that you thoroughly address every contingency that may happen with a roommate. [3] X Research source A roommate’s habits can significantly affect you and your home. Make sure to think about factors such as personality and habits such as cleanliness. [4] X Research source If you’ve ever had a roommate, think about what you liked and disliked about them. You can use this information to help direct you as you formulate a list of what you are seeking in a roommate. Create a list of what you are looking for in a roommate so that you can easily draw upon it when you write your ad."
    },
    {
      "title": "Decide where to place your ad.",
      "content": "Decide where to place your ad. Where you place a roommate ad can determine the type of roommate you attract. Considering where to place the ad can not only help you find the place best to advertise but also help the best roommate find you. [5] X Research source You can advertise for roommates in different locations including online, in the newspaper, on public bulletin boards, or having someone you know make an announcement. Reading ads for roommates in different sources can give you a sense of the clientele and types of people each publication offers. Perusing ads can also help you write the best text for your needs."
    },
    {
      "title": "Coin a catchy headline.",
      "content": "Coin a catchy headline. You want to compose an ad that will appeal to type of roommate you are seeking. Coining a catchy and engaging headline can direct and hook potential roommates. Keep your headline short and to the point. Remember, this is just to draw in potential roommates. For example, if you are looking for a roommate who attends a nearby college or university, you could use the headline, \"Roommate Wanted to Share Great Apartment Near Campus!\" If you have pets, you could write “Cat lover seeking cat lover to share great apartment and kitty cuddles.”"
    },
    {
      "title": "Define the location of the house or apartment.",
      "content": "Define the location of the house or apartment. One of the most important items potential roommates look for in an ad is the apartment or house location. This can help weed out potential roommates who may not like the location or cannot afford it. Include basic information about the location such as if it is a house, an apartment building, and how many people live there. [6] X Research source If you want to protect your privacy, only include the apartment building name, not your unit number. Inform readers of the type of building, the location, and the neighborhood. With a house, you can include the street. [7] X Research source Ask potential roommates to email or call you for an interview and the house or building’s specific location. [8] X Research source"
    },
    {
      "title": "Promote the apartment with its features.",
      "content": "Promote the apartment with its features. List the features of the room, apartment or house, and the neighborhood. Consider things that will appeal to the type of roommate you are seeking to help you locate the best person for you and your flat. Make sure to include features about the apartment such as furnished, clean, friendly community, carpeting, windows, washer and dryer, and air conditioning. You’ll also want to include information about public transportation and parking. [9] X Research source For example, if you are looking for a roommate who is quiet and a homebody, you may want to include things like \"located in secluded area, quiet at night, perfect for individuals who want to avoid noisy bar traffic.\" If you are looking for someone who could go out with you, you could write “located in an area close to restaurants, bars and nightlife.”"
    },
    {
      "title": "Describe the current occupants.",
      "content": "Describe the current occupants. Write a brief description of the current occupants of the house including you, other roommates, and pets. This can also help weed out people who may not have similar needs or wants as you. [10] X Research source Include information about how you and any other occupants use the apartment or house, whether it is active or quiet, or if people work or stay at home all day. [11] X Research source Make sure to include the sex and age range of everyone living in the apartment or house. [12] X Research source"
    },
    {
      "title": "Explain what type of roommate you are seeking.",
      "content": "Explain what type of roommate you are seeking. It might seem like you are being picky to include the type of roommate you want, but the point of your ad is to attract someone with whom you can live. Listing specifics such as nonsmoker, male or female, and attributes is very important and can help you run avoid uncomfortable situations down the road. [13] X Research source Depending on where you live, there may be discrimination laws about excluding certain people or groups as roommates. For example, it may be illegal to write “no women” or “Christians only” in an ad. Consult local rental laws to see what you can and cannot include in a roommate wanted ad. This part of the ad should make the right person say “that’s the flat or house for me.” [14] X Research source Make sure to include information about items such as cleaning expectations, behavior in common areas, cooking, smoking, parties, and guests."
    },
    {
      "title": "List the cost of rent and any other fees or expenses.",
      "content": "List the cost of rent and any other fees or expenses. Towards the end of your ad, include financial information about renting with you. Be as specific as possible and make sure to include any additional fees such as utilities or cleaning costs. Potential roommates should know exactly how much they will be expected to pay prior to applying, which should also help weed out unwanted persons. [15] X Research source List the rent, the cost of utilities, and any other fees such as cleaning services or parking rates. Make sure to include how much security deposit you require. [16] X Research source You may want to let potential roommates know that you will be conducting interviews for the space. [17] X Research source It’s always a good idea to ask for references from potential renters. You can include a line about references with the financial information, which may detract otherwise unsavory potential roommates."
    },
    {
      "title": "Provide your contact information at the bottom of the ad.",
      "content": "Provide your contact information at the bottom of the ad. You want potential roommates to contact you without sharing too much information. This will help protect your privacy. [18] X Research source You can include your first name in the ad, but don't use your last name. [19] X Research source Only include a phone number if you have caller ID. [20] X Research source Use an anonymous e-mail address created specifically for your roommate search. This will make it easy to ignore people that may not be right for your space. [21] X Research source"
    },
    {
      "title": "Attach photos of the advertised space.",
      "content": "Attach photos of the advertised space. Including pictures of the space you are advertising can also help attract potential roommates. Make sure to include pictures of the room, common areas, and any other features you want to highlight."
    }
  ]
}