{
  "url": "https://www.wikihow.com/Use-Invisalign-Cleaning-Crystals",
  "title": "Using Invisalign Cleaning Crystals: Frequency, Alternatives & More",
  "steps": [
    {
      "title": "Invisalign Cleaning Crystals clean dental trays in 15 minutes.",
      "content": "Invisalign Cleaning Crystals clean dental trays in 15 minutes. These small, individually packed dissolving crystals function to remove the pesky plaque-causing bacteria from retainers and aligners that can lead to oral health issues such as tooth decay and the gradual discoloration of your aligner or retainer. Using Invisalign Cleaning Crystals or a quality alternative once or twice per day ensures the invisibility of your clear retainer or aligner, as well as a healthy mouth. [1] X Research source"
    },
    {
      "title": "Remove your retainer or aligner.",
      "content": "Remove your retainer or aligner. Remove your retainer or aligner and give it a quick rinse under the sink to remove any saliva or food buildup that may have accumulated during the day. [2] X Research source It’s fine to use warm tap water to rinse out your dental trays."
    },
    {
      "title": "Place your retainer or aligner in a container filled with warm water.",
      "content": "Place your retainer or aligner in a container filled with warm water. Choose a container like a clean, plastic food container with a lid large enough to fully submerge your retainer or aligner in warm water. [3] X Research source The Invisalign Cleaning System comes with 50 Invisalign Cleaning Crystal packets and a cleaning tub. If you’ve purchased this system, use the cleaning tub for its ease of use rather than an alternate container. [4] X Research source"
    },
    {
      "title": "Pour 1 packet of Invisalign Cleaning Crystals into your container.",
      "content": "Pour 1 packet of Invisalign Cleaning Crystals into your container. Gently shake or agitate the container for around 20 seconds to dissolve the cleaning crystals properly. [5] X Research source"
    },
    {
      "title": "Let your container sit for 15-30 minutes.",
      "content": "Let your container sit for 15-30 minutes. Sit back and let the magic happen. After at least 15 minutes, gently shake your container for another 20 seconds to ensure your aligner or retainer is fully clean. [6] X Research source You can use a packet of Invisalign Cleaning Crystals to clean your aligner or retainer once to twice daily if you're feeling extra productive."
    },
    {
      "title": "Rinse your aligner or retainer in the sink.",
      "content": "Rinse your aligner or retainer in the sink. Before putting in your aligner or retainer, make sure to rinse it off to remove any excess cleaning solution. [7] X Research source"
    },
    {
      "title": "Use a toothbrush and toothpaste to clean your aligners.",
      "content": "Use a toothbrush and toothpaste to clean your aligners. According to Invisalign’s official website, using a soft toothbrush, mild toothpaste, and warm water is enough to effectively clean your aligner. Don't forget to rinse your retainer or aligner after cleaning before you re-insert them into your mouth. [8] X Research source"
    },
    {
      "title": "Try soaking your aligners in hydrogen peroxide for 30 minutes.",
      "content": "Try soaking your aligners in hydrogen peroxide for 30 minutes. Mixing equal parts warm water and 3% hydrogen peroxide to clean your aligner is a popular alternative to dental cleaning tablets. [9] X Research source"
    },
    {
      "title": "Soak your aligners in equal parts white vinegar and water for 30 minutes.",
      "content": "Soak your aligners in equal parts white vinegar and water for 30 minutes. Equal parts vinegar and warm water for 30 minutes once a week is a great way to deep-clean your retainer outside your normal cleaning regime. White vinegar is a powerful bacteria killer that will eliminate any stubborn odors from your dental trays. [10] X Research source"
    },
    {
      "title": "Use denture cleaning tablets sparingly.",
      "content": "Use denture cleaning tablets sparingly. Denture cleaning tablets can be used once a week to clean your aligners, but don't overuse them, as the abrasiveness of this solution will break down your aligners and stain them. [11] X Research source"
    },
    {
      "title": "Soak your trays at least once daily.",
      "content": "Soak your trays at least once daily. Fight off plaque-causing bacteria by soaking your trays once or twice a day. Cavities are no fun for anyone! [12] X Research source"
    },
    {
      "title": "Regularly brush and floss your teeth.",
      "content": "Regularly brush and floss your teeth. A clean retainer or aligner starts with a clean mouth. Keeping your mouth clean means less food, and plaque-causing bacteria will build up on your aligner. [13] X Research source"
    },
    {
      "title": "Don’t eat or drink with your aligner in.",
      "content": "Don’t eat or drink with your aligner in. Keeping your dental trays on while eating or drinking will lead to an excess of bacteria-causing food buildup and tarnish your dental trays. No one wants a stained smile! [14] X Research source"
    },
    {
      "title": "Store your dental trays when they’re not in use.",
      "content": "Store your dental trays when they’re not in use. Use a container from your dental office or a clean plastic food container with a lid to keep your dental trays clean when they’re not in your mouth. [15] X Research source"
    }
  ]
}