{
  "url": "https://www.wikihow.com/Track-Your-Menstrual-Cycle",
  "title": "How to Track Your Menstrual Cycle",
  "steps": [
    {
      "title": "Note of the first day of your period.",
      "content": "Note of the first day of your period. The first day of your period is the day that you actually start to bleed. Your menstrual cycle runs from the first day of your period to the first day of your next period. The length of a menstrual cycle is different for each woman, but a typical cycle is between 21 and 35 days. Bleeding usually lasts for two to seven days. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Count the number of days between your periods and the number of days that you bleed. If you have started your period within the last two years, your cycle may be longer. Your cycle should become shorter and more regular the older you get. The length will also change when you are in perimenopause or close to menopause. The frequency and length of your menstrual cycle may also be altered by taking some forms of contraception (e.g. extended-cycle birth control pills). You typically ovulate between day 11 and day 21 of your cycle. This is the time of your cycle when you are most fertile and most likely to become pregnant if you have sex. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Keep track of your physical symptoms.",
      "content": "Keep track of your physical symptoms. Record the heaviness of your flow and any pain that you experience. Try to be as detailed as possible. In addition to keeping track of your physical symptoms, note the day of your cycle that you are experiencing them. For example, do you experience cramping a few days before your period starts? [3] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source How many pads or tampons did you use? Are you experiencing cramps? Are the cramps in your lower abdomen and/or your lower back? Are you experiencing any breast tenderness? How does your vaginal discharge change throughout your cycle? Do you experience diarrhea or loose stools during your period? (This is a common symptom.)"
    },
    {
      "title": "Pay attention to your emotions.",
      "content": "Pay attention to your emotions. Many people experience emotional changes as their hormones fluctuate. You may experience anxiety, a depressed mood, mood swings, irritability, appetite changes, or crying spells. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source These symptoms typically occur before your period starts. Write down the day in your cycle that you experience any of these symptoms. Also note any other sources of stress that may be affecting your mood. This can help you determine if you are feeling anxious because your period is on the way or if your are anxious because of a project at work or school. If these symptoms appear around the same time each month, they are likely related to your cycle."
    },
    {
      "title": "Repeat this process every month.",
      "content": "Repeat this process every month. Track your cycle for a few months in a row to get an idea of what is normal for your body. You should begin to notice trends and similar physical and emotional symptoms each month. Note any changes that happen from month to month. [5] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source Some variation is normal. You may bleed for five days one month and three days the next. What is normal for you may not be normal for someone else. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Do not worry if your cycle is different than other people you know. Look for consistency within your own cycle. Keep in mind that if you are taking birth control pills, using a hormonal IUD, an implant, patch, or shots, then you will probably have a lighter period than when you did not take the birth control, but this is normal."
    },
    {
      "title": "Mark the days on a calendar.",
      "content": "Mark the days on a calendar. If you would like to track your period the old-fashioned way, obtain a calendar and mark the days with pencil, pen, marker, or highlighter. You may use different colors, symbols, or stickers to mark the beginning and end of your cycle, the length of your period, or the days you experience physical or emotional symptoms. Create a system that is clear and works for you. [7] X Research source If you do not want to overload your calendar with too much information, you can keep a separate journal for your physical and emotional symptoms and only use the calendar to mark the beginning and end of your cycle and period. If you don't use a calendar often, keep your calendar in a place you will remember it. Hanging the calendar in your bathroom or placing it next to a mirror may be helpful If you are a very private individual and don't like your period info out for the world to see, use a very discrete mark (e.g. an \"x,\" circle, or color) signifying the event to you."
    },
    {
      "title": "Download an app on your phone.",
      "content": "Download an app on your phone. Instead of using pen and paper, you can use an app to track your period. These apps can keep all of your information at your fingertips and predict when your period will occur. In addition to having a calendar, many of these apps allow you to record physical and emotional changes that take place throughout your cycle. [8] X Research source Clue is a free app for iPhone and Android phones and is one of the most recommended apps. It allows you to record physical and emotional symptoms, the days you have sex, and create reminders to take your birth control pills. After entering a few months of data, the app will use algorithms to predict when your next period starts and when you are expected to ovulate. Period Tracker Lite is another free recommended period tracking app. This app allows you to use icons to describe your moods instead of typing out your symptoms. It is available for both iPhone and Android phones."
    },
    {
      "title": "Use an online calendar.",
      "content": "Use an online calendar. If paper and pen or apps do not appeal to you, you can use an online tracker. These websites allow you to enter all of your cycle information and often have tools such as calendars, history reports, and reminders. Some of these websites also provide links to information about menstrual cycles. If internet access is an issue for you, you may not want rely on an online period tracker. Many of the sanitary product makers (e.g. Tampax, Always, etc.) have online tackers available through their websites."
    },
    {
      "title": "Make adjustments based on your tracking information.",
      "content": "Make adjustments based on your tracking information. You can use the information you have been tracking to make your life a little easier when you experience symptoms. If you know the days that you have cramps, the days that you are more irritable, or when your period is coming, you can adjust your life so that your cycle does not interfere. For example, if you know that you become bloated three days before your period, you can make sure that you avoid caffeine, salt and alcohol and drink plenty of water during this time period. [9] X Research source If you know that you are irritable during a certain time of your cycle, focus on getting enough sleep and practice some relaxation techniques so your irritability does not get the best of you."
    },
    {
      "title": "Manage an irregular period.",
      "content": "Manage an irregular period. Up to 14% of women have irregular menstrual cycles. [10] X Research source If your period arrives early or late, if you have excessive bleeding or barely bleed, or experience severe pain, you may have an irregular period. An irregular period should be easy to identify if you have been tracking your cycle. Your period may be irregular for many reasons such as the contraception you use, polycystic ovary syndrome, stress, thyroid disorders, [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source eating disorders, uncontrolled diabetes, fibroids, or endometriosis. [12] X Research source There are many treatments available for irregular periods. [13] X Research source"
    },
    {
      "title": "Know when to see a doctor.",
      "content": "Know when to see a doctor. Menstrual irregularities are common. If you notice any changes or have some questions, see your health care provider. Take all of the information that you have been tracking with you. This can help your health care provider figure out what is going on with your body. You should always see a professional if you experience any of the following: [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You bleed for more than seven days. You are bleeding in between your periods. Your periods are less than 21 days apart or more than 35 days apart. Your periods went from being regular to being irregular. You soak through more than one tampon or pad every hour or two. Your periods become very heavy or painful."
    }
  ]
}