{
  "url": "https://www.wikihow.com/Turn-Off-Ask-Permission-for-Apps",
  "title": "Simple Ways to Get Rid of Parent Permission on App Store",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. Tap the app icon that features a gear. Use this method if you're the family organizer of Family Sharing using your own iPhone or iPad. If you're not the organizer, you can ask them to turn this feature off."
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. It's at the top of the list."
    },
    {
      "title": "Tap Family Sharing.",
      "content": "Tap Family Sharing . You'll see it next to an icon of a family inside a cloud."
    },
    {
      "title": "Tap the family member's name.",
      "content": "Tap the family member's name. You'll see more information about that family member, including their age, and Apple ID. If you're using iOS 15 or earlier, tap Ask to Buy instead."
    },
    {
      "title": "Tap Ask to Buy.",
      "content": "Tap Ask to Buy . In iOS 15 or earlier, the steps are reversed, so you'd tap a name here instead."
    },
    {
      "title": "Turn the toggle off .",
      "content": "Turn the toggle off . This is next to \"Require Purchase Approval.\" If you're using iOS 15 or earlier, the toggle will say \"Ask to Buy\" instead. [1] X Research source"
    },
    {
      "title": "Open System Settings.",
      "content": "Open System Settings. Click the Apple logo in the Apple menu and click System Settings. For macOS Monterey or earlier, this will say \"System Preferences\" instead."
    },
    {
      "title": "Click Family.",
      "content": "Click Family . Newer OS users will see this as the first tile under your name if you have Family Sharing active . For macOS Monterey and older, \" Family Sharing \" will appear on the far right side of the window."
    },
    {
      "title": "Click the person's name.",
      "content": "Click the person's name. You will see more information about that family member. For macOS Monterey and older, click Ask to Buy instead of a family member's name."
    },
    {
      "title": "Click Ask to Buy.",
      "content": "Click Ask to Buy . It's in the side panel on the left side of the window. If you're using macOS Monterey and older, just uncheck the box next to the family member's name. This changes the permissions so you'll no longer receive \"Ask to Buy\" notifications!"
    },
    {
      "title": "Turn the toggle off .",
      "content": "Turn the toggle off . This is next to \"Require Purchase Approval.\" Once the toggle is off or the box is unchecked, you've turned off the \"Ask to Buy\" feature. Now that person can get any app from the App Store without first notifying you, the family organizer. You can also use Family Sharing to create an Apple ID for children ."
    }
  ]
}