{
  "url": "https://www.wikihow.com/Stop-Picking-Your-Nose",
  "title": "How to Stop Picking Your Nose for Good",
  "steps": [
    {
      "title": "Clean out your nose.",
      "content": "Clean out your nose. Regularly blow your nose to remove mucus and debris. This will minimize the urge to pick debris out of your nose. You can also use water or saline solutions to clean your nose. These often come in the form of nasal sprays. [2] X Research source"
    },
    {
      "title": "Address your allergies.",
      "content": "Address your allergies. If you have any allergies, you will need to take care of them. Talk to your doctor about a daily allergy medication for ongoing allergies. For a single exposure to an allergen (like your mom's cat), take an over the counter antihistamine. [3] X Research source Even for over the counter medications, consult your doctor ahead of time."
    },
    {
      "title": "Eliminate nose hair.",
      "content": "Eliminate nose hair. Excessive nose hair will trap debris in the hair. Things like dust and pollen can get tangled in the hairs and leave you feeling like your nose needs cleared out. This leads to an urge to pick your nose. Use a nose hair trimmer to keep your nose hair trimmed."
    },
    {
      "title": "Keep your hands busy.",
      "content": "Keep your hands busy. If your hands are busy, then picking your nose is more difficult. You are less likely to automatically pick your nose if you have something else to do with your hands. Write things down, doodle on a piece of paper, or just keep something to fidget with to keep your hands busy. [4] X Research source"
    },
    {
      "title": "Wear gloves.",
      "content": "Wear gloves. Wearing gloves makes it difficult to pick your nose. Before picking, you would have to take the gloves off, and this provides a barrier that stops you from unconsciously doing it. You can even wear stylish gloves that match a coat or outfit to keep your nose picking habit under the radar. [5] X Research source"
    },
    {
      "title": "Track triggers.",
      "content": "Track triggers. Nose picking is often done in response to anxiety or some other emotion. These emotions can be triggered by your environment. Pay attention to when and where you have an urge to pick your nose. If you notice any patterns, try to avoid those triggers. [6] X Research source For example, you might pick your nose when you are impatiently standing in a long line. If this is the case, try to avoid the lines or bring something else to do with your hands."
    },
    {
      "title": "Reward yourself for a job well done.",
      "content": "Reward yourself for a job well done. When you can resist the urge to pick your nose, reward yourself. Set up a reward system that gives you rewards for going an entire day, week, or longer without picking your nose. When you succeed, treat yourself to the reward. [7] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Changing any behavior takes time and effort. You are likely to make mistakes along the way. Forgive yourself and move forward. With time, you will be able to stop picking your nose. [8] X Research source"
    },
    {
      "title": "Make them wash their hands every time they pick their nose.",
      "content": "Make them wash their hands every time they pick their nose. In addition to being sanitary, this technique will serve as a nose picking deterrent. If your child is constantly having to stop their play to wash their hands, it will make them think twice about picking their nose. That said, you have to be consistent, even in public. [9] X Research source"
    },
    {
      "title": "Occupy their fingers.",
      "content": "Occupy their fingers. Children will often pick their nose out of boredom. Make sure that they have an activity to do with their hands. Coloring and drawing are always good fall back activities. You can also keep a toy handy for them to fidget with any time they have to sit still. This will keep their hands occupied and away from their nose. [10] X Research source"
    },
    {
      "title": "See a doctor.",
      "content": "See a doctor. There could be an underlying medical cause for your child's nose picking. Take them to their pediatrician to discuss things such as allergies and dehydration. If the pediatrician sees any signs of such issues, they can advise you on how to deal with the problems. [11] X Research source"
    },
    {
      "title": "Ignore it.",
      "content": "Ignore it. Sometimes kids do things just for attention. If the pediatrician is not concerned about the nose picking and nothing seems to work, just ignore it. Over time, most children will lose interest in picking their nose and stop naturally once the attention is removed from it. [12] X Research source"
    },
    {
      "title": "Confide in a trusted friend or family member.",
      "content": "Confide in a trusted friend or family member. Telling someone you trust about your problem can help hold you accountable. If someone else knows that you are trying to stop, they can ask you about it and you will have to face whether you have stopped or not. This person can also weigh in on whether the problem is severe, or just a minor issue. [13] X Research source"
    },
    {
      "title": "Make a counseling appointment.",
      "content": "Make a counseling appointment. If you feel that there is an underlying emotional or psychological cause for picking your nose, you will need to see a mental health professional. You can get a referral from your doctor, or in some cases just make a counseling appointment. Discuss the nose picking with the professional and develop a treatment plan. [14] X Research source"
    },
    {
      "title": "Go see your doctor.",
      "content": "Go see your doctor. Picking your nose can sometimes lead to medical issues. If this happens, you will need to see your doctor immediately. Make an appointment to have your nose examined, and your doctor will prescribe the appropriate treatment. [15] X Research source For example, you could have scratches or openings in your nose from picking that get infected with bacteria."
    }
  ]
}