{
  "url": "https://www.wikihow.com/Treat-Shoulder-Tendonitis",
  "title": "How to Treat Shoulder Tendonitis",
  "steps": [
    {
      "title": "Avoid using your shoulder as much as possible.",
      "content": "Avoid using your shoulder as much as possible. Avoid doing any activities that aggravate your shoulder for a few days, but don’t avoid using your shoulder for too long. Contact your doctor if you are still having trouble moving your shoulder without pain after a few days. If you have to use the affected arm in the first few days, try to keep your shoulder still and restrict movements to your elbow. Do your best to keep objects close by and at lower heights so you don’t have to reach up to grab them. [1] X Research source For instance, if you have to use a fork with the affected arm, bend your elbow to bring the utensil to your mouth. Try not to raise or rotate your shoulder as you move your forearm. Don’t lift heavy objects, use the affected arm to bring your phone to your ear, or do any other activities that involve moving your sore shoulder."
    },
    {
      "title": "Apply ice for 20 minutes 3 to 4 times a day.",
      "content": "Apply ice for 20 minutes 3 to 4 times a day. Ice your shoulder in regular intervals and after activities that aggravate your pain. Wrap ice or an ice pack in a clean towel instead of applying it directly to your skin. Continue icing several times a day until your pain improves. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Take hot showers to relieve stiffness.",
      "content": "Take hot showers to relieve stiffness. Heat increases blood flow and might help you feel more comfortable. You can also try applying a warm compress or heating pad for 15 minutes 2 or 3 times per day. [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Ice is typically best for the first 3 days, since it helps keep swelling in check. Heat can worsen inflammation, but it relaxes muscles and promotes healing. Some people respond better to one or the other, so go with the option that provides the most relief. [4] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Maintain good posture when standing, sitting, and sleeping.",
      "content": "Maintain good posture when standing, sitting, and sleeping. Try to keep your shoulders, head, neck, and back in proper alignment at all times. When you sit and stand, avoid slouching and hold your head up straight. Do your best to sleep on the unaffected side or on your back. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Poor posture and sleeping on your bad shoulder can push the joint out of alignment and aggravate your irritated tendons."
    },
    {
      "title": "Take an over-the-counter pain reliever.",
      "content": "Take an over-the-counter pain reliever. An NSAID pain reliever, such as aspirin or ibuprofen, can help manage pain and inflammation. Take your medication according to the label’s instructions or ask your doctor or pharmacist to recommend a dosage. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Tell your doctor if you take an NSAID daily for more than a few days. Relying on pain relievers could be a sign you need other treatment options, like an immobilizing brace, cortisone shot, or physical therapist."
    },
    {
      "title": "Consult a doctor or physical therapist to avoid worsening your injury.",
      "content": "Consult a doctor or physical therapist to avoid worsening your injury. Stretching can help restore mobility and strengthen your tendons. However, it’s best to seek advice from a medical professional before you begin a stretching routine. Stretching before you’re ready can lead to further injury. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source A doctor or physical therapist can also demonstrate how to perform stretches properly."
    },
    {
      "title": "Don't try to stretch beyond your limits.",
      "content": "Don't try to stretch beyond your limits. Begin stretching only when you can move your shoulder with little to no pain. Move slowly and gently and hold the position when you feel a comfortable stretch. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The goal of stretching is to gradually increase your range of motion. If you can only raise your shoulder slightly, don’t try to push through pain to raise your arm over your head."
    },
    {
      "title": "Warm up for at least 5 to 10 minutes before stretching.",
      "content": "Warm up for at least 5 to 10 minutes before stretching. Walk briskly or jog lightly until you break a sweat. Getting your blood pumping will loosen your muscles and help prevent a stretching-related injury. [9] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source"
    },
    {
      "title": "Stretch your arm across your body for 10 to 15 seconds.",
      "content": "Stretch your arm across your body for 10 to 15 seconds. Raise the affected arm across your chest, and bring your elbow as close to the opposite shoulder as comfortably possible. Grasp the affected arm’s elbow with your opposite hand, and gently pull it to increase the stretch. [10] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Hold the stretch for 10 to 15 seconds, and do 5 to 10 repetitions. Raise your arm only as much as you comfortably can. Don’t get discouraged if you can't reach all the way across your chest. Your range of motion will improve with time."
    },
    {
      "title": "Reach your arms above your head for 10 to 15 seconds.",
      "content": "Reach your arms above your head for 10 to 15 seconds. Raise both arms above your head with your elbows facing outward. Extend your elbows so they’re straight and interlock your fingers with the backs of your hands facing your head. Hold the stretch for 10 to 15 seconds, lower your arms, then do a total of 5 to 10 repetitions. [11] X Research source If you can’t fully extend your arms straight above your head, bend your elbows and raise your arms as high as you comfortably can."
    },
    {
      "title": "Do 5 to 10 behind the back stretches.",
      "content": "Do 5 to 10 behind the back stretches. Hold an end of a towel or stick with your hand on your unaffected side. Bring the hand of your affected arm behind your back to the opposite hip with your elbow bent at a 90 degree angle. Raise your unaffected hand above and behind your head, and grasp the towel or stick behind your back with both hands. [12] X Research source Gently pull the towel or stick upward with your unaffected arm until you feel a comfortable stretch in the opposite shoulder. Hold the stretch for 10 to 15 seconds and do 5 to 10 repetitions. If you can’t bring your hand to the opposite hip, don’t use a stick or towel. Just reach toward your hip as far as you comfortably can."
    },
    {
      "title": "Lean into a corner to do external rotation stretches.",
      "content": "Lean into a corner to do external rotation stretches. Stand facing a corner with your feet shoulder-width apart. Bend your elbows at 90 degree angles, extend them to your sides, and raise them to shoulder level with your palms facing forward. Place your forearms on each wall so they support your weight, and lean toward the corner until you feel a comfortable stretch in your shoulders. [13] X Research source Stand far enough from the corner so you can lean with your arms spread wide. Your elbows should form a straight horizontal line from left to right. Hold the stretch for 10 to 15 seconds, and do 5 to 10 repetitions. If you’re just starting out, you might need to practice raising your elbows to shoulder height before using the corner to increase the stretch."
    },
    {
      "title": "See your doctor if your pain persists or worsens.",
      "content": "See your doctor if your pain persists or worsens. If your pain worsens or doesn’t start to improve after a few days, have your doctor perform a physical exam. They might order an MRI or ultrasound to diagnose tendonitis or to see if your condition has worsened. [14] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Tell your doctor when the pain started, how much pain you’re in, what activities you’ve been doing, and what medications you’ve taken."
    },
    {
      "title": "Get a referral to a physical therapist.",
      "content": "Get a referral to a physical therapist. The physical therapist will passively stretch you, or manually move your arm, to help restore your mobility. They’ll then guide you through active stretches and exercises to strengthen your tendons. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source The physical therapist will let you know which stretches will help the specific part of your shoulder that’s affected. They’ll also show you how to properly stretch and exercise at home."
    },
    {
      "title": "Ask your doctor about a cortisone injection.",
      "content": "Ask your doctor about a cortisone injection. If over-the-counter pain relievers haven’t been effective, your doctor might administer a cortisone shot to control pain and swelling. They’ll numb the area before the injection, so you won’t feel anything. After receiving the injection, you’ll need to avoid vigorous activity for 2 weeks. [16] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Ask your doctor if you need to stop taking medications, such as blood thinners, or make any dietary changes before you receive a cortisone injection. Many primary care physicians do cortisone injections in their offices, while others may refer you to a sports medicine or orthopedic surgeon for this."
    },
    {
      "title": "Discuss surgical repair, if necessary.",
      "content": "Discuss surgical repair, if necessary. If your tendonitis is severe or has progressed to a full tear, you might need surgery to repair the joint or remove damaged tissue. Most people go home around 4 hours after surgery, and recovery usually takes 1 to 6 months. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source You’ll most likely need to wear a sling for at least a week after surgery. Seeing a physical therapist for a few months after surgery will help you regain mobility and strength. You might not regain full strength after tendonitis surgery, but it should relieve your pain."
    }
  ]
}