{
  "url": "https://www.wikihow.com/Write-a-Research-Introduction",
  "title": "How to Write a Research Introduction",
  "steps": [
    {
      "title": "Announce your research topic.",
      "content": "Announce your research topic. You can start your introduction with a few sentences which announce the topic of your paper and give an indication of the kind of research questions you will be asking. This is a good way to introduce your readers to your topic and pique their interest. The first few sentences should act as an indication of a broader problem which you will then focus in on more closely in the rest of your introduction, leading to your specific research questions. [1] X Research source In scientific papers this is sometimes known as an \"inverted triangle\", where you start with the broadest material at the start, before zooming in on the specifics. [2] X Research source The sentence \"Throughout the 20th century, our views of life on other planets have drastically changed\" introduces a topic, but does so in broad terms. It provides the reader with an indication of the content of the essay and encourages them to read on."
    },
    {
      "title": "Consider referring to key words.",
      "content": "Consider referring to key words. When you write a research paper for publication you will be required to submit it along with a series of key words which give a quick indication of the areas of research you are addressing.You may also have certain key words in your title which you want to establish and emphasise in your introduction. [3] X Research source For example, if you were writing a paper about the behaviour of mice when exposed to a particular substance, you would include the word \"mice\", and the scientific name of the relevant compound in the first sentences. If you were writing a history paper about the impact of the First World War on gender relations in Britain, you should mention those key words in your first few lines."
    },
    {
      "title": "Define any key terms or concepts.",
      "content": "Define any key terms or concepts. It may be necessary for you to clarify any key terms or concepts early on in your introduction . You need to express yourself clearly throughout your paper so if you leave an unfamiliar term or concept unexplained you risk your readers not having a clear understanding of your argument. [4] X Research source This is especially important if you are attempting to develop a new conceptualization that uses language and terminology your readers may be unfamiliar with."
    },
    {
      "title": "Introduce the topic through an anecdote or quotation.",
      "content": "Introduce the topic through an anecdote or quotation. If you are writing a humanities or social science essay you can find more literary ways to begin your introduction and announce the topic of your paper. It is common for humanities essays in particular to begin with an illustrative anecdote or quotation that points to the topic of the research. This is a variation of the \"inverted triangle\" technique and can generate interest in your paper in a more imaginative way and demonstrate an engaging writing style. [5] X Research source If you use an anecdote ensure that is short and highly relevant for your research. It has to function in the same way as an alternative opening, namely to announce the topic of your research paper to your reader. For example, if you were writing a sociology paper about re-offending rates among young offenders, you could include a brief story of one person whose story reflects and introduces your topic. This kind of approach is generally not appropriate for the introduction to a natural or physical sciences research paper where the writing conventions are different."
    },
    {
      "title": "Include a brief literature review.",
      "content": "Include a brief literature review. Depending on the overall length of your paper, it will be necessary to include a review of the existing literature already published in the field. This is an important element of your paper which demonstrates that you have a strong knowledge and understanding of the debates and scholarship in your area. You should aim to indicate that you have a broad knowledge, but that you are engaging in the specific debates most relevant to your own research. [6] X Research source It is important to be concise in the introduction, so provide an overview on recent developments in the primary research rather than a lengthy discussion. You can follow the \"inverted triangle\" principle to focus in from the broader themes to those to which you are making a direct contribution with your paper. A strong literature review presents important background information to your own research and indicates the importance of the field."
    },
    {
      "title": "Use the literature to focus in on your contribution.",
      "content": "Use the literature to focus in on your contribution. A concise but comprehensive literature review can be a very effective way to frame your own research paper. As you develop your introduction, you can move from the literature to focus in on your own work and its position relevant to the broader scholarship. By making clear reference to existing work you can demonstrate explicitly the specific contribution you are making to move the field forward. You can identify a gap in the existing scholarship and explain how you are addressing it and moving understanding forward."
    },
    {
      "title": "Elaborate on the rationale of your paper.",
      "content": "Elaborate on the rationale of your paper. Once you have framed your work within a broader context you can elaborate more fully on the rationale of your research and its particular strengths and importance. The rationale should clearly and concisely indicate the value of your paper and its contribution to the field. Try to go beyond saying that you are filling a gap in the scholarship and emphasise the positive contribution of your work. [7] X Research source For example, if you are writing a scientific paper you could stress the merits of the experimental approach or models you have used. Stress what is novel in your research and the significance of your new approach, but don't give too much detail in the introduction. A stated rationale could be something like: \"the study evaluates the previously unknown anti-inflammatory effects of a topical compound in order to evaluate its potential clinical uses\"."
    },
    {
      "title": "State your research questions.",
      "content": "State your research questions. Once you have indicated where your research sits in the field and the general rationale for your paper, you can specify the research questions the paper addresses. The literature review and rationale frames your research and introduces your research question. This question should be developed fluently from the earlier parts of the introduction and shouldn't come as a surprise to the reader. [8] X Research source The research question or questions generally come towards the end of the introduction, and should be concise and closely focused. The research question might recall some of the key words established in the first few sentences and the title of your paper. An example of a research question could be \"what were the consequences of the North American Free Trade Agreement on the Mexican export economy?\" This could be honed further to be specific by referring to a particular element of the Free Trade Agreement and the impact on a particular industry in Mexico, such as clothing manufacture. A good research question should shape a problem into a testable hypothesis."
    },
    {
      "title": "Indicate your hypothesis.",
      "content": "Indicate your hypothesis. After you have specified your research questions you need to give a clear and concise articulation of your hypothesis, or your thesis statement. This is a statement which indicates your essay will make a specific contribution and have a clear result rather than just covering a broader topic. You should make it clear briefly how you came to this hypothesis in a way which references your discussion of the existing literature. [9] X Research source If possible try to avoid using the word \"hypothesis\" and rather make this implicit in your writing. This can make your writing appear less formulaic. In a scientific paper, giving a clear one-sentence overview of your results and their relation to your hypothesis makes the information clear and accessible. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source An example of a hypothesis could be \"mice deprived of food for the duration of the study were expected to become more lethargic than those fed normally\"."
    },
    {
      "title": "Outline the structure of your paper.",
      "content": "Outline the structure of your paper. In some cases the final part of an introduction to a research paper will be a few lines that provide an overview of the structure of the body of the paper. [11] X Research source This could simply give an outline of how you have organised the paper and how it is broken down into sections. This is not always necessary and you should pay attention to the writing conventions in your discipline. In a natural sciences paper, for example, there is a fairly rigid structure which you will be following. A humanities or social science paper will most likely present more opportunities to deviate in how you structure your paper."
    }
  ]
}