{
  "url": "https://www.wikihow.com/Wash-a-Dry-Clean-Only-Coat-at-Home",
  "title": "How to Dry Clean a Coat at Home: An Expert Guide",
  "steps": [
    {
      "title": "Look for specific instructions on your coat’s care label.",
      "content": "Look for specific instructions on your coat’s care label. When it comes to washing clothes, Ali stresses, “First things first, always read the special care instruction label.” Check the inner lining of your coat to find the care label . See if this tag says “dry clean” or “dry clean only.\" Generally, clothing manufacturers use “dry clean” as a catchall suggestion for more delicate garments, while “dry clean only” indicates that the coat is made with sensitive materials that could be permanently damaged when machine washed. [1] X Research source On clothing care labels, dry cleaning is signified with an open circle. Depending on the garment, you might see the letters A, P, or F within the circle, which provide detailed cleaning instructions to a professional cleaner. Warning: If your coat says “dry clean only ,” there is a high chance that submerging it in water could damage it. Make sure you want to take that risk."
    },
    {
      "title": "Read the care tag to determine your coat’s material.",
      "content": "Read the care tag to determine your coat’s material. Continue reading the care label to get a detailed description of your coat’s fabric. You may need to check the backside of the tag to find this information. Note that certain types of coats, like down or faux fur, can be machine washed on a delicate cycle, while thicker materials like wool are better off hand-washed . [2] X Research source Common fabrics like linen, polyester , and cotton can sometimes be machine washed, even if the label says “dry clean only.” This can still be a risk, however. Sensitive fabrics, such as silk and wool, need to be hand-washed. [3] X Research source"
    },
    {
      "title": "Spot test a small section of your coat with a cotton swab and detergent.",
      "content": "Spot test a small section of your coat with a cotton swab and detergent. Dip a Q-tip into a few drops of water mixed with mild detergent. Lightly rub the swab over a tiny, pea-sized section of your coat. Examine the swab carefully to see if any dye bleeds onto the cotton tip. If it does, your coat is too sensitive to machine or hand wash and needs to be cleaned by a professional. If the swab doesn’t soak up any dye, you should be able to wash the coat with water and mild detergent. [4] X Research source"
    },
    {
      "title": "Take heavily stained, embellished, or delicate fabrics to the dry cleaner to be safe.",
      "content": "Take heavily stained, embellished, or delicate fabrics to the dry cleaner to be safe. If your coat is made with polyamide or viscose, or crafted with pleats, sequins, shoulder pads, or other embellishments, it's best to let a professional handle the cleaning. Long-lasting or grease-based stains are also risky to treat at home and are best handled by a dry cleaner. [5] X Research source For instance, if you spilled margarine or some type of oil on your coat, it's best to send it to a professional for cleaning. Ali explains why it’s better to dry clean expensive or delicate clothes: “Dry cleaning doesn’t harm the individual fibers of a garment. When you wash things at home, over time, you’ll start noticing that they’re fading and the quality of the garment is deteriorating. That’s primarily due to the water temperature and the heat from the dryer.”"
    },
    {
      "title": "Sponge over any light, non-greasy stains with cool water or stain remover.",
      "content": "Sponge over any light, non-greasy stains with cool water or stain remover. If your coat has a light surface stain, dip your sponge into a bowl of cool water and lightly press it over the stained area. If this doesn't remove the stain, coat the sponge with a pea-sized amount of stain-removing solution, then massage the product into the spot. [6] X Research source Once the stain is gone, dip the opposite side of the sponge in cool water and dab it over the same spot to rinse away any leftover stain remover. If the stain is still there, you may want to send your coat to a professional for cleaning. Ali advises, “Make sure you use the right product to remove the stains. Most of the commercial products are not meant for fancier materials.” Always check the label on your stain remover before rubbing it into your coat. This method only applies to non-greasy stains like soda or wine. If your coat has a greasy spot or another tough stain that's set into the fabric, take your coat to a dry cleaner instead."
    },
    {
      "title": "Turn your coat inside-out before washing it.",
      "content": "Turn your coat inside-out before washing it. Tuck the sleeves inward, so the outside of your garment isn’t as exposed to the washing cycle. [7] X Research source Additionally, check that there are no loose items in your pockets that could interfere with the washing process. Remember: materials like linen, cotton, polyester, and nylon can be machine washed, while more delicate fabrics like wool and silk should always be hand-washed."
    },
    {
      "title": "Slide the coat into a mesh laundry bag and put it in your machine.",
      "content": "Slide the coat into a mesh laundry bag and put it in your machine. Arrange the inside-out coat in a large laundry bag so the item isn’t tossed around by the washing drum. [8] X Research source Close the bag and, if necessary, use safety pins to pin it tightly around the coat so that the coat stays put throughout the washing cycle. Then, place the bag in the washing machine by itself for its own specialized cycle. The laundry bag cushions the coat throughout the wash cycle."
    },
    {
      "title": "Add 1 teaspoon (4.9 mL) of mild detergent to the washing machine.",
      "content": "Add 1 teaspoon (4.9 mL) of mild detergent to the washing machine. Pour the laundry detergent into the proper section of your washing machine. Double-check that the detergent is labeled as “gentle” or “sensitive,” as you don’t want to damage your clothes with a concentrated cleaner. [9] X Research source"
    },
    {
      "title": "Set your machine to a delicate wash cycle with cold water.",
      "content": "Set your machine to a delicate wash cycle with cold water. Check the settings on your machine and make sure that your coat will be washed and rinsed with cool or cold water. Since you don’t want to damage or fray any of the material in the machine, set the washer to a delicate or low-spin cycle. [10] X Research source Don’t worry about setting a specific amount of time for the cycle, as most washing machines will be programmed with a preset time. Ali says, “Never use hot water” when washing dry-clean-only clothes, and “Always try to either fluff dry or air dry.” Hot water and the heat from a dryer can damage the clothes."
    },
    {
      "title": "Remove the coat and lay it on a flat surface to air-dry completely.",
      "content": "Remove the coat and lay it on a flat surface to air-dry completely. Once the wash cycle ends, remove the mesh bag from the washing drum. Unzip or loosen the bag to grab your damp, freshly-washed coat. Next, arrange your garment onto a flat clothing rack so the coat can dry fully and evenly. Do not put the coat in the dryer, as this may damage it. [11] X Research source If you’re in a rush to wear the coat again, check the material periodically until it feels dry to the touch. If you must dry your clothes in the dryer, Ali says, “Put it on the very lowest setting possible. If it’s just one article of clothing, just dry for about 5-10, maybe 15, minutes and see where the garment is at. Try to dry it on a low setting, and then air dry the remainder of it after you’ve gotten most of the moisture out.”"
    },
    {
      "title": "Fill a large basin or tub halfway with cool tap water.",
      "content": "Fill a large basin or tub halfway with cool tap water. Find a bucket, basin, tub, or other container that’s large enough to comfortably hold and soak your coat. Next, fill up this container halfway or so with cool tap water. Try not to fill the basin or tub up all the way, or it might overflow when you put your coat in. [12] X Research source"
    },
    {
      "title": "Add 1 tsp (4.9 mL) of mild detergent to the water.",
      "content": "Add 1 tsp (4.9 mL) of mild detergent to the water. Use your hands or a larger stirring tool to mix the detergent into the water until you see suds. Try not to pour more than 1 teaspoon (4.9 mL) into the tub, as you want the washing process to be as gentle as possible. [13] X Research source Check that the detergent is labeled with “gentle” or “mild.” Wear rubber gloves if you plan on stirring the sudsy water by hand. For sensitive materials like wool and silk, use specialized detergents designed specifically for those materials."
    },
    {
      "title": "Pre-treat the stain with a stain remover.",
      "content": "Pre-treat the stain with a stain remover. Pour a pea-sized amount of stain remover onto a sponge, then dab the solution onto your coat, focusing especially on the sleeves and collar. If you have stains on the inside of your coat, turn it inside-out and rub over the problem spots, placing a particular focus on the underarm area. Don't worry about rinsing or washing off the stain remover unless the product label instructs you to do so. [14] X Research source Always check the label of your stain-removing product to make sure that it won't damage your coat's fabric in any way. To be safe, look for specialized stain removers designed for delicate materials like silk or wool. If your coat is stained with something greasy, send it to a dry cleaner."
    },
    {
      "title": "Submerge the coat in the tub of water for 20-30 minutes.",
      "content": "Submerge the coat in the tub of water for 20-30 minutes. Place the coat in the water, making sure the entire garment is submerged. Use both hands to move the garment around, ensuring that the front, back, and sleeves of the coat are drenched. Once the item is fully soaked, let it rest in the basin for 20-30 minutes. [15] X Research source You don’t have to stir or flip the garment over at any point. Instead, leave it to sit and soak for at least 30 minutes or until you think the coat is sufficiently clean. If the stain doesn't wash away, consider taking your coat to a dry cleaner instead."
    },
    {
      "title": "Empty the container and submerge the coat in clean water.",
      "content": "Empty the container and submerge the coat in clean water. Pour or drain out the sudsy water, then fill the basin back up with clean, cool water until the coat is fully submerged again. Life and lower your coat out of the basin to get rid of any obvious suds. Continue dipping your coat until it looks clean and is only dripping clean, clear water. [16] X Research source"
    },
    {
      "title": "Roll the garment in a dry, clean towel to soak up any excess water.",
      "content": "Roll the garment in a dry, clean towel to soak up any excess water. Lay a large, dry towel out on a flat surface and arrange your coat on top of it. Pinch and fold one end of the towel, then roll both the towel and the coat lengthwise into a tight coil to squeeze out any excess water. Unroll the towel and repeat the coiling process until the coat is no longer dripping wet. [17] X Research source To prevent water from spilling everywhere, do this near a tub or sink."
    },
    {
      "title": "Place your coat on a flat surface to air-dry.",
      "content": "Place your coat on a flat surface to air-dry. Take your damp garment and drape it horizontally on a clothing rack or another flat surface. Make sure that the sleeves are splayed to the side and that the coat is laid out in a single flat layer. Wait at least a day for the coat to dry completely, or until the item is fully dry to the touch. [18] X Research source"
    },
    {
      "title": "Pretreat stains with the wipes in your dry-cleaning kit (optional).",
      "content": "Pretreat stains with the wipes in your dry-cleaning kit (optional). Check your dry-cleaning kit’s instructions to see if any stain-treating towelettes are included. If they are, follow the instructions to pretreat any noticeable stains on the coat. If your coat isn’t visibly dirty or if the kit doesn’t include towelettes, it’s okay to skip this step. [19] X Research source Before you begin, check the instructions to see if the dry cleaning sheets work well with your coat’s fabric type. If the material isn’t listed on the box or kit instructions, then you might want to contact a professional dry cleaner. When it comes to removing stains, Ali says, “A lot of times, friction does most of the work. So if you’re able to get in there and scrub using very short, rapid strokes, you can get a good amount of stain out.”"
    },
    {
      "title": "Stick your coat in the dryer with a dry cleaning sheet.",
      "content": "Stick your coat in the dryer with a dry cleaning sheet. Place your coat in the tumble dryer, along with one dry cleaning sheet. If you need to clean more than one coat, read the instructions on the kit to see how many garments a single sheet can clean. If your coat is especially bulky, consider washing it by itself. [20] X Research source Some sheets can wash up to 4 garments at once."
    },
    {
      "title": "Run the dryer for 15-20 minutes on medium heat.",
      "content": "Run the dryer for 15-20 minutes on medium heat. For specific guidance, read the kit’s instructions to see what the recommended time is for your garment. If your coat is especially dirty, check the instructions on the dry cleaning sheet package to see how long your garment can be kept in the dryer. Depending on the brand, you may be able to dry your coat for up to 30 minutes. [21] X Research source"
    },
    {
      "title": "Hang your coat up immediately after the drying cycle ends.",
      "content": "Hang your coat up immediately after the drying cycle ends. Take your coat out of the dryer immediately, so it doesn’t develop wrinkles. Toss out the old dry cleaning sheet, then use a traditional clothes hanger to store your coat. [22] X Research source"
    },
    {
      "title": "Dry clean your coat with baking soda and a steamer.",
      "content": "Dry clean your coat with baking soda and a steamer. If you’re worried about putting your coat in water, hang it in a well-ventilated area and sprinkle a thin layer of baking soda over it to absorb odors. Leave the garment to air out for at least a few hours or overnight, then shake off the baking soda. Gently steam the coat with a handheld garment steamer , being careful not to get it too wet. [23] X Research source Allow the coat to air dry in a well-ventilated area, then store it in a garment bag to protect it from dust and odors."
    },
    {
      "title": "Spot treat stains with vinegar.",
      "content": "Spot treat stains with vinegar. If your dry-clean-only coat has visible stains, try to treat them individually. Mix a solution of equal parts white vinegar and water, and dip a clean cloth or sponge into the mixture. Wring it out so that it’s damp, not wet, then gently blot and dab at the stain. Work from the outside of the stain inward, being careful not to scrub, as this can damage the fabric. When you’re done, allow the coat to air dry. [24] X Research source"
    },
    {
      "title": "How do I refresh my coat without washing it?",
      "content": "How do I refresh my coat without washing it? To keep your coat looking its best, steam clean it to remove wrinkles, and use a clothing brush to remove any lint, dust, or other debris. To remove odors, try hanging your coat outside on a sunny day or spritzing it with a fabric freshener. [25] X Research source"
    },
    {
      "title": "Do dry cleaning kits actually work?",
      "content": "Do dry cleaning kits actually work? Home dry cleaning kits can help freshen clothes and remove light or water-based stains. However, if your garment is particularly soiled, a dry cleaning kit may not be as effective. Some at-home dry cleaners can also damage certain fabrics, like leather, velvet, and silk, so be sure to read the instructions carefully before using them. [26] X Research source"
    },
    {
      "title": "What happens if you put dry-clean-only clothes in the washing machine?",
      "content": "What happens if you put dry-clean-only clothes in the washing machine? Some dry-clean garments can be washed in the washing machine if you treat them as delicates . However, this varies depending on the fabric. Materials that are dry-clean- only should not be put in the washing machine at all, as doing so will cause them to shrink, bleed, or otherwise be damaged. [27] X Research source"
    }
  ]
}