{
  "url": "https://www.wikihow.com/Teach-Your-Dog-Basic-Commands",
  "title": "How to Teach Your Dog Basic Commands",
  "steps": [
    {
      "title": "Begin training by teaching your dog how to sit on command.",
      "content": "Begin training by teaching your dog how to sit on command. Sitting is the dog form of politeness. It is a natural action. It shows that a dog is not aggressive and that she or he is willing to wait. [1] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source As you enforce the 'sit' command, the dog will learn that when it wants something, or you are busy, sitting and waiting is the right thing to do. The goal is for the dog to learn that when you give the 'sit' command, it is time to pay attention or calm down. Stand up right in front of your dog. You want to exude calm but assertive energy. Get your dog's attention, looking it right in the eye. As you say \"[Dog's name], sit,\" hold a treat above the dog's nose. In order to see the treat, the dog will need its head up, which will make its bum go down. If it doesn't go down try (GENTLY) pushing your dogs tush down and then say \"sit\""
    },
    {
      "title": "Give positive praise when your dog sits.",
      "content": "Give positive praise when your dog sits. As soon as she or he sits, say \"Yes!\" and deliver the treat. [2] X Expert Source Jessica Powell Certified Professional Dog Trainer Expert Interview. 5 October 2021. The goal is for the dog to connect the action, phrase, or word with the treat and the praise."
    },
    {
      "title": "Replace the treat with hand signals.",
      "content": "Replace the treat with hand signals. [3] X Expert Source Jessica Powell Certified Professional Dog Trainer Expert Interview. 5 October 2021. As your dog learns the verbal command, stop assisting the action and begin to use an accompanying hand signal. A common one begins by placing your flat hand over and in front of the dog's head. While saying \"Sit\", pull your hand up into a loose fist, or lift it in a J motion to end with your palm facing up."
    },
    {
      "title": "Repeat until your dog responds to your command every time.",
      "content": "Repeat until your dog responds to your command every time. [4] X Expert Source Jessica Powell Certified Professional Dog Trainer Expert Interview. 5 October 2021. This can take some time, especially if you are training an adult dog or a stubborn dog. However, don't give up! It is important to the relationship between you and your dog that it follows your lead. This will help you live together and will actually keep your dog safer."
    },
    {
      "title": "Teach your dog to \"stay.\"",
      "content": "Teach your dog to \"stay.\" There are some commands that can literally save your dog's life and the \"stay\" command is one of them. Keeping your dog out of dangerous situations, in addition to simply keeping it out of trouble, can be achieved more easily when you can train your dog to stay put. [5] X Research source A pup has an instinctive understanding of how to stay when being threatened and the mother uses a very distinct \"stay\" command as well. This instinctive and early training should help you to train your dog to follow your command to stay. [6] X Research source"
    },
    {
      "title": "Start your training with your dog in the \"sit\" position.",
      "content": "Start your training with your dog in the \"sit\" position. When your dog is sitting, stand so that he or she is on your left side facing the same direction. Later this will be referred to as the 'place' position."
    },
    {
      "title": "Hold the dog's collar and say \"[dog's name], stay!\"",
      "content": "Hold the dog's collar and say \"[dog's name], stay!\" You should do this while placing your open hand in front of, but not touching, your dog's face. The tips of your fingers should be pointing up and your palm should be facing your dog. Wait two seconds. If the dog stays in place, say \"Yes!\" and give a reward. If she gets up, say \"Oops!\" and start again but if your dog thinks that is a punishment give it a treat and try again. Begin with \"sit\" and proceed again to \"stay\". Repeat this until your dog stays in place for at least ten seconds and then praise it. This means you may need to repeat this whole sequence several times."
    },
    {
      "title": "Gradually increase the amount of time you have your dog stay.",
      "content": "Gradually increase the amount of time you have your dog stay. When your dog learns this command well, you can start to increase the length of time while gradually moving away during the stay. If your dog gets up, go all the way back to sitting and repeat the sequence, until you can move around freely during the stay. [7] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You should also have a certain command to release your dog from the stay such as \"okay!\" or \"come\" or simply say your dogs name. This way, your dog knows when it can move."
    },
    {
      "title": "Teach your dog to lay down.",
      "content": "Teach your dog to lay down. \"Down\" is usually combined with \"stay,\" and is meant to be a stronger command. Down actually stops whatever action was happening before the command, so it is useful in controlling behavior."
    },
    {
      "title": "Start again with your dog in a 'sit' position.",
      "content": "Start again with your dog in a 'sit' position. As you say \"[dog's name], down!,\" hold your left hand above your dog's head, palm toward the floor. With a treat in your right hand, lower your hand towards the floor slowly and relatively close to the dog's body if your dog does not complete the task gently pull out his front legs until hes on the floor then give a treat."
    },
    {
      "title": "Give your dog positive reinforcement for completing the command.",
      "content": "Give your dog positive reinforcement for completing the command. Once both bum and elbows are on the floor, say \"Yes!\" and deliver the treat. This will make an association in the dog's mind between the action and a reward. [8] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Repeat this sequence several times.",
      "content": "Repeat this sequence several times. Repetition is key to your dog learning, and following, the command. The goal is for your dog to follow your command no matter what it is doing when you give it. That way, if your dog is doing something naughty, you can stop the behavior quickly and effectively. [9] X Research source Like training other commands, if the dog does not follow the command or does something different, start again from the beginning. Put the dog in sitting position once again and start from the beginning."
    },
    {
      "title": "Teach your dog to come when you call it.",
      "content": "Teach your dog to come when you call it. The \"come\" command is also known as \"recall.\" Like training for other basic commands, begin with your dog in \"sit\" position. [10] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Gently pull the dog towards you while saying \"[dog's name], come!\"",
      "content": "Gently pull the dog towards you while saying \"[dog's name], come!\" You should do this in a more encouraging voice than you use for other commands, as you want the dog to want to come to you. Accompany the command with a gesture to show the dog what you want."
    },
    {
      "title": "Lure your dog to come with a treat.",
      "content": "Lure your dog to come with a treat. Once you have shown your dog how to come and what command you will give, place a piece of dry dog food at your feet and point to it. After a very short time, the gesture of pointing at the floor in front of you should be enough. Later only the command or the gesture will be needed."
    },
    {
      "title": "Reinforce the action with praise.",
      "content": "Reinforce the action with praise. When your dog reaches you, praise it using the phrase \"Good come!\" Give him or her a nice pet on the head, showing the dog that you are appreciative of what it just did for you. [11] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Practice the command at a variety of times and in a variety of locations.",
      "content": "Practice the command at a variety of times and in a variety of locations. When interacting with your pet, take opportunities to call it from across the room by using its name and saying \"Come!\" and praising it when it gets there. This will make your dog familiar with the command."
    },
    {
      "title": "Teach your dog to \"heel.\"",
      "content": "Teach your dog to \"heel.\" This command is often the most complicated one to teach. [12] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source However, most dogs can learn it if you are consistent with your training. Teaching your canine companion to heel will save your back, your shoulders, your dog's neck, and dignity for both of you (although, dignity may be low on the priority list for your dog). Your dog will probably naturally want to jog at a canter and sniff and veer off in many directions. You need to show him or her that there is a time for exploring and a time not to."
    },
    {
      "title": "Put your dog in sitting position.",
      "content": "Put your dog in sitting position. Using the regular walking lead, put your dog in a \"sit\" position beside your left leg, facing the same direction as you. This is known as the \"place\" position. Always use the left side to avoid confusing the dog."
    },
    {
      "title": "Tell your dog to \"heel.\"",
      "content": "Tell your dog to \"heel.\" Say \"[dog's name], heel!\" while stepping forward with your left foot. Starting with the left foot will become a signal that it is time to move forward. Your dog may either resist or hurry past you. In either case give a gentle pull and repeat the command \"heel.\""
    },
    {
      "title": "Instruct the dog to stay by your side.",
      "content": "Instruct the dog to stay by your side. If he or she strays too far off to the side, pat your leg and say \"Keep with me!\" or \"Over here!\" or another short phrase. Always say the same phrase to mean that particular thing."
    },
    {
      "title": "Correct wrong behavior.",
      "content": "Correct wrong behavior. If the dog moves out ahead, say \"No, [dog's name], heel\" in a calm voice. If necessary, tug on the lead. When you stop, always stop on the left foot and say \"[dog's name], sit.\" If your dog moves ahead again, gently pull or physically place him or her beside your left leg using the \"sit\" command. [13] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If things get a little to out of control, stop and place the dog in a sit position at your side once again, praise him or her, and start over. You should always adjust the dog to your position, not adjust your position to his. (if you adjust your position to his, he will eventually have his human well trained to obey him) You should get your dog used to not feeling any tension on the lead unless you are making a correction, or the dog will get into the habit of pulling constantly. Make your corrections by voice and gesture and only use the lead if it isn't listening."
    },
    {
      "title": "Give praise when the dog heels.",
      "content": "Give praise when the dog heels. You may gently praise your dog while he or she is heeling well, but keep it toned down so as not to distract it. Once it is obeying the spoken commands consistently, remain silent and only use the spoken commands for correction. The length of time to learn is individual so don't be in a hurry to move things along."
    },
    {
      "title": "Teach the dog to sit when you stop.",
      "content": "Teach the dog to sit when you stop. When you are ready to stop, you should stop on your left foot and say \"[dog's name],sit.\" After a few repetitions you should no longer need to use the sit command. Your dog will come to know that stopping on the left foot is the signal for him or her to stop and sit."
    },
    {
      "title": "Practice the command solely through body language.",
      "content": "Practice the command solely through body language. When your dog is consistently obeying the \"heel\" command properly, start unexpectedly starting of with the left foot and stopping without verbal commands or hand signals. Also, when your dog is in the \"place\" position, occasionally step off with the right. Your dog will want to start with you, so you use the \"stay\" command and walk around him back to the \"place\" position. Alternate stepping off with the left and using the heel command and then stepping off with the right and using the stay command. After a while you can advance to randomly stepping of with either foot and reinforcing the appropriate \"heel\" or \"stay\" behavior. When you and your dog has learned this well, you will be able to function smoothly as a team no matter where you are."
    }
  ]
}