{
  "url": "https://www.wikihow.com/Take-a-Screenshot-in-Microsoft-Windows",
  "title": "How to Take a Screenshot on a Windows PC: 8 Simple Tricks",
  "steps": [
    {
      "title": "Go to the screen that you want to capture.",
      "content": "Go to the screen that you want to capture. When you screenshot your entire screen, everything that's open will be captured in your screenshot. Be sure to close any windows you don't want open. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source This method will quickly capture everything on your screen and save the image to your PC. Once you've saved the screenshot, you can edit it or share it with anyone."
    },
    {
      "title": "Find the ⎙ Print Screen key on your keyboard.",
      "content": "Find the ⎙ Print Screen key on your keyboard. The Print Screen key is often found on the upper-right side of the keyboard, not counting the numeric keypad. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The Print Screen key will usually be abbreviated to \"PrtSc\" or something similar. If your keyboard doesn't have a Print Screen key, use the Snipping Tool on Windows 10 or Windows 11 . [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Take your screenshot.",
      "content": "Take your screenshot. You have two options for capturing your entire screen: Instantly save the screenshot as an image: Press the Windows key and the PrtSc keys at the same time. This saves your screenshot as a PNG file to the Screenshots folder in your Pictures folder. On most keyboards, the Windows key is located in the bottom left corner on the same row as the spacebar. Upon pressing this key combination, the screen may dim briefly to indicate that the screenshot was captured. Copy the screenshot so you can paste it: Press the Print Screen key alone to copy the screen to your PC's clipboard. You can then paste the copied screenshot into a document, email message, or social media post by right-clicking the desired location and selecting Paste . On some Windows laptops, you will need to hold down the Fn key as you press the Print Screen key."
    },
    {
      "title": "Find the screenshot.",
      "content": "Find the screenshot. If you used Windows key + Print Screen to capture the screenshot, follow these steps to find the file : [4] X Research source Open File Explorer by pressing Windows key + E on your keyboard. If you see a folder called Pictures in the left panel, click it. If not, click This PC , and then double-click the Pictures folder. Double-click the Screenshots folder. Each screenshot you take is labeled \"Screenshot (number).\" Depending on the version of Windows you're using, the file name will either end with a number that corresponds with the number of screenshots you've taken, or the date and time at which you captured the screenshot. If you can't find your screenshot, try using the Snipping Tool instead. See Snipping Tool (Windows 11) or Snipping Tool (Windows 10 and earlier) ."
    },
    {
      "title": "Click the window you want to capture.",
      "content": "Click the window you want to capture. If you only want to screenshot a single window, click anywhere on the window you want to capture. Make sure the window is in front of all your other windows."
    },
    {
      "title": "Hold down Alt and press ⎙ PrtScr.",
      "content": "Hold down Alt and press ⎙ PrtScr . This copies an image of the window to the clipboard. You will not see any confirmation that the screenshot has been taken. On some Windows keyboards, you will need to also hold down the Fn key when you use print screen . If your keyboard doesn't have a Print Screen key, use the Snipping Tool on Windows 10 or Windows 11 ."
    },
    {
      "title": "Open Paint.",
      "content": "Open Paint. This program comes installed on all Windows computers. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source To open it: Press the Windows key and type paint . Click Paint ."
    },
    {
      "title": "Press Ctrl+V to paste the screenshot.",
      "content": "Press Ctrl + V to paste the screenshot. You will now see your one-window screenshot in the Paint window. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can also paste the screenshot into other programs, such as Word, or the body of an email. Open the program you want to paste the image into and press Ctrl + V . Alternatively, you can paste the screenshot into any open document, email, or other area using this shortcut. If your screenshot doesn't appear, try using the Snipping Tool instead. See Snipping Tool (Windows 11) or Snipping Tool (Windows 10 and earlier) . [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Save your screenshot as an image.",
      "content": "Save your screenshot as an image. Click File , click Save , enter a file name, click a location on the left side of the page, and click Save . You can change the screenshot's file type by clicking the \"Save as type\" drop-down box at the bottom of the window and then clicking a different format (e.g., JPEG ) in the drop-down menu."
    },
    {
      "title": "Open the Snipping Tool.",
      "content": "Open the Snipping Tool. The Windows 11 Snipping Tool makes it incredibly easy to capture and edit full-screen, partial-screen, and single-window screenshots. To access Snipping Tool, press the Windows key , type snip , and click Snipping Tool . [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select a screenshot mode.",
      "content": "Select a screenshot mode. Click the Snipping Mode menu (the square with a plus (+) at its bottom-right corner), then choose an option: Rectangle: Let's you capture any part of the screen by drawing a rectangle around an area. Window: Allows you to capture an individual window without getting anything else in the screenshot. Full screen: Captures everything on the screen. Freeform: Lets you draw any shape around an area of the screen to take a screenshot."
    },
    {
      "title": "Click + New.",
      "content": "Click + New . It's at the top-left corner of Snipping Tool. [9] X Research source"
    },
    {
      "title": "Capture your screenshot.",
      "content": "Capture your screenshot. [10] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source In Rectangle mode, click and drag a rectangle around the desired area to instantly capture a screenshot. In Window mode, click the window you want to capture to take the screenshot. In Full screen mode, the entire screen will instantly capture. In Freeform mode, draw an outline around the part of the screen you want to capture. You can also delay the screenshot capture by a few seconds using the stopwatch menu at the top of Snipping Tool."
    },
    {
      "title": "Click the Snipping Tool icon in the taskbar to view your screenshot.",
      "content": "Click the Snipping Tool icon in the taskbar to view your screenshot. A preview of the screenshot should appear on its own. If it doesn't, click the scissors in the toolbar at the bottom of the screen to preview it now."
    },
    {
      "title": "Edit your screenshot (optional).",
      "content": "Edit your screenshot (optional). Use the tools at the top of the window to edit your screenshot if you'd like. Hover your cursor over the icons to see what each tool does. To crop a screenshot, select the Crop tool, then select the part of the screenshot you want to keep. Use the pen tool to write or draw on the screenshot. This is helpful if you need to redact something. You can use the highlighter to bring attention to a certain area, or the eraser tool to erase any additions you've made. Use the Shapes tool to draw shapes, like a circle around text or an arrow. To edit your screenshot further, click Edit in Paint at the top-right corner to open it in the Paint app."
    },
    {
      "title": "Save your screenshot.",
      "content": "Save your screenshot. Now that you've taken a screenshot, you can save it easily: [11] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Click the disk icon at the top. Select a location to save your screenshot. Name your file and click Save . Alternatively, click the Copy icon at the top-right to copy the screenshot to your clipboard. This makes it easy to paste the screenshot into any open app or document."
    },
    {
      "title": "Use the Snipping Tool shortcut in the future.",
      "content": "Use the Snipping Tool shortcut in the future. Now that you know how to use Snipping Tool, you can use this handy shortcut next time you want to take a screenshot: Windows key + Shift + S . [12] X Research source When you use the keyboard shortcut, you'll see a smaller Snipping Tool at the top of the screen. Each icon on the Snipping Tool indicates a different screenshot type—Rectangle, Window, Full screen, and Freeform modes. Click the mode you'd like to use, then capture your screenshot."
    },
    {
      "title": "Open the Snipping Tool.",
      "content": "Open the Snipping Tool . The Snipping Tool is a great way to take all kinds of screenshots, including full-screen, individual windows, and even a particular area of the screen. [13] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source On Windows 10, press the Windows key , type snip , and click Snipping tool . While Microsoft once intended to replace Snipping Tool with an updated tool called Snip & Sketch, that tool no longer receives updates. [14] X Research source Microsoft now recommends using Snipping Tool, not Snip & Sketch, for capturing screenshots. [15] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source On Windows 8.1, swipe in from the edge, select Search , type snipping , and then select Snipping Tool . On Windows 7, click the Start menu, type snipping , and then click Snipping Tool ."
    },
    {
      "title": "Choose the shape of the Snip.",
      "content": "Choose the shape of the Snip. \"Rectangular Snip\" is chosen by default. Click the Arrow button next to the Mode button to change the Snip shape: [16] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Free-form Snip lets you draw any shape with your mouse. The area inside the shape will be snipped. Rectangular Snip lets you select a rectangular area, which will be snipped. Window Snip lets you choose a window to snip. Full-screen Snip snips the whole screen, including all windows (except the Snipping Tool window)."
    },
    {
      "title": "Create a new Snip.",
      "content": "Create a new Snip. Click the New button to start the selection. The screen will fade, and you can draw your Snip area, or select the window if you chose Window Snip. Release the mouse to take your screenshot. If you had Full-screen Snip selected, your Snip will automatically be created once you click New ."
    },
    {
      "title": "Annotate the Snip (optional).",
      "content": "Annotate the Snip (optional). Once you create the Snip, it will open in a new window. You can use the Pen tool to draw on it and the Highlight tool to draw attention to text. The Erase tool will only erase annotations, not the screenshot itself."
    },
    {
      "title": "Save the Snip.",
      "content": "Save the Snip. Click the floppy disk icon to open the save dialog. Type in a name for the screenshot and change the \"Save as type:\" field if desired. You can now send the screenshot by email or put it on a website. PNG is the default format in Windows 8 and later. The default format in earlier versions is JPG."
    },
    {
      "title": "Paste the Snip (optional).",
      "content": "Paste the Snip (optional). By default, the Snip is copied to the clipboard when you create it. This means you can paste it into Paint or Word , much like you would with a full-screen screenshot. In Paint, you can make more edits than you can in the Snip annotation editor. To paste the Snip, open a window that supports pasting and press Ctrl + V ."
    },
    {
      "title": "Go to the view that you want to screenshot.",
      "content": "Go to the view that you want to screenshot. Open the program or screen you want to take a picture of, making sure that any windows or items you don't want on-screen are out of the way."
    },
    {
      "title": "Press ⊞ Win+⇧ Shift+S.",
      "content": "Press ⊞ Win + ⇧ Shift + S . Doing so will cause your screen to turn grey, and your mouse will turn into a crosshairs icon. The Snipping Tool will open at the top of the screen. [17] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source By default, the shortcut will open Snipping Tool in Rectangle Snip Mode, which means you can click and drag a rectangle around the area of the screen you want to capture. On Windows 10, you can select a different screenshot mode from the Mode menu. For example, if you want to capture the whole screen, select Full-screen Snip (which takes the screenshot automatically). To capture a single window, select Window Snip . On Windows 11, you can select a different mode to take a screenshot using the icons at the top. The icons in order are Rectangle (the default), Window, Full screen (which takes the screenshot automatically), and Freeform modes."
    },
    {
      "title": "Select an area to screenshot.",
      "content": "Select an area to screenshot. Click and drag your mouse from the top-left corner of the area you want to screenshot to the bottom-right corner. When you release the mouse button, the screenshot will be captured and copied to your clipboard. If you selected a full-screen screenshot, you can skip this step."
    },
    {
      "title": "Paste or save your screenshot.",
      "content": "Paste or save your screenshot. You can now paste your screenshot into any program that allows pasting photos (e.g., Paint, Word, an email, etc.) by pressing Ctrl + V . You should see the section of the screen that you selected appear in your program. Alternatively, save your screenshot as an image file by pressing Ctrl + S , entering a name, selecting a save location, and clicking Save ."
    },
    {
      "title": "Open the Xbox Game Bar.",
      "content": "Open the Xbox Game Bar. The Game Bar is a handy tool that makes it easy to capture screenshots of games, as well as any other open windows on your PC. To open the tool, press Windows key + G at the same time. [18] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can even use the Xbox Game Bar to record your screen in real time."
    },
    {
      "title": "Click the Widget menu.",
      "content": "Click the Widget menu. It's the second icon from the left in the Game Bar at the top of the screen. [19] X Research source"
    },
    {
      "title": "Click Capture.",
      "content": "Click Capture . You'll see this near the top of the menu. The Capture widget will appear. [20] X Research source"
    },
    {
      "title": "Click the pushpin icon on the Capture widget.",
      "content": "Click the pushpin icon on the Capture widget. This pins the widget to your screen so it won't disappear when you navigate away. [21] X Research source"
    },
    {
      "title": "Click the window you want to capture.",
      "content": "Click the window you want to capture. You can capture any window on your screen, such as your web browser, a game, or a document."
    },
    {
      "title": "Click the camera icon on the Game Bar.",
      "content": "Click the camera icon on the Game Bar. This captures a screenshot of the activate window and saves it to your screenshots folder."
    },
    {
      "title": "Click See my captures to view your screenshots.",
      "content": "Click See my captures to view your screenshots. You'll see this option at the bottom of the Capture widget. Here, you'll find all the screenshots you've captured using the Game Bar. When you're finished taking screenshots, follow these steps to unpin the Capture widget: Press Windows key + G to reopen the Game Bar. Click the pushpin icon. Click anywhere on the screen."
    },
    {
      "title": "Press and hold the Power and Volume Up buttons at the same time.",
      "content": "Press and hold the Power and Volume Up buttons at the same time. This quick shortcut will instantly screenshot the whole screen on a Surface Laptop, Surface Pro, Surface Book, Surface Go, or Surface Studio. The screen will dim momentarily to indicate a screenshot was taken. Your screenshot will be stored in the Screenshots folder, which you can access by opening File Explorer and navigating to Pictures → Screenshots . If you have a Surface Duo 2, press and hold the Power and Volume Down buttons instead. For more control over your screenshots, use the Snipping Tool instead."
    },
    {
      "title": "Go to the initial screen you want to screenshot.",
      "content": "Go to the initial screen you want to screenshot. This should be the first page in the sequence of pages that you want to screenshot. Understand how this works. The Windows Steps Recorder allows you to record up to 100 different screens and save them all to one document. This program also makes a note of where you click and which actions you perform on each screen. This tool is being phased out on Windows 11 beginning in 2024. [22] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open the Steps Recorder.",
      "content": "Open the Steps Recorder. To do so, press the Windows key on your keyboard, type psr.exe , and press Enter ."
    },
    {
      "title": "Click Start Record.",
      "content": "Click Start Record . This is at the top of the toolbar. Doing so turns on the Steps Recorder, which will record the next 25 screen changes. If you want to record more than 25 changes, first click on the right side of the toolbar, click Settings... , and change the \"Number of recent screen captures to store\" number."
    },
    {
      "title": "Click through your different screens.",
      "content": "Click through your different screens. Each time your screen changes (other than simply moving your mouse), the Steps Recorder will take a screenshot."
    },
    {
      "title": "Click Stop Record.",
      "content": "Click Stop Record . It's at the top of the toolbar. Doing so stops recording screen changes and opens the results window."
    },
    {
      "title": "Review your screenshots.",
      "content": "Review your screenshots. Scroll down through the window to ensure you captured all of the screenshots you wanted to save."
    },
    {
      "title": "Save your screenshots to a ZIP folder.",
      "content": "Save your screenshots to a ZIP folder. Click Save at the top of the window, enter a file name, select a save location, and click Save . This will save the screenshots in one HTML file. You can open the HTML file in your browser to view its contents."
    }
  ]
}