{
  "url": "https://www.wikihow.com/Swim-the-Butterfly-Stroke",
  "title": "How to Swim the Butterfly Stroke",
  "steps": [
    {
      "title": "Use the correct arm movement.",
      "content": "Use the correct arm movement. The arm movement in butterfly stroke can be broken down into three parts: the pull, the push and the recovery. Starting with your arms extended above your head (shoulder width apart), pull your hands towards your body in a semicircular motion, palms facing outwards. Remember to keep your elbows higher than your hands. This is the pull. [2] X Research source At the end of the pull, begin pushing your palms backwards through the water, along your sides and past your hips. This is the fastest part of the arm movement and provides the momentum necessary to complete the release. A good way to remember the pull and push sequence is to imagine making the shape of a large keyhole with your hands underwater. The pull is the wide part of the keyhole at the top, while the push is the narrow part of the keyhole at the bottom. The last part of the butterfly arm movement is the recovery which is where your hands must be positioned as they are in motion while finishing your pull and are getting ready to begin the subsequent stroke. Essentially your hands must reach your thighs. A good way to ensure that you have done this part of the stroke successfully is to drag your thumbs on your thighs as you are finishing the stroke. Next, sweep both arms out of the water simultaneously and throw them forwards into the starting position. Your palms should be facing outwards so your thumbs enter the water first, not your pinkies. Also, make sure the distance between your arms as you enter the water is no greater than shoulder width apart as this will greatly decrease entry drag allowing you to cut through the water more efficiently. [3] X Research source"
    },
    {
      "title": "Master the dolphin kick.",
      "content": "Master the dolphin kick. The dolphin kick is the name given to the dolphin-like kick of the legs used in butterfly stroke. Imagine kicking your legs like a dolphin (or a mermaid!) would kick its tail underwater. [4] X Research source With the dolphin kick, both legs move simultaneously, and should be pressed together to avoid a loss of water pressure. You should kick twice for each stroke of the arms in butterfly stroke. However, both kicks are not exactly the same - there is one small kick and one big kick. The small kick is performed while you are making the keyhole shape with your arms. This is because your arms are providing forward momentum in addition to your legs, so the kick doesn't need to be as strong. The big kick is performed during the recovery, when your arms come out of the water. During the recovery you tend to lose momentum, so you need a big kick to keep your body moving forwards. The most common mistake beginners make when performing the butterfly stroke is to kick in a uniform fashion, without alternating between small and big kicks. [5] X Research source"
    },
    {
      "title": "Move your body in a wave-like fashion.",
      "content": "Move your body in a wave-like fashion. It's not just your arms and legs that are required during the butterfly stroke, your whole body needs to get involved! Practice moving your whole body in a wave-like fashion. Think about the way that a dolphin or mermaid moves in the water -- your body should form an undulating S shape as you swim. More specifically, when your chest rises your hips should be at their lowest position, and when your chest falls your hips should be at their highest position, with your behind breaking the surface of the water. If you can get your timing right and manage to synchronize your body movement with your arms and leg strokes, you will find the butterfly much easier to master. You will be able to swim faster and find yourself getting tired less easily. [6] X Research source"
    },
    {
      "title": "Know when to breathe.",
      "content": "Know when to breathe. Breathing during butterfly stoke can be a little tricky, as it has to be perfectly timed and completed pretty quickly. The correct point to take a breath during butterfly stroke is when your arms are just coming out of the water at the beginning of the recovery phase. [7] X Research source As your arms are about to come out of the water, raise your head until your chin is just above the water and take a breath. Do not turn your head to the left or right - it should be kept straight. However, some swimmers who swim in the FINA World Cup do breathe to the side. This is not illegal, and may be more comfortable you. Begin by trying face forward, but try side breathing if you find it difficult after some time. [8] X Research source As your arms recover drop your face back into the water and tuck your chin in so it touches above your chest. This will help you to lift your arms a lot higher. Avoid breathing on every stroke, if possible. Every time you lift your head out of the water to breathe, it will slow you down slightly. Try breathe to every other stroke, or even less if possible. Of course, on longer races you may have to breathe more, but balance your need for breath and for speed. [9] X Research source"
    },
    {
      "title": "Put it all together.",
      "content": "Put it all together. By combining all of the steps outlined above - the arm stroke, the dolphin kick, the body movement and the correct breathing technique - you will find yourself doing the butterfly stroke! However, bear in mind that this is a tough stroke to perfect and it will take time and practice before you are able to synchronize all of these movements and swim the butterfly stroke correctly. Learn good technique. Incorrect butterfly technique can lead to problems in certain muscles and joints, such as the rotatory cuffs in the shoulders if done for long periods of time. It will also make the butterfly stroke harder than it actually is. Use a coach. Learning butterfly stroke just by reading about it will not work any more than reading a book will teach you to ride a bike. A swim coach can walk you through the stroke in more detail. A coach will also be able to observe you while you swim and pick out any flaws in your technique -- in this way, a knowledgeable outside perspective could be invaluable in helping you to improve your butterfly."
    },
    {
      "title": "Do a one-armed butterfly.",
      "content": "Do a one-armed butterfly. The first drill you can use to practice your butterfly technique is the one armed butterfly. Start with your arms at the 11 o' clock position, or shoulder-width apart. Begin swimming, using the dolphin kick. On every fourth kick, complete a single stroke with one arm, keeping the other arm pointing straight ahead. While practicing this drill, you may breathe to the side, rather than lifting your head straight out of the water as you do in full butterfly stroke. Once you have completed a full length of the pool using a single arm, switch to the other arm to build strength and technique evenly."
    },
    {
      "title": "Use repetitive arm strokes.",
      "content": "Use repetitive arm strokes. This drill is great for improving balance and giving you more control over your stroke. Begin swimming using the dolphin kick, with your arms straight out in front, one shoulder-width apart. [10] X Research source Instead of the regular arm stroke, practice doing two strokes with the right arm, followed by two strokes with the left arm, followed by two strokes using both arms simultaneously."
    },
    {
      "title": "Practice your dolphin kick.",
      "content": "Practice your dolphin kick. This drill is great for understanding the rhythm of the dolphin kick, while also helping you to time your breathing better. Keeping your arms locked at your sides and your head underwater, propel yourself down the length of the pool using only the dolphin kick. Try to alternate between big kicks and small kicks, as described in the previous section, and to get a feel for the rhythm of the movement. Breathe on every fourth or fifth kick, synchronizing your body movement with your breathing in the way that feels most logical and natural. Once you have developed a greater understanding for the rhythm of the movement, you can add your arms back into the stroke."
    }
  ]
}