{
  "url": "https://www.wikihow.com/Tell-if-Someone-Is-Lying-About-Cheating",
  "title": "12 Possible Signs Someone Is Lying About Cheating",
  "steps": [
    {
      "title": "Liars usually have trouble looking people in the eye.",
      "content": "Liars usually have trouble looking people in the eye. If you’re confronting them about cheating and they only look past your shoulder or at your forehead, there’s a good chance they aren’t telling the truth. They might also shift their eyes around quickly, or even avoid facing you altogether. [1] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source This is because they probably feel guilty or ashamed about the lies they’re telling you, and they don’t want to look at you directly while they do it."
    },
    {
      "title": "They might rub their hands together or rock back and forth.",
      "content": "They might rub their hands together or rock back and forth. Fidgeting is a telltale sign of lying, because it means the person wants to get up and leave (but they can’t). If you notice that your partner is struggling to sit still, there’s a good chance that they aren’t telling the truth. [2] X Research source They might also shuffle their feet or tilt their head to one side."
    },
    {
      "title": "Your partner might be feeling defensive, so they stand with their arms crossed.",
      "content": "Your partner might be feeling defensive, so they stand with their arms crossed. Take a look at your partner’s body language as you two chat: if they’re relaxed and look casual, there’s a good chance they’re telling the truth. On the other hand, if they cross their arms or hunch over, they might be lying. [3] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source By itself, this isn’t totally a red flag, but it’s something to look out for when you two are talking."
    },
    {
      "title": "This could mean that they don’t want to engage in what you’re saying.",
      "content": "This could mean that they don’t want to engage in what you’re saying. Pursing their lips is a way to literally close their mouth and keep themselves from talking, and it’s a classic sign of lying. Watch out for mannerisms like these right before your partner starts denying your accusations—it could mean that they don’t like what they’re saying, but they’re going to say it anyway. [4] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Some people will also roll their lips back until they almost disappear, which is another way of closing their mouth so they don’t have to talk yet."
    },
    {
      "title": "You might see sweat on their neck, forehead, or chest.",
      "content": "You might see sweat on their neck, forehead, or chest. If you start grilling them and they get hot and uncomfortable, it probably means they’re struggling to keep up with their own lies. They might even fan themselves or go get some air, just to cool off a bit. [5] X Research source Sweating is usually coupled with dry eyes and a dry mouth. If your partner starts blinking or swallowing rapidly, it means they’re having a tough time right now (and also probably lying)."
    },
    {
      "title": "A high tone of voice often means someone is lying.",
      "content": "A high tone of voice often means someone is lying. You might also hear a crack in their voice, especially when they first start talking. This doesn’t always mean that they’re not telling the truth, but it’s definitely a red flag. [6] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source People often change pitch when they’re defensive. [7] X Expert Source Tara Vossenkemper, PhD, LPC Licensed Professional Counselor Expert Interview. 18 January 2022. If your partner is telling the truth and they’re just worked up about what you’re saying, they might also speak in a different pitch than they normally do."
    },
    {
      "title": "These are words like “I,” “you,” “he,” and “she.”",
      "content": "These are words like “I,” “you,” “he,” and “she.” Not using pronouns is a way to distance themselves from the conversation and make it sound like they’re an outside bystander. They’ll probably start using vague, general words to describe where they were or what was going on. [8] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For example, instead of saying, “We were at the movies,” they might say, “Some people were at the movies.” Or, instead of saying, “I never said that,” they might say, “Nobody said that.”"
    },
    {
      "title": "They might feel anxious and guilty, and you can hear it in their word choice.",
      "content": "They might feel anxious and guilty, and you can hear it in their word choice. Words like “sad,” “hurt,” “hate,” and “worthless” will crop up a lot, especially if they’re denying something you’ve said. Don’t fall for this tactic—they are trying to make you feel bad for them so that you’ll stop asking questions. [9] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For instance, if you accuse them of cheating on you, they might say something like, “I’m hurt you would even ask that.” Or, they might say, “You probably hate me, don’t you?”"
    },
    {
      "title": "If they lie about other stuff, they might lie to you about cheating.",
      "content": "If they lie about other stuff, they might lie to you about cheating. Maybe you catch them in a lie about something innocent, like what they had for lunch or which movie they watched. People who lie all the time are so used to doing it, they won’t think twice about telling a lie to cover their tracks. If your partner has a history of lying, there’s a good chance that they’re lying to you about cheating, too. [10] X Research source Unfortunately, people who lie all the time usually have a hard time stopping without professional help. If your partner would like to change their ways, encourage them to go to a mental health professional."
    },
    {
      "title": "They might swipe away or exit tabs quickly when you come in the room.",
      "content": "They might swipe away or exit tabs quickly when you come in the room. Everyone has a right to privacy, but if your partner was totally innocent, they’d have no problem with you sneaking a peek over their shoulder at what they’re doing. [11] X Expert Source Tara Vossenkemper, PhD, LPC Licensed Professional Counselor Expert Interview. 18 January 2022. If your partner is all of the sudden very concerned about their devices, that’s a big red flag. [12] X Research source They might also put a password on their phone or computer, even when they didn’t have one before. [13] X Expert Source Tara Vossenkemper, PhD, LPC Licensed Professional Counselor Expert Interview. 18 January 2022. Reader Poll: We asked 674 wikiHow readers to tell us how they felt about checking their partner’s phone, and only 6% felt they didn’t need to check their phone since they trust them. [Take Poll] So, while that may not be a great strategy according to our readers, try talking to them about it."
    },
    {
      "title": "Maybe someone is calling them “baby” or asking them to meet up.",
      "content": "Maybe someone is calling them “baby” or asking them to meet up. If you confront your partner about these messages, they’ll probably say that it’s all a big misunderstanding, or that they’re just a friend. It’s important to trust your gut here—if they look like messages that someone in a relationship would send, it’s crossing the line into cheating territory. [14] X Research source Some people keep their cheating behaviors strictly digital. If your partner has been sending risque texts or even sexts to people online, that counts as cheating, and you don’t have to put up with it."
    },
    {
      "title": "They make an effort to spend less time at home with you.",
      "content": "They make an effort to spend less time at home with you. They might tell you that they’re swamped with a huge project, but in reality, they’re going to spend time with someone else. A good way to catch them in this lie is to call their workplace and ask for them one day when they’re staying late. If they aren’t there and you can’t get ahold of them, you’ll know that they’re lying to you. [15] X Research source If working long hours isn’t believable, they might tell you that they’re spending extra time at the gym or they have to travel for a meeting."
    }
  ]
}