{
  "url": "https://www.wikihow.com/Unclog-Your-Ears-After-a-Cold",
  "title": "Expert-Backed Tips & Remedies to Unclog Your Ears at Home",
  "steps": [
    {
      "title": "Swallow deeply, yawn, or chew gum to open up your eustachian tubes.",
      "content": "Swallow deeply, yawn, or chew gum to open up your eustachian tubes . Your eustachian tubes run between your inner ear and your nose. When these get clogged from a cold, a feeling of discomfort or fullness in your ears can continue even after you get better. Try taking a few deep swallows, yawning as wide as you can, and chewing gum to open up these tubes. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can also use this trick on planes when your ears feel full."
    },
    {
      "title": "Take a deep breath and pinch your nostrils shut while breathing out.",
      "content": "Take a deep breath and pinch your nostrils shut while breathing out. Breathe in deeply enough to fill up your lungs. Pinch your nose shut tightly and slowly breathe out through your nose. This will create pressure in your eustachian tubes. Wait for a slight “pop” sound to know your ears are unclogged. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source [3] X Expert Source Payam Daneshrad, MD Board Certified Otolaryngologist Expert Interview. 30 September 2020. If this technique doesn’t unclog your ears entirely, try it 1 to 2 more times."
    },
    {
      "title": "Inhale steam in the shower.",
      "content": "Inhale steam in the shower. Turn on the hot water in your shower and let it run for 5 to 10 minutes until your bathroom fills up with steam. Breathe the steam in deeply to loosen the mucus in your sinuses and unclog your ears. [4] X Research source Breathing in steam may cause your nose to run. Keep some tissues nearby just in case."
    },
    {
      "title": "Run a cool mist vaporizer or humidifier to add moisture to the air.",
      "content": "Run a cool mist vaporizer or humidifier to add moisture to the air. Place the humidifier in your bedroom and run it while you sleep at night. You can also run the humidifier in a common area of your home during the day to help add moisture to the air. This may help to ease the congestion in your sinuses. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure to keep the humidifier clean and change the filter regularly to prevent bacteria and mold from forming."
    },
    {
      "title": "Administer saline nasal drops or use a saline nasal spray.",
      "content": "Administer saline nasal drops or use a saline nasal spray . These are available in drug and grocery stores without a prescription. Administer 1-2 drops or sprays per nostril, wait about 5-10 minutes, and then blow your nose. Check the label for additional instructions on how to use the product. The solution can help to clean congestion from your sinuses, which may help to unclog your ears. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you are using saline drops on an infant, make sure to gently suction the mucus out of their nostrils with a bulb syringe after administering the drops. Squeeze the bulb and insert the tip about 1 ⁄ 4 in (0.64 cm) into the nostril, then slowly release the bulb to suction out the mucus. Repeat for the other side."
    },
    {
      "title": "Gargle",
      "content": "Gargle with saltwater to soothe a sore throat and ease congestion. Add 1/2 teaspoon (2.5 g) of salt to 8 fl oz (240 mL) of warm water and stir until the salt is fully dissolved in the water. Then, gargle a mouthful of the warm saltwater in the back of your throat for about 15-30 seconds. Repeat until the water is gone. [7] X Research source Although usually recommended for soothing a sore throat , your throat and ears are connected by the eustachian tubes, so the warm water in your throat may help to loosen mucus in your ears as well."
    },
    {
      "title": "Hold a washcloth with warm water against your ears for 5 to 10 minutes.",
      "content": "Hold a washcloth with warm water against your ears for 5 to 10 minutes. Run a clean washcloth underneath warm water. Wring out any excess water and hold it over each of your ears one at a time. This will help loosen any earwax that may be lodged in your ears. [8] X Research source You can also use a hot water bottle instead of a washcloth."
    },
    {
      "title": "Put a drop of olive or mineral oil into your ear and let it drip out.",
      "content": "Put a drop of olive or mineral oil into your ear and let it drip out. Pour a small drop of olive oil into a spoon and place it next to your ear canal. Tip your head to the side and let the olive oil slide down your ear. Wait for about 30 seconds to give the oil time to soften your earwax. Turn your head over so that your ear is facing the floor and let the olive oil and wax drain out into a tissue. Repeat this for your other ear. [9] X Research source Make sure you drain all of the oil out of your ear so that it doesn’t harm your ear canal."
    },
    {
      "title": "Visit a doctor to have them remove your earwax.",
      "content": "Visit a doctor to have them remove your earwax. In some cases, your clogged ears might be caused by wax rather than mucus in your sinuses. Make an appointment with your doctor to have them remove your earwax with a long, curved tool called a curette. [10] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source"
    },
    {
      "title": "Avoid using cotton swabs to clean out your ears.",
      "content": "Avoid using cotton swabs to clean out your ears. Although they may seem like helpful tools, cotton swabs actually push your earwax back into your inner ear. If your ears are clogged with earwax and you clean them regularly, it could be because you are pushing the wax back into your ears. [11] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source [12] X Expert Source Payam Daneshrad, MD Board Certified Otolaryngologist Expert Interview. 30 September 2020. Never stick long, pointed objects into your ears. You could damage your eardrums accidentally."
    },
    {
      "title": "Take guaifenesin to thin out mucus in your ears.",
      "content": "Take guaifenesin to thin out mucus in your ears. Try taking 400 mg of guaifenesin 3 times daily or about once every 4 hours during the day. Take each dose of the medicine with a full glass of water. Check the label on the medication for additional dosing instructions and precautions. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid taking medications that combine guaifenesin and decongestants without asking your doctor first. These drugs may be contraindicated for some people, such as those with heart disease or high blood pressure."
    },
    {
      "title": "Use a nasal decongestant to get rid of mucus.",
      "content": "Use a nasal decongestant to get rid of mucus . If you just got over your cold, you may have some leftover mucus in your sinuses that is causing your clogged ears. Spray an over-the-counter nasal spray, such as Afrin, up into your sinuses through your nose to get rid of any snot. [14] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source Do not use nasal sprays for more than 3 days straight. Your sinuses can start to swell in reaction to the nasal spray if you use it for too long."
    },
    {
      "title": "Apply a topical nasal steroid if you have allergies.",
      "content": "Apply a topical nasal steroid if you have allergies. Common colds and allergies can be hard to distinguish from each other. If you have a history of allergies and your ears are still clogged, talk to your doctor about a nasal steroid. This can help to reduce the swelling in your sinuses and unclog your ears. [15] X Trustworthy Source American College of Allergy, Asthma, and Immunology National professional organization of allergists, asthma specialists and immunologists that focuses on supporting and publishing research Go to source Do not use nasal steroids unless they were prescribed to you by your doctor. Keep in mind that it can take up to 1 week for a nasal steroid to take effect."
    },
    {
      "title": "Take antibiotics if they were prescribed to you.",
      "content": "Take antibiotics if they were prescribed to you. Common colds can sometimes develop into sinus or ear infections . If you have been dealing with clogged ears for more than 10 days, schedule an appointment with your doctor to talk about potential infections in your sinuses . [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Seek ventilation tubes from a doctor if your clog is severe.",
      "content": "Seek ventilation tubes from a doctor if your clog is severe. In some cases, your eustachian tubes may be clogged severely and your doctor might have to surgically insert a tube into your ears to relieve pressure and drain any fluid. Try at-home remedies first and then talk to your doctor if your ears still feel clogged after more than 3 weeks. [17] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source You will probably only need this procedure done if your ears have been clogged dozens of times throughout your life."
    }
  ]
}