{
  "url": "https://www.wikihow.com/Stop-Flatulence",
  "title": "How to Stop Flatulence",
  "steps": [
    {
      "title": "Eat fewer simple carbohydrates.",
      "content": "Eat fewer simple carbohydrates. Carbohydrates produce more gas than protein or fat because sugar and starch ferment the easiest. Simple carbs can be the worst culprit, as they break down easily in your body. [2] X Expert Source Muhammad Khan, MD, MPH Board-Certified Gastroenterologist Expert Interview. 24 August 2021. Not only does this spike your blood sugar, it also feeds your gut bacteria, which results in more gas. Simple carbs are usually more processed, such as baked goods, sugary snacks, and items made with white flour. Instead, choose complex carbs like carrots and potatoes, which are healthier. [3] X Research source You can recognize complex carbs because they're whole foods, such as carrots, potatoes, beans, and corn. Since many of these foods are high in fiber, they'll still produce gas, but less than with simple carbs. Fewer carbohydrates often means fewer breads and sweets, which is a healthy part of any diet plan."
    },
    {
      "title": "To reduce the smell, eat fewer animal products.",
      "content": "To reduce the smell, eat fewer animal products. Though they don't fart any less, vegetarians tend to produce better-smelling flatus (the technical term for farts) than their omnivorous friends, who eat both plants and animals. That's because meat contains more hydrogen sulfides, which break down nutrients and emit an odor in the gas. [3] X Research source When bacteria in your colon breaks down hydrogen sulfides as your food is digested, your body produces gas that smells like sulfur. This means stinky farts! Foods that typically create a sulfur smell include eggs, meat, fish, beer, beans, broccoli, cauliflower, and cabbage."
    },
    {
      "title": "Know what foods your body is sensitive to.",
      "content": "Know what foods your body is sensitive to. [4] X Expert Source Peter Gardner, MD Board Certified Gastroenterologist Expert Interview. 25 August 2020. Discover (mostly through trial and error, unfortunately) which foods cause problems and should be limited for your body, as everyone is different. What makes your body tick may not even be a blip on the radar for someone else. That being said, there are some foods which are known culprits to many of us: Apples, apricots, peaches, pears, raisins, prunes Beans, soybeans, popcorn, nuts Bran Broccoli, Brussels sprouts, cabbage, carrots, cauliflower, eggplant, onion Dairy products [5] X Expert Source Peter Gardner, MD Board Certified Gastroenterologist Expert Interview. 25 August 2020. Tuna Carbonated drinks [6] X Expert Source Muhammad Khan, MD, MPH Board-Certified Gastroenterologist Expert Interview. 24 August 2021. Simple carbs, such as baked goods Sugar alcohols, including sorbitol, xylitol, and mannitol [7] X Expert Source Muhammad Khan, MD, MPH Board-Certified Gastroenterologist Expert Interview. 24 August 2021."
    },
    {
      "title": "Puree your veggies and soak your beans.",
      "content": "Puree your veggies and soak your beans. Galacto-oligosachharides (GOS) are essentially indigestible carbs and beans and legumes (like chickpeas and lentils) are full of them. The more GOS in your food, the more likely you'll experience flatulence. However, GOS is water-soluble. If you soak your beans before cooking, up to 25% of the GOS can disappear. [8] X Research source A similar thing can be said for vegetables. However, GOS levels can be got around by pureeing. It increases the surface area of food particles, in turn increasing contact with digestive enzymes, making the food more readily absorbed. As a result, there's less residue in your colon to feed your gut bacteria – and therefore less flatulence on your end."
    },
    {
      "title": "Eat more fennel.",
      "content": "Eat more fennel. Fennel seeds are a natural flatulence-fighter used in South Asia for centuries – if you see a bowl of seeds at your favorite Indian restaurant, that's fennel. Just a pinch after a meal or brewed into a tea can help prevent oncoming flatulence. [9] X Research source Fennel seeds can be a topper to any salad. You can also use the rest of the plant for just about anything!"
    },
    {
      "title": "Keep a food diary to look for patterns.",
      "content": "Keep a food diary to look for patterns. Write down every food you eat, both for meals and snacks. Record what you drink, as well. For each meal or snack, write down how the food made you feel, as well as how much gas you experienced afterwards. When you do notice gas, record if it was smelly or not. This will help you identify which foods affect you the most so you can avoid or limit them. It takes up to 6 hours to fully digest food, so consider this when documenting how a particular food affected you."
    },
    {
      "title": "Chew your food at least 20 times per bite.",
      "content": "Chew your food at least 20 times per bite. Chewing your food thoroughly can help reduce the amount of air you swallow and reduce the amount of food you eat overall – both being factors that can lead to flatulence. [10] X Expert Source Peter Gardner, MD Board Certified Gastroenterologist Expert Interview. 25 August 2020. Count out your chews in your head."
    },
    {
      "title": "Eat at a slower pace.",
      "content": "Eat at a slower pace. Eating quickly causes you to swallow more air. [11] X Expert Source Peter Gardner, MD Board Certified Gastroenterologist Expert Interview. 25 August 2020. The more air you swallow, the more gas your body will produce. You can avoid a lot of excess gas by slowing down your eating. Take your time. When you eat more slowly, you enjoy every bite more, and you give your body time to register that it's full. In other words, it's good for weight and gas reduction. Set your utensil down between bites."
    },
    {
      "title": "Don't swallow air.",
      "content": "Don't swallow air. [12] X Expert Source Peter Gardner, MD Board Certified Gastroenterologist Expert Interview. 25 August 2020. Sometimes flatulence has nothing to do with the food we eat, but how we eat it. And in some cases, it has nothing to do with food at all. It could be just from air bubbles getting stuck in your GI tract, from poor swallowing habits and eating quickly. Here's a few tips to keep in mind: Don't use a straw. Sipping through a straw allows you to gulp air without realizing it. You are inevitably taking in the air that rests in the top of the straw with each drink. Don't chew gum. [13] X Expert Source Muhammad Khan, MD, MPH Board-Certified Gastroenterologist Expert Interview. 24 August 2021. Chewing gum gets our mouths open and active, resulting in incidental swallowing of air. Don't smoke. When you inhale smoke, you inhale air, too."
    },
    {
      "title": "Don't eat too much in one sitting.",
      "content": "Don't eat too much in one sitting. [14] X Expert Source Peter Gardner, MD Board Certified Gastroenterologist Expert Interview. 25 August 2020. Simply put, the more food you intake, the longer it takes your body to digest it and the more gas your body will produce. With less food in your stomach, there will naturally be less gas. Keeping the food in your stomach to a minimum keeps everything else to a minimum, too. This goes double for foods that are on the trigger-list and foods that are spicy or produce other gastrointestinal issues, like heartburn or upset stomach."
    },
    {
      "title": "Exercise more.",
      "content": "Exercise more. Exercising can be helpful in two ways: it increases how fast your body digests food and helps improve your metabolism. Keep a regular exercise routine, and the next time you're feeling bloated or gassy, go for a walk. You'll likely feel better shortly, as the walk will help your digestive tract move things along. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Any type of moment is good when you have stomach issues – it gets things moving and out of your system. You'll probably notice that starting up a regular exercise routine keeps you more regular, too."
    },
    {
      "title": "Turn to anti-flatulence medications, like Beano.",
      "content": "Turn to anti-flatulence medications, like Beano. Over-the-counter digestive aids, such as those found in Beano, taken before a meal may help your stomach digest many foods without the flatulence associated with them. Beano is available at most pharmacies and grocery stores. Beano can affect people differently, so it may not work for you. Talk to your doctor before taking any type of medication."
    },
    {
      "title": "Use charcoal tablets or products like Mylanta.",
      "content": "Use charcoal tablets or products like Mylanta. Maalox and Mylanta are two products that contain simethicone, a medicine that dissolves gas bubbles. These are for gas relief after the meal or at any time you find you need them. Extreme cases that do not react appropriately to over-the-counter medications should be discussed with your doctor. Charcoal tablets (Charcoal Caps) are similar in that they absorb sulfuric gases in your GI tract. These tablets can cause side effects like nausea, vomiting, and black stools."
    },
    {
      "title": "Experiment with alternative medicine, too.",
      "content": "Experiment with alternative medicine, too. Chamomile, peppermint, sage, marjoram, and other herbs can alleviate flatulence. After a particularly risky meal, brew yourself a cup of tea with one or more of these herbs to calm your digestive system. You can combine these herbs with other treatment options to make them more effective. They work best if you also make dietary changes."
    },
    {
      "title": "Visit your doctor if you don't find relief.",
      "content": "Visit your doctor if you don't find relief. Sometimes excessive flatulence can be caused by a medical condition or a medication you are taking. If dietary changes aren't helping, then you may need to talk to your doctor to rule out other causes. They may be able to prescribe a treatment that works."
    }
  ]
}