{
  "url": "https://www.wikihow.com/Strengthen-Your-Lower-Back",
  "title": "The Best Ways to Make Your Lower Back Stronger",
  "steps": [
    {
      "title": "Make a hip bridge.",
      "content": "Make a hip bridge. The hip bridge also works to strengthen the muscles in your lower back and core that support your spine, putting you at less risk for lower back pain. Lay on your back for this exercise with your knees bent and feet flat on the floor, as you did for pelvis tilts. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Lift your hips toward the ceiling, keeping your knees bent and engaging your core. Stop when your hips are even with your knees, such that you could draw a straight line (or a bridge) from your knees to your shoulders. Hold the position for 5 to 10 seconds, breathing deeply, then lower to the ground. Perform 10 repetitions of this exercise."
    },
    {
      "title": "Swim on the floor.",
      "content": "Swim on the floor. For this exercise, also known as the Superman exercise, you want to lay face-down on the floor with your legs extended behind you and your arms extended straight overhead. If you're already laying on your back, flip over onto your stomach. Reach your hands over your head and extend your legs behind you. [3] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]. Raise your legs a few inches and kick them, alternating sides. You also can lift your left leg and right arm together, then lower and lift your right leg and left arm. Complete 10 to 20 repetitions of this exercise."
    },
    {
      "title": "Tilt your pelvis.",
      "content": "Tilt your pelvis. The pelvis tilt helps strengthen the muscles at the base of your abdomen as well as the muscles around your lower back. Become familiar with contracting this muscle to help strengthen it so you have fewer lower back problems. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Press the curve of your lower back into the floor and hold it for 5 to 10 seconds, breathing deeply, then release. Do 10 repetitions of this exercise. To do this exercise, lay on your back with your knees bent so that your feet are flat on the floor. Your legs should be about hip-width apart."
    },
    {
      "title": "Try the bird dog exercise.",
      "content": "Try the bird dog exercise. The bird dog exercise can help stretch and strengthen your lower back, as well as improving your balance. Start the bird dog exercise by getting on all fours with your knees directly under your hips and your wrists directly under your shoulders. [5] X Research source Reach your left arm forward and your right leg backward, creating a straight line from your fingertips to your heel. Keep your back flat, hold for two or three seconds, then return to all fours and repeat with the other side. Do 10 to 20 repetitions of this exercise on each side. Keep your back flat and motionless, and don't lift your hand or heel higher than your back."
    },
    {
      "title": "Add in some lunges.",
      "content": "Add in some lunges. Lunges, if done correctly, are a good exercise to strengthen your lower back. Start by standing with your legs about hip-width apart. Make sure there are several feet of space in front of you. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Step forward with your right leg, lowering and bending your left knee. There should be a straight line from the top of your head to your left knee – don't lean forward over your right leg. Bend your right knee to a right angle with your knee directly over your ankle and your thigh parallel to the floor. Hold the lunge for a couple seconds, then step back to your original position and repeat with the left leg forward. Do 5 to 10 repetitions on each side."
    },
    {
      "title": "Engage your core with planks.",
      "content": "Engage your core with planks. Since the muscles in your lower back are part of your core abdominal muscles, you can't strengthen your lower back without strengthening your core. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Start on your stomach with your legs extended behind you. Raise up so that you are on your hands and toes, with your body creating a straight line from the crown of your head to your heels. Hold this position for 30 seconds, and gradually increase your time as you get stronger. [8] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]. If you don't have much experience with planks, you can modify the exercise by coming to your knees and elbows, or to your toes and elbows so that your upper body is supported by your forearms rather than just your wrists. Side planks work the core muscles along your sides. Come up on one forearm, stacking your ankles one over top of the other. Make sure your elbow is directly under your shoulder."
    },
    {
      "title": "Use a stability ball to increase difficulty.",
      "content": "Use a stability ball to increase difficulty. Once you've done these back-strengthening exercises for a while, they'll become less challenging. A stability ball adds a balance element to push your muscles to work harder. For example, if you put your feet on a stability ball to do a bridge, you'll find the bridge is much more difficult to do as well as to maintain."
    },
    {
      "title": "Warm up with the cat-cow exercise.",
      "content": "Warm up with the cat-cow exercise. The cat-cow exercise is taken from yoga, and involves moving between the cat pose and the cow pose while synchronizing your movement to your breath. If you perform cat-cow regularly, it will increase flexibility in your spine. [9] X Research source Start on all fours with your back flat. Your wrists should be directly under your shoulders, your knees directly under your hips. On an inhale, drop your belly towards the ground and lift your chest and pelvis towards the ceiling to arch your back into cow position. As you exhale, round your back towards the ceiling, tucking in your tailbone and dropping your chin to your chest. Repeat the movements for 10 to 20 breath cycles. Breathe slowly and deeply in through your nose and out through your mouth."
    },
    {
      "title": "Increase circulation with the sphinx pose.",
      "content": "Increase circulation with the sphinx pose. The sphinx pose helps increase blood flow to your lower back, which can help heal lower back problems as well as build muscle. To start, lay on your stomach with your legs extended behind you. [10] X Research source Raise up onto your forearms, keeping your elbows directly under your shoulders. Press down into the floor with your feet and your palms, pushing your pubic bone forward until you feel your lower back engage. Hold the position for 1 to 3 minutes, breathing deeply in through your nose and out through your mouth."
    },
    {
      "title": "Stretch your hamstrings with downward facing dog.",
      "content": "Stretch your hamstrings with downward facing dog. Downward facing dog is a classic yoga pose that provides a good whole body stretch as well as mental calm and focus. By stretching your hamstrings in particular, you help strengthen your lower back. [11] X Research source Get on all fours on your mat with your knees directly below your hips. Your wrists can be directly below your shoulders or a little in front of your shoulders. Connect to your breathing, inhaling slowly and deeply through your nose and exhaling out your mouth. On an exhale, lift your hips towards the ceiling, straightening your arms out in front of you until you form an inverted \"V.\" Keep your shoulders rolled back and your neck loose. As you inhale, think of lifting your hips up even higher towards the ceiling, drawing weight up your arms and away from your wrists. On the next exhale, focus on your legs, drawing down through your heels to stretch your hamstrings. Stay in the pose for 10 to 20 breath cycles, then release back down to all fours."
    },
    {
      "title": "Do a two-knee twist.",
      "content": "Do a two-knee twist. The two-knee twist effectively stretches and strengthens your entire core and lower back, while the twisting motion opens and invigorates your spine. Start by laying on your back on your mat with your legs extended. [12] X Research source Stretch your arms out to your sides directly from your shoulders, so you are making a \"T\" shape on the floor. Then bend your knees up to your chest. On an exhale, lower your knees to the ground on the right, taking care to keep both shoulders pressed firmly on the mat so that you twist only from your lower back. Inhale your legs back to center, then on your next exhale, drop your knees to the left side. Repeat 5 to 10 times on each side."
    },
    {
      "title": "Rest in child's pose.",
      "content": "Rest in child's pose. Child's pose is a classic pose to end a yoga session, and also provides a good stable stretch for your lower back. You can get into child's pose from all fours – simply lower your hips back and fold your torso over your thighs, extending your arms out in front of you. [13] X Research source If you're flexible enough, you can rest your forehead on your mat. Don't fold any further than you can comfortably, though. Spreading your knees slightly further apart will make child's pose easier and may be more comfortable for you. Since child's pose is a resting pose, you can stay in it as long as you like, breathing deeply."
    },
    {
      "title": "Go for walks regularly.",
      "content": "Go for walks regularly. Walking is a simple and inexpensive way to start becoming more active. Taking a brief walk of just 15 to 20 minutes most days of the week will help strengthen your lower back as well as the rest of your body. [14] X Research source Try walking with a buddy to help motivate you and make your walks more fun. If you're walking by yourself, you may want to listen to music, a podcast, or an audio book."
    },
    {
      "title": "Take up cycling.",
      "content": "Take up cycling. If you have lower back pain to the point that you feel more comfortable sitting than standing, cycling is a good option for cardiovascular exercise. A stationary bike inside typically will be better for you than the bumpy, uneven road terrain. [15] X Research source Cycling is low-impact and easy on your joints, and will strengthen your legs, hips, and lower back while also giving you a good cardiovascular workout."
    },
    {
      "title": "Exercise in intervals.",
      "content": "Exercise in intervals. Mixing your cardio and strength training together creates an effective workout that will strengthen your lower back without increasing any lower back pain you may have. You can find beginner interval training workouts, including a lot of videos, online for free. [16] X Research source Doing 3-5 minute intervals of high-intensity cardio between strength-training intervals will help you get and keep your heart rate up without putting too much strain on your lower back."
    },
    {
      "title": "Try swimming.",
      "content": "Try swimming. If you have convenient access to a pool, swimming for just 20 to 30 minutes two or three days a week is a good way to strengthen your entire back. To avoid making any back problems worse, join a class or hire a coach to perfect your technique. [17] X Research source Swimming is a low-impact exercise and the water helps support you, making it great exercise if you have joint problems or are overweight. If you're new to swimming, start slow with 10-minute swims. Every week or so, increase your time in the water by five minutes until you're swimming for a half hour or longer each session. If you're not up for swimming, walking or jogging in water provide some resistance to help strengthen your legs and lower back, without you having to worry about your breath."
    },
    {
      "title": "Buy a pedometer.",
      "content": "Buy a pedometer. Over the course of your day, you should aim to walk at least 10,000 steps. A pedometer secured to your waist can keep track of those steps for you. Some models also connect to the internet and have apps that allow you to keep track of your progress over time. [18] X Research source Choose a pedometer that you can use easily and that will help you achieve your goals. You can get a very basic model, or one with a lot of extra features. If you're new to a more active lifestyle, set smaller goals to start and work your way up to 10,000 steps. Introduce walk breaks into your day by doing things such as parking further away when you go shopping, or taking the stairs instead of the elevator."
    },
    {
      "title": "Maintain an active lifestyle.",
      "content": "Maintain an active lifestyle. Sitting for long periods of time can cause your lower back muscles to atrophy. Prevent this by getting up and walking around every 30 minutes or so if possible, and try to reduce the number of hours you sit overall. For example, if you spend most of your work day sitting, try to remain standing when you go home, rather than sitting down on the couch to watch television. You also can invest (or ask your boss to invest) in a standing desk, so that you can stand for periods as you work throughout the day."
    }
  ]
}