{
  "url": "https://www.wikihow.com/Use-Your-Computer-Without-a-Mouse",
  "title": "How to Use Your Computer Without a Mouse: Shortcuts & Mouse Keys",
  "steps": [
    {
      "title": "Try using basic keyboard shortcuts.",
      "content": "Try using basic keyboard shortcuts. You can use your PC's arrow keys and the ↵ Enter key to move the selection around the currently-open window, which is helpful if your mouse isn't working. When doing this, you can press a letter key when on the desktop or in a Windows app (e.g., File Explorer) to cause the selection to jump to the first item starting with that letter. There are a few other basic keyboard shortcuts you can use: [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Ctrl + Esc — Open the Start menu . Use the Tab key to switch from section to section, and the arrow keys to move within sections. Press Enter to launch an app. ⊞ Win + D — Minimize all open windows to show the desktop. Use the Tab key to switch from icon to icon, and press Enter to start an app. Alt + Tab ↹ — Switch between open windows. Alt + F4 — Close the currently open app or window. ⊞ Win + E — Open the File Explorer . ⊞ Win + X — Open the Advanced settings menu. ⊞ Win + I — Open Settings. ⊞ Win + A — Open the Action Center. ⊞ Win + ⎙ Print Screen — This will take a screenshot of the entire screen."
    },
    {
      "title": "Make sure your computer has a number pad.",
      "content": "Make sure your computer has a number pad. If you don't have a grid of number keys on the right side of your computer's keyboard (in addition to the standard row of number keys at the top of the keyboard), you won't be able to use this method. If you don’t have a numeric keypad and your mouse isn't working, see How to Use a Keyboard to Click Instead of a Mouse for tips on navigating without your mouse. You can still use the keyboard shortcuts listed in the first step without a numeric keypad."
    },
    {
      "title": "Open Start .",
      "content": "Open Start . Press the ⊞ Win key (the key with the Windows logo on it) to do so. You can also press Ctrl + Esc to open the Start window."
    },
    {
      "title": "Type control panel.",
      "content": "Type control panel . This will search your computer for the Control Panel."
    },
    {
      "title": "Select Control Panel.",
      "content": "Select Control Panel . Use the arrow keys to select this option in the search results, then press ↵ Enter . The Control Panel will open."
    },
    {
      "title": "Select Ease of Access.",
      "content": "Select Ease of Access . Use the arrow keys to navigate down to Ease of Access, then press Enter to select it. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select Ease of Access Center.",
      "content": "Select Ease of Access Center . To select it without a mouse, press Tab ↹ to move the selection to the main panel, navigate using the arrow keys, and then press ↵ Enter to select it."
    },
    {
      "title": "Select Make the keyboard easier to use.",
      "content": "Select Make the keyboard easier to use . Press the ↓ key until you've selected this option, then press ↵ Enter to open it. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select Set up Mouse Keys.",
      "content": "Select Set up Mouse Keys . You'll find this blue link near the top of the page. Scroll down to it using the ↓ key, then press ↵ Enter ."
    },
    {
      "title": "Enable Mouse Keys.",
      "content": "Enable Mouse Keys. Press the ↓ key until the \"Turn on Mouse Keys\" box and line of text is selected, then press the Spacebar to check the box."
    },
    {
      "title": "Adjust the pointer speed.",
      "content": "Adjust the pointer speed. Press the ↓ key until you've selected the \"Top speed\" slider in the \"Pointer speed\" section. Once you adjust one value, you can press the Tab ↹ key to move to the next one: Top speed — Determines how fast your pointer moves at its quickest. Press the → key to raise the mouse's top speed, or press ← to lower it. This setting should be fairly high (e.g., 75 percent or higher). Acceleration — Determines how quickly your pointer reaches its maximum speed. Press the → key to raise the acceleration, or press ← to lower it. This setting should be at around 50 percent."
    },
    {
      "title": "Select OK.",
      "content": "Select OK . Press the Tab ↹ key until you see the an outline surrounding the \"OK\" button at the bottom of the panel. Then, press Spacebar to \"click\" the button. It's at the very bottom of the window. This will enable Mouse Keys and exit the window."
    },
    {
      "title": "Use the number pad to move around the pointer.",
      "content": "Use the number pad to move around the pointer. You can now use the numeric keyboard to move your mouse cursor around the screen like a mouse: 4 : Move left 6 : Move right 8 : Move up 2 : Move down 7 : Move up diagonally to the left 9 : Move up diagonally to the right 1 : Move down diagonally to the left 3 : Move down diagonally to the right If your mouse doesn't start moving, press Num (or Fn + Num on some computers), then try moving your mouse again."
    },
    {
      "title": "Press the 5 key to click.",
      "content": "Press the 5 key to click. You'll find this key in the middle of the number pad. If pressing 5 brings up a drop-down menu, press / in the number pad to disable this feature. You should be able to click using 5 after doing so."
    },
    {
      "title": "Bring up the right-click menu.",
      "content": "Bring up the right-click menu. Every Windows computer has a \"context menu\" key that usually resembles a ☰ symbol surrounded by a box. With an item (e.g., an icon) selected, pressing this key will prompt the right-click menu to appear. Keep in mind that without first clicking something by using the 5 key, the right-click menu will just display a generic drop-down in the corner of the screen. You can also do a variety of computer operations using the Windows command prompt . For general keyboard tips, check out our guide to using a computer keyboard ."
    },
    {
      "title": "Try using basic keyboard shortcuts.",
      "content": "Try using basic keyboard shortcuts. You can use your Mac's arrow keys and the ⏎ Return key to move the cursor's selection around the currently open window, but you can also use the following shortcuts to perform a few more complex tasks: [4] X Research source ⌘ Command + Q — Quit an app (or currently open window). ⌘ Command + Space — Open the Spotlight search bar in the middle of the screen. ⌘ Command + Tab ↹ — Switch to the next window. ⌘ Command + N — Opens a new Finder window if you're on the desktop. Alt + F2 , then ⌘ Command + L — Opens System Preferences or System Settings. Ctrl + F2 — Select the Apple Menu (pressing ⏎ Return will open it). You can also ask Siri to open apps for you."
    },
    {
      "title": "Open the Accessibility Options window.",
      "content": "Open the Accessibility Options window. Depending on your Mac model, use one of the following keyboard shortcuts to do this: [5] X Research source MacBook with Touch Bar — Quickly tap the Touch ID button three times. MacBook without Touch Bar — Press Fn + ⌥ Option + ⌘ Command + F5 at the same time. iMac (desktop Mac) — Press ⌥ Option + ⌘ Command + F5 at the same time."
    },
    {
      "title": "Enable Mouse Keys.",
      "content": "Enable Mouse Keys. Tap the Touch ID button three times (MacBook with Touch Bar) or press ⌘ Command + ⌥ Option + F5 (all other Macs) to do so. You can also use the ↓ arrow key to select the \"Enable Mouse Keys\" box and then press the Spacebar key to check it. You can also toggle Mouse Keys on and off quickly by pressing ⌥ Option 5 times."
    },
    {
      "title": "Leave the Accessibility Options window open.",
      "content": "Leave the Accessibility Options window open. This will allow you to disable Mouse Keys by using the keyboard shortcut that you used to enable Mouse Keys. Unfortunately, you can't type with Mouse Keys enabled."
    },
    {
      "title": "Move your mouse cursor around.",
      "content": "Move your mouse cursor around. Using the U , 8 , O , and K keys, you can move the cursor left, up, right, or down, respectively. [6] X Research source Pressing the J , 7 , 9 , or L keys will move the cursor at a 45° angle down to the left, up to the left, up to the right, or down to the right, respectively."
    },
    {
      "title": "Click with the 5 key.",
      "content": "Click with the 5 key. The 5 key is essentially the left-click button when you're using Mouse Keys. [7] X Research source You can also hold down Control while tapping 5 to simulate a right-click."
    },
    {
      "title": "Hold down the mouse.",
      "content": "Hold down the mouse. Maneuvering the pointer to rest over an icon and then pressing the M key will simulate a \"hold\" action, allowing you to drag the icon beneath your mouse pointer by using the movement keys. This is also helpful when attempting to activate hold-sensitive menus, such as the Trash menu. You can press . to release the hold. Using the Terminal to open applications can be a quick method for starting apps."
    }
  ]
}