{
  "url": "https://www.wikihow.com/Write-a-Will-When-You-Have-Children",
  "title": "How to Write a Will When You Have Children",
  "steps": [
    {
      "title": "Speak with your child’s other parent.",
      "content": "Speak with your child’s other parent. The two of you should decide together who will be best to take on guardianship of your children and handle finances. You should choose someone to be the physical guardian of your children as well as someone to handle your children’s finances until they turn 18. This can be the same person, but does not have to be. You and the other parent should be on the same page about who should be selected as guardian. However, if you are divorced or not on good terms with your child’s other parent, you may not get them to agree with you about who should be the guardian. Generally, if possible, parents select a relative or close friend to be the guardian of their children. If parents die unexpectedly, it is likely that children will be most comfortable living with someone with whom they already have a close relationship, such as a grandparent, aunt, or uncle."
    },
    {
      "title": "Consider the age, health, and location of potential guardians.",
      "content": "Consider the age, health, and location of potential guardians. Keep in mind that whoever you appoint as guardian must be someone who can properly care for your children. Consider the age, health and location of the potential guardian. For example, if the guardian lives out of state, keep in mind that the child will have to relocate and make new friends after the child has experienced the loss of a parent. [1] X Research source Additionally, consider the guardian’s religion and lifestyle preferences. You want to make sure that you choose someone who will raise your children how you want them to be raised. [2] X Research source Generally, you should choose a guardian that you see as “responsible,” whatever that means to you personally."
    },
    {
      "title": "Act alone only if necessary.",
      "content": "Act alone only if necessary. If the other parent does not help you with raising your children, you can act without them. However, be aware that if the other parent is alive, it is possible that they may want to be named as guardian of your children should anything happen to you. In most circumstances, it is best for children to be raised by a parent, but if you have reasons that you do not want the other parent to have custody of your children if something happens to you, you need to name a different guardian."
    },
    {
      "title": "Document everything if deciding alone.",
      "content": "Document everything if deciding alone. If you name a guardian without the input of your child’s other parent, it is possible that the other parent could challenge the guardianship should something happen to you. If this happens, the court will rely, at least in part, on your documentation regarding why you do not want the other parent to be the guardian. Therefore, you should make sure that you provide detailed information about why you do not want the other parent to be named guardian. Reasons that the other parent should not be guardian include: lack of a stable home for your children, mental or physical problems that could impede your children’s care, alcohol or other substance abuse, and physical abuse. [3] X Research source"
    },
    {
      "title": "Select the guardian.",
      "content": "Select the guardian. The person who will have physical custody of your children is called the “guardian of the person.” After weighing all of the options, you will have to choose who you think would do the best job of raising your child or children. Even if you appoint a guardian in your will, the court will not appoint the guardian unless doing so is in “the best interests of the child,” so choose someone who is up to the task. [4] X Research source Although the court might appoint someone different than the person named in your will, the court will give your choice great consideration, and will not go against that choice unless the guardian will be unable to properly take care of the child, such that awarding guardianship would not be in the child’s best interest. If the person to whom you want to leave guardianship is your same-sex partner, include a letter to the court explaining how he or she is a better choice than a blood relation. [5] X Research source"
    },
    {
      "title": "Talk to the guardian before naming them in your will.",
      "content": "Talk to the guardian before naming them in your will. Make sure that you speak with person that you want to name as the guardian of your child before you put them in your will. The court will not force someone to serve as a guardian, so make sure that the guardian is willing to serve before you formally name them. If possible, speak with the potential guardian in person, and explain to them why you want them to raise your child in the event that something happens to you. Explain that they will have to provide certain information to the court, including a criminal history, before the court will appoint them formally as guardian. The court may also require the guardian to go through an investigation. Usually, an investigation doesn’t mean that the guardianship is more likely to be denied or that the judge has seen red flags. In some jurisdictions, it is just the court’s policy to investigate everyone. Because the judge is entrusting the guardian with raising the child, he or she usually wants to check and make absolutely sure that the guardian is able to take the responsibility."
    },
    {
      "title": "Understand the responsibilities of the guardian of the estate.",
      "content": "Understand the responsibilities of the guardian of the estate. The person who will have control over your child’s finances and property is know as the “guardian of the estate.” This person will make all decisions regarding your child’s finances and property until your child is 18. [6] X Research source If you want, you can appoint the same person as you appointed to be the guardian of the person to this position, however, you can also appoint someone else. [7] X Research source Because managing finances and property does not require knowing the child well, many people appoint an attorney or an accountant to be the guardian of the estate."
    },
    {
      "title": "Consider people you trust.",
      "content": "Consider people you trust. Once a guardian of the estate is appointed, that person will have the discretion to handle your child’s finances and properties as they see fit until your child is 18; therefore, any specific instructions that you put in your will regarding those assets (e.g., if you leave your house to your child with the instruction that he can never sell it) do not have to be followed by the guardian. Regardless of what instructions you leave for the use of your child’s assets, the guardian has the duty to handle the assets in the best interests of your child, which may include disregarding instructions. Aside from leaving any property to your children, you do not need to put any other instructions in the will on how the property should be handled."
    },
    {
      "title": "Consider paying the guardian of the estate.",
      "content": "Consider paying the guardian of the estate. Usually, the guardian of the estate will spend time and resources handling your child’s finances. It is customary to pay the guardian of the estate for doing this. However, you do not need to specify how much the guardian should receive, and you do not need to leave the guardian assets in the will. All states have provisions in their probate codes regarding how much a guardian will be paid. To look at the rules for your state, check: https://www.findlaw.com/estate/planning-an-estate/state-laws-estates-probate.html"
    },
    {
      "title": "Ensure that the guardian of the estate has control over all assets.",
      "content": "Ensure that the guardian of the estate has control over all assets. Assets such as life insurance policies are not passed in a will; however, the guardian of the estate will have control over any benefits received from a life insurance policy because he will be named in the will as guardian of the child’s estate, and the life insurance policy is a part of that estate. Make sure that the guardian is in control of any life insurance accounts where your child is listed as the beneficiary. Unlike property that passes in a will, your beneficiaries should receive money from the life insurance policy as soon as the company is informed of your death. There is no probate process for a life insurance policy. Once the beneficiary receives the money, the guardian has the power to take possession of the money and use it for the child’s benefit. If you need to add a child as a beneficiary or remove a child, simply contact your life insurance policy and tell them that you want to change the beneficiaries of your life insurance policy."
    },
    {
      "title": "Consider a family trust as well.",
      "content": "Consider a family trust as well. A family trust is another option when it comes to providing for children. A trust can potentially help avoid probate, allow control over assets after death, and even save families money on estate and inheritance taxes. The correct option for your estate depends upon your specific situation. Consult with an attorney before deciding and have the attorney oversee the process since both wills and trusts are complicated matters."
    },
    {
      "title": "Understand community and common law property.",
      "content": "Understand community and common law property. States fall into one of two categories with regard to property that you can bequeath when a spouse is involved. The two categories are community property and common law property. [8] X Research source In community property states, half of a couple's estate accumulated during the marriage belongs to the spouse. Therefore, the will cannot give away property that belongs to the spouse unless each party signed a prenuptial agreement with regard to the estate. Community property states are Arizona, California, Idaho, Louisiana, Nevada, New Mexico, Texas, Washington, and Wisconsin. Residents of Alaska may also choose the community property system by signing an agreement to do so. [9] X Research source In common law property states, which is every other state not listed above, the person owns anything on which he or she is the sole signer for the deed, contract, or other ownership documents. The person can bequeath any of this property as he or she sees fit. [10] X Research source"
    },
    {
      "title": "Take superseding agreements into account.",
      "content": "Take superseding agreements into account. Various types of legal agreements—prenuptial, ante-nuptial, divorce settlements, trusts, etc.—control where assets go upon your death. A will does not cover these assets. Before you create a will, determine if any previous agreements control the distribution of any part of your property."
    },
    {
      "title": "Identify yourself on the will to prevent any confusion.",
      "content": "Identify yourself on the will to prevent any confusion. Identify yourself by name, social security number, and address. Placing these identifying factors on your will helps to ensure that your will isn't confused with that of someone else who has the same name. You may also include your date of birth to further identify yourself. If you don't have a social security number, provide a different form of ID, such as a driver's license or state issued ID number."
    },
    {
      "title": "Make a declaration.",
      "content": "Make a declaration. State clearly that you are of sound mental health and of contractual capacity and that this will expresses your last wishes. Without this important step, it could be argued that your will is not legally viable. In addition to this statement, you may want to videotape the execution of the will to put to rest any future allegations of incapacity. If you think that your will could be subject to a challenge of undue influence, contact an attorney who can help you protect the will from the challenge. Such challenges may stem from “unnatural dispositions,” including cutting your family out of the will, giving all of your assets to someone that is not in your family if you have living family members, and giving your assets to someone that you have not known for very long. Declarations should be to the effect of: \"I declare that this is my last will and testament, and that I hereby revoke, annul and cancel all wills and codicils previously made by me, either jointly or severally.” [11] X Research source You should also include a statement to the effect of: “This last will expresses my wishes without undue influence or duress.” [12] X Research source This proves you were in no way coerced to state the will."
    },
    {
      "title": "Include family details.",
      "content": "Include family details. If you're leaving part of your estate to a spouse, children or other family members, they should be named as such in your will. Include the following lines, if appropriate: I am married to [spouse’s first and last name], hereafter referred to as my spouse. I have the following children: [list children's first and last names as well as their dates of birth]."
    },
    {
      "title": "Appoint an executor (known in some states as a \"personal representative”).",
      "content": "Appoint an executor (known in some states as a \"personal representative”). This person will ensure that your will is followed. You may also want to name a secondary executor is the first is unable to perform the duties at the time of your death. [13] X Research source Language for appointing an executor should include: I hereby nominate, constitute and appoint [executor's first and last name] as Executor. If this Executor is unable or unwilling to serve, then I appoint [backup executor's first and last name] as alternate Executor."
    },
    {
      "title": "Empower the guardian.",
      "content": "Empower the guardian. In this section you authorize the guardian or guardians of your children to act in their best interest regarding how they are raised and the treatment of their assets. State the name of the guardians and in what capacity they will serve. For instance, you should label the “guardian of the person” and “guardian of the estate,” so there is no confusion. Although not required, you can write clauses empowering the guardian of the estate to sell any real estate that you leave to your children, invest for your children, and open and handle bank accounts for your children."
    },
    {
      "title": "Bequeath your assets.",
      "content": "Bequeath your assets. State the way in which your assets will be divided among people using percentages, which should add up to 100%. For example, one line might read, “To my mother, Barbara Smith, I bequeath Five (5%) Percent.” Include provisions that clearly explain who gets a beneficiary's gift if that person dies before you. If you leave it at that and do not name an alternate to specifically receive Barbara's gift, her gift will \"lapse\" and go back into the pot."
    },
    {
      "title": "Include conditional gifts.",
      "content": "Include conditional gifts. You can also include conditional gifts in your will. However, if the conditions specified as a prerequisite to receiving the gift are against any other laws the court will not enforce them. For example, you can condition a gift on the beneficiary graduating from college, but you cannot condition a gift on the beneficiary marrying a certain person that you want them to marry. [14] X Research source"
    },
    {
      "title": "State specific assets.",
      "content": "State specific assets. If you want a beneficiary to receive a specific asset, you may state that as well, and that particular asset will not be included in the percentages of your estate (the remainder) that is divided among other beneficiaries. For example, one line may read, “To Barbara Smith, I give my house at 123 Cherry Lane, and to Chauncey Gardner, I give 50% of the remainder.”"
    },
    {
      "title": "Be as specific as possible.",
      "content": "Be as specific as possible. Make sure that you are as specific as possible with your disposition and that you include any addresses of real estate, descriptions of any personal property, and full names of beneficiaries. If your assets change after you write the will, you should edit the will to include these changes, or execute a new will."
    },
    {
      "title": "Execute the will.",
      "content": "Execute the will. Signing the will in accordance with your state’s legal rules is called “execution.” Conclude the document with your signature, name, date, and location. In many cases it must be signed in the presence of two witnesses, who then sign a statement asserting that you are of legal age and sound mind and that you signed your will in their presence. [15] X Research source Before you sign the will, find out how it should be signed in your state. How you and your witnesses sign the will is a matter of state law and can affect its validity. Some of those state differences include whether you must sign or simply initial each page before the full execution at the end. Do not add any text after your signature; in many states, anything added below the signature will not be included as a part of the will."
    }
  ]
}