{
  "url": "https://www.wikihow.com/Train-a-Reactive-Dog",
  "title": "How to Train a Dog to Be Less Reactive",
  "steps": [
    {
      "title": "Start by mastering basic commands like “sit” and “stay.”",
      "content": "Start by mastering basic commands like “sit” and “stay.” Train your dog in the fundamentals to get a good foundation and build trust between you. Reactivity is much easier to address if your dog more consistently responds to everyday commands. [1] X Research source Dog behavior and training expert Haley Yates adds, “If you teach the dog [commands] and give the dog a job, they start to feel so much more secure.” Other useful general commands include down, come, and leave it."
    },
    {
      "title": "Identify what triggers your dog’s reactivity.",
      "content": "Identify what triggers your dog’s reactivity. Reactive dogs are often responding to certain stimuli, like other dogs, or anything from hats to certain toys to even certain breeds. [2] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Take note of when and why your dog becomes reactive so that you can address the actual problem. Dog trainer David Levin adds, “First identify the threshold at which the dog can no longer responsively work with you around that stimulus…You want to stay under that line.” Some reactive dogs may become that way while resource guarding, or protecting food or toys that they instinctively think are scarce. These triggers may be caused by experiences in the dog’s past, or be instinctual or breed-specific."
    },
    {
      "title": "Teach your dog to “check-in” and regularly look at you.",
      "content": "Teach your dog to “check-in” and regularly look at you. In your home, stand with your dog on a leash. Don’t give any commands, and every time your dog looks at you, offer them praise and a training treat . [3] X Research source Then, practice this while outside on a walk. This keeps your dog’s attention on you, rather than possible triggers, which both distracts them and makes it easier to give commands. Do this training for 5 minutes at a time each day, until your dog regularly “checks in” with you while walking."
    },
    {
      "title": "Establish a “positive interrupt” noise to get your dog’s attention.",
      "content": "Establish a “positive interrupt” noise to get your dog’s attention. Choose a noise that’ll be your go-to to distract your dog from triggers, like a kissing noise or a brief, low whistle. Make the noise, then offer your dog a treat. Repeat this for 5-10 minutes each day, until your dog consistently responds. [4] X Research source This gives you an easy way to command your dog’s attention if and when they become reactive."
    },
    {
      "title": "Train your dog to stand or walk at your side on a leash.",
      "content": "Train your dog to stand or walk at your side on a leash. While inside, or in a private yard, have your dog sit at your side while saying a command like “heel.” Once they’re in position, praise them and offer them a treat, or use a clicker . This lets them know exactly where you want them when you’re walking. [5] X Research source Once they get that down, take a step forward and repeat the command, and reward them when they follow you at your side. Continue doing this for 5-10 minutes at a time, once or twice a day, until they can walk by your side on command."
    },
    {
      "title": "Practice distracting your dog from its triggers.",
      "content": "Practice distracting your dog from its triggers. When you encounter a trigger on a walk or in your daily life, get your dog’s attention with your positive interrupt noise and offer continuous treats until the trigger is out of sight. [6] X Research source Don’t wait for your dog to react; be proactive. Certified dog trainer and behavior consultant Emily Fleisher explains, “What ends up happening is that the dog learns…‘I see this [trigger] and it pays to look away. And number two, yay, a [trigger], I get cookies!’” Don’t go out of your way to find triggers, and make sure you have complete control of your dog at all times."
    },
    {
      "title": "Approach the triggers slowly as long as your dog is calm.",
      "content": "Approach the triggers slowly as long as your dog is calm. When introducing dogs to other dogs, or to their triggers, only advance as long as your dog is calm. If your dog barks, lunges, growls, or shows other reactive behavior, you’ve gone too far, too fast. [7] X Research source Lead them away and block their view until they calm down, then continue on your walk. Avoid punishing your dog for reactive behavior , which tells them that encountering their triggers causes punishment, making them more reactive."
    },
    {
      "title": "Work with a professional trainer to help stubborn dogs.",
      "content": "Work with a professional trainer to help stubborn dogs. A professional dog trainer has plenty of experience with reactive behavior, and is armed with a number of tools and strategies to divert and discourage it. If you’re feeling stuck or frustrated, a trainer may be your best option. [8] X Research source"
    },
    {
      "title": "Take walks where you’re unlikely to see other dogs or triggers.",
      "content": "Take walks where you’re unlikely to see other dogs or triggers. Rather than exposing your dog to an onslaught of stressful triggers, opt to avoid triggers wherever possible. This means you may have to choose a less popular route, or walk during less busy times of day. [9] X Research source On your walks and during training, stay calm and collected. If your dog senses that you’re nervous, they’ll become nervous, too. [10] X Research source"
    },
    {
      "title": "Consider using a basket muzzle or harness on walks.",
      "content": "Consider using a basket muzzle or harness on walks. Safety is your top priority. If your dog is prone to aggression, fitting them with a basket muzzle can ensure they still get to enjoy the outdoors with much less risk of biting. [11] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Chest harnesses or gentle leaders can also help you safely control a dog that pulls or lunges."
    },
    {
      "title": "Feed your dog with puzzle or enrichment toys to stimulate them.",
      "content": "Feed your dog with puzzle or enrichment toys to stimulate them. Hide kibble in a special feeding toy , or scatter it around the house to keep your dog’s mind active. This helps them burn some energy and can release pent-up frustration. Dog trainer David Lenin says that puzzle feeders hone a dog’s impulse control, since they’re “learning to solve problems through indirect routes. This…increases a dog’s desire to work with you, and work hard.” Puzzle feeders can also reduce or distract from your dog’s resource-guarding instinct. Also, be sure to offer your dog plenty of other stimulation in the form of chew toys and playtime to keep them busy and content."
    },
    {
      "title": "Stick to a routine to make your dog more comfortable.",
      "content": "Stick to a routine to make your dog more comfortable. Dogs like structured, predictable schedules. If possible, wake up, go on walks, offer food, and do your other activities on a consistent timetable to help your dog feel secure. [12] X Research source Unpredictable or inconsistent routines can make your dog feel on edge or anxious, worsening their reactivity."
    },
    {
      "title": "Advocate and stand up for your dog.",
      "content": "Advocate and stand up for your dog. You may need to turn away strangers who want to pet your dog, or ward off overly friendly dogs that approach, and ask their owners to leash them. Do what you need to do to make sure your dog is safe and comfortable. [13] X Research source Sometimes, you may come across as rude, but it’s better to be a bit rude and safe than polite and unsafe."
    },
    {
      "title": "Stay patient and sympathetic to your dog’s needs.",
      "content": "Stay patient and sympathetic to your dog’s needs. Your dog probably won’t improve overnight; it’ll take some work. Some dogs retain some reactivity their entire lives. It’s not their fault, and it doesn’t make them bad dogs! The most important thing you can do is be patient , understanding, and accommodating. [14] X Research source"
    },
    {
      "title": "Take note of behaviors like whining, growling, or bristling.",
      "content": "Take note of behaviors like whining, growling, or bristling. Keep an eye on your dog’s body language, and remove them from the situation if they show signs of reactivity or aggression. These include: [15] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Barking Tucking their tail Showing the whites of their eyes Intense eye contact or nose pointing Showing their teeth Tensed muscles with their weight positioned forward"
    },
    {
      "title": "Rest easy when your dog shows friendly signs like tail wagging.",
      "content": "Rest easy when your dog shows friendly signs like tail wagging. Knowing the telltale behaviors of a relaxed dog helps you understand when your training is making progress, and when your dog is happy and comfortable around their triggers. These signs include: [16] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source “Happy” expression with an open mouth Play bowing Relaxed ears Rolling over Blinking often Relaxed muscles"
    },
    {
      "title": "Reactivity can be caused by genetics or poor socialization.",
      "content": "Reactivity can be caused by genetics or poor socialization. Some dog breeds, like German Shepherds or terriers, can be reactive by nature—they were bred that way to do a certain job. Other dogs may be reactive because they lacked proper exposure to other dogs when they were younger. [17] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source In most cases, reactivity is a fear response, as your dog warns others that it feels uncomfortable in their presence."
    },
    {
      "title": "Reactivity is different from aggression.",
      "content": "Reactivity is different from aggression. Aggression is an actual act of lashing out, like lunging, biting, or chasing. When dogs are reactive, they’re often actually trying to avoid a fight or aggression by warning those around them that they feel unsafe. [18] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Note that behaviors like puppy nipping or roughhousing are signs of play, not aggression. Also, dogs that unexpectedly show signs of aggression that aren’t typical for that dog may actually be sick or in distress."
    }
  ]
}