{
  "url": "https://www.wikihow.com/Tune-a-Piano",
  "title": "How to Tune a Piano",
  "steps": [
    {
      "title": "Shop at online specialty shops.",
      "content": "Shop at online specialty shops. Piano tuning tools can be hard to find, and may not be available at retail locations where you would normally find musical instrument supplies. Large online retailers such as Amazon and eBay carry piano tuning tools, but the majority of these are low quality tools from no-name brands. You will have to do a little extra research if you want to make sure you're getting a quality product. Search for the name of the manufacturer, and read reviews carefully. Look for reputable online specialty shops that specialize in selling piano supplies to professional piano technicians. Low quality tools will make the job harder and can potentially damage the piano. [2] X Research source"
    },
    {
      "title": "Get a piano tuning lever.",
      "content": "Get a piano tuning lever. The piano tuning lever may also be called a hammer, wrench, or key. This is perhaps the most important tool in your piano tuning tool kit, so be prepared to spend a little more money to get one of quality. [3] X Research source Look for a model labeled \"apprentice,\" \"student,\" or \"craftsman.\" These are professional-grade tools designed for beginners. You can usually find one for around $50. [4] X Research source Generally, price is an indicator of quality. Buying a tuning lever is not the time to shop for bargains. Get the best lever you can within your budget."
    },
    {
      "title": "Choose the right tip size.",
      "content": "Choose the right tip size. Tuning levers have different sized tips. A larger tip will grab the pin further down and feel looser, while a smaller tip will grab the pin higher. If you're not sure what size to get, choose a #2. It's industry-standard and will work on most pianos. [5] X Research source The smaller tip size, #1, is used on some European piano models. Some professional tuners prefer #1 for more control, but it's far easier to start with a #2. When tuning a restored piano whose tuning pins have been replaced with oversized pins, a tip #3 may be used."
    },
    {
      "title": "Invest in a quality chromatic tuner.",
      "content": "Invest in a quality chromatic tuner. An electronic tuner provides a reference frequency for you so that you don't tune the note too sharp or too flat. You need a piano tuner, not a guitar tuner because guitar tuners won't be able to recognize or correctly tune all the notes on a piano. [6] X Research source A dedicated electronic piano tuning device like the Sanderson Accu-Tuner will set you back anywhere between $500 and $1,600."
    },
    {
      "title": "Try tuning software instead of a dedicated tuning device if your budget is more limited.",
      "content": "Try tuning software instead of a dedicated tuning device if your budget is more limited. Several companies offer piano tuning software that may give you more control than a chromatic tuner. [7] X Research source These programs typically retail for $300 or more, but you may be able to take advantage of a free trial before you purchase."
    },
    {
      "title": "Buy mutes.",
      "content": "Buy mutes. Buy a variety of mutes appropriate for different kinds of pianos. Narrow rubber wedge mutes with wire handles might work best for upright pianos, while wider felt wedge mutes might work better for grand pianos. Mutes that work well with lower strings may not fit at all on the higher, shorter strings of the treble side of the piano. [8] X Research source Mutes themselves are relatively inexpensive, typically only a few dollars apiece. Get some standard rubber mutes, a pair of plastic tweezer mutes for treble notes on an upright piano, and maybe a felt strip mute for tuning the \"temperament\" in the middle of the piano."
    },
    {
      "title": "Gather basic tools and remove the piano's external panels.",
      "content": "Gather basic tools and remove the piano's external panels. To tune a piano, you will have to take it (partially) apart to get to the strings and tuning pins. Examine your piano and determine what screwdrivers or other tools you'll need to take it apart. [9] X Research source For a grand piano, simply prop open the lid and remove the music desk. For an upright piano, you will need to open the top first, then remove the front panel, which is usually attached on both sides with screws or latches. Remove the felt practice mute if there is one, and the key cover if it's in the way. [10] X Research source Expect the inside of the piano to be dusty. A feather duster or rag may come in handy. You also may want to grab a flashlight or other light source. Even in a bright room, it can be hard to see detail inside the piano."
    },
    {
      "title": "Get familiar with the strings and pins.",
      "content": "Get familiar with the strings and pins. Before you start working on the piano, play it a little with the panels off. Pay attention to which strings go with which keys, and which tuning pins go to which strings, so you don't end up trying to tune the wrong string later on. It is helpful to have a decent understanding of music theory before you try to tune a piano. You should at least understand interval relations of notes like octaves and fifths, because you aren't going to tune each note to perfect pitch. Rather, you tune the notes to each other according to concepts called \"stretch\" and \"inharmonicity\"."
    },
    {
      "title": "Start with the A above middle C.",
      "content": "Start with the A above middle C. The common tuning for most pianos is A440, meaning that the A4 is tuned so that sound waves vibrate at 440Hz. This is the standard concert pitch in most of the Western world, although European tuning is often slightly higher at 442Hz. A mid-treble note, such as middle A, typically has three strings per note. Mute two of the strings so that only the third can be heard. Tune that string until your chromatic tuner or app indicates that it is in tune. Then tune the other two strings to match that first string. The other strings are called the unisons . When tuning the unisons, do it by ear – don't tune the unisons using your software or chromatic tuner. [11] X Research source"
    },
    {
      "title": "Turn the pin to tune the string.",
      "content": "Turn the pin to tune the string. Place your tuning lever on the top of the pin and make very slight movements to turn the pin. You only want the tiniest of movements or you could snap the string, so you may want to practice first so you have good control of your lever. [12] X Research source Remember the phrase \"righty tighty, lefty loosey.\" If you turn the pin right (clockwise), you increase tension of the string to raise the pitch. Turning it left (counterclockwise) will lower the pitch. Avoid excessively wiggling or twisting the pin. If it becomes loose or damaged you'll need to call in a pro and have it repaired. Steady hands are important. Make a slight turn, check the pitch, then repeat. The string is in tune when its tone sounds \"in sync\" with the neighboring strings of that note, or when the indicator on your chromatic tuner or software program stabilizes to show that the note is in tune."
    },
    {
      "title": "Set the pin.",
      "content": "Set the pin. Once you've found the right pitch, you need to set the pin so it doesn't easily slip out of tune again. As you zero in on the pitch, tighten the pin with a slight turn clockwise to overshoot the pitch just a hair, then turn it even more slightly counterclockwise to loosen it back to the correct pitch. [13] X Research source You may find it easier to tune with short controlled jerks on the tuning lever instead of slower smooth pulls. You can test whether a string is stable by playing the note loudly a few times to make the string jump and slide over the friction points between the singing length and the tuning pin. [14] X Research source It takes practice to get this delicate movement correct. Don't expect the first piano you tune to stay that way. After you've tuned several pianos (or tuned the same piano several times), you'll have a better feel for how to set the pin correctly."
    },
    {
      "title": "Tune in octaves relative to the first note tuned.",
      "content": "Tune in octaves relative to the first note tuned. Once you have middle A, use middle A to tune lower A. Then use lower A to tune the note one fifth above, and so on. Move along the keyboard using these intervals until the entire piano is tuned. Unless you are working with a severely neglected piano that hasn't been tuned in years, you'll typically find that you don't have to tune all the notes. [15] X Research source"
    },
    {
      "title": "Check your progress by playing intervals.",
      "content": "Check your progress by playing intervals. As you go, check the intervals and make sure they sound right. Octaves, fourths, and fifths should sound even and smooth, while thirds and sixths will have a flutter to the sound that gets faster as you move higher on the piano. If something sounds sharp or flat, you can go back and correct it before moving on. As you move through the notes, you're going to be tuning more and more of the notes by ear rather than relying on your software or your chromatic tuner. If you tune every note using your chromatic tuner, by the time you cycle back to the original note it will sound sharp. Tuning your piano by ear will get easier as you gain experience. If you plan to advertise yourself as a piano tuner, you must get lots of practice tuning before you try to do it for others."
    },
    {
      "title": "Play the piano after you're done.",
      "content": "Play the piano after you're done. Before you replace the panels, give the piano a quick play to make sure it sounds okay and all the notes have stayed in tune. Especially if this is your first time, you may find that you need to go back and do a little more work on it. Even for professional tuners, some pianos can take several days to tune correctly, especially if they haven't been tuned in quite some time or if they are played heavily. Patience is key if you want to tune a piano."
    }
  ]
}