{
  "url": "https://www.wikihow.com/Weld-Underwater",
  "title": "How to Weld Underwater",
  "steps": [
    {
      "title": "Identify the site and material of the joint to be welded and clean it.",
      "content": "Identify the site and material of the joint to be welded and clean it. Most underwater welds involve steel, but metals may vary."
    },
    {
      "title": "Prepare a chamber to place around the joint (each joint should have a separate chamber).",
      "content": "Prepare a chamber to place around the joint (each joint should have a separate chamber). Chambers range in size - some are large enough to fit several welder-divers, others are only small enough for the welding electrode."
    },
    {
      "title": "Introduce gas into the chamber and pump out the water.",
      "content": "Introduce gas into the chamber and pump out the water. A typical gas mixture uses helium and oxygen, but requirements vary based on the specific joint to be welded. The pressure of the chamber should be slightly above that of the surrounding water."
    },
    {
      "title": "Run a power supply to the chamber and set up a port for your electrodes.",
      "content": "Run a power supply to the chamber and set up a port for your electrodes. Multiple electrodes will likely be required, and should be placed in advance in front of the area of the joint to be welded."
    },
    {
      "title": "Dive to the weld site.",
      "content": "Dive to the weld site."
    },
    {
      "title": "Turn on the power supply and weld the joint from outside the chamber.",
      "content": "Turn on the power supply and weld the joint from outside the chamber."
    },
    {
      "title": "Turn off the power supply as soon as the welding is done.",
      "content": "Turn off the power supply as soon as the welding is done."
    },
    {
      "title": "Investigate and clean the joint to be welded; identify the types of metals involved.",
      "content": "Investigate and clean the joint to be welded; identify the types of metals involved."
    },
    {
      "title": "Prepare the adequate electrodes, plan out the order of welding and dive to the weld site.",
      "content": "Prepare the adequate electrodes, plan out the order of welding and dive to the weld site."
    },
    {
      "title": "Weld the joint, ensuring that the flux coating of the weld is coming off as expected, and that too much hydrogen is not approaching the joint.",
      "content": "Weld the joint, ensuring that the flux coating of the weld is coming off as expected, and that too much hydrogen is not approaching the joint."
    },
    {
      "title": "Turn off the power supply as soon as the welding is done.",
      "content": "Turn off the power supply as soon as the welding is done."
    }
  ]
}