{
  "url": "https://www.wikihow.com/Wrap-a-Sprained-Thumb",
  "title": "How to Wrap a Thumb Sprain",
  "steps": [
    {
      "title": "Hold your hand in a “C” shape and wrap your wrist with sports tape.",
      "content": "Hold your hand in a “C” shape and wrap your wrist with sports tape . Position your hand as if you are holding a soda can or going in for a handshake. Then, grab a roll of adhesive sports tape or an elastic compression bandage . Unravel a bit of the tape or bandage and place it over the bony bump on the top of your wrist. Then, wrap your wrist in a comfortable (but not too tight) loop, going around it 2 times. [1] X Research source Wrapping your wrist first creates an anchor, which helps to support and stabilize your thumb. Make sure you are not cutting off your circulation with the anchor. Your hand and/or fingers will tingle, feel cooler to the touch, and start to turn blue if the wrap is too tight. Ask a family member or friend for help if you’re having difficulty wrapping your thumb by yourself."
    },
    {
      "title": "Wrap the tape around the base of your thumb.",
      "content": "Wrap the tape around the base of your thumb. Pull the tape or bandage over to the outside of your thumb (the side that faces your palm) and lay it over the base where your thumb connects to your hand. Then, loop the tape around the inside of your thumb. [2] X Research source The wrap should feel comfortably tight but not so tight that it’s painful or causes your thumb to lose circulation. Feel free to wrap your thumb in the opposite direction by wrapping the tape around the inside of your thumb (the side that faces your fingers) and looping it around the outside. Just start the tape on the underside of your wrist."
    },
    {
      "title": "Loop the tape around your wrist and wrap it around your thumb again.",
      "content": "Loop the tape around your wrist and wrap it around your thumb again. Bring the tape or bandage back around the underside of your wrist and over the bony bump. Then, loop the tape around the base of your thumb, slightly overlapping the first wrap so the tape goes further up your thumb. Just wrap it from the outside of your thumb to the inside again. [3] X Research source"
    },
    {
      "title": "Wrap the tape around your wrist and thumb one more time.",
      "content": "Wrap the tape around your wrist and thumb one more time. Loop the tape or bandage back around the underside of your wrist and over the bony bump again. Then, bring the tape over the outside of your thumb and around the inside, slightly overlapping the second wrap so the tape is higher up your thumb. [4] X Research source"
    },
    {
      "title": "Wrap your thumb in the opposite direction twice for extra stability.",
      "content": "Wrap your thumb in the opposite direction twice for extra stability. As an optional step, loop the tape back around your wrist and bring it up to the inside of your thumb (the side that faces your fingers). Then, wrap the tape around the outside of your thumb. Simply repeat this a second time, slightly overlapping the first loop, to create a more secure and stable wrap. [5] X Research source"
    },
    {
      "title": "Cut the tape or bandage and secure it to your wrist.",
      "content": "Cut the tape or bandage and secure it to your wrist. Wrap the tape or bandage back around your wrist a final time. Then, use a pair of sharp scissors to cut the tape. Simply use a strip of medical tape or regular adhesive tape to secure the sports tape or bandage to your wrist. [6] X Research source"
    },
    {
      "title": "Check the circulation of the affected thumb.",
      "content": "Check the circulation of the affected thumb. Pinch the nail on your thumb for 2 seconds. Then, look at your nail immediately after you let go. If the nail becomes pink again after 1 or 2 seconds, then your thumb has good circulation. If it takes more than 2 seconds for your nail to turn pink again, the bandage may be too tight. Simply remove the bandage and wrap your thumb again using a slightly looser grip. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Numbness, tingling, or a sense of pressure can also indicate the bandage is applied too tightly."
    },
    {
      "title": "Visit your doctor if you’re experiencing persistent pain or swelling.",
      "content": "Visit your doctor if you’re experiencing persistent pain or swelling. If it’s been 2 days and your thumb is still painful or swollen, call your healthcare provider. This can be a sign that your thumb is a more severe sprain, fractured, dislocated, or even broken. Your doctor will diagnose your injury and come up with a treatment plan. [8] X Research source If the pain is very intense, visit your healthcare provider as soon as you can. If you are at school or a competition, there is usually a medical professional there to help. To diagnose your thumb injury, your doctor will ask you questions about how and when you injured it and gently test its mobility. They will likely take an X-ray or MRI to determine the severity of the injury and how to treat your thumb. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Follow your doctor’s treatment plan.",
      "content": "Follow your doctor’s treatment plan. If your thumb is mildly or moderately sprained, your doctor will typically suggest wearing a thumb spica splint or wrapping your thumb; they will be able to do it for you in the office. If your thumb is severely sprained or fractured, it may require surgery and occupational therapy. So, follow what the doctor outlines for your treatment. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Ask about taking pain relievers to lessen any pain.",
      "content": "Ask about taking pain relievers to lessen any pain. If your thumb is painful and swollen, talk to your healthcare provider about which pain relievers are most helpful. In general, most over-the-counter pain relievers like aspirin and ibuprofen can help with pain and swelling. However, your doctor may prescribe you something stronger if they think you need it. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Follow your doctor’s recommendations on how often and long you should take the pain relievers."
    },
    {
      "title": "Follow the RICE protocol to speed up recovery time.",
      "content": "Follow the RICE protocol to speed up recovery time. The acronym RICE stands for Rest, Ice, Compression, and Elevation. Many doctors encourage you to follow this home treatment as a way to move toward recovery: [12] X Research source Rest your thumb on a soft surface and refrain from using it as much as possible for at least 48 hours. For instance, do not partake in physical activities that could injure it further. Apply ice to your thumb to help reduce pain and swelling. Simply wrap a bag of ice or frozen peas in a towel and hold it against your thumb. Keep it there for 15 to 20 minutes and repeat 4 to 8 times each day. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Compress your thumb by wrapping it with sports tape or a bandage to help reduce swelling. Or, wear a thumb spica splint. Elevate your thumb so it’s above your heart whenever you’re resting. For instance, prop up your arm on a pillow or cushion to keep your thumb raised."
    },
    {
      "title": "Avoid HARM in the first 72 hours of your recovery.",
      "content": "Avoid HARM in the first 72 hours of your recovery. HARM stands for Heat, Alcohol, Running, and Massage. These 4 elements have been found to impair your ability to heal quickly. In some cases, they can make the sprain worse. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For instance, avoid using a hot compress on your thumb or soaking it in a warm bath."
    },
    {
      "title": "Take medications to ease the pain of a sprained thumb.",
      "content": "Take medications to ease the pain of a sprained thumb. Non-steroidal anti-inflammatory drugs (NSAIDs) like ibuprofen can help relieve pain and swelling caused by a sprained thumb. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source They work to reduce inflammation caused by the sprain. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source The recommended dose of ibuprofen for adults is 1 to 2 200mg tablets taken up to 3 times each day. Eat something when you take the ibuprofen to avoid getting an upset stomach. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Alternatively, use an NSAID gel . You apply it to the skin where the pain is most severe. Simply massage the gel into your skin so that it is absorbed fully. Note : Always follow the dosage instructions on the bottle of medication or your doctor’s orders to ensure you’re taking the medication safely."
    },
    {
      "title": "Use arnica to prevent bruising.",
      "content": "Use arnica to prevent bruising. Arnica is an herb that can help to reduce bruising and swelling caused by a thumb sprain. Simply rub a bit of arnica cream, gel, or salve directly onto the painful area. [18] X Research source"
    },
    {
      "title": "Do thumb mobility exercises if your doctor recommends them.",
      "content": "Do thumb mobility exercises if your doctor recommends them. When you sprain your thumb, your thumb’s range of motion will most likely become restricted. To help regain your range of motion, your doctor might recommend that you do some thumb exercises, such as the following: [19] X Research source Rotate your thumb in circles. Pick up small objects, like marbles or pencils. Put a little pressure on your thumb as you squeeze the object. Repeat for 5 minutes. Squeeze a small ball in one hand. Hold for 5 seconds. Repeat. Do 2 sets of 15 to help strengthen your grip. Move your thumb away from the rest of your fingers. Keep it as far away from your fingers as you can for 5 seconds, and then return it back to its normal position. Bend your thumb down towards your palm. Keep your thumb as close to your palm as you can for 5 seconds. After 5 seconds, return it back to its normal position. Move your thumb away from your palm. This action should be like you are doing a coin toss. Extend your thumb away from your palm for 5 seconds, then return it to its normal position. Do not apply any external forces to the sprain until late into recovery, if at all. Allow your sprained thumb to do the work — don't pull it or hold it with your other hand."
    },
    {
      "title": "Eat a healthy diet to promote healing.",
      "content": "Eat a healthy diet to promote healing. A healthy diet can help you to recover more quickly. In particular, repairing a sprained thumb requires protein and calcium. Try not to use your thumb while you eat to avoid further injury. For a balanced diet, eat lots of fresh fruits and vegetables, lean proteins, whole grains, and Omega fatty acids. Make sure to drink plenty of water, too. [20] X Research source Limit your intake of fatty, starchy, or sugary foods."
    },
    {
      "title": "Identify the symptoms of a sprained thumb.",
      "content": "Identify the symptoms of a sprained thumb. If you are not sure that you have actually sprained your thumb, it is helpful to know what symptoms to look for. These symptoms include: [21] X Research source Pain and tenderness Swelling Bruising Limited mobility/range of motion Loose or unstable thumb joint Difficulty grabbing things"
    },
    {
      "title": "Familiarize yourself with the most common causes of a sprained thumb.",
      "content": "Familiarize yourself with the most common causes of a sprained thumb. Most sprains are caused by your thumb stretching too far backward from your palm, which can overstretch or tear the ligament. While you can sprain your thumb in a variety of ways, the most common causes of a sprained thumb include: [22] X Research source Sports that involve catching or throwing a ball, like basketball, volleyball, or football. Skiing and falling with the ski pole in your hand. Contact sports like rugby and martial arts. Falling. Repetitive activities that involve the thumb and put excessive pressure on its joints."
    },
    {
      "title": "Understand why thumb wrapping is beneficial.",
      "content": "Understand why thumb wrapping is beneficial. Wrapping a sprained thumb not only helps stabilize the injured thumb, but it also compresses it. Compression helps stimulate the flow of lymph fluid, which carries important nutrients to the damaged tissues surrounding the injury. Lymph fluid also removes waste from cells and body tissues, which is an important function during the tissue regeneration process. Wrapping the thumb also speeds the recovery process and keeps the injury from getting worse. [23] X Research source In order to be completely effective, the bandage must be removed, the injury left to rest, and the bandage re-applied a few times a day. In this way, the lymphatic system can complete its evacuation of the injury site."
    }
  ]
}