{
  "url": "https://www.wikihow.com/Tone-Legs-While-Sitting",
  "title": "How to Tone Legs While Sitting",
  "steps": [
    {
      "title": "Rotate your ankles.",
      "content": "Rotate your ankles. Lift up one leg and slowly rotate your ankle clockwise. Keep rotating for about 5 seconds, then switch to rotating counterclockwise. Repeat the rotation at least 10 times on both feet. [1] X Research source This will help tone your lower legs and increase your ankle flexibility. If you don’t want to count, set a timer for 1 minute instead."
    },
    {
      "title": "Try the foot alphabet.",
      "content": "Try the foot alphabet. Take off your shoes and sit up straight with both feet on the floor. Lift one foot off the ground, then write the alphabet in the air with your big toe. When you’re done, repeat that with your other foot. [2] X Research source This helps build your quadricep muscles as well as the muscles in your lower legs and feet. As you get stronger, try doing the alphabet multiple times on each foot."
    },
    {
      "title": "Grip small objects with your toes.",
      "content": "Grip small objects with your toes. Take your shoes off and place 10 small objects (like marbles) on the ground. Use your toes to pick up the marbles one by one and place them into a cup or a bowl. Repeat this on both feet at least once. [3] X Research source This exercise helps strengthen your feet and calf muscles at the same time. You can also use pens, binder clips, or buttons."
    },
    {
      "title": "Do a few leg circles.",
      "content": "Do a few leg circles. Sit up straight and slowly lift one leg up. Keeping your pelvis still, rotate your leg in small, controlled, clockwise circles until your leg muscles are fatigued (usually about 30 seconds). Then, do counterclockwise circles until your leg is tired. Put your leg back on the floor and repeat with the other leg. [4] X Research source This works the hips and pelvis. Once your leg muscles are better developed, try doing larger and/or faster circles."
    },
    {
      "title": "Try leg extensions.",
      "content": "Try leg extensions. Sit up straight in your chair and lift one leg in front of you. Make a 90-degree angle with your body as you hold your leg up for about 4 seconds. Repeat this exercise 10 times on each leg. Breathe out as you lift your leg up, then breathe in as you lower it back down."
    },
    {
      "title": "Do upper leg lifts.",
      "content": "Do upper leg lifts. Sit up straight in your chair and slowly lift one leg in front. Keeping your leg raised at a 90-degree angle to your body, flex your thigh to move your leg up and down about 1 in (2.5 cm) in the air. Do this 10 times, then lower your leg down and then repeat it on the other side. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Try not to let your raised foot touch the floor during your 10 reps. This is a great quad exercise to help you tone and shape your thighs. If you’re having trouble balancing, put your hands on your hips."
    },
    {
      "title": "Do miniature squats.",
      "content": "Do miniature squats. Stand up from your chair and put your hands on your thighs for balance. Lower down toward your chair until you can feel the squat in your glutes and thighs, then lower yourself back down. Repeat the squat 12 times. [6] X Expert Source Julian Arana, M.S.eD., NCSF-CPT Certified Personal Trainer Expert Interview. 19 March 2020. If your chair has wheels, don’t try this exercise! Use a sturdy chair that won’t roll backward underneath you. Try to always keep your knees over your feet to hold the proper form."
    },
    {
      "title": "Try a seated march.",
      "content": "Try a seated march. Sit up straight with your feet flat on the ground. Lift up one knee at a time like you’re marching in place, but keep your rear flat on the seat. Do the march for about 1 minute, alternating between legs as you go. [7] X Research source Keep your core engaged to hold the right position for this workout. As you get stronger, try to lift your knees up higher and increase your tempo."
    },
    {
      "title": "Squeeze your glutes.",
      "content": "Squeeze your glutes. Lean forward in your chair at a 45-degree angle. Squeeze your glute muscles together and hold the squeeze for a few seconds, then release. Try doing about 15 to 20 reps to start. [8] X Research source As you build your muscles, you can try alternating between each glute or holding the squeeze for longer."
    },
    {
      "title": "Stretch your hamstrings.",
      "content": "Stretch your hamstrings. Sit up on the edge of your chair with your legs out in front of you. Slowly lower your chest down toward your thighs to stretch both of your hamstrings. Hold the stretch for about 10 seconds, then slowly lift your chest back up. [9] X Research source Try to stretch your legs every time you work out to avoid cramps or muscle aches. Only lower down as far as you can go without any pain. If it hurts, back up!"
    }
  ]
}