{
  "url": "https://www.wikihow.com/Teach-Yourself-Gymnastics",
  "title": "How to Learn Gymnastics for Beginners at Home: Stretching, Safety & More",
  "steps": [
    {
      "title": "Do a pike stretch.",
      "content": "Do a pike stretch. Sit on the ground with both legs straight in front of you with your toes pointed. Keep your knees locked, bend forward, and reach as far forward as you can with your hands. Keep your eyes and head down while you stretch and hold the position for 30-60 seconds. [2] X Research source Try repeating the stretch again with your feet flat and your toes pointed up at the sky. The pike stretch loosens up your calves and the backs of your legs."
    },
    {
      "title": "Move into a butterfly stretch",
      "content": "Move into a butterfly stretch . While you’re seated on the ground, tuck your legs in and move your knees down and out to the sides so the soles of your feet can come together. Cup your hands around your toes and press your knees down against the mat. [3] X Research source Lean forward to bring your head down towards your feet. Lean as far as you can and hold it for 30-60 seconds, then release."
    },
    {
      "title": "Work on your straddle stretch.",
      "content": "Work on your straddle stretch. Sit on the ground and open your legs about 90 degrees, keeping them straight. Reach both arms forward and bend, trying to get your stomach flat to the ground. Stretch as far as you can, even if you can’t make it all the way to the ground on your first try. [4] X Research source After stretching in the middle, reach both arms towards one of your feet and bend to the side, trying to get your nose by your knee. Repeat on the other leg. Try tucking your right arm down along your left leg and reach your left arm to your right foot. Keep your face sideways so your ear is near your knee. Repeat on the other side."
    },
    {
      "title": "Start with a somersault",
      "content": "Start with a somersault or forward roll. Crouch down and put both hands on the ground directly under your shoulders. Tuck your chin in toward your chest and lean forward until your head clears the floor. Roll down the length of your spine, keeping your legs “crouched” until your feet are underneath you again, then stand up. To get momentum in your roll, push lightly with your legs so you have the speed to make it back to your feet. Focus on rolling in one fluid motion, keeping your body curled as tight as possible. A somersault is one of the simplest skills to learn as a beginner. [5] X Expert Source Tanya Berenson Gymnastics Instructor Expert Interview. 22 May 2020."
    },
    {
      "title": "Do a backward roll",
      "content": "Do a backward roll once you master the forward roll. [6] X Expert Source Tanya Berenson Gymnastics Instructor Expert Interview. 22 May 2020. Squat with your weight over your heels and lower yourself until your behind touches the ground (use your hands to guide you if you need to). Rock backward and tuck your knees up toward your head. Tilt your head to one side and roll over your shoulder, using your hands to push through and assist you. [7] X Research source Complete the roll by touching down one knee at a time and then standing up. Push with your legs as you begin to rock backward to give you the power to complete the roll."
    },
    {
      "title": "Perform a bridge",
      "content": "Perform a bridge to work on flexibility and strength. Lie on your back with your knees bent and your feet flat on the ground. Bend your arms back so your palms are facedown on the ground beside your head with your fingers pointing toward your shoulders. Raise your hips and push up with your hands until your body is in an arched shape. [8] X Research source Keep your hands and feet planted firmly and hold the position for a few seconds, then slowly lower yourself back to the ground. Practice raising just your hips while keeping your shoulders on the ground if you're still building your upper body strength."
    },
    {
      "title": "Try a handstand",
      "content": "Try a handstand to develop upper body strength. Stand up and stagger one foot in front of the other. Lean forward at the waist, keeping your torso firm and straight and your arms extended over your head. At the same time, put both hands down on the floor and push upward with your back leg to elevate your feet. [9] X Research source Push upward through your shoulders and keep your arms locked. Grip the floor with your fingertips to maintain balance. [10] X Research source Lower one leg to the floor at a time to exit the move. Practice against a wall until you can kick up and balance comfortably. [11] X Research source If you’re falling backward, put on or both feet down to catch yourself. If you’re falling forward, turn slightly to one side and step outwards. [12] X Research source"
    },
    {
      "title": "Work on a cartwheel",
      "content": "Work on a cartwheel to practice coordinating all of your limbs. Stand with your hands at your side, then take a long step with your dominant leg and raise your arms up over your head. Shift your weight forward and lower your upper body toward the ground while you kick your back leg up forcefully behind you. The action is like a handstand, but you’ll set one hand down after the other (starting with the same side as your lead leg). Follow through with the kick and let it carry you up and over the top. [13] X Research source Land on your lead leg first, then the other. Practice cartwheels at a low angle until you master the timing, then gradually kick up harder to make your feet go higher and higher. A stable cartwheel helps you with more advanced moves like a one-handed cartwheel, a round-off, and certain aerial skills. [14] X Research source"
    },
    {
      "title": "Master the splits",
      "content": "Master the splits to work on flexibility. Get down on one knee and extend your back ankle so your toes are pointed. Move your front foot forward, pointing your toes while you go, and make sure to keep your knees, hips, and feet in alignment. Creep your front foot gradually forward, keeping your knee straight (not bending out to the side). [15] X Research source Inch forward as far as you can comfortably go, then hold it for a few seconds to stretch. As your flexibility improves, move your front foot all the way forward and lower yourself all the way to the ground. Keep your back leg straight and your toes pointed. This is more difficult than a dance split, which may have you turn your back leg out to the side slightly."
    },
    {
      "title": "Create a training schedule so you can practice regularly.",
      "content": "Create a training schedule so you can practice regularly. If you’re just starting out or you're young (5 or 6 years old), do 4-5 hours of practice per week. As you improve and get more serious, increase your time to 10 hours per week spread over 3-4 days. If you plan on competing, gradually increase your practice time to 15 hours per week over 4-5 days. [16] X Research source Competitive college gymnasts practice up to 20 hours per week because their moves are more dangerous and require lots of conditioning to perform safely. If you feel tired and notice your results are backsliding, take a day off to rest. It’s definitely possible to overtrain and risk injury or burnout!"
    },
    {
      "title": "Stretch daily, plus before and after every gymnastics practice session.",
      "content": "Stretch daily, plus before and after every gymnastics practice session. First, do 5-10 minutes of aerobic activity like jogging or jumping jacks to warm up your muscles. Then stretch your entire body from head to toe for at least 10 to 15 minutes. [17] X Research source Do static stretches . These are stretches you hold for 30-60 seconds. Static stretches include straddles, butterflies, bridges, and more. Include dynamic stretches . These are quick stretching movements you repeat several times in a row, like high kicks or lunges with a twist. Stretch for 5-10 minutes as a cool down after each practice or workout. You’ll probably be able to stretch farther than during your warmup! Always warm up and stretch before pushing your body with high-impact movements to avoid getting hurt. [18] X Expert Source Landis Owens Personal Trainer Expert Interview. 8 June 2021."
    },
    {
      "title": "Include moderate strength training in your non-gymnastics workouts.",
      "content": "Include moderate strength training in your non-gymnastics workouts. Work on your basic level of physical conditioning and build your muscular strength by performing calisthenics exercises. [19] X Expert Source Landis Owens Personal Trainer Expert Interview. 8 June 2021. Calisthenics are bodyweight exercises that work large muscle groups to improve your athleticism and poise, like pull-ups or planks. These exercises give you the strength and endurance you need to perform extreme moves with good form and grace. Some helpful moves to include are: Calf raises Chin ups Push ups Leg lifts Lunges Squats or Single-leg squats"
    },
    {
      "title": "Wear comfortable, form-fitting clothing you can move in.",
      "content": "Wear comfortable, form-fitting clothing you can move in. For a traditional look, wear a gymnastics leotard (some come with shorts attached if you prefer to be a bit more modest). Alternatively, wear comfortable shorts with a t-shirt or spandex shirt tucked in so it doesn’t cover your face when you’re upside down. [20] X Research source Pull long hair back into a ponytail or a braid to keep it out of your face. Avoid clothes with clasps, zippers, or buttons since these can get caught on equipment (if you have any) or injure your skin if you fall on them. Take out all jewelry and piercings before practicing, too."
    },
    {
      "title": "Bring a friend and a first aid kit to your practices in case of injury.",
      "content": "Bring a friend and a first aid kit to your practices in case of injury. Whenever possible, practice with someone who can spot you, give you first aid, or call for help if you have an accident. Bring a cell phone with you for emergency calls, and pack a first aid kit to treat minor bumps and cuts. [21] X Research source Unless you’re only practicing low-risk moves, make sure to have someone nearby who can help you in case of falls or spot you for high-level moves. [22] X Research source In gymnastics, accidents happen—some common ones include sprained ankles, pulled muscles, or even broken bones. Don’t let injuries or setbacks keep you from your goals. In most cases, full recoveries are possible and you'll be back on the mat in the future!"
    },
    {
      "title": "Practice on a cushioned surface like a gymnastics mat or grass.",
      "content": "Practice on a cushioned surface like a gymnastics mat or grass. If you don’t have access to a gym, place a gymnastics mat over your practice surface to cushion you if you fall and to safely absorb the shock of your landings. [23] X Research source If you don’t have a mat, try practicing outdoors in grass (never on cement). [24] X Research source If you’re outside, scan the ground for rocks, sharp sticks, and other dangerous objects and remove them before you do any moves. Try using low walls as vaults, tree stumps as a pommel horse, or hanging inexpensive gymnastics rings from sturdy garage rafters or high ceilings. Take advantage of playgrounds near you that have equipment like balance beams or uneven bars."
    },
    {
      "title": "Watch free video tutorials online.",
      "content": "Watch free video tutorials online. Try searching for instructional videos on specific moves or techniques on Google or YouTube. Make sure that the video was produced by an official gymnastics school or coach, or the information may not be trustworthy. Look for content that breaks down technique, unusual movements, or includes slow-motion demonstrations. [25] X Expert Source Tanya Berenson Gymnastics Instructor Expert Interview. 22 May 2020. Look for videos of moves you’re working to familiarize yourself with how they work and what they should look like. Take notes or pull the video up on your phone during practice so you have something to refer to."
    },
    {
      "title": "Read authoritative books and publications about gymnastics.",
      "content": "Read authoritative books and publications about gymnastics. Check out popular online magazines like International Gymnast or Inside Gymnastics for the best up-to-date tips and events and interviews with successful gymnasts and trainers. Search for old training manuals online to see how some of the best gymnasts ever practiced on documents sites like Scribd , too. You can find gymnastics manuals from CrossFit coaches and gymnastics training centers, too! [26] X Research source Look at the articles, photos, or videos these publications have to offer for new training exercises, technique tips, and workout plans."
    },
    {
      "title": "Attend online seminars about gymnastics.",
      "content": "Attend online seminars about gymnastics. Register for a webinar, video seminar, or virtual classroom led by experienced coaches and athletes (usually for a small fee). Double-check that the course is presented by a legitimate coach or institution before signing up, since wrong information can lead to injury or frustration. Some reputable places to look for courses include: [27] X Research source Masterclass Udemy Coachtube"
    }
  ]
}