{
  "url": "https://www.wikihow.com/Write-a-Comedy-Sketch",
  "title": "Everything You Need to Know to Write a Comedy Sketch",
  "steps": [
    {
      "title": "Figure out how you will present your comedy sketch.",
      "content": "Figure out how you will present your comedy sketch. Is your sketch for a movie script, a play, a speech in need of comedy, or maybe even a Youtube video? Depending on your mode of delivery, you can use other tools for comedic effect like props, costumes, lighting, or digital effects."
    },
    {
      "title": "Figure out who is your audience.",
      "content": "Figure out who is your audience. Certain kinds of comedy work for certain kinds of audiences. Avoid topics that are overly offensive or will bore your audience. Think about your audience's average age. If you are performing for children, use content geared towards younger people like teddy bears, ponies, or popular cartoons. If you are performing for adults, focus on topics for adults like sex, violence, international intrigue, politics, parenthood, or work. Think about the kinds of people in the audience. If you are into lowbrow comedy and your audience seems to be more highbrow, then you might want to consider their expectations. Remember what is funny to you, might be improper, insensitive, or outright offensive to others. Jokes about wealthy businessmen might work well in front of lower and middle class audiences, but will not be received in the same way by upper class people. There are some exceptions, when it is ok to be offensive. Roasts are events where people come together to make fun of someone. Keep in mind that even these events need to mix insulting jokes with levity."
    },
    {
      "title": "Research other comedy sketches.",
      "content": "Research other comedy sketches. Look online for well-known comedy sketches, sketch groups, and sketch programs like Monty Python and Saturday Night Live . Research is absolutely necessary for two reasons. First, it will show you what many people consider funny. Second, it will show you what has been done before. For the most part, you should try to be original, because humor depends on your audience not expecting your joke. [1] X Research source Know the genre(s) of comedy you fit into, as well as your prospective audience's expectations for that genre. You don't want to misrepresent yourself or your comedy."
    },
    {
      "title": "Brainstorm ideas.",
      "content": "Brainstorm ideas. Now that you know how you will present the material and your audience, what kinds of topics do you think they'll enjoy? You can't write a comedy sketch without doing the leg work first. There are many ways to brainstorm before writing. Think of suitable topics for your sketch. Write down ideas as they come to you. You never know when inspiration will strike. You could be at a store buying doughnuts and think of a good joke for a comedy sketch on food, eating, or exercising. Draw inspiration from popular movies, television shows, books, or comic strips. Some of the best comedy sketches are spoofs of other mainstream fictional or non-fictional works. For example, you could spoof the film series, Indiana Jones . He was a college professor, but most professors would never be as adventurous as him. In your spoof, you could play a \"realistic\" professor confronted by the same situations as Indiana Jones. Many people swear by free-word association. On a piece of paper write down a word (or central idea) and then list 5 words that automatically pop into your head. If any of the resulting pairs seem strange, you might have something worthy of comedy. For example, begin with the word bear. Now think of words or concepts that pop into your mind when you think of bears like: wild animal, dangerous, wrestle, fish-lover, or furry. Identify which one is interesting to you and you think will interest your audience. Maybe you choose to write a sketch on wrestling bears."
    },
    {
      "title": "Develop jokes from this research.",
      "content": "Develop jokes from this research. The best jokes are surprising and often absurd. Like a magician, comedians need to be skilled in the art of misdirection. Lead your audience in one direction with the beginning of a joke and then add a \"punchline\", that surprises them. For example: I once wrestled a bear. It weighed less than a pound and was stuffed with cotton. This joke uses the art of misdirection. The first sentence is the idea developed through word association. It makes you think that the following story will be about a person taking on a 400 pound grizzly bear, so it is funny when it turns out to be a stuffed teddy bear. This joke is funny too because it is equally absurd. How many adults do you know that wrestle teddy bears?"
    },
    {
      "title": "Consider your jokes timing and delivery.",
      "content": "Consider your jokes timing and delivery. Many comedians agree that a joke succeeds or fails based on timing. Think about how you might deliver the joke about wrestling a bear. Pause after you say \"I once wrestled a bear\". Give your audience a second or two to think about you wrestling a bear and all the danger that entails. Maybe take a deep sigh to show that the story that follows is serious to you. Then say \"It weighed less than a pound and was stuffed with cotton.\" Now something unexpected has occurred and the audience will laugh. If you say it quickly, the audience won't have the time to assume anything and the joke will flop."
    },
    {
      "title": "Develop your idea or joke into a premise.",
      "content": "Develop your idea or joke into a premise. Most great comedy sketches begin with a single idea. Now it is time to expand on your central idea. Explore your premise. Don't be afraid to write an idea down and throw it away soon after. You will probably think of 10 ideas for every 1 good idea. For example, the premise you've settled on is an adult wrestling a teddy bear. Many comedians say that great comedy needs to be somewhat realistic. Focus on normally realistic actions. Don't all of sudden switch to a teddy bear in space or a teddy bear coming to life. Your audience won't be able to follow you. Focus on the action you've set up in your premise. What wrestling moves did you use on the bear? Did you get it in a headlock, full-nelson, or some other elaborate hold? Where did this wrestling match take place? In your bedroom, in your daughter's bedroom, or in a store like Build-A-Bear? What started the fight in the first place? What was the outcome? Use these kinds of questions about action and place to expand your idea or joke into a premise. [2] X Research source"
    },
    {
      "title": "Outline your comedy sketch.",
      "content": "Outline your comedy sketch. Now it is time to put pencil to paper or fingers on keyboard. You know your basic premise. It is time to outline, which should include how you plan to begin, what content, premise, or rough jokes will make up the majority of your sketch, and how you will end. [3] X Research source Many write their sketch's story backwards. If you have a great ending in mind (like a grown man fighting a teddy bear in a Build-A-Bear), start there and write what leads to that. Maybe the adult did not like the way the teddy bear was \"looking\" at him when he went in to buy his daughter a birthday present. Maybe work has been stressful and the man just needed to physically hit something. Maybe this particular bear reminds him of someone he hates. Use your imagination to develop a storyline. [4] X Research source"
    },
    {
      "title": "Understand and use standard formatting rules for script writing.",
      "content": "Understand and use standard formatting rules for script writing. Be sure to include the setting, actors' lines, acting directions, and stage directions. [5] X Research source Choose a setting. Your character or characters will be in at least one place. Give detailed information about the setting. What other objects will be in the setting with your actors? In the Build-A-Bear fight sketch, describe other stuffed animals and how they looked on. Describe how the store is brightly colored to further accentuate the strangeness of the battle taking place. Be sure to set the character's name apart from their lines. Write their character's name in bold or italic type face followed by a colon. Write their lines. Many script writers find it helpful to include other cues in the actor's lines that indicate something about their speech pattern. For example, if the character stutters, the script might use periods or spaces in the text to indicate their speech pattern. Include acting directions. Think about what your actors are doing. Most likely they will not just be reciting lines in front of an audience. Tell your actors where to look, how to stand, what kind of body language to use, or any other aspects the actor needs to pull off the scene. Oftentimes, comedic writers will write \"pause for laughter\" to give the audience the chance to laugh without missing any of the scene. Include stage directions. Tell your actors where to go on stage, if they should be sitting or standing, if they should move pieces around the stage, or if they should enter or exit the stage. [6] X Research source"
    },
    {
      "title": "Consider your jokes' timing in the overall sketch.",
      "content": "Consider your jokes' timing in the overall sketch. You don't want to have all your jokes at the beginning and none at the end or vice versa, so space them out across the entire piece. Jokes and their punch lines can be built on top of each other to make a better effect, especially if the same punch line is going to be used over and over again. Many comedians like to include callbacks in their writing. Callbacks are when you reference something that occurred at the beginning of a sketch at the end of the sketch. For example, if in your sketch about a grown man wrestling a teddy bear, you mentioned how he went to Build-A-Bear to buy his daughter a birthday present, make a joke about the daughter's birthday gift at the end. Maybe say: \"My daughter got a damaged teddy bear for her birthday because they made me buy the one I destroyed.\""
    },
    {
      "title": "Finish a rough draft before editing.",
      "content": "Finish a rough draft before editing. Some people will focus so much on editing that they will lose the flow of the overall piece. After finishing an outline, write until the rough draft is complete. Then move to the revision stage."
    },
    {
      "title": "Proofread and edit your script.",
      "content": "Proofread and edit your script. Read it aloud. Record yourself and watch it back. Make every sentence easy to understand. If your audience doesn't understand your sentence, then they won't get the joke. [7] X Research source"
    },
    {
      "title": "Rehearse your stuff.",
      "content": "Rehearse your stuff. Practice in front of the mirror, perform it in front of a miniature audience, or however you will need to test it. Then go back and revise it again. Fix the kinks, improve the funnies, revise it, etc. Practice makes perfect. For the hypothetical sketch about a man wrestling a teddy bear, actually get a teddy bear and wrestle it. You might come up with more detail after performing the action. This will make your sketch more realistic. Maybe you'll realize that it is harder to get a teddy bear in a headlock than you thought, because their heads are filled with cotton so they can easily escape your grasp. You might then choose to use this detail in the sketch. Test and revise, test and revise, learn from mistakes. That's pretty much the point."
    },
    {
      "title": "Perform your sketch.",
      "content": "Perform your sketch. Now it's time to take your stuff out there and show them what you've got! Don't be afraid to improvise during the performance. Some of the funniest content comes from accidents. Learn to embrace it."
    }
  ]
}