{
  "url": "https://www.wikihow.com/Unban-Someone-on-Discord",
  "title": "2 Ways to Unban Someone on Discord + FAQ",
  "steps": [
    {
      "title": "Open Discord.",
      "content": "Open Discord. Click the app icon that looks like a controller on a light blue background in your Start menu or Applications folder. You need to be a server admin to unban and ban users."
    },
    {
      "title": "Right-click your server.",
      "content": "Right-click your server. You'll see icons of all the servers you've joined displayed vertically on the left-hand side of your screen."
    },
    {
      "title": "Hover your mouse over \"Server Settings\" and click Bans.",
      "content": "Hover your mouse over \"Server Settings\" and click Bans . This will redirect you to a page that shows all the users that have been banned from your server. [1] X Research source"
    },
    {
      "title": "Click a user you want to unban.",
      "content": "Click a user you want to unban. A window will pop up in the center of your screen."
    },
    {
      "title": "Click Revoke Ban.",
      "content": "Click Revoke Ban . After you click this, that user will be able to join your server again! [2] X Research source"
    },
    {
      "title": "Open Discord.",
      "content": "Open Discord. Tap the app icon that looks like a controller on a light blue background. You need to be a server admin to unban and ban users."
    },
    {
      "title": "Tap your server and ⋮.",
      "content": "Tap your server and ⋮ . This three-dot menu icon is to the right of your server name."
    },
    {
      "title": "Tap .",
      "content": "Tap . This gear icon is in the middle of your screen and will open the \"Server Settings\" window."
    },
    {
      "title": "Tap Bans.",
      "content": "Tap Bans . It's near the bottom of the menu next to a picket-fence-sign icon."
    },
    {
      "title": "Tap the user you want to unban.",
      "content": "Tap the user you want to unban. Another window will pop up."
    },
    {
      "title": "Tap Unban.",
      "content": "Tap Unban . After you tap to unban a user, they can join your server again. [3] X Research source"
    },
    {
      "title": "Are bans on Discord permanent?",
      "content": "Are bans on Discord permanent? Not necessarily. Server bans are from server admins, and you can appeal the admins to request getting unbanned. If your account is banned, anyone from your IP address cannot join that server. However, there are system-wide bands from the Discord Trust & Safety team that will make it so you can't use the platform at all."
    },
    {
      "title": "What happens if you ban someone on Discord?",
      "content": "What happens if you ban someone on Discord? That person can no longer send or receive messages in that server. [4] X Research source And since banning by default includes the IP address of that account, anyone with the same IP address will be banned from that server. The person you banned won't get a notification, but they will see a \"Link expired\" error when they try to see your server."
    },
    {
      "title": "Can you ban someone again after unbanning them?",
      "content": "Can you ban someone again after unbanning them? Yes. Even if someone has been banned and unbanned, you can ban them again."
    },
    {
      "title": "How do I get unbanned?",
      "content": "How do I get unbanned? You can't really get unbanned until the server admin decides to unban you. You can reach out to that person and apologize for your behavior to get unbanned. If you were banned by Discord, you can submit a request to get unbanned as long as you weren't in violation of their Community Guidelines."
    }
  ]
}