{
  "url": "https://www.wikihow.com/Write-Your-Degree-on-a-Resume",
  "title": "How to Write Your Degree on a Resume",
  "steps": [
    {
      "title": "Format your resume consistently.",
      "content": "Format your resume consistently. There’s no set way to format a resume, but the biggest rule is to format consistently. Use one font size for section headings and another for general text, and include consistent bold or italic emphases. For example, if you bold employers’ names in your experience section, write your college in bold, especially if it’s a prestigious school or one known for excellence in your field. Use a standard sans-serif font, like Arial, for easy readability. Use a 10-12 point size for general text and 14-16 point for section headings."
    },
    {
      "title": "Write the institution, its location, your degree, and any honors.",
      "content": "Write the institution, its location, your degree, and any honors. Always include the name of your institution, its location, and the name of your degree. You can either write out your full degree name (like Bachelor of Arts) or use its acronym (like B.A.) if you need to save room. Include honors you were awarded instead of your GPA, especially if you’re not a recent grad. [1] X Research source If you’re a recent grad with a high GPA, you could opt to include your GPA. Just be sure to explain your GPA system by writing, for example, “3.92/4.0.” You can also include your graduation year if you’re a recent grad. Otherwise, you should avoid including dates, especially if your degree is older than 15 years. An example degree listing could be: Yale University, New Haven, CT. Bachelor of Arts in English, Magna cum laude ."
    },
    {
      "title": "Avoid including unnecessary or obvious words.",
      "content": "Avoid including unnecessary or obvious words. Using “Education” to head the appropriate section is the only descriptive word you’ll need. Including words like “College:” or “Degree:” before the appropriate information is superfluous. Avoid unnecessary words elsewhere in your resume, too. For example, don’t write “Email:” or “Phone:” before listing your contact information. Just write your email address and phone number."
    },
    {
      "title": "Place the education section near the top if you’re a recent grad.",
      "content": "Place the education section near the top if you’re a recent grad. If you’ve just graduated, you might not have substantial professional experience. Place your education section at the top of your resume, just under your contact information and, if you’ve included one, your career objective. You can also include the year you received the degree if you’ve graduated in the last one to three years. [2] X Research source If you’re not a recent grad or have substantial professional experience, place your relevant experience section ahead of your education. In general, professional experience is more valuable information than your education."
    },
    {
      "title": "List your most recent degree first.",
      "content": "List your most recent degree first. If you have more than one degree, list them in reverse chronological order, or the most recent degree first. In general, you should also list advanced degrees first. [3] X Research source If you double majored, you can just list both degrees in the same section under your university: Yale University , New Haven, CT. Double major: Bachelor of Arts, English. Bachelor of Arts, Art History."
    },
    {
      "title": "List your high school diploma if it's your highest degree.",
      "content": "List your high school diploma if it's your highest degree. If you have completed work toward or have earned a college or associate's degree, you shouldn't include information about your high school. You can also skip it if you have significant work experience. [4] X Research source If not, and if your high school diploma is your highest degree, include your high school's name and location, graduation date (if it's within the last three years), and, if it's above a 3.5/4.0, your GPA: Nashua High School, Nashua, New Hampshire High School Diploma, 2016. GPA: 3.8 If your highest degree is a GED diploma or state equivalent certificate, include it if you don't have substantial work experience: Education General Educational Development Diploma, 2016. Education CHSPE (Certificate of Proficiency from the State of California), 2016."
    },
    {
      "title": "List minors or concentrations after your major.",
      "content": "List minors or concentrations after your major. You should include minors or concentrations if the information is relevant to your job application. If your minor doesn’t have anything to do with the job you’re applying for, you can skip it. If you choose to list a minor or concentration, you can include the information like this: Boston University College of Communication , Boston, MABachelor of Science in Communication (concentration in Advertising) Minor in Public Relations."
    },
    {
      "title": "Include only industry-relevant degrees and certifications after your name.",
      "content": "Include only industry-relevant degrees and certifications after your name. If you have a professional certification or credential, like RN or MBA, include it after your name. List details about where or how you acquired your certification in your education section. [5] X Research source Don’t include undergraduate degree acronyms after your name. For example, never write, “Jane Smith, B.A.”"
    },
    {
      "title": "List only the institution that awarded you a degree.",
      "content": "List only the institution that awarded you a degree. If you studied at multiple institutions before earning your degree, you should only write the college or university that actually awarded you a degree. The important information is the degree itself, not a full account of all the schools you attended. [6] X Research source Exceptions to this rule include study abroad programs or coursework at prestigious institutions. For example, you might include relevant information like this: University of Georgia , Athens, GA. Bachelor of Science in Biology (Marine Biology emphasis), 2016. University of Auckland , Auckland, New Zealand. Study abroad program with emphasis in ecological preservation."
    },
    {
      "title": "Include information about your incomplete degree.",
      "content": "Include information about your incomplete degree. You should still list partial degrees if you’ve completed most of your coursework, but haven’t actually graduated. Concisely explain the circumstances and include an expected date of graduation. For example, you could describe an incomplete undergraduate degree like this: Yale University , New Haven, CT. Bachelor of Science, Biology (expected 2017) You could describe a graduate degree like this: Yale University , New Haven, CT Master of Business Administration degree candidate Thesis under development; anticipated completion June 2018"
    },
    {
      "title": "List the most relevant degree for the job you’re applying to first.",
      "content": "List the most relevant degree for the job you’re applying to first. In general, you’d list your most recent degree first. However, make an exception to this rule if an older degree is more relevant or will make your application more competitive. [7] X Research source For example, suppose you’re applying for an engineering job and earned an undergraduate degree in mechanical engineering in 2009 and a master’s in graphic design in 2012. You should list your engineering degree first. You might have also researched your prospective job and found that the department head who will read your resume graduated from your undergraduate university. You might then want to include your undergraduate degree first and place your education section at the top of your resume."
    },
    {
      "title": "Include specific coursework if the information is relevant.",
      "content": "Include specific coursework if the information is relevant. You might want to include relevant coursework in some job applications. If you want to highlight particular course titles, you could add a subsection to your education listing. For example, you could structure your education section like this: B.S. in Mechanical Engineering , University of Texas, Austin, TX. Relevant courses : Thermodynamics, Properties of Engineering Materials, Solid Mechanics, Dynamics of Machines, Strength of Mechanical Components."
    },
    {
      "title": "Create separate sections for important skills and honors.",
      "content": "Create separate sections for important skills and honors. If you include too many achievements and skills under your education heading, valuable information might get lost. Rather than include too much text under one heading, list skills and important achievements under their own headings. [8] X Research source For example, instead of listing computer programs and other skills you learned at school in a block of text under your degree, put them in a separate section at the top of your resume. Be sure to include skills, programs, and other keywords from the job posting."
    }
  ]
}