{
  "url": "https://www.wikihow.com/Use-Emojis-on-Snapchat-Texts",
  "title": "How to Use Emojis on Snapchat Texts",
  "steps": [
    {
      "title": "Tap the chat icon along the bottom of your screen.",
      "content": "Tap the chat icon along the bottom of your screen. When you open up your Snapchat app, you should see a location symbol, chat bubble, camera icon, friend symbol, and play button bordering the bottom of your screen. Tap the chat bubble—it should turn blue when selected."
    },
    {
      "title": "Select the friend or group that you’d like to chat with.",
      "content": "Select the friend or group that you’d like to chat with. On the “chat” page, you should see a list of all the people you’ve recently chatted with on Snapchat. Tap on the friend or friend group to open up the chat room."
    },
    {
      "title": "Hit the “emoji” icon above your keyboard.",
      "content": "Hit the “emoji” icon above your keyboard. Once you enter the chat room, your phone’s keyboard should automatically pop up. Above the keyboard, you’ll see a camera icon, a chatbox, a smiley face with its tongue sticking out, a picture icon, and a rocket icon. Tap the smiley face icon to bring up your emojis. This button isn’t just for emojis! It also gives you access to Bitmojis, Snapchat Cameos (gifs or stickers customized with your picture), custom stickers, and default stickers."
    },
    {
      "title": "Swipe left to get to the emoji page.",
      "content": "Swipe left to get to the emoji page. From left to right, you should see a clock icon (which includes your recently used stickers, Bitmojis, and Snapchat Cameos), a Bitmoji icon, a Snapchat Cameo icon, a scissor icon (for making custom stickers), a teddy bear icon (for default stickers), and a traditional smiley face. Swipe over to the smiley face to get to the traditional emojis. You can also tap on the smiley face icon to bring the emoji menu up."
    },
    {
      "title": "Tap on the emoji you’d like to use and hit “send.”",
      "content": "Tap on the emoji you’d like to use and hit “send.” The emoji menu should be almost identical to your phone keyboard, with the emojis looking just a little bit larger. Tap on whichever emoji (or emojis!) best fit your mood, and then send them over to your friend!"
    },
    {
      "title": "Take a picture or video for your Snap.",
      "content": "Take a picture or video for your Snap. Tap the camera icon along the bottom center of the screen. Then, hit the open circular button to take a picture, or hold the button down to capture a video. [1] X Research source Swipe your thumb to the left while recording to “lock” your video in place. This way, your camera keeps recording without your finger needing to touch the screen!"
    },
    {
      "title": "Tap the sticker icon on the right side of the screen once you’ve taken your picture or video.",
      "content": "Tap the sticker icon on the right side of the screen once you’ve taken your picture or video. Snapchat offers a lot of different customization options, including emojis! Along the top right side of the screen, you should see a “text” icon, a pencil icon, a sticker icon, a scissors icon, a music note icon, a paper clip icon, a crop icon, and a timer icon. To get to your emojis, tap on the sticker icon, which looks like a rounded square with a peeling corner. This icon should be the third one down from the top."
    },
    {
      "title": "Swipe right to switch between stickers and emojis.",
      "content": "Swipe right to switch between stickers and emojis. Beneath the search bar on the top of your screen, you should see a clock icon, a star icon, a cartoon face, a Snapchat Cameo icon, a scissor icon, and a smiley face. Swipe to the left to pull up the emoji menu. Feel free to tap on the smiley face to pull up the menu, too."
    },
    {
      "title": "Tap the emoji you’d like to add.",
      "content": "Tap the emoji you’d like to add. The Snapchat emoji menu is just a zoomed-in version of your phone’s emoji keyboard. Scroll through all your options until you find the best emoji for your message. The emoji menu isn’t just limited to smilies—you can add plant, animal, and food emojis, along with much more!"
    },
    {
      "title": "Pinch the emoji to resize and move it.",
      "content": "Pinch the emoji to resize and move it. Your desired emoji should pop up in the center of your photo or video snap. Drag your thumb and pointer finger closer together to make the emoji smaller, or pull both of your fingers apart to make it bigger. Keep in mind that the bigger your emoji is, the more pixelated it will look!"
    },
    {
      "title": "Slide the emoji to move it around.",
      "content": "Slide the emoji to move it around. Tap and hold onto your emoji with any finger and drag it around the screen. Once you’re happy with the emoji’s placement, lift up your finger."
    },
    {
      "title": "Pin the emoji in place on a video.",
      "content": "Pin the emoji in place on a video. Double-check that your emoji is the right size and in the right spot. Then, press on the emoji for a few seconds to “pin” it in place. For the rest of your video, this emoji may shift, rotate, grow, or shrink with the part of the video you pinned it to."
    }
  ]
}