{
  "url": "https://www.wikihow.com/Why-Do-I-Look-So-Horrible-in-ID-Pictures",
  "title": "Why Your ID Photos Look Bad & How to Take Better Pictures",
  "steps": [
    {
      "title": "There was bad lighting.",
      "content": "There was bad lighting. The number one reason your ID photo looks so bad is because there’s poor lighting. Government facilities and DMVs are typically decorated with harsh overhead lights that create shadows under your eyes. Paired with the camera's bright flash, you can suddenly appear washed out in your photo. [1] X Research source"
    },
    {
      "title": "A poor quality camera was used.",
      "content": "A poor quality camera was used. The camera used at the DMV isn’t likely the best on the market. These cameras are old, and the lens may be dusty and in need of replacement. All this to say, your image may be distorted because of a poor-quality camera or lens. [2] X Research source"
    },
    {
      "title": "The camera was too close to you.",
      "content": "The camera was too close to you. How far away you are from a camera can determine how distorted you look in a photo. Photos taken from a short distance can make your face look rounder. If the camera at the DMV or government facility is less than 10 feet (3.0 m) away from your face, you’ll likely look different in your ID photo. [3] X Research source Similarly, the style of the camera lens can also distort your features, especially at a close distance."
    },
    {
      "title": "The camera was at a set angle.",
      "content": "The camera was at a set angle. For most people, their most attractive side isn’t front on. Most cameras used to take ID photos at the DMV are stuck in a set position; they can’t be moved. Because of this, if you’re not at the exact height to be at eye level with the camera, your photo may show too much forehead or chin. [4] X Research source"
    },
    {
      "title": "You were told not to smile.",
      "content": "You were told not to smile. For many ID photos (including a passport), you’ll likely be instructed not to smile. Smiling is contagious—it expresses joy! When you’re not smiling in a photo and asked not to pose, your facial muscles relax, which could involuntarily make you appear bored or sad. [5] X Research source"
    },
    {
      "title": "You only got one take.",
      "content": "You only got one take. For most ID photos, you’re only given one take and won’t see your picture until it’s printed on your ID. While this isn’t always the case, not being able to take a practice photo means you aren’t able to alter your features or fix your hair to try again. [6] X Research source It is possible to ask for a do-over to see your picture before it’s finalized. Don’t be afraid to ask! [7] X Research source"
    },
    {
      "title": "You’re used to seeing mirrored images of yourself.",
      "content": "You’re used to seeing mirrored images of yourself. You’re most likely used to looking at yourself in the mirror—the best version you see of yourself is a mirrored reflection! Photographs are 2D depictions of you that aren’t mirror images. In other words, what you see in the mirror every day is reversed compared to what the camera sees. While your ID photo may not be completely accurate, you also may not be used to seeing yourself without that reflection. [8] X Research source"
    },
    {
      "title": "Push your head forward to exaggerate your jawline.",
      "content": "Push your head forward to exaggerate your jawline. Because of the poor lighting, an ID photo may make your jawline disappear. To avoid this, push your head slightly forward to make your jaw more pronounced. Simply crane your neck a bit over your chest. [9] X Research source"
    },
    {
      "title": "Widen your eyes for the photo.",
      "content": "Widen your eyes for the photo. If you have smaller eyes, focus on opening them a bit wider when you take your ID photo. Making sure your eyes are fully open helps them appear bigger. [10] X Research source Try using eye drops to add more shine to your eyes to help you look more awake."
    },
    {
      "title": "Smile slightly with closed lips.",
      "content": "Smile slightly with closed lips. While you may be instructed to relax your face and not smile, that doesn’t mean you can’t smile altogether! Avoid smiling with your teeth, but make yourself look more joyful by lifting the edges of your lips ever so slightly. Think of it like smirking at the camera. [11] X Research source"
    },
    {
      "title": "Stick with your everyday hairstyle.",
      "content": "Stick with your everyday hairstyle. There’s no need to go all out for your ID photo (unless you want to). Style your hair as you normally would; just make sure it’s neat and tidy with no hair in your eyes. Avoid wearing any accessories or hats, as these will need to be removed for the photo. [12] X Research source Bring a brush or comb with you to smooth out your locks before the picture is taken."
    },
    {
      "title": "Put on makeup that highlights your features.",
      "content": "Put on makeup that highlights your features. While it isn’t required, some say that wearing makeup can help brighten your face and make your ID photo that much better. Focus on highlighting your features to help them pop in the dim light. Use concealer under your eyes and on your chin and forehead. Contour your cheeks slightly to add dimension. Do a subtle winged eyeliner , and define your lips with a neutral pink or brown shade. [13] X Research source Make sure not to overdo your makeup look. You want to enhance your natural features, not paint them on. Avoid shimmery makeup, as it will reflect the light of the flash and wash out your features. [14] X Research source"
    },
    {
      "title": "Wear light, soft colors.",
      "content": "Wear light, soft colors. What you wear can play a big part in whether or not your ID photo comes out good. Stick with wearing soft colors like blue, green, and pink that won’t wash out your features or absorb the light. [15] X Research source Similarly, avoid wearing white and black, as these can make you look pale and sickly. Try wearing a shirt without a slogan or picture, as this can distract the eye."
    },
    {
      "title": "Avoid looking at the camera until you’re ready.",
      "content": "Avoid looking at the camera until you’re ready. The DMV employee can’t take the photo until you’re looking at the camera. So, don’t make eye contact until you’re 100% ready. Make final adjustments to your hair and position your face. Then, look into the camera. [16] X Research source"
    },
    {
      "title": "Seek help from a professional.",
      "content": "Seek help from a professional. Believe it or not, there are professionals out there that’ll help you take the perfect ID photo. Now, this isn’t an option for driver’s licenses or permit photos, but a passport photo can be taken outside of a government facility and sent in. Professional photographers can set the lighting and angles just right to shoot a flattering, government-approved passport photo. Search “passport photographer near me” online to find a professional photographer. Check the laws in your area before hiring a professional to take your passport photo to ensure submitting an outside photo is allowed. [17] X Research source"
    },
    {
      "title": "",
      "content": "Just because your ID photo didn’t come out as you expected doesn’t mean all your photos have to be bad! Boost your self-esteem by taking a few good photos of yourself to share with the world. Once your rocking photos hit social media, no one will even think twice about your botched ID photo! Here are some tips to taking better photos of yourself , according to Bear: Use a tripod to get better angles. Placing the camera farther away can help you find more flattering angles on your own. [18] X Research source Look into the camera, not the screen. [19] X Research source Bear suggests always using your phone’s back camera, as it has a mother megapixel and will take better-quality photos. Angle your face downwards and shoot from above. As Bear explains, this will help narrow your features. Take multiple photos while doing an action or series of poses. This can help you take a more candid photo that doesn’t look forced or fake. Practice your facial expressions in the mirror. Mimic what you want to do in front of the camera in front of the mirror to learn what each facial expression feels like. Find natural lighting and avoid fluorescent and overhead lighting. Bear recommends sitting in front of a window with your phone just slightly above eye level."
    },
    {
      "title": "The angle, lighting, and camera type can make you look different.",
      "content": "The angle, lighting, and camera type can make you look different. First, let us just say that you are gorgeous—don’t let a photo define your worth! Now, it is true that a photo can come out looking nothing like yourself, and that’s because of a few factors. Unflattering angles, poor lighting, an outdated camera or lens, and even the pose you're in can create a less-than-flattering photo. [20] X Research source Just remember, one photo doesn’t dictate what you look like IRL."
    }
  ]
}