{
  "url": "https://www.wikihow.com/Use-Aloe-Vera-to-Treat-Acid-Reflux",
  "title": "How to Use Aloe Vera to Treat Acid Reflux",
  "steps": [
    {
      "title": "Choose aloe vera juice that doesn’t contain aloin or aloe latex.",
      "content": "Choose aloe vera juice that doesn’t contain aloin or aloe latex. Check online, at pharmacies, or at health-food stores for an organic aloe juice so it’s the best quality. Look on the label to ensure that the juice says it’s for oral use rather than applied topically. Read the ingredients to make sure the juice doesn’t contain any aloin, aloe latex, or artificial preservatives. Search for phrases like “latex-free” or “aloin-free” on the packaging to ensure the juice is safe to consume. You can buy aloe juice online or from your local drugstore. Avoid packages that say “whole leaf” since they may also contain aloe latex or aloin."
    },
    {
      "title": "Drink 10 ml (2.0 tsp) of your aloe juice each day.",
      "content": "Drink 10 ml (2.0 tsp) of your aloe juice each day. Take the aloe juice in the morning about 20 minutes before you eat. Keep taking the aloe every day to reduce your symptoms of acid reflux. You should start feeling relief within a few days, but it may take you up to 2 weeks to feel its effects. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Aloe juice can have a bitter flavor. Try diluting it in a glass of water if you want to mask the flavor. Store the aloe juice in the refrigerator after you open it. After 2 weeks, throw away any that you haven’t used."
    },
    {
      "title": "Stop taking aloe if you feel stomach cramps or have diarrhea.",
      "content": "Stop taking aloe if you feel stomach cramps or have diarrhea. Although some people don’t get them, aloe may have these side effects. If you have an upset stomach or unexplained diarrhea, stop taking aloe for a few days to see if you feel better. If you do, aloe was causing you pain. However, if you still feel symptoms, see a doctor. [3] X Research source Aloe can act as a laxative, so be careful not to take more than a single dose."
    },
    {
      "title": "See your doctor if your symptoms don’t improve after 2 weeks.",
      "content": "See your doctor if your symptoms don’t improve after 2 weeks. Your doctor will review your symptoms and medical history to make a diagnosis. If they think you have a more serious condition, they may do diagnostic tests, as well. Similarly, you should also see your doctor if you have the following symptoms along with your acid reflux: [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Persistent nausea or vomiting Painful swallowing Reduced appetite resulting in weight loss"
    },
    {
      "title": "Talk to your doctor if you’re pregnant and have acid reflux.",
      "content": "Talk to your doctor if you’re pregnant and have acid reflux. It’s normal to experience acid reflux during pregnancy, so you’re not alone. Fortunately, your doctor can help you choose the best treatment. Let them know that you’re experiencing heartburn and how often it occurs. Track the foods or activities that may be contributing to your acid reflux so you can find relief. [5] X Research source Don’t use any treatments, including aloe vera, without first checking with your doctor."
    },
    {
      "title": "Get urgent care for chest pain or pressure with pain in your arm or jaw.",
      "content": "Get urgent care for chest pain or pressure with pain in your arm or jaw. While it’s most likely you’re safe, arm and jaw pain can also be signs of a minor heart attack. Contact your doctor and explain your symptoms to see if they recommend seeking emergency care. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try not to panic because these symptoms may be caused by several conditions. Only a doctor can diagnose what’s causing yours. Then, they’ll offer you treatment."
    },
    {
      "title": "Ask your doctor if a prescription treatment is right for you.",
      "content": "Ask your doctor if a prescription treatment is right for you. If you’ve already tried over-the-counter or natural treatments but haven’t found relief, your doctor may decide to put you on prescription medication. Your doctor may prescribe an H2 blocker or a proton pump inhibitor (PPI) to reduce your stomach acid production and help your esophagus heal. Take your medicine exactly as directed by your doctor. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can find H2 blockers and PPIs over-the-counter, as well. If you’ve already tried these and they didn’t work, a prescription medication may help. Talk to your doctor about potential side effects, such as poor nutrient absorption. They can advise you on how to avoid problems due to side effects. In rare cases, your doctor may recommend a surgical procedure called fundoplication. During this procedure, your doctor will tighten your lower esophageal sphincter to help prevent acid from escaping."
    },
    {
      "title": "Ask your doctor about starting a GERD diet.",
      "content": "Ask your doctor about starting a GERD diet . If you still feel acid reflux and nothing else has worked, see if your doctor recommends a diet to alleviate your gastroesophageal reflux disease (GERD) symptoms. If they do, switch to smaller, more frequent meals throughout the day rather than eating large amounts of food. Try to limit the number of fatty, spicy, or fried foods you eat, as well as chocolate, garlic, onions, citrus, and alcohol. Keep a record of the foods you eat so you can track what foods trigger your acid reflux."
    }
  ]
}