{
  "url": "https://www.wikihow.com/Update-Microsoft-Internet-Explorer",
  "title": "How to Update Microsoft Internet Explorer",
  "steps": [
    {
      "title": "Go to the Internet Explorer 11 download page at https://support.microsoft.com/en-us/help/18520/download-internet-explorer-11-offline-installer.",
      "content": "Go to the Internet Explorer 11 download page at https://support.microsoft.com/en-us/help/18520/download-internet-explorer-11-offline-installer . In a web browser, go to Microsoft's Internet Explorer 11 download page."
    },
    {
      "title": "Scroll down to your preferred language.",
      "content": "Scroll down to your preferred language. You'll see a list of languages on the left side of the page."
    },
    {
      "title": "Click your operating system.",
      "content": "Click your operating system. You'll see your computer's operating system to the right of your selected language. Clicking this link will prompt the setup file to begin downloading to your PC. The Windows 7 setup file will work on Windows 8.1 and Windows 10 as long as you choose the correct format of your version of Windows, 32-bit or 64-bit. If you don't know your computer's bit number (e.g., 32-bit or 64-bit), you can view it by right-clicking This PC, clicking Properties , and looking for the bit number to the right of \"System type\"."
    },
    {
      "title": "Double-click the Internet Explorer setup icon.",
      "content": "Double-click the Internet Explorer setup icon. It's most likely on your desktop."
    },
    {
      "title": "Click Yes when prompted.",
      "content": "Click Yes when prompted. Doing so will take you to the Internet Explorer 11 installation window."
    },
    {
      "title": "Follow the on-screen instructions.",
      "content": "Follow the on-screen instructions. This will consist of agreeing to Microsoft's terms of use by clicking I agree and then clicking Next , as well as selecting an install location and determining whether or not you want a desktop shortcut."
    },
    {
      "title": "Click Finish.",
      "content": "Click Finish . It's in the bottom-right corner of the window. Doing so will finish the Internet Explorer 11 installation process."
    },
    {
      "title": "Open Internet Explorer.",
      "content": "Open Internet Explorer. It's a blue \"e\" icon. You can find it by typing \"Internet Explorer\" into Start."
    },
    {
      "title": "Click ⚙️.",
      "content": "Click ⚙️ . This icon is in the top-right corner of the Internet Explorer window."
    },
    {
      "title": "Click About Internet Explorer.",
      "content": "Click About Internet Explorer . It's toward the bottom of the drop-down menu."
    },
    {
      "title": "Check the \"Install new versions automatically\" box.",
      "content": "Check the \"Install new versions automatically\" box. It's in the middle of the About Internet Explorer window."
    },
    {
      "title": "Click Close.",
      "content": "Click Close . It's at the bottom of the About Internet Explorer window. Internet Explorer will update automatically from this point on."
    },
    {
      "title": "Close Microsoft Edge if it's open.",
      "content": "Close Microsoft Edge if it's open. If an update for Edge is available, Edge will need to be closed in order for the process to complete."
    },
    {
      "title": "Open Start.",
      "content": "Open Start. To do so, either click the Windows logo in the bottom-left corner of the screen or press the ⊞ Win key."
    },
    {
      "title": "Click ⚙️.",
      "content": "Click ⚙️ . It's in the lower-left corner of the Start window. Doing so will open the Settings page."
    },
    {
      "title": "Click Update & security.",
      "content": "Click Update & security . You'll see this option near the bottom of the Settings page."
    },
    {
      "title": "Click Check for updates.",
      "content": "Click Check for updates . It's a button near the top of the Update & Security page."
    },
    {
      "title": "Wait for the updates to finish installing.",
      "content": "Wait for the updates to finish installing. Once you see \"Your device is up to date\" displayed at the top of the page, your Microsoft Edge browser has been updated."
    }
  ]
}