{
  "url": "https://www.wikihow.com/What-Do-Demons-Look-Like",
  "title": "Everything We Know About What Demons Really Look Like",
  "steps": [
    {
      "title": "Demons aren’t given a physical description in the Bible.",
      "content": "Demons aren’t given a physical description in the Bible. Demons do appear in the Bible—most notably on the numerous occasions when Jesus cast them out of people as part of his ministry. They’re depicted as spiritual beings that are capable of possessing people and causing physical ailments, not physical creatures with bodies. [1] X Research source Mark 5:1–20 and Matthew 8:28–34 recount Jesus’ interaction with the demon (or demons) Legion. After Jesus encountered a demon-possessed man (according to Mark—two men according to Matthew) living in the burial tombs of Gerasenes, Jesus cast the demons (called Legion) into a herd of 2,000 swine. [2] X Research source In Revelation 16:13, John writes that he saw “three unclean spirits like frogs.” It’s not explicitly stated that these are demons, but the phrase “unclean spirits” is used to refer to demons elsewhere, including the above story of Jesus and the Gerasene demons. Based on that, demons could be frog-like in appearance."
    },
    {
      "title": "Satan is said to appear as an “angel of light.”",
      "content": "Satan is said to appear as an “angel of light.” Many people believe that demons are the fallen angels who followed Satan when he fell from heaven—or, more accurately, were “thrown down with him” (Revelation 12:9). If this is true, then Satan and demons are all fallen angels, and demons may be able to take on the same angelic appearance. [3] X Research source According to the Bible, some fallen angels are kept chained: “And the angels who did not keep their positions of authority but abandoned their proper dwelling—these he has kept in darkness, bound with everlasting chains for judgment on the great Day.” Jude 1:6 In addition to describing Satan as an “angel of light” (2 Corinthians 11:14–15), the Bible refers to him as a “roaring lion,” “ancient serpent,” “dragon,” “beast with horns and tails,” “Lord of flies,” and “Prince of demons.” However, it’s likely that these are metaphors to describe Satan’s character, rather than physical descriptions."
    },
    {
      "title": "Some translations of Isaiah 34:14 refer to Lilith, an owl-like demon.",
      "content": "Some translations of Isaiah 34:14 refer to Lilith, an owl-like demon. The New King James Version (NKJV) of Isaiah 34:14 says: “The wild beasts of the desert shall also meet with the jackals, and the wild goat shall bleat to its companion; Also the night creature shall rest there, and find for herself a place of rest.” But depending on the translation, “night creature” takes on different meanings, which creates an interesting portrait of a possibly demonic being. In translations like the American Standard Version (ASV), “night creature” is translated as “night monster.” In the Amplified Bible (AMP), the phrase is translated as “Lilith (night demon).” Other translations state it simply as “Lilith” or “Lilit,” and in some, the creature is referred to as the “lamia.” In King James and other versions, “night creature” is translated as “screech owl.” Some translations say “night birds.”"
    },
    {
      "title": "In Judaic tradition, shedim and se’irim are goat-like demons.",
      "content": "In Judaic tradition, shedim and se’irim are goat-like demons. According to this belief, the “se’irim” or “goat idols” mentioned in Leviticus 17:7 are part of a larger collection of demonic beings known as shedim. Some people believe these demons are similar to the jinn of Arabian tradition and include the goat-demon Azazel and possibly Lilith. [4] X Research source These traditions interpret other Biblical phrases as references to demonic beings, like the “destroying angel” warded off during the first Passover (Exodus 12:23) or the “leech” (interpreted as the Arabian vampire “aluk”) in Proverbs 30:15."
    },
    {
      "title": "The Book of Enoch describes huge fallen angels that look like fire.",
      "content": "The Book of Enoch describes huge fallen angels that look like fire. Notably, Enoch tells the story of fallen angels, or sons of god, who come to earth to find human wives. Some people interpret these fallen angels to be demons. [5] X Research source They’re described as having “faces like the shining sun” and “eyes like burning lamps,” with fire coming from their mouths. Enoch also says the angels have “wings more glistening than gold” and hands that are “whiter than snow.” [6] X Research source The Book of Enoch was written around 200 AD, and while it’s not included in the Biblical canon, it does expand on stories that are included in the Bible. In Enoch, the fallen angels are responsible for giving the knowledge of medicine and magic to humans, leading to the Great Flood described in Genesis."
    },
    {
      "title": "The Lesser Key of Solomon describes demons that mostly look like animals.",
      "content": "The Lesser Key of Solomon describes demons that mostly look like animals. According to this book, King Solomon (the son of David) captured 72 demons, each of which is given a name and a description. For instance, the first demon, Bael, appears like a cat, toad, man, or all at once, and the second spirit, Agares, appears in the form of a man riding a crocodile. [7] X Research source According to legend, King Solomon wrote this book (also known as the Lemegeton ) for his son, Rehoboam. But the Lesser Key of Solomon likely only dates to the 14th or 15th Century, and it’s not considered Biblical canon. [8] X Research source"
    },
    {
      "title": "Early Mesopotamian beliefs included animal-like demons known as galla.",
      "content": "Early Mesopotamian beliefs included animal-like demons known as galla. The galla of ancient Babylon were supernatural beings that held a secondary status to deities. One notable demon was Pazuzu—statues of Pazuzu have been found that may date as far back as 934 BC. These images show him as a demon with large wings, the body of a man, and the head of a lion or dog. [9] X Research source Another notable Babylonian demon was Lamashtu, a demon with the head of a lion, the ears of a donkey, and long, stringy hair. She’s said to have preyed on pregnant women and babies."
    },
    {
      "title": "Vedic and Hindu traditions describe demons known as devas or asuras.",
      "content": "Vedic and Hindu traditions describe demons known as devas or asuras. The devas (sometimes written as daevas) and asuras were demons or lesser deities. This varied depending on the region—in Iranian Zoroastrianism, daevas were demons, and in India, the asuras were demons. [10] X Research source Asuras are often depicted as having dark red or blue skin with black hair. They may also have multiple arms or heads. [11] X Research source Daevas are sometimes described as clawed human-like creatures, although they’re also depicted as elemental spirits. [12] X Research source"
    },
    {
      "title": "Islamic beliefs include jinn and devils with cloven feet.",
      "content": "Islamic beliefs include jinn and devils with cloven feet. According to tradition, these demonic creatures, called shaitan , have hooved feet and spread disease. They are under the control of the devil, called Iblis, and they exert power over mankind by whispering tempting suggestions into their ears. [13] X Research source"
    },
    {
      "title": "In Japanese culture, demons are called oni.",
      "content": "In Japanese culture, demons are called oni. The oni are very large ogre-like creatures, with horns, fangs, and usually red or blue skin. It’s said that a new oni is born when someone very wicked dies. They carry clubs and take delight in punishing or torturing humans. [14] X Research source Traditional Japanese oni masks often depict the horrible faces of the oni demons."
    },
    {
      "title": "In Persian Manichaeism, demons have animal faces and metallic bodies.",
      "content": "In Persian Manichaeism, demons have animal faces and metallic bodies. This religion describes demons as ruling over the five realms of Darkness. Each demon has the face of an animal, like a lion, eagle, or fish. The body is made of a natural element like gold, copper, or silver. [15] X Research source"
    },
    {
      "title": "Aboriginal Australian beliefs included demons like the bunyip.",
      "content": "Aboriginal Australian beliefs included demons like the bunyip. According to legend, the bunyip was a demon or monster with sharp tusks and fur, scales, or feathers, that lived in Australia’s waters. It was originally described as a creature that ate people, but over time, it became a friendly folk figure. [16] X Research source"
    },
    {
      "title": "Chinese demons include the mogwai and yaoguai.",
      "content": "Chinese demons include the mogwai and yaoguai. The “mo” or mogwai are evil creatures who tempt humans. The “yao” or yaoguai are spirits that aren’t necessarily evil, but that typically do exhibit malevolence towards people. One popular Chinese legend tells of the Bai Gu Jing, a yao made of white bones."
    },
    {
      "title": "Native American folklore includes demons like the wendigo or wechuge.",
      "content": "Native American folklore includes demons like the wendigo or wechuge. Algonquian First Nations tribes often include legends of the demonic wendigo, a thin, pale giant. In some tales, the wendigo has pointed ears; in others, it has antlers or horns. It often has glowing eyes and sharp teeth. [17] X Research source Athabaskan tribes describe an ice monster or demon known as the wechuge that preys on humans. [18] X Research source"
    },
    {
      "title": "Demons frequently inspire the imagination of writers and artists.",
      "content": "Demons frequently inspire the imagination of writers and artists. They were frequently the subject of medieval paintings, where they often appeared as grotesque, deformed monsters. [19] X Research source Demons are also frequently the subject of classic literature, and more recently, of TV and movies. For instance: Author J. R. R. Tolkien describes demon-like creatures known as Balrogs in his Lord of the Rings book trilogy. In The Inferno , Dante includes demons named the Malebranche as guardians of hell. Modern shows like “Supernatural” often depict demons as taking on human form to tempt or torment humans. Demons are also sometimes portrayed as invisible creatures that manifest through intrusive thoughts, illness, temptation, or nightmares."
    }
  ]
}