{
  "url": "https://www.wikihow.com/Talk-to-a-Guy-if-You-Are-Extremely-Shy",
  "title": "How to Talk to a Guy if You Are Extremely Shy",
  "steps": [
    {
      "title": "When you’re nervous, your mind might go blank.",
      "content": "When you’re nervous, your mind might go blank. Spend a few minutes thinking about what you could say to the guy you like so you have some options. You don’t have to write a whole script, but jotting down notes about what to say might be helpful. Try things like: [1] X Research source Asking about his weekend Seeing if he’s done the homework Talking about the class you’re in together Giving him a compliment"
    },
    {
      "title": "Faking it until you make it really works!",
      "content": "Faking it until you make it really works! As you think about talking to the guy you like, picture the conversation flowing smoothly and asking questions confidently. Try not to overthink your conversation, and remember that it’s okay to be a little awkward when you first meet someone. [2] X Research source Uncross your arms and stand up straight to look confident."
    },
    {
      "title": "Your body language can let him know you’re interested.",
      "content": "Your body language can let him know you’re interested. Glance in the guy’s direction and give him a small smile when your eyes meet. Turn your body towards him so he can tell you’d like to chat. [3] X Research source If he sees you smiling at him, he might even come over and talk to you! Reader Poll: We asked 162 wikiHow readers and 82% of them agreed that smiling helps to boost your mood . [Take Poll] So, smiling may also make you feel more relaxed and ready to talk to your crush!"
    },
    {
      "title": "If you’re feeling nervous, stop for just a second to prepare yourself.",
      "content": "If you’re feeling nervous, stop for just a second to prepare yourself. Take a deep breath in and let it out slowly before you head over to chat with a guy. Taking a moment for yourself can help steady your voice and boost your self-esteem. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source The hardest part about talking to someone new is just doing it!"
    },
    {
      "title": "This is the easiest way to approach a guy, even if you’re shy.",
      "content": "This is the easiest way to approach a guy, even if you’re shy. Simply walk on over and tell him your name, then ask for his. If you two already know each other (but not super well), you can remind him of your name instead. Say something like: [5] X Research source “Hey, I’m Johnathan. Nice to meet you.” “Hey, I’m Emily. I think we have English class together.” “What’s up, my name’s Stephanie. What’s yours?”"
    },
    {
      "title": "Comment on something around you to keep it casual.",
      "content": "Comment on something around you to keep it casual. Take note of your surroundings and pick out something to talk about: is the new coffee shop you’re in serving delicious pastries? Does the library have a new copy of the novel you love? Say something like: [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source “Wow, these bagels are so good. Have you tried them yet?” “Man, I didn’t know this book was out yet! Have you read it?”"
    },
    {
      "title": "Leading with a compliment is a great way to keep his interest.",
      "content": "Leading with a compliment is a great way to keep his interest. Walk up and tell him that you like his jacket, shoes, or backpack. He’ll probably be grateful that you said something, and the conversation can flow from there. Say something like: [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source “Whoa, cool pin. Where’d you get it?” “I like your shoes a lot. Are they new?” “Cool phone case, I love that color.”"
    },
    {
      "title": "Open-ended questions take more time and effort to answer.",
      "content": "Open-ended questions take more time and effort to answer. Try to pick questions that don’t have a “yes” or “no” answer so he can expand on what he’s saying and talk for a few minutes. He might even ask you some questions, too! Try questions like: [8] X Research source “What’s your favorite thing to do around here?” “Have you lived in the area for long?” “What’s your favorite class?”"
    },
    {
      "title": "As you learn more about him, find things you can relate to.",
      "content": "As you learn more about him, find things you can relate to. It’s super easy to connect with someone when you have stuff in common. Maybe you both go to the same school, or grew up in the same town, or just moved to the area. Say things like: [9] X Research source “No way, I just moved here too! Where are you from?” “I absolutely love Game of Thrones. Were you mad about the ending, too?” “I have a dog too! Her name is Princess.”"
    },
    {
      "title": "If you go to the same school, this is an easy way to hang out.",
      "content": "If you go to the same school, this is an easy way to hang out. Ask him to study with you for the big test or help you out on the homework problems. If he’s interested, he’ll probably jump at the chance to see you again. [10] X Research source Studying together is also a low-key way to get to know him more. Since it’s not a typical date, there’s no pressure on either of you."
    },
    {
      "title": "If you like this guy, you probably want to continue the conversation.",
      "content": "If you like this guy, you probably want to continue the conversation. As it wraps up, offer to give him your number so you guys can keep in touch. It’s a low-pressure way to let him know you’re interested, and you can text him later. Say something like: [11] X Research source “I’ve gotta go to class, but I’d love to talk later. Can I give you my number?” “That hike you were talking about sounds really fun. Wanna text me the details?”"
    },
    {
      "title": "The more you practice talking to people, the easier it will get.",
      "content": "The more you practice talking to people, the easier it will get. Chat with people in line at the grocery store, your classmates at school, or people you’re sitting next to on the bus. The more you practice your skill of talking to others, the easier it will be to approach the guy you like! [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    }
  ]
}