{
  "url": "https://www.wikihow.com/Stop-a-Cough-from-Post-Nasal-Drip",
  "title": "Easy Ways to Treat Post Nasal Drip",
  "steps": [
    {
      "title": "Take mucus-thinning medications.",
      "content": "Take mucus-thinning medications. Mucus-thinning medications are also known as expectorant medications. This sort of medication causes the mucus to become thin and move up from your throat and into your mouth (you can then spit it out). It increases the amount of mucus you have, but thins it out so that your body—in particular the ciliated hairs in your throat—have an easier time getting out of your throat. When the mucus is removed, your cough will stop. [1] X Research source Guaifenesin, which also referred to as glyceryl guaiacolate, is one of the most common mucus-thinning medications available."
    },
    {
      "title": "Use a saline nasal spray.",
      "content": "Use a saline nasal spray. Saline just means saltwater. Nasal sprays send a mist of saline water directly up and into your nose. Saline nasal sprays and nasal irrigation devices flush out excess mucus, allergens and irritating substances from your nasal passages and throat. When all of these things get flushed out of your body, your cough will stop. [2] X Research source After rinsing the sinus, you can also use a nasal steroid to help calm any inflammation that can lead to congestion and drainage."
    },
    {
      "title": "Suck on cough drops to get rid of your cough.",
      "content": "Suck on cough drops to get rid of your cough. A cough drop contains ingredients like benzocaine, eucalyptus oil, menthol, peppermint oil, spearmint or honey. All of these ingredients soothe irritated nerves and mucous membranes in your throat. When these nerves and membranes are soothed, your cough impulse will go away. There are many different kinds of cough drops out there. You can purchase them over-the-counter at your local pharmacy."
    },
    {
      "title": "Combat allergies with over-the-counter antihistamines.",
      "content": "Combat allergies with over-the-counter antihistamines. If your post nasal drip is caused by allergies, as most post nasal drips are, you should take antihistamines to reduce your allergy symptoms. Your body produces histamine when it thinks your body is being attacked by something. While this is good if your body is actually being attacked, allergies are caused by your body mistakenly thinking something like pollen is trying to attack your cells. Antihistamines stop your body from wrongly producing histamine. [3] X Research source Chlorpheniramine: This antihistamine is usually taken as a 4 mg tablet. As an adult, you can take a maximum of 24 mg a day. Children should only take 12 mg a day. This sort of antihistamine may cause drowsiness. Diphenhydramine: This antihistamine is most commonly known as Benadryl. Generally you should only take one tablet of this antihistamine in a 24 hour period. Benadryl can cause serious drowsiness in some people."
    },
    {
      "title": "Try ‘new generation’ antihistamines.",
      "content": "Try ‘new generation’ antihistamines. New generation antihistamines have less side effects than the older antihistamines listed in the previous step. However, some people have found that they are less effective—it all depends on your own personal allergies. Try them out and see if they work for you. [4] X Research source Desloratadine: This antihistamine comes in both tablet and syrup form. It is non-drowsy so you can take it and still function. It is non-drowsy because it does not delve deeply into your body and affect your central nervous system, as older generation antihistamines do. Fexofenadine: This antihistamine also remains outside the central nervous system. It comes in tablet form."
    },
    {
      "title": "Gargle with salt water.",
      "content": "Gargle with salt water. Mix a tablespoon of regular salt in a glass or warm water. Take some of the mixture into your mouth and swish it around or gargle it so that it reaches the back of your throat. Spit it out and repeat with the rest of the salt water mixture. The salt water will help to dislodge mucus from the back of your throat. [5] X Research source Do this once in the morning and once at night."
    },
    {
      "title": "Try inhaling steam to clear your sinuses.",
      "content": "Try inhaling steam to clear your sinuses. Inhaling steam can help soften dried mucus and throat linings. It also acts as a natural decongestant that widens your nasal passageways, making it easier for you to breathe. Steam can also help to loosen secretions in your throat, which reduces the likelihood that you will cough. [6] X Research source To create a steam inhaler at home: Boil water. Place the boiled water in a large bowl. Cover your head with a towel and put your head over the bowl of hot water. Make sure that the towel covers your whole head and the bowl. The towel keeps the steam from escaping and dispersing. Inhale the steam until the water cools down. You can also take a hot shower. Keep all of the windows and doors closed so that it becomes super steamy in your bathroom."
    },
    {
      "title": "Up your intake of ginger.",
      "content": "Up your intake of ginger. Ginger has anti-inflammatory properties that can reduce swelling in your throat that is caused by mucus irritation. When the swelling in your throat goes down, you will be less inclined to cough. [7] X Research source To consume more ginger: Drink ginger tea, take ginger supplements, or add more raw ginger to your meals."
    },
    {
      "title": "Eat more garlic.",
      "content": "Eat more garlic. Garlic contains allicin, which helps to combat colds and other respiratory issues. If your cough is caused by a cold, garlic is a good natural way to fight the cold because it can help to kill the virus causing the irritation in your throat. To consume more garlic: Eat two to four raw garlic cloves a day. You can also take garlic supplements, or add more garlic to your meals."
    },
    {
      "title": "Drink echinacea tea.",
      "content": "Drink echinacea tea. Echinacea contains alkylamides, which are known to reduce the duration of colds and other respiratory infections. Echinacea also prevents your nasal and throat passageways from drying out, which means that they are less likely to become irritated. You can increase your intake of echinacea by drinking echinacea tea, taking supplements (in tablet form) or using echinacea tinctures."
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. Drinking plenty of water each day can help to loosen up the mucus in the back of your throat. Water also helps to thin out the mucus and helps your body to flush it away. Drinking plenty of water also keeps your throat moist; when your throat becomes dry, it is more likely to become irritated and make you cough. Try to drink 8 to 12 glasses of water a day, though you should drink more if you are physically active."
    },
    {
      "title": "Remove all dust and other allergens from your room.",
      "content": "Remove all dust and other allergens from your room. If you have allergies and are dealing with a chronic cough, you should thoroughly clean your house and room to remove any allergens that could be causing your cough. When are surrounded by allergens, your body produces more mucus, which in turn makes you cough more. Bathe your pet every other day. Pets, especially those who are furry, can accumulate dust that can contribute to your allergies. Clean your house at least once or twice a week. Vacuum carpets and rugs once or twice a week. Open your windows in the morning to let some fresh air into your house, but close them halfway through the day so that you can keep allergens out."
    },
    {
      "title": "Set up a vaporizer or humidifier in your room.",
      "content": "Set up a vaporizer or humidifier in your room. Dry air can make your throat irritated. It can also dry out the mucus in your throat, which can irritate your throat further. If you live in a dry climate, install a vaporizer or humidifier in your room to keep the air more moist. [8] X Research source Clean your humidifier every week to make sure that it is not blowing dust and other allergens into your room."
    },
    {
      "title": "Consume less dairy.",
      "content": "Consume less dairy. Dairy products can make the mucus in your throat thicken, which in turn can make your cough worse. While dealing with your cough, try to avoid eating or drinking dairy products. You can resume consuming these dairy products after your cough clears up. Avoid products like: Milk, cheese, half-and-half, yogurt, and ice cream."
    },
    {
      "title": "Quit smoking and avoid being around cigarette smoke.",
      "content": "Quit smoking and avoid being around cigarette smoke. Cigarette smoke contains certain chemicals, like nicotine, that irritate the mucous membrane in your nose and throat. When the membrane becomes irritated, it produces more mucus, which in turn can cause a cough. To stop or avoid a chronic cough, quit smoking. You should also try to avoid secondhand smoke, as it can have the same effect on your mucous membrane."
    },
    {
      "title": "Elevate your head and shoulders with a pillow when sleeping at night.",
      "content": "Elevate your head and shoulders with a pillow when sleeping at night. When you sleep, mucus has a tendency to accumulate in the back of your throat, which can lead to a cough. When you elevate your head by propping it up with a pillow, the mucus drains out of your throat more easily. Try to prop your head and shoulders up so that you are in an almost-sitting position. While this might not be the most comfortable way to sleep, it will help you to get rid of your cough."
    },
    {
      "title": "Wash all of your bedding.",
      "content": "Wash all of your bedding. Wash all sheets, mattress covers and pillowcases with hot water. These fabrics often collect dust and other allergens when they are not washed often. Washing them will remove these allergens and thus will help to reduce the amount of mucus in your throat that is causing you to cough."
    }
  ]
}