{
  "url": "https://www.wikihow.com/Turn-Off-Tumblr-Live",
  "title": "Easy Ways to Use Snooze to Disable Tumblr Live",
  "steps": [
    {
      "title": "Tap the profile icon in the Tumblr mobile app.",
      "content": "Tap the profile icon in the Tumblr mobile app. It's in the lower right corner the Tumblr app when you're signed in on your Android, iPhone, or iPad."
    },
    {
      "title": "Tap .",
      "content": "Tap . You'll see this gear icon in the top right corner of your screen."
    },
    {
      "title": "Tap Account settings.",
      "content": "Tap Account settings . It's the first option on the menu."
    },
    {
      "title": "Tap Dashboard preferences.",
      "content": "Tap Dashboard preferences . You'll see it in the first grouping of menu options, near the bottom of your screen."
    },
    {
      "title": "Tap the switch next to \"Snooze Tumblr Live\" to toggle it off.",
      "content": "Tap the switch next to \"Snooze Tumblr Live\" to toggle it off. This turns off Tumblr Live for 30 days. Repeat these steps every 30 days to keep Tumblr Live off your dashboard. If you snooze Tumblr Live in the mobile app, you also won't see the section when you log into Tumblr using your browser."
    },
    {
      "title": "Go to https://www.tumblr.com/dashboard.",
      "content": "Go to https://www.tumblr.com/dashboard . If you're not signed in, you'll be prompted to do so now."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . You'll see a gear icon next to the word Settings in the panel on the left side of your screen."
    },
    {
      "title": "Click Dashboard.",
      "content": "Click Dashboard . It's on the menu on the right side of your screen."
    },
    {
      "title": "Click the switch next to \"Snooze Tumblr Live\" to toggle it off.",
      "content": "Click the switch next to \"Snooze Tumblr Live\" to toggle it off. It's under the Preferences header near the bottom of the page. If the switch is blue and pointing right, Tumblr Live will not appear on your dashboard for 30 days. Repeat this process every 30 days to keep Tumblr Live off your dashboard. If you snooze Tumblr Live on your computer, you also won't see the section when you open the Tumblr mobile app."
    },
    {
      "title": "Go to your uBlock Origin dashboard.",
      "content": "Go to your uBlock Origin dashboard. If you're using uBlock Origin to block adds in your computer's web browser, you can also use it to turn off Tumblr Live. Click the \"UO\" shield icon at the top-right corner of your browser, then click the gears. If you don't see the gears, click More to see more options. You may need to click More multiple times to find the gears. If you don't have uBlock Origin installed for your web browser, you can find it wherever you get your extensions , like Mozilla's addon page for Firefox and the Chrome Web Store for Chrome. Simply click the Get or Install button and the ad-blocker will be set up through your browser! Since this method blocks the code for Tumblr Live, it's a more permanent solution than snoozing. However, it'll only work on your computer."
    },
    {
      "title": "Click the My filters tab.",
      "content": "Click the My filters tab. You'll see this tab at the top of the page."
    },
    {
      "title": "Paste the following code:",
      "content": "Paste the following code: ||tumblr-live.com www.tumblr.com##.ADlDx www.tumblr.com##div.KTRcB:nth-of-type(3)"
    },
    {
      "title": "Click Apply changes.",
      "content": "Click Apply changes . You can close the window once you apply the changes and will see that the Tumblr Live section doesn't load. It's not as clean as snoozing Tumblr Live, but you don't have to redo the steps every 30 days."
    }
  ]
}