{
  "url": "https://www.wikihow.com/Wash-a-Chest-Binder",
  "title": "How to Wash a Chest Binder",
  "steps": [
    {
      "title": "Close any fastenings on your binder.",
      "content": "Close any fastenings on your binder. If you have a binder that fastens shut, such as with a zipper or Velcro, close the fastenings before putting it in the wash, to ensure nothing is damaged. [1] X Research source"
    },
    {
      "title": "Flip your binder inside-out.",
      "content": "Flip your binder inside-out. You'll want to turn your binder inside-out when you wash it, since the inside is the part that touches your skin the most and is more likely to get sweaty. Since you'll be hand-washing your binder, you'll have more control over what spots get washed, so while you do want to wash the inside, it's important to get the outside as well."
    },
    {
      "title": "Place your binder in water.",
      "content": "Place your binder in water. Fill a sink - or even a plastic tub or bucket - with cool water and place your binder into the water. Some binders can be soaked, but don't soak it for too long to avoid a risk of damaging the fabric. Check the temperature before washing! It's a bad idea to throw a binder into hot water - it can damage the material and cause it to shrink (as well as hurt your hands). If you don't know the temperature recommendations for your specific binder, opt for cool water."
    },
    {
      "title": "Wash your binder with a mild or normal detergent.",
      "content": "Wash your binder with a mild or normal detergent. You don't need to do any harsh scrubbing or squeezing - just put some detergent into the water and use your hands to swirl and lightly knead your binder in the water. [2] X Research source [3] X Research source If you don't have access to any detergent, bar soap will work in a pinch. [4] X Research source If you notice any stains on your binder, you can gently scrub the stain with your hands or with soap, but be careful not to be too rough. Don't use a strong detergent, bleaches, or softeners when washing your binder, as these can damage the material. [5] X Research source"
    },
    {
      "title": "Rinse your binder thoroughly.",
      "content": "Rinse your binder thoroughly. After your binder has been cleaned well, fully rinse it with clean water, until there are no traces of bubbles or soap on the fabric. [6] X Research source"
    },
    {
      "title": "Hang your binder up to dry.",
      "content": "Hang your binder up to dry. Once you've finished washing your binder, gently squeeze the extra water out, then place your binder on a hanger and hang it up somewhere to dry, such as near a window or on the door of your shower. It's also possible to dry your binder on a clothesline outside. It's best to dry your binder in a well-ventilated area. However, if you need to hide your binder and can't dry it out in the open, find an option that isn't so visible, such as hanging it in your closet. [7] X Research source Do not put your binder in a dryer - this can damage the binder, cause it to shrink, and will shorten its lifespan. [8] X Research source"
    },
    {
      "title": "Close any fastenings on your binder.",
      "content": "Close any fastenings on your binder. If you have a binder that fastens shut, such as with a zipper or Velcro, close the fastenings before putting it in the wash, to ensure nothing is damaged. [9] X Research source"
    },
    {
      "title": "Flip your binder inside-out.",
      "content": "Flip your binder inside-out. Since the inside of your binder is the part that touches your skin the most (and usually gets sweaty), turning it inside-out will help to clean it better. Since your binder is going in the washing machine, it will also help to protect any fastenings that your binder may have. It's recommended to wash any delicates inside-out. [10] X Research source"
    },
    {
      "title": "Put your binder in a delicates bag, if possible.",
      "content": "Put your binder in a delicates bag, if possible. Chest binders are made of an elastic material, so it's recommended to put them in a bag for delicates (sometimes called lingerie bags) before putting them in with the wash. This will help protect the material. Binders can be put in the wash without being bagged, [11] X Research source but it's not recommended."
    },
    {
      "title": "Wash your binder with similar delicates, if possible.",
      "content": "Wash your binder with similar delicates, if possible. It's often best to machine-wash binders with other delicates of the same weight and color, since it gets more clothes cleaned in one wash. [12] X Research source If you don't have a lot of delicate clothes that you can wash your binder with, it's possible to put it in with your normal clothes. [13] X Research source Just be careful that your binder's fabric or fastenings won't snag on other things in the wash!"
    },
    {
      "title": "Use cold water with mild or normal detergent.",
      "content": "Use cold water with mild or normal detergent. While it's recommended to use a mild detergent, these are more expensive, so using a normal detergent will work fine if you don't have it. However, you should only wash your binder in cold water - hot water will cause it to shrink. [14] X Research source Don't use strong detergents, bleach, or softeners - these will damage your binder. [15] X Research source"
    },
    {
      "title": "Set the spin cycle to \"gentle\" or \"delicates\", if possible.",
      "content": "Set the spin cycle to \"gentle\" or \"delicates\", if possible. A fast spin cycle can damage your binder (as well as other delicates). [16] X Research source [17] X Research source If you don't have an option on your machine for delicates, though, a standard wash will still work, as long as it's not too rough. [18] X Research source"
    },
    {
      "title": "Hang your binder up to dry.",
      "content": "Hang your binder up to dry. Once you've finished washing your binder, remove it from the delicates bag. Place it on a hanger and hang it up somewhere to dry, such as near a window or on the door of your shower, or on a clothesline outside. It's best to dry your binder in a well-ventilated area. However, if you need to hide your binder and can't dry it out in the open, find an option that isn't so visible, such as hanging it in your closet. [19] X Research source Do not put your binder in a dryer - this can damage the binder, cause it to shrink, and will shorten its lifespan. [20] X Research source"
    }
  ]
}