{
  "url": "https://www.wikihow.com/Use-an-Appendix",
  "title": "How to Use an Appendix",
  "steps": [
    {
      "title": "Include testing and research materials readers might want to review.",
      "content": "Include testing and research materials readers might want to review. The materials you used in your research may be of interest to readers, so it’s helpful to put them in an appendix. Use an appendix for items that don’t fit in the body of your paper. For instance, you could include the following: [1] X Research source Surveys or questionnaires you used in your research Copies of letters or emails Transcripts from interviews"
    },
    {
      "title": "Provide supporting information for your topic.",
      "content": "Provide supporting information for your topic. You may have extraneous information that supports your ideas but isn’t essential for readers to know. Similarly, you may have words or concepts that most readers will know but it would be helpful to explain for novice readers. Create an appendix for this type of information, as well. Examples include the following: [2] X Research source Important words that need to be defined Further description of the testing methods or process for choosing a particular testing method A detailed description of the materials or testing equipment you used Interesting details that might interest the reader but aren’t necessary to understand your conclusions Additional background about your topic"
    },
    {
      "title": "Include your raw data and original math.",
      "content": "Include your raw data and original math. While you don’t necessarily need to present your data and math, it’s generally a good idea to provide it in an appendix so readers can review it. Readers in your field may want to check your math or test your data for themselves. Consider creating an appendix if you have raw data or proofs. [3] X Research source For instance, you might include your raw data in 1 appendix and your mathematical proofs in a separate appendix."
    },
    {
      "title": "Attach photos, maps, or diagrams in an appendix.",
      "content": "Attach photos, maps, or diagrams in an appendix. Depending on your topic and the research you did, it’s possible you have images or graphics that help the reader understand your conclusions better but aren’t necessary for the body of your paper. You can include these items in an appendix. Create a separate appendix for each visual you want to include. [4] X Research source For example, let’s say you conducted an environmental study. You might include a map of the area you studied. Similarly, you might include a photo of your lab setup for a chemistry experiment."
    },
    {
      "title": "Make a separate appendix for each piece of information.",
      "content": "Make a separate appendix for each piece of information. Each appendix will be hyper-focused on 1 item, so you’ll need to make a new appendix for each thing you want to include at the end of your paper. This makes it much easier for readers to follow along because it’s clear exactly what’s in each appendix. Create as many appendices as you need to present the information you want to include. [5] X Research source For instance, let’s say you want to create appendices for a questionnaire, emails you exchanged with an expert on your topic, and raw data from an experiment you did. You’d need 3 separate appendices."
    },
    {
      "title": "Put each appendix on a separate page.",
      "content": "Put each appendix on a separate page. Start each appendix on a new page so it’s easier for your reader to find them. Don’t worry about whether or not an appendix fills up the entire page or not. It's okay to have empty space in an appendix. [6] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For instance, Appendix A might be on pg. 23, Appendix B may be on pg. 25, and Appendix C could be on pg. 26. If you have 3 or fewer short appendices, you may decide to include them on the same page. However, it’s easier for readers to scan them if they’re on separate pages."
    },
    {
      "title": "Start labeling the appendices with “Appendix” or “Appendix A.”",
      "content": "Start labeling the appendices with “Appendix” or “Appendix A.” If you’re only including 1 appendix, just label it “Appendix” with no quotes. However, you’ll need to include letters in your labels if you’re using multiple appendices. Title the first one “Appendix A.” Center your title and use the same font style as you did in the rest of your paper. [7] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source You don’t need to describe what’s included in the appendix in the title."
    },
    {
      "title": "Use consecutive letters or numbers to label multiple appendices.",
      "content": "Use consecutive letters or numbers to label multiple appendices. When you’re including multiple appendices, consecutive letters and numbers make it easy for readers to find the one they want. Keep labeling your appendices until they’re all labeled or numbered. [9] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For instance, you might have an “Appendix A,” Appendix B,” and Appendix C” at the end of your paper. Similarly, you could write, “Appendix 1,” Appendix 2,” and “Appendix 3.”"
    },
    {
      "title": "Label your tables and graphs with a new numbering sequence.",
      "content": "Label your tables and graphs with a new numbering sequence. You may include extra tables and graphs in your appendices. Don’t use the same numbering as you did in your paper. Since the appendices are a separate section, start a new numbering system. [10] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For instance, you might start over with “Appendix Table 1” or “Appendix Figure A.” If a particular table or graph is necessary for your reader to understand your conclusions, include in your paper rather than an appendix."
    },
    {
      "title": "Refer to each appendix in the text of your paper.",
      "content": "Refer to each appendix in the text of your paper. Every appendix should be relevant to what you discuss in your paper. In your paper, direct the reader to an appendix when it’s relevant to what they’re reading. If they like, readers can then reference your appendix to get additional information to help them understand your text. [11] X Research source For instance, when discussing survey results, you might include this text: “See Appendix A for a copy of the survey.”"
    },
    {
      "title": "Put your appendices in the order they appear in your paper.",
      "content": "Put your appendices in the order they appear in your paper. Go through your paper to find where you refer to each appendix. Then, organize them in the order you reference them. This will make it easier for your readers to use the appendices. [12] X Research source For example, let’s say you have an appendix for a survey, an appendix for your raw data, and an appendix for an interview transcript. If you reference the interview first, followed by the survey and data, you’d put the appendices in that order."
    },
    {
      "title": "Put your appendices either before or after your references page.",
      "content": "Put your appendices either before or after your references page. It’s most common to put the appendices after your references since they’re an add-on to your paper. However, you can choose to put the references last if that’s how you want your paper to appear. Do what works best for your paper. [13] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Check the instructions from your instructor or the journal where you’re submitting to see if they have specific rules about where the appendices should be placed."
    },
    {
      "title": "Insert page numbers that continue the paper’s numbering sequence.",
      "content": "Insert page numbers that continue the paper’s numbering sequence. Although your appendices are a separate section, you’ll still use the same page number sequence that you started in the body of your text. Simply add the appendices to your main document and continue the page numbers. [14] X Research source For instance, if your paper ended on page 22, your first appendix would be page 23."
    },
    {
      "title": "List the appendices on the table of contents.",
      "content": "List the appendices on the table of contents. If you have a table of contents, include your appendices so readers can easily find them. Once you know which page each appendix will appear on, add the appendices to your table of contents. [15] X Research source You don't need a table of contents to have appendices."
    }
  ]
}