{
  "url": "https://www.wikihow.com/Write-an-Artist-Statement",
  "title": "How to Write an Artist Statement",
  "steps": [
    {
      "title": "Be honest with yourself.",
      "content": "Be honest with yourself. Before you write a word, take some time to just think about you and your art. You need to understand what it is that you are trying to achieve, before you attempt to explain it to anyone else. [1] X Research source Ask yourself what you're doing. What does your art express? What makes your art unique? Ask yourself why you're doing it. What motivates you to create art? What emotions or ideas are you trying to convey? What does your art mean to you? Ask yourself how you're doing it. What do you draw inspiration from? What tools and materials do you use? Know that your artist statement will evolve over time as your work evolves and your own understanding of it changes as people respond to it."
    },
    {
      "title": "Consider your influences.",
      "content": "Consider your influences. Think about the things that influence you, whether it's art, music, literature, history, politics or the environment. Think about how these influences have made an impression on you and how they manifest themselves in your work. Try to be as specific as possible. [2] X Research source"
    },
    {
      "title": "Make a mind-map.",
      "content": "Make a mind-map. Mind-mapping is a good way to free your thinking. It will also help you to trace the relationship between different ideas. Jot down a key idea that informs your work in the center of a blank page. Then spend 15 minutes writing down any words, phrases, feelings, techniques etc. related to that idea. Free writing is another technique that can help get the creative juices going. Spend 5-10 minutes writing whatever pops into your head when you think about your art. You'll be amazed at what you come up with."
    },
    {
      "title": "Determine what you want people to understand.",
      "content": "Determine what you want people to understand. Think about what you want people to take away from your art. What message or emotion are you trying to convey?"
    },
    {
      "title": "Make a statement about why you do what you do.",
      "content": "Make a statement about why you do what you do. The first section of your artist's statement should begin with a discussion of why you make art. Try to make it as personal as possible. Talk about what your goals are and what you hope to achieve through your art. [3] X Research source"
    },
    {
      "title": "Describe your decision-making techniques.",
      "content": "Describe your decision-making techniques. In the second section of you statement, tell the reader about your decision-making process. How do you select a theme? How do you choose what materials to use? What techniques to utilize? Keep it simple and tell the truth."
    },
    {
      "title": "Talk about your current work.",
      "content": "Talk about your current work. In the third section, provide some insight into your current work. How does it relate to your previous work? What life experiences informed it? What are you exploring, attempting or challenging through this work?"
    },
    {
      "title": "Keep it short, sweet, and to the point.",
      "content": "Keep it short, sweet, and to the point. Your artist statement is an introduction to your work, not an in-depth analysis of it. Your artist’s statement should be one to two paragraphs and no longer than a page. [4] X Research source Your statement should answer the most commonly asked questions about your art, not overwhelm readers with irrelevant facts and minute details. It's good to articulate your goal, but try to leave space for people to have the experience of your work with their own personal baggage. Brevity and efficiency of language are key. A good statement will leave your readers wanting more."
    },
    {
      "title": "Use simple language.",
      "content": "Use simple language. An effective artist's statement reaches out and welcomes people to your art, no matter how little or how much they know about art to begin with; it never excludes. It should make your work more accessible, not obscure it with convoluted language filled with artsy jargon. [5] X Research source Write in simple, straightforward, everyday language. Make \"I\" statements rather than \"you\" statements. Talk about what your art does for you, not what it's supposed to do for the viewers. Know your audience but remember that simpler is always better in this situation."
    },
    {
      "title": "Let it rest.",
      "content": "Let it rest. Your artist's statement is a piece of very personal writing. Once you've finished writing, let it rest overnight before your reread it. Taking some time will help you take a step back and give you the detachment necessary to polish the writing without violating your sense of integrity and safety."
    },
    {
      "title": "Seek feedback.",
      "content": "Seek feedback. Before you go public with your statement, get feedback. Show your art and statement to friends, friends' friends, and maybe even a stranger or two. [6] X Research source Make sure your readers get it, that they understand what you want them to understand. When they don't, or you have to explain yourself, do a rewrite and eliminate the confusion. Keep in mind that you alone are the authority for what is true about your work, but feedback on clarity, tone and technical matters such as spelling and punctuation never hurts."
    },
    {
      "title": "Revise as needed.",
      "content": "Revise as needed. Many times, a little rearranging is all that's necessary to make your statement a clean, clear read. If you need help, find someone who writes or edits and have them fix the problem."
    },
    {
      "title": "Use your statement.",
      "content": "Use your statement. Make the most of your artist statement and use it to promote your work to gallery owners, museum curators, photo editors, publications and the general public."
    },
    {
      "title": "Save all your notes and drafts.",
      "content": "Save all your notes and drafts. Save all the notes and drafts that you've made. You'll want to revise and update your artist's statement from time to time to reflect changes in your work. Having your original notes and drafts at your disposal will help you to immerse yourself in your past thought processes and will give you a sense of creative continuity."
    }
  ]
}