{
  "url": "https://www.wikihow.com/Study-for-Long-Hours",
  "title": "How to Study for Long Hours",
  "steps": [
    {
      "title": "Keep your phone out of sight and out of mind.",
      "content": "Keep your phone out of sight and out of mind. Put your phone in a drawer or keep it in your bag so you won't be tempted to use it. Additionally, stay off any other distracting electronic devices unless you need them to study. [1] X Research source"
    },
    {
      "title": "Eat a healthy snack before you study.",
      "content": "Eat a healthy snack before you study. A grumbling stomach is distracting, so have yogurt, oatmeal, or fruit before you get to work. It's also a good idea to keep a granola bar, nuts, or trail mix handy in case you get hungry. [2] X Research source Healthy snacks that are packed with protein and complex carbs give you the fuel you need to stay focused. Fruit, nuts, and whole grains are good choices. Avoid sweets and junk food, which will cause your blood sugar to spike and dip."
    },
    {
      "title": "Choose a designated spot for studying.",
      "content": "Choose a designated spot for studying. Find a distraction-free spot, like a low-traffic part of your home or the library. Try to use that location (or a few regular locations) whenever you study. If you study in the same place over and over again, you'll unconsciously sense it's time to get to work when you arrive at that location. [3] X Research source Additionally, study at a desk or table with enough room to spread out your study materials. Avoid studying in bed, since getting too comfortable can distract you from your studies. Keep your area neat, clean and organized, which can help you keep a clear mind. A messy space will make your mind feel cluttered, as well. Try to study in an area that has natural light, which can help energize your mind."
    },
    {
      "title": "Mix up tasks and topics to prevent boredom.",
      "content": "Mix up tasks and topics to prevent boredom. If you have multiple assignments or subjects to study, work on 1 for an hour, then switch gears. Even if you're studying for a test and can't switch subjects, try to focus on 1 unit or topic for about an hour at a time. [4] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For example, if you're studying for a history test on World War II, review your notes on the events leading up to the war. Take a break to have a snack or stretch, then work on the European front. You could also review textbook chapter outlines for an hour, then switch to studying flashcards . Rather than try to force yourself to concentrate on 1 thing, you'll boost your efficiency and remember more if you mix up your tasks."
    },
    {
      "title": "Study difficult subjects first to get them out of the way.",
      "content": "Study difficult subjects first to get them out of the way. If you get your toughest or most boring work out of the way, it'll be easier to study for a longer period of time. Tackle difficult tasks when you're fresh, and save your easiest assignments for when you start to run out of gas. [5] X Research source For instance, if you're not a fan of chemistry, start your study session by doing practice problems for the quiz you have the next day. Once you've knocked that out, move on to the subjects you enjoy most."
    },
    {
      "title": "Play music while you study if it helps you concentrate.",
      "content": "Play music while you study if it helps you concentrate. Playing music helps some people stay focused, but it doesn't work for everyone. If you don't find it distracting, listen to instrumental music while you study to keep your head in the game. [6] X Research source Classical music is a good choice, since there are no distracting lyrics. You could also try listening to ambient tunes, electronic music, or nature sounds. To keep track of time, make an hour-long playlist instead of listening to random tracks. That way, you'll know when to take a break or switch to another subject."
    },
    {
      "title": "Write down your goals on a calendar or dry-erase board.",
      "content": "Write down your goals on a calendar or dry-erase board. Seeing your goals written in an obvious spot can help you commit to them. Place a calendar or dry-erase board in your work area, and write down what you need to accomplish. In a pinch, write your goal prominently in your assignment pad, on an index card, or on a sheet of paper. [7] X Research source Reader Poll: We asked 168 wikiHow readers if they use a calendar to keep track of their schedule, and 54% said yes . [Take Poll] Keeping a calendar is a great way to remember and complete major tasks."
    },
    {
      "title": "Take a break every hour or so to stay fresh.",
      "content": "Take a break every hour or so to stay fresh. You may be tempted to hunker down and study for several hours straight, but that's a quick way to lose motivation. Your body and brain need breaks, so take 10 minutes or so to refresh yourself every hour. Go for a walk, grab a snack, or stretch, then get back to work. [8] X Research source During your break, make sure you don't engage in any distracting activities. For example, don't turn on your TV, as you might get interested in what's on and not go back to studying. Similarly, you might avoid getting on social media if you have a tendency to keep scrolling once you've started. Find a natural break in your studies instead of stopping abruptly in the middle of something. It's better to hold off on taking a break for 15 or 30 minutes than to stop and forget what you were doing."
    },
    {
      "title": "Try to connect the material to your personal interests.",
      "content": "Try to connect the material to your personal interests. Look for ways to relate your studies to your life. Take a stand on an issue in history class, or connect topics in science to your daily experiences. Even if something seems uninteresting, keep an open mind and give it a chance to capture your attention. [9] X Trustworthy Source Darmouth University Academic Skills Center Center within Dartmouth University dedicated to assisting students achieve academic goals by providing pedagogical resources Go to source When you're interested in a topic, motivating yourself to study it takes a lot less effort. If you just can't get into a subject, do your best to make it fun. For instance, if you love to draw, make diagrams and sketches of the concepts you're studying. [10] X Research source"
    },
    {
      "title": "Give yourself a small reward when you complete a task.",
      "content": "Give yourself a small reward when you complete a task. If you know there's a treat waiting for you, you'll be more likely to stick with your studies. Incentives for a job well done could include playing video games, watching TV, indulging in a snack, or a splurging on a clothing item or accessory. [11] X Research source Don't be too hard on yourself if you don't accomplish your task, but be sure to reward yourself only when you actually finish. Writing down a specific study goal and reward in your assignment pad can help you stay on target. For instance, write “Task: Review history lecture notes for 2 hours. Reward: Play video games for 30 minutes.”"
    },
    {
      "title": "Study with a group to hold each other accountable.",
      "content": "Study with a group to hold each other accountable. Get together with classmates who take studying seriously and won't tempt you to blow off your work. Quiz each other, take turns explaining concepts, and help each other resist the urge to procrastinate. [12] X Research source Explaining concepts to others is a great way to process and memorize information. Studying with others can also help you fill in any gaps in your notes."
    },
    {
      "title": "Reduce your workload by studying more efficiently.",
      "content": "Reduce your workload by studying more efficiently. Before you start studying, always read over your assignment sheet or exam guide to make sure you're focusing on the right topics. Additionally, you can save time by asking your instructor to explain any topics that confuse you and any unanswered questions you have. This saves you time looking it up. Finally, prioritize the most important information you need to know so you can study it first. [13] X Research source When you're studying for long hours, it's important to use that time wisely. For example, review your exam study guide as soon as you receive it, and highlight the main topics you need to study. If you have any questions, talk to your instructor so you won't waste time trying to look it up on your own. Then, decide which topics you need to spend the most time studying and start with those."
    },
    {
      "title": "Prep your area before you start studying.",
      "content": "Prep your area before you start studying. Make sure you have everything you need so you won't need to get up every few minutes to get something. Neatly place your textbooks, writing utensils, notebook, and other study materials on your study space. This way you can easily grab what you need without taking an unplanned break. For example, let's say you're studying math. You'd need your assignment materials (i.e. worksheet, textbook, etc), a calculator, graphing paper, a pencil, an eraser, drinking water, and a healthy snack."
    },
    {
      "title": "Plan out your study sessions in advance.",
      "content": "Plan out your study sessions in advance. Estimate the time you'll need for each task, add 10% extra time for insurance, then schedule blocks for your assignments. Set priorities, schedule your toughest and most important assignments first, and remember to include short breaks every hour or so. [14] X Research source For instance, if you're planning out a 4-hour session, set aside the first 2 hours to study for your big science test. Switch gears and do your math homework for the third hour, and review your history notes for the fourth. If you have time left over, spend a little more time studying for your science test. Additionally, make a weekly list of your upcoming tasks. Fill in fixed blocks of time, such as classes, work, and practice, then divide your flexible time between studying and other assignments."
    },
    {
      "title": "Break up overwhelming tasks into smaller steps.",
      "content": "Break up overwhelming tasks into smaller steps. Assignments such as “Study for History Final” or “Write Term Paper” can seem daunting and unapproachable. Instead of getting overwhelmed, divide big assignments into bite-sized chunks. [15] X Research source For example, if you're studying for a final, start by looking over past tests and quizzes, and note specific areas that gave you trouble. Then review your class notes, divide the course into its units, and study 1 unit at a time. Smaller, approachable study tasks may also include creating outlines that summarize textbook chapters, making flashcards, and quizzing yourself."
    },
    {
      "title": "Do your best to space out your study sessions instead of cramming.",
      "content": "Do your best to space out your study sessions instead of cramming. Whenever possible, try to plan ahead and give yourself time to study a little bit at a time. It's better to study for 3 separate 3-hour sessions instead of 1 marathon 9-hour session. If you study in multiple shorter sessions, you'll remember more information in the long run. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Lighten your load if you're stretched thin.",
      "content": "Lighten your load if you're stretched thin. If you're having trouble finding time for your schoolwork, take an inventory of your responsibilities. Ask yourself if there are lower-priority activities or commitments that are taking up too much of your time. If necessary, consider giving something up to free up your schedule. [17] X Research source For instance, suppose school, a part-time job, basketball, and choir are running you ragged. School and work are priorities, so they're not going anywhere. If basketball is really important to you, take time away from choir. Then see if you can rejoin after basketball season is over."
    }
  ]
}