{
  "url": "https://www.wikihow.com/Songs-About-Fire",
  "title": "70+ Songs About Fire From Different Genres and Decades",
  "steps": [
    {
      "title": "“Girl on Fire” – Alicia Keys",
      "content": "“Girl on Fire” – Alicia Keys Alicia Keys’ hit 2012 ballad “Girl On Fire” is a tribute to women’s achievements. The lyrics describe a girl who is figuratively “on fire,” taking over the world by chasing all her ambitions. Keys performed the empowering R&B track at the 2012 MTV Video Music Awards and released two additional versions, one featuring Nicki Minaj. [1] X Research source"
    },
    {
      "title": "“Ring of Fire” – Johnny Cash",
      "content": "“Ring of Fire” – Johnny Cash You may not have realized that Johnny Cash’s hit “Ring of Fire” is actually a version of an existing song. His future wife June Carter’s sister, Anita Carter, first recorded the song which Carter co-wrote. Cash put his own spin on it, including adding a mariachi-style horn section that allegedly came to him in a dream. The lyrics use fire as a metaphor for love’s burning passion. [2] X Research source"
    },
    {
      "title": "“Fight Fire with Fire” – Metallica",
      "content": "“Fight Fire with Fire” – Metallica “Fight Fire with Fire” is the opening track on Metallica’s sophomore album Ride the Lightning . [3] X Research source The fastest Metallica song, it uses the idiom “fight fire with fire” to grimly portray the consequences of mutually assured destruction—namely, a nuclear apocalypse. [4] X Research source"
    },
    {
      "title": "“Disco Inferno” – The Trammps",
      "content": "“Disco Inferno” – The Trammps Fire symbolism appears in every genre you can think of, including disco. “Disco Inferno,” known for its catchy, repetitive chorus of “Burn, baby, burn,” uses imagery of flames and burning to describe the fiery energy of disco and soul music. It became a success after being featured in the film Saturday Night Fever a year after its initial release. [5] X Research source"
    },
    {
      "title": "“Burn” – Ellie Goulding",
      "content": "“Burn” – Ellie Goulding Ellie Goulding’s electro-pop hit “Burn” talks about the singer and her friends having “the fire” and burning so bright they can be seen from outer space. The upbeat song celebrates feeling passionate about life, dancing, and having fun with friends. [6] X Research source"
    },
    {
      "title": "“Just Like Fire” – P!nk",
      "content": "“Just Like Fire” – P!nk Featured on the soundtrack for Alice Through the Looking Glass , “Just Like Fire” is another empowering track that uses fire as an analogy to express confidence and power. In an interview with PEOPLE, P!nk shared that her daughter Willow Sage inspired the song with her uninhibited spirit. [7] X Research source"
    },
    {
      "title": "“Smoke on the Water” – Deep Purple",
      "content": "“Smoke on the Water” – Deep Purple As the lyrics describe, the band Deep Purple was in Montreux, Switzerland to record their new album at a venue called the Casino. Frank Zappa and the Mothers of Invention were performing there. An audience member fired a flare gun, causing the venue’s heating system to explode. The resulting fire inspired Deep Purple to write “Smoke on the Water.” [8] X Research source The fire injured fans and caused the venue to burn down. Thankfully, there were no fatalities. The water referenced in the title is Switzerland’s Lake Geneva, according to bassist Roger Glover. [9] X Research source"
    },
    {
      "title": "“Light My Fire” – The Doors",
      "content": "“Light My Fire” – The Doors “Light My Fire” was actually inspired by another fire-focused song—The Rolling Stones’ “Play With Fire.” The Doors guitarist Robby Krieger shared with Songwriting Magazine that the catchy lyrics of “Light My Fire” are open to interpretation as either a drug reference or a metaphor for love. [10] X Research source The band performed the song on The Ed Sullivan Show and was subsequently banned for not changing the lyric “Girl, we couldn’t get much higher” at Sullivan’s producers’ request. [11] X Research source"
    },
    {
      "title": "“We Didn’t Start the Fire” – Billy Joel",
      "content": "“We Didn’t Start the Fire” – Billy Joel Billy Joel (and later Fall Out Boy) uses a lengthy list of historical examples to prove his generation didn’t start “the fire”—aka everything that’s wrong with the world. One of the most famous songs with fire in the title, “We Didn’t Start the Fire” features 119 references in total, covering everything from sports and true crime to politics and movies. [12] X Research source"
    },
    {
      "title": "“Fire Burning” — Sean Kingston",
      "content": "“Fire Burning” — Sean Kingston Sean Kingston’s 2009 reggae-pop hit “Fire Burning” uses fire to describe how hot a girl is, literally and metaphorically, as she burns up the dance floor. [13] X Research source Kingston performed the song live at the Teen Choice Awards in 2009. [14] X Research source"
    },
    {
      "title": "“Set Fire to the Rain” – Adele",
      "content": "“Set Fire to the Rain” – Adele Adele’s 2011 pop hit remains one of her biggest successes to date. The power ballad explores the singer’s feelings of pain and struggle after her first breakup. The titular lyrics could be taken to represent the mix of anger and sadness (fire and rain), or burning memories of her ex such as photographs in a storm of emotions. [15] X Research source"
    },
    {
      "title": "“Great Balls of Fire” – Jerry Lee Lewis",
      "content": "“Great Balls of Fire” – Jerry Lee Lewis While the phrase “Great balls of fire” is a Southern U.S. expression used to express surprise, Lewis’ song turns it into a risqué lyric describing feelings of burning lust. [16] X Research source The blustery rock’n’roll track reached number one on the R&B charts. [17] X Research source However, his career faded when he married his teenage cousin. [18] X Research source"
    },
    {
      "title": "“Burning Love” – Elvis Presley",
      "content": "“Burning Love” – Elvis Presley Elvis Presley’s cover of country-soul artist Arthur Alexander’s “Burning Love” holds the distinction of being his final top 10 single during his lifetime. [19] X Research source As the title suggests, the song talks about a love so passionate and intense, it’s burning within him, to the point of setting The King (metaphorically) on fire. [20] X Research source"
    },
    {
      "title": "“Eternal Flame” – The Bangles",
      "content": "“Eternal Flame” – The Bangles “Eternal Flame” is a soft, moving ballad and one of the group’s most enduring hits. Co-written by lead singer Susanna Hoffs and songwriters Billy Steinberg and Tom Kelly, the song’s lyrics question if the singer is dreaming or if the burning feeling of love is an “eternal flame”—meant to burn on forever. [21] X Research source"
    },
    {
      "title": "“Smoke Gets In Your Eyes” – The Platters",
      "content": "“Smoke Gets In Your Eyes” – The Platters The Platters’ version of show tune “Smoke Gets In Your Eyes” became a hit upon its release in 1958. Slow and melodramatic, the song discusses the fire of love and the blindness caused by its smoke. Ultimately, it’s a sad song, as the singer’s love abandons them and they realize their relationship was clouded by passion. [22] X Research source The song is present in many films and referenced in literature, such as J.D. Salinger’s The Catcher in The Rye . It has strong associations with nostalgia, longing, and lost love."
    },
    {
      "title": "“Fire” – Sara Bareilles",
      "content": "“Fire” – Sara Bareilles Hit singer-songwriter turned Broadway composer Sara Bareilles uses fire as a symbol for the connection that was hoped for, but ultimately wasn’t realized in a relationship. A theatrical pop track, “Fire” is surprisingly uplifting in its portrayal of the end of a relationship. [23] X Research source"
    },
    {
      "title": "“Fire on Fire” – Sam Smith",
      "content": "“Fire on Fire” – Sam Smith “Fire on Fire” featured in the BBC adaptation of Watership Down in 2018. The emotional song describes two people who are intensely passionate about one another and face extreme highs and lows because of this—they’re like fire lit on fire. [24] X Research source"
    },
    {
      "title": "“Flames” – Mod Sun feat. Avril Lavigne",
      "content": "“Flames” – Mod Sun feat. Avril Lavigne Ex-fiancés Mod Sun and Avril Lavigne collaborated on pop-rock track “Flames” in 2021. The track uses several fire idioms in its lyrics about a self-destructive relationship the singers aren’t yet over, from “burning for someone” to “going up in flames.” [25] X Research source"
    },
    {
      "title": "“twin flame” – Machine Gun Kelly",
      "content": "“twin flame” – Machine Gun Kelly One of the most recent fire-related love songs is MGK’s “Twin Flame,” a 2022 ode to his then-fiancée Megan Fox. The duo referred to each other as twin flames in several interviews about their relationship, explaining that a twin flame is one soul split into two bodies. [26] X Research source"
    },
    {
      "title": "“I’m On Fire” – Bruce Springsteen",
      "content": "“I’m On Fire” – Bruce Springsteen One of The Boss’s most popular songs, “I’m On Fire” is a rock ballad about burning desire. The lyrics address a woman who’s already in a relationship, describing how the singer is “on fire” because of his feelings for her. The cover art for the single shows Springsteen standing in front of fierce flames, of course. [27] X Research source"
    },
    {
      "title": "“Burn It to the Ground” – Nickelback",
      "content": "“Burn It to the Ground” – Nickelback You may have heard “Burn It to the Ground” without realizing it: it was the theme song for WWE’s Monday Night Raw . The song’s chorus repeats that the singer and their crew will “burn it to the ground tonight.” Burning represents the destruction and chaos that occur during heavy drinking and partying—stereotypical behavior for a group of rockers. [28] X Research source"
    },
    {
      "title": "“Fire” – Jimi Hendrix",
      "content": "“Fire” – Jimi Hendrix Legendary guitarist Jimi Hendrix didn’t just write about fire, he played with it—literally. He set a guitar on fire during a performance of his song of the same name in 1967. The song’s inspiration was allegedly a simple moment of Hendrix wanting to be warmed by a fire on a cold day, though he turned the mundane experience sensual with his lyrics. [29] X Research source"
    },
    {
      "title": "“Burning Down The House” – The Talking Heads",
      "content": "“Burning Down The House” – The Talking Heads David Byrne shared with the Wall Street Journal that the song’s title is about burning down something safe (like a house) that you feel is entrapping you. The rest of the lyrics, he explained, are simply lines that resonated emotionally and were not meant to tell a story. [30] X Research source"
    },
    {
      "title": "“Play With Fire” – The Rolling Stones",
      "content": "“Play With Fire” – The Rolling Stones According to music legend, a janitor provided the backup vocals for The Rolling Stones’ less-popular track “Play With Fire.” The song riffs on the common idiom that you’re “playing with fire” when you engage with a dangerous or unpredictable person. In the lyrics, Mick Jagger warns a high-society girlfriend that she’s playing with fire when she plays with him. [31] X Research source"
    },
    {
      "title": "“Heaven’s on Fire” – Kiss",
      "content": "“Heaven’s on Fire” – Kiss An excerpt from Kiss’s glam-rock era, “Heaven’s on Fire” describes an intimate scene between the singer and his lover, embracing in burning passion for one another. The lyrics mix Biblical allusions with fire imagery, similar to Elvis Presley’s “Burning Love.” [32] X Research source"
    },
    {
      "title": "“The Flame” – Cheap Trick",
      "content": "“The Flame” – Cheap Trick “The Flame” is a chart-topping power ballad from Cheap Trick, one of the first times they worked with outside songwriters on a track. Chronicling the devotion that remains in the wake of a breakup, the song uses the concept of a flame surviving the fire and rain as a metaphor for an ex’s devotion. [33] X Research source"
    },
    {
      "title": "“Burnin’ For You” – Blue Öyster Cult",
      "content": "“Burnin’ For You” – Blue Öyster Cult Blue Öyster Cult’s 1981 hit “Burnin’ For You” is yet another song that uses burning as a metaphor for being consumed with desire. The group employs the phrase “burn out” to describe wasting time and losing hope. The song stands out as one of the more sentimental in the band’s oeuvre. [34] X Research source"
    },
    {
      "title": "“Burn Down the Mission” – Elton John",
      "content": "“Burn Down the Mission” – Elton John “Burn Down the Mission” tells a story of a man burning down a rich man’s home to keep his family alive. The fire in the song is presented as literal, not metaphorical. It’s been interpreted as a socialist anthem because of its anti-wealth lyrics. [35] X Research source"
    },
    {
      "title": "“Paper in Fire” – John Mellencamp",
      "content": "“Paper in Fire” – John Mellencamp “Paper in Fire” uses the titular lyrics as a simile for the way the men in Mellencamp’s family burned up the people around them and their own lives with their tempers. Rage is equated to heat. Paper in fire is also a literal reference to cigarettes, as Mellencamp’s Uncle Joe loved tobacco—contributing to his death from pancreatic cancer in 1987. [36] X Research source Days are another thing that burn up in the song’s lyrics as the song’s main character wastes his life away being vain and avoiding commitment."
    },
    {
      "title": "“Feel That Fire” – Dierks Bentley",
      "content": "“Feel That Fire” – Dierks Bentley “Feel That Fire” is a country love song about sparking real desire in one’s partner so they know your love is true. Bentley told The Boot it’s a fun song about four guys who have misunderstandings about women. [37] X Research source In between the verses about “that fire,” the lyrics list out different things a woman wants."
    },
    {
      "title": "“Kerosene” – Miranda Lambert",
      "content": "“Kerosene” – Miranda Lambert Miranda Lambert found her first platinum single with “Kerosene,” also the title of her debut album. In classic country style, it’s a revenge song about becoming self-destructive and ready to burn down everything related to a cheating ex. [38] X Research source"
    },
    {
      "title": "“Picture to Burn” – Taylor Swift",
      "content": "“Picture to Burn” – Taylor Swift Taylor Swift’s self-titled debut album focuses on the highs and lows of teenage love, and “Picture to Burn” is no exception. The track gives a verbal lashing to Swift’s high school flame Jordan, telling him he’s “Just another picture to burn.” [39] X Research source Pre-Internet, burning old pictures of an ex was the equivalent of deleting them from your camera roll, albeit more dramatic. In the song, it’s a synecdoche, reducing the ex to the picture of him that she’ll destroy."
    },
    {
      "title": "“The Fireman” – George Strait",
      "content": "“The Fireman” – George Strait A cheeky tune about a lover with a reputation for “putting out old flames,” George Strait’s “The Fireman” plays on the associations between fire and passion by introducing the character of the fireman. When women get hot with anger at the fireman’s cheating, he finds a way to cool them down. [40] X Research source"
    },
    {
      "title": "“I’m on Fire” – Rascal Flatts",
      "content": "“I’m on Fire” – Rascal Flatts Rascal Flatts continues the tradition of describing passion as being on fire. The metaphor featured in the group’s 2014 track “I’m on Fire.” Burning is also used in the lyrics to describe attractiveness—the girl the singer desires is “hot to the touch” and “burnin’ up” from his perspective."
    },
    {
      "title": "“Does My Ring Burn Your Finger” – Lee Ann Womack",
      "content": "“Does My Ring Burn Your Finger” – Lee Ann Womack Lee Ann Womack’s cover of “Does My Ring Burn Your Finger” helped propel her to fame in 2000. The original track from Buddy Miller’s 1999 album Cruel Moon describes a partner suspecting their spouse feels trapped by their marriage, hence why they ask if their wedding ring “burns” their partner’s finger. It’s a pleasant subversion of the traditional association between fire and love. [41] X Research source"
    },
    {
      "title": "“Baby I’m Burnin’” – Dolly Parton",
      "content": "“Baby I’m Burnin’” – Dolly Parton Country queen Dolly Parton released a romantic song equating fire and desire with 1978’s disco-tinged “Baby I’m Burnin’.” All the usual metaphors for being on fire with desire are present, with the lyrics even suggesting the emotion causes fireworks to go off. [42] X Research source While not one of her most well-known songs, Parton used it as the theme song on her ‘80s variety show Dolly ."
    },
    {
      "title": "“Old Flame” – Alabama",
      "content": "“Old Flame” – Alabama Perhaps you heard “Old Flame” in an episode of The Americans . The song centers on the classic idiom for a former partner or lover, aka an “old flame,” and the struggle the singer faces when they realize their partner is caught on an old flame. [43] X Research source In the chorus, the lyrics explain how the old flame isn’t brighter or stronger than the current flame, but it has been burning longer—making the singer feel inadequate. [44] X Research source"
    },
    {
      "title": "“Burning House” – Cam",
      "content": "“Burning House” – Cam “Burning House” turns the fire metaphor external while staying on the popular subject of love. Country singer Cam co-wrote the song after having a dream in which she rescued her ex-boyfriend from a burning house. [45] X Research source The burning house in the lyrics could be taken to represent the vision from her dreams or a toxic relationship that takes two people down in flames."
    },
    {
      "title": "“Standing Outside the Fire” – Garth Brooks",
      "content": "“Standing Outside the Fire” – Garth Brooks Introspective track “Standing Outside the Fire” explores the risks and rewards that come with going after what you want—or, “[dancing] within the flame,” as the song puts it. Those who play it safe and stand outside the fire suffer the misery of a life that’s only survived and not lived, according to Brooks’ lyrics. [46] X Research source"
    },
    {
      "title": "Hip-hop",
      "content": "Hip-hop Fire is featured in various hip-hop and rap songs, turning up the heat in scorching verses. As in other genres, the alluring flames serve as a symbol of fury or passion. It’s up to you to determine if the songs themselves are fire, though. “Burn” – Juice WRLD “Fireball” – Willow Smith Feat. Nicki Minaj “Fire” – Busta Rhymes “On Fire” – Lil Wayne “Fire” – Big Sean “On Fire” – Lloyd Banks “Fire” – Snoop Dogg feat. Cocoa Sarai “Keep It Burnin’” – Future feat. Ye"
    },
    {
      "title": "Pop",
      "content": "Pop Pop songs most often use fire and burning in lyrics about having fun and feeling the love. The lyrics might describe the singer being “on fire,” feeling the heat of desire, or “setting the roof on fire.” Listen to these tracks when you feel the fire inside. “Burned” – Grace VanderWaal “Pyromania” – Cascada “Fireball” – Pitbull ft. John Ryan “Fire with Fire” – Scissor Sisters “Burnin’ Up” – The Jonas Brothers “Fire Bomb” – Rihanna “We Are Young” – Fun feat. Janelle Monáe"
    },
    {
      "title": "R&B",
      "content": "R&B The smooth sound of R&B goes perfectly with the crackling, warm imagery of fire. Fittingly, the symbol appears in several tracks across the genre talking about love and endurance. Whether they’re singing about making it through the fire or keeping the fire alive, these R&B artists use the motif to its fullest. “Fire and Desire” – Rick James & Teena Marie “Burn” – Usher “Burning” – Tems “Keep the Fire Burning” – Gwen McCrae “Fire” – Ohio Players “Fire” – Black Pumas “Through the Fire” – Chaka Khan"
    },
    {
      "title": "K-pop",
      "content": "K-pop There are a surprising amount of K-pop songs with fire in the title from mega-groups like BTS and disbanded groups like 2NE1. Make your K-pop playlist red-hot with the addition of these tracks that set sparks flying. [47] X Research source “Fire” – BTS “Playing with Fire” – Blackpink “Fire” – Seventeen “FIRE” – 2NE1 “Fire in the belly” – Le Sserafim “Fire” – SF9 “Fire” – Ailee"
    },
    {
      "title": "Other Genres",
      "content": "Other Genres There are more songs about fire than can be contained in one list. If you want an expansive fire-themed soundtrack, add a few of these eclectic tracks from the likes of Bob Dylan, Stevie Nicks, Hozier, and Van Halen. There’s a blazing song to suit every taste in music. “House of Fire” – Alice Cooper “Something’s Burning” – Kenny Rogers “Rooms on Fire” – Stevie Nicks “Cold Blue Steel and Sweet Fire” – Joni Mitchell “Angel on Fire” – Halsey “Sleep Now in the Fire” – Rage Against the Machine “This Wheel’s on Fire” – Bob Dylan “Jump Into The Fire” – Harry Nilsson “Set the World on Fire” – David Bowie “I See Fire” – Ed Sheeran “Arsonist’s Lullaby” – Hozier “On Fire” – Van Halen “Shot Down In Flames” – AC/DC “London’s Burning” – The Clash “Fire And Ice” – Pat Benatar “World on Fire” – Nate Smith"
    },
    {
      "title": "Songs for Kids",
      "content": "Songs for Kids While not the most common topic for children’s songs, fire appears in a few tracks about fire safety and fire trucks. Play them in the classroom or at home as you teach little ones to stay away from flames, how to stop, drop, and roll, and what being a firefighter is like. “Firefighter” – StoryBots “Fire Truck Song” – Blippi Songs “Stop, Drop, and Roll” – NFPA Kids “Fire Drill Song” – Cocomelon “Here Comes The Fire Truck” – Super Simple Songs “Hurry, Hurry, Drive the Fire Truck” – Paw Patrol"
    },
    {
      "title": "Consider the tone and topic of your song.",
      "content": "Consider the tone and topic of your song. If your song is an upbeat ballad about being in love, you might use fire to represent the all-consuming passion you feel for a partner. However, if it’s a rock or metal song with social commentary or anarchistic messaging, fire might make more sense as a symbol of anger and fearsome power."
    },
    {
      "title": "Review common idioms about fire and burning.",
      "content": "Review common idioms about fire and burning. Listen to songs with lyrics about fire and burning to see what common phrases they use and how they use them. Some examples are “I’m burning up,” when describing feeling an intense emotion, “Going down in flames,” to describe destruction, and “old flame” when describing a former love. Use them as inspiration when writing your own song . Popular songs may also use candles or eternal flames to represent love as withstanding storms and lasting eternally."
    },
    {
      "title": "Try to subvert cliches by finding new ways to use fire as a symbol.",
      "content": "Try to subvert cliches by finding new ways to use fire as a symbol. Think outside the box when crafting lyrics that use fire as a metaphor, in a simile, or as a symbol. Ask yourself what you personally associate with heat, fire, and burning, and how you might twist your associations into something novel in your song. For example, the feeling of burning is often equated with passion, but what about writing a song about the flames of jealousy and how they can consume you as quickly as desire can?"
    }
  ]
}