{
  "url": "https://www.wikihow.com/Stop-Liking-Your-Crush",
  "title": "How to Stop Liking Your Crush",
  "steps": [
    {
      "title": "Distance yourself from them.",
      "content": "Distance yourself from them. One of the most effective ways to help you get over your crush is by distancing yourself from them. Minimize any contact or the potential for contact so that you can get over them without having any lingering ties that could upset you or reinforce your feelings for them. Distancing yourself will be hard at first, but it’s ultimately for the better and will make the process of getting over them easier and faster."
    },
    {
      "title": "Remove their contact information and text messages from your phone.",
      "content": "Remove their contact information and text messages from your phone. One way to assure that you won’t have any contact with your crush is to delete their contact information from your phone. Also consider erasing any text messages from them that you may have. Deleting this information will not only keep you from contacting them in a moment of weakness, but won’t be an ever-present reminder of them, either. [1] X Research source [2] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. If you’re reluctant to delete their information entirely, consider writing it on a piece of paper that you won’t see every day and store it in a safe place. Email copies of their text messages and then archive them if you aren’t ready to completely delete them. Remember that even if you delete your contact, they may not delete you. If they contact you, you can either not respond or choose to send a brief, polite response. [3] X Research source"
    },
    {
      "title": "Remove them from social media sites.",
      "content": "Remove them from social media sites. The large number of social media sites, such as Facebook and Instagram, means increased accessibility to people, even those with whom you don’t necessarily want to be in contact. By removing your crush’s presence from your social media accounts, you can further limit the amount of contact you have with them. [4] X Research source [5] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. If you’re concerned that you might hurt your crush or leave others questioning your motives by unfollowing or defriending them on social media sites, find a way to minimize what you see on these apps. For example, on Facebook you can simply unsubscribe from their posts, which will make sure that you don’t get status updates."
    },
    {
      "title": "Stop talking about them and don’t allow yourself to think about them.",
      "content": "Stop talking about them and don’t allow yourself to think about them. It’s natural when you have a crush on someone to talk about them and to think about them a lot, but this will only reinforce your feelings. Consciously not mentioning them in conversations and actively shifting your thoughts when you do think about them will help you get over them more quickly. It may be difficult to not mention them in conversations, especially if you have mutual friends, so try to not talk about them or ask how they are too often. You can also step away from conversations about them. If you need to talk about them to process your thoughts and feelings, do so but don’t make it a regular habit."
    },
    {
      "title": "Ask your friends not to bring them up.",
      "content": "Ask your friends not to bring them up. If your friends know that you have feelings for your crush, they may occasionally mention them. This will only remind you of them and may hinder your ability to get over them, so ask your friends to not bring them up or update you if possible. There will likely be situations, especially in groups with mutual friends, where your crush’s name is brought up. In order to get over them more quickly, step away from these groups until they’ve moved on to a new topic of conversation."
    },
    {
      "title": "Avoid places they and their friends go.",
      "content": "Avoid places they and their friends go. You and your crush may have many things in common, including friends, classes or workplaces, or favorite places. Avoid situations where you run the risk of seeing them. If you take classes together or work in the same place, don’t sit near them. If they sit next to you, you can also find a way to relocate or decide to keep it cordial. Also do not engage in eye contact with them.Then it could make things awkward or spark an unwanted conversation. If you like the same restaurants, for example, try out new places to eat."
    },
    {
      "title": "Get rid of tangible traces of them.",
      "content": "Get rid of tangible traces of them. Getting rid of any reminders of them that you may have will help you get over your crush. You’ll want to remove traces of them from everything from your phone and social media to photographs and other mementos in your home. You can either take a gradual or cold-turkey approach to removing them from your life. It might be emotionally easier for you to remove reminders of them bit by bit, or you can also get rid of traces of them all at once. Doing this at all once will be very difficult, but can speed up the process of getting over your crush. Delete emails or get rid of letters, cards, or presents from your crush. Holding on to these things make you hold on to your feelings for them. Delete any photos of them or the two of you together. If you aren't ready to throw out your mementos just yet, put them in a box and give them to a friend for the time being. [6] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019."
    },
    {
      "title": "Allow yourself to grieve and don’t get mad.",
      "content": "Allow yourself to grieve and don’t get mad. Getting over your crush is a painful process and it’s completely acceptable to grieve over the relationship you had. [7] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. But it’s also important to not get mad at your crush in the process- just as you can’t control your feelings for them, they can’t control their feelings for you. Recognize that your crush was something significant in your life. Even if you didn’t have a romantic relationship, you still had some relationship to them. It’s ok to be sad over the loss of this. Don’t be angry with your crush. They might not even know that you had feelings for them or they might be in a situation where they can’t reciprocate your feelings. Don’t get angry with them over something which they don't have much control. There are many reasons why you may have to get over your crush. Perhaps they found a boyfriend/girlfriend or perhaps they were always in a relationship or married. Maybe your parents oppose them, or and maybe it's something as simple as they're too old for you. Maybe you are wise enough to realize that you wouldn't be compatible in a relationship, even though you have romantic feelings for them. These are all factors over which you have very little control, and about which you cannot be mad at them. If you’re having an especially hard time with the process, you can always get counseling to help you with your feelings."
    },
    {
      "title": "Know you’ll find someone else.",
      "content": "Know you’ll find someone else. There are many fish in the sea and your crush may not be the right person for you in the end. You will find someone else who is great for you, and the quicker you get over your crush, the more open your heart will be to finding this person. Focusing on your crush’s flaws can help you get over them and possibly even find someone better suited for you. [8] X Research source Reader Poll: We asked 900 wikiHow readers what’s the longest a crush has lasted for them, and 60% of them said over a year. [Take Poll] It can be hard to move on if you’ve liked someone for a long time, but when you meet the right person, you’ll forget why you liked your crush in the first place!"
    },
    {
      "title": "Lean on your support system.",
      "content": "Lean on your support system. You’re likely not feeling your best as you try to get over this significant person in your life, so this is a good time to lean on- or even reconnect with- your family and friends. From talking about your feelings to distracting you with fun activities, your support system can help you to get over your crush more quickly. Friends and family will keep you from wallowing in your sadness. They can provide an excellent distraction by doing fun activities with you that don’t involve your crush."
    },
    {
      "title": "Focus on yourself and your other interests.",
      "content": "Focus on yourself and your other interests. Concentrate on yourself while you try to get over your crush. This may make realize that you don’t have feelings for them. For example, start exercising or try a new fitness activity like yoga, which will also help you focus your mind on something other than your crush. You might also want to take a class that will help you with your job. Whatever you do, always make sure that it makes you feel good about yourself."
    },
    {
      "title": "Try new activities.",
      "content": "Try new activities. This is also a good time to try out new activities, which will distract you from your feelings. The more often you can do something that distances you from your crush, the easier it will be to get over them. For example, maybe you’ve always wanted to learn how to rock climb. This new activity will require a lot of practice, leaving less time to think about your crush."
    },
    {
      "title": "Meet new people.",
      "content": "Meet new people. Getting out and meeting new people who don’t have any relationship to your contact is a good distraction from your feelings and your crush. You may find you have a much better time with new friends and acquaintances than you ever did with them. There are many different ways to meet new people, including joining a running group or going to happy hours at new places. Group activities are an excellent way to meet new people and distract yourself from your crush."
    },
    {
      "title": "Consider flirting or dating someone else.",
      "content": "Consider flirting or dating someone else. You might not be ready to fully commit to another person, but casually flirting with or dating another person can also help you to more quickly get over your crush. This will boost your self-confidence and distract you from your feelings for your crush. A little harmless flirting may be good to help you gain self-confidence and remember that there are other people with whom you might have a connection. Just remember to keep it light and fun."
    }
  ]
}