{
  "url": "https://www.wikihow.com/Talk-Minnesotan",
  "title": "How to Talk in a Minnesota Accent",
  "steps": [
    {
      "title": "Tense up the corners of your lips and keep your jaw stiff.",
      "content": "Tense up the corners of your lips and keep your jaw stiff. Tighten the corners of your mouth and limit how much you move your jaw when speaking. Try to maintain a slight smile while you’re speaking—it will enhance your vowel pronunciation and make your voice sound friendlier . [1] X Research source Changing the shape of your mouth will help you naturally speak with a Minnesotan accent so it doesn’t feel too forced."
    },
    {
      "title": "Draw out long “O” and “A” sounds.",
      "content": "Draw out long “O” and “A” sounds. Keep your tongue near the bottom front of your mouth while you’re speaking so your vowels sound more drawn out and emphasized. When you say a word with a long “A” or “O,” hold the sounds for longer than you normally would to make them sound Minnesotan. [2] X Research source Try saying the words “snow” and “road” like “snooa” and “roooawd” to emphasize the “O” noise. Practice the long “A” sound in words like “wait” and “save.” Try saying the word “bag” with a long “A” sound so it’s pronounced “bayg.”"
    },
    {
      "title": "Emphasize the “ah” sound in a nasal voice.",
      "content": "Emphasize the “ah” sound in a nasal voice. Position the tip of your tongue against your bottom teeth so your voice sounds slightly nasally. When you say a word that has an “ah” sound, draw it out a little longer than you normally would to add emphasis to it. [3] X Research source Practice the “ah” sound so the word “father” becomes “faahther.”"
    },
    {
      "title": "Enunciate the “R” sound in words.",
      "content": "Enunciate the “R” sound in words. Keep the tip of your tongue directly behind your teeth so your voice takes on a nasal quality. Stress the “er” or “ar” sound when you say words like “are,” “work,” or “further.” [4] X Research source Be sure to pronounce the “R” clearly if it’s at the end of a word, like “mother” or “meter,” rather than dropping it."
    },
    {
      "title": "Vary the inflection of your voice when you speak.",
      "content": "Vary the inflection of your voice when you speak. Try varying the pitch and tone throughout your sentence so it goes up and down. Minnesotans often end their sentences on an upward inflection, so the sentence sounds inquisitive, but it may vary per region. [5] X Research source Practice changing the inflection of your sentences so they sound sing-songy. Listen to how native Minnesotans speak so you can hear examples of how their voices fluctuate. Try streaming Minnesota Public Radio programs online to get a sense of native Minnesotan speech patterns."
    },
    {
      "title": "Use “yah” or “you-betcha” when you agree with something.",
      "content": "Use “yah” or “you-betcha” when you agree with something. Emphasize the “ah” sounds in each phrase to intensify your Minnesotan accent. Rather than saying “yes” or “I agree,” replace it with “yah” or “you-betcha” instead. [6] X Research source If you want to stress the accent more, add “oh” in front of either phrase to sound more like you’re from Minnesota."
    },
    {
      "title": "Say “ope” when you accidentally bump into something.",
      "content": "Say “ope” when you accidentally bump into something. In the Midwest, many people use the phrase “ope” as a replacement for or in addition to “excuse me.” [7] X Research source If you need to get by something or accidentally touch someone, you can say, “Ope, excuse me,” when you pass around them. Combine “ope” with phrases like, “I’m gonna sneak past you real quick” or “Can I squeeze by” to sound more Minnesotan."
    },
    {
      "title": "Refer to a group of people as “you guys.",
      "content": "Refer to a group of people as “you guys. ” While people from other regions say “you all” or \"y'all,\" Minnesotans tend to say \"you guys.\" Whenever you need to address an entire group of people to get their attention, say something like, “Hey, you guys over there.” [8] X Research source Minnesotans tend to use the term “guys” regardless of the gender identity of the people they're speaking to."
    },
    {
      "title": "Exclaim “for cute” when you want to say “how wonderful!",
      "content": "Exclaim “for cute” when you want to say “how wonderful! ” If someone tells you something that you enjoy, you may say something like, “Oh, for cute!” to say that you like it. Pronounce the word “for” like the word “fur” to make it sound more Minnesotan. Usually, “for cute” is used as a response to someone else’s statement rather than being used on its own. [9] X Research source"
    },
    {
      "title": "Ask for a “pop” when you want a soda.",
      "content": "Ask for a “pop” when you want a soda. Even though many people will call it a soda, people in the Midwest tend to call the drink a “pop” or “soda pop.” Order pop when you’re at a restaurant or when someone offers you a drink to sound like you’re from Minnesota. [10] X Research source If you want specific flavors, you can say things like “orange pop” or “grape pop.” \"Pop\" is a general term, so if you want a specific brand of soda, you can still call it by name."
    },
    {
      "title": "Call something “different” when you don’t like it.",
      "content": "Call something “different” when you don’t like it. Minnesotan phrases tend to be slightly passive-aggressive, which is called “Minnesota Nice.” Rather than actually saying you don’t like something, use more subtle language like “different” or “interesting” so it doesn’t sound harsh. [11] X Research source Minnesotans may combine syllables in words. If you say “different,” for example, drop the letter E in the middle and pronounce it like “diffrent.”"
    },
    {
      "title": "Say “uff da” when you’re surprised at something.",
      "content": "Say “uff da” when you’re surprised at something. Pronounce the phrase like “oof-dah” whenever someone says something shocking or surprising. Whenever you would say something like, “That’s not good” or “Oh no,” use the term “uff da” instead. Hold out the vowel sounds when you say the phrase so your accent sounds more authentic. [12] X Research source For example, if someone says, “I lost my wallet,” you may reply, “Uff da, that’s rough.” \"Uff da\" is a Norwegian phrase that was popularized by settlers who immigrated to Minnesota from Scandinavia."
    },
    {
      "title": "Exclaim “holy buckets!” when something astonishes you.",
      "content": "Exclaim “holy buckets!” when something astonishes you. Minnesotans use this iconic phrase to convey that they can’t believe something or something has shocked them. Use “holy buckets” as an exclamation in place of “oh my goodness,” “I can’t believe that,” or “holy cow.” [13] X Research source"
    },
    {
      "title": "Use “budge” as a term for when someone cuts you in line.",
      "content": "Use “budge” as a term for when someone cuts you in line. If you’re standing in a long line or queue and someone cuts in front of you, some native Minnesotans call it a budge. To talk Minnesotan, say something like “Someone budged in front of me” or “Hey, that guy just budged me!” [14] X Research source"
    },
    {
      "title": "Chant “skol” at Minnesotan sports games.",
      "content": "Chant “skol” at Minnesotan sports games. Fans of the Minnesota Vikings NFL football team use “skol” as a cheer or chant at their games. Otherwise written as “skall” or “skål,” this phrase originates from Scandinavia, where it was thought to be used as a Viking battle cry. [15] X Research source"
    }
  ]
}