{
  "url": "https://www.wikihow.com/Survive-a-Volcanic-Eruption",
  "title": "Volcanic Eruption Survival Guide: Being Prepared, Surviving the Blast & More",
  "steps": [
    {
      "title": "Know your community's warning system.",
      "content": "Know your community's warning system. If you live near a volcano, your community likely has a plan in place to warn people that the volcano may erupt. In many cases, sirens and emergency alerts on televisions are used to alert people that danger is imminent. Local radio stations will also broadcast important advisories. Since each region is a little different, it's important to know the specific warning procedures in your area. As soon as you hear a siren, turn on the radio to find out what the local emergency management agency advises. You may be told to stay indoors, keep away from certain areas, or, in extreme cases, evacuate. If you don't live in the area, and you're just traveling through, you should still be familiar with the region's warning system so you'll know what it means when you hear it."
    },
    {
      "title": "Get familiar with the evacuation procedures.",
      "content": "Get familiar with the evacuation procedures. If you live near a well-researched and well-monitored volcano, you can probably obtain a hazard-zone map from your local emergency management agency or, in the U.S., from the U.S. Geological Survey. These maps show the probable paths of lava flows and lahar (or mudflows) and give estimates for the minimum time it would take a flow to reach a given location. They also divide the area around the volcano into zones, from high-risk to low-risk. Using this information you can get some idea of how safe your house or workplace is, and you can plan the best route of escape. Because volcanic eruptions are complex and, to some extent, unpredictable, you should have several alternative routes to reach one or more “safe zones.”"
    },
    {
      "title": "Develop a household evacuation plan.",
      "content": "Develop a household evacuation plan. Figure out what you'll need to do if you hear the sirens go off. Map out exactly where your family will go, and figure out the safest way to get there. Keep in mind that if the sky is filled with ash, you won't be able to travel far by car, since ash interferes with mechanisms in car engines and prevents them from operating correctly. Talk with each of your family members about the evacuation plan. Make sure everyone knows exactly what to do and where to meet. Don't forget to include your pets in your evacuation plan. It's a good idea to have a checklist you can run down so you make sure you don't forget anyone or anything in the heat of the moment. Include a list of the people and animals that should be present, the possessions you'll take with you, and fast actions you might take to seal up your house to prevent as much damage as possible."
    },
    {
      "title": "Stock up on necessities.",
      "content": "Stock up on necessities. Store at least a two-weeks supply of food and portable water at your home. In the event of an eruption, water supplies may become contaminated, so you can't count on your well or public water. Keep all your supplies in one place—a large bag that you can carry, for example—so that you can quickly bring them with you if you need to evacuate. In addition to food and water, stock up on the following: A first aid kit Blankets and warm clothing A battery-powered radio and fresh batteries so that you will be able to listen to advisories if the power goes out Necessary medications A map of the region"
    },
    {
      "title": "Be prepared when you're traveling near a volcano.",
      "content": "Be prepared when you're traveling near a volcano. If you will be visiting a volcano, knowledge is your most important protection. Before going to the volcano, consult with local authorities, and heed their recommendations or warnings. Learn about the hazards you may encounter in the area of the volcano, and get a reputable guide to accompany you, if possible. If you're going to be climbing or hiking near the volcano, you should bring a few survival items that will help you survive if you're caught outside without access to shelter. You'll need a respirator and goggles to protect your face and help you breathe. Bring long pants and long-sleeved shirts. Bring plenty of water in case you become unexpectedly trapped by a lava flow, and don't overexert yourself. You'll be able to react more quickly—and run for your life, if necessary—if you're not fatigued."
    },
    {
      "title": "Listen for radio or TV advisories if you hear the sirens go off.",
      "content": "Listen for radio or TV advisories if you hear the sirens go off. When a volcano erupts, immediately tune in to determine if you are in immediate danger where you are and also to find out what is happening around you. These advisories will be your “eyes” to see the larger picture and help you assess the situation and make the right decisions. The sirens will most likely be your first warning that an eruption is occurring, but you might receive other indications that something is amiss. If you see a plume of debris rising from the volcano, or if you feel an earthquake, tune in immediately. Make sure your battery-operated radio is in working order in case the power goes out. It's an important way to stay connected and learn about updates that can affect your safety."
    },
    {
      "title": "Do not ignore emergency instructions.",
      "content": "Do not ignore emergency instructions. In most cases, you'll be told to stay inside, but you may be ordered to evacuate. It's extremely important to follow the advisories, whatever they may be, in order to ensure your family's safety. Most importantly, if you're told to evacuate, do it right away. Conversely, if you are not instructed to evacuate the area, stay where you are unless you can see immediate danger. Taking to the roads may be more hazardous than staying at home. In recent eruptions, many people have been killed because they did not heed an evacuation order. If you are lucky enough to get advance warning, use it wisely instead of trying to hold your ground. It's also important to evacuate the area as soon as possible after being told to do so. If you wait too long, you'll have to deal with ash fall, which will muck up your car's engine and make it more difficult to leave."
    },
    {
      "title": "Get inside if you're caught outdoors.",
      "content": "Get inside if you're caught outdoors. Unless you need to evacuate, the safest place you can be is inside a strong structure. Close all the windows and doors to protect yourself from ash and burning cinders. Make sure all of your family members are inside, and that your emergency supply of food and water is indoors with you. If you own livestock, bring them inside their shelter and close the doors and windows. If you have time, protect machinery by putting it inside a garage."
    },
    {
      "title": "Get to high ground if you can't find shelter.",
      "content": "Get to high ground if you can't find shelter. Lava flows, lahars, mudflows, and flooding are common in a major eruption. All of these can be deadly, and all of them tend to travel in valleys and low-lying areas. Climb to higher ground, and stay there until you can confirm that the danger has passed."
    },
    {
      "title": "Protect yourself from pyroclastics.",
      "content": "Protect yourself from pyroclastics. While you want to get to higher ground, you should also try to shield yourself from pyroclastics, which are rocks and debris (sometimes red-hot) that are sent flying during an eruption. The most important thing to do is watch out for them and get out of their range. Sometimes they actually rain down, and in some types of eruptions, such as that which occurred at Mount St. Helens in 1980, they can land miles from the volcano's crater. Protect yourself by staying below the ridgelines of hills and on the side of the hill opposite the volcano. If you are caught in a hail of smaller pyroclastics, crouch down on the ground, facing away from the volcano, and protect your head with your arms, a backpack, or anything else you can find."
    },
    {
      "title": "Avoid exposure to poisonous gases.",
      "content": "Avoid exposure to poisonous gases. Volcanoes emit a number of gases, and if you are close to one when it erupts, these gases could be deadly. Breathe through a respirator, mask, or moist piece of cloth—this will also protect your lungs from clouds of ash—and try to get away from the volcano as quickly as possible. Do not stay low to the ground, as some of the most dangerous gases are heavier than air and accumulate near the ground. Protect your eyes as well. Wear goggles if your mask doesn't cover your eyes. Keep your skin covered with long pants and a long-sleeved shirt."
    },
    {
      "title": "Don't try to cross geothermal areas.",
      "content": "Don't try to cross geothermal areas. Hot spots, geysers, and mudpots are common on volcanoes. The ground around these is typically very thin, and a fall through could result in serious burns or death. Never try to cross these during an eruption, and otherwise cross them only on safe, marked paths. Mudflows and flooding following an eruption generally kill far more people than pyroclastics or lava. You can be in danger even many miles from the volcano. Never try to cross a lava flow or lahar. Even flows that appear to be cooled may simply have formed a thin crust over a core of extremely hot lava. If you do cross a lava flow, you run the risk of being trapped between flows if another suddenly develops."
    },
    {
      "title": "Remain indoors until you're told it's safe to come out.",
      "content": "Remain indoors until you're told it's safe to come out. Keep the radio on and stay inside until you learn the danger has passed and you're free to go outside. Even after the eruption is over, you might be advised to stay inside until the ash stops falling. If you do go outside before it's deemed safe, make sure your body is covered from head to toe and that you breathe through a respirator or moistened cloth. Drink only bottled water until the tap water is said to be clean. If you see ash in any water source, avoid drinking it. [1] X Research source If the ash falls for many hours, officials might advise evacuating, even after the eruption is over. That's because ash is so heavy that it can cause roofs to collapse, creating dangerous situations for people staying indoors."
    },
    {
      "title": "Stay away from areas with heavy ash fall.",
      "content": "Stay away from areas with heavy ash fall. Volcanic ash is comprised of tiny glass-like particles that are harmful to the lungs. Don't walk or drive in areas close to the volcano where a lot of ash has collected. Turn on the radio to find out which areas were most severely affected. Keeping away from ash especially important for people with respiratory conditions like asthma or bronchitis. Don't drive through areas with heavy ash fall, either. The ash will clog up your engine and ruin it. [2] X Research source"
    },
    {
      "title": "Clear ash from your home and property.",
      "content": "Clear ash from your home and property. When you're sure it's safe to go out, you'll need to clear the ash from your rooftop and other areas. Ash is very heavy and can cause roofs to collapse, especially when it's wet. If wind stirs it up, it will be harmful to those who breathe it in. Wear long pants and a long-sleeved shirt and cover your mouth with a mask to avoid breathing in the ash. You might also want to wear goggles. Shovel the ash into trash bags, then seal them and dispose of them according to your community's recommendations. Don't turn your air conditioner on or open your vents back up until most of the ash has been cleared away."
    },
    {
      "title": "Get medical care if necessary.",
      "content": "Get medical care if necessary. Receive medical treatment promptly for burns, injuries, and gas or ash inhalation. Once you are safe, waste no time getting treatment or an examination. Keep in mind, however, that you may need to wait a while if there are people with more serious injuries."
    }
  ]
}