{
  "url": "https://www.wikihow.com/Survive-a-Cheetah-Attack",
  "title": "How to Survive a Cheetah Attack",
  "steps": [
    {
      "title": "Bring a dog.",
      "content": "Bring a dog. [1] X Research source Dogs make effective early warning systems. Cheetahs can be extremely stealthy, and you may not notice one approach until it is too late. Dogs, however, with their keener sense of smell, can detect cheetahs before they attack. Going out on safari with a dog is a good idea. Your barking canine friend will act like an early-warning system, letting you know that danger is near while simultaneously scaring the cheetah away. Anatolian Shepherd and Kangal dogs are the preferred breeds to deter cheetah attacks. [2] X Research source"
    },
    {
      "title": "Pack a first-aid kit.",
      "content": "Pack a first-aid kit. Don’t leave on your safari adventure without bringing a first-aid kit. If you are attacked by a cheetah, you’ll be glad you took the time to pack it. If you’re going out with a safari tour guide, he or she should have a well-stocked kit which includes: bandages of varying sizes disinfectant medical gloves antibiotic ointment sterile gauze pads hand sanitizer a first aid manual an eye shield a thermometer tweezers finger splints scissors"
    },
    {
      "title": "Stay enclosed in your car.",
      "content": "Stay enclosed in your car. Many big cat attacks occur when tourists roll their windows down or open their doors. [3] X Research source [4] X Research source Staying safely in your vehicle ensures no cheetah will attack you. A young cheetah might test your vehicle, jumping on it or gnawing its fenders. Let the cheetah do so undisturbed. It will eventually grow bored and leave."
    },
    {
      "title": "Listen to your guide.",
      "content": "Listen to your guide. Always follow your guide’s directions. They are experts with many years of experience dealing with African wildlife, and their first priority is your safety. If you are on a walking tour, stay close to your guide or a member of your group. Cheetahs tend to attack individuals who are isolated from the rest of their group. [5] X Research source Never wander off the trail or follow a cheetah if you see one nearby."
    },
    {
      "title": "Scare the cheetah.",
      "content": "Scare the cheetah. Cheetahs are known to avoid areas frequented by hyenas and lions. Bringing along a recorded hyena or lion call will dissuade any nearby cheetah from engaging you or your party. [6] X Research source Durant, S. M. (2000). Living with the enemy: Avoidance of hyenas and lions by cheetahs in the serengeti. Behavioral Ecology, 11(6), 624. This behavioral pattern is known as predator avoidance and is effective no matter the cheetah’s sex or age. Lions are perceived as a bigger threat to cheetahs than hyenas. The lion’s roar should be the preferred audio recording you utilize to dissuade cheetah attacks."
    },
    {
      "title": "Do not follow the cheetah.",
      "content": "Do not follow the cheetah. [7] X Research source Tourists are interested in cheetah behavior and may be tempted to follow them. However, if the cheetah believes you are a predator in pursuit, it will turn to stand its ground and attack. This could result in serious injury to you. Keep your distance when you spot a cheetah and let it leave without pursuing it. That great photo you think you can capture won’t be worth anything if you aren’t around to share it."
    },
    {
      "title": "Back away slowly.",
      "content": "Back away slowly. If the Cheetah spots you, maintain eye contact. Whilst maintaining eye contact, back away slowly. Do not run. [8] X Research source If you run, the cheetah will instinctively chase you. And cheetahs are fast – the fastest land animals on earth, clocking in at up to 60 miles per hour. [9] X Research source Unless you’re a gazelle, running away won’t do you much good. Don’t make any sudden movements or show any sign of fear. Get somewhere safe. [10] X Research source Cheetah attack on zoo worker covered up, Al Oeming says lie saved cat's life. Edmonton Journal. Get back in your car or find other shelter. Don’t bother climbing a tree – cheetahs cannot climb as high as other big cats, but can still scale any tree you can at a much faster speed."
    },
    {
      "title": "Intimidate the cheetah.",
      "content": "Intimidate the cheetah. If the cheetah continues to aggressively approach or pursue you, you will have to stand your ground. Make yourself appear as large as possible. Wave your arms above your head and start yelling at it. Clap or whistle loudly. If you have noise making devices available such as bells or pots and pans, use them to scare the cheetah off."
    },
    {
      "title": "Fight back.",
      "content": "Fight back. While cheetahs are stronger and faster than you, you still have a fighting chance if you’re being attacked. If you are armed, utilize your weapon. Pepper spray should be your first line of defense since cheetahs are an endangered species. Do not kill the cheetah unless it is actively attacking you or a member of your group. Kick the cat firmly in the chest just before it makes contact with you. This will knock it back and, hopefully, make it think twice about attacking you. [11] X Research source If using a knife, strike the cheetah in the eyes or neck. If unarmed, go for the eyes, plunging your thumbs into its eye sockets and gripping it around the back of its head. Punch the cheetah in its head and nose. [12] X Research source"
    },
    {
      "title": "Play dead.",
      "content": "Play dead. If you’ve already been pounced on, do not struggle or scream. [13] X Research source Slow your breathing and close your eyes. Assume the fetal position by bringing your knees up to your head and covering your neck with your hands. The cheetah will think itself victorious and slink away or turn its attention to something else. In either case, you will then have an opportunity to escape or get help from your companions. Protect your neck while on the ground. Cheetahs kill their prey by clamping down on their victim’s neck with their powerful jaws, suffocating it. [14] X Research source"
    },
    {
      "title": "Call for help.",
      "content": "Call for help. If your companions are nearby, yell and attract their attention. You might not be able to fend off a wild cheetah on your own. [15] X Research source Individuals attacked by cheetahs are often saved due to the timely intervention of a friend or other member of their group. For this reason, always stay close to your party when venturing into cheetah territory. If you are not the immediate object of the cheetah attack, you should do everything you can to remove the cheetah from the other member of your party. Cheetahs are scared by large groups and an attacking cheetah will likely break off its attack when it sees it is outnumbered. Strike the cheetah in its head or side to remove it from your friend. Take the cat’s tail firmly in your hand and pull hard. Reach your hand over the back of its head and plug its nostrils. Unable to breathe, the cheetah will abandon its attack. Spray water on its face. [16] X Research source Do not use firearms against a cheetah who has a friend pinned. The risk of inadvertently hitting the victim is too great."
    },
    {
      "title": "Clean the wound.",
      "content": "Clean the wound. Immediate, gentle rinsing of the wound with water or a solution of water and povidone-iodine will decrease your risk of bacterial infection. Remove any teeth, dirt, or hair if possible. If the wound is shallow, pad it dry and apply an antibacterial agent. Wrap it with a clean bandage. Cut away any clothing to clean the wound if necessary. If the bite severed a body part such as a finger, wash it in clean water, wrap it in tissue, and place it in a plastic bag. Pack the bag in ice. It may be possible to reattach it later. If jewelry is present, remove it to prevent the constriction of blood vessels in the event of swelling. Pay attention to your condition. If you feel lightheaded, weak, or dizzy, you may pass out due to blood loss or shock. Don’t move too suddenly following your attack unless it is to extricate yourself from immediate danger."
    },
    {
      "title": "Apply pressure to your wound.",
      "content": "Apply pressure to your wound. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Wash your hands if possible. If vinyl medical gloves are available in your first aid kit, wear them. If not, use clean plastic bags or layers of rags or cloth to keep a barrier between your hand and the wound. To prevent infection, use your bare hands only as a last resort. You will need to staunch the bleeding with a clean, dry cloth. Elevate the wound and apply even pressure for 15 minutes. Time your application of pressure with a clock. If blood soaks through the first cloth, apply another without removing the first. After 15 minutes, check to see if the wound has stopped enough for bandaging. If it has not, continue to press the wound in 15-minute intervals until bleeding has slowed enough to apply a bandage."
    },
    {
      "title": "Seek medical attention immediately.",
      "content": "Seek medical attention immediately. You will likely need stitches to heal properly. Depending on the extent of damage, surgery may be necessary. Your doctor will probably prescribe you with an antibiotic and run bloodwork to check for infection. An X-ray might be called for to check for broken bones. If the animal’s rabies immunization status is unknown, your doctor will need to check for evidence of rabies by killing the cheetah in question and studying its brain. If the cheetah was rabid, you are in serious danger and must receive a full battery of vaccines immediately. Once symptoms start, your chances of survival are limited."
    },
    {
      "title": "Follow up with your doctor.",
      "content": "Follow up with your doctor. Besides rabies, bite wounds can lead to nerve or tendon laceration and infection. Signs of nerve or tendon damage include the inability to move the wounded limb properly, or a loss of feeling around the site of the bite wound. [18] X Research source Infections can be fatal if not treated quickly and properly. Signs of infection include swelling, redness, pain, or oozing. Be on the lookout for irritation to the wound or changes in your condition which may indicate infection."
    }
  ]
}