{
  "url": "https://www.wikihow.com/Strawberry-Makeup",
  "title": "How to Do the Viral Strawberry Makeup Look",
  "steps": [
    {
      "title": "Start with a glowy, natural-looking base.",
      "content": "Start with a glowy, natural-looking base. In her TikTok tutorial for the look, Hailey Bieber starts by applying the Glazing Milk then the Peptide Glazing Fluid from her brand, Rhode Skin. She rubs each of them into her skin and actually skips foundation for a more natural look. [1] X Research source If you don’t have these products, don’t worry! You can simply apply your usual face moisturizer to make sure you have a hydrated, dewy base. If you like to have a little more coverage, a tinted moisturizer is the perfect middle ground to even out your skin tone while also leaving you with a natural-looking finish. Here are some options to try: Saie Slip Tint Dewy Tinted Moisturizer Pros: Dewy and sheer finish, hyaluronic acid for hydration Cons: Some reviewers mention difficulties with the pump on the bottle Customer Ratings: 4.3 star average on Amazon.com Ilia Super Serum Skin Tint Pros: Contains niacinamide for hydration and SPF 40 for sun protection Cons: A bit pricier than other options Customer Ratings: 4.3 star average on Amazon.com [2] X Research source L’Oréal Paris True Match Hyaluronic Tinted Serum Pros: Contains hyaluronic acid for hydration, less expensive, luminous finish Cons: Some reviewers mention it has a liquid-y texture, which they find a bit harder to work with Customer Ratings: 4.5 star average on Amazon.com [3] X Research source"
    },
    {
      "title": "Apply cream bronzer to your cheeks, forehead, and eyelids.",
      "content": "Apply cream bronzer to your cheeks, forehead, and eyelids. Next, Bieber applies a cream bronzer to her cheeks and forehead for some sculpting and definition. [4] X Research source Using a bronzer brush , sweep your bronzer into the contours of your cheeks, then bring it up to your forehead around your hairline. Bieber also applies some bronzer to her eyelids instead of eyeshadow. To do this, just dip an eyeshadow brush into your bronzer, then sweep it into the creases of your eyelids. Here are a few good cream bronzers to try out: Tower 28 Bronzino Illuminating Cream Bronzer Pros: Reasonably priced, luminous and glowy finish, sheer Cons: Some reviewers mention that it fades throughout the day Customer Ratings: 4.2 star average on Amazon.com Saie Sun Melt Natural Cream Bronzer Pros: Soothing ingredients like colloidal oatmeal, grapeseed oil, and elderberry extracts Cons: A bit pricier Customer Ratings: 4.4 star average on Amazon.com Milani Cheek Kiss Cream Bronzer Pros: Less expensive, creamy and easy to blend, cruelty-free Cons: Some reviewers mention that it doesn’t last as long as they’d like Customer Ratings: 4.6 star average on Amazon.com [5] X Research source"
    },
    {
      "title": "Brighten up some areas with concealer.",
      "content": "Brighten up some areas with concealer. In her tutorial, Bieber dots some concealer onto her under eye area, the corners of her mouth, and the contours of her nose, then she blends it out. [6] X Research source Dab your usual concealer onto these places, as well as any blemishes or areas of discoloration you might have, then blend it with a large face brush or your fingers."
    },
    {
      "title": "Apply pink blush to your cheeks and the bridge of your nose.",
      "content": "Apply pink blush to your cheeks and the bridge of your nose. Now it’s time for the star of the show—the blush! Bieber applies pink cream blush liberally to her cheeks, then she even brings it across the bridge of her nose for an extra rosy, strawberry-inspired look. [7] X Research source You can use any pink or berry tinted cream blush that you have on hand, but here are a few options to check out if you’re looking to purchase one: Saie Dew Blush Pros: Glowy finish, blendable, buildable, “no makeup makeup” look Cons: Some mention that brushes work best to blend it (rather than fingers) Customer Ratings: 4.5 star average on Amazon.com [8] X Research source E.l.f Putty Blush Pros: Lower price, lightweight, contains hydrating argan oil and vitamin E Cons: Some reviewers say it looks patchy if you try to apply it with your fingers Customer Ratings: 4.4 star average on Amazon.com Tower 28 BeachPlease Cream Blush Pros: Reasonably priced, works on lips and cheeks, safe for sensitive skin Cons: Some reviewers mention that it isn’t as long lasting as they’d like Customer Ratings: 4.5 star average on Amazon.com"
    },
    {
      "title": "Add highlighter to your cheeks for some extra glow.",
      "content": "Add highlighter to your cheeks for some extra glow. Bieber uses her fingers to apply a “peachy highlighter” to her cheekbones over her blush, but any highlighter that you have on hand should work just fine. [9] X Research source If you have a liquid or cream formula, you can use your fingers to blend it into your skin like Bieber does, but if you have a powder formula, use a highlighter brush to apply it. Here are some popular highlighters to check out: Rare Beauty Positive Light Liquid Luminizer Pros: Blendable, luminous but not over the top, comes in 8 shades Cons: Some reviewers find it a little too subtle Customer Ratings: 4.4 star average on Amazon.com Milk Makeup Dewy Cream Highlighter Stick Pros: Comes in a stick for easy application, hydrating ingredients, buildable Cons: Some reviewers mention that the product is a bit small for the price Customer Ratings: 4.1 star average on Amazon.com [10] X Research source Saie Glowy Super Gel Highlighter Pros: Brightening and moisturizing ingredients, also works as a primer Cons: Some find the natural finish to be not shimmery enough Customer Ratings: 4.4 star average on Amazon.com [11] X Research source"
    },
    {
      "title": "Dot on some faux freckles.",
      "content": "Dot on some faux freckles. After applying her blush and highlighter, Bieber adds a few faux freckles. [12] X Research source If you naturally have freckles, feel free to skip this step, but if you don’t, there are a few faux freckle products out there you can use to achieve this cute look. ColourPop Freckle Pen Pros: Affordable, subtle and realistic-looking Cons: May work best for people with cool undertones Customer Ratings: 4.6 star average on Amazon.com [13] X Research source Marine Forest Freckle Pens Pros: Waterproof, long lasting, affordable Cons: Some reviewers mention that it’s hard to create natural-looking freckles with the marker-like applicator Customer Ratings: 4.2 star average on Amazon.com"
    },
    {
      "title": "Swipe on some brown eyeliner and a bit of mascara.",
      "content": "Swipe on some brown eyeliner and a bit of mascara. The strawberry makeup look is all about the blush, so Bieber keeps things simple with her eyes. Simply use some brown liquid eyeliner to create a thin, small wing , then put on a bit of mascara to tie everything together."
    },
    {
      "title": "Brush up your brows and apply brow gel.",
      "content": "Brush up your brows and apply brow gel. Bieber also brushes up her brows with some brow gel to give them a feathered look. You can use a clear brow gel or a tinted one that matches the color of your brows—whichever you prefer!"
    },
    {
      "title": "Finish off the look with pink, glossy lips.",
      "content": "Finish off the look with pink, glossy lips. In her tutorial, Bieber applies some of the same cream blush she used on her cheeks to her lips, then tops it off with Rhode’s peptide lip treatment . If the blush you used can’t be applied to your lips, a pink or berry-tinted gloss or balm also works (extra points if you can find a strawberry-scented one!). Here are some options to check out: Laneige Lip Glowy Balm in Berry Pros: Contains shea butter and murumuru butter for hydration, berry tint Cons: Some reviewers find the tint to be too sheer Customer Ratings: 4.7 star average on Amazon.com [14] X Research source Tower 28 ShineOn Lip Jelly in XOXO Pros: Glossy, sheer finish, a bit of a stronger tint (but still wearable and not over-the-top) Cons: Some reviewers don’t like that it isn’t scented Customer Ratings: 4.5 star average on Amazon.com NYX Butter Gloss Non-Sticky Lip Gloss in Peaches & Cream Pros: Very affordable, sheer to medium coverage, cruelty free Cons: Some reviewers mention needing to re-apply often Customer Ratings: 4.5 star average on Amazon.com"
    },
    {
      "title": "Play up the strawberry theme and wear some pink or red pieces.",
      "content": "Play up the strawberry theme and wear some pink or red pieces. If you want to go all-in, look for tops, bottoms, or dresses in a pink color palette. The makeup look itself gives off a super cute, girly vibe, so it would pair nicely with feminine pieces like flowy tops or tiered dresses, but it would also look great with more casual ensembles. Here are a few outfit ideas to inspire you: Pair a cozy pink sweater with jeans for a laid-back look. If you want more of a statement piece, look for a sweater with strawberries on it ! For a bit more of a dressed-up look, opt for a pink dress or a flowy pink skirt ."
    },
    {
      "title": "Keep things simple and wear an outfit in a neutral color palette.",
      "content": "Keep things simple and wear an outfit in a neutral color palette. If you want to let your strawberry makeup be the star of the show, neutral-toned or white pieces work perfectly. For example, a casual white T shirt or cream-colored sweater with the bottoms of your choice will help keep the focus on your fun makeup look. Dresses in this neutral palette work as well for a less casual option. If you do decide to go for a more neutral-toned outfit, you can always tie in the strawberry theme with fun accessories. For example, a pink handbag or pink shoes are great for a pop of color."
    },
    {
      "title": "Who created the “strawberry makeup” trend?",
      "content": "Who created the “strawberry makeup” trend? Hailey Bieber, wife of Justin Bieber and founder of skincare and beauty brand Rhode, started the strawberry makeup trend when she posted a tutorial for the look on her TikTok account. The video quickly went viral, and it’s now sitting at 36.5 million views and 1.9 million likes. Bieber is no stranger to creating viral makeup and beauty trends—she’s also the mastermind behind “glazed donut nails” (sheer nude nail polish topped off with chrome powder), “latte makeup” (a bronzy makeup look featuring brown and nude shades), and “cinnamon cookie butter hair” (brunette hair with a caramel, gold, and copper-y tones). [15] X Research source"
    },
    {
      "title": "What is the difference between strawberry makeup and latte makeup?",
      "content": "What is the difference between strawberry makeup and latte makeup? Whereas strawberry makeup focuses on a pink and berry-tinted color palette, latte makeup uses brown and nude shades to create a bronze-y look. [16] X Research source It features a liberal amount of glowy bronzer, brown and nude shades of eyeshadow, and nude or brown-tinted lip gloss."
    },
    {
      "title": "What is the “tomato girl” makeup trend?",
      "content": "What is the “tomato girl” makeup trend? The “tomato girl” makeup trend is very similar to the strawberry makeup trend. It features a lot of blush across the cheeks and bridge of the nose to create a super summery and sun-kissed look. [17] X Research source The only difference is that you’d use a red-toned blush for tomato girl makeup, as opposed to the pink or berry-toned blush you’d use for strawberry makeup."
    }
  ]
}