{
  "url": "https://www.wikihow.com/Treat-a-Small-Burn",
  "title": "How to Treat a Small Burn",
  "steps": [
    {
      "title": "Run the burn under cold water.",
      "content": "Run the burn under cold water. If you've just burned yourself, rinse the burn under cool water. Cold water will quickly cool the affected area and minimize the size of the burn. Don't use soap yet, just rinse the burn. [1] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Don't rinse chemical burns or more serious burns. If you see any scorching or ash and smell burning, stay away from water and call 911. Don't submerge burns in water. Rinse gently, then dry your skin by patting it with a clean towel afterward."
    },
    {
      "title": "Cool the spot for 5-10 minutes.",
      "content": "Cool the spot for 5-10 minutes. After cooling down your skin with water, you can use a clean cool compress on the burn to reduce swelling. This helps to soothe the pain and minimize the swelling and blistering that can occur with minor burns. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Cool compresses will only cool the burn for the first 10 minutes after injury. After that point, a compress may relieve pain, but it won't treat the burn. Do not use chipped ice cubes, bags of frozen vegetables, or other frozen items instead of a clean cool compress. Burns can numb your heat-sensitivity, which means you can actually get frostbite."
    },
    {
      "title": "Look at the spot after a few minutes.",
      "content": "Look at the spot after a few minutes. Even if you think the burn is relatively mild, keep an eye on it to make sure it doesn't get worse. Sometimes, bad burns can become numb, making the pain come on later. [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Learn the difference between burns to plan for care: [4] X Research source First degree burns affect the top layer of skin only, and are characterized by redness, minor swelling, and pain. First degree burns don't usually require medical attention. Second degree burns also only affect the outer layer of skin, but are more severe, characterized by red and white splotchy skin, blistering, swelling, and more significant pain. Third degree burns affect the under layers of skin, and the fat beneath. Some severe third degree burns even affect muscle, or bone. These burns are characterized by blackness or white scorching on the skin, and may be accompanied by difficulty breathing, severe pain, and smoke inhalation."
    },
    {
      "title": "Continue applying a cool compress, if the pain persists.",
      "content": "Continue applying a cool compress, if the pain persists. Use a cold washcloth or other sanitary compress on the affected area to help with the pain. Coldness helps both to reduce the pain and reduce the swelling of the burned area. Burns that blister will hurt more in the long run, so it's important to keep it from swelling up if you can. [5] X Research source"
    },
    {
      "title": "Raise the burned area above your heart.",
      "content": "Raise the burned area above your heart. Sometimes, even minor burns will start to throb and can be quite painful in the first few hours. If your burn hurts, you can ease the pain by raising the area above the level of your heart, if possible. [6] X Research source"
    },
    {
      "title": "Seek medical attention for serious burns.",
      "content": "Seek medical attention for serious burns. All third degree burns require medical attention as quickly as possible. Second degree burns larger than three inches, or on the hands, feet, face, genitals, or major joints and sensitive areas, it's also important to get checked out by a doctor. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Clean the area gently with soap and water.",
      "content": "Clean the area gently with soap and water. After you've gotten the swelling and the pain under control, clean the burn with some mild soap and water. Dry the area and keep the burn clean to avoid infection. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Apply over-the-counter topical cream if necessary.",
      "content": "Apply over-the-counter topical cream if necessary. To help keep the swelling down and the burn as clean as possible, it's a good idea to use a basic salve or balm that you can get at the store. Aloe-vera gel or cream is often used, [9] X Research source as well as low-dosage hydrocortisone. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have blisters, use an antibiotic topical cream and cover the blister with a bandage for about 10 hours before you uncover it. [11] X Research source Gentle, scent-free moisturizer is sometimes used on mild burns. This helps keep the skin on the burned area from cracking. Let the burn heal some before you apply moisturizer. [12] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source"
    },
    {
      "title": "Leave the burn uncovered unless it is very deep.",
      "content": "Leave the burn uncovered unless it is very deep. Very mild burns don't need to be covered to help them heal. Keep the burn clean and dry, and it should heal in a few days. If the burn looks deep, however, cover it in a clean, dry cloth. Blistered burns should generally be covered loosely with gauze. If you're in pain, you can use some loosely-wrapped gauze or a Band-Aid to cover the burned area and keep it safe. [13] X Research source"
    },
    {
      "title": "Leave small blisters alone.",
      "content": "Leave small blisters alone. Never attempt to pop blisters when they form. The blister is protecting the burned area and helping to heal the skin underneath. Blisters will go down in a few days, provided that you keep the area clean and dry. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Larger blisters should be checked out by a doctor, who will often lance or remove the blisters, if necessary. Never attempt to do this by yourself."
    },
    {
      "title": "Wear loose clothing around the area.",
      "content": "Wear loose clothing around the area. To keep the burn from becoming irritated, try to keep the area open and dry. Wear loose fitting cotton clothes that breathe well and let the air get to the burn. [15] X Research source If you've burned a finger or hand, remove any rings, bracelets, and watches from the area, and wear short sleeves. You don't want to agitate the area at all, if possible."
    },
    {
      "title": "Take over-the-counter pain reliever, if necessary.",
      "content": "Take over-the-counter pain reliever, if necessary. If your burns are hurting, taking a pain reliever like acetaminophen or ibuprofen. This can help to reduce swelling as well as control the pain. Use OTC pain medications as directed. [16] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Treat burns with aloe-based gels",
      "content": "Treat burns with aloe-based gels . Aloe-vera gels and moisturizers are helpful at soothing and cooling minor burns. You can use the natural oil from the plant itself, or buy some aloe cream at the store. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Some moisturizers and lotions advertised as \"aloe\" actually contain only a small percentage of aloe-vera. Read the ingredients, and make sure you're not covering your burn with scented, aluminum-based lotions."
    },
    {
      "title": "Apply coconut and lavender oil.",
      "content": "Apply coconut and lavender oil. Lavender essential oil is thought to have therapeutic properties for small cuts, abrasions, and minor burns that affect the outer layer of the skin. Essential oils can irritate your skin, however, so it's important to mix it with a soothing oil, like coconut, which has antimicrobial properties. [18] X Research source Supposedly, the French scientist who pioneered the use of lavender oil as a home remedy once burned himself in the lab and plunged his hand into a vat of lavender oil, healing it quickly. [19] X Research source"
    },
    {
      "title": "Dab the burn with vinegar.",
      "content": "Dab the burn with vinegar. Some people think that a small amount of diluted vinegar can help to control pain and heal very minor burns quickly. If you burn yourself, rinse the burn quickly with cool water, then use a wet washcloth with a few drops of vinegar on it. Use the cloth as a cool compress on the affected area. [20] X Research source"
    },
    {
      "title": "Use cut potato.",
      "content": "Use cut potato. Cut potato is sometimes used in rural regions instead of bandages, specifically on burns. Potato peel is antibacterial and won't stick to the wound, which can be somewhat painful. [21] X Research source If you try this, make sure you clean the wound thoroughly before and after, and rinse the potato before you apply it. Don't leave potato residue on your wound."
    },
    {
      "title": "Only use home remedies on very minor burns.",
      "content": "Only use home remedies on very minor burns. If you can't heal up a burn with cool water, over-the-counter medication, and time, you need to get medical attention. Never try to use unverified home remedies on serious burns. Petroleum jelly is commonly thought to have burn-soothing benefits, but this is not true. Petroleum jelly is a moisture barrier, which can dry out the wound. Petroleum jelly has no actual healing properties. Putting petroleum jelly on a burn is not recommended. Some people think toothpaste, butter, and other kitchen supplies should be used on burns. This is not backed up in any way. Never apply toothpaste to burns. [22] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    }
  ]
}