{
  "url": "https://www.wikihow.com/Spot-an-ATM-Skimmer",
  "title": "How to Spot an ATM Skimming Device: Detailed Steps to Avoid a Scam",
  "steps": [
    {
      "title": "Examine the card reader for signs of tampering.",
      "content": "Examine the card reader for signs of tampering. Card readers should be sturdily attached to the machine. Anything unusual or out of place may be a sign that it has been tampered with. Wiggle the card scanner to see if it moves or budges. If the card reader moves or jiggles at all, a skimmer is probably attached. [1] X Research source In particular, be wary if: [2] X Research source There are glue marks around the reader. There is tape sticking out from under the reader. The reader is skewed or hanging off to the side. A loose piece of plastic or equipment is sticking out from the reader. The card reader seems bulkier than normal."
    },
    {
      "title": "Look around for a hidden camera.",
      "content": "Look around for a hidden camera. Small cameras are often attached to the ATM to get your PIN number after you enter your card. Cameras may be hidden above the PIN pad, above the display screen, or in nearby structures, like a rack or shelf. [3] X Research source If you see a small pinhole drilled into the ATM, be careful, as it could be a small camera. [4] X Research source If you see something like a pack of cigarettes, book, deck of cards, or mug sitting on or near the ATM, move it aside to see if it is hiding a camera. Legitimate cameras installed by the bank are usually very noticeable. They may be large and have a sign indicating where they are. Card skimmer cameras are typically very small or hidden."
    },
    {
      "title": "Examine the keypad for larger keys or an unusual thickness.",
      "content": "Examine the keypad for larger keys or an unusual thickness. Sometimes, thieves will put a fake keypad over the real pad to capture your PIN number. A fake keypad may have larger or thicker keys than usual. It may also be raised up from the rest of the ATM. [5] X Research source Press down a few random keys on the keypad. If it feels spongy, sticky, or rigid, there may be a fake pad attached."
    },
    {
      "title": "Check the buttons to see if lines, arrows, and other graphics are lined up properly.",
      "content": "Check the buttons to see if lines, arrows, and other graphics are lined up properly. If a graphic is partially covered or doesn't align properly, it may be because there is a fake case attached to the buttons. Normal ATMs should not have skewed, covered, or cut-off graphics and shapes. [6] X Research source Look at the space under the card reader. If there are arrows, make sure that they are not covered partially. There should be a space between any arrows and the card reader itself. If the instructions next to the card reader are partially covered or cut off, it is likely that there is a plastic skimmer attached over them."
    },
    {
      "title": "Check the top of the ATM for unusual plastic pieces.",
      "content": "Check the top of the ATM for unusual plastic pieces. These pieces are usually shaped like rectangular bars and will be glued or taped onto the ATM itself. This bar may contain a camera and other equipment to get your card info. Look for a small pinhole in the bar. If you see one, it likely contains a small camera. If it is attached to the light, be especially wary. Normally, there should be nothing covering the ATM’s light. If you’re uncertain about a piece of equipment on the ATM, try wiggling it with your hand. If it budges or moves, it is likely a skimmer."
    },
    {
      "title": "Pay attention to any changes made to your usual ATM.",
      "content": "Pay attention to any changes made to your usual ATM. If you use a certain ATM often, stay alert for any unusual changes. If you see something off—whether it is a strange piece of plastic or a new plastic mold over the card reader—trust your gut and go to a new ATM. Watch out for: [7] X Research source Unusual colors on your ATM, especially on the card reader itself. A card reader that juts out more than usual. Cracks around the receipt slot, speakers, audio jack, or cash dispenser. No flashing indicator where there was one before."
    },
    {
      "title": "Use a skimmer scanning app to test for skimmers with your phone.",
      "content": "Use a skimmer scanning app to test for skimmers with your phone. There are plenty of apps on the market that can help you identify skimmers. These apps use Bluetooth to see if an ATM is sending information out to another phone or computer. Here are some apps you can download today: Card Skimmer Locator Bluetana Similarly, there are also detector devices available that are interested into an ATM card slot to identify if a skimmer is being used."
    },
    {
      "title": "Stop using the ATM if you spot a suspected skimmer.",
      "content": "Stop using the ATM if you spot a suspected skimmer. If you have even the slightest hunch that an ATM has a skimmer, stop or avoid using it immediately. Report the ATM to the bank or business. [8] X Research source"
    },
    {
      "title": "If you suspect you’re a victim of a skimming device, contact local law enforcement.",
      "content": "If you suspect you’re a victim of a skimming device, contact local law enforcement. File a report with the police if you believe you’ve been scammed at an ATM. Report anything unusual about an ATM to the bank and suspicious card activity to your card issuer. [9] X Research source"
    },
    {
      "title": "Use ATMs in busy, well-lit, and populated areas.",
      "content": "Use ATMs in busy, well-lit, and populated areas. Thieves are more likely to install skimmers in isolated areas where they won’t be caught. While no ATM is completely risk-free, it is better to use skimmers inside buildings or in densely populated areas. [10] X Research source If you use an indoor ATM, check the location. If the machine is located somewhere that a back employee can easily see, it's safer than an ATM stuck in a back corner or hidden by furniture. If you use an outdoor ATM, make sure it is close to the door of a building or facing a busy street. Be wary of ATMs in tourist areas, as these are typically popular targets for skimmers. [11] X Research source"
    },
    {
      "title": "Cover the keypad with one hand when you enter your PIN.",
      "content": "Cover the keypad with one hand when you enter your PIN. Covering your PIN helps prevent a camera from catching your PIN after you enter your card. Keep in mind, however, that this will not protect your PIN if there is a fake keypad attached. [12] X Research source"
    },
    {
      "title": "Go to the ATM on a weekday.",
      "content": "Go to the ATM on a weekday. Criminals often install skimmers on the weekends when banks are closed. Your chances of finding a skimmer are lower on weekdays. [13] X Research source"
    },
    {
      "title": "Monitor your bank account several times a week.",
      "content": "Monitor your bank account several times a week. If you find suspicious activity on your account, your bank may be able to return the money to you as long as you report it right away. Check your bank account 2 to 4 times a week to make sure there is no one else accessing your money. [14] X Research source To give you extra peace of mind, sign up for your bank’s fraud alert system. Usually, your bank will text you if they notice suspicious activity. [15] X Research source"
    },
    {
      "title": "Use another ATM if you are in doubt.",
      "content": "Use another ATM if you are in doubt. There is no foolproof way to tell if a skimmer is attached to your ATM. If you have the slightest doubt, use a different ATM. Always trust your gut. [16] X Research source"
    },
    {
      "title": "A card skimmer is a device inserted in or on an ATM card reader.",
      "content": "A card skimmer is a device inserted in or on an ATM card reader. ATM skimmers steal credit card numbers and PIN codes from unsuspecting ATM users. Criminals then put the stolen data onto a bank card to loot the victim’s bank account and take out money. [17] X Research source"
    },
    {
      "title": "A skimmer typically looks like an ATM’s card reader.",
      "content": "A skimmer typically looks like an ATM’s card reader. Skimmer devices come in all shapes and sizes, but the most common look identical to the ATM’s card reader. The skimmer fits over the reader like an overlay, disguising the real part of the ATM. Card skimmers are typically more convex and curve outward rather than inward. [18] X Research source Similarly, another popular skimming device is a keypad overlay, which sits on top of the ATM’s keypad to conceal a hidden camera that detects card PINs."
    }
  ]
}