{
  "url": "https://www.wikihow.com/Write-a-Theme-Essay",
  "title": "How to Write a Theme Essay",
  "steps": [
    {
      "title": "Read the essay prompt carefully.",
      "content": "Read the essay prompt carefully. A theme essay usually responds to a specific prompt given to you by a teacher or professor. Most essay prompts will ask you to identify the theme, or the overarching message, in a text. Look at the terms used in the prompt and highlight keywords or important terms. This will help you identify what you need to address as you write your essay. [2] X Research source For example, an essay prompt may ask you to reflect on the theme of good versus evil in John Steinbeck's East of Eden ."
    },
    {
      "title": "Brainstorm ideas for the essay.",
      "content": "Brainstorm ideas for the essay. Once you've read and considered the essay prompt, brainstorm how you can write your essay. [3] X Expert Source Jake Adams Academic Tutor & Test Prep Specialist Expert Interview. 20 May 2020. In your essay, you will use research and evidence to support a central argument. Start to jot down examples you can use to reflect on the theme. Make a list of everything you know about the topic. This can be information you learned in class, as well as information you found on your own. Write down keywords or key scenes in the text that respond to the essay prompt. Think about what words or scenes from the text come to mind when you think of a specific theme. For example, when you brainstorm ideas on East of Eden , you may write down any moments in the text that seem to speak to the theme of good and evil."
    },
    {
      "title": "Create a thesis statement",
      "content": "Create a thesis statement . [4] X Expert Source Jake Adams Academic Tutor & Test Prep Specialist Expert Interview. 20 May 2020. A thesis statement is a single sentence that summarizes the entire essay. You'll need to include this thesis statement in your introductory paragraph, and the rest of your essay will need to support it. [5] X Research source Your thesis statement will need to address the theme, your primary example or examples, and the stance you will take on the topic. For example, your thesis might be: \"In East of Eden , John Steinbeck rejects the Biblical idea of good and evil and instead focuses on the contradictions and complications found in good and evil.\""
    },
    {
      "title": "Outline the essay.",
      "content": "Outline the essay. Once you've figured out your thesis, you can begin outlining your essay. [6] X Expert Source Jake Adams Academic Tutor & Test Prep Specialist Expert Interview. 20 May 2020. Some teachers may require a 5-paragraph essay while others may want the essay shorter or longer. A typical essay outline has three main parts: the introduction, the body, and the conclusion. [7] X Research source For example, using the East of Eden prompt, your outline might be: Introduction: Discuss landscape as metaphor, include thesis statement. Body: Describe mountains in opening scene, elaborate on how they symbolize good vs. evil, state how characters live between the mountains, showing how people are caught between good and evil. Conclusion: Restate thesis statement, return to landscape as metaphor."
    },
    {
      "title": "Start with a hook.",
      "content": "Start with a hook. Your introduction should have a first sentence that hooks readers in. [8] X Expert Source Jake Adams Academic Tutor & Test Prep Specialist Expert Interview. 20 May 2020. From there, you can give a brief overview of what the essay will discuss. Your thesis statement should appear somewhere towards the end of your introduction. [9] X Research source Questions can make fun hooks for the reader. Ask a rhetorical question that relates to the theme of the essay, such as \"How does one decide what is good and what is evil?\" You can also use a quote from the text as the hook. Find a quote in the text that explores the themes and ideas you'll be discussing in your essay."
    },
    {
      "title": "Introduce your supporting ideas.",
      "content": "Introduce your supporting ideas. In your body paragraphs, introduce your supporting ideas. The beginning of each body paragraph should introduce a main point. The main point should connect back to your thesis statement and your discussion of a particular theme in the text. For example, you may introduce the role of nature plays in the text to discuss the theme of good and evil. The first sentence of your body paragraph should discuss the role of nature. This will set up the paragraph and let the reader know what the focus of the paragraph will be."
    },
    {
      "title": "Use examples from the text.",
      "content": "Use examples from the text. Once you've introduced your supporting ideas, elaborate on them using quotes or references from the text you are analyzing. All your paragraphs should circle around the central theme or thesis of your essay, using the text as evidence. For example, you may discuss the use of nature in the text in one paragraph. The body of the paragraph should then use quotes and scenes in the text to support this idea. You might write,\"The descriptions of the Gabilan Mountains in the text symbolize good and evil. The characters in the story live in the Salinas Valley, trapped in a gray area between these two extremes.\""
    },
    {
      "title": "Create a strong conclusion.",
      "content": "Create a strong conclusion. A good conclusion should sum up your main ideas and leave the reader with a memorable closing line. Restate your thesis statement in the conclusion, using slightly different wording. [10] X Research source Ask yourself, \"What do I want my readers to have learned through this essay?\" Remind readers about the essay's theme. Reference some of the arguments you made in the body of your essay, reinforcing how they support your original point."
    },
    {
      "title": "Check the structure and flow of the essay.",
      "content": "Check the structure and flow of the essay. Review the essay to make sure there is an introduction, body, and conclusion. Check that your thesis statement appears in the introduction and conclusion of the essay. Make sure you have evidence in the body paragraphs to support your thesis. [11] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Check that there are transitions between paragraphs. Look at the beginning of each paragraph to make sure they all flow well together."
    },
    {
      "title": "Look for any spelling, grammar, or punctuation errors.",
      "content": "Look for any spelling, grammar, or punctuation errors. Read the essay backwards to catch any spelling or grammar errors. Circle all the punctuation marks in the essay to confirm they are correct. [12] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Print out your paper and proofread it. Oftentimes, errors are easier to catch on paper. If you can't print out your paper, try changing the size or type of the font. Anything that alters how the work looked when you wrote it can help alert you to errors. [13] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Show the essay to others for review.",
      "content": "Show the essay to others for review. It can be difficult to critique your own work, especially if you have been staring at it for a while. Ask a friend, peer, or family member to review your essay for you. Have them check the essay for grammar, spelling, and punctuation. Ask them if the essay flows well and explores a theme well. [14] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Be open to constructive feedback from friends and peers. This will only improve the essay and ensure it is at its best when you turn it in."
    }
  ]
}