{
  "url": "https://www.wikihow.com/Volunteer-As-a-Hospital-Baby-Cuddler",
  "title": "How to Volunteer As a Hospital Baby Cuddler",
  "steps": [
    {
      "title": "Locate a hospital with a baby cuddler program.",
      "content": "Locate a hospital with a baby cuddler program. Complete a Google search to determine if your local hospital has a volunteer baby cuddler program. For example, you could search “volunteer baby cuddler programs in Toronto.” This will provide you with a number of hospitals in the area that have volunteer positions for baby cuddlers. You can also contact your local hospital and ask if they accept volunteers directly for the position of baby cuddler. Most hospitals will indicate on their website which volunteer positions need to be filled. If baby cuddler is not listed, you can email the volunteer coordinator to find out if they are accepting applications for that position."
    },
    {
      "title": "Read up on the volunteer requirements.",
      "content": "Read up on the volunteer requirements. Once you have located a hospital that contains a volunteer baby cuddler program, you will need to read up on the volunteer requirements. Most hospitals include a list of requirements on their volunteer webpage. [2] X Research source For example, volunteers need to be at least 18 years of age, they need to be able to volunteer a minimum number of hours each week, complete a health assessment, have a criminal background check performed, provide an up-to-date vaccination certificate, etc. Some hospitals will also have student volunteer programs for individuals under the age of 18."
    },
    {
      "title": "Gather all material needed for the application.",
      "content": "Gather all material needed for the application. Once you have determined what information is required in order to volunteer at this hospital, you will need to gather all of the relevant material. For example, you may need to get a criminal background check completed in order to be accepted as a volunteer. You may also need to get an annual flu shot. Make sure you have all of the information needed before applying."
    },
    {
      "title": "Fill out an application.",
      "content": "Fill out an application. In order to apply for a volunteer position, you will need to fill out an application form. These forms will ask a number of questions including: [3] X Research source Name, address, phone number, date of birth, education, employment information, volunteer experience, availability, etc."
    },
    {
      "title": "Find references.",
      "content": "Find references . Most volunteers also have to provide the hospital with the contact information for two to three references. These references should not be family members or close friends unless you have worked for them in the past. In some cases, your references are expected to fill out a form answering questions about you. In other instances, the hospital will contact the reference and ask them a few questions about you. [4] X Research source Choose references that will speak highly about your work ethic, reliability, friendliness, and professionalism. For example, you could ask a current/former boss, employer, or volunteer coordinator that you have worked with. Always notify your references before you include them in an application. This way they will be expecting the hospital to contact them."
    },
    {
      "title": "Complete an interview.",
      "content": "Complete an interview. Most hospitals interview potential volunteers before accepting them. This allows the volunteer manager the opportunity to get to know the applicant and assess them in person. In order to prepare for the interview , you should make sure that you have all of your required documents completed. You can also create a list of questions that you would like to ask during the interview. [5] X Research source For example, you may want to ask “What does the training program entail?”, “Can I request to work in a specific area of the hospital?”, “Do baby cuddlers require any additional training?” Arrive for your interview on time and dress in a professional manner ."
    },
    {
      "title": "Complete volunteer training programs.",
      "content": "Complete volunteer training programs. Once you have been accepted as a volunteer, you will likely need to complete some form of training program. This could include watching health and safety videos as well as learning about the policies and procedures of the hospital environment. Baby cuddlers may need to complete additional training concerning bedside manner and how to handle infants . [6] X Research source Take your training seriously. Pay attention, take notes , and ask questions if you need clarification."
    },
    {
      "title": "Request a position as a baby cuddler.",
      "content": "Request a position as a baby cuddler. If you are mainly interested in working as a baby cuddler, you should speak with the volunteer coordinator. Ask if there are any openings available in the NICU for volunteer baby cuddlers. Alternatively, you could let your supervisor know that you are interested in the baby cuddling program. [7] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Add your name to the waitlist.",
      "content": "Add your name to the waitlist. Baby cuddling is a highly sought after volunteer position in hospitals. As a result, many of these positions are filled. Ask if you can have your name added to the waiting list so that if a position opens up in the future, you will be considered. [8] X Research source Continue to volunteer in other areas of the hospital in order to demonstrate your enthusiasm."
    }
  ]
}