{
  "url": "https://www.wikihow.com/Use-Ferrite-Beads",
  "title": "How to Use Ferrite Beads",
  "steps": [
    {
      "title": "Use a ferrite bead to minimize radio frequency interference (RFI).",
      "content": "Use a ferrite bead to minimize radio frequency interference (RFI). If you hear a high-pitched hum when you turn on your laptop, use your headphones, or listen to the stereo, you’re experiencing RFI. This means that a high-pitched frequency is getting through the wires when you ideally just want low-frequency signals. [1] X Research source Ferrite beads can be used on all kinds of electronics. Laptops, headphones, stereos, headsets, gaming systems, and televisions are most likely to experience RFI and need a ferrite bead. Chances are you’ve seen a ferrite bead in your own home and just didn’t know what you were looking at. If you have any wires that look like they have a small box on them close to the plug, that small box is a ferrite bead."
    },
    {
      "title": "Choose the size of the ferrite bead based on the thickness of the wire.",
      "content": "Choose the size of the ferrite bead based on the thickness of the wire. Thin cords, like headphone cords, need a 3 mm (0.30 cm) bead. USB cables and network cables will need a 5 mm (0.50 cm) bead. Thicker computer or electronic cables will need a 7 mm (0.70 cm) bead. Power cords will use a 9 mm (0.90 cm) bead, and 120-volt power cords or 12-gauge cords will take a 13 mm (1.3 cm) bead. [2] X Research source If you buy a ferrite bead that is too big, you can loop the cord around it to make it fit more tightly."
    },
    {
      "title": "Buy ferrite beads online or at an electronics store.",
      "content": "Buy ferrite beads online or at an electronics store. You can often buy a variety pack of beads so you have multiple sizes to choose from. Make sure to buy ferrite beads that clip closed rather than ferrite cores, which don’t have a hinge. [3] X Research source Ferrite cores are most often used in internal hardware design. They’re installed before the actual electronic is finished and aren’t usually seen by consumers."
    },
    {
      "title": "Install a ferrite bead or core internally if you’re building your own hardware.",
      "content": "Install a ferrite bead or core internally if you’re building your own hardware. If you build your own electronics and want to reduce RFI, you can install a ferrite bead or core in the internal wires. This is a more complex procedure that involves knowing the hardware’s voltage output as well as the heat dissipation. [4] X Research source The manufacturer of the ferrite bead should be able to give you information about the impedance versus the load current curves. This can help you choose the right kind of ferrite bead for your project."
    },
    {
      "title": "Place the bead on the wire about 2 inches (5.1 cm) from the device.",
      "content": "Place the bead on the wire about 2 inches (5.1 cm) from the device. The bead should work regardless of its position on the wire, but it may work better at reducing RFI if placed closer to the source. It can even go up against the device without hurting anything. [5] X Research source Test the ferrite bead at different positions along the wire. If the high-pitched frequency is less with it at a specific point, use that location."
    },
    {
      "title": "Bend the wire into a loop first if it’s too loose on its own.",
      "content": "Bend the wire into a loop first if it’s too loose on its own. Take the wire and fold a 2 to 3 inches (5.1 to 7.6 cm) section over on itself so it’s twice as thick. If you want, you can loop the end of the wire back so that it’s three times as thick and pointing in its original direction. [6] X Research source This will help keep the ferrite bead in place and press it more firmly against the wire, which means it’ll do a better job at reducing the RFI."
    },
    {
      "title": "Clamp the ferrite bead closed.",
      "content": "Clamp the ferrite bead closed. Once the bead is in place, close it and press the two sides together until you hear them click into place. Gently pull at both sides to check that it is securely in place on the wire. [7] X Research source You don’t want the bead coming loose and falling off the wire, especially if it’s in a hard to reach place."
    },
    {
      "title": "Use a space-filler if the ferrite is still too loose on the wire.",
      "content": "Use a space-filler if the ferrite is still too loose on the wire. Hold the wire up and check to see if the bead stays in place. If it slides down the wire and you can’t loop it again to make it fit more tightly, use something like a toothpick, plastic paperclip, or bobby pin to fill the extra space. [8] X Research source The ferrite bead will still work even if it is loose, but it may not work as well as it could. Keeping it in place and tight against the wire is the best way to consistently reduce RFI. Avoid using a metal paperclip, as it could potentially interfere with the effectiveness of the bead."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}