{
  "url": "https://www.wikihow.com/Use-Photo-Booth-on-a-Mac",
  "title": "Use PhotoBooth on Your Mac to Take & Edit Photos",
  "steps": [
    {
      "title": "Connect a camera to your Mac (if necessary).",
      "content": "Connect a camera to your Mac (if necessary). If you have a MacBook, such as a MacBook Air or MacBook Pro, you can use your built-in webcam with Photo Booth. If you're using a Mac desktop, you can connect a webcam to one of your Mac's USB ports. Most webcams simply need to be plugged in to a USB port and they're good to go, as long as they're Mac compatible."
    },
    {
      "title": "Open Photo Booth.",
      "content": "Open Photo Booth. There are a couple ways you can quickly open Photo Booth: Click the Go menu, select Applications , and find Photo Booth in the Applications folder. Click the Spotlight Search button in your menu bar, type photo booth , and press ⏎ Return . Click the Photo Booth icon on the Launchpad."
    },
    {
      "title": "Click the Camera on the menu bar.",
      "content": "Click the Camera on the menu bar. If you have multiple cameras installed, you'll need to select the one you want to use with Photo Booth. [1] X Research source"
    },
    {
      "title": "Click the camera you want to use.",
      "content": "Click the camera you want to use. You'll see a list of all of your connected cameras. After selecting a camera, you should see the image from it in the Photo Booth window."
    },
    {
      "title": "Line up your shot in the Photo Booth window.",
      "content": "Line up your shot in the Photo Booth window. You'll see the image from your webcam in the Photo Booth window. Move yourself or your webcam until your shot is lined up correctly."
    },
    {
      "title": "Click the Single Picture button.",
      "content": "Click the Single Picture button. You can find this in the bottom-left corner of the Photo Booth window, and it is typically selected by default."
    },
    {
      "title": "Click the Camera button.",
      "content": "Click the Camera button. The countdown will begin at the bottom of the screen."
    },
    {
      "title": "Take your picture.",
      "content": "Take your picture. When the countdown completes, the screen will flash and your picture will be taken."
    },
    {
      "title": "Click the Four Pictures button.",
      "content": "Click the Four Pictures button. You'll see this in the lower-left corner of the Photo Booth window. The button looks like four small squares arranged in a grid."
    },
    {
      "title": "Line up your shot.",
      "content": "Line up your shot. You'll be taking four pictures in succession, with a few seconds in between to change poses. Make sure your camera is properly lined up in the Photo Booth window."
    },
    {
      "title": "Click the Camera button.",
      "content": "Click the Camera button. This is in the bottom-center of the window."
    },
    {
      "title": "Strike a pose and wait for the countdown.",
      "content": "Strike a pose and wait for the countdown. You'll see the countdown at the bottom of the screen."
    },
    {
      "title": "Change poses for each picture.",
      "content": "Change poses for each picture. You'll see the screen flash each time a picture is taken. Four pictures will be taken altogether."
    },
    {
      "title": "Click the Effects button.",
      "content": "Click the Effects button. You can apply effects to a picture you've just taken, or you can select an effect before taking a picture."
    },
    {
      "title": "Click the ◀ and ▶ buttons to see more options.",
      "content": "Click the ◀ and ▶ buttons to see more options. You'll see these at the bottom of the screen. Clicking these buttons will change pages and display more effects."
    },
    {
      "title": "Click the effect you want to apply.",
      "content": "Click the effect you want to apply. You'll see a preview of each effect in the menu."
    },
    {
      "title": "Click and drag the slider to adjust the effect (if possible).",
      "content": "Click and drag the slider to adjust the effect (if possible). If the effect you chose can be adjusted, you'll see a slider appear. This allows you to change the strength of the effect."
    },
    {
      "title": "Select a background from the list of effects.",
      "content": "Select a background from the list of effects. At the end of the list, you'll see backgrounds with silhouettes on them. These allow you to apply special backgrounds or effects to your body."
    },
    {
      "title": "Move out of the frame.",
      "content": "Move out of the frame. Photo Booth will need to detect what is the background so that it can properly apply the effect. You'll need to move completely out of the frame for it to work. Make sure there's nothing moving in your background either. This will work best with a solid background, but should work well as long as nothing is moving."
    },
    {
      "title": "Move back into the frame once the background has been detected.",
      "content": "Move back into the frame once the background has been detected. You'll see that the effect you chose has been applied to your body."
    },
    {
      "title": "Drag a photo from the timeline to quickly save it.",
      "content": "Drag a photo from the timeline to quickly save it. After taking a photo or video, you'll see it appear as a thumbnail at the bottom of the window. You can click and drag this to your desktop or any open folder to quickly save it."
    },
    {
      "title": "Select a photo and click Share.",
      "content": "Select a photo and click Share . The Share button looks like a square with an arrow coming out the top. This will open the Share menu. Click an item in the Share menu to choose how you want to share it. You can add it as an email attachment, send it in iMessage, or use any third-party apps that support sharing."
    },
    {
      "title": "Click File → Export to save images.",
      "content": "Click File → Export to save images. If you want to select where an image is saved, or change the format, you can use the Export menu. Browse for where you want the file to be saved, give the file a name and choose the format, then click Export."
    },
    {
      "title": "Find your Photo Booth photos.",
      "content": "Find your Photo Booth photos. Your Photo booth photos are stored in your Pictures library: Click the Finder button in your Dock. Click the Pictures folder. Find the Photo Booth Library package file. Right-click the file and select Show Package Contents . Open the Pictures folder in the Photo Booth Library and then find your pictures."
    }
  ]
}