{
  "url": "https://www.wikihow.com/Understand-Why-People-Choose-to-Steal",
  "title": "How to Understand Why People Choose to Steal",
  "steps": [
    {
      "title": "Recognize the signs of kleptomania.",
      "content": "Recognize the signs of kleptomania . Kleptomania is a type of impulse control disorder in which a person repeatedly has the urge to steal items that are not needed or that have very little value. A kleptomaniac may not need the item or might even have the money to purchase it. Still, the person compulsively steals because they get a rush from doing it. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [2] X Research source People with this disorder do not steal for personal gain. They do not usually plan out thefts or collaborate with others to complete them. Instead, these urges come on spontaneously. The person may steal from public places such as stores or from the homes of family or friends. If you know someone who can’t seem to stop stealing, suggest that they see a doctor. Kleptomania can be treated with therapy and medication. You might tell the person: \"I noticed that you took something out of that store. I know that you had the money, so I'm guessing you just had a desire to steal it. I'm concerned and I don't want you to get into trouble. Maybe you should talk to a professional. I'm willing to go with you.\""
    },
    {
      "title": "Identify addiction-related stealing.",
      "content": "Identify addiction-related stealing. A kleptomaniac steals merely for the rush and doesn't take the value of the stolen items into consideration. On the contrary, other forms of pathological theft are driven by addiction. In fact, stealing — along with financial difficulties — is often described as one of the warning signs of addiction. A person with a substance abuse problem or gambling addiction may take money from relatives, friends, and coworkers to fund their addiction. Lying is also a component of this type of theft; therefore, if the person is confronted about the issue, they are likely to deny having a problem. [3] X Research source Other signs of addiction may include making friends with a new group while neglecting existing friendships, having trouble with the law, having difficulty functioning at school and work, and having rocky relationships. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you suspect someone you know may be stealing to fund an addiction, get the person professional help immediately. You can approach the person and ask about the behavior: \"Lately you've been behaving differently, withdrawing from your friends, and having trouble keeping money. I'm worried you might have a drug problem.\" If the person is in denial about drug use, you can arrange to stage an intervention . An intervention involves other people who care about the person joining you in reaching out to them and explaining your concerns. This can serve as an impetus to get the person into addiction treatment."
    },
    {
      "title": "Understand that pathological stealing is generally not personal.",
      "content": "Understand that pathological stealing is generally not personal. People who steal pathologically are generally not doing it to intentionally harm anyone. The stealing meets a need — whether emotionally or literally. People who steal for pathological reasons may feel guilty about their behavior, but still be unable to stop it without intervention."
    },
    {
      "title": "Understand that some people steal to meet their basic needs.",
      "content": "Understand that some people steal to meet their basic needs. Desperation is a common reason behind many thefts. A person may not have a job or source of income or have insufficient means to provide for their family. As a result, the person steals to feed children or provide shelter. [5] X Research source"
    },
    {
      "title": "Realize that stealing can happen due to peer pressure.",
      "content": "Realize that stealing can happen due to peer pressure. Being in the wrong crowd can also prompt someone to develop a habit of stealing. In such cases, the value of the stolen item may not matter as much as the thrill of taking something and potentially getting away with it. This type of stealing is very common in teens who are susceptible to peer pressure. They may do it to look cool or be accepted by a group of peers. [6] X Trustworthy Source American Academy of Child and Adolescent Psychiatry Nonprofit organization dedicated to providing and improving psychiatric care for children and adolescents. Go to source"
    },
    {
      "title": "Notice a lack of empathy.",
      "content": "Notice a lack of empathy. A teenager or person who has difficulty seeing the \"bigger picture\" may steal without really thinking through their impulsive action might affect someone in the future. The person is not pathological — they are capable of empathy — but in the moment they may act without thinking how stealing will hurt the person or business from which they are stealing. If confronted or asked to think through their actions, this person probably would not steal."
    },
    {
      "title": "Recognize that some people steal to fill emotional holes.",
      "content": "Recognize that some people steal to fill emotional holes. In some cases, a person who has suffered an early attachment loss or trauma may steal to compensate. [7] X Research source These individuals’ basic emotional needs are not being met. In an attempt to fill an emotional hole left behind by a parent or caregiver, the child may compulsively steal to resolve feelings of deprivation. Unfortunately, the stealing does not resolve the issue, so the individual steals more and more. [8] X Research source"
    },
    {
      "title": "Consider that some people steal just because they can.",
      "content": "Consider that some people steal just because they can. Unfortunately, some thefts occur simply because the person has the opportunity. Maybe they get a sense of excitement from taking what’s not theirs. Perhaps they see it as a challenge. They may steal out of greed when they already have plenty. [9] X Research source"
    },
    {
      "title": "Involve the authorities.",
      "content": "Involve the authorities. If you have had something stolen from you, the first logical step is to report the theft to the police. Give your local police as much detail as you can to help them identify the stolen property and any potential suspects. Taking action right away is your best chance for recovering the stolen items and capturing the thief. [10] X Research source If your identity was stolen, there are specific steps you must follow to recover from the theft and protect yourself in the future. Visit the Federal Trade Commission’s at IdentityTheft.gov for more information. [11] X Research source"
    },
    {
      "title": "Reestablish safety as soon as possible.",
      "content": "Reestablish safety as soon as possible. If you have recently had your home or personal property burglarized, it’s important that you recover your sense of security. Repair any damages that were done to your home. Have a security company come out and inspect your home for “weak spots” such as the window frames and door hinges. Alert your neighbors and verify that they are taking precautions to protect themselves. [12] X Research source It’s also a good idea to create a safety plan for you and your family on how to respond if a theft happens in the future. You can develop best practices for securing valuables and decide on a place for children to hide if a burglar gets in the house."
    },
    {
      "title": "Try to follow your normal routine.",
      "content": "Try to follow your normal routine. Although it may be difficult to go about your life as usual, you must. It’s perfectly normal to feel afraid after going through a traumatic ordeal such as a burglary; however, you must not let fear incapacitate you."
    },
    {
      "title": "Take care of yourself",
      "content": "Take care of yourself . Don’t allow self-pity to make you neglect your general health and well-being. Experiencing a theft can cause a great deal of stress in your life. Try to get adequate sleep each night. Eat well-balanced meals and exercise to increase your strength and emotional well-being. If you nurture your mind and body during this time, you can more easily move beyond the negative feelings you are experiencing."
    },
    {
      "title": "Lean on your support system.",
      "content": "Lean on your support system. Turn to neighbors, family, friends, and your local community to recover from a theft. Be honest if there is something someone can help you do to feel more safe and secure in your home or community. Don’t hesitate to draw comfort from close friends and relatives who are ready to offer you support. For example, you might ask a neighbor: \"Would you mind keeping an eye on the house this weekend? We'll be out of town Friday and Saturday and I've been uneasy since the break-in.\""
    }
  ]
}