{
  "url": "https://www.wikihow.com/Stop-Talking-to-Someone",
  "title": "How to Stop Talking to Someone",
  "steps": [
    {
      "title": "Talk to them about your new boundaries, if you feel comfortable doing so.",
      "content": "Talk to them about your new boundaries, if you feel comfortable doing so. Although this may seem counterintuitive, it is the clearest way to communicate your feelings to them and helps to avoid miscommunication. Explain to the person that your relationship is negatively affecting you and outline what steps you will be taking to get some space from the relationship. [1] X Research source For example, “Our relationship is making me anxious so I have decided that I need some space for the next few months. During that time I won’t be responding to any messages on social media.” Try to communicate in a firm but kind manner. Let the other person know that you actively want to be working on making the relationship better with them. [2] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020."
    },
    {
      "title": "Write them a letter if you'd rather not talk to them in person.",
      "content": "Write them a letter if you'd rather not talk to them in person. If you feel threatened or anxious around the person, you may find it difficult to communicate clearly. In this case, write them a letter outlining your feelings and explain that you won’t be talking to them anymore. [3] X Research source Mail the letter to their house if you want to avoid seeing them."
    },
    {
      "title": "Delete their number from your phone.",
      "content": "Delete their number from your phone. This will stop you from being tempted to text or call the person during lonely moments. Simply go to their profile in your contact list and select “Delete Contact.” [4] X Research source If you feel hesitant to delete their number, remember that you are making space in your life for more positive and uplifting people."
    },
    {
      "title": "Block their profile on all your social media platforms.",
      "content": "Block their profile on all your social media platforms. This is a great way to stop yourself from communicating with someone and will also remove the regular reminders of that person from your newsfeed. Consider blocking them instead of unfollowing them, as this will stop them from contacting you in the future. [5] X Research source Don’t forget to block the person from all your different social media platforms. Consider your Facebook, Instagram, SnapChat, Pinterest, and WhatsApp."
    },
    {
      "title": "Avoid the person, when possible.",
      "content": "Avoid the person, when possible. This helps to give you some space while you heal from the difficult or unhealthy relationship. This isn't always possible, but try to make an effort to avoid them where you can. [6] X Research source For example, if the person always goes to the same coffee shop, consider going to a different coffee shop. If you live with the person, consider looking for somewhere else to live. You can decide to end the relationship. [7] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Focus your energy on other positive relationships. [8] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020."
    },
    {
      "title": "Write a short, direct, and kind response to end contact.",
      "content": "Write a short, direct, and kind response to end contact. It can feel a little awkward rejecting someone online; however, it is better to be clear about your feelings, rather than to ghost them and leave them confused. Simply write a short message thanking them for their time, explain that you’re not interested, and wish them the best. [9] X Research source For example, “Hi Hannah, thanks for your interest; however, I don’t see us having a romantic relationship in the future. You seem really kind and I wish you all the best!”."
    },
    {
      "title": "Make up an excuse if the person keeps responding to you.",
      "content": "Make up an excuse if the person keeps responding to you. The best option is always to be honest. However, if you feel uncomfortable, use a polite excuse to quickly end the conversation. Keep it brief and then avoid replying to any further responses. [10] X Research source For example, “Thanks for chatting, but I have recently met someone else” or “I’m taking a break from social media at the moment, as I have taken on extra hours at my job.”"
    },
    {
      "title": "Delete the person from your online platform.",
      "content": "Delete the person from your online platform. If the person continues to message you or you feel nervous that you might contact them during a weak moment, don’t feel shy to delete them. This is the most effective way to ensure that you don’t continue to talk to them. [11] X Research source To delete someone on Tinder, go to the person’s profile, click on the wheel in the top right corner, and then select “unmatch.”"
    }
  ]
}