{
  "url": "https://www.wikihow.com/What-Does-TBH-Mean",
  "title": "What Does TBH Mean? Snapchat, Texting, and More",
  "steps": [
    {
      "title": "TBH means \"to be honest.\"",
      "content": "TBH means \"to be honest.\" Someone will add “TBH” to their message if they’re sharing an honest opinion with you. [1] X Research source They might use it to share a bold compliment, candid feedback, or even an insult. \"TBH I think you’re super pretty.” \"TBH I thought that movie was overhyped.” \"I can't stand broccoli TBH. That's just me, though.\""
    },
    {
      "title": "On Snapchat, TBH also means “to be honest.”",
      "content": "On Snapchat, TBH also means “to be honest.” A person will add “TBH” to their Snapchat message if they’re revealing their honest thoughts about something or someone. Just like texting, the abbreviation can be used when messaging someone a compliment, a truthful (and potentially unpopular) opinion, and a mean remark. [2] X Research source \"I think you've got such cool style TBH.\" \"TBH I'm not a big fan of french fries. I prefer potato chips.\" \"TBH I'm so sick of this sunny weather. I need some rain!”"
    },
    {
      "title": "TBH means someone will share their opinion of you if you like their post.",
      "content": "TBH means someone will share their opinion of you if you like their post. Though TBH still stands for “to be honest” on Instagram, it holds a slightly different meaning if it's used as a noun. If you run across an Instagram post that reads “Like for a TBH,” it means they’ll share what they really think about you if you like their post. [3] X Research source To get even more details, someone might caption their post “Like for a TBH and rate.” This means the user will rate your attractiveness or personality on a scale from 1 to 10 if you like their post."
    },
    {
      "title": "Use the abbreviation when you're complimenting someone.",
      "content": "Use the abbreviation when you're complimenting someone. If you're just getting to know someone, you might be a little afraid to let them know how you really feel. Adding \"TBH\" to your Snapchat message or text can show the person that you're really putting yourself out there. [4] X Research source \"I think your art is amazing TBH. I really look up to you as an artist!\" \"TBH you're like the funniest person I've ever met.\" \"TBH I've always had a crush on you.\""
    },
    {
      "title": "Throw in \"TBH\" when you're sharing your honest point of view.",
      "content": "Throw in \"TBH\" when you're sharing your honest point of view. This abbreviation is a great choice when you're discussing your opinion on something or someone, whether it be a movie, artist, or political issue. If you think their perspective might be different or you're simply curious, ask the person you're messaging what they think as well. \"TBH I've always loved the comic book, but I wasn't a fan of the movie version.\" \"TBH I've never been able to get into that show, but I totally see why other people like it.\" \"I thought that homework assignment was really hard TBH. How did you feel about it?\""
    },
    {
      "title": "Opt for the abbreviation when you send a potentially insulting message.",
      "content": "Opt for the abbreviation when you send a potentially insulting message. If you feel super strongly about something, \"TBH\" can lessen the blow and show you're just being honest. Add the abbreviation to let this person know that you're sharing your true feelings, whether they like it or not. \"TBH I liked your first draft better.\" \"TBH he's a great player, but I don't think he's the best on the team.\" \"I hate the weather here TBH.\""
    },
    {
      "title": "Add \"TBH\" to your post if you want to share how you feel about people.",
      "content": "Add \"TBH\" to your post if you want to share how you feel about people. As a fun way to pass the time, encourage your followers to like your post for a TBH. It'll give you the opportunity to compliment people and share your sincere thoughts about them (good or bad). \"Like my post for a TBH! I'll be nice. 😊\" \"Like for a TBH! I'm feeling bold.\" \"Like for a TBH and rate if you're brave.\""
    },
    {
      "title": "Thank them if they sent you a compliment.",
      "content": "Thank them if they sent you a compliment. If someone messaged you something they like about you, let them know that you're grateful for their words. You can even send a compliment in return if you share fond feelings for them. \"Thanks so much. That's so sweet of you!\" \"Aw, thank you. That means so much to me.\" \"Thanks! I think you're pretty cute, too. 🥰\""
    },
    {
      "title": "Share your own opinion when someone gives you theirs.",
      "content": "Share your own opinion when someone gives you theirs. When someone messages you their critique or feedback about something, let them know if you agree or disagree. To avoid a heated conversation, word your message kindly and let them know you respect their opinion. [5] X Research source \"That's a super interesting critique! I actually thought the play was well-written.\" \"OMG I totally agree with you about this album. Seriously the best band I've heard in a while.\" \"I didn't enjoy that teacher's class, but I can see how other people would. I've just never been that good at math.\""
    },
    {
      "title": "Let them know you're offended if they insult you.",
      "content": "Let them know you're offended if they insult you. If someone sent you an insult on Snapchat or over text, respectfully share how their message made you feel. Though you might be tempted to insult them in return, it's best to word your message kindly to avoid making the situation worse. If you're not comfortable responding, simply ignore their message. \"That hurt my feelings.\" \"I'm kinda sad to hear that.\" \"I understand that's your opinion, but this message made me feel a little disrespected.\""
    },
    {
      "title": "Thank them for their compliment.",
      "content": "Thank them for their compliment. When someone sends you a kind message after you liked their post, tell them that it meant a lot to you. You might even send them a compliment in return to show your appreciation. \"Aw, thanks so much. That's good to hear.\" \"You're so nice! Thank you. 🙂\" \"I've always thought you were super cool, too.\""
    },
    {
      "title": "Let them know if you're hurt by their message.",
      "content": "Let them know if you're hurt by their message. Liking this person's Instagram post doesn't give them an excuse to be unkind. If someone sends you a hurtful TBH, tell them that their message hurt your feelings. To avoid drama, resist the urge to insult them back. Alternatively, you can also ignore their message. \"I'm a little hurt by this message.\" \"That's tough to hear, but you're entitled to your opinion.\" \"I'm disappointed that you feel that way.\""
    },
    {
      "title": "TBH sometimes means \"to be heard.\"",
      "content": "TBH sometimes means \"to be heard.\" Though it's less popular, sometimes people use \"TBH\" to reveal their desire for more people to listen to them. A person who uses \"TBH\" in this context may be upset that so few people are paying attention to them or might be calling for more people to care about a particular issue. \"My parents always side with my sister and it's so frustrating TBH.\" \"I wish more people were concerned about climate change #tbh\" \"I'm just venting, but I'm feeling so left out of my friend group right now TBH.\""
    }
  ]
}