{
  "url": "https://www.wikihow.com/Stretch-Your-Ears-Pain-Free",
  "title": "How to Stretch Your Ears Pain Free",
  "steps": [
    {
      "title": "Tug gently on your ears.",
      "content": "Tug gently on your ears. Before you make any decisions regarding the method you'll use to stretch your ears, consider how much you want to stretch them. If you're only moving up a size, the most pain-free option would be gently pulling your ears until they stretched out enough to accommodate new earrings. If you're looking to stretch your ears considerably, however, explore other options. [1] X Research source"
    },
    {
      "title": "Consider tapers.",
      "content": "Consider tapers. Tapering is the most common method to stretch out your ears. If done correctly, this method is relatively painless. Tapers are sets of rods that gradually increase in diameter. To stretch your ears, you would get a set of tapers, push the taper all the way through the hole, and replace it with a gauge the same size as the end of the taper. By the time you complete the set, your ears should be stretched as large as you want. [2] X Research source Never wear tapers as jewelry. This will make your ears heal unevenly because of uneven weight distribution. Some people use spiral gauges as tapers, they can be work for long periods of time and allow for longer stretching periods [3] X Research source"
    },
    {
      "title": "Try taping for gradual adjustments.",
      "content": "Try taping for gradual adjustments. If you want to stretch your ears slowly, consider taping. This allows you to gradually stretch your ears, which can reduce pain, but in smaller increments than you would use with tapers. To tape, use non-adhesive tape. Wrap this tape around the parts of your earrings entering your ear. Increase by one or two layers at a time until you've stretched your ears to your desired diameter. [4] X Research source Wash your earrings after taping to prevent infection. [5] X Research source"
    },
    {
      "title": "Avoid silicone and double flared jewelry.",
      "content": "Avoid silicone and double flared jewelry. You should not wear silicone plugs until your ears are fully stretched and healed. If used when stretching, silicone can tear the lining of the ears and potentially cause infection. Double flared jewelry as flares are sometimes large enough to cause pain and possible permanent damage to your ear. [6] X Research source"
    },
    {
      "title": "Don't stretch too fast.",
      "content": "Don't stretch too fast. Moving too fast through the stretching process is one of the biggest causes of pain. Regardless of your chosen method, wait until your ears have healed before stretching them further. Stretching too quickly can have serious consequences, such as a “blowout”, in which the inside of a stretched hole is forced out the back of the piercing as a result of too much pressure. This can result in permanent disfigurement and damage of the ear lobe. Another complication from advancing size too quickly or enlarging ear lobe beyond the remaining blood supply rim is that the skin edges will separate or tear. Surgery would be required to correct this. Advancing size too quickly increases risk of infections. How long you should wait between tapers or sizes varies. People heal at different rates, for one, and it also depends on how much you're stretching; however, it's recommended to give your ears at least a month to get used to one size before moving up. Only increase size in 1-millimeter increments (for example, from 1 mm to 2 mm). Never skip a size when stretching. If you don't feel a lot of pain, you may feel overeager and want to skip up to a higher size to speed up the process; however, this increases the chance of causing permanent damage to your ears. Even if you feel confident, skipping sizes is a bad idea."
    },
    {
      "title": "Stop if you feel pain.",
      "content": "Stop if you feel pain. Pain when sizing up is a sign something is wrong. If you have intense pain, resistance, or bleeding when inserting a new taper or adding another layer of tape, you should stop. Your ear is not fully healed and sizing up now could cause damage. Stay at your current size and wait a week before attempting to size up."
    },
    {
      "title": "Stretch your ears at different speeds, if necessary.",
      "content": "Stretch your ears at different speeds, if necessary. While it may look and feel awkward, your ears may heal at different rates. If one ear is taking slightly longer, there's no medical reason why you can't stretch your ears at different rates. In fact, if one ear is more tender than the other it's better to slow down for the sake of avoiding damage."
    },
    {
      "title": "Massage with oil regularly.",
      "content": "Massage with oil regularly. Once your ears are stretched to your desired diameter, some tingling and soreness is common. You can help lessen pain by massaging your ears regularly. Wait a few days after the initial stretching before massaging to avoid infection. Use a small amount of your chosen massage oil, which you can buy online or at a local beauty shop, and gently rub into your ears. Do this on a regular basis, a few times a day, until discomfort passes. This helps increase blood flow which can promote healing."
    },
    {
      "title": "Use saline solution.",
      "content": "Use saline solution. Saline solution, which can be purchased at most drug stores, can also help soothe ears after stretching. Use such foams or sprays sparingly, and only once or twice daily. If you notice any side effects, like increased soreness, cease use. You can make your own saline solution by combining 1/8 teaspoon of salt to a cup of warm water. Rubbing alcohol and hydrogen peroxide should be avoided on a healing ear."
    },
    {
      "title": "Downsize immediately in the event of bleeding or significant pain.",
      "content": "Downsize immediately in the event of bleeding or significant pain. If you have pain or bleeding after sizing up, downsize immediately. Pain or bleeding in your ears is a sign something is wrong. It will not, like soreness or tingling, pass over on its own. You should move down a size in tapers or taping. If the soreness and bleeding persists, contact a doctor for evaluation."
    },
    {
      "title": "Resume wearing jewelry a few weeks after stretching.",
      "content": "Resume wearing jewelry a few weeks after stretching. After you've stretched your ears to the desired diameter, wait a few weeks. If you do not have any trouble like soreness or bleeding, you can resume wearing jewelry. For the first few weeks, stick to jewelry made from silicone or organic materials. If you don't have any trouble with such materials, you can move on to double flared jewelry."
    }
  ]
}