{
  "url": "https://www.wikihow.com/Tune-an-Acoustic-Guitar",
  "title": "How to Tune an Acoustic Guitar",
  "steps": [
    {
      "title": "Know the correct notes for each string.",
      "content": "Know the correct notes for each string. It'll be hard to tune the guitar without knowing the proper notes for each string. Starting with the lowest, thickest string (which should be the closest to the ceiling when you're holding the guitar properly) the standard tuning for the strings is, from low to high: [1] X Research source E A D G B E (thinnest string)"
    },
    {
      "title": "Identify the correct tuning pegs for each string.",
      "content": "Identify the correct tuning pegs for each string. Follow each string up to the corresponding tuning peg to make sure you know which peg to turn to tune each string, and which direction. Before you consult a tuner, pluck the string a few times and turn the peg to make it go up (clockwise) and make it go down (counterclockwise). [2] X Research source Depending on the guitar and how it was strung, the direction might be different. This is why it's important to check first. However, all professional stringing will be in this direction, since it helps keep the strings in tune."
    },
    {
      "title": "Pluck each string individually and turn the peg to match it to the correct pitch.",
      "content": "Pluck each string individually and turn the peg to match it to the correct pitch. If you're using an electric tuner, turn it on and hold it close enough to the guitar so it can pick up enough sound. Pluck the string repeatedly and turn the tuning peg until it matches the pitch as closely as possible. If you're sharp (too high) lower the note by turning the tuning peg to loosen it, making it lower, until you get it to the proper pitch. If you're flat (too low) then you need to raise the note by turning it smoothly up, creating tension on the string and making the note higher. Keep turning it until you reach the proper pitch. You can also match the guitar to itself, to a piano, or any other instrument to match the pitch. If you're playing with a trumpet player, for example, ask for an E and adjust the tuning of the 6th string until you've matched the pitch."
    },
    {
      "title": "Use the 5th fret of a string to match the sound of the string immediately below.",
      "content": "Use the 5th fret of a string to match the sound of the string immediately below. The 6th string, 5th fret note should be identical to the 5th string played openly -- they are both As. This system insures that the intervals between notes are identical, so that even if the guitar is not perfectly tuned, it is tuned relative to itself. To tune the 5th string, for example, you would play the 6th string, 5th fret note and match the tone of the 5th string exactly to this. [3] X Research source The only exception is on the B string. You must hold the 4th fret of the G string (3rd string) to tune the B string."
    },
    {
      "title": "Strum a chord or play a few notes to check the intervals.",
      "content": "Strum a chord or play a few notes to check the intervals. An acoustic guitar is made of wood, and the resonance of the strings, even when tuned properly, might not sound exactly right. Play a G chord, or another first-position chord to check to make sure the guitar sounds correct and is in tune. Make slight adjustments as necessary. [4] X Expert Source Aaron Asghari Professional Guitarist & Instructor Expert Interview. 15 February 2019. The B string, in particular, will usually need to be tuned slightly flat to create a truly perfectly-tuned guitar. Experiment some and listen closely to make sure the guitar is in tune."
    },
    {
      "title": "Play and retune your guitar for 15-20 minutes after putting on new strings.",
      "content": "Play and retune your guitar for 15-20 minutes after putting on new strings. Strings need time to stretch out when first placed, meaning they fall out of tune very quickly. To help get them in shape, tune the guitar, then play for a few minutes. Retune and repeat, playing until the strings stay more or less in tune for a few minutes straight. [5] X Research source"
    },
    {
      "title": "Invest in a quality chromatic guitar tuner.",
      "content": "Invest in a quality chromatic guitar tuner. The easiest and most accurate way to tune your guitar properly is to use an electronic guitar tuner that reads your tone, usually provides a visual gauge of how on or off of pitch you are, and tells you which direction you need to tune. It does everything but turn the pegs for you. These tuners range in price and quality from cheap to somewhat fancier acoustic tuners that can be fairly expensive. To get started, get a cheap one in your price range, or research free online options."
    },
    {
      "title": "Tune up, don't tune down, whenever possible.",
      "content": "Tune up, don't tune down, whenever possible. It's important on all acoustic stringed instruments, especially acoustic guitars, to tune from flat to sharp, rather than tuning from sharp to flat. You're more likely to slip out of tune if the tension on the string is going down (as it will when you tune sharp-to-flat), so it's better to create the correct directional tension on the string by tuning up, instead of tuning down. Even if the string is sharp (which it usually won't be), tune it down lower than it should be first and then tune it up to the correct pitch."
    },
    {
      "title": "Use fresh strings.",
      "content": "Use fresh strings. Old worn-out strings won't stay in tune as easily. If you're having to constantly re-tune, or your strings are getting a little raggedy, consider changing the strings of your guitar to fresher strings that'll stay in tune while you play. The guitar will sound better and will be a lot more fun to practice on if you've got fresh strings on it. [6] X Research source"
    },
    {
      "title": "Let the wood settle.",
      "content": "Let the wood settle. Get the strings in the neighborhood and then fine-tune more accurately, especially if you're putting on new strings. The strings put a lot of tension (hundreds of pounds of pressure) on the frame of the guitar, and acoustic guitars are very susceptible to a bit of shifting and settling, especially older bodies and different varieties of wood. Don't get frustrated if you tune the guitar perfectly and it slips out a few minutes later. This is normal. Tug on the strings some as you tune to get the extra slack out and let it sit a few minutes, then check it again."
    },
    {
      "title": "Use your eyes and your ears.",
      "content": "Use your eyes and your ears. While it's important to tune accurately and give the electric tuner its due credit, it's also important to learn to really hear the strings and learn to distinguish when something's a little off. Experienced guitar players don't have to have perfect pitch or consult their tuner to know when something's a little off. Listen to the notes as you tune and you'll be able to tune more accurately. [7] X Expert Source Aaron Asghari Professional Guitarist & Instructor Expert Interview. 15 February 2019."
    },
    {
      "title": "Tune the guitar to a piano.",
      "content": "Tune the guitar to a piano. If you've got a well-tuned and maintained piano or keyboard handy and are familiar with the notes, one easy way to quickly tune your guitar is to play each note and match the pitch of the corresponding string."
    },
    {
      "title": "Look for free online tuners and apps.",
      "content": "Look for free online tuners and apps. Lots of tone-generating devices and e-tuners are available that you can use quickly and in a pinch to get your guitar in tune. One of the most effective tuners available is the basic tuner available in the Apple app store. It's super cheap and super accurate. As long as your phone has juice in it, you can tune your guitar."
    },
    {
      "title": "Tune the guitar to itself harmonically",
      "content": "Tune the guitar to itself harmonically . You might not be able to get a guitar in perfect pitch, but you can at least make sure the guitar is tuned to itself appropriately by matching the intervals of all the strings. When you fret the low E string at the fifth fret, that's an A. So, to tune the guitar, you can play an A on the E string and tune your A string. This is a good way of checking the relationships between all the strings after you've consulted an electronic tuner, or just getting the guitar in tune with itself so you can play alone or practice. [8] X Research source This is true of the relationships between all the strings but G and B. For that interval, fret the G string at the fourth fret, which should be a B."
    },
    {
      "title": "Use alternate tunings on an acoustic guitar",
      "content": "Use alternate tunings on an acoustic guitar . You don't always have to tune your strings the same old way. Famous guitar players like Jimmy Page, Keith Richards, and John Fahey frequently used alternate tunings to play their best-known songs, and alternate tunings are great for playing Delta blues or slide guitar styles. Some guitar players like to tune the bottom string to D, rather than E, making it easier to play certain chords and some styles of music. This is called Drop-D tuning . Other common alternate tunings include: [9] X Research source Irish tuning (DADGAD) Open C tuning (CGCGCE) Open D tuning (DADF#AD Open G tuning (DGDGBD)"
    }
  ]
}