{
  "url": "https://www.wikihow.com/Treat-Diarrhea-in-Hamsters",
  "title": "How to Treat Diarrhea in Hamsters",
  "steps": [
    {
      "title": "Stop feeding your hamster fresh vegetables.",
      "content": "Stop feeding your hamster fresh vegetables. In small quantities, fresh vegetables are part of a healthy, balanced hamster diet . They are very nutritious and have extra moisture that keeps hamsters well hydrated. Eating too many vegetables, though, can cause diarrhea because of too much moisture. To help stop your hamster's diarrhea, take fresh vegetables out of its diet. Feed your hamster only dry food (hamster pellets). [1] X Research source Hamster pellets are very nutritious, so you don’t have to worry about your hamster not getting enough nutrients when it eats only dry food."
    },
    {
      "title": "Give your hamster fresh water.",
      "content": "Give your hamster fresh water. Like people, hamsters become dehydrated if they have diarrhea. Make sure your hamster has plenty of fresh, cool water to drink so it can rehydrate itself. [2] X Research source If you notice your hamster isn’t drinking its water, give it water by hand: [3] X Research source Fill a small eye dropper with cool water. Holding your hamster, put the eyedropper in the corner of its mouth. Squeeze a few drops of water at a time into your hamster’s mouth. Talk with your vet about how often you should give your hamster water by hand."
    },
    {
      "title": "Consider feeding your hamster raspberry bush leaves or arrowroot.",
      "content": "Consider feeding your hamster raspberry bush leaves or arrowroot. Raspberry bush leaves and arrowroot can help a hamster recover from diarrhea. Talk with your vet before feeding either of these items to your hamster. Your vet can advise you on how much of these items to give your hamster to treat the diarrhea."
    },
    {
      "title": "Reintroduce vegetables after the diarrhea stops.",
      "content": "Reintroduce vegetables after the diarrhea stops. After a day or two without vegetables, your hamster’s diarrhea should stop. Don’t start refeeding vegetables right away, though. To allow your hamster to fully recover, wait one to two weeks before adding vegetables back to the diet. When you feed your hamster vegetables, make the portion size equal to a few raisins. Feed the vegetables once a day."
    },
    {
      "title": "Watch for improvement.",
      "content": "Watch for improvement. With normal cases of hamster diarrhea, the hamster will look otherwise healthy (no hunching over or loss of appetite) and be completely healthy again after a few days of eating a dry food-only diet. [4] X Research source However, with more severe diarrhea, a hamster will not improve after a day or two. In fact, the diarrhea may get worse and the hamster may look sicker (dull and sunken eyes, ruffled coat, weight loss). Severe diarrhea is a symptom of Wet Tail , which causes serious illness in hamsters. If your hamster is not getting better, take it to your vet right away for further treatment."
    },
    {
      "title": "Keep your hamster’s cage warm.",
      "content": "Keep your hamster’s cage warm. While you treat your hamster for diarrhea, make sure its cage stays warm (70‒85 degrees Fahrenheit/21‒29 degrees Celsius). [5] X Research source Normal room temperature is around 72 degrees Fahrenheit (22 degrees Celsius), so keep your hamster’s cage in a non-drafty room that’s at room temperature. You could also place a heating pad (available pet stores) under the cage using these suggestions: Place the heating pad under a small portion of the cage so your hamster can move away from the heat when it wants to. After the heating pad has been on for a while, touch the bedding to see if it is warming up. Do not use a human heating pad, since these pads automatically shut off and can leave your hamster feeling cold."
    },
    {
      "title": "Clean",
      "content": "Clean your hamster’s cage. This is important if your hamster has severe diarrhea from Wet Tail. A dirty cage can have a buildup of bacteria or other harmful organisms. [6] X Research source Cleaning the cage will remove disease-causing organisms. Below are cleaning suggestions: [7] X Research source Each day, clean the food bowl and water bottle with hot soap and water. Refill the food and water. Change out the bedding weekly. Leave a small section of old bedding in the cage so your hamster recognizes its scent on the bedding. Once a week, remove everything from the cage. Clean and disinfect the cage and plastic toys."
    },
    {
      "title": "Remove uneaten food.",
      "content": "Remove uneaten food. Each day, check your hamster’s cage for uneaten food. Remove and discard this food. If you leave the food in the cage, it could spoil and become an easy place for bacteria and mold to grow. Bacteria and mold could make your hamster very sick."
    }
  ]
}