{
  "url": "https://www.wikihow.com/Types-of-Empaths",
  "title": "A Guide to Each Type of Empath: Traits, Signs, & More",
  "steps": [
    {
      "title": "Emotional empaths feel other people’s feelings deeply.",
      "content": "Emotional empaths feel other people’s feelings deeply. While all people possess empathy (the ability to put ourselves in someone else’s shoes), emotional empaths take this compassion and understanding to another level. They feel other people’s pain, joy, and fear right alongside them, even if those feelings don’t affect them directly. Sometimes, they even take on other people’s behaviors (intentionally or unintentionally) to connect with them on a more emotional level. Signs you’re an emotional empath: caring deeply about everyone (even strangers), struggling to set boundaries to distinguish your feelings from others, a need for lots of alone time to recharge your social battery, wondering where your feelings end and others begin."
    },
    {
      "title": "Physical empaths take on other people’s bodily symptoms.",
      "content": "Physical empaths take on other people’s bodily symptoms. While emotional empaths absorb other people’s feelings on a psychological level, some people believe physical empaths can actually experience them in their anatomy. Anger and stress can drain them or easily make them unwell and they’re likely to become ill if people they love get sick too (even if they’re not contagious). Likewise, their heart rates rise and they feel refreshed when the people around them are in good moods. [1] X Research source Signs you’re a physical empath: being highly sensitive to smells or touch, feeling uneasy or tired in most crowds, being overwhelmed by physical intimacy, having a history of getting sick more than 5 times a year, being perceived as a “hypochondriac.”"
    },
    {
      "title": "Intuitive empaths can pick up on others’ feelings before they do.",
      "content": "Intuitive empaths can pick up on others’ feelings before they do. Intuitive empaths are the most unique and highly-debated type of empath. It’s said that have an almost sixth sense of the energies of those around them. They can sense other people’s feelings before they’re outwardly expressed (and often before they’re even recognized). There are several types of intuitive empaths that each specialize in unique energies and experiences—from repressed desires to plants. Signs you’re an intuitive empath: strong intuition, trouble fitting in, a unique worldview, intensive creative spells, excellent problem-solving skills, a photographic memory."
    },
    {
      "title": "Claircognizant empaths can read people’s thoughts.",
      "content": "Claircognizant empaths can read people’s thoughts. Sometimes through physical cues, sometimes through an unexplainable, almost supernatural intuition, claircognizants always seem to know what people are thinking (even before they do). They’re very spiritual and can tell when people are lying or hiding something almost immediately. Some people believe that claircognizants have psychic or telekinetic powers (though many scientists debate this). [2] X Research source Signs you’re a claircognizant empath: strong intuition, an ability to easily tell when people are lying"
    },
    {
      "title": "Plant/animal empaths feel like one with flora and fauna.",
      "content": "Plant/animal empaths feel like one with flora and fauna. They have a natural green thumb since they’re easily able to sense the needs and feelings of plants and flowers. They’re also animal lovers, and can sometimes adopt the feelings and personalities of their pets (and vice versa). [3] X Research source Signs you’re a plant/animal empath: feeling recharged any time you’re in nature, connecting more with animals than humans, a love of the outdoors, a (almost inexplicably) strong connection to the Earth’s environment."
    },
    {
      "title": "Earth empaths have powerful intuitions about the universe.",
      "content": "Earth empaths have powerful intuitions about the universe. While their name sounds similar to plant empaths, Earth empaths experience strong feelings and premonitions about the universe on a wider scale. Their energy (and even their physical health) shifts whenever there’s a natural disaster, and they’re often very well-versed on the planets in our solar system. [4] X Research source Signs you’re an Earth empath: illness whenever the weather changes, a feeling like an earthquake or storm is coming right before it happens, a deep connection to astrology/the planets."
    },
    {
      "title": "Dream empaths use dreams to connect with people.",
      "content": "Dream empaths use dreams to connect with people. They have an exceptional ability to remember and interpret our dreams and their own. While most of us consider the visions while we sleep indecipherable jargon, dream empaths see them as blueprints to living a better life. They may even connect emotionally and experience the physical symptoms of characters in our/their dreams while they’re lucid. [5] X Research source Signs you’re a dream empath: recurring dreams, the ability to remember dreams clearly, a fascination/skill with hypnosis/the human subconscious."
    },
    {
      "title": "Psychometric empaths get visceral feelings from objects.",
      "content": "Psychometric empaths get visceral feelings from objects. Most of us may feel a sense of love, pain, or nostalgia from pictures of people we care about, but psychometric empaths take it a step further. They feel strong emotions from heirlooms they have no connection to and can have visceral reactions to objects or locations they’ve never seen before. [6] X Research source Signs you’re a psychometric empath: the ability to feel connected to someone through just an heirloom, having a hard time selling/giving objects away, a preference for small towns (big cities feel too overwhelming)."
    },
    {
      "title": "Precognitive empaths can easily predict future scenarios.",
      "content": "Precognitive empaths can easily predict future scenarios. They have a sense of what’s going to happen next well before everyone else in the room. Maybe they have some special supernatural intuition; maybe their logic and reasoning skills are just off the charts. Regardless, their predictions about situations to come are almost always spot on. [7] X Research source Signs you’re a precognitive empath: a sense of dread before bad events happen, a constant feeling of déjà vu, success at prediction-based games (roulette, Powerball, horse racing)."
    },
    {
      "title": "Indigo empaths can easily get a read on people’s morals.",
      "content": "Indigo empaths can easily get a read on people’s morals. They have great assessments of who to trust and who not to. They also experience strong feelings (or even physical symptoms) whenever a nearby person has to compromise their code of ethics or do something they don’t agree with at their core. [8] X Research source Signs you’re an indigo empath: an easy ability to sense when someone is lying, getting “good vibes” or “bad vibes” from people right after meeting them, feeling sick to your stomach anytime you see an act that violates your values (either on TV or in-person)."
    },
    {
      "title": "Heyokas challenge people’s senses of self and reality.",
      "content": "Heyokas challenge people’s senses of self and reality. Rooted in Native American folklore, heyokas are spiritual agents of chaos that provide people a mirror for their own desires and values. Unlike traditional empaths, who bond and connect through shared experience, heyokas provoke and present ideas that are meant to make people feel gross or uncomfortable. By doing so, the people they interact with learn more about themselves and what matters to them. [9] X Research source For example, a heyoka may make ignorant, mean-spirited comments in the workplace to remind others to stand up against intolerance and show them what they’ll become if they don’t. It’s impossible to consciously deem yourself a heyoka. However, traits of heyokas in your life include contrarians, creatives, non-conformists, and other people who march to the beat of their own drum."
    },
    {
      "title": "Set clear boundaries and stick to them.",
      "content": "Set clear boundaries and stick to them. Regardless of what type of empath you are, sensing and feeling so many energies all the time can be overwhelming and bad for your health. Remember to regularly establish firm boundaries with those around you and communicate when something makes you feel uncomfortable or overstimulated (even if nobody else feels that way). [10] X Research source For example, if you’re indigo and someone wants to tell you a risque story or complain about corruption in your area, you might say “I don’t think I can handle a story like that right now. I’d love to talk to you about something else, though!"
    },
    {
      "title": "Use positive affirmations to build optimism and self-esteem.",
      "content": "Use positive affirmations to build optimism and self-esteem. Manifest positive energy by stating something you’re grateful for or giving yourself a compliment each day. Your comment may be something to remind you who you are, outside of your feelings for others, like “I am strong and capable.” You could also state an affirmation to protect you from negative energies like “It is not my responsibility to feel for others.” [11] X Research source It can help to close your eyes and visualize a shield around you, protecting you from being overwhelmed by empathy, any time you make your affirmations."
    },
    {
      "title": "Take frequent breaks to recharge your social and emotional battery.",
      "content": "Take frequent breaks to recharge your social and emotional battery. If you’re feeling overwhelmed, excuse yourself for 5-10 minutes and do something that makes you feel good, just you. It can be taking a short walk in nature, listening to calming music, or even looking at memes on your phone to make you laugh. [12] X Research source Experts suggest taking a break from work, school, or social situations every hour or so for 5-10 minutes."
    },
    {
      "title": "Practice mindfulness techniques to build self-awareness.",
      "content": "Practice mindfulness techniques to build self-awareness. If you experience empath triggers regularly , you can get so lost in other people’s feelings and experiences, you forget who you are and what you want. Practice mindfulness (being aware of yourself and your surroundings) by yourself for a few minutes every day to get in touch with your thoughts and feelings. [13] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Common mindfulness activities include meditating, journaling, or just sitting in a still, quiet area and letting your mind wander. Not only does mindfulness increase self-awareness, but research also shows it increases empathy which can help you grow as an empath. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Get a pet if you’re feeling lonely.",
      "content": "Get a pet if you’re feeling lonely. It’s normal to isolate yourself and spend some time alone when human energies feel too overwhelming. To keep yourself company while you spend time alone and recharge, consider getting a pet like a dog or a cat. Having an animal will allow you to connect emotionally with another being without feeling the same pressures or responsibilities. [15] X Research source If you’re an animal empath, a pet may be too overstimulating. Consider getting a plant or a pet with less energy and emotional engagement (a fish, a snail, a snake) so you can replenish."
    },
    {
      "title": "Surround yourself with positive energies.",
      "content": "Surround yourself with positive energies. Establish a close circle of optimistic friends who make you laugh and feel joy. Spend time with them any time you feel yourself taking on the negative feelings or symptoms of someone/something else. In addition, try and make a habit of saying “This is a nice moment” any time you notice one. Consider creating a gratitude list and write on it at the end of each day to remind yourself of all the positivity around you."
    },
    {
      "title": "Find a creative outlet for all your feelings.",
      "content": "Find a creative outlet for all your feelings. Art is a great way for you to deal with all that empathy you keep bottled up. As an empath, you’re likely already drawn to creative hobbies. Make it a habit to engage in music, photography, dance, writing, or some other self-expression regularly so you have a constructive way to work through your emotions."
    },
    {
      "title": "Most empaths are empathetic in multiple ways.",
      "content": "Most empaths are empathetic in multiple ways. We’re all multifaceted and, if you can pick up on one type of energy, odds are you can pick up on several. In fact, most empaths share several common traits including a strong intuition, a fairly rigid moral compass, intense creativity, a feeling of comfort in nature, and a unique worldview. [16] X Research source"
    },
    {
      "title": "While empathy is real, the term ‘empath’ is debated among scientists.",
      "content": "While empathy is real, the term ‘empath’ is debated among scientists. Experts recognize that empathy is a very real phenomenon that all humans experience. We all have compassion and may even have physical reactions when others experience strong emotions. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source However, there is no scientific evidence that “empaths” (people with a sixth sense/supernatural sense of empathy), especially the various subtypes of intuitive empaths, are real. [18] X Research source Even if you can’t confirm you’re an “empath by science,” all people can be drained from empathic feelings and experiences and should practice self-care accordingly. We all may also have intuitions that can feel powerfully empathic."
    }
  ]
}