{
  "url": "https://www.wikihow.com/Use-the-Telephone",
  "title": "How to Make & Answer a Phone Call",
  "steps": [
    {
      "title": "Mute or turn off the television before attempting to use the phone.",
      "content": "Mute or turn off the television before attempting to use the phone. Most background noise is detrimental to the call and will prevent the person on the other end from hearing you clearly. This wikiHow article focuses more on the etiquette side of making a phone call; read this wikiHow article for the more step-by-step approach."
    },
    {
      "title": "Pick up the receiver and dial the number you want to reach.",
      "content": "Pick up the receiver and dial the number you want to reach. Most home phones are all-in-one, meaning they aren't like office phones that have a separate receiver and dial pad. The number you're trying to reach may require some additional input from you. For example, if you're calling a different country , you have to add the country number to the beginning of the call. If you don't get an answer within the first few rings, allow the line to ring at least five times before hanging up. This gives the other party enough time to finish (or interrupt) whatever they may be doing and come to the phone. If you called just to chat, hang up at five rings, otherwise it may get bothersome to the other party. If you want to leave a voicemail, stay on the line. Note that the person you're calling may be able to send your call to voicemail by pressing a button (such as the volume down or hang up button, depending on their phone model) if they aren't able to answer."
    },
    {
      "title": "If possible, ask anyone you call if it is a good time to be calling.",
      "content": "If possible, ask anyone you call if it is a good time to be calling. Do not simply launch into a monologue without checking to see whether the other person is busy."
    },
    {
      "title": "State the purpose of the call.",
      "content": "State the purpose of the call. You want to make sure the other person knows why you're calling early in the conversation. If you're not calling family or friends, introduce yourself; you don't want to assume every person or business you call has caller ID and knows who you are. If you're calling as a business, read this wikiHow article for tips on making effective business calls."
    },
    {
      "title": "Thank the other person before you finish the call.",
      "content": "Thank the other person before you finish the call. Some phones will end the call when you hang up the phone receiver, but others require you to press an \"End Call\" button on the phone, which usually is red and looks like a phone hanging up."
    },
    {
      "title": "Use an appropriate greeting.",
      "content": "Use an appropriate greeting. This changes depending on whether you're using the phone professionally or personally. Professionally Use an approved company greeting when answering a business call. Do not just say \"Hi,\" as some callers will consider this unprofessional. For example, many businesses use \"Hello, it's Jane from BusinessExample. How can I help you?\" A tip is to smile when you answer the phone; even though the caller on the other end doesn't see your smile, they will hear it. Personally Say \"Hello\" or however you greet people in a formal manner. If the caller ID shows someone you know, you can use a more casual greeting, like \"Hey\"."
    },
    {
      "title": "Listen to the caller's intent and respond appropriately.",
      "content": "Listen to the caller's intent and respond appropriately. After the greeting, the caller should continue with pleasantries or get to the point of the call. They called you with a specific reason in mind, and you should wait for them to mention it. In a professional setting, it's best to repeat their question as a sentence to make sure that you heard the caller's concern correctly. When you answer their question, speak clearly without mumbling and without speaking too quickly so you sound confident in your reply."
    },
    {
      "title": "Thank the other person before you finish the call.",
      "content": "Thank the other person before you finish the call. Once you hear the reason for the phone call, you can address it and end the call. If you're in a professional setting, there might be more steps you need to take before you can end the call, like making sure the caller is satisfied and doesn't have any more questions. Some phones will end the call when you hang up the phone receiver, but others require you to press an \"End Call\" button on the phone, which usually is red and looks like a phone hanging up."
    }
  ]
}