{
  "url": "https://www.wikihow.com/Use-Puppy-Pads-and-Outdoor-Potty-Training-Together",
  "title": "How to Use Puppy Pads and Outdoor Potty Training Together",
  "steps": [
    {
      "title": "Follow a 24-hour schedule.",
      "content": "Follow a 24-hour schedule. In order to house train your dog, you need to strictly follow a schedule. This will establish a routine for both you and your dog. Your dog needs to go out first thing in the morning, after meals and play times, and before bedtime. [1] X Expert Source Colleen Demling-Riley, CPDT-KA, CBCC-KA, CDBC Canine Behavior Consultant Expert Interview. 25 March 2022. Every moment should be accounted for. The schedule will vary depending on your dog's age — figure your dog can hold their bladder for one hour for each month of age, plus one hour. So a two-month-old pup can wait three hours max; a three-month-old pup can wait four hours max, and so on. This is a sample schedule for someone who is home all day and a dog who is about three months old: 7:00 a.m.: Wake up and take dog to the toileting area 7:30 a.m.: Feed (puppy should always have access to water during the day) 7:45 a.m.: Toilet area (Always after eating/drinking/napping/playtime) 8:00 a.m.: Supervised free time 8:45 a.m.: Crate confinement 10:45 a.m.: Toilet area 11:00 a.m.: Supervised free time 12:30 p.m.: Feed 12:45 p.m.: Toilet area (Always after eating/drinking/napping/playtime) 1:00 p.m.: Supervised free time 1:45 p.m.: Crate confinement 3:45 p.m.: Toilet area 4:00 p.m.: Supervised free time 6:00 p.m.: Feed 6:15 p.m: Toilet area 6:30 p.m.: Supervised free time 9:00 p.m.: Remove water 9:15 p.m.: Supervised free time 11:00 p.m.: Toilet area and crate confinement overnight"
    },
    {
      "title": "Choose a designated spot for indoor toileting.",
      "content": "Choose a designated spot for indoor toileting. Select a place in your house that is suitable for your dog’s toileting. Ideally, this is a place with easy-to-clean floors such as a bathroom or kitchen area. Place a puppy pad here. [2] X Expert Source Colleen Demling-Riley, CPDT-KA, CBCC-KA, CDBC Canine Behavior Consultant Expert Interview. 25 March 2022. You need to be the one to choose the toilet spot. You need to be okay with its location when it’s indoors. For example, you might not want to put a puppy pad in your kitchen if you don’t want to have dog poo and pee near where you cook and eat. [3] X Research source Use consistent language to refer to this place. For example, when your dog reaches this spot, say, “Go potty,” or use a similar verbal cue. Then your dog will associate this spot with toileting."
    },
    {
      "title": "Take your dog to the potty spot.",
      "content": "Take your dog to the potty spot. At a scheduled potty time, or when you recognize your dog’s cues for needing to relieve himself, take him to the puppy pad. [4] X Expert Source Colleen Demling-Riley, CPDT-KA, CBCC-KA, CDBC Canine Behavior Consultant Expert Interview. 25 March 2022. You might want to take him on a leash, even if he’s inside. This will get him used to the leash, which you may need when you start your outdoor potty training."
    },
    {
      "title": "Change the puppy pad frequently.",
      "content": "Change the puppy pad frequently. Make sure to clean up after your dog relieves himself. Dogs will want to relieve themselves where they smell their urine, so you should leave a used puppy pad with a bit of urine underneath a clean puppy pad. Remove all feces from the area after the dog relieves himself. [5] X Research source"
    },
    {
      "title": "Learn your dog’s signs.",
      "content": "Learn your dog’s signs. Pay close attention to your dog so that you learn when he has to go. [6] X Expert Source Colleen Demling-Riley, CPDT-KA, CBCC-KA, CDBC Canine Behavior Consultant Expert Interview. 25 March 2022. This might include the dog walking around stiffly or in circles, sniffing the floor like he’s searching for somewhere to pee, or letting his tail rest in a strange position. If your dog looks like he needs to relieve himself, take him out to his designated spot right away. Do this even if you’re not at your scheduled potty break. [7] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Keep a close eye on your dog at all times.",
      "content": "Keep a close eye on your dog at all times. You need to keep a vigilant eye on your dog whenever he is out of his crate. Even if he’s in the kitchen during his free time, you still need to watch him. This will ensure that you catch him before he has an accident. It’s imperative during this time that your dog associates toileting with going to his puppy pad. You might consider tethering your dog to your waist with a leash when he is out of his crate. This way, you will be sure to keep him very close to you. You can track his movements more closely. [8] X Research source"
    },
    {
      "title": "Clean up accidents immediately.",
      "content": "Clean up accidents immediately. If your dog has an accident in the house, clean it up as soon as possible. You don’t want your dog relieving himself anywhere but on the puppy pad. Don’t use an ammonia-based cleaner. Urine has ammonia in it, so your dog might associate the cleaner’s smell with urinating. Instead, use an enzymatic cleaner on soiled areas. [9] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Don’t punish your dog for having an accident."
    },
    {
      "title": "Start moving the puppy pad towards the door.",
      "content": "Start moving the puppy pad towards the door. Your goal is to get your dog out the door when he needs to relieve himself. When your dog can consistently use the puppy pad area, then you can start integrating outdoor training into the mix. Move the puppy pad a little closer to the door every day. Do this incrementally, moving it a few feet every day. Praise the dog every time he uses the puppy pad. Give him a pat and use a friendly voice. If your dog is having accidents after you’ve moved the pad, you may be moving too quickly. Move the pad back and wait another day before moving it again."
    },
    {
      "title": "Move the pad to just outside the door.",
      "content": "Move the pad to just outside the door. Once your dog is successfully using the pad in the location where you’ve moved it, you should start getting him used to toileting outside. [10] X Expert Source Colleen Demling-Riley, CPDT-KA, CBCC-KA, CDBC Canine Behavior Consultant Expert Interview. 25 March 2022. He will get used to being out in the fresh air when relieving himself, even if it’s still on the puppy pad."
    },
    {
      "title": "Place the pad near the outdoor toilet area.",
      "content": "Place the pad near the outdoor toilet area. Plan a space where you would like your dog to relieve himself. This might be a patch of grass or near the base of a tree. When your dog needs to go out, bring a pad with you so that your dog will associate the outdoor place with the pad. [11] X Expert Source Colleen Demling-Riley, CPDT-KA, CBCC-KA, CDBC Canine Behavior Consultant Expert Interview. 25 March 2022."
    },
    {
      "title": "Remove the pad altogether.",
      "content": "Remove the pad altogether. Once your dog is using the pad outside, you can stop setting out the pad for him. He will use the outdoor patch instead."
    },
    {
      "title": "Add another puppy pad in the indoor toileting area.",
      "content": "Add another puppy pad in the indoor toileting area. If you want your dog to have the option of relieving himself indoors or outdoors, then you can set up the toileting area inside again."
    },
    {
      "title": "Alternate between the indoor and outdoor potty spots.",
      "content": "Alternate between the indoor and outdoor potty spots. Keep your dog familiar with both the indoor and outdoor potty spots by taking him to each one. Alternate between both for a couple of weeks so that he is accustomed to using both."
    },
    {
      "title": "Give lots of praise.",
      "content": "Give lots of praise. When your dog has relieved himself, either indoors or outdoors, give him lots of attention and pats. Say, “Good dog!” and other praise. Have a little celebration with your dog. This lets your dog know that its behavior is remarkable and deserves praise. [12] X Research source"
    },
    {
      "title": "Make sure to time your praise appropriately.",
      "content": "Make sure to time your praise appropriately. When your dog has finished relieving himself, give him praise right away. You want to be sure that he associates the praise with the action that he just did. Otherwise, he might get confused about what he’s being praised for."
    },
    {
      "title": "Keep your voice friendly.",
      "content": "Keep your voice friendly. Don’t use a harsh tone with your dog while you’re house training him. You don’t want him to feel scared or anxious about going outside or relieving himself. Don’t yell at your dog if he has an accident."
    },
    {
      "title": "Don’t punish your dog for accidents.",
      "content": "Don’t punish your dog for accidents. Your dog is learning how to follow your instructions. Be patient with him. Don’t rub his face in his waste. [13] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Don’t yell or shout at your dog. Don’t hit your dog. If you’re not patient and friendly, your dog may associate fear and punishment with toileting. If you catch your dog in the middle of an accident, make a loud noise or clap to startle him. Then he will stop urinating or defecating, and you can take him to his designated toileting area to finish up."
    }
  ]
}