{
  "url": "https://www.wikihow.com/Write-a-Prospectus",
  "title": "How to Write a Prospectus",
  "steps": [
    {
      "title": "State the general topic of your study.",
      "content": "State the general topic of your study. You'll want to start by briefly discussing the general topic that your study or research project will address. The topic is a broad area of study that you want to write about or research. [2] X Research source Your topic isn't as broad as an entire subject such as history or sociology. Rather, you're going to list a specific aspect of that subject, such as \"The Causes of World War II\" or \"The Impact of Globalization in Latin America.\" This topic generally would be far too broad to write a single paper (or even a single book) about and even begin to cover it in a more than superficial manner. In a shorter prospectus, such as for an undergraduate research paper, you typically won't need to devote more than a sentence to your topic before moving on to your research questions."
    },
    {
      "title": "List the questions your study will seek to answer.",
      "content": "List the questions your study will seek to answer. The questions you list will get to the heart of your research. All of your questions should fall within the topic you described, but focus on a specific aspect of that topic. [3] X Research source Before you start formulating your questions, you may want to look at other research projects in your discipline to get a good idea of the types of questions typically asked. For example, a history question may involve extensive research and synthesis of that research to discover any patterns that may emerge. In contrast, questions in the social sciences such as political science may be based more on data gathering and statistical analysis. In a short prospectus, this may simply be a bullet-point list of specific questions you expect to address through your research. A longer prospectus, such as a grant proposal or dissertation prospectus, typically devotes several pages to discussing the specific questions that your research will address."
    },
    {
      "title": "Discuss the importance of these answers.",
      "content": "Discuss the importance of these answers. The next part of your prospectus will explain how your answers will have an impact on the scholarly research in the field. If there is already an active discussion of the issues you raise, you should describe how your research will contribute to that discussion. [4] X Research source The more advanced you are in your discipline, the more crucial this portion of your prospectus is going to be. If you're writing a prospectus for a research project in an undergraduate course, your professor likely won't expect you to contribute something new or profound to the field. However, graduate research and dissertations typically attempt to make a unique contribution to the area. You may need to do some preliminary research before you can write this portion of your prospectus, particularly if you believe you are the only person ever to do research seeking specifically to answer the questions you've listed. Any statement you make regarding the importance of your research should be supported by research, and you should be able to defend those assertions to the people reviewing your prospectus."
    },
    {
      "title": "Make clear how your study will answer the questions you've raised.",
      "content": "Make clear how your study will answer the questions you've raised. Your answers to the questions you've posed is the thesis statement for your research. It is the statement that will guide your research and define what your research will prove. [5] X Research source You want your thesis statement to be as clear as possible. If you find it difficult to craft a clear answer to the questions you've presented, it may be that your questions aren't as clear as they could be. Keep in mind that if your question is vague or muddled, you're going to have a hard time coming up with a clear, definitive thesis statement."
    },
    {
      "title": "Summarize your interests and qualifications.",
      "content": "Summarize your interests and qualifications. This portion of your prospectus may not be necessary if you're writing a shorter prospectus for an undergraduate project. However, for graduate projects, dissertations, or grant applications, you typically are expected to explain why you're the right person to complete this project. [6] X Research source At this level, you're not just selling your idea, you're also selling your own knowledge, passion, commitment, and skills as a researcher to find the answers you seek. For grant applications, information about yourself as a person and your personal interest in the topic you plan to research also can be important. When deciding which projects to fund, having a personal commitment or dedication to a particular issue may give you an edge. Depending on the type of research you plan to do, you also may have to outline your position and your access or ability to gather various types of information, such as archives or classified documents."
    },
    {
      "title": "Outline the chapters of your paper or project.",
      "content": "Outline the chapters of your paper or project. For longer papers or books, your prospectus should provide a summary of how the whole project will come together and what your finished product will look like. [7] X Research source Keep in mind that this is just a plan – nothing's set in stone. At this early stage, your paper likely will change as you get into your research or start gathering the data and crunching numbers to work on your project. You can create specific paragraphs or an outline, or you can write this section in a single seamless narrative. For shorter papers, that's probably all this section will be – essentially a couple of paragraphs that tell the readers how you anticipate you'll organize the final report on the project."
    },
    {
      "title": "Break down the phases or stages of your research.",
      "content": "Break down the phases or stages of your research. Particularly in social science or hard science research projects, you'll have a specific order in which your work must be done. If you're not doing any experiments or data collecting on your own, this section may not be applicable. [8] X Research source For example, if you're doing a statistical analysis, you must first gather the data, then compile statistics from that data, then analyze the statistics you create. For scientific experiments, this is the place where you'll describe the steps in the experiment. If you're doing a project in the humanities, the stages of your research may not be as clear-cut as they would be if you were doing a research project for a more scientific discipline."
    },
    {
      "title": "Estimate the time it will take you to complete your project.",
      "content": "Estimate the time it will take you to complete your project. If you're writing a prospectus for a class research project, your time may not be flexible – you must complete your project by the end of the class. [9] X Research source For graduate research projects or dissertations, the timeframe may be more open-ended. In these situations, you should provide an estimate in your prospectus of when you believe your project will be completed. Coming up with a timeline and ultimate deadline of when the research will be completed is particularly important if you're applying for a grant. How long you think it will take to complete your research affects the feasibility of the project, which is ultimately how your prospectus will be evaluated. Be realistic in what you can do within the time constraints you have. Keep in mind that while you may be able to get an extension if your research ends up taking longer than you anticipated in your prospectus, you also may be expected to justify the reasons you need more time or explain why the initial estimate in your prospectus was incorrect."
    },
    {
      "title": "Calculate the amount of money your project or study will cost.",
      "content": "Calculate the amount of money your project or study will cost. Particularly for larger research projects, you'll need to describe all of the costs of performing your study, and how you arrived at any estimations. [10] X Trustworthy Source Investor.gov Website maintained by the Securities and Exchange Commision’s Office of Investor Education and Advocacy providing free resources about investing. Go to source This is especially important if you're applying for a grant, as the people who review your prospectus will want a detailed breakdown of what you intend to do with the money if you're awarded the grant. Typically you'll need to include expenses such as fees for access to archives or for copying, any costs for data collecting, and rentals of lab or other equipment. You also should include a list of any resources you plan to use for which you anticipate there being no cost, such as use of the university library or computers and employment of student volunteers."
    },
    {
      "title": "Review any assignment information.",
      "content": "Review any assignment information. If you're writing your prospectus for a university project, your professor or department likely will have specific guidelines you must follow to format and submit your prospectus. The guidelines also typically will include details on which citation method you should use, and may include details on using a particular style guide that will govern word usage, grammar, and punctuation rules. Your assignment information also may specifically state how long each section is supposed to be, and which sections must be included."
    },
    {
      "title": "Use standard formatting.",
      "content": "Use standard formatting. Unless you're told otherwise, you typically want to format your prospectus the same way you'd format any other research paper or assignment you are turning in for a class in the same department. Type your prospectus in a standard, legible font such as Times New Roman or Helvetica. Typically you'll have one-inch margins on all sides of the paper, and your text will be double-spaced. Include page numbers if your prospectus is more than one page. Follow the guidelines from your professor or department in regard to creating a cover sheet or using special formatting or headers on the first page. If footnotes or end notes are required, set these up in your word processing app before you start working on your prospectus."
    },
    {
      "title": "Provide a table of contents.",
      "content": "Provide a table of contents. If you're writing a prospectus for a research project that will generate a book-length report or manuscript, you typically must include a table of contents with your prospectus. [11] X Research source The table of contents essentially is a list of chapters for your final report, and gives the readers of your prospectus an idea of what the final report will look like and how long it will be."
    },
    {
      "title": "Include a bibliography.",
      "content": "Include a bibliography. Your bibliography lists the books, articles, and other resources you plan to use in your research. You aren't necessarily committing yourself to using these resources specifically and only these resources, but at this stage you should at least know what your primary source material is going to be. [12] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source Some professors or departments require an annotated bibliography, in which you not only cite the sources you plan to use but provide a detailed description of what the source is and how it fits into your research. Check the guidelines from your professor or department to make sure you're using the correct citation method for your bibliography."
    },
    {
      "title": "Proofread your work carefully.",
      "content": "Proofread your work carefully. The people who review your prospectus will be evaluating it on the basis of whether it seems like a valuable, important research project. If your prospectus is sloppy and poorly written, they'll be less likely to look upon it favorably. [13] X Research source Reading your prospectus backwards is a good way to proofread and catch errors you might have missed otherwise. In addition to editing for grammar and punctuation, you also should check your language carefully. Make sure everything is written in a formal, professional tone. Keep your audience in mind as you edit. While you may be writing your prospectus for professors or a department committee that has full understanding of your project's topic, you shouldn't assume any particular level of understanding. Rather, your prospectus should be written so that it can be understood by a generally intelligent person without any special knowledge in your field."
    }
  ]
}