{
  "url": "https://www.wikihow.com/Treat-a-Heat-Rash-on-Your-Face",
  "title": "How to Treat a Heat Rash on Your Face",
  "steps": [
    {
      "title": "Recognize the symptoms of heat rash.",
      "content": "Recognize the symptoms of heat rash. Heat rash develops in hot, humid weather when you sweat profusely. Your skin will feel itchy and prickly. Then you'll notice small bumps or blisters emerge. If you see these symptoms, you could be developing a heat rash. Take steps to cool yourself off and wash the affected area. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source There are 3 common types of heat rash. Miliaria crystallina only affects the told layer of skin and forms clear blisters or papules. It's the mildest form of heat rash. Miliaria rubra occurs deeper in the skin. It produces red bumps and severe itching. Both forms are mild and should clear up on their own with care. [3] X Trustworthy Source DermNet NZ Online clinical resource website written and run by dermatologists providing evidence-based information about dermatology and skin health Go to source Sometimes, the sweat glands get more seriously inflamed, which leads to miliaria pustulosa. This causes the sweat glands to fill with pus. It is a more serious form of heat rash. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you see pus in the rash, call your doctor for an assessment."
    },
    {
      "title": "Wash your face",
      "content": "Wash your face with cold water and mild soap. Heat rash is usually caused by excessive sweating and blocked sweat glands. Washing your face removes excess sweat from your skin. Use cool water to lower your skin temperature and stop yourself from sweating more. Stick with a gentle, fragrance-free soap, such as a facial cleanser, to avoid irritating your skin further. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Do an exfoliating routine as well. This flushes out your pores and clears blockages. Rub an exfoliating cream onto your face while it's still wet. Use a circular motion when you apply the cream. Then rinse your face thoroughly with clean water. Remember that any cream should be gentle and fragrance-free. Gently pat your face dry with a towel. Rubbing can irritate your skin further."
    },
    {
      "title": "Sit with a fan blowing on your face.",
      "content": "Sit with a fan blowing on your face. Cutting down on your sweat levels is important for treating heat rash. A fan not only helps cool your skin, but it also makes moisture evaporate faster. This all reduces your sweat level and prevents the rash from getting worse. [6] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source The fan doesn’t need to be on high power. Just focus a gentle airflow on your face to keep your skin cool and dry."
    },
    {
      "title": "Hold a cold pack on the affected area.",
      "content": "Hold a cold pack on the affected area. Cold packs reduce the swelling and inflammation that comes along with heat rash. Find either a gel ice pack, a bag with ice, or a bag of frozen vegetables. Then wrap this in a towel and hold it against your rash. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Don’t hold ice on your face for more than 20 minutes at a time. Apply the ice for 20 minutes, take it off for 20 minutes, and then ice the rash again. Repeat this 3 times. If you don’t have anything to use for a cold pack, run a towel under cold water and hold that on your face instead. Re-wet the towel so it stays cold."
    },
    {
      "title": "Apply calamine or hydrocortisone lotion if the rash itches.",
      "content": "Apply calamine or hydrocortisone lotion if the rash itches. Heat rash is often irritated and itchy. If your rash is bothering you, visit a local pharmacy and get a bottle of calamine lotion or hydrocortisone cream. Apply a thin layer to the rash to reduce the itching. [8] X Research source Use only a thin layer so your skin can still breathe. A glob of lotion can clog your pores further and make the rash worse. Avoid oil-based creams and ointments. These can clog your pores even more. In general, you should not use hydrocortisone cream on a child younger than 10 years old. Ask your doctor before using this product on your child. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Avoid scratching or picking at the rash.",
      "content": "Avoid scratching or picking at the rash. The rash is uncomfortable and itchy, and you’ll be tempted to scratch it. Avoid this urge. Scratching will irritate the skin even more and make your rash worse. It’s better, in the long run, to ignore the itching and take these other steps to help the rash heal. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If the itching gets hard to deal with, reapply the cold pack. This will numb your skin so you feel less itchy."
    },
    {
      "title": "Call your doctor if your heat rash doesn’t improve or gets worse.",
      "content": "Call your doctor if your heat rash doesn’t improve or gets worse. Heat rash usually resolves on its own without medical help. Some cases are more severe, however, and require a doctor's attention. If you've been treating the rash for 3 days and it hasn't gotten better or has gotten worse, schedule an appointment with your doctor to have the rash evaluated. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Heat rash blisters sometimes get infected. Visit your doctor if you see pus and increased swelling on the rash. If your heat rash is associated with a fever, fainting, dizziness, or nausea and vomiting, seek medical attention right away. These could be symptoms of heatstroke, a life-threatening condition."
    },
    {
      "title": "Get into the air conditioning as soon as possible.",
      "content": "Get into the air conditioning as soon as possible. Once you notice a heat rash forming, it means your body is overheating. Don’t delay in cooling your body down. Get out of the heat and into an air-conditioned building as soon as possible. This will prevent the rash from getting worse and stop other heat-related problems like dehydration. [12] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source If you aren’t near your home, try entering a store or coffee shop nearby. Establishments like these should be air-conditioned, and you can take a few minutes to cool off in here before making your way home."
    },
    {
      "title": "Drink plenty of water to stay hydrated.",
      "content": "Drink plenty of water to stay hydrated. Staying hydrated is critical in hot weather. If a heat rash has started forming, it’s possible you’re already dehydrated. Begin drinking cold water as soon as possible to replenish lost fluids. This will not only prevent dehydration but cool your core body temperature down as well. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source General advice is to drink 8 glasses of water every day. This is a good guideline, but in hot weather, you might need more. Drink enough so that you don’t feel thirsty and your urine is a light color. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Don’t chug water very quickly if you feel dehydrated. This could shock your body and cause vomiting. Drink normally and consistently to re-hydrate your body."
    },
    {
      "title": "Take a cool shower to lower your body temperature.",
      "content": "Take a cool shower to lower your body temperature. If you’ve moved inside and still feel overheated, try taking a cool shower. This will bring your core body temperature down enough to ward off further heat rashes. Rinse off your rash while you’re in the shower as well. This removes any excess sweat and dirt that can irritate your skin even more. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source The shower water doesn’t have to be cold. As long as the water is cool, it will lower your body temperature. If you have a pool, you could also jump in there to cool yourself off. Stay in for a few minutes to get your core body temperature down."
    },
    {
      "title": "Dress in loose-fitting cotton clothing to stay cool.",
      "content": "Dress in loose-fitting cotton clothing to stay cool. Once you get yourself cooled down, stop yourself from overheating again. Wear loose-fitting cotton clothing to you’re your body cool and avoid sweating more. As long as you stay cool, your heat rash shouldn’t get any worse. [17] X Research source"
    }
  ]
}