{
  "url": "https://www.wikihow.com/What-Are-Thunder-Thighs",
  "title": "The Meaning & Origins of “Thunder Thighs”",
  "steps": [
    {
      "title": "“Thunder thighs” is a rude way to say that someone has large thighs.",
      "content": "“Thunder thighs” is a rude way to say that someone has large thighs. “Thunder thighs” is an English idiom that refers to someone who is thought to have fat, thick, or muscular thighs. It is generally seen as an insult or an unflattering term that is used to mock people with large thighs. [1] X Research source In general, “thunder thighs” is used more often to describe women than men."
    },
    {
      "title": "Saying that someone has “thunder thighs” is considered impolite.",
      "content": "Saying that someone has “thunder thighs” is considered impolite. “Thunder thighs” is generally seen as a rude or offensive term to describe someone’s body. Avoid telling a friend, partner, family member, acquaintance, or stranger that they have “thunder thighs,” as this can hurt their feelings and make them feel insecure or ashamed of their body. It’s common for people to worry about their appearance and feel pressured to conform to society’s “ideal” body standards. Being teased about their body or hearing that they have “thunder thighs” can cause them to develop a negative body image and low self-esteem. [2] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source It can feel hurtful when someone comments on your body. To feel better about your body , recognize all the things it allows you to do. [3] X Research source If you catch yourself thinking negatively about your body, replace the thoughts with neutral or positive ones, like “I am thankful for my body,” or “My body is strong and beautiful.” [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source When someone negatively comments on your body, take a deep breath and tell them how their words make you feel . For instance, tell them, “I don’t appreciate your comment. My body is none of your business.”"
    },
    {
      "title": "Some people see “thunder thighs” as a compliment.",
      "content": "Some people see “thunder thighs” as a compliment. There’s nothing wrong with having large thighs, as there’s no right or wrong way to have a body. Lots of people find large thighs beautiful and strong, so they see “thunder thighs” as a compliment that celebrates people of all shapes and sizes. [5] X Research source Many people who have large thighs are proud and in love with their bodies. Some people want thicker thighs or are attracted to people with large thighs. Even if you see “thunder thighs” as a compliment, most people still consider it an insult. Avoid telling someone they have “thunder thighs” unless they proudly comment on them. In general, it’s best to avoid commenting on someone’s appearance, as they might be sensitive about their body. [6] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source If you’re unsure whether it’s okay to compliment their looks, compliment their personality or skills instead."
    },
    {
      "title": "“Thunder thighs” refers to the idea that large thighs sound like thunder.",
      "content": "“Thunder thighs” refers to the idea that large thighs sound like thunder. Thunder is well known for the loud, booming sounds it makes after lightning strikes. Some people believe that large thighs also make loud, booming sounds when they clap or rub together. So, people call large thighs “thunder thighs” due to the thunder-like noises they are believed to make."
    }
  ]
}