{
  "url": "https://www.wikihow.com/Style-a-Shag-Haircut",
  "title": "How to Style a Shag Cut: Short, Long, or with Bangs",
  "steps": [
    {
      "title": "Keep your shag haircut sleek and fight frizz with texturizing products.",
      "content": "Keep your shag haircut sleek and fight frizz with texturizing products. If you have curly or wavy hair, use a sea salt spray to tame frizz while maintaining the shape of your locks. [1] X Research source Use a texturizing spray on straight hair, whether it's thin, fine, or thick, so it holds throughout the day instead of getting frizzy. [2] X Research source Sea salt spray : Spray 1-3 spritzes onto damp hair to lightly mist it and blow dry. [3] X Research source Texturizing spray : Hold 6–8 in (15–20 cm) away from your hair and spritz every layer in a circular motion. [4] X Research source"
    },
    {
      "title": "Volumizing products make your shag haircut fluffy and bouncy.",
      "content": "Volumizing products make your shag haircut fluffy and bouncy. Since wavy or curly hair already has a lot of natural volume, just use some curl cream . Add a dollop of curl cream onto your palm and rub your hands together. Work it into each section of your hair. [5] X Research source If you have straight hair, apply mousse or styling cream to your tresses when they’re damp. [6] X Research source To use mousse , squeeze a dollop of mousse about the size of a golf ball onto your hand and massage it into your roots. If you have long layers, then use an amount of mousse that’s about the size of a tennis ball. [7] X Research source Add a dime-sized amount of styling cream onto your palm and rub them together. Run your hands from the back of your hair to the front of it to evenly distribute all the styling cream. [8] X Research source If you have very fine hair or just want even more volume—no matter what your hair type is—tousle your hair with your hands, then run a round brush through it. The bigger the brush you use, the more volume you’ll get. [9] X Research source"
    },
    {
      "title": "Air dry straight hair and scrunch curly or wavy hair.",
      "content": "Air dry straight hair and scrunch curly or wavy hair. If you have curls or waves, gently scrunch your hair with a microfiber towel . Use a blow dryer with a “diffuser” attachment to evenly dry your locks without applying direct heat to them. For straight hair, just let it air dry for about 30 minutes. [10] X Research source If you want even more volume, gently fluff your hair at the roots with a pick . [11] X Research source If you're drying curly hair, make sure your blow dryer is set to medium heat and medium speed. [12] X Research source Hold your blow dryer so it’s pointing up toward the ceiling and scoop your hair into the diffuser for a faster dry time and greater volume. [13] X Research source If you have curls or waves, it’s best to scrunch them so you maintain their shape. However, it’s also great to scrunch straight hair because this method gives your tresses definition. If you have straight hair and swear by using your hair dryer or just don't have a lot of time, make sure to use the lowest heat setting possible."
    },
    {
      "title": "If you have straight hair, grab a flat iron to style short and long layers.",
      "content": "If you have straight hair, grab a flat iron to style short and long layers. For a chic messy and volumized look, wave your hair with a flat iron . To have more control while you style the different layers in your shag haircut, try an all-purpose 1 in (2.5 cm) flat iron . Going 1 section at a time, clamp onto a layer of hair with your flat iron, then twist outwards and away from your face to style it into curls. [14] X Research source Use hair clips to separate your tresses into 3-5 sections, depending on how much hair you have. Each section should be about 1–2 in (2.5–5.1 cm) wide so you can add dimension to your shag haircut with thick waves. [15] X Research source Position each section of hair on either side of your head—instead of behind it—so it's easier to style."
    },
    {
      "title": "Use a blow dryer for straight bangs or a curling iron for curtain bangs.",
      "content": "Use a blow dryer for straight bangs or a curling iron for curtain bangs. For fringe bangs, use a blow dryer and a round brush to blow your bangs out . [16] X Research source Want curtain bangs? Wrap your bangs around a curling iron slide it off, and clip your bangs. Wait for them to cool, take the clip off, and create a part . [17] X Research source To add the finishing touch to your curtain bangs, take a round brush and run it through each of your bangs—twist them in opposite directions. When styling curtain bangs, use a curling iron with a 1.25 in (3.2 cm) barrel . To safely handle a curling iron, hold it horizontally and make sure the barrel doesn’t touch your forehead."
    },
    {
      "title": "Absorb any excess oil to keep your shag haircut looking fresh.",
      "content": "Absorb any excess oil to keep your shag haircut looking fresh. Use dry shampoo to cut back on grease that might weigh down your shag hair style and make it droop or lose body. If you skip a day of shampooing in the shower, spray a thin coating of dry shampoo onto your scalp and massage it in. This trick keeps your shag bouncy all day. [18] X Research source"
    },
    {
      "title": "Achieve effortless glamour with a shag haircut that frames your features.",
      "content": "Achieve effortless glamour with a shag haircut that frames your features. Before you cut your hair, find out your face shape . If you’ve got a round face, a shag haircut with dramatic layers and side swept bangs streamlines your jawline. To balance out a long face shape, like a diamond, soften your chiseled features with a shag that has curtain bangs and waves. [19] X Research source A shag bob with bangs or a shaggy pixie cut with side swept bangs is great for a heart-shaped face—both draw attention away from your forehead and accentuate your cheekbones. A shag haircut with curtain bangs is ideal for a square face shape since its symmetrical bangs draw attention to your eyes. A long shag haircut is a good call for a rectangle face shape since it won’t elongate your features. You can also try a curly shag with bangs, which softens your jawline."
    },
    {
      "title": "Try highlights for short shag haircuts and a balayage for longer ones.",
      "content": "Try highlights for short shag haircuts and a balayage for longer ones. If you have a short style with lots of layers, giving it standard highlights creates a beautiful piecey effect. [20] X Research source If you have a shag haircut that’s long or medium, take advantage of all that length and try out \"balayage\" highlights to give your ends a dreamy ombré look. [21] X Research source"
    }
  ]
}