{
  "url": "https://www.wikihow.com/Teach-Spoken-English-for-Beginners",
  "title": "How to Teach Spoken English for Beginners",
  "steps": [
    {
      "title": "Create a lesson plan with basic, relatable topics.",
      "content": "Create a lesson plan with basic, relatable topics. Before you start teaching any new lessons, first decide what you want to focus on. Take out a blank sheet of paper or open up a document in a word processor to begin creating a list of important topics to cover. Focus on easy lessons, like pronunciation and phonics skills, basic vocabulary, simple verb tenses ( past /present/future), and easy sentence structure (simple and compound sentences). [1] X Research source Don’t pick topics that are overly complicated. While parts of speech are an important part of the English language, young or new speakers won’t understand what adverbs and prepositions are. Focus on topics that would be easy to role play in a classroom, like asking someone about another person’s weekend."
    },
    {
      "title": "Spend time discussing and practicing pronunciation techniques.",
      "content": "Spend time discussing and practicing pronunciation techniques. Encourage students to listen as you speak a word or series of words aloud. Once you’ve spoken these words, instruct the students to repeat after you. Focus especially on vowel pronunciation , and letters that sound different than they usually do in the alphabet. To help with the learning process, record the students speaking, and then play the recording back. [2] X Research source Pay special attention to words that are spelled similarly but pronounced differently, like rat and rate, or fat and fate. Have students pronounce words that are identical in spelling aside from a single vowel, like pin and pen."
    },
    {
      "title": "Revolve your lessons around specific verbs and vocabulary.",
      "content": "Revolve your lessons around specific verbs and vocabulary. Don’t try to teach too many words at once. If your students feel overwhelmed, they might not grasp the topic as well. Focus on a small, simple topic during each class period. Try spending more time on common verbs, like do, make, go, and play. It can help if you develop a lesson plan ahead of time. Even if you’re teaching someone informally, their English lessons will benefit from structure. If you’re teaching your own child, try to keep your lessons in short, 15-minute increments. Use these segments to educate your child throughout the day. [3] X Research source"
    },
    {
      "title": "Discuss conjugation techniques with simple verbs.",
      "content": "Discuss conjugation techniques with simple verbs. Focus on lessons that revolve around simple verb conjugations, like past, present, and future. While the English language has a lot of exceptions and rules, try not to mention these to your beginner level students right off the bat. If you stumble across an irregular verb or word, explain how it works in the sentence or conversation—not in the English grammar system overall. [4] X Research source Use the same verb to explain verb conjugations. Start explaining the different tenses of the verb “play.” Unlike “go” and “do,” “play” follows the past, present, and future structure in a way that’s easy to understand (e.g., played, play, will play)."
    },
    {
      "title": "Practice speaking simple and compound sentences.",
      "content": "Practice speaking simple and compound sentences. Start your students off with the basics by describing the different elements of English sentence structure. Explain that a simple sentence only has 1 subject and 1 verb, while a compound sentence includes 2 subjects and 2 verbs. Provide examples of each sentence type by including the students in your example. For instance: “Sally goes to school” is a simple sentence. “Sally likes math, but John likes science” is a compound sentence. Remind your students that compound sentences are created with connecting words like “and” and “but.”"
    },
    {
      "title": "Choose interactive activities that let the student apply new knowledge.",
      "content": "Choose interactive activities that let the student apply new knowledge. Create a sample conversation, focusing on topics that your student can act out. Invite your students to stand up when participating in a practice conversation, as this will feel more realistic than sitting behind a desk. If you’re practicing store scenarios, pretend to have 1 student be a shopkeeper and another be the customer. [5] X Research source For instance, you could have 2 students pretend to ask for directions. Focus on question vocabulary by having 1 student ask how to get to the nearest gas station. Instruct the other student to answer with directional vocabulary, like “right” and “left.”"
    },
    {
      "title": "Design flash cards for each new lesson.",
      "content": "Design flash cards for each new lesson. Use color index cards and permanent markers or pens to create an effective study routine. Invite the students to practice new words by highlighting terms and phrases that relate to the current lesson on 1 side of the card. Use pictures and symbols on the other side of the flash card to serve as a definition. [6] X Research source If your students are ESL learners, use their native language on the other side of the flash card. Flashcards can be a great tool in teaching a new language. [7] X Research source You can write down the most essential and general words first, then move on to the more specific ones. [8] X Research source The task of memorizing every word can be counterproductive for both beginners and advanced learners. So try to tackle 20-50 words per lesson, day, or week."
    },
    {
      "title": "Explain the difference between formal and informal language.",
      "content": "Explain the difference between formal and informal language. Tell your students that they use casual words and sentences when talking with their friends and family. Next, state how they use formal words and sentences when speaking with strangers and acquaintances. Include a lesson on basic manners and etiquette as you explain this difference, noting that formal language is important when you’re speaking with adults and new friends. [9] X Research source Use a sample dialogue to explain the difference between these styles of language. You could use “Good evening! How has your day been going?” as an example of formal language, and “Hey! What’s up?” as an example of informal language. Remind students that they probably use informal language when talking to friends and other people their own age."
    },
    {
      "title": "Remind your students not to use vague language.",
      "content": "Remind your students not to use vague language. Use flash cards or another visual cue to provide a list of vague, unhelpful terms. Provide examples of specific language they can use in conversation, then create an example dialogue or scenario for them to follow. If you hear your students using vague language, make an effort to point it out and correct them. For example, explain how the words “stuff” and “thing” are vague and unhelpful in conversation. In a store setting, tell your students that “I’d like to buy that pencil” is a lot more helpful and specific than “I’d like to buy that thing.”"
    },
    {
      "title": "Teach your students the initiate, respond, follow-up model.",
      "content": "Teach your students the initiate, respond, follow-up model. Guide your students through the flow of a casual conversation by helping them initiate a new topic, like asking about someone’s day or weekend. Continue the lesson by reminding the students to give an answer. Help the beginning English speakers continue the dialogue by asking a follow-up question. Try to repeat this conversational model until your students get the hang of it. [10] X Research source For instance, try having 2 students engage in a simple conversation about the weekend. One student can “initiate” with a question, like “How was your weekend?” The second student can “respond” by saying, “It was good.” The second student can then “follow-up” by asking the first student how their weekend went."
    },
    {
      "title": "Clarify the difference between interactional and transactional language.",
      "content": "Clarify the difference between interactional and transactional language. Remind students that the regular, “interactional” conversations they have with friends, family members, or acquaintances are different than the “transactional” conversations they have at stores and restaurants, where they purchase goods or services. Provide examples and set up sample dialogues so that students can witness the difference for themselves. [11] X Research source A good example of an interactional conversation could go like this: “Hey! Did you do the homework last night?” “Yes, I did.” A good example of a transactional conversation might go like this: “Excuse me! How much will it cost for 1 slice of pizza?” “It will cost $2.50.”"
    },
    {
      "title": "Pair your students up to practice basic conversations.",
      "content": "Pair your students up to practice basic conversations. If you’re teaching more than 1 student, encourage them to learn with each other. Assign different roles to each pupil, like storekeeper or customer, then provide a prompt for a conversation. Invite the students to role play these conversations to get a fuller learning experience. [12] X Research source For instance, you could pretend that a desk is the cash register counter at a fast food restaurant. Tell 1 student to be the fast food worker, and another student to be a customer. Students might be more engaged if they can move around the classroom or learning area."
    },
    {
      "title": "Change your facial expression while you teach.",
      "content": "Change your facial expression while you teach. Prevent your lessons from being monotonous and overwhelming by sprinkling in some personality and fun elements! Brainstorm ways you can add excessively happy or sad expressions into your lessons, or other displays of emotions. If you act engaged while you’re teaching, then your students are more likely to feel and act engaged as well. [13] X Research source For example, if you’re teaching your students about different responses to conversations, you can use facial expressions to help. Saying something like “Yes, I’d be happy to do that!” could be accompanied with a big smile, while, “I’m sorry, I can’t make it!” can be accompanied with a frown."
    },
    {
      "title": "Encourage students to act out different scenarios.",
      "content": "Encourage students to act out different scenarios. Don’t force your students to stay in 1 place while you’re teaching them new concepts. Instead , try and replicate real-world scenarios, like a restaurant setting or a visit to a store. Switch up the roles so your students can experiment with different questions and answers. [14] X Research source If you’re practicing with your child, ask them which role they’d like to do first. Continue switching off as you practice different conversations."
    },
    {
      "title": "Incorporate effective gestures to make your lessons more dynamic.",
      "content": "Incorporate effective gestures to make your lessons more dynamic. Think of clever ways to use your hands and arms to make vocabulary lessons clearer for your students. As you go, use large, exaggerated motions to make your point, as this will be much more engaging for the students. When your students speak, invite them to use large, dramatic hand motions, too! [15] X Research source For instance, large hand gestures can be helpful in a lesson on adjectives. While explaining the words “tall” and “short,” extend and lower your arms to demonstrate a person’s height."
    },
    {
      "title": "Help your students analyze body language in a video.",
      "content": "Help your students analyze body language in a video. Go online to find sample conversation videos. Focus on language learning video channels, or, if relevant, channels with content geared toward children. Play the video once or twice, instructing your students to observe the different behaviors and gestures that the speakers in the video use. If needed, explain each gesture to your students, and show them how to use it in their daily conversations. [16] X Research source For instance, in a video detailing a basic greeting, the actors might wave their hands to say “hello” and “goodbye.” Remind your students that they can wave when offering a greeting to someone, too!"
    },
    {
      "title": "Explain the dos and don’ts regarding physical contact in conversation.",
      "content": "Explain the dos and don’ts regarding physical contact in conversation. Depending on the age and culture of your students, you might need to dedicate a separate lesson to personal space, and how it translates into regular conversation. Describe how you shouldn’t stand right next to a person, but instead offer a comfortable amount of space (at least 2 ft (0.61 m) or so). Set up a few example conversations so your students can practice. [17] X Research source If you notice your students standing too close or violating another person’s boundaries on accident, don’t chastise them. Instead, point out what they’re doing wrong, and how they can improve."
    },
    {
      "title": "Prioritize constant communication over correct answers.",
      "content": "Prioritize constant communication over correct answers. Remind your students at the beginning of each lesson that practice is most important. Explain how language learning is a process of trial and error, and that it’s okay to make mistakes while you’re learning how to speak a new language. Focus on creating a nurturing and welcoming environment, as this will make your students feel more comfortable. Encourage students to challenge themselves during each lesson. If they say something incorrectly, you can always help them!"
    },
    {
      "title": "Establish ground rules for each lesson.",
      "content": "Establish ground rules for each lesson. Create a respectful and engaging environment by reminding students to be polite and courteous to the instructor, as well as other pupils. Encourage your students to raise their hand when they have a question and not to speak over or interrupt others. If you want to keep your students committed to these ground rules, consider writing out an agreement and having the students sign it. If your students aren’t polite, then the learning environment won’t be as productive or helpful."
    },
    {
      "title": "Encourage the student to participate in their lessons.",
      "content": "Encourage the student to participate in their lessons. Pay attention to students who aren’t as active or engaged in different topics. Keep these individuals involved by inviting them to take part in practice conversations, and by encouraging them to answer questions throughout the lesson. [18] X Research source If students aren’t participating in a lesson, it doesn’t necessarily mean that they’re bored. They might be having some difficulty understanding the lesson."
    },
    {
      "title": "Give the student plenty of time to practice new words and phrases.",
      "content": "Give the student plenty of time to practice new words and phrases. Don’t expect your pupils to memorize new vocabulary and conversational topics right off the bat. Instead, keep drilling them with flash cards and other practice exercises, which will help them develop a solid foundation. Continue reviewing the same topics for weeks and months, even if you’ve moved on to different lessons. [19] X Research source Repetition and practice are key to improving spoken English!"
    },
    {
      "title": "Use your own experiences create authentic lessons.",
      "content": "Use your own experiences create authentic lessons. Think back to when you first learned English. While you may not have any recent memories to go on, try and recall the fun and engaging aspects of your lessons. Pull scenarios from your own journey as an English speaker and add them to practice exercises. [20] X Research source For instance, if you lost your luggage at the airport once, create a sample practice conversation for students to practice. Have 1 student be the airport staff member, and another be the traveler."
    }
  ]
}