{
  "url": "https://www.wikihow.com/Treat-Treadmill-Burns",
  "title": "How to Treat Treadmill Burns",
  "steps": [
    {
      "title": "Rinse the burn under cool, running water for 20 minutes.",
      "content": "Rinse the burn under cool, running water for 20 minutes. Do this right after you get burned. Set your faucet to a cool, not cold, temperature, and keep the affected area under it for 10-20 minutes. The water cools the burn off and rinses out any dust or debris in the wound. Don't use ice or cold water on the burn. If the temperature is too low, you could damage the skin even more. Also never use a home remedy like putting butter or toothpaste on a burn. These trap heat and will make the burn worse."
    },
    {
      "title": "Remove any clothing or jewelry around the burn.",
      "content": "Remove any clothing or jewelry around the burn. These things could trap heat or cut off circulation to the area. While you’re rinsing the burn, take off anything around it to keep it clean and free of dirt. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Don't pull off anything that’s stuck to the burn. This will do more damage. Leave it attached and a doctor can remove it later."
    },
    {
      "title": "Cover the burn with a clean cloth or gauze pad if the skin isn’t broken.",
      "content": "Cover the burn with a clean cloth or gauze pad if the skin isn’t broken. This should keep the area clean and protected. However, don’t do this if the skin is broken, or the cloth could stick to the burn. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You could also use plastic wrap to cover the burn temporarily until you get medical attention. Make sure whatever you use is clean. If not, you could cause a serious infection."
    },
    {
      "title": "Seek medical attention if your skin is broken or the burn is large.",
      "content": "Seek medical attention if your skin is broken or the burn is large. Small or minor burns are fine to treat at home without medical attention. However, if the burn is larger than about a quarter or your skin is broken, then see a doctor. If the burn is on your face or anything is stuck in it, like your clothing, have a medical professional take a look. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source See your doctor as soon as possible for treatment in these cases. In most cases, the doctor will clean and inspect the burn, then give you instructions for home care. In rarer cases, a treadmill burn could be serious enough to need skin grafting. [4] X Research source"
    },
    {
      "title": "Wash the burn twice a day with clean water.",
      "content": "Wash the burn twice a day with clean water. Preferably in the morning and evening, remove the bandage and hold your burn under warm, running water. Don't scrub the burn, just let the water flow over it. This should remove any dirt and bacteria and prevent infections. Then dab the burn very gently with a clean towel to dry it. [5] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source Don’t use soap or antiseptics like alcohol to clean your wound unless your doctor tells you to. They're irritating and can make the burn heal more slowly."
    },
    {
      "title": "Apply a thin layer of petroleum jelly to keep the burn moisturized.",
      "content": "Apply a thin layer of petroleum jelly to keep the burn moisturized. This is optional, but can help the burn heal faster and prevent scarring. Just rub a small amount onto the burn before putting a bandage on. [6] X Research source You could also use an antibacterial cream, but this usually isn’t necessary to prevent an infection."
    },
    {
      "title": "Cover the burn with a clean bandage or gauze pad.",
      "content": "Cover the burn with a clean bandage or gauze pad. When you’ve washed and dried the burn, place a fresh bandage over it. A sterile, nonstick gauze pad is best. Press the pad over the burn and secure the sides with medical tape. This helps prevent infections and protects the burn from scraping against anything. [7] X Research source If you use a sticky bandage, make sure the sticky part isn’t touching the burn at all. Taking it off will be very painful if it is. Only use medical tape, not packing tape or duct tape, which would be painful to remove. Always use a fresh bandage every time you wash the burn to prevent infections."
    },
    {
      "title": "Avoid popping or picking at any blisters.",
      "content": "Avoid popping or picking at any blisters. Treadmill burns tend to cause blisters, especially if it was a nasty burn. Always leave the blisters alone. They protect your skin while it heals, and picking at them could cause a scar or infection. [8] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source Blisters might rupture or leak by themselves, which is normal. If the blister opens , don't peel or pick at the skin. Clean it with soap and water every day, dry it, and cover it with a non-stick bandage so it doesn't get infected."
    },
    {
      "title": "Take an OTC pain reliever to make yourself more comfortable.",
      "content": "Take an OTC pain reliever to make yourself more comfortable. If the burn hurts while it’s healing, some pain medication should help with that. Take an over-the-counter pain reliever like acetaminophen or ibuprofen, following the dosage instructions on the package. [9] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source"
    },
    {
      "title": "Call your doctor if the burn seems infected.",
      "content": "Call your doctor if the burn seems infected. Signs of an infection include increased redness, swelling, and pain. There might also be some pus around the burn, or it could take longer than 10 days to heal. If you notice any of these signs, call your doctor to see what you should do next. [10] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source If the burn does get infected, don’t panic. The doctor will probably give you an antibacterial cream or oral antibiotic to knock the infection out."
    },
    {
      "title": "Place the treadmill away from walls and other objects.",
      "content": "Place the treadmill away from walls and other objects. Getting caught between the treadmill belt and a wall could cause a serious burn. Leave plenty of free space on all sides of the treadmill to avoid accidents like this. A general recommendation is to leave 6.5 ft (2.0 m) of space behind the treadmill and 1.5 ft (0.46 m) on either side. [11] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source This is especially important if there are children or pets around so they don’t get caught in the belt."
    },
    {
      "title": "Tie your shoelaces tightly before starting.",
      "content": "Tie your shoelaces tightly before starting. Loose shoelaces could untie while you're running and get caught in the treadmill belt. Double-check your laces before you start running to make sure they're good and tight. [12] X Research source If your shoelaces untie at any point during your workout, stop the treadmill right away, wait for the belt to stop moving, and re-tie them before starting again. Also, make sure your pants aren't too long, or they could get caught in the belt too."
    },
    {
      "title": "Set the treadmill at a speed you can handle.",
      "content": "Set the treadmill at a speed you can handle. Overdoing it on the treadmill could make you fall or slip. Keep the speed at a manageable level so you don’t hurt yourself. [13] X Research source When you do increase the speed, do so gradually. Ease up to your top speed."
    },
    {
      "title": "Attach the safety clip to your shirt while you’re on the treadmill.",
      "content": "Attach the safety clip to your shirt while you’re on the treadmill. This safety clip brings the treadmill to an emergency stop if you pull it out too far, like if you’re falling. It’s an important safety feature, so be sure to clip it to your shirt each time you use the treadmill. [14] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you're having trouble staying forward enough to avoid triggering the shut-off, then you probably have the speed set too high. Lower the speed a bit so you can stay close to the front of the treadmill."
    },
    {
      "title": "Let the treadmill come to a complete stop before getting off.",
      "content": "Let the treadmill come to a complete stop before getting off. It’s tempting to just hop off the treadmill as soon as you’re finished. However, even if the belt is only moving slowly, you could lose your balance and fall. Keep walking slowly until the belt stops completely, then step off safely. [15] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    }
  ]
}