{
  "url": "https://www.wikihow.com/Test-if-a-Dish-Is-Microwave-Safe",
  "title": "How to Tell if a Dish Is Safe to Put in the Microwave",
  "steps": [
    {
      "title": "Fill a glass with 1 c (240 mL) of water.",
      "content": "Fill a glass with 1 c (240 mL) of water. To test if a dish is microwave-safe, you can put it in the microwave with a cup of water to perform a simple test. Find a glass or cup that is microwave safe, and fill it about three-quarters of the way with water (or at least 1 c (240 mL). [1] X Research source It’s important to use a cup that you know to be safe for the microwave, otherwise the test may not work. Glass is the best option. To be certain, find a cup that has the microwave-safe stamp on the bottom, which looks like 2-3 wavy lines."
    },
    {
      "title": "Microwave the dish with the glass of water for 1 minute.",
      "content": "Microwave the dish with the glass of water for 1 minute. Place both the glass of water and the dish in question side by side in the microwave. Microwave the two items together on high power for 1 minute. [2] X Research source If the dish is too large to sit side-by-side with the cup, place the cup on top of (or inside) the dish. To increase the power on your microwave to high, look for a button that says Power, Menu, or Settings. If the dish begins to flash, spark, or make noise, immediately stop the microwave, then wait 1 minute before removing it with oven mitts."
    },
    {
      "title": "Touch the dish gently to see if it’s hot.",
      "content": "Touch the dish gently to see if it’s hot. After a minute in the microwave, use oven mitts or a potholder to remove the cup of water. Then, lightly place your hand on the dish in question to feel how warm it is: [3] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source The dish is unsafe for the microwave if the dish is warm and the water is cold. A warm dish means it absorbs heat. The dish is safe for the microwave if the dish is cool and the water is warm. A cool dish means it doesn’t absorb heat. Note that the dish may feel warm in the center if you had the cup of water in or on the dish."
    },
    {
      "title": "Label the dish with a permanent marker.",
      "content": "Label the dish with a permanent marker. In order to keep track of which dishes are microwave-safe and which aren't, use a permanent marker to label the bottom of the dish with the results of your test. Two or 3 wavy lines is the standard symbol for microwave-safe. [4] X Research source You can use any labeling method you like for your dishes. For instance, you can mark microwave-safe dishes with a happy face, the letter M, or the standard wavy lines. Don’t forget to label dishes that aren't safe for the microwave as well. You can use an unhappy face, an M with a line through it, or some other indication."
    },
    {
      "title": "Anything with a microwave-safe label",
      "content": "Anything with a microwave-safe label Chiu says “It’s important to read the material of the bowl prior to using the microwave if you are unsure” of whether or not it’s safe. [5] X Expert Source Raymond Chiu House Cleaning Professional Expert Interview. 15 October 2019. The easiest way to know that a dish or utensil is microwave-safe is by looking for the stamp on the bottom. There are typically three things that will indicate a dish is safe to use: [6] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source The words “microwave safe” The words “microwave friendly” Wavy horizontal lines"
    },
    {
      "title": "Most ceramic, glass, porcelain, and china",
      "content": "Most ceramic, glass, porcelain, and china Most ceramic, glass, china, and porcelain dishware is safe for use in the microwave, but not all. The exceptions are if: [7] X Research source The manufacturer states that the dishes are not microwaveable The dishware has metal paint or decorations, such as gold or silver trim, Chiu says. [8] X Expert Source Raymond Chiu House Cleaning Professional Expert Interview. 15 October 2019. Lead glaze was used to manufacture it, which is often labeled on the bottom of the dish. Lead can also be tested for with simple kits ."
    },
    {
      "title": "Some paper products",
      "content": "Some paper products Some paper products are safe to microwave, including parchment and wax paper, and white paper plates, napkins, and towels. [9] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source These are often specified as microwave-safe on their packaging. To make sure that no inks or dyes leach into your food, don’t use paper products that are dyed or those with printed matter, logos, or writing on them."
    },
    {
      "title": "Certain plastics",
      "content": "Certain plastics Some plastic dishware and wraps have been made especially to be safe for microwaving, and these don’t contain plasticizers that can leach into food. As with any other dish, though, it’s important to look for the microwave-safe label. [10] X Research source If you want to microwave plastic dishware, make sure it says it’s microwave safe. If it doesn’t say it, don’t use it. When you use microwave-safe plastic wrap in the microwave, make sure it’s not touching your food directly."
    },
    {
      "title": "Certain rubber or silicone products",
      "content": "Certain rubber or silicone products In general, avoid microwaving rubber or silicone. That said, some rubber or silicone products, like food storage containers or baking mats, are specially designed for microwaves, so long as they have the microwave-safe label or stamp. [11] X Research source"
    },
    {
      "title": "Brands including Pyrex and Corningware",
      "content": "Brands including Pyrex and Corningware There are several manufacturers out there that make heat-proof cookware that is also safe for use in the microwave. You still need to check for the microwave-safe label, but some of the companies that make these items are: [12] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source Anchor Hocking Duralex Pyrex Corningware Visions"
    },
    {
      "title": "Metals",
      "content": "Metals It is not safe to microwave metal. Putting metal in the microwave can lead to sparking, fires, and a malfunctioning unit. Be sure to watch out for: [13] X Research source Dishes and cups with metallic paints Dishes and cups with decorative metal trim Wire twist ties Take-out containers with metal lining or handles Aluminum foil Metal utensils Rocks or stones"
    },
    {
      "title": "Lead and lead glazes",
      "content": "Lead and lead glazes Lead glaze used to be common for lots of dishware, and is still used in many countries. Never use dishes with lead glaze to hold or serve food, because the lead can transfer to your food. Lead is extremely toxic and consuming lead is hazardous to your health. If you microwave dishware with lead glaze, even more lead can leach into the food. Dishes that are likely to have lead glaze include: [14] X Research source Clay dishware with a shiny or transparent glaze Handmade artisan dishware Dishware with bright and vibrant colors on the inside surfaces Antique dinnerware Highly decorative and shiny dishware"
    },
    {
      "title": "Disposable cold-storage food containers",
      "content": "Disposable cold-storage food containers Plastic food containers that are meant for refrigerated items are often not meant to be heated, and are usually not designed for the microwave. Chiu says this includes styrofoam. [15] X Expert Source Raymond Chiu House Cleaning Professional Expert Interview. 15 October 2019. It also includes containers made for: [16] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source Yogurt Butter or margarine Cottage cheese"
    },
    {
      "title": "Brown paper products",
      "content": "Brown paper products The USDA Food Safety and Inspection Service states that while it is safe to microwave white paper products, brown paper products should not be microwaved. [17] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source This includes brown paper lunch bags and brown paper towels, as well as newspaper."
    },
    {
      "title": "Spread out your food.",
      "content": "Spread out your food. Microwaves aren’t great at heating food evenly, which is why they need a turntable to spin your food. Still, sometimes they can overheat a certain portion, causing it to explode. To prevent this, spread out your food in your microwave-safe dish, so that it cooks evenly. [18] X Research source Also, stir the food halfway through the cook time to distribute the heat evenly. Make sure the food is in a single layer, if possible. In addition, debone meat, and add a spoonful of water to dry dishes."
    },
    {
      "title": "Cover it loosely with a lid or paper towel.",
      "content": "Cover it loosely with a lid or paper towel. Microwave cooking makes steam, which helps heat and sterilize the food. It’s best to trap that steam so that your food cooks efficiently, but don’t trap it so much that it expands and explodes. Cover the dish with a loose lid, paper towel, or plastic wrap while it heats. [19] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source"
    },
    {
      "title": "Let it sit for a minute before you take it out.",
      "content": "Let it sit for a minute before you take it out. Food continues to cook even after the microwave stops heating it. During this time, it’s still hot, and could burn you, so let it rest in the microwave for an extra minute or 2 before you retrieve it. [20] X Research source Use oven mitts or a paper towel to protect your skin as you take your food out."
    }
  ]
}