{
  "url": "https://www.wikihow.com/Speak-Singlish",
  "title": "How to Speak Singlish",
  "steps": [
    {
      "title": "Reduce the use of stresses in your speech.",
      "content": "Reduce the use of stresses in your speech. English is a language that makes frequent use of stresses, or stressing certain syllables in sentences and words more than others. Singlish is more homogenous with its syllables. So try to speak with more consistent stressing of the syllables in your sentences. [1] X Research source For this reason, Singlish often sounds somewhat monotone to foreigners. For example, instead of saying \"I LIKE this a LOT,\" you'd speak each syllable with more or less the same amount of emphasis, just like \"I like this a lot.\""
    },
    {
      "title": "Reduce your use of voiced consonants.",
      "content": "Reduce your use of voiced consonants. Voiced consonants include \"g\", \"p\", \"th,\" \"ch\", and \"v\". Think of Singlish pronunciation as more relaxed and less strong. Words like \"pat\" are pronounced like \"bat,\" because the strength behind the consonant \"p\" is lost. \"Birth\" becomes \"biff\" and \"with\" becomes \"wiff\". [2] X Research source"
    },
    {
      "title": "Use rise and fall intonation to emphasize.",
      "content": "Use rise and fall intonation to emphasize. A rise and fall intonation is when you go up and then back down in pitch on a single syllable. This can increase the emphasis of approval or disapproval in speech, depending on the word being used. For example, the word \"no\" can be said without any change of intonation, or it can be said with a high rise and fall in pitch to increase the urgency and importance of the exclamation."
    },
    {
      "title": "Use the Singlish variation of asking yes or no questions.",
      "content": "Use the Singlish variation of asking yes or no questions. A common way of asking yes or no questions in Singlish is to phrase the question as a statement and then add the Cantonese-derived word \"meh\". You also must have a rising inflection as you get to the end of the sentence, just like the way questions are inflected in English. [3] X Research source For example, \"can you do that?\" in Singlish would be phrased as \"you can do that meh?\""
    },
    {
      "title": "Use \"lah\" to emphasis certainty.",
      "content": "Use \"lah\" to emphasis certainty. The Singlish word \"lah\" is the opposite of \"meh\". Whereas \"meh\" turns a statement into a question, \"lah\" makes you sound sure of your statement. Incorporate \"lah\" into the end of your sentences when you want to assure someone of your certainty. It changes the tone of the statement, not its meaning. [4] X Research source"
    },
    {
      "title": "Lose your prepositions, verb conjugations, and plural words.",
      "content": "Lose your prepositions, verb conjugations, and plural words. Singlish takes a lot of its grammar from Malay, so it makes much less use of prepositions, verb conjugations, and plural words. [5] X Research source Prepositions are words that describe the relationship between verbs and nouns and nouns and nouns. Prepositions include words like \"before,\" \"after,\" \"in between,\" and \"throughout.\" So the English sentence \"he sat in front of her\" might be reduced to \"he sat front her\" in Singlish. Verb conjugations are the different forms of verbs for different uses, like we go versus he goes . So instead of saying \"he goes there everyday,\" you'd say \"he go there everyday.\" The use of plural words is infrequent in Singlish. If you can get across your meaning without uses the plural form of a noun, use the singular. For example, \"I ate grapes\" would be \"I ate grape.\""
    },
    {
      "title": "Use present tense mainly.",
      "content": "Use present tense mainly. Singlish doesn't make a lot of use of past tense verbs, unlike standard English. So instead of saying \"what happened yesterday?\" you'd say \"what happen yesterday?\" And \"you went where?\" becomes \"you go where?\" [6] X Research source"
    },
    {
      "title": "Drop the subject of the sentence when it's unnecessary to get the meaning across.",
      "content": "Drop the subject of the sentence when it's unnecessary to get the meaning across. In colloquial English, we sometimes drop the subject from our sentences, such as saying \"Finished?\" instead of \"Are you finished?\" This is done much more often in Singlish. [7] X Research source For example, \"I don't want that\" would be \"don't want,\" and \"finish already\" could mean \"I finished already\" or \"they finished already\" depending on the context."
    },
    {
      "title": "Study an online Singlish dictionary.",
      "content": "Study an online Singlish dictionary. There a number of well-researched Singlish dictionaries online that provide many examples of common Singlish words and phrases and their English translations. Singlish is a combination of English, Malay, several Chinese languages, and Tamil, so there are many words used in Singlish that don't come from English. [8] X Research source Do a search for Singlish dictionaries to find resources for building your Singlish vocabulary. A good resource is http://www.singlishdictionary.com/ ."
    },
    {
      "title": "Memorize some of the common phrases used in Singlish.",
      "content": "Memorize some of the common phrases used in Singlish. There's too much Singlish vocabulary to list out all the common phrases and words here, but here are some of the more useful ones: [9] X Research source Arrow: to order someone to do something. \"My boss arrow me to do this for me!\" Maken liao?: have you eaten already? Sian ah!: I am very frustrated. Alamak!: Exclamation of unhappiness. Oh ya hor!: Oh yes I agree with you. Why you like that one?: Why do you act like that? Can meh?: Can this task be done? Wah lau!: Wow! Buay Tahan: I can't take it! Blanjah: to treat someone to a drink or meal."
    },
    {
      "title": "Memorize the uniquely Singlish words added to the end of sentences.",
      "content": "Memorize the uniquely Singlish words added to the end of sentences. As previously stated, \"lah\" and \"meh\" are added to the end of Singlish sentences to change the tone or meaning of the statement. \"Lah\" emphasizes certainty and \"meh\" turns something into a yes or no question. There are other words like this used in Singlish. [10] X Research source Some of these are: \"Leh\" is used similarly to \"lah\" but the tone it puts across is more like you're trying to get someone to understand something. It's an exclamation of frustration, as in the statement \"I don't know leh!\" \"Liao\" is a frequently used expression that means \"already,\" as in the sentence \"I did that liao leh!\" \"Hor\" asks for the listener's agreement, as in the phrase \"This nice hor.\""
    },
    {
      "title": "Talk with Singaporeans.",
      "content": "Talk with Singaporeans. The best way to learn an informal patois such as Singlish is to hear it spoken fluently. If you have friends who speak Singlish, see if they'll chat with you. You could also try attending Singaporean cultural events in your area or looking for meetups online. You could also study abroad in Singapore, or visit for an extended period. Immersion is one of the best ways to learn any language."
    },
    {
      "title": "Use Singlish respectfully.",
      "content": "Use Singlish respectfully. If you're a foreigner visiting Singapore, it's unnecessary to try to adopt the use of Singlish in order to communicate, as Singaporeans as a group understand standard English very well. If you try to speak Singlish with the locals, they'll likely find that amusing. There's always the risk that some will find it condescending, so be careful not to speak Singlish in a mocking manner. [11] X Research source Visiting or living in Singapore for an extended period of time is a situation where it would appropriate to try to learn Singlish. Learning it will help you understand those around you without them having to switch to standard English for your benefit."
    }
  ]
}