{
  "url": "https://www.wikihow.com/Start-Waist-Training",
  "title": "How to Start Waist Training",
  "steps": [
    {
      "title": "Understand how waist trainers work.",
      "content": "Understand how waist trainers work. Waist trainers are not a replacement for diet or exercise. They may only achieve temporary results. Waist trainers function by squeezing in fat tissue to reduce fluid in your tissue. This then compresses and displaces your internal organs. Use waist trainers with caution. Waist trainers can cause discomfort, difficulty breathing, or even heartburn. If you experience any of these symptoms, take the waist trainer off immediately."
    },
    {
      "title": "Know the difference between a steel-boned corset and a cincher.",
      "content": "Know the difference between a steel-boned corset and a cincher. [2] X Research source Steel-boned corsets and cinchers offer more support and cinching than latex waist trainers. Latex waist trainers, however, can help boost the heat at the body’s core, which can help burn belly fat faster. [3] X Research source Latex waist trainers are more like cinchers than full corsets. When worn they will immediately make your waist look an inch or two smaller, whereas a full corset will immediately take several inches off the appearance of your waist plus the other areas it covers. Steel-boned corsets also offer more postural support, cinching, and hourglass shaping than latex trainers. [4] X Research source There are different types of cinchers. They are mostly made from latex, spandex, or nylon, and some have plastic boning. Cinchers are believed to be more comfortable to work out in and sleep in than steel-boned corsets, although it is still possible to sleep in a steel-boned corsets. When a steel-boned corset is fitted correctly to your body, it should also be quite comfortable for sleeping, but not for exercise."
    },
    {
      "title": "Consider your wardrobe.",
      "content": "Consider your wardrobe. Both latex cinchers and steel-boned corsets can show through your clothing. Steel-boned corsets are bulkier than cinchers, making cinchers the better choice for more fitted outfits. Cinchers will still show through sheer shirts and flimsy fabrics, so keep this in mind when choosing a cincher color. If you are really committed to waist training, and you have the money to spend, you might consider getting a couple of different trainers or corsets just so you have some selection."
    },
    {
      "title": "Know which waist trainer to wear, and when.",
      "content": "Know which waist trainer to wear, and when. Make sure that you know what you can and can’t do while wearing a waist trainer. Experts recommend against doing abdominal exercises while wearing a waist trainer. [5] X Research source Some companies offer different types of waist trainers for different purposes. As an example, one company sells work-out corsets, but even these cannot be worn for all types of exercises. [6] X Research source If you have a steel-boned corset, do not work out in it. This is not made for working out in, although you can sleep in it. [7] X Research source"
    },
    {
      "title": "Measure your natural waist size",
      "content": "Measure your natural waist size . You’ll need to know your natural was it size in order to choose the right size of waist trainer. Here’s how to measure your waist: Remove any clothing that is covering your midsection. Your waist is between the bottom of your ribs and the tops of your hip bones. It’s generally the narrowest part of your torso, where you bend from side to side. [8] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. Wrap a measuring tape around your waist, keeping it parallel to the floor so that it sits evenly around your waist. Make sure that it fits snugly against your torso but doesn’t dig into it. Don’t suck in your stomach as this will make your waist seem smaller than it is. Breathe in and out to gauge roughly where your waist sits at its natural state. Look down. Wherever the end of the measuring tape is sitting while you’re relaxed with it evenly around your waist, that’s your natural waist size. As an example it might read 29 inches (or more, or less)."
    },
    {
      "title": "Ensure a proper fit.",
      "content": "Ensure a proper fit. Sizing can differ slightly depending on the manufacturer, so always be sure that you’re clear on the sizing before ordering your corset. For steel-boned corsets, some manufacturers say that if your waist is under 38 inches, you should order a corset with a waist size that is 4 to 7 inches smaller, and if your natural waist is over 38 inches, order a corset that is 7 to 10 inches smaller. [9] X Research source So if your waist is 29 inches, try starting with a corset with a 25-inch waist. For latex waist trainers the sizing is a bit more straightforward. Just choose the trainer size that is in line with your natural waistline. If you have a 29-inch waistline, you’ll probably want to choose a waist trainer that fits a 28- to 30-inch waistline. If you have any doubts whatsoever about sizing or fit or anything else, it’s always best to contact the manufacturer directly. They will be able to tell you more about the specific sizing of their products, and can help you make the right choice. Both steel-boned corsets and latex waist trainers should lie flat against your midsection. If they roll up, bulge, or buckle at all, they are likely too small, and you should get a larger size."
    },
    {
      "title": "Choose a high-quality waist trainer.",
      "content": "Choose a high-quality waist trainer. Well-made corsets and waist trainers will feel strong and secure. The seams will be well-stitched and, if they have bones, these will not dig into your body when the corset is on. If it’s a lace-up corset or cincher, the grommets should also be well secured, and the corset should not buckle under the tension of being laced up. [10] X Research source If you are buying your waist trainer online, be sure to read lots of online reviews before buying it. It’s something that you’ll be wearing every day, for several hours a day, so get the highest-quality one that you can afford."
    },
    {
      "title": "Strengthen your core before and during waist training.",
      "content": "Strengthen your core before and during waist training. This will help prevent your core muscles from atrophying once you’re wearing a trainer for several hours a day. Don’t take this advice lightly, otherwise you’ll end up being dependent on the waist trainer to hold you up. [11] X Research source Failing to work out before and during waist training will give you the opposite of your desired effects. Your stomach will look flabby due to a lack of stomach muscles as your waist trainer has taken over for your core in holding your body upright. [12] X Research source Some good core exercises include planks, side twists, weighted crunches, and leg lifts. Aim to do these exercises 3 times each week. [13] X Research source </ref> While some people do work out while wearing waist trainers, doctors recommend against it as it can interfere with your ability to breathe, make it difficult for you to get a full workout, and contribute to back acne. [14] X Research source"
    },
    {
      "title": "Know how to put on your waist trainer.",
      "content": "Know how to put on your waist trainer. Your waist trainer should come with instructions on how to put it on. These may depending on the style and manufacturer, but here are some general instructions: Many people find it helps to wear a thin-fabric top beneath the corset to prevent skin irritation. A soft camisole or close-fitting tank top will do nicely. For a steel-boned corset, loosen it all the way and undo any snaps. Ensure that it is right side up and slide it around your body, with the snaps at the front and laces at the back. If your corset has a modesty flap (the panel of fabric that sits beneath the laces on your back), it should just touch the other side of the corset. Before tightening the laces, hook the eyes. It can help to start at the middle. Next, reach behind and grab your lacing loops, then pull them away from you to tighten the waist. For a latex waist trainer, there are no laces involved. There will likely be two sets of snaps at the front of your trainer (i.e. these sit on your stomach). Start at the widest setting (the first set of snaps), and then move on to the tighter setting as you grow accustomed to the trainer."
    },
    {
      "title": "Breaking in (aka “seasoning”) your corset.",
      "content": "Breaking in (aka “seasoning”) your corset. For the first several days of wearing your waist trainer or steel-boned corset, make sure that you take time to slowly break it in: [15] X Research source For a steel-boned corset, don’t lace it too tightly when first putting it on. It should fit snugly, but you should still be able to slide at least a few fingers or even your whole hand in the top or bottom of the corset. The boning will adjust to your shape with time. After wearing it for about an hour, you can tighten it more."
    },
    {
      "title": "Don’t tighten too much too fast.",
      "content": "Don’t tighten too much too fast. If you tighten your corset before you and it are ready, you’ll risk warping the corset and possibly even hurting yourself. Go slow. A properly seasoned corset will mould to your body, making it much more comfortable to wear. [16] X Research source Regardless of what type of waist trainer you’re wearing, remember not to go too tight the first time you put it on. Give it time to mould to your body, and it will be much more comfortable and effective in the long run."
    },
    {
      "title": "Slow and steady wins the waist.",
      "content": "Slow and steady wins the waist. From days 4 to 14 of wearing your corset or trainer, Gradually increase your wear time from 1.5 to 2 hours a day to 6 to 8 hours a day, or more. [17] X Research source Don’t immediately start wearing your corset for 12 hours a day. Even when you’re advanced, you can get away with 6 to 8 hours a day and still see results. Latex waist-trainer experts recommend wearing them for 8 to 10 hours each day. Some people wear their steel-boned corsets for up to 23 hours a day. Be sure to know the risks involved with lengthier periods of waist-training. Above all else, make sure that you are never in pain. [18] X Research source"
    },
    {
      "title": "Start seeing results.",
      "content": "Start seeing results. You should start seeing results within a month of wearing your waist trainer, but it can take longer. If you’re already quite slim and fit, you might not see a significant change for up to 2 months. Your results will depend on your lifestyle (i.e. diet and exercise), body type, and how long you wear the waist trainer each day."
    },
    {
      "title": "Plan your outfits.",
      "content": "Plan your outfits. You’ll be able to see the corset through a lot of shirts, so make sure that nothing is too thin, flimsy, or sheer, otherwise you’ll be able to see the corset through it. [19] X Research source"
    },
    {
      "title": "Know when to take it off.",
      "content": "Know when to take it off. If you experience pain, numbness in your limbs, or stomach issues such as acid reflux or heartburn, loosen or remove your waist trainer or corset. [20] X Research source"
    },
    {
      "title": "Keep it clean.",
      "content": "Keep it clean. Be sure to hang your corset up to air out after wearing it. Place its laces over the hanger so that they don’t drag the corset down or get caught in anything. Unless the manufacturer tells you otherwise, you should never wash a corset. If you spill something on your corset, you can probably spot clean it with a damp cloth, but that’s the extent of it. Each manufacturer will have their own cleaning instructions, so check with them before cleaning your corset."
    },
    {
      "title": "Adopt a healthy lifestyle.",
      "content": "Adopt a healthy lifestyle. Drink enough water, eat a healthy diet, and exercise regularly. Doing all of these things will help you see more significant results while waist training. [21] X Expert Source Laura Flinn NASM Certified Personal Trainer Expert Interview. 18 November 2019. It can also help to avoid foods and drinks that make you bloat, which will be doubly uncomfortable when you’re wearing a corset or latex waist trainer. Many doctors agree that proper nutrition and regular exercise will do more to trim your waist than a waist trainer will. [22] X Research source Planks and twisting crunches are recommended."
    }
  ]
}