{
  "url": "https://www.wikihow.com/Tell-if-Someone-Is-a-Eastern-Star",
  "title": "How to See If Someone Is Part of the Order of the Eastern Star",
  "steps": [
    {
      "title": "Contact the secretary of the chapter in the country they lived in.",
      "content": "Contact the secretary of the chapter in the country they lived in. If they lived in the United States, search for the OES secretary in the state they lived in and ask if the person was a member. [1] X Research source Make sure to provide their full (married and maiden) name, birth date, death date, and the towns they lived in during their life. Australia : Email wgsecretary@oes.australia.org.au. Bolivia: Email grandcapitulodebolivia@gmail.com. Brazil: Email grandecapitulodoestadodesaopaulo2021@hotmail.com. Canada (Alberta) : Email gsecretary@easternstar-ab.ca. Canada (British Columbia and Yukon) : Email grsecbcy@gmail.com. Canada (Manitoba) : Email grsec@oesmanitoba.ca. Canada (Ontario) : Email grandsecretary@bell.net. Italy : Email gransegreteria@ordinestelladoriente.it. Scotland: Email wgsecoesscotland@gmail.com."
    },
    {
      "title": "Look for an Eastern Star emblem on their headstone.",
      "content": "Look for an Eastern Star emblem on their headstone. Each chapter has its own version of the emblem, but most of them include the upside-down five-pointed star with an altar and book (the Holy Bible) in the center. At each point of the star is a different symbol—a sheaf (or bundle) of barley, a sword and veil, a crown and scepter, a chalice, and a broken column. [2] X Research source Depending on the year they died and how close they were to the Order, they might have had a floral version of the symbol placed on top of their grave instead. [3] X Research source The symbols in the 5 points of the star refer to the 5 heroines or Biblical figures, which the 5 virtues of the Order are based on. Some symbols have a hexagon in the center of the star with the letters “FATAL” along each side. Only official members of the Order know what each letter stands for."
    },
    {
      "title": "See if they had personal belongings with Eastern Star symbols.",
      "content": "See if they had personal belongings with Eastern Star symbols. If you have the person’s belongings, look for rings, brooches, aprons, mugs, sashes, banners, or any other items with “OES” or the Eastern Star symbol on them. [4] X Research source They might also have a dues card that proves their membership and includes the symbol of the Order and their signature. They might also have clothing, lapel pins, hats, keychains, and other memorabilia with either the five-pointed star or “OES” in the five colors (yellow, red, green, blue, or white) on them. If you don’t have the person’s belongings, but you know a few of their living family members, reach out to them and ask if they know whether the person was a member."
    },
    {
      "title": "Find out if they were married or closely related to a Freemason.",
      "content": "Find out if they were married or closely related to a Freemason. Although the Order is now open to both men and women, when it was established in 1850 it was meant for women who were related or married to Freemasons to earn Masonic degrees. [5] X Research source If the person was married to or closely related to a Freemason, they might have been part of the OES. However, not all women married or related to Freemasons were automatically OES members. The best way to know for sure is to contact the chapter in the place they lived. Today, women who are related to Master Masons (by birth, marriage, or adoption) in good standing of a Lodge of the Masonic fraternity are eligible to be members of the OES."
    },
    {
      "title": "Ask them directly if they’re a member of the Order of the Eastern Star.",
      "content": "Ask them directly if they’re a member of the Order of the Eastern Star. OSE members are allowed to tell non-members that they belong to the Order. Although Masonic Organizations have a history of being secretive, today, most members are allowed to tell non-members almost anything about their group. [6] X Research source However, a member’s comfort level telling you about the group might vary—some people might be afraid to mention anything more than their status as a member. [7] X Research source"
    },
    {
      "title": "They belonged or currently belong to a Masonic Order.",
      "content": "They belonged or currently belong to a Masonic Order. Those who are Master Masons in good standing of a Lodge are also eligible to join the OES—if they’re a Freemason, they might also be an OES member. They might also be a member if they’ve reached age 18 and are members of the International Order of the Rainbow for Girls or Job’s Daughters International. They might also be part of the OES if their relative or spouse is a Freemason, however, this is definitely not a for-sure sign that they’re a member. Job’s Daughters International is a leadership organization for girls between the ages of 10 and 20. [8] X Research source The International Order of the Rainbow for Girls is a charitable group open to girls aged 11 to 20. [9] X Research source"
    },
    {
      "title": "They have the Eastern Star symbol in their house or on their belongings.",
      "content": "They have the Eastern Star symbol in their house or on their belongings. Masonic orders aren’t secret organizations, and while some might not show off their emblems, others might wear them with pride. If the person wears the Eastern Star emblem (the upside-down five-pointed star) on their clothing or has it displayed in their home, they might be an OES member. [10] X Research source The Eastern Star emblem has an altar and book (the Holy Bible) in the center of the star. Sometimes it includes a hexagon with the letters “FATAL” in it. [11] X Research source In each point of the star is the color yellow and a sheaf (or bundle) of barley, blue and a sword and veil, white and a crown and scepter, red and a chalice, and yellow and a broken column. [12] X Research source"
    },
    {
      "title": "They have art or possessions that reference the 5 heroines.",
      "content": "They have art or possessions that reference the 5 heroines. The stories of Adah, Ruth, Esther, Martha, and Electa, the 5 Biblical heroines, form the virtues and morals of the OES. If the person has a portrait of any of these figures or has possessions that reference their stories, it may be a sign that they are a member of the Order of the Eastern Star. Adah (from Judges) symbolizes fidelity, Ruth (from Ruth) is constancy (faithfulness), Esther (from Esther) is purity, light, and joy, Martha (from St. John) is hope and immortality, and Electa (from II John) is fervency (warmth and intensity). [13] X Research source Each heroine corresponds to a point in the star emblem—Adah is the sword and veil, Ruth is the sheaf of barley, Esther is the crown and scepter, Martha is the broken column, and Electa is the chalice. [14] X Research source"
    },
    {
      "title": "The Order of the Eastern Star is a charitable fraternity for men and women.",
      "content": "The Order of the Eastern Star is a charitable fraternity for men and women. The OES is an organization that supports charitable outreach, lasting friendships, and loving kindness toward all people. Members have supported philanthropic projects like cancer research, service dogs, regenerative medicine, and disaster relief. Although its teachings are based on the Bible, the OES is not a Christian organization. However, to join you have to affirm your belief in a Supreme Being. [15] X Research source The signs, passes, handshakes, words, and other forms of recognition between members during initiation are a few of the only aspects of the Order that are still kept secret."
    },
    {
      "title": "Contact the local chapter in your area and ask for a petition form.",
      "content": "Contact the local chapter in your area and ask for a petition form. You can ask for a petition form by email, by asking a known member of the chapter, or visiting the chapter during one of their events or open houses. If you live in the United States, you can submit a membership inquiry here and fill out an online petition form. To see when the next open house is, go to the website of the OES chapter in your state or country and look for their event calendar. If you’re a Freemason in good standing, a woman older than 18 who’s related to a past or present Freemason, or a member of IORG or JDI, you’re eligible to join the Order."
    },
    {
      "title": "Submit the completed petition form to the chapter.",
      "content": "Submit the completed petition form to the chapter. The form asks for your date of birth, the name of the Freemason you’re related to and your relationship (mother, daughter, etc.), your address, your phone number, and your name. You also have to confirm that you’re 18 years old, you’ve lived in your state or country for at least 6 months, and you believe in the existence of a Supreme Being. If you’re already a member of OES and you’d like to join a new chapter, submit a petition to your local chapter to become affiliated."
    },
    {
      "title": "The chapter will investigate and vote on your petition.",
      "content": "The chapter will investigate and vote on your petition. The OES chapter carefully reads and investigates your petition, then asks to meet with you to answer any questions you have about membership. The local chapter will then vote on your petition and work with you to schedule an initiation if it’s approved. The Order says it strives to select people of mental, moral, and spiritual quality who will work to fulfill its objectives. [16] X Research source"
    },
    {
      "title": "Celebrities and other famous members of OES",
      "content": "Celebrities and other famous members of OES The Order of the Eastern Star has had tons of well-known members, including First Lady of the U.S. Eleanor Roosevelt and President Harry Truman. [17] X Research source Other notable members include: Laura Ingalls Wilder: American author of the Little House on the Prairie series. Her mother Caroline and sister Carrie are also members. [18] X Research source Maya Angelou: [19] X Research source American poet, activist, and autobiographer who wrote I Know Why the Caged Bird Sings and other famous works. [20] X Research source Clara Barton: American teacher, nurse, and humanitarian. She’s best remembered for organizing the American Red Cross. [21] X Research source Rosa Parks: African American civil rights activist who refused to obey a bus driver’s order to give up her seat to make room for a white passenger. [22] X Research source Ruth M. Kirk: U.S. Democratic member of the House of Delegates from 1983 to 2011. [23] X Research source Ruth Ann Minner: Delaware’s first female governor and the longest serving female governor in American history. [24] X Research source Zora Neal Hurston: [25] X Research source American writer and anthropologist who studied Black folklore and wrote Their Eyes were Watching God among other works. [26] X Research source Nikki Giovanni: [27] X Research source American poet, civil rights activist, and professor at Virginia Tech’s College of Liberal Arts and Human Sciences. [28] X Research source Martha Griffiths: American lawyer and judge appointed to the House of Representatives in 1954, responsible for including the prohibition of sex discrimination under Title VII in the Civil Rights Act of 1964. [29] X Research source Maxine Waters: U.S. Democratic member of the United States House of Representatives since 1991, representing California. [30] X Research source Colleen Dewhurst: Canadian actress and wife of Freemason, actor, and director George Campbell Scott. [31] X Research source Dale Evans: American writer, movie star, and singer-songwriter. She was the second wife of singer, actor, rodeo performer, and Freemason Roy Rogers. [32] X Research source Everett Dirksen: U.S. Republican congressman and senator, representing Illinois. Elected senate minority leader in 1959. [33] X Research source"
    }
  ]
}