{
  "url": "https://www.wikihow.com/Use-Duolingo",
  "title": "How to Use Duolingo",
  "steps": [
    {
      "title": "Sign up via Facebook or email.",
      "content": "Sign up via Facebook or email. When you visit Duolingo's main page, you'll be asked to sign up in one of two ways. If you choose to sign up via email, you can link your Facebook account to Duolingo later. If you choose to sign up via Facebook, it'll be easier for you to invite friends later. You can also automatically share updates and progress on your Facebook timeline."
    },
    {
      "title": "Select a language.",
      "content": "Select a language. When you're creating a new account, you'll be asked to select the language you want to learn. This choice isn't set in stone, though — you can always change your mind or add new languages later. The current options for English-speakers are: [1] X Research source Spanish French German Japanese Italian Korean Mandarin Chinese Russian Arabic Portuguese Hindi Turkish Dutch Latin Swedish Greek Irish Polish Norwegian (Bokmål) Hebrew Vietnamese Hawaiian High Valyrian Danish Indonesian Romanian Welsh Czech Scottish Gaelic Swahili Hungarian (still in Beta) Ukrainian Klingon (still in Beta) Navajo (still in Beta) Esperanto Finnish Yiddish (still in Beta) Haitian Creole (still in Beta)"
    },
    {
      "title": "Enter your account details.",
      "content": "Enter your account details. When you're first signing up, you'll only need to enter a username and password. If you'd like to add more to your profile, though, you can do so by clicking the gear icon in the upper-right corner and selecting Settings. You can add your: Full name Location Short bio Facebook account (as well as whether you'd like to automatically share progress on Facebook) Twitter account Profile picture"
    },
    {
      "title": "Set up reminders.",
      "content": "Set up reminders. Duolingo works best when you practice every day, though it can be easy to forget. Set up daily nudges to drill your vocabulary to stay on track. Go to notification settings: https://www.duolingo.com/settings/notifications Check the box next to \"Email me when...\" and select a time. Try to choose an hour when you can be fully focused on learning the language. The end of the day (an hour before you go to bed) might be a good time to use at first--you can get the language into your memory right before you go to bed."
    },
    {
      "title": "Click Home to access your road map.",
      "content": "Click Home to access your road map. The road map is where you'll do the majority of your learning. It's split into different units, and each unit contains multiple lessons. As you progress through the language, more units will be available to you (you'll be able to unlock them). There are multiple levels per unit (specified by \"Lesson X of Y\"). Once you click on each lesson, you'll see what percentage of the way you are to the next level. You can level up either by finishing all of the required lessons in your level or taking the test. The old skill tree was replaced in August of 2022; however, Duolingo remembers what skills you learned and uses that to adapt the lessons in the future parts of the road map."
    },
    {
      "title": "Test out of what you already know (optional).",
      "content": "Test out of what you already know (optional). If you already have a basic grasp of the language, you can advance ahead with a test. Select \"Jump Here\" next to the unit that you want to unlock. Since this is a test of your knowledge, you must make less than four mistakes in order to pass. That means, if you lose all three hearts, you'll still have one more chance, but if you make one more mistake after that, you won't test out. You can try again as many times as you'd like, though. If you test out, you'll be able to level up! If you are a beginner to your language or do not know the content in your skill very well, it is highly advisable that you start with the lessons until you know the content well. In order to gain a greater comprehension of the language, take screenshots of the lesson content, and write and/or speak using the words and/or sentences in Duolingo."
    },
    {
      "title": "Click on the first lesson underneath the road map.",
      "content": "Click on the first lesson underneath the road map. Within each unit, there are multiple lessons. Click the first one to get started. Unlike the tests, there is no limit on the number of questions you can get wrong, though you must get all of them correct in order to pass. Here are the different types of questions within a lesson: Vocabulary: You'll see a picture of the item and be asked to name it in either your native or target language. Translation: You'll be asked to translate a word or sentence out of English and into the other language, or vice versa. Listening: You'll hear an audio clip of a word or sentence and be asked to type it in. You'll see \"Type what you hear\" above it. (Note that you won't be translating for these questions — for instance, if you hear the sentence in Spanish, type it in Spanish, not English.) To play the clip more slowly, click the smaller turtle icon beneath the main speaker button. Clicking \"Can't listen now\" will turn these off for fifteen minutes. Speaking (optional): You'll be asked to repeat or translate sentences using the microphone on your computer or mobile device. This is only available in select languages. If you don't want to do the speaking questions, click the gear in the upper right corner, choose Settings, and switch the microphone option to off. Handwriting: You'll be asked to write down a specific character on screen. Initially there may be guides when you first learn, but eventually you will have to remember the specific stroke order. This is only available in Arabic, Greek, Hebrew, Japanese (Hiragana/Katakana, no Kanji), Korean (Hangul, no Hanja), Russian, Ukranian, Yiddish, and Hindi, however there are plans to expand this feature further to other languages with non-Latin scripts. [2] X Research source This is only done when using the \"Learn the Characters\" menu in Duolingo."
    },
    {
      "title": "Hover or tap over words for help.",
      "content": "Hover or tap over words for help. If you're not sure about a word, hover over it with your cursor. Duolingo will either provide the translation or give you a few options. Note that as you get further along in your studies and your sentences become more complicated, this tool won't be as useful. Beware! Duolingo will note that you peeked. However, you won't lose any points for this."
    },
    {
      "title": "Use keyboard commands.",
      "content": "Use keyboard commands. Navigating through Duolingo lessons using the keyboard is a lot faster and easier than clicking. (It will also come in handy when you're doing timed quizzes.) Here's what to do: Enter: Submits an answer 1, 2 or 3: Selects a multiple-choice answer Up and down arrows: Scrolls through choices in a drop menu Ctrl + Space: Replay audio clip Ctrl + Shift + Space: Replay audio clip more slowly. Click the gear in the upper-right corner and select Help to see a visual table of keyboard commands."
    },
    {
      "title": "Practice!",
      "content": "Practice! The key to retaining your new language is drilling what you've learned. Stop and do a few practice rounds in between. If you only have five minutes to work on your language today, spend it on quizzing yourself. Duolingo offers a few different ways to test your skills: Practice overall: Go underneath the hearts and select \"Practice to earn hearts\", or through the practice menu on Super Duolingo. Practice individual units. You can do this by tapping on the trophy at the end of a unit to level it up to legendary. You can also replay individual lessons and stories."
    },
    {
      "title": "Try to maintain a Duolingo streak.",
      "content": "Try to maintain a Duolingo streak. Practice every day if you have time to. You'll get gems for maintaining your streak so that you can buy more benefits from the Shop, plus you'll have the reward of knowing your language well if you practice daily!"
    },
    {
      "title": "Follow friends.",
      "content": "Follow friends. If you'd like to follow someone else's progress, navigate to their profile. Click the blue \"Add friend\" button at the top of the page. From then on, you'll be following that person's progress. You can see how many points they've accumulated on the leader-board, at the right of your skill tree."
    },
    {
      "title": "Download the mobile app.",
      "content": "Download the mobile app. Duolingo is available for free on both iOS and Android. You can still do lessons, practice vocabulary, and translate pages from the app."
    },
    {
      "title": "Teach someone a new language!",
      "content": "Teach someone a new language! Go through lessons with others. Do it with your friend, your spouse, or even your children. Start off by giving them the meanings of basic words, then as they learn more, give them a sentence and translate it word-by-word for them. Practice speaking with that person, too. It only benefits you if you and that other person speak together. Introduce a new friend or family member to Duolingo. If you know someone that may enjoy learning a new language (or just gets bored easily!), you may want to invite them to Duolingo and show them how to use it."
    },
    {
      "title": "Write your sentences and thoughts in the new language.",
      "content": "Write your sentences and thoughts in the new language. For instance, if you're learning French and see a sentence about waking up, write a sentence about when you wake up and what you do after you wake up. As you learn more material, write more complicated thoughts and even journal entries."
    },
    {
      "title": "Further develop your comprehension of Duolingo stories.",
      "content": "Further develop your comprehension of Duolingo stories. If Duolingo stories and podcasts, try writing a summary of the plot and key ideas both in your native language and your target language. You can also write your reaction to the story/podcast, preferably in the language you are learning."
    },
    {
      "title": "Write a card or letter for someone in another language.",
      "content": "Write a card or letter for someone in another language. Address it to a native speaker of the language you are learning (and warn them that your spelling/grammar could be better as you are still learning with a polite \"sorry if my grammar isn't perfect - I have a lot to learn!\"). If you're addressing it to someone who does not know the language that well, make sure you provide translations and explanations."
    },
    {
      "title": "Turn Duolingo into a habit!",
      "content": "Turn Duolingo into a habit! Do it while you are on a road trip if you have WiFi, while waiting at the doctor's office...or just sitting in the house being a couch potato. It is better than watching TV or playing video games because you'll be working your brain in order to learn a new language."
    },
    {
      "title": "Try to travel to the country where the target language is spoken.",
      "content": "Try to travel to the country where the target language is spoken. That way, you get to immerse yourself in it more! If you can't travel there physically, you can watch a video or documentary about the country in the local language and/or talk to a foreigner in that language if you can."
    },
    {
      "title": "Interact with others on social media!",
      "content": "Interact with others on social media! Some users on Twitch, YouTube, TikTok, and similar will be understanding that you are learning a new language and will be able to provide guidance on accuracy as well as technicalities such as formality and politeness. There are also community Discord servers dedicated to language learning that you can practice."
    }
  ]
}