{
  "url": "https://www.wikihow.com/Stay-Fit-and-Beautifully-Healthy",
  "title": "How to Stay Fit and Beautifully Healthy",
  "steps": [
    {
      "title": "Find the time.",
      "content": "Find the time. Exercise is one of the most important aspects in staying (or becoming) fit and healthy. Experts recommend that you should aim to be active for at least 30 minutes per day. [2] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. Try scheduling your exercise the same way that you schedule other appointments and commitments. You'll be more likely to stick to it if it's on the calendar. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you're trying to tone-up or lose weight, you might need to exercise more than 30 minutes per day. If you belong to a gym, ask to have a consultation with a personal trainer. They can help you plan a regimen for your specific goals. Exercise in increments. If you are finding it difficult to block out 30 or 60 minutes of your day for exercise, try getting your movement in smaller chunks of time. For example, walk to work, take a walk at lunch, and walk home."
    },
    {
      "title": "Make it a habit.",
      "content": "Make it a habit. You will see the most benefits from exercise if you do it regularly. One good way to make a habit stick is to pick a form of exercise that you enjoy. For example, if you like swimming, make it a point to swim laps twice a week. [4] X Research source Make it easy to stick to your routine. Try setting out your workout clothes and your gym bag the night before. That way, you're all set to head out the door in the morning. Don't give up. It typically takes between 20 and 30 days to make a habit stick. Keep exercising, and eventually it will become a natural part of your day. Utilize technology. Try a gadget to help you track your movements, such as a fitbit. There are even free apps on your phone that you can set to remind you to get up and move once an hour. Reader Poll: We asked 126 wikiHow readers and 52% of them agreed that the best way to track your physical activity is with a fitness tracker or smartwatch . [Take Poll]"
    },
    {
      "title": "Go outdoors.",
      "content": "Go outdoors. There are definitely some perks to working out at a gym--air conditioning and televisions are a few. But scientists report that exercising outdoors, at least part of the time, can have major benefits. The varied terrain of a road, sidewalk or trail challenges your body in ways that the monotony of a treadmill or elliptical trainer can't do. [5] X Research source Exercising outside can also have positive benefits for your mental health. In studies, people who walked both outside and inside reported enjoying the activity much more when completed outside. Utilize your local park. Many parks will have great areas for running or walking. If you like sports, you can also make use of the tennis courts or basketball courts."
    },
    {
      "title": "Be social.",
      "content": "Be social. If you involve other people in your exercise routine, you'll see a positive impact in your results. Finding a workout buddy can help with accountability. If you schedule an activity with a friend, you are less likely to cancel than if you were only cancelling on yourself. [6] X Research source Group exercise classes also offer benefits. In classes, instructors can offer encouraging words. They can also motivate you and correct your form to make sure that you are doing each move safely and effectively. Working out is a great way to meet new people. Try joining a running club or a tennis league. You'll make friends with similar interests and stay in great shape."
    },
    {
      "title": "Vary your routine.",
      "content": "Vary your routine. It's great when you find an exercise that you enjoy. And there's no reason to give up something you love, like yoga or swimming. However, it can be beneficial to vary your exercise routine. Your body will respond positively to new challenges and you'll see greater results when you switch things up. [7] X Research source Your body will get used to a regular routine and will eventually start to spend less energy when you exercise. That means you'll burn fewer calories and might notice a plateau in your fitness goals. Try doing a mix of strength training and cardio. [8] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. For example, try running for two minutes, then stopping to do some core exercises, such as a plank or crunches. You can switch up the order of your exercises and add new ones to your routine. If you prefer to work out indoors, try using cardio equipment like a treadmill. You can visit a gym or purchase your own. You may even be able to find used equipment to purchase. Try changing your routine every two to four weeks to start seeing some faster results."
    },
    {
      "title": "Cook.",
      "content": "Cook. Eating right has a lot of benefits. It will help you maintain a healthy weight, improve your skin, and give you more energy. One of the best ways to eat a healthy diet is to cook your own food. Reports show that people who cook their own meals consume lower levels of sugar and fats. Cooking with fresh foods also helps you to eat fewer processed foods, which typically have high sodium levels. [9] X Research source Make cooking fun. Recruit family members to get involved, so that it feels like less of a chore. Give each family member a day of the week to request a certain meal and find a new recipe to try out. Being organized can help make cooking seem easier. Try planning your meals in advance. This will limit the trips you have to make to the grocery store, and will also help you stay on track with your fitness goals if you plan healthy weekly menus."
    },
    {
      "title": "Get the right nutrients.",
      "content": "Get the right nutrients. When you're cooking for yourself, you can fully control the ingredients you use. This will help you make sure you are getting the nutrients your body needs. Eating well can help control your weight, and it can also give you the energy you need to exercise regularly. Try to eat a diet that includes several servings a day of fresh fruits and vegetables. These are packed with vitamins and fiber. Eat lean meats and fish. These will provide you with protein and also give your body healthy fats. Make your plate colorful. The more color on your plate, the more fruits and vegetables you are likely eating. Try for leafy greens, like kale, and vibrant orange tones, like those in sweet potatoes and carrots."
    },
    {
      "title": "Talk to your doctor.",
      "content": "Talk to your doctor. You can plan a general, healthy diet for yourself. But if you have any special concerns about your weight or overall health, it's a great idea to consult your doctor. They can help you figure out the foods that will help you meet your fitness goals, whether it is maintaining your current fitness levels or losing weight. Your doctor can also help you figure out which foods to avoid. For example, if you suffer from high blood pressure, your doctor will likely recommend a reduced sodium diet. Ask your doctor before taking any weight loss supplements. While diet pills can be effective when used safely, it's best to check with your doctor about whether or not they are right for you. Ask your doctor for a referral to a registered dietitian. They can help you review your diet and plan meals to lose weight or maintain an already healthy lifestyle."
    },
    {
      "title": "Read labels.",
      "content": "Read labels. Pay attention to the nutrition labels on the foods that you buy. The information listed here can help you make healthy choices about what to put in your body. When reading labels, pay specific attention to the amounts of sugar, fat, and calories that are listed. You can see how much of the recommended daily allowance of sugar, for example, you should aim for. Pay attention to serving size. For example, if you want to have a bag of chips, read the package to see if the information tells you the calorie count for the whole bag. Sometimes, a third of the bag is considered a full serving. If you have hypertension, you may need to watch your salt intake. Make sure to read how much salt/sodium is in each product to make sure that you do not consume more than 1,500 mg a day. [10] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Canned foods and pre-prepared meals are often full of sodium. There are multiple different names for most ingredients. For example, sugar has at least 61 different names, including sucrose, high fructose corn syrup, dextrose, and rice syrup. [11] X Research source If you are trying to avoid a particular ingredient, make sure that you can recognize all of its different names."
    },
    {
      "title": "Build a positive body image.",
      "content": "Build a positive body image. Mental health is an important part of feeling fit and beautifully healthy. It can be hard to have a positive body image when we are inundated with pictures of very thin actresses and models. But there are ways you can learn to feel good about yourself, no matter your shape. A positive body image will help you stay motivated to eat healthy and work out. Find something you like about your looks and make that your focus. For example, if you have been running a lot lately, compliment yourself on how strong your legs are looking. Avoid negativity. Try not to criticize yourself. It's fine to want to make changes, but try to give yourself encouragement, rather than tearing yourself down. For example, instead of feeling bad about eating a bag of cookies, say to yourself, \"I guess now I have extra motivation to do 20 extra sit-ups tomorrow!\""
    },
    {
      "title": "Focus on how you feel.",
      "content": "Focus on how you feel. Body image is all about how you feel about how you look. So try to focus on positive feelings. Focus on the good things your body does for you, like give you the energy to play with your dog. When you feel healthy, you will also feel more fit and beautiful. Don't worry about the numbers on the scale. Instead, focus on how strong you feel and how your clothes fit. Base your personal fitness assessment on your energy levels and overall health, not on your weight."
    },
    {
      "title": "Don't compare yourself to others.",
      "content": "Don't compare yourself to others. It can be tempting to judge yourself based on how other people look. But experts say that comparing yourself to others can be damaging. For instance, it can lower your sense of self-worth. That can lead to lower self-esteem, and lower energy levels. [12] X Research source Make your own goals. Trying to look like someone else isn't going to help you achieve your goals. Instead, assess your fitness level by noting if you've made improvements and if you can see and feel a difference in your body. Think about your body frame size. Everyone is different. Some people have small frames, while others have a large frame. Yours might be medium. You can figure out your frame size by measuring the circumference of your wrist and consulting a height chart. Remember, if you have a large frame, you will have different weight goals than someone who is naturally smaller. Try keeping a daily journal, where you record positive statements about yourself. You can use this journal to track your exercise and diet, or you can just write down happy, self-affirming thoughts to keep you motivated."
    }
  ]
}