{
  "url": "https://www.wikihow.com/Tell-if-a-Girl-Is-Playing-Hard-to-Get",
  "title": "How to Tell if a Girl Is Playing Hard to Get",
  "steps": [
    {
      "title": "Ask her out",
      "content": "Ask her out and see if she gives you an open-ended \"no\". This technique keeps you chasing that bit of hope she offers you. She might say she's not available, but is free on another day. She might say \"no\" but tell you about an interesting place she wants to see. Or she might not commit to a date, telling you to wait and see. [1] X Research source A rejection or flat out, definitive, \"no\" means she's not interested. She won't be offering you a rain check or be in contact with you again. Learn to give her space and when to stop. If you ask her out too many times or too often, you will become less attractive and look desperate."
    },
    {
      "title": "Contact her and see how long it takes for her to respond.",
      "content": "Contact her and see how long it takes for her to respond. If it always takes her awhile to respond to your calls or texts, even just to say \"hi\", then she's probably playing hard to get. [2] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. And when she does respond, she might make up an excuse about how incredibly busy she was. She'll say she was at a party or hanging out with someone. She's showing you that she's a busy girl and is not entirely dependent on spending time with you. Her delayed responses should happen consistently and almost strategically. If she doesn't respond to you for days or makes up a weird excuse, it probably means she's not interested enough to respond back in time. Some girls just don't respond to texts or calls right away. Don't overanalyze this or get upset with her. If she's showing signs of being interested in you, take a breath and understand that people are often busy or forgetful."
    },
    {
      "title": "Watch if she shows you your competition.",
      "content": "Watch if she shows you your competition. A girl playing hard to get, will want to look hard to get. It's her way of showing you she has many options to choose from and could be taken by someone else at any moment. She might bring along some good-looking friends to a party to make you jealous. She'll tease you about people who have tried to hit on her, but failed. It may seem like she's ridiculing them, but she's really pointing out to you how attractive she is. If she talks about the people she's dating with you, then she's probably not interested and might just see you as a friend. Don't treat this as a failure but rather as the start of a blossoming friendship. However, not everyone can stay friends with someone they're interested in, so know when it's time to count your losses and find someone else."
    },
    {
      "title": "Look for physical signs of flirting.",
      "content": "Look for physical signs of flirting. Even if a girl is playing hard to get, it still means she's interested in you. And if she is, she'll be sending out subtle signs that she likes you. It can be hard to tell if a girl is flirting, so carefully observe her body language for these common signs of flirting: [3] X Research source [4] X Research source She's constantly touching you. She might touch your shoulder or arms while talking to you. Maybe she'll lean in close and rest her body against yours. There'll be many excuses or reasons why both of you are always touching. She smiles at you a lot. She might catch your eye across the room and give you a sweet, unsolicited smile. She draws attention to her body. She might bite her lip, fix her hair, or cross and uncross her legs. She may be doing these things unconsciously or purposely, but all these subtle moves draw your attention to a specific part of her body. She gives you special hugs. If she's not a hugger, then it's easy to tell when she's giving a hug reserved especially for you. It's an excuse to get closer to you and an affectionate expression. Even if you're not sure it's a special hug, be happy you're receiving such a nice gesture from her."
    },
    {
      "title": "Listen carefully to the way she speaks to you.",
      "content": "Listen carefully to the way she speaks to you. An interested girl will attempt to give you subtle suggestions through her speech. So it's important to learn to read between the lines . A simple “hello” could have seductive intentions if you listen closely enough to the way she says it. She laughs at your dumb jokes. You might tell the same joke to your friends and get a nice laugh or two, but when she hears it, it's hilarious . She wants you to feel like the star of the show, but don't get this mixed up with awkward laughter. She compliments you a lot. According to her, you're really funny, kind, and have nice hair. However, some girls might do the complete opposite and insult you. This is an age-old flirting technique used by almost everyone. It lowers the self-esteem of the target and oddly makes the insulter seem much more attractive. [5] X Research source . But don't mistake this for a girl who is truly disinterested in you. A few light-hearted insults does not harm, but if she's giving consistently hurtful insults, then it probably means she doesn't like you."
    },
    {
      "title": "Watch how she acts around you versus how she acts around others.",
      "content": "Watch how she acts around you versus how she acts around others. She might change drastically around you. Whether she becomes nervous or extremely aloof or flirtatious, a change in behaviour often signifies that she feels differently about you. You can usually tell what her normal behaviour is like when she's around her friends. If you can, observe her behaviour without her knowing that you're in the room. Watch if she changes once she notices you. She might straighten up, become quiet and serious, or be very happy to see you. Watch how her friends react around you. If they're whispering, giggling, or sneaking glances at you, it's likely you were the subject of their conversation and they're checking you out. Don't assume a change in behaviour means she's into you. She could be playing hard to get, or is just genuinely not interested."
    },
    {
      "title": "Play hard to get too.",
      "content": "Play hard to get too. If you're still not sure, take a turn at the game. It works even better if you know she's playing hard to get or is actually interested in you. Flirt with her sparingly. Keep her guessing if you're really interested in her. It's fun for both of you and keeps things fresh and entertaining. Stay mysterious . Drop hints about yourself to keep her curious about who you are. You'll look intriguing and more attractive. Some girls, even if they're the ones playing hard to get, might not appreciate this approach. After all, the point of playing hard to get is to force the person you're interested in to work harder for you - not less. Instead, play by her rules and show her just how much you'll do to win her affection."
    },
    {
      "title": "Back off and give her space.",
      "content": "Back off and give her space. Ultimately, you should let her decide how to let you know whether or not she likes you. The worst thing you can do is become obsessed with wanting to be with her. This can lead to incidents of harassment on your part. No means no. If she rejects your advances or tells you to stop contacting her, respect her wishes and stop. Don't ask her out constantly or demand her attention all the time. Don't stalk her or her friends to find information."
    }
  ]
}