{
  "url": "https://www.wikihow.com/Use-Shodan",
  "title": "What Is Shodan & How Do You Use It?",
  "steps": [
    {
      "title": "Navigate to the Shodan website at http://www.shodanhq.com/.",
      "content": "Navigate to the Shodan website at http://www.shodanhq.com/ ."
    },
    {
      "title": "Click on “Register” at the top right corner of Shodan’s home page.",
      "content": "Click on “Register” at the top right corner of Shodan’s home page."
    },
    {
      "title": "Enter a username, email address, and password, then click on “Submit.",
      "content": "Enter a username, email address, and password, then click on “Submit. ” Shodan will send you a verification email."
    },
    {
      "title": "Open the verification email and click on the URL provided to activate your Shodan account.",
      "content": "Open the verification email and click on the URL provided to activate your Shodan account. The Shodan login screen will open in a new window of your browser."
    },
    {
      "title": "Log into Shodan using your username and password.",
      "content": "Log into Shodan using your username and password."
    },
    {
      "title": "Enter search terms into the search field at the top of your Shodan session using a string format.",
      "content": "Enter search terms into the search field at the top of your Shodan session using a string format. For example, if you want to locate all Internet-connected devices in the United States that are currently using default passwords, enter “default password country: US.”"
    },
    {
      "title": "Click on “Search” to execute your search.",
      "content": "Click on “Search” to execute your search. The Web page will refresh and display a list of all devices, or banners that match your search terms."
    },
    {
      "title": "Narrow your search using a series of filters in your string command.",
      "content": "Narrow your search using a series of filters in your string command. Common search filters include the following: City: Users can limit search results to devices located by city. For example, “city:sacramento.” Country: Users can restrict search results to devices by country using the two-digit country code. For example, “country:US.” Hostname: Users can limit search results to devices by the value in their hostname. For example, “hostname:facebook.com.” Operating system: Users can search for devices based on operating system. For example, “microsoft os:windows.”"
    },
    {
      "title": "Click on any listing to learn more about that particular system.",
      "content": "Click on any listing to learn more about that particular system. Most listings will display explicit information about systems that include their IP address, latitude and longitude, SSH and HTTP settings, and server name."
    }
  ]
}