{
  "url": "https://www.wikihow.com/Treat-Diarrhea-in-Rats",
  "title": "How to Treat Diarrhea in Rats",
  "steps": [
    {
      "title": "Feed your pet store-bought rat pellets only.",
      "content": "Feed your pet store-bought rat pellets only. If your rat is experiencing diarrhea, stop feeding it treats, fresh fruits and veggies, or any foods other than commercial pellets. Keep it on a bland diet until its droppings have returned to normal. [1] X Research source Be sure to provide fresh, clean water at all times. Diarrhea can lead to dehydration, which potentially life-threatening. Sudden dietary changes and too much fresh food can lead to digestive issues. Use fresh fruits, vegetables, seeds, and nuts as treats, and offer them in moderation. Store-bought pellets labeled specifically for rats should comprise the bulk of its diet."
    },
    {
      "title": "Look for other concerning symptoms.",
      "content": "Look for other concerning symptoms. If your rat is behaving normally, digestive issues might just be a minor, temporary issue. However, diarrhea accompanied by symptoms such as blood in the stools, lethargy, changes in mobility, unusual growths, or abdominal tenderness could be signs of serious illness. [2] X Research source If you notice any serious symptoms, bring your rat to the vet."
    },
    {
      "title": "Wash its cage",
      "content": "Wash its cage and food and water bowls thoroughly. Since diarrhea can be caused by bacteria, viruses, and fungi, maintaining sanitary conditions is important for both you and your pet. When you notice your rat is sick, discard soiled bedding, scrub buildup inside the cage, and wash it with hot, soapy water. Disinfect its food and water bowls daily with soap and hot water. Be sure to rinse away all soap residue. Spot clean the cage daily, and remove feces and soiled bedding promptly. Wash your hands for at least 30 seconds after handling your rat or touching its cage, food, or water."
    },
    {
      "title": "Offer Pedialyte to help prevent dehydration.",
      "content": "Offer Pedialyte to help prevent dehydration. In addition to keeping fresh water in its cage at all times, you should also provide a hydrating electrolyte solution, such as Pedialyte. Keep a small bowl of it in your rat's cage, and replace it within 24 hours. [3] X Research source An electrolyte drink will stay fresh for 24 to 48 hours after opening. Since an entire bottle or can is too much for your rat to drink in a day, pour a small bowl of it, then freeze the rest to keep it from spoiling. Check if your rat is dehydrated by pulling back the skin around its shoulders. The skin should snap right back into place. If it sags, your rat might be dehydrated and require veterinary care. [4] X Research source Additionally, do your best to keep track of how much your rat urinates. If several hours go by and it doesn't urinate, or if its urine is very dark in color, it might need to see the vet."
    },
    {
      "title": "Seek emergency care if you think your rat ate something toxic.",
      "content": "Seek emergency care if you think your rat ate something toxic. If your rat had access to houseplants, medication, or toxic foods, call a vet immediately. Describe your rat's symptoms, tell them what you suspect they ate, and ask if you should take your pet to their office. [5] X Research source Common items that are poisonous to rats include chocolate, citrus fruits, rhubarb, NSAID pain relievers, ivy, foxglove, and oleander. Many other houseplants can also cause digestive problems, so it's crucial to keep all plants and flowers away from your pet."
    },
    {
      "title": "Take your rat to a vet if it's still sick after 3 or 4 days.",
      "content": "Take your rat to a vet if it's still sick after 3 or 4 days. If your rat doesn't display symptoms other than diarrhea, and you don't think it's ingested something toxic, monitor it for a few days. Take steps to keep it hydrated, and see if its condition improves. If it's not better after 3 or 4 days, call the vet and ask if you should bring your rat to their office. [6] X Research source"
    },
    {
      "title": "Bring a stool sample to the vet's office.",
      "content": "Bring a stool sample to the vet's office. It might seem a little gross, but the vet will probably want to examine a stool sample. Try to keep tabs on your rat, and collect a sample as soon as you can after it's passed. Purchase a sample container at your local pharmacy, or collect the sample in a small plastic bag. [7] X Research source Try to get the sample to the vet within 12 hours after collecting it. Wear vinyl or latex gloves, and wash your hands thoroughly after you collect the sample. If collecting a stool sample grosses you out, ask the vet if they can collect one. You might need to leave your rat at their office until it makes a bowel movement. The vet will test the sample for virus, bacteria, or fungi that might be causing an infection."
    },
    {
      "title": "Ask the vet to show you how to administer any necessary medications.",
      "content": "Ask the vet to show you how to administer any necessary medications. If the vet determines an infection is causing your rat's diarrhea, they'll likely prescribe an antibiotic, antiviral, or antifungal medication. You might need to give your rat medication at home, so make sure you understand how to your rat its medicine before leaving the vet's office. [8] X Research source For serious infections, they might inject your rat with medication. Sometimes, medications can't cure serious problems with the digestive system, such as megacolon or colon cancer. As heartbreaking as it is, try to focus on what's best for your furry friend. If there's no way to improve its condition, putting it to sleep is better than letting it continue to suffer. [9] X Research source"
    },
    {
      "title": "Administer",
      "content": "Administer liquid medication with an eyedropper, if necessary. Measure carefully, and draw the prescribed amount of medication into the dropper. Hold your rat's head and neck with one hand, and insert the dropper into its mouth with the other. Ensure you're past its teeth, then squeeze the dropper's bulb to inject the medication. [10] X Research source To prevent choking, never give a rat medication when it's on its back. Hold it so it faces down or forward. If your rat has a bacterial, viral, or fungal infection, the vet will prescribe medication to combat it."
    },
    {
      "title": "Give your rat a small dose of antidiarrheal medicine.",
      "content": "Give your rat a small dose of antidiarrheal medicine. To help manage diarrhea, you could give your rat 1 drop of liquid antidiarrheal medication per 1 ounce (28 g) of body weight, or about 1/10 the recommended human dose. Use an eyedropper to administer the medication daily. [11] X Research source It's best to consult the vet before giving your rat any over-the-counter medication."
    },
    {
      "title": "Feed your rat a probiotic supplement if it's on antibiotics.",
      "content": "Feed your rat a probiotic supplement if it's on antibiotics. You can find probiotics labeled for rodents at a pet supply store. Antibiotics kill gut bacteria that help regulate your rat's digestive system, which can lead to diarrhea. Probiotics will help replenish these healthy bacteria. [12] X Research source Consult the vet before giving your rat probiotics. With their approval, sprinkle a powdered supplement or empty the contents of a tablet onto your rat's food. If your rat is on antibiotics for another condition and experiences diarrhea, probiotics could help relieve its symptoms. If your rat needs antibiotics to combat diarrhea, probiotics can help get its digestive system back to normal."
    }
  ]
}