{
  "url": "https://www.wikihow.com/Turn-Off-Steam-Friend-Notifications",
  "title": "How to Turn Off Friend Notifications and Overlay on Steam",
  "steps": [
    {
      "title": "Launch the Steam app.",
      "content": "Launch the Steam app. Steam is available to download on Windows, Mac, and Linux. If you aren't already logged into your account, enter your username and password now. You can change your password if needed. [1] X Research source Use this method to disable notifications from friends while you're in-game."
    },
    {
      "title": "Click Steam.",
      "content": "Click Steam . You can find this in the top-left corner of the window. A drop-down menu will open."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . This will be towards the bottom of the menu. A new window will open. [2] X Research source"
    },
    {
      "title": "Click Notifications.",
      "content": "Click Notifications . This will be in the left panel, underneath Security . [3] X Research source"
    },
    {
      "title": "Adjust your notifications.",
      "content": "Adjust your notifications. Underneath the Friend Notifications header, you'll see a list of options. Show Toast refers to a notification badge, while Play Sound refers to a small sound. Toggle off Show Toast for When a friend joins a game and When a friend comes online . If you'd rather not hear a notification sound, you can also toggle off Play Sound for these options. If you also want to mute notifications from messages, toggle off the options for When I receive a direct message and When I receive a chat room notification . Alternatively, click the drop-down menu next to Show Notification Toasts… and select Anytime , When I'm not in-game , or Never . [4] X Research source"
    },
    {
      "title": "Launch the Steam app.",
      "content": "Launch the Steam app. If you aren't already logged into your account, enter your username and password now. When you have the Steam Overlay enabled , you can access Steam's community features while in-game. However, if this causes issues with your game, you can disable it. [5] X Research source"
    },
    {
      "title": "Click Steam.",
      "content": "Click Steam . You can find this in the top-left corner of the window. A drop-down menu will open."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . This will be towards the bottom of the menu. A new window will open."
    },
    {
      "title": "Click In Game.",
      "content": "Click In Game . This will be in the left panel, underneath Cloud ."
    },
    {
      "title": "Toggle off \"Enable the Steam Overlay while in-game\".",
      "content": "Toggle off \"Enable the Steam Overlay while in-game\". This is the first option at the top of the page. The Steam Overlay will be disabled when you're playing games ."
    }
  ]
}