{
  "url": "https://www.wikihow.com/What-Is-Topical-Steroid-Withdrawal",
  "title": "Topical Steroid Withdrawal: What Causes It & How to Treat It",
  "steps": [
    {
      "title": "TSW is a condition that can occur after you stop taking topical steroids.",
      "content": "TSW is a condition that can occur after you stop taking topical steroids. TSW—also referred to as “red skin syndrome” or “topical steroid addiction”—refers to a number of symptoms that may appear after you cease taking topical corticosteroids. TSW usually occurs in people who take topical corticosteroids for 2 weeks or more and then stop. [1] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Because TSW is a relatively new area of study, it’s unclear how many people develop the condition, what percentage of steroids users are likely to get it, or what steroids are more likely to lead to it. That said, it has been observed to occur more frequently after prolonged, frequent use of steroids to sensitive areas, among people who don’t taper their use or take periodic breaks in between applications, and among people with atopic dermatitis."
    },
    {
      "title": "TSW can last anywhere from a few months to 3 years.",
      "content": "TSW can last anywhere from a few months to 3 years. Most people do heal from TSW eventually, but the timeline to recovery isn't always linear, and there isn't a cure though you can alleviate symptoms using a few different methods. The severity of symptoms and the length of time it takes to recover will largely depend on the potency of topical steroid used, the frequency with which you used it, and how long you used it. [2] X Research source"
    },
    {
      "title": "Erythema or change to skin color",
      "content": "Erythema or change to skin color There is no official diagnostic criteria for TSW yet, but by far the most common sign of TSW is erythema, or reddening of the skin. However, reddening may not be very noticeable on darker skin. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "“Red sleeve”",
      "content": "“Red sleeve” “Red sleeve” refers to a rebound eruption to either the arms or legs, consisting of red, irritated, and shedding skin. Red sleeve usually stops before the palms of the hands and soles of the feet. [4] X Research source"
    },
    {
      "title": "Burning skin",
      "content": "Burning skin Your skin might burn or itch after you stop taking topical steroids. You may also experience oozing sores. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source After stopping TCS treatment, you may experience a temporary flareup of pre-existing symptoms, which may include itchiness. This is normal, but if the itchiness ever becomes burning or irritability, or if it spreads beyond the affected area, it's likely you have TSW."
    },
    {
      "title": "Skin sensitivity",
      "content": "Skin sensitivity After ceasing to take TCSs, you might experience extreme skin sensitivity. This includes sensitivity to products your skin previously tolerated. [6] X Research source"
    },
    {
      "title": "Shedding",
      "content": "Shedding A common symptom of TSW is extreme skin exfoliation—or shedding. When undergoing withdrawal after prolonged use of TCSs, your skin may begin to peel and flake off. [7] X Research source"
    },
    {
      "title": "“Elephant wrinkles”",
      "content": "“Elephant wrinkles” Elephant wrinkles refers to excessively wrinkled, loose, or crepey skin. After you stop taking topical steroids, you might experience elephant wrinkles on your elbows and knees. [8] X Research source"
    },
    {
      "title": "Hair loss",
      "content": "Hair loss While certain TCS's can encourage hair growth, topical steroid withdrawal can result in hair loss. Hair loss may occur on the head or eyebrows. You might lose patches or hair, or your hair may fall out or thin all over. Your hair will grow back as you recover from TSW. [9] X Research source"
    },
    {
      "title": "Edema",
      "content": "Edema You might experience edema, or swelling caused by an excess of fluid trapped in your body’s tissues. Edema of the ankles and eyelids are particularly common during topical steroid withdrawal. [10] X Research source"
    },
    {
      "title": "Depression and anxiety",
      "content": "Depression and anxiety Depression and anxiety have been cited by sufferers as TSW as one of its potential symptoms. Your mood may also worsen due to many of the other symptoms of TSW. [11] X Research source"
    },
    {
      "title": "Disturbed sleep",
      "content": "Disturbed sleep People who stop taking topical steroids may find it difficult to fall or stay asleep. Interrupted sleep, fatigue, or insomnia may also contribute to worsening moods. [12] X Research source"
    },
    {
      "title": "Discontinue all steroid use.",
      "content": "Discontinue all steroid use. Whether you’ve developed TSW after tapering use of your topical steroids, or you’re still taking other steroids, discontinue all steroid use immediately upon discovery of TSW symptoms. Check in with your doctor to make sure it’s safe to discontinue use first, and come up with a plan to cease treatment as safely as possible. [13] X Research source Opt for non-steroidal topical medications to treat eczema and related skin conditions, if you still require treatment. [14] X Research source"
    },
    {
      "title": "Take medication as prescribed by your doctor.",
      "content": "Take medication as prescribed by your doctor. There aren’t any official guidelines for how to treat TSW, but certain medications have been proven to be effective at combating symptoms. Your doctor may prescribe tetracycline antibiotics, antihistamines, calcineurin inhibitors, or dupilumab. [15] X Research source"
    },
    {
      "title": "Refer to ITSAN for support and next steps.",
      "content": "Refer to ITSAN for support and next steps. ITSAN , or the International Topical Steroid Awareness Network, provides information regarding steroid usage, topical steroid withdrawal, and how to go about finding proper treatment, including resources for counseling and TSW support groups. It also offers information to practitioners who want to learn more about the condition. [16] X Research source TSW is still not taken seriously by some medical professionals. If you find yourself in this situation, the \"For Doctors\" section of ITSAN can be a great resource to help your doctor learn about what you're experiencing and how to treat it. If your doctor isn't receptive to learning about your condition, it may be best to find another doctor, unfortunately. Though TSW is still a fairly new area of research, many medical professionals do take it seriously. You deserve a practitioner who is supportive."
    },
    {
      "title": "Treat TSW at home with moisturizers made from simple ingredients.",
      "content": "Treat TSW at home with moisturizers made from simple ingredients. While your doctor can prescribe you helpful medication to alleviate your TSW symptoms, you can also relieve symptoms yourself at home with some basic self-care. Apply mild emollients, ointments, or balms made with few ingredients for best results, and be sure to spot-test any product before applying it all over. [17] X Research source Use antibiotic cream to reduce the risk of infection, and calamine lotion to help relieve itchiness."
    },
    {
      "title": "Take a warm bath.",
      "content": "Take a warm bath. Some TSW sufferers can't tolerate bathing and must instead rely on gentle sponge baths or clean with wipes. If you can tolerate being submerged, though, taking a warm bath can help soothe itchy or inflamed skin, as well as help prevent infection. [18] X Research source Add .5 c (120 mL) of apple cider vinegar or bleach to a full bath 1 to 2 times a week to help combat infection. Add Epsom salts, baking soda, oatmeal, or tea tree oil to a full bath to relieve itchiness. Add olive oil, jojoba oil, coconut oil, or another soothing oil to your bath to moisturize . (Just be sure to spot-test first.) While a warm bath can feel good on your skin, avoid making the water too hot or sitting too long in the tub, as hot water can eventually dry out your skin even more."
    },
    {
      "title": "Wrap up the affected area after a bath.",
      "content": "Wrap up the affected area after a bath. After soaking in a soothing bath, wrap up any inflamed or itchy skin with gauze, medical tape, taping socks, gloves, or ballet tights to comfort your skin and prevent you from scratching it. Wrapping can also help lock in moisture. [19] X Research source"
    },
    {
      "title": "Wear loose cotton clothing.",
      "content": "Wear loose cotton clothing. When your skin is itchy or inflamed, the last thing you need is tight, irritating clothing that could exacerbate your symptoms. Opt for comfy, loose clothes, towels, and blankets. [20] X Research source"
    },
    {
      "title": "Apply heat or cold to the affected area.",
      "content": "Apply heat or cold to the affected area. Applying a heating pad or hot water bottle to inflamed or itchy skin can relieve some of the itch and alleviate any aches and pains you might feel, as can a warm shower. A cold compress or frozen water bottle can also be effective at relieving the itch. [21] X Research source You can also heat your body up or cool it down with certain foods: experience warmth and comfort with hot tea or soup, or chill your body temp with smoothies or ice cream."
    },
    {
      "title": "Get some sunlight or UV rays.",
      "content": "Get some sunlight or UV rays. Once your condition isn't as serious, getting some moderate sunlight may help soothe your skin. Opt for early morning sunlight, as it'll be mild enough for you to tolerate without damaging your skin. Also talk to your doctor about prescription phototherapy (narrowband UVB light therapy) to help soothe itchy or patchy skin. [22] X Research source"
    },
    {
      "title": "Replace topical steroids with non-steroidal medication, if possible.",
      "content": "Replace topical steroids with non-steroidal medication, if possible. TCSs are very effective at treating skin conditions like eczema or atopic dermatitis, but there are many non-steroidal alternatives as well. Talk to your doctor about non-steroidal options that may work for you. [23] X Research source If you must take a topical steroid, alternating between it and a non-steroidal medication can reduce the risk of getting TSW."
    },
    {
      "title": "Avoid taking topical steroids for a prolonged period of time.",
      "content": "Avoid taking topical steroids for a prolonged period of time. Many sufferers of TSW took TCSs for a 2-week period or longer. While TCSs can be very effective at combating various skin conditions, patients can limit the risk of contracting TSW by only taking steroids for less than a year at a time. [24] X Research source"
    },
    {
      "title": "Take periodic breaks between steroid dosages.",
      "content": "Take periodic breaks between steroid dosages. Topical steroids can help alleviate symptoms of skin conditions such as eczema or atopic dermatitis, and many patients benefit from prolonged usage. If you must use topical steroids longer than a couple of weeks, taking periodic breaks between applications can help prevent your likelihood of contracting TSW after you stop taking your medication. Avoid applying topical steroids more than once daily. [25] X Research source"
    },
    {
      "title": "Apply lower TCS potencies.",
      "content": "Apply lower TCS potencies. Lower potency-steroids may result in a lower risk of TSW. If possible, take topical steroids of mild or moderate potency. [26] X Research source"
    },
    {
      "title": "Awareness of the risks of TCSs will help prevent TSW.",
      "content": "Awareness of the risks of TCSs will help prevent TSW. Many people who take TCSs don't go on to experience topical steroid withdrawal. While this condition is still relatively new to the medical field, education on the part of both doctors and patients alike can help to prevent TSW from occurring. [27] X Research source"
    },
    {
      "title": "Topical corticosteroids are medications used to reduce skin irritation.",
      "content": "Topical corticosteroids are medications used to reduce skin irritation. TCSs—or topical corticosteroids—and hydrocortisone creams can help to relieve symptoms of eczema, psoriasis, contact dermatitis, and other skin conditions (though they cannot cure these conditions). TCSs generally need to be applied to the affected area of skin in a thin layer once or twice a day for 1 to 2 weeks. [28] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source TCSs are available in many different forms, including creams, lotions, gels, mousses, ointments, tapes and bandages, and solutions. TCSs come in 4 different potencies: mild, moderate, potent, and very potent. Mild and moderate TCSs can often be purchased over-the-counter, while stronger potencies may only be available with a prescription. TCSs are usually safe to use, but don’t take them if you have rosacea, acne, or skin ulcers (open sores), or if you’re currently suffering from infected skin."
    }
  ]
}