{
  "url": "https://www.wikihow.com/Write-a-Corporate-Profile",
  "title": "How to Write a Corporate Profile",
  "steps": [
    {
      "title": "Keep your corporate profile concise.",
      "content": "Keep your corporate profile concise. Make your corporate profile interesting and easy to read by keeping it as simple and brief as you can. Many readers will simply scan the document, digesting key phrases and concepts. Corporate profiles can be just a few paragraphs or over 30 pages long, but think about what information is really important before you choose a long-form profile. [1] X Research source If you're creating your corporate profile online, keep it short by linking to more detailed information on separate pages. This will provide resources to readers who are curious to learn more while still being a quick and easy read. Even Google limits their corporate profile to 1 page, so you can keep it short, too."
    },
    {
      "title": "Get creative with your format.",
      "content": "Get creative with your format. There's no one way to make a corporate profile, especially when they're published online. Most profiles contain certain key facts about a business, but it can be presented in whatever way you think highlights your company's best assets. The profile should be professional and businesslike, but it also needs to grab the reader's attention. [2] X Research source Consider graphics and diagrams to break up some of the text or longer paragraphs. Use photographs of your staff or production process, highlight innovative technologies you're using, and incorporate elements of your branding throughout the profile to make it really stand out."
    },
    {
      "title": "Use headers and bullet points to break up text.",
      "content": "Use headers and bullet points to break up text. Walls of text are boring. Keep the reader interested by using headers and bullet points to create visual divisions within your profile. [3] X Research source Headers should be simple and can used to introduce changes in topic, like \"Mission Statement,\" \"Awards and Recognition,\" or \"Looking to the Future.\" Use bullet points whenever you're listing several pieces of information, like when you're naming your company's awards or presenting highlights from your financial information."
    },
    {
      "title": "Use a simple, easy-to-read font.",
      "content": "Use a simple, easy-to-read font . As with any other professional document , you should avoid using flashy fonts in the body of your profile. These can be distracting and hard to read. Go with an attractive, simple font like Arial, Helvetica, or Calibri. [4] X Research source"
    },
    {
      "title": "Use active voice.",
      "content": "Use active voice. Make sure your corporate profile is strong by using active voice throughout the document. Passive voice can be overly complicated and flat. [5] X Research source Instead of saying \"Responsibility and integrity are important to us,\" you could say \"Our company prizes responsibility and integrity.\""
    },
    {
      "title": "Avoid using too much \"corporate speak.\"",
      "content": "Avoid using too much \"corporate speak.\" Too many industry-specific terms or corporate buzzwords will make your profile bulky and difficult to read. Focus on using plain language that anyone can understand. [6] X Research source"
    },
    {
      "title": "Start with the company name and address as a header.",
      "content": "Start with the company name and address as a header. Since your corporate profile should include the company name and address, you can use this as a header. Consider using an eye-catching logo instead of simple type to make your profile more interesting right away. [7] X Research source"
    },
    {
      "title": "Include a paragraph listing your products and brand names.",
      "content": "Include a paragraph listing your products and brand names. The purpose of the profile is to give readers a brief overview of the type of business your company conducts. Briefly explain what your business is all about. Do you sell beer? Do you manufacture children's toys? Make sure it's clear. [8] X Research source"
    },
    {
      "title": "Include information on the corporate structure.",
      "content": "Include information on the corporate structure. Specifically, you should include whether the company is private, public, or a partnership. Explain whether there is a board of directors, an executive staff, or officers who make the major decisions. This information can usually be summed up in one sentence. [9] X Research source"
    },
    {
      "title": "Craft a powerful mission statement.",
      "content": "Craft a powerful mission statement . Your mission statement should tell readers your vision for the company's future as well as the strategies you are using to achieve those goals. Your mission statement should also include a brief discussion of your target demographic and financial data, including mergers and acquisitions and relationships with investors and shareholders. [10] X Research source"
    },
    {
      "title": "Present your company's history.",
      "content": "Present your company's history. Show readers how your company has evolved by providing a brief chronological history. Include how the company began and the changes and developments that brought the business to where it is today. [11] X Research source"
    },
    {
      "title": "Call attention to important achievements and milestones.",
      "content": "Call attention to important achievements and milestones. It's okay to brag a little in your corporate profile. Mention important partnerships, success stories and benchmarks. Explain how the corporation gives back to the community or sponsors nonprofit groups and schools. [12] X Research source If your business was recently recognized as one of the fastest-growing companies in your region, you want people to know!"
    },
    {
      "title": "Talk about the company culture.",
      "content": "Talk about the company culture. Part of the corporate profile should be about the people who make the business run. Briefly discuss your highly trained staff and what you do to keep morale and standards high. [13] X Research source Include information about corporate policies regarding the environment, public relations, health and safety, unions, and labor and human rights. [14] X Research source"
    },
    {
      "title": "Keep your corporate profile honest and accurate.",
      "content": "Keep your corporate profile honest and accurate. Consumers, analysts and members of the media will likely do a little research to confirm what they read. If you include inaccurate or dishonest information, you can irreparably damage your company's image. [15] X Research source"
    },
    {
      "title": "Proofread your profile several times.",
      "content": "Proofread your profile several times. Before you publish your profile, you should make sure it is free from errors in spelling and grammar. This document represents your company as a whole, and mistakes are unprofessional. [16] X Research source One tip for successful proofreading is to start at the end of the document and read one sentence at a time."
    },
    {
      "title": "Read other corporate profiles to see what makes them stand out.",
      "content": "Read other corporate profiles to see what makes them stand out. Part of business is knowing your competition, and you can apply this to crafting a corporate profile. Look at other company's profiles to see what stands out to you, and try to emulate those qualities in your own profile.< [17] X Research source"
    },
    {
      "title": "Make sure every part works to build your company's image.",
      "content": "Make sure every part works to build your company's image. Look at each element of your profile to make sure that it works to build your company's image. As you read through, remove anything which seems unnecessary. Even if it's necessary to disclose something negative (like a previous bankruptcy, for instance), try to reframe it in a way to emphasize your company's resilience."
    },
    {
      "title": "Ask someone else to look over your profile.",
      "content": "Ask someone else to look over your profile. Sometimes a fresh set of eyes is essential in editing a document. Ask someone who isn't familiar with your business to proofread your document and to give you feedback on the overall image the profile creates."
    },
    {
      "title": "Make your corporate profile available publicly online.",
      "content": "Make your corporate profile available publicly online. You never know who may be researching your company, so make it available on your website and link to it on your social media profiles. Potential investors, customers, and even your own shareholders may be interested in learning more about the operations of your company."
    },
    {
      "title": "Use the corporate profile as a marketing tool.",
      "content": "Use the corporate profile as a marketing tool. Use this corporate profile whenever you can. It can be part of your business plan , strategic plan, marketing strategy and on your website. The corporate profile should be a marketing tool that gets your company noticed."
    },
    {
      "title": "Show it to potential investors.",
      "content": "Show it to potential investors. Your corporate profile can be a great tool to introduce potential investors to your company. Offering your profile at the beginning of financial discussions will give potential investors the basics of your company's business and finances. This will give them time to learn about your company and decide whether they want to follow up."
    },
    {
      "title": "Link to your corporate profile in press releases.",
      "content": "Link to your corporate profile in press releases . If you're announcing a new product or a business acquisition, include your corporate profile in your press releases. This will direct traffic to your profile and can help build brand awareness."
    },
    {
      "title": "Update your profile when your company undergoes changes.",
      "content": "Update your profile when your company undergoes changes. Be sure to keep your corporate profile up to date, especially as the business grows and changes over time. Review the profile every 6 months or so, and any time a major change affects the leadership or operations of the company."
    }
  ]
}