{
  "url": "https://www.wikihow.com/Test-Bow-Poundage",
  "title": "How to Test Bow Poundage",
  "steps": [
    {
      "title": "Slide the scale indicator back to the starting position.",
      "content": "Slide the scale indicator back to the starting position. A standard bow scale looks like a long tube with a hook on the end. An indicator along the side of the tube shows the poundage of your draw. If this isn’t in the zero position when you start, slide it back into the start position for an accurate measurement. [1] X Research source It's possible for the spring in the scale to wear out and give you an inaccurate measurement. If your scale is starting to give inconsistent measurements, then you probably need a replacement spring. A professional at a bow shop should be able to replace it for you."
    },
    {
      "title": "Place your middle and index fingers on the scale finger rests.",
      "content": "Place your middle and index fingers on the scale finger rests. On the front of the scale, there are 2 finger rests that make a small T shape. Place your index finger on the top one and your middle finger on the bottom one, then wrap your thumb and other fingers around the tube. [2] X Research source Use the hand that you usually draw your bow with. If you’re right-handed, then hold it in your right hand. Make sure the numbers on the scale face you, otherwise your hand might block the indicator. [3] X Research source"
    },
    {
      "title": "Hook the scale around the arrow nook on the string.",
      "content": "Hook the scale around the arrow nook on the string. At the end of the bow scale where your fingers are, there is a rounded hook. Loop this around the bowstring in the same place that you’d put an arrow. [4] X Research source Test to make sure the scale is attached a few times before you draw it back fully. Pull back a bit to make sure the hook doesn’t come loose."
    },
    {
      "title": "Hold the bow up with your arm stretched out straight.",
      "content": "Hold the bow up with your arm stretched out straight. Grab the bow handle with your free arm and lift it into your normal shooting position. For most people, this means that your lead arm should be straight and in-line with your elbow. Hold the scale in position like it’s an arrow. [5] X Research source Don’t point the bow at any people or things that could break. If you let go of the scale, you could shoot it like an arrow. Some professionals like to nock an arrow while they’re measuring the poundage to mimic their draw length when they’re actually shooting. However, if you’re not experienced using a bow scale, don’t do this. If you release the string accidentally, you could shoot the arrow."
    },
    {
      "title": "Pull the string back smoothly until you reach your normal draw length.",
      "content": "Pull the string back smoothly until you reach your normal draw length. Draw the string as if you were getting ready to shoot an arrow. Continue until you reach your normal draw length. For most people, this is right around their ear. Hold it in position for a few seconds to take a measurement. [6] X Research source Do not let go of the scale at any point. If you feel like you’re losing your grip, then release the tension slowly."
    },
    {
      "title": "Let the tension off of the string smoothly.",
      "content": "Let the tension off of the string smoothly. Don’t simply let go of the bow or scale while you have the string drawn. This could send the scale flying. Instead, bring your drawing arm forward at an even pace until there’s no more tension on the string. [7] X Research source"
    },
    {
      "title": "Check the indicator line on the bow scale to measure the poundage.",
      "content": "Check the indicator line on the bow scale to measure the poundage. The indicator on the scale will measure the poundage of your draw. Check the number that it’s pointing to and you’ll know the poundage of your draw. [8] X Research source Slide the indicator back to zero so you’re ready for the next measurement. You might want to check 2 or 3 times to confirm your first measurement."
    },
    {
      "title": "Set the scale to “pounds” if you have the option.",
      "content": "Set the scale to “pounds” if you have the option. Some digital scales can cycle between different units of measure. Look for a button labeled “unit” and press it until the scale says “pounds” as its unit of measure. [9] X Research source You can also use a different unit of measure if you’d like. Always check the instructions on the scale you’re using for the proper procedure. Some scales have on switches and others might simply activate when you press a button."
    },
    {
      "title": "Press the “tare” button to zero the scale.",
      "content": "Press the “tare” button to zero the scale. On most digital scales, the “tare” button sets the scale back to zero. Hit this before every measurement to make sure your scale gets an accurate measurement. [10] X Research source"
    },
    {
      "title": "Hang the scale on a secure mount on the ceiling.",
      "content": "Hang the scale on a secure mount on the ceiling. You need to hang the scale from something strong that will stay in place while you pull the bow. Some people use a chain or secure ropes, and others drill a hook directly into their ceiling. This will all work as long as it can support enough weight. Loop the circular attachment on the scale into this mount. [11] X Research source Many bows have a draw weight of over 60 lb (27 kg), so you need a mount that can hold at least that much weight. Do not use a nail or screw in the ceiling to secure the scale. These aren’t strong enough and could pop out."
    },
    {
      "title": "Hook the scale around your bow string in the arrow section.",
      "content": "Hook the scale around your bow string in the arrow section. Take your bow and place it into the scale hook in the same place you’d nock and arrow. Make sure the string is secure before trying to pull it. [12] X Research source"
    },
    {
      "title": "Pull the bow all the way down smoothly.",
      "content": "Pull the bow all the way down smoothly. Grab the bow firmly with one hand on either side of the handle. Then pull it down with firm pressure to measure its weight. Stop when the scale stops increasing, which indicates that you’ve hit the max draw weight. [13] X Research source An electric scale automatically measures the max draw weight on the string, so even if you pull it too far, this won’t make a difference."
    },
    {
      "title": "Raise the bow back up with steady pressure.",
      "content": "Raise the bow back up with steady pressure. Remember that the bow is under tension, so don’t let it go or it’ll shoot up. Raise the bow smoothly to release the tension. When you’re back in the starting position, you can let it go or take it off the hook. [14] X Research source"
    },
    {
      "title": "Check the measurement on the scale.",
      "content": "Check the measurement on the scale. The scale saves and displays the last measurement it took. Check the screen to see the poundage of your bow. [15] X Research source You can confirm your measurement by measuring a few more times. Remember to hit “tare” to set it back to zero. Regardless of the bow's poundage, if you can't pull it back to your full draw comfortably, then it's too heavy and needs adjustment."
    }
  ]
}