{
  "url": "https://www.wikihow.com/Stop-Following-Someone-on-Instagram",
  "title": "How to Stop Following Someone on Instagram using the Mobile App and Website",
  "steps": [
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. The app icon is a camera inside a square that’s a gradient from yellow to purple."
    },
    {
      "title": "Tap your profile image or the silhouette .",
      "content": "Tap your profile image or the silhouette . This is in the lower right of your screen. Your profile page will open and you'll see a number of how many people you're following."
    },
    {
      "title": "Tap Following.",
      "content": "Tap Following . You should see a number representing how many accounts you're following, and tapping on this will display each account."
    },
    {
      "title": "Navigate to an account you want to unfollow.",
      "content": "Navigate to an account you want to unfollow. You can look through categories, like those most shown in Feed or those you've had the least interaction with. Alternatively, you can browse the list of those you're following in an alphabetical list."
    },
    {
      "title": "Tap Following.",
      "content": "Tap Following . This is to the right of the profile name in your \"Following\" list. It will change to \"Follow\" if you've unfollowed. The person you're unfollowing will not get a notification that you've unfollowed them. [1] X Research source"
    },
    {
      "title": "Log in to your Instagram account at https://instagram.com.",
      "content": "Log in to your Instagram account at https://instagram.com . You can use any web browser to log into your Instagram account and unfollow others."
    },
    {
      "title": "Click your profile image or the silhouette icon.",
      "content": "Click your profile image or the silhouette icon. You'll find this in the top right corner of the web browser window."
    },
    {
      "title": "Click Profile.",
      "content": "Click Profile . Doing this will redirect you to your profile page."
    },
    {
      "title": "Click following.",
      "content": "Click following . This is next to a number of accounts that you're following and will prompt a window that displays all the profiles you're following."
    },
    {
      "title": "Click Following.",
      "content": "Click Following . Another window will pop up on your screen."
    },
    {
      "title": "Click Unfollow.",
      "content": "Click Unfollow . This is to the right of the profile name in your \"Following\" list. It will change to \"Follow\" if you've unfollowed. The person you're unfollowing will not get a notification that you've unfollowed them."
    }
  ]
}