{
  "url": "https://www.wikihow.com/Text-Your-Crush-and-Start-a-Conversation",
  "title": "How to Text Your Crush and Start a Conversation",
  "steps": [
    {
      "title": "Get your crush's phone number.",
      "content": "Get your crush's phone number . The best time to do this is when you're in the middle of a really great conversation. Drop the request in really casually and make it seem really low pressure. Say something simple, like \"Hey, why don't we trade cell numbers? The moment after a phone number exchange can be a little awkward. Make sure that you don't miss a beat. Keep the conversation flowing so that the number exchange seems completely natural."
    },
    {
      "title": "Have a plan.",
      "content": "Have a plan. Before you send your first message have a plan of what you are going to say or what you want to achieve by the end of the conversation."
    },
    {
      "title": "Send your first text.",
      "content": "Send your first text. A simple \"What's up (name)?\" or \"What are you up to?\" is a good conversation starter. If your crush replies that they're watching television, listening to music or playing a game, reply by asking about what they're watching, listening to or playing. Whatever your crush says, you want to be ready with a follow-up question to keep the conversation flowing . Your crush may say something along the lines of, \"I'm doing my homework.\" In reply, you can say something like \"We got loads, didn't we? Mine took ages to finish!\" Or if your crush doesn't go to your school you could say, \"Oh poor you! Ha, did you get a lot?\" Tell your crush what you're up to as well. When your crush texts you letting you know what he or she is doing, send a reply like, \"That's cool. I'm just checking Facebook\" or whatever else you're actually doing at the time."
    },
    {
      "title": "Observe how your crush acts.",
      "content": "Observe how your crush acts . Look for clues in the conversation to see whether the person is enjoying texting back and forth, whether the person has had enough of the conversation or whether you're ready to step it up and ask your crush on a date. If the answers to your texts are really short or clipped, then you should probably text back something like, \"Okay, catch you later,\" or \"See you later, alligator!\" (Cute texting move)Don't read too much into it. The person could be really busy or in a bad mood. Just make sure that you don't make yourself look desperate or needy by trying to push a conversation when it isn't happening. When your crush responds by asking you questions, like \"What are you doing?\" then you know that he or she wants to keep talking. Just let the conversation flow naturally. However, make sure they are the one to end the conversation. Be talkative and forward. Look for chances to take it to the next level. If the conversation starts to get intense or veers to really personal subjects, or if your crush starts to confide in you about a problem, then you can say, \"Why don't you call me so that we can talk? I want to get together sometime, maybe.\" Be bold . If you know the time is right, ask your crush on a date. If they reject, remember there are plenty of fish in the sea!"
    },
    {
      "title": "Text your crush",
      "content": "Text your crush and ask, \"What did you think of school today?\" If the reply is something like \"Okay, I guess\" or \"Pretty normal,\" you could ask what they thought of the homework, the science experiment you did, the geography project you've been assigned, the book report due in next week or the exams that are coming up soon. [1] X Expert Source Julia McCurley Certified Professional Matchmaker Expert Interview. 30 September 2021."
    },
    {
      "title": "Use holidays and celebrations as conversation starters.",
      "content": "Use holidays and celebrations as conversation starters . If you're texting your crush just before Christmas or right before their birthday, then ask your crush about the plans they have for celebrating. If you're texting the person just after a holiday, send a text that says, \"Hey, did you have a good birthday? Get anything special?\" Learn about holidays that you don't celebrate. For example, if your crush celebrates Hanukkah while you celebrate Christmas, ask questions to learn what their holiday is about. Text your crush around New Year's Day and ask if the person made any New Year's resolutions. Share your resolutions back."
    },
    {
      "title": "Ask questions",
      "content": "Ask questions about their family. Your crush could be complaining about a sibling, or maybe your crush has an older sibling who is headed off to college. If you have siblings yourself, say something like, \"I can relate to the problems you're having with your sister. My sister drives me crazy.\" You can also ask questions about parents or even about pets."
    },
    {
      "title": "Talk to your crush about their hobbies.",
      "content": "Talk to your crush about their hobbies. If your crush is on the tennis team, ask how their latest match went. If your crush has other interests like band, school newspaper or academic extracurriculars, then ask what he or she has been up to lately in some of these activities. Has your crush recently been in a competition of some sort? Was the person on a winning quiz bowl team or did he or she get a part in the school play? Text the person to say \"Congratulations.\""
    },
    {
      "title": "Text something sympathetic.",
      "content": "Text something sympathetic . Maybe your crush had a bad exam grade, lost an important game or experienced something really sad, like the death of a pet or family member. Send the person a text saying something like, \"I'm so sorry to hear what happened. How are you holding up?\""
    },
    {
      "title": "Take your time.",
      "content": "Take your time. With a text, you have 160 characters to send a great message. You don't have to reply to your crush's text instantaneously. Deliver a response after you've had some time to think about it. Reader Poll: We asked 817 wikiHow readers what do they do when a crush doesn’t respond to a text, and 57% said they would wait patiently for them to reply. [Take Poll]"
    },
    {
      "title": "Avoid racking up phone charges.",
      "content": "Avoid racking up phone charges. Make sure that you have an unlimited texting plan or that you are tracking the number of texts that you send carefully. You don't want you or your parents to get a nasty surprise when the cell phone bill arrives. [2] X Research source"
    },
    {
      "title": "Skip the abbreviations.",
      "content": "Skip the abbreviations. Abbreviations can make you look shallow and flighty. Save the abbreviations for your BFFs and use complete sentences and capitalization when you text your crush."
    },
    {
      "title": "Use emoticons with caution.",
      "content": "Use emoticons with caution. Smilies or sad faces are okay, but you need to be pretty certain that your crush likes you back before using a flirty emoticon. Definitely be at least 99% sure that they like you before using a love emoticon."
    },
    {
      "title": "Make sure your crush starts the conversation at some point.",
      "content": "Make sure your crush starts the conversation at some point. Don't text them too often. Texting once or twice a week is good enough. You don't want to look desperate."
    }
  ]
}