{
  "url": "https://www.wikihow.com/Test-Alcohol-Content-Without-a-Hydrometer",
  "title": "How to Test Alcohol Content Without a Hydrometer",
  "steps": [
    {
      "title": "Buy a refractometer online to measure alcohol content.",
      "content": "Buy a refractometer online to measure alcohol content. Refractometers are cylindrical devices that measure the concentration of sugar in water based on how light refracts through the solution. Look at home-brewing websites to see what refractometers they have available to purchase. Opt for a digital refractometer if you want it to have a built-in light. Otherwise, you can get an analog refractometer that requires looking at an external light source. Refractometers usually cost $30 USD or more. More expensive models tend to be more accurate than cheaper ones. You may be able to find refractometers in specialty home-brewing stores. In order to use a refractometer to measure alcohol content, you need to take a measurement before it begins fermenting. You will not be able to measure alcohol content in a drink otherwise."
    },
    {
      "title": "Put 2–3 drops of distilled water on the refractometer’s glass and shut the lid.",
      "content": "Put 2–3 drops of distilled water on the refractometer’s glass and shut the lid. Flip open the plastic cap on the end of the refractometer to expose the glass underneath. Use a pipette to apply a few drops of distilled water on top of the glass, making sure they don’t run off. Flip the plastic lid closed so it spreads the water evenly over the surface. Avoid using water from a sink since it may have additives that could affect your reading."
    },
    {
      "title": "Hold the refractometer up to your eye so it points at a light source.",
      "content": "Hold the refractometer up to your eye so it points at a light source. Put the refractometer’s lens against your eye and point the other end with the glass toward a light, such as a lamp or ceiling light. As you look through the lens, you will see a scale of numbers ascending vertically and the background will have a white section near the bottom and a blue section above it. [1] X Research source The horizontal line that splits the blue section and the white section in the background is the hydrometer reading. If you have a digital refractometer, it will have a light built into the body so you don’t need an external light source."
    },
    {
      "title": "Adjust the calibration screw if you don’t have a 0 reading on the scale.",
      "content": "Adjust the calibration screw if you don’t have a 0 reading on the scale. Check where the horizontal line crosses the scales. If it doesn’t line up with the 0 mark on either scale, locate the calibration screw on the top of the refractometer. Use a screwdriver to turn the screw counterclockwise if the line is above the 0 mark or clockwise if the line is above it. [3] X Research source The calibration screw may be covered by a plastic cap so you don’t accidentally rotate it while using the refractometer. The refractometer may already come with a screwdriver."
    },
    {
      "title": "Wipe the glass dry to prevent damage.",
      "content": "Wipe the glass dry to prevent damage. Flip the lid open on the refractometer and use a lint-free microfiber towel to dry off the glass. If you aren’t able to clean off all the water with the towel, leave the lid open and allow the refractometer to air dry so it doesn’t affect future readings. Avoid leaving water or moisture on the refractometer since it could leak into the machine and make it inaccurate in future readings."
    },
    {
      "title": "Put 2–3 drops of the unfermented sample on the refractometer.",
      "content": "Put 2–3 drops of the unfermented sample on the refractometer. Use the sugar and water starter liquid, or wort, you’re using for your homebrew and pull a small sample into a pipette. Open the plastic lid on the refractometer and apply 2–3 drops across the glass. Close the lid to help spread out the drops into a thin, even layer. Refractometers work best for measuring alcohol in home-brewed beer or whiskey. You can try using a refractometer to measure must, which is crushed fruit used for wine, but you may not get as accurate of a reading."
    },
    {
      "title": "Hold the refractometer up to a light to find the Brix gravity reading.",
      "content": "Hold the refractometer up to a light to find the Brix gravity reading. Place the refractometer’s lens against your eye and point the glass toward a light source. Rotate the lens to adjust the focus if you’re not able to see the scales clearly. Look at the scale labeled “Brix %” and note where the horizontal line crosses it. Write down the reading so you don’t forget it later on. The Brix scale usually goes from 0 to 30%, but it may vary depending on the model of your refractometer. You do not need to use the side labeled “SG” or “Specific Gravity” since it will be more difficult to convert later on."
    },
    {
      "title": "Take another Brix reading 2–3 weeks after the liquid starts fermenting.",
      "content": "Take another Brix reading 2–3 weeks after the liquid starts fermenting. Wait until the solution or wort begins fermenting before taking your next measurement, or else you won’t be able to get an accurate measurement. Place another 2–3 drops of the wort onto the refractometer’s glass and close the lid. Look through the lens and write down where the horizontal line crosses the Brix scale, which should be lower than your initial reading. You can take your second reading at any point during the fermentation process."
    },
    {
      "title": "Divide both of your readings by 1.04 to correct them.",
      "content": "Divide both of your readings by 1.04 to correct them. Since refractometers have slight inaccuracies to them, take the readings you found and divide them by 1.04, which is the standard correction value. Write down the final results you found out rounded to the second decimal place so you have the initial and final Brix percent measurements. [4] X Research source For example, if the initial Brix percentage was 12 on the refractometer, the equation would be: 12/1.04 = 11.54. If you found the final Brix percentage was 8, then your equation would be: 8/1.04 = 7.69."
    },
    {
      "title": "Plug the readings into the correction formula for the final specific gravity.",
      "content": "Plug the readings into the correction formula for the final specific gravity. Use the formula: 1.0000 – (0.0044993 * IB) + (0.011774 * FB) + (0.00027581 * IB²) – (0.0012717 * FB²) – (0.0000072800 * IB³) + (0.000063293 * FB³), where IB is the corrected initial Brix measurement and FB is the corrected final Brix measurement. Simplify the equation using a calculator to find the final estimated specific gravity, which you can then use to calculate the alcohol content. Round the answer to the third decimal point. [5] X Research source For example, if the corrected initial Brix percentage was 11.54 and the corrected final percentage was 7.69, the equation would be: 1.0000 – (0.0044993 * 11.54) + (0.011774 * 7.69) + (0.00027581 * (11.54²)) – (0.0012717 * (7.69²)) – (0.0000072800 * (11.54³)) + (0.000063293 * (7.69³)). After plugging the equation into a calculator, the final specific gravity would be 1.018."
    },
    {
      "title": "Convert the first Brix reading with (IB / [258.6 - (IB / 258.2) * 227.1]) + 1.",
      "content": "Convert the first Brix reading with (IB / [258.6 - (IB / 258.2) * 227.1]) + 1. Plug the corrected initial Brix percentage into the equation in place of IB and enter the formula into your calculator. Round your answer to the third decimal point to find the initial specific gravity, which you can use to find the alcohol content of the wort. [6] X Research source For example, if the first Brix percentage was 11.54, the equation would read: (11.54 / [258.6 - (11.54 / 258.2) * 227.1]) + 1. When you plug the equation into a calculator, you would find the initial specific gravity is 1.046."
    },
    {
      "title": "Use (76.08 * [IG - FG] / [1.775 - IG]) * (FG / 0.794) to find the alcohol content.",
      "content": "Use (76.08 * [IG - FG] / [1.775 - IG]) * (FG / 0.794) to find the alcohol content. Plug the initial specific gravity you just calculated in for IG and the final specific gravity you found earlier in place of FG. Type the equation into a calculator and round the answer to the third decimal point to find the expected alcohol content of the wort once it’s completely fermented. [7] X Research source For example, if the initial specific gravity was 1.046 and the final specific gravity was 1.018, then the equation would read: (76.08 * [1.046 - 1.018] / [1.775 - 1.046]) * (1.018 / 0.794). After putting the formula into a calculator, your result would be 3.747, which means the drink will be 3.747% alcohol by volume, which is how much alcohol is contained in 100 millilitres (3.4 fl oz)."
    }
  ]
}