{
  "url": "https://www.wikihow.com/Use-Telegram",
  "title": "A Beginner's Guide to Using Telegram on All Platforms",
  "steps": [
    {
      "title": "Install Telegram on your Android.",
      "content": "Install Telegram on your Android. You can download Telegram for free from the Google Play Store, which you'll find in the app drawer. Once you're there, here's how to get it: Type telegram into the search bar, and tap Telegram in the search results. It's the round blue icon with a white paper airplane inside. Tap INSTALL and follow the on-screen instructions. Tap OPEN to launch Telegram."
    },
    {
      "title": "Install Telegram on your iPhone or iPad.",
      "content": "Install Telegram on your iPhone or iPad. Here's how to download Telegram from the App Store (the blue-and-white \"A\" icon on your home screen): Tap Search at the bottom-right corner. Type telegram into the search bar and tap Search . Tap GET next to Telegram Messenger in the search results. Enter your passcode or biometric if prompted to start the download. Tap OPEN to launch Telegram."
    },
    {
      "title": "Install Telegram on Windows.",
      "content": "Install Telegram on Windows. You can download it from https://desktop.telegram.org in a web browser. You must set up your account on the mobile app before you can use the desktop app. Here's how to get the app: Scroll down and tap Get Telegram for Windows . If the app doesn't download immediately, tap Save to start the download. Double-click the downloaded installer and follow the on-screen instructions to install. Click the Telegram link in your Start menu to launch the app. Follow the on-screen instructions to log into your account."
    },
    {
      "title": "Install Telegram on a Mac.",
      "content": "Install Telegram on a Mac. You can get the app for free from the Mac App Store, which is the blue-and-white \"A\" icon on the Dock. You must set up your account on the mobile app before you can use the desktop app. Here's how to get the app: Type telegram into the Search bar at the top-left corner. Click Telegram Messenger in the search results. Click GET to install. Click OPEN to launch the app. Follow the on-screen instructions to log into your account."
    },
    {
      "title": "Use Telegram on the web.",
      "content": "Use Telegram on the web. If you're using a computer and don't want to install an app, you can access Telegram in your browser at https://web.telegram.org . You can either log in using QR code or with your phone number. Just follow the on-screen instructions."
    },
    {
      "title": "Click Start Messaging.",
      "content": "Click Start Messaging . This is the blue button at the bottom of the page when you first open the app."
    },
    {
      "title": "Enter your country and mobile phone number.",
      "content": "Enter your country and mobile phone number. Tap the arrow when you're finished. Keep in mind this must be a valid phone number. Google Voice or any other VoIP services will not work. Telegram will send you a code via SMS."
    },
    {
      "title": "Enter the verification code.",
      "content": "Enter the verification code. Telegram will send you a code via SMS. In some cases, Telegram may call you and read out the code."
    },
    {
      "title": "Enter your first and last name.",
      "content": "Enter your first and last name. This is the name that will appear on your Telegram profile. Tap the arrow when you're finished. Your Telegram account will be created."
    },
    {
      "title": "Open your Contacts.",
      "content": "Open your Contacts . If you're using an iPhone or iPad, tap the Contacts icon at the bottom of the screen. If you have an Android or are using a computer, tap the menu at the top-left corner and tap Contacts . If you haven't already synced your contacts, you'll be prompted to do so now. This allows you to find out which of your contacts is on Telegram. Tap Allow Access (iPhone/iPad) or Continue (Android) to sync your contacts."
    },
    {
      "title": "Search for a contact by username.",
      "content": "Search for a contact by username. If you know the Telegram username of someone you'd like to add, type it into the search bar at the top of the screen. Depending on the version of Telegram, you may have to tap the magnifying glass icon to bring up the search bar. Once you enter the username, it will appear in the search results. If you want to add someone nearby and don't know their username, tap Add People Nearby and follow the on-screen instructions to add people in close physical proximity. [1] X Research source Keep in mind they must also have this page open on their app."
    },
    {
      "title": "Select the person's username.",
      "content": "Select the person's username. This creates a new conversation with the selected user."
    },
    {
      "title": "Select ⋮.",
      "content": "Select ⋮ . It's at the top-right corner of the conversation on an Android and on a computer. If you're using an iPhone or iPad, tap the person's profile photo at the top-right corner."
    },
    {
      "title": "Tap Add to Contacts.",
      "content": "Tap Add to Contacts . This adds the selected contact to your Contacts list. Depending on your version, you may see Share My Contact instead. This option adds the user to your Contacts list and also requests that they do the same."
    },
    {
      "title": "Tap the ☰ and select Contacts.",
      "content": "Tap the ☰ and select Contacts . If you're using an iPhone or iPad, just tap Contacts at the bottom of the screen. If you'd like to send a message to someone in a group, click or tap the group name at the top of the screen and scroll down to the list of participants now."
    },
    {
      "title": "Select a contact.",
      "content": "Select a contact. This starts a new conversation. If you selected a member of a group, click or tap Send Message or the chat bubble icon to start a conversation."
    },
    {
      "title": "Start a secret chat (optional).",
      "content": "Start a secret chat (optional). If you need an extra layer of security and you're using a phone or tablet, you have the option of sending a secret message. [2] X Research source Secret messages are not saved in the cloud, so you won't be able to see them when using Telegram anywhere other than the current phone or tablet. To switch to Secret mode, tap the person's profile photo (iPhone/iPad) or the three-dot menu (Android) at the top-right corner of the conversation, and then select Start Secret Chat ."
    },
    {
      "title": "Create a message.",
      "content": "Create a message. In addition to typing into the area at the bottom of the conversation, you can also do the following: Click or tap the paperclip icon to attach media, such as photos , videos, and documents. Click or tap the smiley face to insert emoji, GIFs , and stickers. Click or tap the microphone to record a voice message. If it's your first time, follow any on-screen instructions to give the app permission to access your microphone."
    },
    {
      "title": "Press ↵ Enter or ⏎ Return to send the message.",
      "content": "Press ↵ Enter or ⏎ Return to send the message. The message will be delivered to the recipient. To find your other conversations, tap Chats at the bottom of the screen (iPhone/iPad) or in the menu (Android). If you're using a computer, your chats run along the left side of the screen. To search all of your chats, enter your search terms into the search bar on the Chats tab."
    },
    {
      "title": "Tap the ☰ and select Contacts.",
      "content": "Tap the ☰ and select Contacts . If you're using an iPhone or iPad, just tap Contacts at the bottom of the screen. You can also open an existing chat conversation by clicking or tapping Chats . Telegram voice calls use Wi-Fi or your data plan rather than your phone minutes. To adjust who can call you on Telegram, open your Telegram Settings (at the bottom of the screen on iPhone/iPad and in the three-line menu on other platforms), select Privacy and Security , and then select Calls or Voice Calls . [3] X Research source"
    },
    {
      "title": "Tap the ⋮ (Android) or the user's profile photo (iPhone/iPad).",
      "content": "Tap the ⋮ (Android) or the user's profile photo (iPhone/iPad). Skip this step if you're using a computer."
    },
    {
      "title": "Click or tap the phone icon.",
      "content": "Click or tap the phone icon. It's near the top of the screen. The person you're calling will receive a notification (if permitted by their own settings) that you're calling them on Telegram. To send messages or files while you're on the voice call, tap the message icon at the bottom-left corner of the conversation. Click or tap the microphone icon to toggle the Mute feature on or off. Tap the red-and-white phone receiver when you're ready to hang up."
    },
    {
      "title": "Join an existing group.",
      "content": "Join an existing group. Click or tap the invitation link you receive from a current member and then follow the on-screen instruction to join. You can also join public groups if the invitation link is publicly shared on websites or in other groups. Try searching the internet for \"public Telegram groups\" for lists organized by category or topic."
    },
    {
      "title": "Create a new group.",
      "content": "Create a new group. Telegram allows you to create group chats for up to 200,000 users. [4] X Research source As a group admin, you can manage the group's privacy, assign admin rights to other users, moderate the conversation, and control who can access the chat. To start a group chat: Go to the Chats section of the app. It'll be in the menu (desktop and Android) or at the bottom of the screen (iPhone/iPad). Tap the pencil icon at the top-right corner and select New Group on phones/tablets, or click the menu at the top-left corner and select New Group if you're using a computer. [5] X Research source Select members to join. Click or tap Next or the checkmark. Give the group a name and add a photo if desired. Click or tap the Create or the checkmark. To manage the group and invite others , click or tap the group name at the top of the conversation."
    },
    {
      "title": "Manage your group.",
      "content": "Manage your group. As a group administrator, you can click or tap the group's name and select Info to access all administrator settings. Here you can add more admins, invite people, change the group's status from public to private, and more."
    },
    {
      "title": "Join an existing channel.",
      "content": "Join an existing channel. Channels are used to broadcast mass messages to large audiences (more than 200,000 people). [6] X Research source You'll join most channels by clicking or tapping an invitation link you receive from the channel's admin or a current member, but you can also search for channels on the Chats screen by searching for specific names and keywords. You can join Telegram channels on a computer , iPhone, iPad , and Android."
    }
  ]
}