{
  "url": "https://www.wikihow.com/Use-and-Read-Dial-Vernier-Caliper",
  "title": "How to Use and Read Dial Vernier Caliper",
  "steps": [
    {
      "title": "Close the caliper all the way to make sure no light can be seen through the jaws.",
      "content": "Close the caliper all the way to make sure no light can be seen through the jaws. If there is this means the caliper needs to be clean thoroughly or there is a metal burr on the jaws that needs to be filed off."
    },
    {
      "title": "With the clamp still closed, loosen the bezel nut and twist the outside of the dial until the needle is set to zero and tighten the bezel nut.",
      "content": "With the clamp still closed, loosen the bezel nut and twist the outside of the dial until the needle is set to zero and tighten the bezel nut."
    },
    {
      "title": "Clean the part that is being measured because this can greatly affect the precision of the measurement.",
      "content": "Clean the part that is being measured because this can greatly affect the precision of the measurement. [1] X Research source"
    },
    {
      "title": "Determine which side of the jaw to use (inside or outside) based on what is being measured.",
      "content": "Determine which side of the jaw to use (inside or outside) based on what is being measured. The inside is used for gaps and holes and outside is used for thickness, length, width. [2] X Research source"
    },
    {
      "title": "Open up the jaws and measure the part.",
      "content": "Open up the jaws and measure the part. Make sure that there is a snug feel when closing the jaws but that the part can slide in and out of the jaws without complication. Tighten the lock screw to hold the position on the caliper. [3] X Research source"
    },
    {
      "title": "Before determining the measurement, know what the marks mean:",
      "content": "Before determining the measurement, know what the marks mean: Every mark equals 1/10 or .1 and every 10 marks equal 1 inch (2.5 cm) and on the dial indicator, the number that the needle rest on needs to be expressed in thousandths so whatever number you receive should be multiplied by .001. [4] X Research source"
    },
    {
      "title": "When looking at the caliper there is a straight edge to the left of the dial indicator.",
      "content": "When looking at the caliper there is a straight edge to the left of the dial indicator. First find how many inches the straight edge went past and then see how many tenths the straight edge went past and write this down. Now look at the dial indicator take the number under the needle and multiply it by .001 and write it down. [5] X Research source"
    },
    {
      "title": "Add all the numbers making sure the decimal places are correct.",
      "content": "Add all the numbers making sure the decimal places are correct."
    }
  ]
}