{
  "url": "https://www.wikihow.com/Take-Care-of-Lizard-Eggs",
  "title": "How to Take Care of Lizard Eggs",
  "steps": [
    {
      "title": "Choose a container.",
      "content": "Choose a container. The lizard that laid the eggs and the size of the eggs will determine what size container you use. Small eggs can be placed in deli cups or plastic containers. Medium-sized eggs can be placed in sandwich containers, and large eggs in larger plastic containers. [1] X Research source Cover the container with a lid that has holes poked in it for ventilation. Measure the container so you can choose an incubator large enough for your container."
    },
    {
      "title": "Purchase an incubator.",
      "content": "Purchase an incubator. Incubators are used to regulate the temperature as your eggs get ready to hatch. They should be insulated to keep a constant temperature and have clear sides or an easy way for you to watch the eggs. You can buy incubators at pet stores, farm supply stores, and online. [2] X Research source Make sure the incubator that you buy is large enough for your container of eggs. Make sure to measure the container before choosing an incubator. Hovabator incubators are inexpensive and used often by lizard pet owners. They work well for most species of lizard. Buying an incubator is probably the best option, especially if you are not experienced in hatching lizard eggs."
    },
    {
      "title": "Make sure the thermometer is accurate.",
      "content": "Make sure the thermometer is accurate. No matter if you have a commercial or homemade incubator, you should make sure that the thermometer works properly. You have to keep the incubator at a specific temperature, so you need to make sure it is accurate. [3] X Research source The exact temperature you have to keep the chamber will vary depending on the species. Research the particular species of lizard you have to make sure you keep it at the proper temperature. For example, most temperate and tropical species need around 80 to 85 degrees Fahrenheit (25 to 29 degrees Celsius)."
    },
    {
      "title": "Make an incubator.",
      "content": "Make an incubator. If you don't have time or don't want to buy an incubator, you can make one. To do this, get a fish tank, an aquarium heater, two bricks, and plastic wrap. Place the bricks in the tank and fill it with water to just below the top of the bricks. Place the egg container on top of the bricks when you are ready to incubate. Put the aquarium heater in the water and set it to the correct temperature. Seal the top with plastic wrap to hold in the heat and humidity. You can also use a styrofoam cooler raised over a heating pad. Wait until the heating pad heats the styrofoam cooler to the right temperature, and then place your egg containers inside. [4] X Research source Make sure to measure the container you are going to use for your eggs before making an incubator. You want to make sure the container will fit into the incubator."
    },
    {
      "title": "Keep the eggs warm and protected if you cannot get an incubator.",
      "content": "Keep the eggs warm and protected if you cannot get an incubator. If there is no way for you to buy or make an incubator, you can leave the eggs where they are in the vivarium. First, look up to see if your species of lizard bury their eggs or leaves them in the open. [5] X Research source If they bury them, cover the eggs with a light layer of substrate. Stick a digital thermometer into the substrate next to the eggs. If your lizard leaves eggs out in the open, make a hole in a deli cup and place it over the eggs. Put a damp paper towel under the cup to keep the eggs from drying out. [6] X Research source In both cases, use heat lamps and pads to keep the temperature of the vivarium at the appropriate level for the species of lizard."
    },
    {
      "title": "Mark the eggs with a pencil.",
      "content": "Mark the eggs with a pencil. Once you uncover the eggs, you should not turn them. Lizard eggs begin developing almost immediately and attach to the side of the egg. Use a pencil to gently mark the side of the egg facing you when you found it. This helps you remember the top of the egg so you don't damage the lizard inside. Sometimes the embryo inside can roll the egg.Put it the right way up immediately. However, an egg that has rolled over isn’t necessarily fatal to the embryo. [7] X Research source Moving them or rolling them to the other side can damage the embryo and kill the developing lizard."
    },
    {
      "title": "Separate the eggs.",
      "content": "Separate the eggs. Some lizards will lay their eggs in a pile, which makes them stick together. If you find them early enough, you should carefully separate the eggs, trying not to damage the fragile shells. If they are stuck together, don't force them apart. [8] X Research source Separating the eggs help protect them. If one egg dies, mold or fungi from it can infect the healthy eggs. Although, a mouldy egg does not mean that the embryo inside has died. Sometimes mouldy eggs produce perfectly healthy reptiles."
    },
    {
      "title": "Choose an incubation medium that will retain water and remain sterile.",
      "content": "Choose an incubation medium that will retain water and remain sterile. The medium, or substance, that you place the eggs on inside the incubation tank is important. It should be able to retain water to help keep the incubator humid. It should be sterile or close to it, and it shouldn't promote growth of mold or fungi. [9] X Research source Perlite and vermiculite are common mediums that eggs can successfully incubate and hatch on. These mediums are very similar, and the choice is usually based on preference. You can find these substances at nurseries or home improvement stores with garden centers."
    },
    {
      "title": "Keep the medium moist.",
      "content": "Keep the medium moist. Incubation medium goes on the bottom of the container you're placing your eggs in. Place about one to two inches (25 to 50 mm) of the medium at the bottom of the container. It is important to keep the incubation medium moist while waiting for the eggs to hatch. Add water until the medium is barely clumping together. It should not be so wet that water drips out of it when it is squeezed. [10] X Research source Keep the medium at this moisture level until the eggs hatch."
    },
    {
      "title": "Make places in the medium for the eggs with your finger.",
      "content": "Make places in the medium for the eggs with your finger. Before you move the egg, make an indentation with your finger in the incubation medium where you want to put the egg. This gives the egg a secure place to lay so it won't roll around and hurt the embryo. This space also allows you to bury the egg slightly. The egg should be about half-covered with the medium. [11] X Research source Place multiple eggs about a fingers width apart from each other. Place the indentations in a line."
    },
    {
      "title": "Move the eggs into the container very carefully.",
      "content": "Move the eggs into the container very carefully. When you are ready to move the eggs, use great care. First, make sure your hands are clean. Don't turn or roll the eggs around when moving them. Keep the top of the egg where you made a pencil mark facing up. Place them in the medium inside the container. [12] X Research source Don't let the eggs roll around when you move them. If the eggs are stuck on a branch, remove the branch and place it in the incubator. Do not try to remove the eggs from the branch because they will break. Cut the branch as small as possible without disturbing the eggs and try to find a container big enough for the branch too."
    },
    {
      "title": "Place the container in the incubator.",
      "content": "Place the container in the incubator. Close the lid on the container containing the eggs. Then, place the container in the incubator. Write down the date of when the eggs were laid and placed in the incubator, calculate when they should hatch, and mark it on your calendar."
    },
    {
      "title": "Monitor the temperature.",
      "content": "Monitor the temperature. During the incubation process, you should make sure the temperature stays regular. Maintaining the temperature is one of the most important things you can do to ensure that your eggs don't die. [13] X Research source Check the thermometer to make sure the temperature is not fluctuating inside of the incubator. Make sure to keep the medium damp if the temperature dries it out."
    },
    {
      "title": "Check the eggs regularly.",
      "content": "Check the eggs regularly. Watching the eggs is important as you wait for them to hatch. Eggs may go bad and die at any point during the incubation process. Eggs may get too hot, too cold, wet, or dry and go bad. [14] X Research source Wet eggs may begin to grow mold, while dry eggs may start to collapse. Remove any bad eggs so they don't contaminate your healthy eggs."
    },
    {
      "title": "Adjust the conditions based on moisture level.",
      "content": "Adjust the conditions based on moisture level. If the eggs or medium are too wet, uncover the container. Leave it uncovered for a couple of days until the extra moisture evaporates. If the eggs are dry, add water to the medium. Do this slowly so you don't get everything too wet. [15] X Research source Never drop water directly onto the eggs. Drip water around the egg into the medium. Try using an eyedropper or a wet rag."
    },
    {
      "title": "Use a candling device to check the state of the eggs.",
      "content": "Use a candling device to check the state of the eggs. You can buy a fiber optic candling device or small white LED light to check the eggs. Shine the light close to the egg, but be careful not to press on the egg or move it. The inside of the egg will glow. Healthy eggs should be pink and red with a few blood vessels inside. [16] X Research source If it glows yellow, either the egg is infertile, dead, or not enough time has passed to see growth yet. Eggs that are infertile or dead will turn an off-white or yellowish color and eventually grow mold or cave in."
    },
    {
      "title": "Set up the cages for the hatchlings.",
      "content": "Set up the cages for the hatchlings. While you wait for your eggs to hatch, set up an enclosure for hatchlings . Make sure you have everything you need, including food. Most lizards will need to be put in small cages lined with paper towels in the first few weeks of life. Make sure the cage has the proper heat and humidity for babies. Babies will usually shed their first shed in 24 hours and you need to make sure it all comes off. Having the proper humidity will ensure you don't have shedding issues. Add a small water dish or get a misting bottle ready if the species only drink water droplets. Some babies require less heat than adults. Research specific heat requirements for babies of the species you have."
    }
  ]
}