{
  "url": "https://www.wikihow.com/Tread-Water",
  "title": "How to Tread Water Easily and Effortlessly",
  "steps": [
    {
      "title": "Move both your arms and legs to keep your head above the water.",
      "content": "Move both your arms and legs to keep your head above the water. Make use of all four of your limbs and keep your body upright (vertical). Turning your body horizontally and kicking with your legs will mean that you’re swimming, not treading water. [1] X Research source"
    },
    {
      "title": "Spread your arms out to the side and move them back and forth.",
      "content": "Spread your arms out to the side and move them back and forth. Move your arms forward and back with your palms facing the direction your arms are moving. This will keep your upper body up. Moving your arms in a vertical motion will cause your body to bob up and down in the water. [2] X Research source"
    },
    {
      "title": "Pedal your legs in a circular motion or kick your feet back and forth.",
      "content": "Pedal your legs in a circular motion or kick your feet back and forth. If you are moving your legs in a circular fashion, keep them flexed as your move them in a way similar to how you would pedal a bike. If you are kicking back and forth, point your feet downward and kick them constantly. [3] X Research source"
    },
    {
      "title": "Keep your chin lifted and breathe normally.",
      "content": "Keep your chin lifted and breathe normally. Keep your head above water and try to slowly regulate your breathing . Lift your chin and slightly tilt back your head. Slowing down your breath will help you calm down, conserve energy, and tread water for longer. [4] X Research source"
    },
    {
      "title": "Lean back and gently paddle your arms and feet to conserve energy.",
      "content": "Lean back and gently paddle your arms and feet to conserve energy. Give your body a temporary break from paddling by angling your body so you’re slightly leaning back in the water. You'll still have to paddle with both arms and legs, but not nearly as much as you would have to with your body vertical. [5] X Research source"
    },
    {
      "title": "Hold onto a flotation device if you're having trouble staying above water.",
      "content": "Hold onto a flotation device if you're having trouble staying above water. If there is anything near you that you can hold onto to stay afloat, do so in order to save energy. A raft, log, paddle, or anything equally as buoyant will do the trick. [6] X Research source"
    },
    {
      "title": "Start easy by doing the dog paddle.",
      "content": "Start easy by doing the dog paddle . Extend one arm and draw it back in towards your body, and then keep alternating between your left and right arms in a clawing motion. Point your toes and keep kicking your feet the entire time. [7] X Research source Advantage : This basic technique doesn’t require a lot of practice Disadvantage : It saps energy fast, so you won't be able to do this technique for very long."
    },
    {
      "title": "Use your feet as propellers by doing the flutter kick.",
      "content": "Use your feet as propellers by doing the flutter kick . Keep your arms outstretched for balance and kick your feet rapidly. Point your toes downward and kick one leg forward as you kick the other leg back. Maintain a consistent back and forth motion. Advantage : Your arms remain free while doing the flutter kick, giving you an opportunity to rest them. Disadvantage : Because you're using just your legs to stay above water, it can be taxing for your lower body."
    },
    {
      "title": "Save energy by doing the frog kick.",
      "content": "Save energy by doing the frog kick. Starting with your legs together, bend your legs at the knees then quickly extend them and whip them to the side. Draw your legs back together and repeat the motion. Point your toes as you kick out your legs and flex them when you bring your legs back together. [8] X Research source Advantage : This kick is less tiring than the flutter kick and the dog paddle. Disadvantage : The technique causes you to bob up and down in the water instead of staying relatively motionless."
    },
    {
      "title": "Tread water with just your hands by sculling.",
      "content": "Tread water with just your hands by sculling. To scull, keep your hands outstretched to the side and completely submerged. With your palms facing inward, keep your arms straight and move your hands towards one another until they are almost touching. When you've reached this point, turn your palms outward and move your hands back out to their original position. Keep your arms moving in one fluid motion without stopping between moving your arms forward then back. [9] X Research source Advantage : Your legs remain free when sculling, allowing you to combine this with another foot treading technique such as the flutter kick. Disadvantage : Minus your head, your entire body will be submerged in the water."
    },
    {
      "title": "Tread for a longer period of time with the eggbeater.",
      "content": "Tread for a longer period of time with the eggbeater . Also called the “rotary kick,” do this by circling one leg clockwise and the other counterclockwise. You should be kicking one leg out as you bring the other in. [10] X Research source Advantage : You save a lot of energy doing this technique if done correctly. Disadvantage : This is a hard technique to perfect, and many people need to practice extensively in order to learn it."
    },
    {
      "title": "Tread water horizontally with the little helicopter.",
      "content": "Tread water horizontally with the little helicopter. Lay back in the water as you would when you float on your back . Immediately move your hands in a backwards circular motion and kick your feet up and down with pointed toes. Advantage : It’s very simple to explain to children. Disadvantage : Moving your hands in this circular motion can become tiring."
    }
  ]
}