{
  "url": "https://www.wikihow.com/Write-up-a-Science-Experiment",
  "title": "How to Write up a Science Experiment",
  "steps": [
    {
      "title": "Start with an abstract.",
      "content": "Start with an abstract. The abstract is a very short summary of the paper, usually no more than 200 words. Base the structure of your abstract on the structure of your paper. This will allow the reader to see in short form the purpose, results, and significance of the experiment. The purpose of this short summary is to provide the reader with enough information on the experiment that they can see if they want or need to read the entire report. The abstract helps them determine if your research is relevant to them. Devote a sentence to describing the purpose of the project and its significance. Then, very briefly describe the materials and methods used. Follow up with a 1-2 sentence description of the results of the experiment. You might also provide a list of keywords listing subjects related to your research."
    },
    {
      "title": "Write an introduction.",
      "content": "Write an introduction. [1] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 8 September 2021. Begin with a short outline or review of related literature or experiments. Then, outline or summarize the theoretical background of the issue. Next, provide a statement about the problem or question that this research has raised. Summarize your project and discuss how it addresses the problem or question. Finally, briefly explain your experiment, but save the details for the materials and methods or analysis section of your paper. [2] X Research source The introduction will outline what the experiment is, why it was done, and why it is important. It must provide the reader with two key pieces of information: what is the question the experiment is supposed to answer and why is answering this question important."
    },
    {
      "title": "Decide what your expected results should be.",
      "content": "Decide what your expected results should be. This is an educated and well-articulated explanation of the expected results of your research known as a hypothesis. Your hypothesis should go into your introduction, near the end. [3] X Research source A research hypothesis should be a brief statement that pares down your problem that you described in your introduction into something that is testable and falsifiable. Scientists must create a hypothesis from which an experiment can reasonably be designed and carried out. A hypothesis is never proved in an experiment, only \"verified\" or \"supported\"."
    },
    {
      "title": "Formulate your hypothesis",
      "content": "Formulate your hypothesis correctly. [4] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 8 September 2021. You should start with a general statement about your expected results and build upon it to make it testable. Then, expand upon the idea to give it more directionality. Finally, add enough detail to explain your ideas and make your hypothesis testable. [5] X Research source For example, you might start with \"Fertilizer affects how tall a plant will grow\". You could expand this idea to a clear hypothesis: \"Plants grow faster and taller when they are given fertilizer\". To make it a testable hypothesis, you could add experimental details: \"Plants which are given a solution with 1 milliliter (0.034 fl oz) of fertilizer grow faster than plants without fertilizer because they are given more nutrients.\""
    },
    {
      "title": "Designate a section in your report for explaining your research design.",
      "content": "Designate a section in your report for explaining your research design. Sometimes this is titled \"Procedure\" or \"Materials and Methods\". The purpose of this section is to provide your reader with exactly how you conducted your experiment. Explain all of the materials used and the exact procedure used during the experiment. [6] X Research source The goal here is to make your procedure clear and followable. Someone should be able to repeat your experiment exactly from reading this section. [7] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 8 September 2021. This section is extremely crucial documentation of your methods of analysis."
    },
    {
      "title": "Describe all the materials needed to conduct the experiment.",
      "content": "Describe all the materials needed to conduct the experiment. [8] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 8 September 2021. This can simply be a list or a few paragraphs of description. Describe any lab equipment used such as the size, brand, and type. It is often helpful to include a diagram of how these materials were set up. Additionally, explain what you used as your research material. For example, if you were testing how fertilizer affects plant growth, you would want to state what brand of fertilizer you used, what species of plant you used and what brand of seed. Make sure you include the quantity of all objects used in the experiment."
    },
    {
      "title": "Describe the exact procedure you used.",
      "content": "Describe the exact procedure you used. Write this in terms of detailed steps. Write down, step by step, a set of detailed instructions on how you did the experiment. Include descriptions of all measurements made and how/when they were recorded. Describe any steps you took to reduce experimental uncertainty. This could be the use of extra controls or restrictions, or precautions. Remember all experiments involve controls and variables. Describe these here. If you used a published laboratory method, be sure to provide a reference for the original method. Remember the goal of this section is so the reader can repeat exactly what you did in your experiment. No detail should be left out. [9] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 8 September 2021."
    },
    {
      "title": "Designate a section of your report for your results.",
      "content": "Designate a section of your report for your results. This will be the bulk of your report. In this section, you should describe the results of both qualitative and quantitative methods of analysis. Make sure data is both graphed or diagrammed as well as described. All graphs and diagrams should have a number and title. Include any statistical tests and their results in this section. For example, if you are testing the effect of fertilizer on plant growth you would want a graph showing the average growth of plants given fertilizer vs. those without. You would also want to describe the result. For example \"Plants which were given a concentration of 1 milliliter (0.034 fl oz) of fertilizer grew an average of 4 centimeter (1.6 in) taller than those that were not given fertilizer.\" As you go along, narrate your results. Tell the reader why a result is significant to the experiment or problem. This will allow the reader to follow your thinking process. Compare your results to your original hypothesis. State whether or not your hypothesis was supported or not by your experiment. Quantitative data is anything expressed in terms of numerical forms such as percentages or statistics. Qualitative data is derived from broad questions and is expressed in the form of word responses from study participants."
    },
    {
      "title": "Include a discussion section.",
      "content": "Include a discussion section. This is where you discuss the meanings of your results in depth. Explain whether or not your expectations were met. Present or compare your results to other studies, then suggest further avenues of research into the problem you addressed. [10] X Research source In this section, the author can address other questions such as: \"why did we get an unexpected result?\" or \"what would happen if one aspect of the procedure was altered?\". If your results did not verify your hypothesis, explain your reasoning why."
    },
    {
      "title": "Write a conclusion.",
      "content": "Write a conclusion. [11] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 8 September 2021. This summarizes the experiment and what your results told you about the problem the experiment addressed. Summarize the problem the experiment addressed and the researched questions which framed the analysis. Next, explain what the experiment shows your problem. Finally, briefly describe any pitfalls or challenges that occurred during the process and suggestions for further research. [12] X Research source Be sure to link back to the introduction and whether or not the experiment addressed the goals of your analysis."
    },
    {
      "title": "Make sure you have citations.",
      "content": "Make sure you have citations. [13] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 8 September 2021. If you have referenced any research or ideas other than your own, make sure they are properly referenced. You can do this in the text with a mention of the year and author in parentheses. Then, include a full bibliographic reference in the works cited section at the end of the document. You can use software such as EndNote to help you cite and build a properly referenced bibliography."
    }
  ]
}