{
  "url": "https://www.wikihow.com/Style-Straight-Hair",
  "title": "How to Style Straight Hair",
  "steps": [
    {
      "title": "Blow-dry your hair for additional volume.",
      "content": "Blow-dry your hair for additional volume. An excellent blow-dryer and a high-quality round brush are the keys to voluminous hair. Wrap a towel around your hair and squeeze the excess water from your locks. Unless you use a microfiber towel, avoid rubbing your wet hair. Doing so with a regular towel leads to frizz and split ends. If you have long, thick hair, apply a tennis ball sized amount of volumizing mousse to roots. If your hair is thinner or shorter, use a smaller handful. Dry your hair on a medium heat until it is slightly damp. Section off the top layer of your hair a secure it with a clip on the crown of your head. Section by section, pull your hair over a round brush and simultaneously run your blow-dryer down the length of your hair. Do not immediately remove the brush once the hair is dry. Allowing it rest while your hair cools will preserve your the shape and volume of your tresses. You can also run your hair dryer over the curls with the setting on cool to preserve the shape. Repeat this process with the top layer of your hair."
    },
    {
      "title": "Dedicate time to curling your hair.",
      "content": "Dedicate time to curling your hair. When curled, pin-straight hair tends to fall flat in a matter of minutes. With patience, time, and attention to detail, you can overcome your hair’s inability to hold a curl. When you intend to curl your hair, do not apply conditioner in the shower."
    },
    {
      "title": "For fine hair, set your curling iron to 300°.",
      "content": "For fine hair, set your curling iron to 300°. For thicker hair, set your curling iron to 350°. Apply a coin-sized amount of volumizing mousse to roots of your damp hair. Find one that doubles as a heat protectant. Otherwise, spritz your hair with heat protectant spray before straightening. Blow-dry your hair for additional volume. Divide your hair into 2 to 4 layers. Secure the top layers with clips, leaving the bottom layer down. Take a 1 to 2 inch section of hair and coat it lightly with hairspray. Wrap the section around the barrel, pulling it tight to distribute heat throughout the hair. After five seconds, lift the clip and slide the barrel out without releasing the curl. Use a metal duck clip to secure the curl to your head. Repeat until all of your hair is curled. Once you have curled all of your hair, remove all of the duck clips and shake out your hair. Spray your hair with a light texturizer instead of hairspray."
    },
    {
      "title": "Use a straightener to achieve a sleek look.",
      "content": "Use a straightener to achieve a sleek look. Straighteners aren’t just for people with curly or wavy hair—using them on your straight hair will create sleek, chic, glossy locks. [1] X Research source Set your straightener to an appropriate temperature for your hair type: If you have fine hair, set your straightener between 250° to 300.° If your hair is moderately thick, set your straightener between 300° to 350° If you have thick hair, set your straightener between 350° to 400°. [2] X Research source Apply a heat protectant before straightening your hair. Heat protectants coat the follicle and seal in moisture. They prevent an array of damage, such as split ends and fried hair. [3] X Research source Divide your hair into 5 to 7 sections. Secure the top layers with clips, leaving the bottom section unclipped. Divide the bottom section into 1 to 2 inch subsections of hair. To maintain volume, place the flatiron ½ inch below the roots of the first subsection. Quickly glide the straightener down the hair shaft. If you have thick hair, place a fine-toothed comb below the flat iron as you straighten your hair to achieve a sleek look. Repeat this process until you reach the top section. Divide the top section into 1 to 2 inch subsections of hair. Place the flatiron as close to the roots as possible and swiftly glide the straightener down the hair shaft. Repeat until you have completed straightening the top section. Spray your sleek hair with a shine boosting spray. [4] X Research source"
    },
    {
      "title": "Tease your hair for additional volume.",
      "content": "Tease your hair for additional volume. Teasing your pin-straight locks will transform your flat hair into bouncy locks. Part your hair in the center or to the side. Use a comb to create two layers of hair on top of your head: a top layer and an underneath later. Secure the top layer with a duck clip. With a tailed comb, begin teasing the underneath layer 2 inches from your roots. After each downward stroke, fully remove the comb from your hair. Gradually increase your distance from the roots until you have created the amount of volume you desire. Unclip the top section and gently brush it over the teased underneath layer. Spray your teased tresses with hairspray to secure the look."
    },
    {
      "title": "Add texture to your straight hair.",
      "content": "Add texture to your straight hair. Achieving the perfectly textured do is extra challenging when you have straight hair. Attempt to add texture to your pin-straight locks through one or more methods: For a beachy look, curl the middle section of your hair only. To produce a wavy look, first plait your hair into one or more even braids. Slowly run your straightener down the length of each braid. Remove the elastic band, undo your plait, and observe your subtle waves. To achieve waves without the heat, braid your hair while damp and apply a sea salt spray. For a perfectly tousled look, spray your hair with dry shampoo and scrunch your locks."
    },
    {
      "title": "Wear your hair down and natural.",
      "content": "Wear your hair down and natural. One of the benefits of straight hair is that it requires very little maintenance and effort to style. Leave your tools and products in the drawer or under the sink. Simply run a brush through your hair and wear it down for the day."
    },
    {
      "title": "Wear your hair up.",
      "content": "Wear your hair up. Up-dos are appropriate for every occasion. Put your hair in a simple ponytail or a classic chignon. Tease your hair and pull it back into a half-ponytail. Experiment with different braids—try a fishtail braid, a crown braid, or a series of small side braids. [5] X Research source"
    },
    {
      "title": "Shampoo your hair less frequently.",
      "content": "Shampoo your hair less frequently. Shampoo strips your scalp of its natural, nourishing oils. When you over shampoo your hair, it becomes dry and lifeless. Those with fine straight hair will need to shampoo their hair more frequently than those with thick straight hair. Fine straight hair becomes oily quick. Apply shampoo 3 to 4 times a week. Use a volumizing shampoo that does not contain any heavy conditioners. [6] X Research source Thick straight hair benefits from the presence of your scalp’s natural oils. Apply shampoo directly to your scalp 2 to 3 times per week. Purchase a product with natural oils, such as keratin and argan oils. [7] X Research source"
    },
    {
      "title": "Condition your hair according to your hair type.",
      "content": "Condition your hair according to your hair type. In addition to hydrating your locks, conditioners produce a glossier, healthier mane that is less prone to breakage and damage. The number of times you need to apply conditioner to your hair each week depends upon your hair type. [8] X Research source If you have fine straight hair, over-conditioning will weigh down your locks and make it difficult to style your tresses. Apply conditioner sparingly after each time you shampoo. Do not apply any conditioner to your scalp, but from the middle of the hair shaft down to the ends. [9] X Research source If you have thick straight hair, the hydrating qualities of conditioners will benefit your locks. Apply a generous amount of conditioner after each shampoo. Do not apply any conditioner to your scalp, but from the middle of the hair shaft down to the ends. [10] X Research source Consider conditioning first and shampooing second. Reversing the order of your hair washing routine will transform oily, limp hair into bouncy, vibrant locks. First, nourish it with a rich conditioner. Then, apply shampoo to remove any excess oils and residue. [11] X Research source"
    },
    {
      "title": "Use dry shampoo between washes.",
      "content": "Use dry shampoo between washes. Dry shampoo is ideal for the individual with naturally oily hair. Applying this product in between shampoos will absorb the oils produced by your scalp. Dry shampoo will transform your lifeless tresses into luscious locks in minutes. [12] X Research source Begin with dry hair. Spray the dry shampoo onto your roots. Massage the product into your scalp with your fingertips. Brush through your hair to evenly distribute the product."
    },
    {
      "title": "Opt for a pixie cut.",
      "content": "Opt for a pixie cut. A pixie cut can provide short straight hair with a lot of volume and movement. To achieve a voluminous pixie, keep the sides cropped, the top long, and add lots of layers throughout your short locks. The pixie is a versatile haircut. You can wear it slightly tousled, slicked backed, or with edgy spikes. [13] X Research source"
    },
    {
      "title": "Try a bob.",
      "content": "Try a bob. The classic bob and its modern variations are chic, timeless, and flattering. These haircuts are easy to style and maintain. By opting for a short to shoulder length haircut, you will reduce the weight of your hair, increasing your ability to add volume to your locks. The severeness of the blunt bob creates the illusion of fullness and volume. When teased, the stacked bob adds movement and volume to fine, limp hair. A lob, or long bob, is ideal for fine, thin hair—it allows you to maintain some length while getting rid of stringy ends. [14] X Research source"
    },
    {
      "title": "Cut your long hair bluntly.",
      "content": "Cut your long hair bluntly. As straight hair grows, the ends can appear stringy and unkept. To avoid this ragged look, opt for a long, blunt cut. A blunt cut will allow you to maintain your hair’s length while creating the illusion of full, thick hair. [15] X Research source If you prefer a less severe look, ask your stylist to add a few face-framing layers. Too many layers will cause fine, straight hair to look thin and stringy."
    }
  ]
}