{
  "url": "https://www.wikihow.com/What-Is-Shake-Weed",
  "title": "Everything You Need to Know About Marijuana Shake",
  "steps": [
    {
      "title": "Shake refers to the small bits of cannabis that naturally shed from weed nugs.",
      "content": "Shake refers to the small bits of cannabis that naturally shed from weed nugs. It is primarily made up of small buds, trichomes, and stems that break off from large nugs during transportation and handling. Shake accumulates over time, typically at the bottom of your weed container. It is ideal for rolling joints, packing bowls and pipes, and making edibles. It tends to be a mixture of strains, but dispensaries often collect enough shake to sell single-strains at a lower price than traditional weed. [1] X Research source Shake is not the same thing as trim, which refers to the trimmings of the marijuana plant. Shake usually gets a bad rep because it is considered the bottom of the barrel when it comes to weed since it’s what accumulates at the bottom of the bag."
    },
    {
      "title": "Shake is more cost-effective than other types of weed.",
      "content": "Shake is more cost-effective than other types of weed. Since shake is made up of shedded content from buds, it tends to be less costly than other types of weed. This is great for cannabis users who are looking to save money. [2] X Research source"
    },
    {
      "title": "Shake’s grounded texture makes it ideal for bowls and joints.",
      "content": "Shake’s grounded texture makes it ideal for bowls and joints. Shake is finer than traditional weed nugs, which makes it ready to use when packing a bowl or rolling a joint. It is perfect if you’re looking for a quick, convenient way to consume your weed. [3] X Research source"
    },
    {
      "title": "Shake is versatile and can be used for edibles, tinctures, and other things.",
      "content": "Shake is versatile and can be used for edibles, tinctures, and other things. Since shake is already fine, you can use it to make Cannabutter, infused teas and coffees, lotions, and other products. With traditional buds, you have to grind up anything you plan on using, which can lead to an excess of grinded weed. Shake doesn’t have that problem! [4] X Research source"
    },
    {
      "title": "Shake is typically less potent than cannabis nugs.",
      "content": "Shake is typically less potent than cannabis nugs. Shake is finely grounded and fragmented, which can result in less potency than nugs. Nugs tend to contain more trichomes and terpenes than shake. The mixture of flower fragments, seeds, stems, and leaves tends to lower the potency when compared to traditional nugs. Lower potency typically results in a less intense high than what you’d get from traditional nugs. [5] X Research source"
    },
    {
      "title": "Shake potency can vary from batch to batch.",
      "content": "Shake potency can vary from batch to batch. Since shake is collected from small buds, leaves, and stems, one batch may contain stronger, more potent buds and less stems, while another contains less potent buds and more stems. It can also feature a mixture of strains. The inconsistency of shake turns some customers away, but it still gets you high. [6] X Research source Some people enjoy shake because it isn’t as strong as regular weed and often provides a nice, relaxed high."
    },
    {
      "title": "Shake can contain cannabinol, which can lead to cell death.",
      "content": "Shake can contain cannabinol, which can lead to cell death. Cannabinol (CBN) is a type of cannabinoid that develops as cannabis ages or degrades from exposure to heat, light, or oxygen. Since shake is more likely to be exposed to these conditions than bud, it’s more likely to contain CBN, which can lead to apoptosis, or programmed cell death. [7] X Trustworthy Source National Cancer Institute An agency in the National Institutes of Health focused on cancer research and patient support Go to source Programmed cell death is a natural process in which cells activate proteins that break them down from the inside to get rid of old, damaged cells and make room for young, healthy cells. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Let the trichomes, buds, and stems naturally shed from your weed nugs.",
      "content": "Let the trichomes, buds, and stems naturally shed from your weed nugs. Shake is produced when buds naturally shed some of their contents, so let nature do its thing and gradually shed the content from the nugs. This can take anywhere from a few days to a few weeks, depending on how much your weed moves around in the packaging. [9] X Research source"
    },
    {
      "title": "Trim is the excess material trimmed from the cannabis plant, while shake is the small bits that naturally shed from the plant.",
      "content": "Trim is the excess material trimmed from the cannabis plant, while shake is the small bits that naturally shed from the plant. Once the buds are harvested from the plant, any excess waste, like leaves, stems, and small, low-quality buds, is trimmed to enhance flavor, potency, and appearance. Trim is usually less potent than shake, which still contains many of the trichomes that contribute to potency. [10] X Research source"
    },
    {
      "title": "Use your shake to make edibles.",
      "content": "Use your shake to make edibles. You’ll need 4 sticks (2 cups) of unsalted butter for this. Decarboxylate your shake by heating it in the oven at 240 ˚F (116 ˚C) for 40 minutes. Slowly melt your butter in a pot filled with 4 cups (950 mL) of water, stir in the decarbed shake and let it simmer for 3 to 4 hours. Then, strain the shake from the butter. Now you have Cannabutter to use for your edibles ! [11] X Research source Use cannabutter as a substitute in recipes for baked goods, like cookies, brownies, and muffins. Adding water to the pot when you’re melting the butter helps control the temperature. Don’t use salted butter or butter substitutes, like margarine, for your Cannabutter."
    },
    {
      "title": "Use your shake to make tinctures.",
      "content": "Use your shake to make tinctures. To make tinctures , heat your shake in the oven at 240 ˚F (116 ˚C) for 40 minutes to decarboxylate the shake. Then, place the shake into an eight-ounce jar and fill it with enough high-proof alcohol to cover the shake. Store the mixture in a dark place for three weeks and shake the jar daily. After three weeks, strain the shake out of the mixture and boom! You’ve got your tincture. [12] X Research source"
    },
    {
      "title": "Use your shake to make topicals.",
      "content": "Use your shake to make topicals. To make topicals , decarboxylate your shake by heating it in the oven at 240 ˚F (116 ˚C) for 40 minutes. Let your shake cool, then stir it into a jar with your oil of choice. Put your jar in a slow cooker and line the bottom with a kitchen towel. Fill the slow cooker with water and make sure it’s higher than the oil. Set it to low and let the oil infuse for 4-6 hours. After infusing, strain the oil into an airtight container. [13] X Research source Your infused topical will be good for up to 3 months. Apply the topical directly to your skin to relieve any pain or swelling. When trying your infused topical, start with a small dose to know how strong it is."
    },
    {
      "title": "Put your shake in a vaporizer.",
      "content": "Put your shake in a vaporizer. Since shake is already finely grounded, it’s great for weed vaporizers. A weed vaporizer is a device that heats up marijuana just enough to activate the THC without burning the flower. It’s a great way to smoke weed on the go without as strong of an odor as a bowl or joint. [14] X Research source"
    },
    {
      "title": "Make infused tea with your shake.",
      "content": "Make infused tea with your shake. To make infused tea , boil 4 cups (950 mL) of water and 1 tablespoon (15 mL) of butter in a medium saucepan. Add a gram of shake to the saucepan and let it simmer for 15 minutes. Then, strain the infused mixture into a heat-safe mug, add a bag of tea, and steep it for 3 minutes. Once you’ve steeped the tea, add any sweeteners you’d like and enjoy! [15] X Research source The butter serves as a bind for the THC, which is crucial if you want to get high. The butter can be subbed for the same amount of milk or coconut oil."
    },
    {
      "title": "Is shake as potent as flower?",
      "content": "Is shake as potent as flower? Typically, shake is less potent than flower. That doesn’t mean it isn’t potent, though. Since shake is made up of parts from a larger nug, it still offers the same effects."
    },
    {
      "title": "Am I getting scammed if I buy shake?",
      "content": "Am I getting scammed if I buy shake? If you buy shake at a higher price than traditional bud, you may be getting scammed. But if you buy shake at a lower price than usual, you aren’t getting scammed, as the lower price reflects the lower quality."
    },
    {
      "title": "Is shake worth it?",
      "content": "Is shake worth it? Yes, shake is worth it! It’s more cost-effective than traditional flower and still provides you with a nice high."
    },
    {
      "title": "Where is the best place to buy shake?",
      "content": "Where is the best place to buy shake? The best place to buy shake is from a licensed marijuana dispensary, as their products are lab-tested and quality controlled. If you’re in a state where marijuana is legal, check online to see if there are any dispensaries near you."
    }
  ]
}