{
  "url": "https://www.wikihow.com/Wash-Towels",
  "title": "How to Wash Towels",
  "steps": [
    {
      "title": "Wash used towels about once a week.",
      "content": "Wash used towels about once a week. Some manufacturers and home advice columnists recommend washing your towels every three or four days, but if your towels are kept in a ventilated area away from steam, you can keep them fresh with a wash once every week or so. [1] X Research source [2] X Research source If your towels develop a new smell, or if you live in a damp climate where mildew thrives, you should wash your towels every few days."
    },
    {
      "title": "Wash towels separately from other clothing (optional).",
      "content": "Wash towels separately from other clothing (optional). Towels tend to absorb colors of other clothing, shed lint, and trap smaller clothes items, which results in a less effective wash. [3] X Research source While it's fine to mix loads if you'd like to save money, time, or energy, be aware that a separate towel load will produce best results. You may wish to wash your towels separately if you used them to clean up a particularly filthy mess, so you don't expose your clothing to stains or germs. [4] X Research source"
    },
    {
      "title": "Sort laundry loads by color.",
      "content": "Sort laundry loads by color. White and light colored laundry items will become discolored if washed with dark colored items, while the dark items will fade over time. Towels are especially absorbent, so if you want to maintain their appearance you should only wash them in separate light and dark loads. This is especially true of new towels. Colored towels should only be washed with the light load if they are faint pastel or pale yellow in color. Otherwise, wash them in the dark load."
    },
    {
      "title": "Wash new towels with special care before using.",
      "content": "Wash new towels with special care before using. Wash them before using to remove special softener that manufacturers use to improve appearance, since that substance makes the towel less absorbent. Because new towels are especially likely to lose their color, use half the usual amount of detergent and add 1/2 – 1 cup of white vinegar (120 – 240 mL) onto the towels to minimize later color bleeding. [5] X Research source If you wish to be especially careful, use this vinegar method the first two or three times you wash a towel."
    },
    {
      "title": "Wash towels with half the usual amount of detergent.",
      "content": "Wash towels with half the usual amount of detergent. Too much soap can damage towels and make them less fluffy. If your load only contains towels, use half the amount of detergent recommended by the manufacturer. If you are washing luxury or extra delicate towels, be sure to use a detergent labeled mild. Detergent typically goes into a tray labeled for this purpose, or is poured directly into some top-load washers. Use an ordinary amount of detergent when washing towels in a load with tougher clothing, or if the towels are heavily soiled. Instructions should be included on the packaging of your detergent. Many liquid detergents have a cap that can be used as a cup, with a line indicating the recommended quantity to use for a typical load."
    },
    {
      "title": "Learn which temperatures are suitable for which towels.",
      "content": "Learn which temperatures are suitable for which towels. Most white and light-colored towels should be washed in hot water. Most dark towels should be washed in warm water, as hot water can make them bleed. [6] X Research source However, if your towels are linen or have a decorative trim or delicate fibers, a cold wash will preserve them best. You may still need to wash delicate towels on warm instead of cold if they become heavily soiled. The hotter the water, the cleaner and more sanitized the towels will be."
    },
    {
      "title": "Use fabric softeners sparingly or not at all.",
      "content": "Use fabric softeners sparingly or not at all. Fabric softeners are optional additions to your laundry load that are typically added in a special tray, separate from your detergent. While they make your clothing supple and soft, they will decrease the absorbency of your towels. Only use fabric softener if you are willing to sacrifice your towel's life span for greater fluffiness, and only do so once every three or four washes. [7] X Research source Consult your washing machine manual if you cannot find the fabric softener tray."
    },
    {
      "title": "Sanitize the towels every third or fourth load with non-chlorine bleach or white vinegar.",
      "content": "Sanitize the towels every third or fourth load with non-chlorine bleach or white vinegar. Add 1/2 cup (120 mL) white vinegar to the detergent once every few loads to keep your towels free of odors and mildew. For a more heavy-duty sanitation, you can use 3/4 cup (180 mL) non-chlorine bleach instead, making sure to use color-safe bleach if your towels are dark in color. Bleach should be placed in the tray labeled for this purpose. If your top-load machine does not have a bleach compartment, mix the bleach with 1 quart water and pour into the machine 5 minutes after the load began. Vinegar is best added during the final rinse when used for this purpose. Pour it into the fabric softener tray, or simply open a top-load washer near the end of the wash and pour it in directly. [8] X Research source"
    },
    {
      "title": "Shake your towels slightly between washing and drying.",
      "content": "Shake your towels slightly between washing and drying. When you remove your towels from the wash, give them a small shake to keep the surface fibers fluffy and absorbent. See the Drying section below for instructions on how to dry your towels."
    },
    {
      "title": "Hang towels up to dry after each use.",
      "content": "Hang towels up to dry after each use. Even if you only used a towel lightly, you should hang it up to dry in an area with good air flow, away from steam. Spread it out so there are no bunches and each part of the towel dries evenly. Proper drying after uses reduces the chance of mildew and increases the towel's life span. Do not hang one towel over another if either of them are still damp. Each towel needs to be fully exposed to air for proper drying."
    },
    {
      "title": "Dry towels immediately after washing.",
      "content": "Dry towels immediately after washing. The longer you let your towels sit around wet, the more chance mildew has to grow on your towels. Dry the towels immediately after you're done washing them to keep them clean. Note that hanging up a towel to dry may take several hours in humid or cold conditions, but as long as they are spread out in an area with good air flow they should be fine."
    },
    {
      "title": "If using a dryer, set it to according to towel material.",
      "content": "If using a dryer, set it to according to towel material. Most towels are made from cotton and should be dried at high heat. Linen towels and towels with a fragile decorative trim should be dried at a cool setting when using a machine. Always remove lint from the lint trap before starting your dryer. A build up of lint could cause a fire. You do not need to sort towels by color when using a dryer. You may include them in a dryer load with other items, but there's the possibility a towel will trap a piece of clothing and prevent it from drying."
    },
    {
      "title": "Do not put the towels in the dryer longer than necessary.",
      "content": "Do not put the towels in the dryer longer than necessary. Keeping towels in the dryer after they are already dry will damage the fibers and weaken your towel. [9] X Research source Check on small loads before the cycle is finished, simply by opening the door. If they're already done, cancel the drying cycle and remove the towels. If your towels are slightly damp at the end of a drying cycle, it may be more economical to hang them up to dry as described below instead of running your dryer again. If you do start another drying cycle, check on it halfway through to see if the towels are dry."
    },
    {
      "title": "Use dryer sheets sparingly.",
      "content": "Use dryer sheets sparingly. Dryer sheets are used to soften your clothing. Much like fabric softener, dryer sheets will create a waxy finish on your towels that interferes with their ability to absorb water. If you still want to use dryer sheets for softer, fluffier towels, limit yourself to using them once every three or four loads."
    },
    {
      "title": "Hang clothes in an airy, warm location to dry.",
      "content": "Hang clothes in an airy, warm location to dry. If you don't have a dryer, or your towels came out slightly damp from the dryer, you can spread them out over a clothes horse, on a clothesline, or on any clean surface with enough room. If you are used to dryers, air dried towels will initially appear stiffer, but will soften immediately when they touch water. Air flow will help dry your towels faster. Pick a breezy location outside or near an open window, but be sure to fasten your towels securely against wind with clothespins. Direct sunlight is best for drying towels and reducing germs. If no sunlight is available, put your towels in front of (but not on top of) a heater. You could also place them above a heating vent."
    },
    {
      "title": "Only use an iron on linen towels",
      "content": "Only use an iron on linen towels . Do not iron towels made of cotton, or other fluffy towels. Linen hand towels may be ironed if you would like to make them smooth and crisp. [10] X Research source After ironing, they may be folded and stored like any other towel."
    },
    {
      "title": "Only store your towels when they are completely dry.",
      "content": "Only store your towels when they are completely dry. There should be no hint of dampness when you touch a dried towel; if there is, you may want to hang them up to dry for another hour or so. When they're ready, fold them several times until they fit comfortably on a shelf without bunching up or getting wrinkled. Consider using your towels in rotation to avoid wearing them out more quickly. Alternatively, save your nicest towels for guests and use the rest for everyday purposes."
    },
    {
      "title": "Learn the benefits and costs of washing by hand.",
      "content": "Learn the benefits and costs of washing by hand. Washing towels by hand saves money, uses much less energy, and doesn't wear them out nearly as quickly as a washing machine. However, while hand towels are relatively easy to wash in a sink or bucket, large towels will become quite heavy when they absorb water, and will take a large amount of work and time to clean. [11] X Research source For large towels, the equipment mentioned below is recommended, especially the agitator. However, instructions for washing using only your hands are also included."
    },
    {
      "title": "Spread out the towels in a clean sink, bathtub, or bucket.",
      "content": "Spread out the towels in a clean sink, bathtub, or bucket. Depending on how large your load of towels is, you'll want to use one of these containers. First, make sure the container is clean by scrubbing with plenty of soap and hot water. When you put the towels in, make sure they are all spread out and not knotted or bunched together. A kitchen sink or heavily used bathtub may require stronger cleaning methods . Allow bleach or other cleaning products time to do their work, then rinse off thoroughly before using the container as a laundry tub."
    },
    {
      "title": "Fill the container with water and a little detergent.",
      "content": "Fill the container with water and a little detergent. You can use cold or warm water; there is no need to make it scalding hot. Add a small amount of mild detergent. A typical 5 gallon (18.9 L) (20 L) bucket requires about a tablespoon (15 mL) of detergent, while a bathtub may require 4 tablespoons (60 mL). Use your judgement and add more detergent if the towels are particularly dirty. Use eco-friendly detergent if you will be dumping the water outside. Always use mild detergent to protect your hand if you don't plan on wearing gloves. Try to use it whenever washing towels, since they tend to be easily damaged by harsh detergents."
    },
    {
      "title": "Add borax for more effective hand washing.",
      "content": "Add borax for more effective hand washing. Borax will soften your water and make it easier for the detergent to do its work. [12] X Research source It is safe and easy to add to your hand washing session, although you should keep it out of reach of pets and children. Try adding one tablespoon of borax per gallon of water (15 mL borax for every 4 L water). You can increase this amount if you are having trouble removing stains, but it's wise to start with a small amount so there is no chance of staining or damaging delicate items. [13] X Research source"
    },
    {
      "title": "Let the towels soak depending on dirt and size of load.",
      "content": "Let the towels soak depending on dirt and size of load. A large or muddy load of towels should be left to soak for 40 – 60 minutes, while a lightly used load that fits in a bucket may be ready in a few minutes.This soaking will save you a lot of effort by removing a portion of the dirt."
    },
    {
      "title": "Press and move the clothes around vigorously.",
      "content": "Press and move the clothes around vigorously. Heavy towels are difficult to agitate by hand, and most easily done using a storebought manual agitator. You can also make your own by purchasing a brand new plunger and cutting holes in the rubber for water to squeeze through. Using your agitator, spend about two minutes (roughly 100 strokes of the agitator) squeezing the towels and pushing them against the walls of the tub. If you are washing hand towels, you may be able to imitate this process by hand. Wearing rubber gloves, squeeze the towels together and against the side of the tub. Large cotton towels will be difficult to wash this way, and if you do not have an agitator tool you should expect to spend much longer than the times listed here to get them fully clean."
    },
    {
      "title": "Wring out the towels.",
      "content": "Wring out the towels. If you own a clothes wringer, you can put each towel through it and wring it by turning the handle with as much pressure as you can. Otherwise, twist each towel by hand in both directions, trying to squeeze as much of the water out as possible. Use rubber gloves if you want to keep your hands clean."
    },
    {
      "title": "Rinse the towels under fresh cold water and let them soak in it for 5 minutes.",
      "content": "Rinse the towels under fresh cold water and let them soak in it for 5 minutes. You can either move the towels to a new bucket of cold water, or empty the container and fill it again with fresh cold water. Rinse the towels in the running water as you fill the bucket. Let soak five minutes before continuing."
    },
    {
      "title": "Agitate the towels in the same way as before.",
      "content": "Agitate the towels in the same way as before. Again, you'll spend about 2 minutes or 100 strokes of the agitator pressing the towels against the walls and base of the container and pushing them around. The water should get less dirty this time around, and contain fewer soap bubbles."
    },
    {
      "title": "Repeatedly rinse, wring, soak, and agitate the towels until they are clean.",
      "content": "Repeatedly rinse, wring, soak, and agitate the towels until they are clean. Repeat the process just as you did after the initial agitation. Rinse the towels under running cold water. Wring the towels dry by twisting and squeezing them by hand or in a wringer. Soak them in a fresh bucket of cold water for five minutes. Agitate them for about another two minutes. One more round should be sufficient for most towels, but heavy or heavily soiled ones may take several more sessions. When the towels are ready, the water should be free of dirt and soap suds. Leaving soap suds on the towels will make them stiff, starchy, and bad at absorbing water. [14] X Research source"
    },
    {
      "title": "Wring the towels out as thoroughly as possible.",
      "content": "Wring the towels out as thoroughly as possible. When the towels appear clean and completely free of suds, twist them through the wringer or using your hands. Do this several times to remove as much water as possible."
    },
    {
      "title": "Hang the towels up to dry.",
      "content": "Hang the towels up to dry. See the section on Drying Towels for information on how to dry your towels using air, skipping the dryer steps. If you need them dried quickly, you can of course follow those instructions in the same section for using a dryer machine."
    }
  ]
}