{
  "url": "https://www.wikihow.com/Straighten-Hair-Without-Frizz",
  "title": "How to Straighten Hair Without Frizz",
  "steps": [
    {
      "title": "Get the right product based on your hair type.",
      "content": "Get the right product based on your hair type. Use shampoos and conditioners that contain the word \"smoothing\" or that are designed to fight/prevent frizz. They will give your hair extra moisture, and prevent it from becoming too dry. Dryness can often appear as frizz. [1] X Research source [2] X Research source When conditioning your hair, apply it to the ends first, as they're likely the most dehydrated. Comb the conditioner through your hair, then rinse it out well. Product build up can also cause frizz. Once a month, wash your hair with a daily clarifying shampoo to remove the buildup."
    },
    {
      "title": "Skip the nylon brush and use a boar bristle brush instead.",
      "content": "Skip the nylon brush and use a boar bristle brush instead. If you can't get one, try to find one that's at least a boar bristle and nylon mix. Plastic brushes tend to cause static, which leads to frizz. Boar bristle brushes help polish and smooth your hair better. [3] X Research source Choose a round brush over a flat brush. The round brush will apply more tension to your hair, which helps create a smoother result."
    },
    {
      "title": "Use a heat protectant spray before you straighten.",
      "content": "Use a heat protectant spray before you straighten. [4] X Expert Source Michael Van den Abbeel Professional Hair Stylist Expert Interview. 7 January 2019. You can also apply a little bit of moisturizing oil into your hair while it is still wet. This will help nourish your hair and keep it smooth while you straighten it. After you are done straightening, you can apply a little bit of oil to smooth down any remaining frizz. [5] X Research source"
    },
    {
      "title": "Use a flat iron with ceramic plates and avoid ones made from steel.",
      "content": "Use a flat iron with ceramic plates and avoid ones made from steel. Steel plates can damage your hair by tugging and pulling on the strands. If you have curly hair, however, you may need something tougher; in this case, choose a gold or titanium flat iron. [6] X Research source Don't get anything that is wider than 1½ inches (3.81 centimeters). If the flat iron is too wide, you won't be able to reach the roots of your hair."
    },
    {
      "title": "Make sure that you are using the right finishing products.",
      "content": "Make sure that you are using the right finishing products. You should also give your hair time to cool down before you apply it. Avoid products that contain too many silicones. Instead, you can apply a drop of oil to your hands, and then smooth it over your hair. For extra hold, spray your brush with some light hold hair spray, then pass it through your hair. [7] X Research source If you apply some oil or serum, go for a natural product. Apply it on the ends of your hair first."
    },
    {
      "title": "Wash your hair with shampoo and conditioner.",
      "content": "Wash your hair with shampoo and conditioner. [8] X Expert Source Michael Van den Abbeel Professional Hair Stylist Expert Interview. 7 January 2019. If you can, use a specialized shampoo and conditioner that's meant for smoothing hair and taming frizz. Make sure that you do this well ahead of time, as your hair will need to be perfectly dry before you straighten it."
    },
    {
      "title": "Towel dry your hair.",
      "content": "Towel dry your hair. When you towel dry your hair, don't rub the towel vigorously across your hair; this will only bring out your hair's natural curl and give you more work. [9] X Research source Instead, gently pat and squeeze your hair dry with an absorbent towel, preferably microfiber. Microfiber towels are much gentler on the hair because they don't rip or tear your hair, like regular towels can. [10] X Research source Ripped, torn hair can look frizzy. If you don't own a microfiber towel, use a t-shirt to dry your hair. It will provide similar results."
    },
    {
      "title": "Apply some straightening cream or smoothing cream.",
      "content": "Apply some straightening cream or smoothing cream. A heat protectant of sorts would also be a great idea. Apply the cream throughout your hair, focusing on the ends, which tend to get dry/damaged the most. If you have thin hair or short hair, you will probably only need a dime-sized amount. If you have thick hair or long hair, start with a quarter-sized amount. Don't apply too much! Doing so will weigh down your hair and cause it to become limp once dry."
    },
    {
      "title": "Use the right technique when blow-drying your hair.",
      "content": "Use the right technique when blow-drying your hair. Always point the nozzle downwards towards your hair; this will help the cuticles on your hair to lie flat. Pull a round, bristle brush through your hair as you blow dry it. This will help straighten it and give you less work later on. [11] X Research source [12] X Research source Before you dry your hair, divide it into sections that are about the size of your brush. Don't keep the hair dryer pointed at 1 section of hair for more than a second at a time. Keep it moving while you dry your hair. Consider switching between the hair dryer's hot and cold settings to give your hair a break from all that heat. You can shake the hairdryer to help your hair dry faster, but always keep the nozzle pointed down. [13] X Research source Never flat iron your hair while it is wet. Doing so can damage your hair. Always blow dry it first (or let it air dry)."
    },
    {
      "title": "Section your hair off.",
      "content": "Section your hair off. It will be much easier to work with smaller sections than huge chunks of hair. You will also get a sleeker, smoother result. Start by dividing your hair into quadrants. Then divide each quadrant into sections that are about the size of your hair brush."
    },
    {
      "title": "Set your flat iron to the right temperature.",
      "content": "Set your flat iron to the right temperature. Even with a heat protectant, high temperatures can damage your hair—and damaged hair often looks frizzy. [14] X Expert Source Michael Van den Abbeel Professional Hair Stylist Expert Interview. 7 January 2019. Don't use the highest setting; instead, set the temperature somewhere between 300 and 350°F (150 and 177°C). If you have thicker hair, you can use a higher temperature, but using a gold or titanium plated flat iron would be better. [15] X Research source Avoid going past 420°F (215°C), as this is when the keratin in your hair breaks down, which can lead to split ends and damage; remember, damaged hair often looks frizzy. [16] X Research source Some research has shown that the ideal temperature for straightening hair is 365°F (185°C). [17] X Research source"
    },
    {
      "title": "Work in small sections, and use the right technique when straightening.",
      "content": "Work in small sections, and use the right technique when straightening. Use a brush to pull a 1 to 2-inch (2.54 to 5.08 centimeters) wide section of hair as taut as you can. Use your free hand to clamp the flatiron down onto the section, close to your roots. Pull the flatiron down the length of your hair in a single, fluid motion. Repeat 1 to 2 more times, if necessary. Avoid using a comb; use a good, bristle brush instead. Combs tend to cause too much static and split-ends on dry hair. [18] X Research source If you pull your hair taut, you won't have to pass the flatiron over it more than once or twice. If you find that you have to pass over your hair repeatedly, you might not be pulling it taut enough. [19] X Research source"
    },
    {
      "title": "Once that section is smooth, repeat the process on the next section of hair.",
      "content": "Once that section is smooth, repeat the process on the next section of hair. Once the entire bottom layer of your hair is down, undo the clip, and let down the rest of your hair. Continue straightening your hair using the same technique. If you have very thick hair, let down another one-fourth or one-third of your hair instead."
    },
    {
      "title": "Finish off with a spray or serum.",
      "content": "Finish off with a spray or serum. Ideally, you should use only a spray, but thicker hair might need a little bit of oil or serum to smooth down any frizz. [20] X Research source To avoid using too much product, apply some spray to your hairbrush, them gently comb your hair. Use your fingers to apply some serum or oil to the ends of your hair, where frizz tends to happen the most."
    },
    {
      "title": "Give your hair time to cool down before stepping outside.",
      "content": "Give your hair time to cool down before stepping outside. This is especially important if it is very hot or humid out. As your hair cools, the style will begin to set. If you rush out too soon, your hair will be more likely to frizz up again. [21] X Research source As an alternative, you can put your hair dryer on the \"cool\" setting and set your style that way. Just lightly blow cool air onto your hair. This will close your cuticle. [22] X Expert Source Michael Van den Abbeel Professional Hair Stylist Expert Interview. 7 January 2019."
    }
  ]
}