{
  "url": "https://www.wikihow.com/Store-Apples",
  "title": "The Best Ways to Store Apples in the Fridge or on the Counter",
  "steps": [
    {
      "title": "Start with apples that are in good shape.",
      "content": "Start with apples that are in good shape. [1] X Research source Inspect your selection of apples and separate the apples that have bruises or soft spots from the apples that are still undamaged. One bad apple really can rot the bunch because apples produce a large amount of ethylene gas as they decay. As a result, you should not store damaged apples with undamaged apples."
    },
    {
      "title": "Place damaged apples out on the counter.",
      "content": "Place damaged apples out on the counter. When kept at room temperature in a basket, apples can stay fresh for about two days. [2] X Research source This is not a long time, of course, but damaged apples should be eaten within a short amount of time no matter how you store them since a partially decayed apple is likely to spoil faster. If the apples are too damaged for human consumption, you could also consider throwing them out into the woods for deer or other wildlife to enjoy. Even if no wild animal is interested, as the apples decay, they will provide a food source for various insects and other organisms living in the dirt."
    },
    {
      "title": "Pile good apples into the refrigerator.",
      "content": "Pile good apples into the refrigerator. [3] X Research source Apples stay fresher for a longer period of time when kept a little cold. Most modern refrigerators have a fruit drawer or crisper drawer, and if your refrigerator has a drawer like this, you should store your apples there. If not, place the apples in an uncovered plastic container near the back of the refrigerator, where it tends to be coldest."
    },
    {
      "title": "Drape a damp paper towel over the apples in the refrigerator.",
      "content": "Drape a damp paper towel over the apples in the refrigerator. Aside from cold temperatures, apples also need a small amount of moisture to stay their freshest. Laying a damp paper towel over the apples provides just enough moisture, [4] X Research source but if you do cover the apples with a wet paper towel, you need to make sure that you do not seal them in an airtight container or drawer."
    },
    {
      "title": "Monitor the temperature, if possible.",
      "content": "Monitor the temperature, if possible. If you have a temperature control dial for your crisper drawer, set it to a temperature between 30 and 35 degrees Fahrenheit (-1.1 to 1.7 degrees Celsius). This is the ideal temperature range for apples to be stored at. Storing them in colder conditions will cause the cells to break down, leading to mushy, inedible apples, and storing them in conditions that are warmer by only 10 degrees Fahrenheit (12.2 degrees Celsius) can cause the apples to ripen twice as quickly. If you do not have temperature control settings that allow you to control the temperature by degrees, but you do have basic settings that allow you to make the refrigerator or crisper drawer colder or warmer, place a thermometer in the drawer and adjust the settings until the thermometer shows a number within the appropriate range."
    },
    {
      "title": "Keep an eye on your apples.",
      "content": "Keep an eye on your apples. Stored this way, apples can stay fresh for up to three weeks."
    },
    {
      "title": "Start with long-keeping apple varieties.",
      "content": "Start with long-keeping apple varieties. Tart, thick-skinned apples like Jonathans, Rome, Melrose, Fuji, and Granny Smiths are usually your best bet. [5] X Research source Sweet, thin-skinned apples, like Red Delicious or Golden Delicious, do not generally do as well. Also make sure that your apples are in good shape. Apples with soft spots or bruises give off a lot of ethylene gas, which can cause nearby apples to decay faster than normal and may thwart your storage efforts."
    },
    {
      "title": "Wrap each apple individually.",
      "content": "Wrap each apple individually. [6] X Research source Even apples that are in good shape give off a little ethylene gas, and as a result, apples that rub up against each other as they are in storage are more likely to rot faster. Moreover, if one apple starts to rot while it is in storage, it could contaminate the other apples it touches, causing the entire bunch to spoil faster. Wrapping each apple individually prevents most of the potential damage caused when apples come into contact with each other. Separate a section of newspaper into quarters and stack those quarters together. Choose a section that only has black ink since colored ink contains poisonous heavy metals. Place one apple on top of the stack of newsprint. Bring the top sheet up and fold it around the apple, gently twisting the corners together the keep the apple wrapped. Do not twist too tightly, since you may tear the paper if you do. The objective is only to prevent the apple from coming into contact with other apples, not to keep the air out. Continue wrapping each apple in a quarter sheet of newsprint until the entire bunch has been covered."
    },
    {
      "title": "Line a crate or cardboard box with insulation.",
      "content": "Line a crate or cardboard box with insulation. [7] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source The container should not be airtight, since you do not want to completely restrict airflow to your apples as you store them, but it should keep out most of the air. Insulating the box also helps regulate the temperature of your apples and the amount of airflow it receives. Line the containers with straw or perforated plastic liners."
    },
    {
      "title": "Place your apples in the insulated container.",
      "content": "Place your apples in the insulated container. Line them up side by side, making sure that the newsprint wrappings do not come undone and that the apples are not directly touching skin to skin."
    },
    {
      "title": "Store the apples in a cold location.",
      "content": "Store the apples in a cold location. A root cellar is the most common location of choice, but an unheated basement, unheated attic, or enclosed porch can also work just as well. The average temperature of the area should not drop too far below freezing, however, since the freezing process will rupture the cells of your apples, turning them to mush when they thaw."
    },
    {
      "title": "Do no store apples near potatoes.",
      "content": "Do no store apples near potatoes. Potatoes release a gas as they age, and this gas can cause apples to rot faster. You can keep the two types of produce in the same room or storage facility, but do not keep them side by side."
    },
    {
      "title": "Check your apples after a few months.",
      "content": "Check your apples after a few months. Stored this way, apples can retain their freshness for several months, but will start to go bad after that."
    }
  ]
}