{
  "url": "https://www.wikihow.com/Weigh-Curly-Hair-Down",
  "title": "How to Weigh Curly Hair Down",
  "steps": [
    {
      "title": "Keep layers long.",
      "content": "Keep layers long. By keeping layers long, you can add weight to curls and keep them from springing up. Long layers will look flattering whether you wear your hair naturally curly or you straighten it. Stay away from short layers, because they make hair lighter and create a looser hairstyle. [1] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. Keep your shortest layer at least 10 inches (25 cm) long, if you have hair below your shoulders. If you have medium-length hair, keep your shortest layer at least 6 inches (15 cm) long. If you have chin-length hair, keep the shortest layer at least 4 inches (10 cm) long. [2] X Research source"
    },
    {
      "title": "Ask for blended layers.",
      "content": "Ask for blended layers. You will need some type of layering with curly hair. Otherwise, you’re at risk of having a triangle-shaped cut, where all the weight poofs out at the bottom. Make sure your layers do not create any weight lines, like what you would see in a wedge or “stacked” haircut. Ask your stylist for blended layers that do not create any added weight."
    },
    {
      "title": "Wear your hair long.",
      "content": "Wear your hair long. Growing your hair out is one of the easiest ways to add weight to curls, but it can take time to grow. The longer your hair is, the more added weight to hold your curls down. Grow your hair out no matter what type of curl you have to help lay it down."
    },
    {
      "title": "Avoid volumizing products.",
      "content": "Avoid volumizing products. Products that add volume to your hair will free up and loosen your curls, making them lighter and bigger. Stay away from “root-boosting” sprays or anything else marketed as a product that adds volume. Also avoid using gels, as most of them contain alcohol and will dry out your hair. Using volumizing products too often can dry out and damage your hair. [3] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020."
    },
    {
      "title": "Use a moisturizing shampoo and conditioner.",
      "content": "Use a moisturizing shampoo and conditioner. Effective moisturizing shampoos and conditioners should absorb easily into the hair. They also pull moisture deeply in the cuticle to keep it there, adding weight to curls. Select a moisturizing shampoo and conditioner that has a reputation for working all day long for optimum results. Also make sure that your moisturizing shampoo is “sulfate-free\" since sulfates can damage your hair. [4] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. Condition your hair every time you wash and shampoo for best results. Always rinse your conditioner out with cool water to seal the hair's cuticle. This will allow your hair to hold the moisture better. Manipulate your hair the least amount possible when you shampoo. Lightly rub your scalp with your fingertips, then rinse. [5] X Research source"
    },
    {
      "title": "Leave an all-natural, high quality oil in your hair.",
      "content": "Leave an all-natural, high quality oil in your hair. Oils that have been known to work well with hair, like olive oil or jojoba oil, can elongate curls and weigh them down. Use coconut oil, if your hair is especially dry. Tame and moisturize curls, while also controlling frizz, by warming a 1 ⁄ 2 teaspoon (2.5 mL) of your chosen oil in your hands. Apply through the lengths of damp, towel-dried hair starting at the ends. A leave-in conditioner formulated for curly hair can be used in place of oil."
    },
    {
      "title": "Deep-condition your hair every week.",
      "content": "Deep-condition your hair every week. Deep-conditioning your hair will intensely moisturize it to keep curls frizz-free, tamed and defined. Commit to a hair care regimen that makes room for a weekly deep-conditioner. Apply the conditioner and get other things done for about ten minutes. For an extra deep-conditioning treatment, warm a damp towel in the microwave for 30 to 60 seconds and wrap it around your head for 15 minutes. Skip the microwave if you’re able to sit under a hooded hair dryer for the 15 minutes."
    },
    {
      "title": "Blot excess water out of wet hair.",
      "content": "Blot excess water out of wet hair. When you towel dry your wet curly hair, it’s important to absorb water by blotting and not rubbing your curls. Use a cotton or microfiber towel, hold it over your hand, then scrunch and blot water out from the ends up. Don't create frizz and friction by rubbing a towel back and forth on your curls. The more you manipulate your hair, the less weighted down your curls will be."
    },
    {
      "title": "Spritz in a leave-in conditioner spray.",
      "content": "Spritz in a leave-in conditioner spray. Leave-in conditioner is a great way to detangle curly hair, since you want to avoid combing it excessively. Look for one formulated especially for curly hair and detangling. Most leave-in conditioners are fairly light-weight, so spritz it on liberally."
    },
    {
      "title": "Use a pick, wide-tooth comb or your fingers to comb hair.",
      "content": "Use a pick, wide-tooth comb or your fingers to comb hair. While combing your hair with a wide-tooth comb, pick, or your fingers may seem contradictory when you want to hold curls down, brushing them only makes matters worse. Lightly comb your hair with your fingers if you don’t have any tangles. Use a pick to remove knots and a wide-tooth comb to remove tangles. [6] X Research source Finger combing is the most gentle way to comb through curls to keep them weighed down."
    },
    {
      "title": "Let your hair air dry or use a diffuser.",
      "content": "Let your hair air dry or use a diffuser. When you have curly hair, blow-dryers are not always your friend. After you towel dry and comb your hair, continue to let your hair air dry. If you must get your hair dry, use a diffuser on low heat. Remember, the less you style your hair, the more weighed down it can lay."
    }
  ]
}