{
  "url": "https://www.wikihow.com/Steam-Milk",
  "title": "7 Different Ways to Steam Milk for Lattes, Cappuccinos & More",
  "steps": [
    {
      "title": "Shake milk in a jar and microwave it to easily make frothed milk.",
      "content": "Shake milk in a jar and microwave it to easily make frothed milk. Pour the amount of milk you want to use into a jar, taking care not to fill the jar more than halfway. Screw the lid onto the jar and shake it as hard as you can for 30 to 60 seconds or until the milk has doubled in volume. Remove the lid and microwave the jar for 30 seconds to make the foam rise to the top of the milk. [1] X Research source Be sure to microwave the milk to a temperature of 150 °F (66 °C) before using it. If you fill the jar more than halfway full before shaking it, there won’t be enough empty space for the foam to expand after you shake it. Make sure you use the foam right away after you microwave the milk, since it will start to dissolve almost immediately. Pour the milk into your coffee at a steady pace along the side of the cup."
    },
    {
      "title": "Use a hand mixer if you don’t have a milk frother.",
      "content": "Use a hand mixer if you don’t have a milk frother. Pour your heated milk into a tall bowl. Insert the beaters into the milk and whisk it at medium-low speed. Mix the milk until it becomes frothy, which should take about 1 minute. [2] X Research source Heat up your milk in a saucepan or in the microwave and use a thermometer to make sure it’s 150 °F (66 °C) before you start whisking it. Slowly move the beaters up and down in the milk as you whisk it to make sure it’s evenly mixed. However, don’t bring the beaters all the way to the surface of the milk to avoid splashing it out of the bowl. When you use the milk, pour it into your coffee at a steady pace along the side of the cup instead of the center. This will produce the most aesthetically pleasing foam for your drink."
    },
    {
      "title": "Whisk your milk by hand if you don’t have an electric hand mixer.",
      "content": "Whisk your milk by hand if you don’t have an electric hand mixer. Use a microwave or saucepan to heat your milk to the right temperature. Then, insert your whisk into the milk and mix it vigorously using a back-and-forth motion. Whisk the milk until it reaches your desired frothiness, or about 30 seconds. [3] X Research source Insert a thermometer into the milk to make sure it’s 150 °F (66 °C) before you start whisking it. Although frothing milk this way makes foam that is slightly lower in quality than milk frothed with a hand mixer, it’s arguably one of the easiest ways to froth milk without a milk frother or steam wand. Pour the milk along the side of the coffee cup when you go to use it, making sure to pour the milk at a steady pace to produce the best effect."
    },
    {
      "title": "Blend heated milk in a blender to get small and uniform foam bubbles.",
      "content": "Blend heated milk in a blender to get small and uniform foam bubbles. Use a thermometer to make sure your milk has been heated to 150 °F (66 °C). Then, pour it into a blender, making sure not to fill the blender more than halfway so that the milk has room to expand. Blend the milk on medium speed until it’s frothy. You’ll probably only need to blend it for about 1 minute for the milk to become frothy enough to use. [4] X Research source Use a microwave or a saucepan to heat up your milk before blending it. If having nice-looking foam with small and evenly distributed bubbles is most important to you, then you’ll probably be best served by frothing your milk with a blender. Make sure you pour the milk along the side of the cup instead of in the center of it to make the foam look as aesthetically pleasing as possible. Make sure the lid is securely on the blender before you hit the “blend” button."
    },
    {
      "title": "Pump heated milk in a French press if you want to make latte art with it.",
      "content": "Pump heated milk in a French press if you want to make latte art with it. Heat your milk in the microwave or in a saucepan to 150 °F (66 °C). Then, pour it into your French press and vigorously pump up and down for about 10 seconds. Allow the milk to sit for 1 minute, then pour. [5] X Research source Milk that is frothed in a French press reaches a smooth texture that is very good for creating latte art. Furthermore, the spout on a French press is relatively narrow, which makes pouring your latte art even easier! Be sure you leave enough space in the French press for the milk foam to expand as you pump it. Avoid filling the press more than halfway full with milk. Use a steady and even pace when pouring the milk into your latte. Pour it along the side of the cup instead of in the center of it to make the best-looking art."
    },
    {
      "title": "Froth heated milk with a milk frother for high-quality foam.",
      "content": "Froth heated milk with a milk frother for high-quality foam. If you don’t have a steam wand, using a milk frother is the next best way to make quality milk foam. Heat your milk to the right temperature in a microwave-safe container or in a saucepan, then insert the frother into the milk and turn it on. Froth the milk until it reaches your desired consistency. [6] X Research source Use a thermometer to check and make sure that your milk has been heated to 150 °F (66 °C) before you start frothing it. If you’re not sure how long you should microwave your milk to reach this temperature, heat it up for 30 seconds and then check the temperature. If it isn’t hot enough, heat it for another 30 seconds. Repeat this process until it reaches 150 °F (66 °C). If you’re not sure how long you should froth the milk, a frother usually takes about 15-30 seconds to make quality foam. For the best results, move the frother up and down in the milk as you’re frothing it. However, avoid bringing the frother all the way to the surface of the milk; this will cause it to go flying out of the container! You can purchase a battery-powered milk frother online or at most supermarkets. Once the milk is frothed, pour it into your coffee along the side of the cup rather than in the center of it. Pour the milk at a steady and even pace."
    },
    {
      "title": "Open the valve of your steam wand to purge any condensation in it.",
      "content": "Open the valve of your steam wand to purge any condensation in it. Make sure your steam wand is pointed over your machine’s drip tray or into a damp cloth before opening the steam valve. This will get rid of any condensed water that may be in your steam wand before you use it to aerate your milk. [7] X Research source Purging your steam wand not only ensures that you don’t accidentally spray water into your milk as you steam it; it also keeps your steam wand clean in the long run and prevents the build-up of blockage in the holes on the end of the wand."
    },
    {
      "title": "Pour the milk into your pitcher so that it’s halfway full.",
      "content": "Pour the milk into your pitcher so that it’s halfway full. Although this seems obvious, how much milk you pour into the pitcher is actually very important; having too much or too little milk will affect how good your steamed milk ultimately is. If your pitcher has a spout, fill it with enough milk so that the surface of the milk is just below the lower part of the spout. [8] X Research source If you use too little milk, it will make it much more likely for you to steam your milk too much and ruin the texture of your foam. Conversely, using too much milk will make it more likely for you to not steam it long enough to get the right consistency. Pouring just the right amount of milk into your pitcher also helps you to avoid wasting any milk during the steaming process."
    },
    {
      "title": "Place the tip of the steam wand just below the surface of the milk.",
      "content": "Place the tip of the steam wand just below the surface of the milk. Lift the pitcher of milk up towards the wand to submerge the tip. Insert the steam wand so that only the holes on the tip of the steam wand are below the surface of the milk. [9] X Research source You should only need to submerge the tip about 1 to 2 centimetres (0.39 to 0.79 in) to place these holes entirely under the milk. The process for placing the tip of the steam wand in the milk is the same whether you’re using an espresso machine or a separate steam wand by itself."
    },
    {
      "title": "Open the steam valve to aerate your milk and create foam.",
      "content": "Open the steam valve to aerate your milk and create foam. Turn the steam wand on full blast by opening the steam valve to “full.” The steam wand will aerate or whip air into the milk and thereby create microfoam. Allow this process to go on for about 5 seconds to create an adequate amount of foam. [10] X Research source The amount of foam created after 5 seconds of aeration is enough for most coffee drinks. If you’re making a drink that uses a lot of foam, such as a cappuccino, aerate your milk for closer to 8-10 seconds to make an adequate amount of foam. The volume of the milk in the pitcher will grow as you create microfoam on it. As this happens, make sure you lower the pitcher away from the steam wand as needed so that the tip of the wand is always just below the surface instead of deeply submerged. Your steam wand will make a hissing or crackling sound at first. Don’t be alarmed; this is exactly what it’s supposed to sound like!"
    },
    {
      "title": "Tilt the pitcher and submerge the wand tip to spin and heat the milk.",
      "content": "Tilt the pitcher and submerge the wand tip to spin and heat the milk. The pitcher should be tilted at a slight angle so that the tip of the steam wand is positioned along the side of the pitcher. This is necessary to create a whirlpool effect, which will cause the milk to spin and will ensure the milk is evenly heated. [11] X Research source Don’t submerge your steam wand all the way to the bottom of the pitcher. You only need to submerge about 0.5 to 1 inch (1.3 to 2.5 cm) of the wand into the milk. Make sure the wand doesn’t touch the metal of the pitcher during this process, as this will cause it to heat the pitcher instead of just the milk."
    },
    {
      "title": "Continue heating the milk until it reaches 135 to 150 °F (57 to 66 °C).",
      "content": "Continue heating the milk until it reaches 135 to 150 °F (57 to 66 °C). Use a thermometer to gauge the specific temperature of the milk. Alternatively, you can also simply place your hand on the side of the pitcher and heat the milk until the pitcher is slightly too hot to touch. [12] X Research source Most people agree that this is the temperature range in which steamed milk tastes the best. Make sure you don’t heat the temperature beyond 160 °F (71 °C); overheating your milk in this way may ruin the texture of the steamed milk."
    },
    {
      "title": "Remove and clean the steam wand and purge any remaining milk from it.",
      "content": "Remove and clean the steam wand and purge any remaining milk from it. Take the steam wand out of the milk once it reaches the desired temperature and clean the wand with a wet cloth. Make sure to purge the steam wand after you use it so that you don’t leave any milk gunk inside it. [13] X Research source Don’t put off cleaning the wand until later. Cleaning it as soon as you’re finished using it is the best way to prevent blockage build-up in the long run."
    },
    {
      "title": "Tap the pitcher on the counter to get rid of large bubbles in the milk.",
      "content": "Tap the pitcher on the counter to get rid of large bubbles in the milk. Give the pitcher a hard enough tap so that the bubbles on top of the milk are popped, but don’t hit it so hard that milk comes flying out of it. If there are any bubbles still in the milk after you’ve let it sit for a few seconds, tap the pitcher again to get rid of them. [14] X Research source If tapping the pitcher twice doesn’t get rid of all the bubbles in the milk, use a fork or a toothpick to manually pop them. Getting rid of the bubbles in your steamed milk will give it a much smoother texture that both looks and feels better when you drink it."
    },
    {
      "title": "Swirl the pitcher to evenly mix the milk and foam, then pour.",
      "content": "Swirl the pitcher to evenly mix the milk and foam, then pour. Swirling the pitcher will ensure that all the foam you’ve just created is incorporated into the milk instead of only resting on top of it. Once the foam is mixed into the milk and it has a smooth and glossy appearance, pour it into the coffee and serve. [15] X Research source Ideally, your steamed milk should look a lot like fresh paint after you’ve swirled it. Don’t swirl the milk too aggressively! This will only create new bubbles that you’ll have to deal with. Pour the milk at a steady pace along the side of the cup instead of directly into the center of your coffee. This will give your coffee a more artistic and impressive appearance!"
    }
  ]
}