{
  "url": "https://www.wikihow.com/Stupid-Questions-to-Ask",
  "title": "Funny & Silly Questions to Spark an Interesting Conversation",
  "steps": [
    {
      "title": "Save the stupidest questions for the people who understand you best.",
      "content": "Save the stupidest questions for the people who understand you best. Best friends are the people who, when you say something truly silly, don’t look at you like you’re totally crazy. They’re the ones who’ll join in the fun and respond by asking you an equally (if not more) wacky question! Which color do you think has the worst personality? If you had to name your kitchen appliances, what would you call them? What’s the absolute worst smell? Is a hotdog a sandwich? [1] X Research source What’s the funniest Wi-Fi name you’ve seen? If you got to choose your name, what would it be and why? If you had a pet parrot, what would you teach it to say? What TV show would you want to be in? Which one would you not want to be in? What’s the strangest profession you’ve ever wanted to go into? If you were to write a memoir, what would its title be? What’s the most embarrassing way you’ve been injured? Which season of the year would you be and why? Do you believe in aliens? What is the most disgusting sandwich ingredient in your opinion? If you could design your own sports uniform, what would it look like? How late is too late to cancel plans with somebody? Would you rather have a book made of chocolate or toilet paper made of cotton candy? What would rainbows sound like if they could talk? What’s something you’ll never do ever again? What do you think ghosts sound like? What’s the strangest gift you’ve ever been given? What world record would you like to break? Who is the most annoying Disney princess? Which meme most accurately represents your life? What is the weirdest food combination that you love? What’s the most embarrassing fashion trend that you still follow? Why do round pizzas come in square boxes? What’s the longest you’ve slept at one time?"
    },
    {
      "title": "Make your guy friends crack up with these silly get-to-know-you questions.",
      "content": "Make your guy friends crack up with these silly get-to-know-you questions. Whether you’re hanging with your close buds or new acquaintances, these funny icebreakers are sure to make a dude laugh—as well as help you learn more about each other! [2] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Break out these questions at your next hangout: What item do you hope will be obsolete in 20 years? If you were famous, what would your stage name be? What fictional character do you relate to the most and why? If you could name a new state, what would it be? Which role would you play in a reality TV show? Which fruit would you be and why? What’s something everyone looks ridiculous doing? Who do you think will be playing on \"oldies radio\" in 30 years? If you could attend any celebrity wedding which would it be? What was your kindergarten teacher like? If you could meet any author, who would it be and why? If you could be any kind of animal, which would you be? Do you spell it \"OK\" or \"okay\"? Which is the best Ben & Jerry's ice cream flavor? Have you ever seen a ghost? If you wore one, what did your prom dress look like? What was your first email address? What is one trendy food combination you just can’t get behind? (Like dipping fries in Frosties.)"
    },
    {
      "title": "Get your gal pals to giggle with these ridiculous icebreakers!",
      "content": "Get your gal pals to giggle with these ridiculous icebreakers! Make everyone crack up at your next party with these wacky get-to-know-you questions. They're a great way to put everybody in a good mood, while also helping everyone get to know each other better: What color pen do you prefer writing in? If Hogwarts existed and your child received a letter, would you let them go? Where do you stand in the pineapple-on-pizza debate? What’s one show, movie, or book, you’re embarrassed to admit you enjoy? Which emojis do you use the most? What’s the worst time period that you could possibly travel back to? What television or movie character do you feel a close connection with? What’s the weirdest app you have on your phone? Are you more of a romantic comedy or action-packed blockbuster type of person? What childhood cartoon do you still like to watch? What's the one item you can't live without? Do you have an embarrassing hidden talent? What is your favorite line from any movie, and can you say it in Pig Latin? What is your most favorite room in your house and why? Which fictional character would you most want to battle (and would you win)? If you could make the ultimate sandwich, what would be on it? Who would win an epic battle between Superman and Batman? Is cereal a soup? Do you have a favorite dinosaur? What’s the stupidest thing you ever did? What’s the funniest thing you’ve read recently?"
    },
    {
      "title": "Make your partner fall even more in love with these absurd questions.",
      "content": "Make your partner fall even more in love with these absurd questions. Everyone loves someone with a sense of humor! What better way to show off how funny you can be (while getting to know your partner better ) than with these ridiculous icebreakers? What’s your favorite thing about me that no one else would find endearing? What’s the weirdest date we’ve ever been on? What's the most embarrassing song on your phone right now? If you could only subscribe to one YouTube channel for the rest of your life, which would you choose? [3] X Research source What do you think I’m thinking right now? What’s a time I looked absolutely ridiculous? What's the most random fact you know? What is one thing you'll never do again? Can you fold a fitted sheet by yourself? Is soup something you eat or drink? Does round or square pizza taste better? Would you rather have a unicorn horn or a pig’s tail? If you could live in a video game, what video game would it be? What actor would play you in a movie about your life? Do you like sweet or savory food better? [4] X Research source Would you rather have hands for feet or feet for hands? What’s the most embarrassing thing someone has walked in on you doing? What’s the most niche insult you can come up on the spot? What is something that is popular now, but we'll all probably be embarrassed by years from now? What’s the silliest tattoo you would ever get? Who is your most embarrassing celebrity crush?"
    },
    {
      "title": "Inject some silliness into the classic party game.",
      "content": "Inject some silliness into the classic party game. Would You Rather is a great icebreaker game for everyone to enjoy. But it's even more fun when you make the questions as ridiculous as possible! Try these extra-wacky Would You Rather questions : Would you rather always have bad gas or always have bad breath? Would you rather always have a mullet haircut or wear a ponytail? Would you rather be able to shoot rainbows or fire from your eyes? Would you rather have a shark’s head and human body or a human head and a shark’s body? Would you rather have three eyes or three ears? Would you rather be forced to listen to the same 5 songs over and over again for the rest of your life or forced to watch the same 5 movies over and over again for the rest of your life? Would you rather have a horse’s head and a human body, or a horse’s body and human head? [5] X Research source Would you rather have sticky hands or sticky feet? Would you rather have hair for teeth or teeth for hair? Would you rather have a pet hummingbird that can sing beautiful songs or a pet parrot that can tell hilarious jokes? Would you rather be a high school teacher or a clown? Would you rather go without shampoo or toothpaste for the rest of your life? Would you rather be fluent in every language or be able to talk with animals? Would you rather be able to breathe underwater or survive in space? Would you rather eat chocolate-flavored broccoli or broccoli-flavored chocolate? Would you rather meet a famous person or meet aliens? Would you rather smell like feet or smell like eggs? Would you rather be able to run on your hands or write with your feet? Would you rather have really hairy hands or really hairy feet?"
    },
    {
      "title": "Make everyone think (and laugh) with these stupid-clever questions.",
      "content": "Make everyone think (and laugh) with these stupid-clever questions. Not every question demands a response, but these rhetorical shower thoughts are sure to deliver the giggles. They’re stupid, sure—but in a clever way that invites everyone to look at everyday situations from a different angle: If it’s tourist season, how come we can’t shoot them? Why do British people never sound British when they’re singing? How did the headless horseman know where he was going? Why do they call it “head over heels in love” if our head is always over our heels? Can a hearse driver use the carpool lane if there’s a corpse in the back? Why do they call it an escalator if it takes you down? Why is it called football when you hardly use your feet? Can someone named Nick have a nickname? If you own a piece of land do you own it all the way down to the core of the earth? Cartoon characters see little birdies when they get hit in the head, but what do little birdies see when they get hit in the head? What is a male ladybug called? Why are they called stairs inside but steps outside? If Dracula has no reflection, how does he get such a straight part in his hair? If an ambulance runs someone over on its way to save someone, does it stop to help them? Why do they call it Grape Nuts when it contains neither grapes nor nuts? If Jimmy cracks corn and no one cares, why is there a song about him? Why are there A, B, C, D, and F grades but no E? What do you call a female daddy long legs? If it's zero degrees out today and it's going to be twice as cold tomorrow, how cold is it going to be? Why is there a light in the fridge and not in the freezer? Why is the word for the fear of long words Hippopotomonstrosesquippedaliophobia ? How do they get those ships in those tiny glass bottles? Why is it called a TV set when there is only one? Why are semi-trucks bigger than regular trucks? Why do we say an alarm clock is “going off” when it’s actually turning on? How fast do hotcakes sell? Why are softballs hard? If croutons are stale bread, why do they come in airtight packages? Is French kissing in France just called kissing? If feathers tickle people, do they tickle birds?"
    }
  ]
}