{
  "url": "https://www.wikihow.com/Weave-a-Rag-Rug",
  "title": "How to Weave a Rag Rug",
  "steps": [
    {
      "title": "Cut strips of fabric 1–3 inches (2.5–7.6 cm) wide and remove seams.",
      "content": "Cut strips of fabric 1–3 inches (2.5–7.6 cm) wide and remove seams. The length only matters for how often you want to be taking the time to join new strips."
    },
    {
      "title": "Tie two strips in a simple loose knot.",
      "content": "Tie two strips in a simple loose knot . You'll be trying to shove fabric through this later, so if you make it too tight, you might get aggravated. Also, notice that the pieces in the picture are uneven. At the end of every strand, you'll have to join a new one, and it looks better if that's staggered. If you want stripes in your rug, arrange your strips so that they alternate A,B,A,B when you lay them flat. Then take the one on the right side and go under, over, under."
    },
    {
      "title": "Continue taking each right-hand strand and going under, over, under.",
      "content": "Continue taking each right-hand strand and going under, over, under. Notice that it's not a tight braid. It's just snug enough to lay flat and hold its shape."
    },
    {
      "title": "Go under, over, under with that strip on the right when you get a braid about half the length of the rug you want.",
      "content": "Go under, over, under with that strip on the right when you get a braid about half the length of the rug you want. Then, turn the entire braid to the right so you can tuck the strip in the edge of the original braid. Depending on your material, your rug may not want to lie flat if you turn it too quickly, so you may not get to tuck every strand into the original braid. Sometimes you might have to skip tucking a couple so you can turn the corner smoothly."
    },
    {
      "title": "Work your way back down to the starting knot.",
      "content": "Work your way back down to the starting knot. Make sure to follow the exact same pattern as you used to make the original braid, just tucking the end through each time. (If you want the stripes, tuck it in its own color as you come around and down.)"
    },
    {
      "title": "Work your way around the curve when you’ve gotten back to the starting knot.",
      "content": "Work your way around the curve when you’ve gotten back to the starting knot. Feel free to skip and tuck as much as it is necessary to lay flat. When you’re done, it's time to add a strip. To maintain the stripes, join one of each color together and stick it through the starting knot in a way that keeps the pattern. Then continue braiding the same way you have been all along, but now it's under, over, under, over, under-->TUCK!"
    },
    {
      "title": "Braid all of the way down to the end and back up the other side to the original knot.",
      "content": "Braid all of the way down to the end and back up the other side to the original knot. Add another strip where ever you can sneak it in to make eight strips."
    },
    {
      "title": "Pick up that right-hand one.",
      "content": "Pick up that right-hand one. Then, go under, over, under, over, under, over, under, over, under-->TUCK!"
    },
    {
      "title": "Work yourself back to the beginning knot.",
      "content": "Work yourself back to the beginning knot. Then, add another set of strips until you get the size rug you're looking for."
    },
    {
      "title": "Work yourself back down to 8 strips, then 6, 4, 2, and finally none once you’re satisfied with the width of the middle.",
      "content": "Work yourself back down to 8 strips, then 6, 4, 2, and finally none once you’re satisfied with the width of the middle. in a way that doesn't throw off your overall shape. As shown in the picture, go under, over, under, over, under-->TUCK-->TUCK AGAIN under two more threads horizontally. Then, snip off the excess. Continue until you run out of strands."
    },
    {
      "title": "Cut a hole in the ends of both strips you want to join.",
      "content": "Cut a hole in the ends of both strips you want to join."
    },
    {
      "title": "Shove the new one through the old one.",
      "content": "Shove the new one through the old one."
    },
    {
      "title": "Push the tail end of the new strip through its own hole and tug until snug.",
      "content": "Push the tail end of the new strip through its own hole and tug until snug."
    }
  ]
}