{
  "url": "https://www.wikihow.com/Use-Oxiclean",
  "title": "14 Ways to Use OxiClean Around the House",
  "steps": [
    {
      "title": "Add 1 full scoop of OxiClean powder to keep your clothes looking bright.",
      "content": "Add 1 full scoop of OxiClean powder to keep your clothes looking bright. Just add the powder to your top-loading machine along with your regular laundry detergent before you add the clothes. If you have a front-loading machine, mix the OxiClean with your regular powdered laundry detergent and load it into the dispenser. [1] X Research source Oxiclean works best with warm or hot water. If you want to run a cold-water load, dissolve the Oxiclean in 2 cups (470 ml) of hot water and pour it into the machine as it fills with cold water. If you don't use powdered laundry detergent and you've got a front-loading machine with an external dispenser, mix the OxiClean powder with 2 cups (470 ml) of hot water and pour it into the compartment before you start the load."
    },
    {
      "title": "OxiClean lifts stains from coffee, grease, blood, makeup, and more!",
      "content": "OxiClean lifts stains from coffee, grease, blood, makeup, and more! The next time you notice a stain on your shirt, don't panic—just mix half of a scoop of OxiClean in 1 gallon (3.8 L) of water and soak the item for up to 6 hours. Then, wash it like normal and the stain should be gone. [2] X Research source If you'd rather spot treat the stain, make a small amount of OxiClean solution and sponge it onto the spot. Then, sponge it off after 5 minutes. You can treat stained clothes in a large bowl, sink, or bathtub."
    },
    {
      "title": "Blot stains and lift them with OxiClean before they have a chance to set.",
      "content": "Blot stains and lift them with OxiClean before they have a chance to set. If you've spilled a drink on the couch or someone spilled coffee on the carpet, press an old cloth on it. Fill the OxiClean scoop up to the first line and mix it into 2 c (470 ml) of warm or hot water. Dab or spray the solution onto the stain and let it sit up to 5 minutes, but don't let it dry. Then, blot the stain with a damp cloth to remove the solution. If the stain has already set or it's really deep, you might have to repeat this process. If you're treating a delicate rug or carpet, do a spot test first. Gently rub some of the OxiClean solution into an inconspicuous spot. Blot it with a damp cloth and inspect the area to see if it damaged the rug.If not, you're good to go! If you're looking for a convenient option, get Oxiclean Carpet and Rug Stain Removing Spray . This way you don't have to mix up a solution—just spray and clean!"
    },
    {
      "title": "Cut through soap scum so your bathroom sparkles.",
      "content": "Cut through soap scum so your bathroom sparkles. Spray down the inside of your bathtub or shower area. Then, sprinkle a few spoonfuls of OxiClean powder onto a damp sponge and scrub the entire surface of the tub or shower. Finally, rinse the surfaces with hot water. [3] X Research source Be careful if you're standing barefoot in the tub or shower while you clean since the bottom will be slippery."
    },
    {
      "title": "Tackle stubborn grime or stains between your tiles with OxiClean paste.",
      "content": "Tackle stubborn grime or stains between your tiles with OxiClean paste. Give your tile floor or backsplash an instant facelift! Use the scoop that came with your OxiClean and fill it half full. Pour this into a bowl and mix a few spoonfuls of water to make a paste. Then, dip a toothbrush or scrubbing sponge into the paste and work it onto the grout. Let it sit for 5 to 30 minutes and rinse it off. [4] X Research source The longer you leave the paste on the grout, the deeper it will penetrate and the more it will lift stains."
    },
    {
      "title": "Remove the greasy buildup above your stove so your filter sparkles!",
      "content": "Remove the greasy buildup above your stove so your filter sparkles! If you're tired of looking at a grimy range hood while you're cooking, it's time to clean the filter . Fill a bucket with boiling hot water and dissolve 1 OxiClean scoop of powder in it. Then, pop off your filter and submerge it. Let it soak for up to 30 minutes before you take it out and rinse it off. [5] X Research source You don't need to scrub the filter after it's soaked unless there's really tough grease buildup. In general, clean your filter twice a year. If you fry food frequently, plan on cleaning your hood range filter more often."
    },
    {
      "title": "Give your hardworking machine some TLC to prevent mildew.",
      "content": "Give your hardworking machine some TLC to prevent mildew. It's especially important to clean front-loading machines since water can get trapped between the rubber seal. Fortunately, all you do is pour 1 OxiClean Washing Machine Cleaner pouch into the empty machine and run a cleaning or regular cycle. Then, wipe off any residue and leave the door open so the machine dries. [6] X Research source The cleaning pouches are designed to remove musty smells from your machine, so run a cleaning cycle every month or whenever you notice funky odors."
    },
    {
      "title": "Use OxiClean to get your dishwasher in great shape.",
      "content": "Use OxiClean to get your dishwasher in great shape. If you've noticed residue on dishes or it seems like the machine's not cleaning enough, it's time to clean the dishwasher. Fill a bucket with 1 US gal (3.8 L) of hot water and fill an OxiClean scoop up to line 4. Pour the powder into the water and mix until it's dissolved. Then, dip a sponge or brush into it and scrub the inside of your dishwasher. Let it sit for 30 minutes and then run a cycle. [7] X Research source Plan on cleaning your dishwasher at least once a month or more often if you run it several times a day."
    },
    {
      "title": "Scrub the empty bins, so they smell clean and fresh.",
      "content": "Scrub the empty bins, so they smell clean and fresh. Take your bins outside to make cleanup easier and mix together an OxiClean solution—dissolve a full scoop of Oxiclean in 1 US gal (3.8 L) of warm water. Then, dip a sponge or scrub brush into it and scrub the inside of your garbage can or compost bin. Rinse out the bin with cool water and dry it. [8] X Research source You can even pour the solution directly into the bin and swish it around if you want to be really thorough! While it's fine to pour the solution into a metal trash can that has a removable plastic bin, don't let the solution get onto the metal itself since it could corrode it."
    },
    {
      "title": "Wash deep dirt, sweat, and grass stains out of your uniform.",
      "content": "Wash deep dirt, sweat, and grass stains out of your uniform. Dissolve a full scoop of OxiClean in 1 US gal (3.8 L) of water and submerge your stained sports gear. Soak it for 1 to 6 hours. Then, take the uniform out and stick it in the washing machine. Run a regular cycle and don't forget to add 1 scoop of OxiClean! [9] X Research source If you're trying to get sweat stains out of baseball caps or remove stains from sneakers, mix a paste solution and use a toothbrush to scrub it onto the stain. Let it sit for about 5 minutes before you rinse it off."
    },
    {
      "title": "Sanitize plastic toys or remove stains from stuffed toys.",
      "content": "Sanitize plastic toys or remove stains from stuffed toys. Fill your OxiClean scoop up to line 1 and pour it into a bowl. Stir in 2 c (470 ml) of warm water and dip a cloth or sponge into it. Dab the solution onto the stain. If you're cleaning plastic toys, just put them into the bowl to soak for 30 minutes. Then, rinse off the toys or blot the stuffed animal with a damp cloth. [10] X Research source Kid strollers also get notoriously dirty, but they're actually really easy to clean. Use the OxiClean solution you made for stuffed animals and dab it onto stroller stains. Then, blot the area with a damp cloth."
    },
    {
      "title": "Freshen up bedding and toys to remove pet odors and stains.",
      "content": "Freshen up bedding and toys to remove pet odors and stains. Fill a sink or bucket with hot water and stir in a full OxyClean scoop for every 1 US gal (3.8 L) of water. Submerge the pet item and soak it for 1 to 6 hours. Then, put soft items like bedding into the laundry machine and run a regular load. For plastic or rubber toys, remove them from the solution and rinse them. [11] X Research source For the best results, use OxiClean Odor Blasters Versatile Stain and Odor Remover . To clean hard surfaces like a pet carrier, dip a sponge in the OxiClean solution and scrub the item. Then, wipe it off with a damp sponge."
    },
    {
      "title": "Get your outdoor chairs and table looking like new.",
      "content": "Get your outdoor chairs and table looking like new. If you leave your patio table or deck chairs out all year long, they can start to look worn down. To make a powerful cleaning solution, fill an OxiClean scoop up to line 4 and mix it into 1 US gal (3.8 L) of warm water. Then, dip a sponge into the solution and scrub the patio furniture thoroughly before you rinse it off. [12] X Research source If there are visible stains on your patio cushions or the umbrella for your patio table, make an Oxiclean paste and work it into the stain before you rinse it off."
    },
    {
      "title": "Restore your driveway or get your deck ready for summer!",
      "content": "Restore your driveway or get your deck ready for summer! If your deck is starting to look a little dingy, clean it with OxiClean solution. Clear furniture from the deck and use a hose to spray it off. Pour 2 US gal (7.6 L) of warm water into a big bucket and mix in 2 cups (240 g) of OxiClean along with 1 ⁄ 4 c (59 ml) of liquid dish soap. Dip a scrub brush in the solution and scrub the deck before you rinse it off. [13] X Research source If you're trying to lift oil stains from concrete, let the solution sit for up to 30 minutes before you rinse it off."
    }
  ]
}