{
  "url": "https://www.wikihow.com/Untap-Your-Phone",
  "title": "Get Rid of Hackers on Your Phone & Protect Yourself Online",
  "steps": [
    {
      "title": "Check Phone settings or Settings for call forwarding.",
      "content": "Check Phone settings or Settings for call forwarding. You can also check your phone for call forwarding in either the Settings menu or in Phone's settings menu. iPhone : Open Settings > Apps > Phone > Call Forwarding (or Settings > Phone > Call Forwarding in iOS 17 and earlier). Android : Open Phone > Settings > Supplementary Services > Call Forwarding or Phone > Settings > Calls > Call Forwarding ."
    },
    {
      "title": "Check if call forwarding is enabled.",
      "content": "Check if call forwarding is enabled. This code will work for both Android and iPhones and will let you know if call forwarding is on. Open the Phone app to the keypad dialer. Enter *#21# and press the \"Dial\" button (it's the green call receiver icon to place the call). Read the MMI code. If you see \"Not forwarded\" through all the sections, call forwarding is not enabled through your carrier. If you see \"Setting Interrogation Failed\" through the menu, you need to contact your carrier to see if you have call forwarding enabled and set up."
    },
    {
      "title": "Turn off call forwarding from your phone.",
      "content": "Turn off call forwarding from your phone. This code works on both Android and iPhones but the numbers differ depending on the carrier you're using: Open the Phone app to the keypad dialer. Enter *73 (CDMA) or ##002# (GSM) and press the \"Dial\" button. CDMA networks include carriers like Verizon and US Cellular. GSM networks include carriers like AT&T and T-Mobile."
    },
    {
      "title": "Delete any suspicious apps through Settings.",
      "content": "Delete any suspicious apps through Settings. Open Settings > General > iPhone Storage and look for any apps that you don't remember downloading or if you think they contain malware. If you find an app that you want to delete, tap on it, then tap Delete App ."
    },
    {
      "title": "Check configuration profiles.",
      "content": "Check configuration profiles. Profiles like this configure how the iPhone looks and behaves; there are many legitimate uses for multiple profiles, like if you use an iPhone from your work or a volunteer organization. To check these profiles, go to Settings > General > VPN & Device Management . If you see a configuration that you don't recognize, tap it and tap Remove Profile . [1] X Research source"
    },
    {
      "title": "Update your iOS.",
      "content": "Update your iOS. An outdated iOS is at a higher risk of being hacked, getting malware, and other general security flaws. To update your iPhone, go to Settings > General > Software Update > Install Now . If you don't see \"Install Now,\" your iPhone is updated."
    },
    {
      "title": "Enable rapid security updates.",
      "content": "Enable rapid security updates. You want to keep your phone and personal data updated with the latest security updates, even if they are pushed after an iOS update. To enable this feature, go to Settings > General > Software Update > Automatic Updates > Security Responses & System Files ."
    },
    {
      "title": "Factory reset your iPhone.",
      "content": "Factory reset your iPhone. This completely reverts your phone to how it was when you first got it. This process will delete everything on your phone, so make a backup if you don't have one already. To reset, go to Settings > General > Transfer or Reset iPhone > Erase all Content and Settings . [2] X Research source"
    },
    {
      "title": "Delete any suspicious apps in Settings.",
      "content": "Delete any suspicious apps in Settings. Go to Settings > Apps to see a list of all the apps installed on your Android. Some apps, like Google Apps Device Policy, are MDM apps (mobile device management apps) and can be used for legitimate reasons, like a business phone. However, if you don't recognize the app's name and the organization you got the phone from also doesn't recognize it, it might be malicious. Tap the app and tap Delete App ."
    },
    {
      "title": "Look for and delete any unrecognized accounts.",
      "content": "Look for and delete any unrecognized accounts. An account can be used to control how your Android behaves, so you don't want an unrecognized account to be able to access your phone and your personal data. Go to Settings > Accounts and backup > Manage accounts . If you see an account that you don't recognize, like a Facebook account with a weird combination of numbers, tap that account, then tap Remove account . [3] X Research source"
    },
    {
      "title": "Update your Android.",
      "content": "Update your Android. Outdated software can have security flaws, glitches, and bugs. To update, go to Settings > Software update > Download and install ."
    },
    {
      "title": "Turn off the \"Install Unknown apps\" feature.",
      "content": "Turn off the \"Install Unknown apps\" feature. It's completely plausible that you installed an app and then it proceeded to download malware or spyware without your consent . To turn this setting off, go to Settings > Apps > ⋮ > Special access > Install unknown apps and tap Deny all to disable this feature."
    },
    {
      "title": "Check device admin apps.",
      "content": "Check device admin apps. These apps are generally used by employers and businesses to protect work-related data by enforcing password requirements and other security policies on your phone. To see the device admin apps on your phone, go to Settings > Apps > ⋮ > Special access > Device admin apps . If you see any apps toggled on that you don't recognize, toggle it off."
    },
    {
      "title": "Factory reset your Android.",
      "content": "Factory reset your Android. This completely reverts your phone to how it was when you first got it. This process will delete everything on your Android, so make a backup if you don't have one already. To reset to factory settings, go to Settings > General management > Reset > Factory data reset > Reset . [4] X Research source"
    },
    {
      "title": "Only download apps from the Google Play Store or App Store.",
      "content": "Only download apps from the Google Play Store or App Store. Apps through these stores are vetted to make sure that there's no malicious code within them if they are updated. However, apps that haven't been updated in a long time carry the chance of being compromised by hackers. Protect your data and phone by reading app reviews and understanding how the app works."
    },
    {
      "title": "Use secure and unique passwords for your accounts.",
      "content": "Use secure and unique passwords for your accounts. Using the same password between accounts is dangerous, so create secure and unique passwords for each login."
    },
    {
      "title": "Keep your phone and apps updated.",
      "content": "Keep your phone and apps updated. Updates keep security vulnerabilities to a minimum. Outdated apps or operating systems are more likely to get infected."
    },
    {
      "title": "Enable Google Play Protect on Android.",
      "content": "Enable Google Play Protect on Android. This provides you more security with the apps you get from the Play Store. Play Protect scans apps in the Store that you downloaded or plan on downloading to see if they are safe and free of malicious code. While this is on by default, you can turn it off. Here's how to turn it back on. Open the Google Play Store app, tap your profile icon, tap Play Protect , then tap the gear icon in the top right corner. Finally, tap the toggle next to \"Scan apps with Play Protect\" to enable it (colored and pointing right). [5] X Research source"
    },
    {
      "title": "Enable two-factor authentication on your Apple account.",
      "content": "Enable two-factor authentication on your Apple account. 2fA makes it harder for hackers to gain access to your Apple ID. On your iPhone, go to Settings and tap your name. Click Sign-in & Security > Two-Factor Authentication > Continue . Follow the on-screen instructions to set up 2fA. [6] X Research source"
    }
  ]
}