{
  "url": "https://www.wikihow.com/Xfinity-Router-Blinking-White",
  "title": "How to Fix Your Xfinity Router if It’s Blinking White",
  "steps": [
    {
      "title": "Your router is establishing a connection to the internet.",
      "content": "Your router is establishing a connection to the internet. If, however, the blinking persists after a few minutes, you should follow the \"Common Fixes & Troubleshooting\" section to fix it yourself or call Xfinity for more help. Keep in mind that a white steady light or a white steady light with a purple tint means everything is working."
    },
    {
      "title": "Check the cables.",
      "content": "Check the cables. The cables should be tightly attached to the wall and your modem; loose coaxial cables can lose data, and a loose power cable can provide insufficient power. If there are any splitters between your modem, router, and the coaxial port on your wall, make sure all the cables entering and exiting the split are snugly secured. Also check that the pin inside the coaxial cables is straight. A bent pin indicates damage and prevents internet connection. Replace any damaged cables."
    },
    {
      "title": "Restart the modem, router, or gateway.",
      "content": "Restart the modem, router, or gateway. A random glitch can cause the white light to blink, and restarting it can be an easy fix! To restart, unplug the modem/router/gateway's power from the wall for a few minutes, then plug it back in."
    },
    {
      "title": "Check for an Xfinity outage.",
      "content": "Check for an Xfinity outage. An overall internet outage or maintenance outage can cause your router to blink white. Call the local ISP office to see if there's an outage; you can also check their website or your app for additional information."
    },
    {
      "title": "Update the firmware.",
      "content": "Update the firmware. Outdated software causes many issues, like a blinking white light. You can generally update the firmware by opening the app provided to you by Xfinity. Alternatively, go to their website, log in, go to System Settings in your router/modem/gateway's admin interface, and look there for a firmware update."
    },
    {
      "title": "Wait for the initialization process to finish.",
      "content": "Wait for the initialization process to finish. If you just set up the router, the blinking white light means it's setting up. During this process, avoid disconnecting your router or modem until the blinking stops, which means the initialization process is finished."
    },
    {
      "title": "Factory reset the device.",
      "content": "Factory reset the device. Doing so removes all personalized settings, like if you changed the network name/password. To reset it to factory settings, look at the back of the modem and press the recessed \"Reset\" button for a few seconds."
    },
    {
      "title": "Check for signal issues.",
      "content": "Check for signal issues. Sometimes the blinking white light indicates that your router or modem cannot connect with the Xfinity network. Check this yourself by logging into the router or modem online, or call support for more guided help."
    },
    {
      "title": "Call tech support.",
      "content": "Call tech support. In some cases, you can't fix the blinking white light yourself and need help from Xfinity. They should also check the coaxial lines to make sure there isn't any damage, but they can also replace any lines outside that have been compromised (think chew marks from outside critters). You might not need a tech to come out and look at your lines if you just need an IP address associated with your router!"
    },
    {
      "title": "Here's a chart of what the lights on your Xfinity devices mean:",
      "content": "Here's a chart of what the lights on your Xfinity devices mean: Understand the Lights on an Xfinity Modem No lights Your modem is off No action needed White or white/purple light - Steady The modem is on after activation No action needed White or white/purple light – Blinking Modem is on but not yet activated Fix: Complete new Xfinity account setup [1] X Research source Red light - Steady No internet Fix: Your internet service is down (contact Xfinity) Blue light – Blinking WPS mode is on (you pressed the WPS button) No action needed – just connect a new device to Wi-Fi if desired. Orange, yellow, green , and other blinking lights Your modem is trying to connect Fix: If 15 minutes pass and still no connection, power cycle your modem, then contact Xfinity if needed"
    }
  ]
}