{
  "url": "https://www.wikihow.com/Solder",
  "title": "How to Solder Wires, Electronics, and More",
  "steps": [
    {
      "title": "Familiarize yourself with soldering.",
      "content": "Familiarize yourself with soldering. Put into basic terms, soldering is the process of melting a metal onto other metal components in order to bind them. [1] X Research source Soldering differs from welding. In welding, the component pieces are melted together; in soldering, a softer metal with a lower melting point is used to connect them. [2] X Research source Because soldering doesn't melt components, it's useful for more delicate applications, such as electronics work, or plumbing. The purpose of soldering is to bind two other components. Solder can be thought of as a sort of “metal glue.” It can be used to fill in gaps or hold pieces in place, but doesn't serve any more complicated purpose. Since solder is metallic, it conducts electricity, which is another reason it's so popular for connecting electronic components."
    },
    {
      "title": "Use solder to bind things.",
      "content": "Use solder to bind things. Solder is the name of the actual material used in soldering. Historically, many solders contained lead or cadmium, [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source but that has been recently phased out for health reasons. Solder is typically composed of two or more metals combined into an alloy. Silver, antimony, copper, tin, and zinc are all common ingredients. Solder is soft and flexible. It generally comes in a coil, or spool, that can be stretched and bent. Solder has a low melting point, and cools extremely quickly after it's been melted. [4] X Research source (350F - 500F) Solder can contain a flux core of natural rosin (tree sap) or a chemical acid. The metal of the solder encircles the core, like a tube. The purpose of the core is to serve as a flux, or purifying agent. The flux prevents oxidation in the solder as it cools, keeping it strong and pure."
    },
    {
      "title": "Use a soldering iron to heat the solder.",
      "content": "Use a soldering iron to heat the solder. Soldering irons come in various configurations, but are essentially straight tools with tips that can be heated to melt solder in place. [5] X Research source Most soldering irons typically heat to between 800 and 900 degrees Fahrenheit, so exercise caution when using one. [6] X Research source Soldering irons tend to catch a veneer of solder after each use, which can oxidize and reduce the iron's effectiveness on the next use. To clean this off easily, secure a wet sponge before you turn your iron on, and gently drag the tip across the sponge once the iron is heated. A layer of fresh solder on the tip can actually make a soldering iron more effective. This process is called “tinning,” and is done by allowing a bit of fresh solder to melt evenly over the tip before use. Better models of soldering iron come with a heat control that can be adjusted for different projects and types of solder."
    },
    {
      "title": "Use other equipment to assist in soldering.",
      "content": "Use other equipment to assist in soldering. Soldering isn't especially dangerous or difficult if you take sensible precautions. To solder as efficiently and effectively as possible, there are a few useful pieces of equipment you should have. Clamps or alligator clips, for holding components in place while you solder them Thick gloves, to protect your hands from the tip of the iron as you feed solder to it Safety glasses or goggles, to prevent any errant solder flecks from hitting your eyes A solder stand to rest your soldering iron on between applications."
    },
    {
      "title": "Turn on the lights.",
      "content": "Turn on the lights. Be sure you can see everything clearly so that your work will be as accurate as possible. If you need to solder somewhere without much light, bring a bright light (such as a portable lamp) with you."
    },
    {
      "title": "Prepare adequate ventilation.",
      "content": "Prepare adequate ventilation. Even without lead in the mix, solder and flux can produce harmful fumes. Avoid breathing in rosin or metal fumes by opening a window, turning on a fan, and generally doing whatever you can to keep air fresh. [7] X Research source"
    },
    {
      "title": "Don't solder for too long in one sitting.",
      "content": "Don't solder for too long in one sitting. Soldering is a fast process, and it doesn't generally take more than a few minutes to do what needs to be done, but if you find yourself spending more than 15 or 20 minutes on a project, take regular breaks for fresh air."
    },
    {
      "title": "Pick your iron.",
      "content": "Pick your iron. Most electronic component soldering is done to fasten components to a PCB (printed circuit board). Therefore, an iron with a smaller tip is recommended. Consider a small flathead tip for ordinary work, or a conical point tip for fine detail soldering. Soldering irons don't have exchangeable tips, so you'll need to buy the one(s) you want. Fortunately, they start at around $15 in price, and a good quality iron can be had for around twice that. A typical soldering iron for electronics work will be a 40-watt iron that has a temperature (or a temperature setting) of 900 degrees. This allows the iron to easily melt electronics solder without damaging the small wires of the components themselves."
    },
    {
      "title": "Pick your solder.",
      "content": "Pick your solder. Both solid wire and Rosin-cored solders area available at stores and online. [8] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source Be sure the solder you choose will bond to the materials you are trying to solder. Using solid wire solder may require a separate flux to break the oxide coating and allow the solder to bond. Flux is applied when soldering to facilitate the flow of solder and remove oxides from the surfaces joined. It is typically applied before heating the joint. Flux can be in the form of a paste or a liquid. You can use it to clean the surfaces and wet the solder. 60/40 tin and lead solder used to be the standard for electronics soldering, however due to the toxicity of lead it has fallen out of favor. Tin and silver solder is generally preferred today. The silver raises the melting point slightly to 430F, raises the price, but helps the solder to bind more smoothly. The numbers in solder descriptions are percentages of the element in the solder alloy. (60Sn/40Pb = 60% tin and 40% lead)"
    },
    {
      "title": "Prepare the iron.",
      "content": "Prepare the iron. Plug in the iron and let it warm up on its stand for a few minutes. Be sure to gently wipe it across a sponge if it's been used previously, as described above. Tin it (as described above) once it's clean. When you're ready, set out your components, clips, and solder. [9] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source"
    },
    {
      "title": "Set a piece in place.",
      "content": "Set a piece in place. Put a component in the spot you want to solder it. If soldering to a PCB, be sure the wires of the component are appropriately placed through its pinholes. [10] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source For most components, use a small clip or clamp to hold them in place once you've set them."
    },
    {
      "title": "Pick up the solder wire.",
      "content": "Pick up the solder wire. Hold a length of solder with your non-dominant hand. Use a long length to ensure that you'll be able to keep your hand well away from the tip of the iron."
    },
    {
      "title": "Heat the component.",
      "content": "Heat the component. Touch the tip of the iron to the component you want to solder. Only touch it for about one second. This warms the metal so that it can handle the solder more flexibly. [11] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source Quickly touch your solder wire to the soldering point, and apply the iron to it. The solder should melt immediately. Soldering to a PCB board should never require more than about 3-4 seconds' worth of molten solder. If more solder is required to secure the connection, feed it smoothly with your hand. Your solder should pool loosely, forming concave sides as it spreads around the component wire. It shouldn't ball up or look lumpy."
    },
    {
      "title": "Finish the solder.",
      "content": "Finish the solder. Pull the solder wire away first, wait one second, and then pull the iron away from the soldering point to let the molten solder cool. Again, this should only take 5 or 10 seconds at most. Be sure not to blow on the solder or otherwise try to help it cool. This can make it lumpy or add impurities."
    },
    {
      "title": "Repeat until finished.",
      "content": "Repeat until finished. Repeat the above steps for each point you wish to solder. Re-tin your iron's tip every several applications, and once more before you put the iron away. This helps extend the life of the iron. [12] X Research source"
    },
    {
      "title": "Be prepared.",
      "content": "Be prepared. Soldering copper pipes isn't hard, but it is considerably more involved than soldering electronics, and requires different equipment. People typically engage in pipe soldering to seal joints between sections of pipe, such as elbow turns. [13] X Research source"
    },
    {
      "title": "Use a torch.",
      "content": "Use a torch. Instead of a soldering iron, a propane torch is generally recommended for soldering copper pipes together. These are widely available at hardware stores. [14] X Research source Specialized soldering irons can be used for pipe soldering, but a propane torch is just as effective for most jobs, and much cheaper."
    },
    {
      "title": "Get appropriate solder.",
      "content": "Get appropriate solder. Manufacturers offer specialized solder wire for soldering pipes. It tends to be much thicker, usually 1/8\" in diameter. Pipe solders often contain an acid flux, however solid wire works as well. Solid wire solder may need a separate flux. [15] X Research source Absolutely avoid using leaded solder for soldering your pipes. Be sure to closely read the label to determine the alloy composition. Pipe solders tend to compose mostly tin and may also contain antimony, copper, and/or silver."
    },
    {
      "title": "Have an abrasive item on hand.",
      "content": "Have an abrasive item on hand. To be sure your solder takes, it's helpful to clean the pipe beforehand by scouring it with an emery cloth, sandpaper, or fine steel wool. [16] X Research source"
    },
    {
      "title": "Cut off the water.",
      "content": "Cut off the water. Turn off the water to your plumbing before you begin work. This will allow you to work with your pipes without fear of flooding or spraying the room. [17] X Research source Before you turn the water off, pour a bucket of water. Keep the bucket nearby in case your torch catches anything on fire."
    },
    {
      "title": "Cut your pipe.",
      "content": "Cut your pipe. If you're installing new piping, use a tube cutter to cut any pipe up to an inch in diameter. [18] X Research source Tube cutters are available at hardware stores. Take it slowly. A tube cutter works best with slow, steady movement. Go too quickly and you might dent the pipe. For larger pipe, you'll have to use a hacksaw. File off the ragged edges afterward. Once the pipes are cut, fit them into whatever joints you'll need to solder tight."
    },
    {
      "title": "Clean up the pipe.",
      "content": "Clean up the pipe. Using an emery cloth or similar abrasive item, thoroughly abrade the area of pipe where you'll be applying solder to smooth and clean it. [19] X Research source A smooth and clean surface will allow the solder to flow into the joint smoothly and seal it evenly."
    },
    {
      "title": "Solder the pipe.",
      "content": "Solder the pipe. Fire up your propane torch and apply heat to the pipe you plan to solder. [20] X Research source Maintain even heat by moving the flame all around the work area. Once the pipe is good and hot, apply the tip of your solder wire to the place you need to seal. It should melt right away. Hold the solder on the opposite side of the pipe from your torch. It should flow around the joint and fill it up all the way around. Let the joint cool. It will cool quickly. Move on to the next joint that needs sealing, if necessary."
    },
    {
      "title": "Check your work.",
      "content": "Check your work. Once you're finished, wait a few minutes and then turn the water back on. Run water through the pipes you soldered and check for leaks. If there are any, you'll have to repeat the process."
    }
  ]
}