{
  "url": "https://www.wikihow.com/Tinder-for-Couples",
  "title": "How to Use Tinder as a Couple: Tips + Tinder-Like Apps",
  "steps": [
    {
      "title": "Tinder can be good for couples, but there are drawbacks.",
      "content": "Tinder can be good for couples, but there are drawbacks. Tinder is the most popular dating app in the United States (and many other countries), which means there are tons of people using the app. [1] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source Because there are so many people on Tinder, you're bound to find users who are interested in meeting couples. Before you and your partner sign up for Tinder, there are a few things you should know: Tinder doesn't offer joint profiles. Tinder's community guidelines state that each account can only have one owner. [2] X Research source So, while John and Tina can't create a single profile called JohnandTina, one or both of them can create their own profile and make it very clear that their partner is swiping along with them. Lots of couples share profiles this way without any repercussions. Your profile can only list one age. If you're both the same age, this won't matter. But because two people share a single profile, only one person's age will be factored into Discovery. If Partner A is 30 and Partner B is 38, you can only choose one of those two ages. If the profile's age is set to 30 and Partner B's age falls outside of a new match's age preference , they may feel duped by your profile. Most Tinder users are singles looking to meet other singles. While there are definitely Tinder users who are open to meeting an existing couple, you probably won't get as many matches as you'd like. People might think you're unicorn hunting. Couples looking for a third person strictly for sex and nothing more are called unicorn hunters . If you're looking for your unicorn, that's fine! But if you're a couple looking to invite someone into your relationship beyond sex, Tinder users may dismiss you due to the prevalence of unicorn hunters on the app."
    },
    {
      "title": "Set your Relationship Type.",
      "content": "Set your Relationship Type. If you're a couple using Tinder, your profile should list a Relationship Type that isn't monogamy to avoid matching with monogamous people. Tap Relationship Type in the edit section of your profile, then choose the term that best represents your relationship style. The options are Ethical Non-monogamy , Open relationship , and Polyamory . [3] X Research source"
    },
    {
      "title": "Fill out your Relationship Goals.",
      "content": "Fill out your Relationship Goals. The Relationship Goals section of your profile lets you specify whether you're looking for long-term or short-term relationships and if you're open to alternatives. [4] X Research source If you're looking for a third partner for the short-term only, be clear about this to avoid setting the wrong expectations. Similarly, if you're not unicorn hunting , saying so in your bio would be a good idea. Reader Poll: We asked 175 wikiHow readers what factor they consider most important for the success of a polyamorous relationship, and 60% of them said honesty and open communication between partners. [Take Poll] However you define your relationship, make it apparent in your bio."
    },
    {
      "title": "Add photos of the two of you to your profile.",
      "content": "Add photos of the two of you to your profile. Your Tinder photos should include solo shots of each partner and one or two couple selfies. Use one of the couple photos as your main photo to make sure potential matches know that a couple shares the profile."
    },
    {
      "title": "Consider making separate accounts.",
      "content": "Consider making separate accounts. If your relationship style allows it, having separate Tinder accounts might yield better results than a single shared profile. [5] X Research source Even if you're not interested in dating other people individually, you can simply create a profile for yourself and make it clear that you're only looking for people who are interested in meeting both you and your partner."
    },
    {
      "title": "Feeld.",
      "content": "Feeld. This Tinder alternative is very couple-friendly and should feel familiar to Tinder users. Feeld is also one of the few dating apps that allows two users to join their profiles together into a couples account. [6] X Research source This is a great way for a couple to both list their physical details and preferences in their own profiles but browse and meet others as a couple."
    },
    {
      "title": "AdultFriendFinder.",
      "content": "AdultFriendFinder. This sex-positive website and mobile app offers couples-specific profiles you can create and use together. AdultFriendFinder is geared toward casual sex, so it won't be great for couples looking for relationships. However, if you're a couple looking to hook up with one or more other people, this app can be a great alternative to Tinder."
    },
    {
      "title": "Couplr.",
      "content": "Couplr. Are you a couple looking to meet other couples? If you're hoping to add two new people to your dynamic instead of one, try the Couplr app. While the app is designed to help couples find other couple friends , it's also a safe and supportive place to look for other couples to date."
    },
    {
      "title": "OKCupid.",
      "content": "OKCupid. Because OKCupid was one of the first polyamory-friendly dating apps, it's a great place to meet people interested in non-traditional relationships. However, like Tinder, OKCupid does not allow couples to share a profile. They'll even delete your account if they catch you! [7] X Research source Still, each partner can create their own account and fill out their bio to explain that they're only looking to date with their partner, which OkCupid's many open-minded users will appreciate. [8] X Research source"
    }
  ]
}