{
  "url": "https://www.wikihow.com/Use-a-Fork-and-Knife",
  "title": "How to Use a Fork and Knife Properly: American vs European Style",
  "steps": [
    {
      "title": "Set the fork on the left side of the plate and the knife on the right side.",
      "content": "Set the fork on the left side of the plate and the knife on the right side. If you have more than one fork, the inner one will be your salad fork and the outer one will be for your main dish. This is because salad is usually served after the entrée in Europe. The fork for your main dish will also be larger than your salad fork. [1] X Research source Always start with silverware that is on the outside and work your way in. [2] X Research source The European style is considered more efficient than the American style because you don’t have to switch your fork to your other hand or set it down until you are finished eating. [3] X Research source"
    },
    {
      "title": "Hold the knife in your right hand throughout the entire meal.",
      "content": "Hold the knife in your right hand throughout the entire meal. Keep your index finger straight and rest it over the top, blunt side of the blade. Wrap your other 4 fingers around the handle of the knife. While your index finger is resting on top, the end of the knife handle should touch the center of your palm. [4] X Research source You can use your knife to push food onto the back of your fork (prior to bringing your fork to your mouth)."
    },
    {
      "title": "Hold the fork in your left hand throughout the entire meal.",
      "content": "Hold the fork in your left hand throughout the entire meal. Hold the handle between your thumb and your middle, ring, and pinky fingers. Place your index finger at the end of the handle where it meets the base of the tines (or prongs at the end of the fork). The handle should rest in the crease of your palm, and the tines should face downward and away from you. [5] X Research source The lower you place your index finger on the fork handle, the more leverage you'll have picking up your food and eating it. This is often referred to as the “scalpel method” because the fork is facing down toward the plate, similar to how you would hold a surgeon’s scalpel."
    },
    {
      "title": "Bend your wrists so your index fingers point down towards the plate.",
      "content": "Bend your wrists so your index fingers point down towards the plate. This causes the tip of your knife and fork to point towards the plate too. When you’re not cutting food or pushing it onto your fork, you can hold your knife steady by resting your wrist on the edge of the table. [6] X Research source Relax your elbows and keep them off of the table at all times. If you’re taking a break from using your cutlery in an informal setting, don’t stress about it."
    },
    {
      "title": "To cut food, pierce it with the fork and gently saw it with the knife.",
      "content": "To cut food, pierce it with the fork and gently saw it with the knife. Hold the food in place using the tines of your fork, making sure the tines are facing downward. Position your knife as close to the base of the fork as possible, then use a gentle sawing motion to cut through the food. Foods like pasta will cut easily, while tougher meats will take a bit of work. [7] X Research source Always cut your food with the tines facing down, and only cut 1-2 bites of food at a time. Make sure your knife is further away from you than your fork. This ensures you can see your knife clearly so you know where you’re cutting."
    },
    {
      "title": "Bring small bites of food to your mouth with the fork.",
      "content": "Bring small bites of food to your mouth with the fork. According to etiquette coach Tami Claytor, you should “not bend over” the table while eating. Always bring the fork to your mouth with the tines curving downward, and with the back of the fork facing you. Keep the fork in your left hand, even if you're right-handed. You may find that this method is the more efficient of the two if you experiment with both."
    },
    {
      "title": "Hold the fork like a pencil, with the tines facing upward.",
      "content": "Hold the fork like a pencil, with the tines facing upward. Americans hold forks in their dominant hand, whether it’s on the right or left. According to Claytor, the correct way to hold a fork is to “hold it by your index finger and your thumb, and then rest it on your third finger.” The end of the fork should rest on the webbing of your hand (the space connecting your index finger and thumb). Most Americans don’t pay attention to the direction of the tines when eating, so feel free to hold the fork with the tines down if it’s more comfortable for you."
    },
    {
      "title": "Cut food with the knife in your right hand and the fork in your left.",
      "content": "Cut food with the knife in your right hand and the fork in your left. Use your left hand to hold the food in place with the tines of your fork, then use a sawing motion to slice the food with your knife. The tines of your fork should face down, and your fork should be closer to you than your knife. Claytor says you should “cut four to five small bites” of food and “never cut the whole [thing] at one time.” This is the same technique as the European (or Continental) method."
    },
    {
      "title": "Switch the fork to your right hand before taking a bite.",
      "content": "Switch the fork to your right hand before taking a bite. After cutting a piece of food, put your knife down on the edge of your plate (blade at 12 o'clock, handle at 3 o'clock) and transfer your fork from your left hand to your right. [8] X Research source Turn your fork so the tines are curving upward and take a bite! Switch the fork back over to your left hand when you’re ready to cut another piece of food, and continue switching hands every time you need to cut more pieces."
    },
    {
      "title": "Eat with the fork in your right hand, with the tines facing upward.",
      "content": "Eat with the fork in your right hand, with the tines facing upward. If you are eating a dish that doesn't require cutting, keep your fork in your right hand at all times with this method. The tines can face downward if you're taking a bite, but will generally return upward for the majority of the time. [9] X Research source Your silverware should never touch the table. If you're only using your fork, be sure your knife is resting along the edge of your plate. When you put your fork down, rest the handle on the edge, tines near the center of the plate."
    },
    {
      "title": "Get familiar with different table set-ups.",
      "content": "Get familiar with different table set-ups. For most meals, you'll probably just have a knife, fork and spoon. But for those fancy occasions, you may see a few more pieces and wonder what the you should be doing. Here's a basic outline: [10] X Research source A four-piece setting is a knife, a salad fork, a place fork (main dish), a place knife, and a teaspoon for coffee. The salad fork will be on the outside and smaller than your place fork. A five-piece setting is all that and a soup spoon. The soup spoon will be much larger than your coffee teaspoon. A six-piece setting is a first-course fork and knife (on the outside), main course fork and knife, and a dessert/salad fork and coffee teaspoon. Those last 2 will be the small ones. A seven-piece setting is all that and a soup spoon. The soup spoon will be much larger than your coffee teaspoon and isn't a knife or a fork. If you ever see a small fork on your right (forks generally never go on the right), it's an oyster fork. Utensils are generally placed in the order of their use. When in doubt, start from the outside and work your way in."
    },
    {
      "title": "If you're taking a break, place your silverware in a resting position.",
      "content": "If you're taking a break, place your silverware in a resting position. There are 2 different ways to signal to your waiter that you aren't finished: [11] X Research source European style: Cross your knife and fork on your plate, with your fork over the knife and the tines facing down. The 2 should form an upside-down \"V.\" American style: The knife goes near the top of your plate, blade at 12 o'clock, handle at 3 o'clock. The fork is placed tines upward, just at a slight angle from your body."
    },
    {
      "title": "If you're done eating, place your silverware in a completed position.",
      "content": "If you're done eating, place your silverware in a completed position. This lets your waiter know your plate can be cleared. Again, the two different ways are: [12] X Research source European style: Knife and fork parallel to each other, handles at 5 o'clock, blade and tines in the center of your plate (with the tines downward). American style: The same as European style, only with the tines of the fork facing upward."
    },
    {
      "title": "Scoop up loose food with your knife or fork.",
      "content": "Scoop up loose food with your knife or fork. You need to pick up rice (and other loose food) by using your fork to scoop it up, rather than piercing it. The American style generally prefers to rely solely on the fork, while the European style employs the help of the knife blade or a piece of bread for scooping. [13] X Research source"
    },
    {
      "title": "Twirl rather than cut pasta.",
      "content": "Twirl rather than cut pasta. If you have a spoon, grab a few noodles with your fork and twirl them, resting them on the base of your spoon. If the noodles are too long, you can cut them with your knife, but try taking a few noodles at a time first. [14] X Research source Be sure to have a napkin handy to clean up any spills!"
    }
  ]
}