{
  "url": "https://www.wikihow.com/Start-the-Probate-Process",
  "title": "How to Start the Probate Process",
  "steps": [
    {
      "title": "Find the will.",
      "content": "Find the will. If the decedent has a will, you will need to locate it right away because it says who will inherit the decedent’s property. The will also names an executor. Gather any codicils (amendments to the will) as well. Be aware that in some states, the “custodian of the will,” or the person who has the will at the time of the testators death, must take the will to the probate court or the executor named in the will within 30 days of the testator’s death. In states that have this requirement, the custodian can be sued for damages for failing to do this. [1] X Research source If there is no custodian, search for the will in places such as filing cabinets and desk drawers. If you are unable to find the will after looking in obvious places, look for the will in safe deposit boxes, with the decedent’s lawyer, or at the local probate court. If you cannot locate a will, either because the decedent did not have one or because it is lost, proceed under state intestacy laws. Intestacy laws provide a way to distribute a decedent’s property without a will, according to a state statutory scheme. [2] X Research source"
    },
    {
      "title": "Order copies of the death certificate.",
      "content": "Order copies of the death certificate. As you go through the probate process, you will need a number of certified copies of the death certificate to serve as official evidence of the death. Ask for at least ten copies. The mortuary that handles the decedent’s funeral may provide some certified copies of the death certificate. You can also order death certificates from your state’s department of vital records. [3] X Research source To order death certificates from the department of vital records, you will need to provide a valid government issued photo ID and two of the following documents that includes you name and address: telephone bill, utility bill, or letter from a government agency dated within the last 6 months. [4] X Research source Be aware that in some states, the only people who can order copies of the death certificate are family members or the executor of the will."
    },
    {
      "title": "Gather other required documents.",
      "content": "Gather other required documents. In addition to the will and death certificates, there are several other miscellaneous documents that you may need. Gather these documents before you begin the probate process. paperwork related to the decedent’s insurance policies appraisals bank account information property inventory papers stocks and bonds tax returns for the estate tax returns for the decedent’s property"
    },
    {
      "title": "Organize all of the documents.",
      "content": "Organize all of the documents. After you have gathered all of the required documents, take some time to organize them. You may want to invest in an accordion style file folder to keep the documents separated and easy to find. Label the tabs to indicate what documents are in each section. If you are missing any of the documents that you will need, you will have to do some searching. Contact the decedent's accountant, the manger of the decedent's bank, and any other professionals who may be able to provide you with the documents that you need."
    },
    {
      "title": "Determine if probate is required.",
      "content": "Determine if probate is required. Sometimes, it is possible to completely avoid probate or participate in a simplified probate process. Make sure to check your state’s laws for specifics. [5] X Research source If the estate is valued at less than $100,000, there's a chance probate is not required. No probate may be required if the decedent created mechanisms for passing their property outside of probate. Some common assets that do not go through probate include: joint tenancy property property placed in a living trust household goods and other property that goes to immediate family members under state law payable-on-death bank accounts life insurance proceeds retirement accounts (IRAs, 401k’s and others) securities registered in transfer-on-death form personal property in “small estates”"
    },
    {
      "title": "Determine if you should use a simple probate procedure.",
      "content": "Determine if you should use a simple probate procedure. Many states offer an informal probate process that is much easier and faster than formal probate. In most states, this simple probate procedure is also known as “summary administration.” States use a certain dollar amount to determine whether an estate is eligible to be probated through a summary administration. For example, to be eligible for simple probate in California, the estate cannot be worth more than $150,000. [6] X Research source Some states have other requirements for simple probate, so make sure to check the laws in your state before proceeding."
    },
    {
      "title": "Determine if you should use formal probate.",
      "content": "Determine if you should use formal probate. This is the best option for estates that are more complicated or have a value that is too high to qualify for summary administration. You will need to use a formal probate procedure if the decedent’s property exceeds the limits for simple probate in your state, or if there are disputes between beneficiaries, or challenges to the will. [7] X Research source"
    },
    {
      "title": "Be aware of probate deadlines in your state.",
      "content": "Be aware of probate deadlines in your state. In most states, there is no deadline for starting a probate proceeding, but some states require probate to begin within three or four years. If you plan to use a simple probate procedure, some states require that probate begins within three years after the death."
    },
    {
      "title": "Be aware that the court must appoint an executor or administrator.",
      "content": "Be aware that the court must appoint an executor or administrator. In most cases, courts will honor a testator’s wishes and appoint an executor that was named in the will. [8] X Research source If there is no will, state law determines who has priority to serve as executor. The executor who is named in the will can begin probate, but family members or other named in the will can also begin the probate process."
    },
    {
      "title": "Petition the court to name an executor.",
      "content": "Petition the court to name an executor. The executor of a will is responsible for distributing assets, maintaining property, and paying bills and taxes during the execution of the will. The executor must also make court appearances as needed. [9] X Research source If you are named in the will, or if the will does not name an executor, you may petition the court to name an executor. In order to be named executor, you will need to file the following documents with the court: an application a death certificate the original will"
    },
    {
      "title": "Attend the first hearing.",
      "content": "Attend the first hearing. When someone requests to be appointed as executor, the court will schedule a hearing to give interested parties (parties who could inherit something from the estate) a chance to object to the appointment. Before the hearing, all interested parties must be informed of the date and time. Keep in mind that most of the time, the hearing is a formality and no one objects to the executor’s appointment. If the executor is approved, the court will issue documents allowing the executor to act on behalf of the estate. These are usually called “Letters of Administration” or “Letters Testamentary” if there is no will. [10] X Research source After approving the executor, the court will issue an order opening the probate case."
    },
    {
      "title": "Publish and send notices.",
      "content": "Publish and send notices. If you are named executor, then you will be responsible for sending out notices of probate to all of the decedent’s creditors and beneficiaries. In most states, a notice should also be published in the local newspaper to alert any other unknown creditors. [11] X Research source"
    },
    {
      "title": "Post the bond.",
      "content": "Post the bond. The court may require the executor to post bond, which is an insurance policy that protects the estate beneficiaries from any losses to their inheritance caused by the executor. If the will states that no bond is required, the court will often waive the requirement. If a bond is required, the amount will depend on the size of the estate."
    },
    {
      "title": "Prove that the will is valid.",
      "content": "Prove that the will is valid. If there is a will, proving that the will is valid is a part of probate. Until the will has been proven to be valid, the executor cannot begin distributing the estate. To prove that the will is valid, you will need the statements of one or more witnesses who signed the will at its execution. In general, probate courts allow the following types of witness statements: A sworn statement called a “self-proving affidavit” that was signed by the witness in front of a notary when they witnessed the will A sworn statement signed by the witness at the time probate is opened A personal statement made by the witness to the court As an alternative, the court may accept other evidence of the will’s validity, such as the testimony of someone who is familiar with the testator’s signature."
    }
  ]
}