{
  "url": "https://www.wikihow.com/Swing-Dance",
  "title": "How to Swing Dance",
  "steps": [
    {
      "title": "Walk in place for an ultra-simple swing dance move.",
      "content": "Walk in place for an ultra-simple swing dance move. If you need a swing dance move that you can try right now, simply walk in place. Walk along with the rhythm of the music so that you are stepping to the beat. Make sure to keep your body over your feet and avoid leaning back, since this will resemble marching more than swing dancing. [1] X Research source Try walking forward 3 steps, then take 3 steps back. Walk to the side by 3 steps, then take 3 steps in the opposite direction."
    },
    {
      "title": "Tap 1 foot out to the side, front, and back while walking to touch-step.",
      "content": "Tap 1 foot out to the side, front, and back while walking to touch-step. A small tapping motion in any direction can jazz up a walking dance step. Tap 1 foot on the floor in front of you in place of a step, tap your right foot out to the right or your left to the left, or tap the floor behind you with your toe to replace another step. [2] X Research source Tap in the same direction at regular intervals for a simple dance move, or vary when and where you tap for something more intricate. Make sure that you tap with the beat of the music."
    },
    {
      "title": "Take 3 quick steps in place, to the side, forward, or back to triple-step.",
      "content": "Take 3 quick steps in place, to the side, forward, or back to triple-step. Triple-stepping is just what it sounds like. Walk in place, but do it quickly for 3 steps. Like walking, you can also triple-step in any direction. [3] X Research source Try walking in place for 2 steps and then add a triple-step. Follow up a tap with a triple-step."
    },
    {
      "title": "Kick 1 foot forward, press down on the ball of that foot, and pivot.",
      "content": "Kick 1 foot forward, press down on the ball of that foot, and pivot. This is called a kick-ball-change. Practice this move by kicking 1 foot out in front of you. Keep the kick low, at about the height of your ankles or mid-calf at highest. Then, bring the foot down on the ball of your foot so that your heel is 1 to 2 in (2.5 to 5.1 cm) off the ground. Turn 90 degrees on the ball of your foot so that you are facing in a new direction. [4] X Research source Follow up a triple-step or tap with a kick-ball-change. Try using kick-ball-changes to turn towards your partner if you are dancing with someone."
    },
    {
      "title": "Place one hand on your partner's back if you're leading.",
      "content": "Place one hand on your partner's back if you're leading. Place your right hand on your partner's upper back, just below their shoulder blade. [5] X Expert Source Bridgette Borzillo Dance Instructor & Artistic Director Expert Interview. 10 September 2021. Then, keep your right arm under their left arm, and hold your partner's left hand in your right hand. [6] X Research source In dance, there's typically one partner who sets the pace, called the leader. In traditional male-female pairs, the male is usually the lead, but that doesn't always have to be the case!"
    },
    {
      "title": "Hold your partner's shoulder and opposite hand if you're following.",
      "content": "Hold your partner's shoulder and opposite hand if you're following. If your partner is the one who's leading, place your right hand on your partner's shoulder and rest your left arm on their right arm. Clasp your partner's right hand with your left. [7] X Expert Source Bridgette Borzillo Dance Instructor & Artistic Director Expert Interview. 10 September 2021. Bend your elbow slightly, and hold your hands up at about chest height. [8] X Research source No matter which position you're dancing in, try to avoid having a stiff posture while you're swing dancing."
    },
    {
      "title": "Take 2 slow steps in place while mirroring your partner.",
      "content": "Take 2 slow steps in place while mirroring your partner. Walking in place while facing your partner is a simple way to dance East Coast Swing. You can also walk together from side to side, or forward and backwards. Make sure that your partner steps at the same time using the opposite feet as you do. [9] X Research source For example, if you take a step with your right foot, then they should take a step with their left foot, and vice versa. [10] X Expert Source Bridgette Borzillo Dance Instructor & Artistic Director Expert Interview. 10 September 2021."
    },
    {
      "title": "Step back and shift your weight to your back foot, then step forward again.",
      "content": "Step back and shift your weight to your back foot, then step forward again. This is called a rock-step. [11] X Expert Source Bridgette Borzillo Dance Instructor & Artistic Director Expert Interview. 10 September 2021. While facing your partner, take a step back and put all of your weight on that back foot. Your partner should also step back and rock back as you do, but using the opposite foot. [12] X Research source For example, if you step back with your left foot, then your partner should step back with their right foot."
    },
    {
      "title": "Do a sugar push by walking 2 steps back as your partner steps forward.",
      "content": "Do a sugar push by walking 2 steps back as your partner steps forward. Face your partner and hold your partner’s right hand with your left hand. Take 2 steps back as your partner steps towards you. Then, take 2 steps in place while your partner does the same. As you step, grasp your partner’s left hand with your right hand. Gently push your partner back using both of your hands. Then, take 2 steps forward as your partner takes 2 steps back. [13] X Research source Repeat the move as many times as you like for a simple way to dance West Coast Swing."
    },
    {
      "title": "Try a straight send-out by extending your arm as your partner steps away.",
      "content": "Try a straight send-out by extending your arm as your partner steps away. Stand facing your partner with your right hand resting on their waist and their left hand resting on your shoulder. Clasp your partner’s right hand with your left hand and walk side to side with them for 4 steps. Then, release your grip on their waist and extend your left arm out as your partner steps away from you. Walk in place for 4 steps as your partner does the same, then guide your partner back towards you by bending your arm. [14] X Research source Resume the previous position and repeat the step as many times as you like for a simple dance move."
    },
    {
      "title": "Walk in place while turning to do a left side pass.",
      "content": "Walk in place while turning to do a left side pass. Hold your partner’s right hand with your left hand. Look in the direction you want your partner to go and guide them with your left arm. Walk in place for 4 steps, and then turn and walk 4 more steps as your partner walks 180 degrees around you. Then, pause and walk in place for 4 steps before guiding them back to their start position using the same arm and going in the same direction. [15] X Research source Don’t change directions during this dance move! Keep your partner moving in a counterclockwise pattern around you. Make sure to face your partner the whole time they are walking around you."
    }
  ]
}