{
  "url": "https://www.wikihow.com/Stop-Hard-Water-from-Ruining-Your-Skin",
  "title": "How to Stop Hard Water from Ruining Your Skin",
  "steps": [
    {
      "title": "Moisturize skin after washing.",
      "content": "Moisturize skin after washing. Regular usage of hard water can lead to dry, irritated skin. Combat this effect right after showering, bathing, or washing your face by moisturizing right away. [1] X Expert Source Mohiba Tareen, MD FAAD Board Certified Dermatologist Expert Interview. 26 March 2020. Use a facial moisturizer and rich body lotion, and apply generously. [2] X Research source A non-alcohol toner can also be used after washing to remove traces of minerals and heavy metals. Warm coconut oil can also be used as an intensive body moisturizer."
    },
    {
      "title": "Use a chelating shampoo.",
      "content": "Use a chelating shampoo. Hard water may leave mineral deposits in your hair and on your scalp, leaving it dry. Counteract this effect by purchasing a chelating shampoo, which contains an ingredient that bonds with the minerals in hard water and helps to rinse them away. Look for a shampoo (in pharmacies, beauty supply stores, or online) that contain “EDTA”, or Ethylene Diamine Tetra Acetate. [3] X Research source Consider switching to a sulfate-free shampoo or cleanser as well. Sulfates can react with metals and minerals found in hard water."
    },
    {
      "title": "Use less soap.",
      "content": "Use less soap. Hard water makes it difficult for soap to dissolve, leaving a buildup on your skin that can have negative effects (e.g. dryness, irritation). Using less soap can lessen this effect simply by cutting down the amount of potential buildup. When washing, focus larger amounts of soap on areas where you perspire frequently (like your underarms) and use it sparingly on the rest of your body. [4] X Expert Source Mohiba Tareen, MD FAAD Board Certified Dermatologist Expert Interview. 26 March 2020."
    },
    {
      "title": "Buy a water softening shower head.",
      "content": "Buy a water softening shower head. If you have hard water and wish to treat it, start with a water softening shower head before thinking about installing a larger system. These showerheads use replaceable filters to purify water and are available online or in hardware stores. Installation is as simple as replacing your old showerhead, and the filtration works immediately to provide soft water in your shower."
    },
    {
      "title": "Install a household system.",
      "content": "Install a household system. If you wish to soften the water throughout your home, buy a whole-house system. Ask neighbors or colleagues for recommendations, and read reviews of local companies providing this service. Note that professional installation of such a system is required to keep warranties, and systems cost a minimum of $1,000 before additional costs. [5] X Research source Get quotes from different companies and compare prices before making a purchase. Some municipalities do not allow these systems because of their use of salts and resins to remove contaminants. Call your local municipal office to find out what regulations are in effect in your area."
    },
    {
      "title": "Rent a water softening system.",
      "content": "Rent a water softening system. Contact local companies to inquire about the possibility of renting water softening systems. This may be a more cost-effective choice for smaller homes, apartments, or vacation homes. Renting a system may also be a good way to see if buying a whole-house system is a worthwhile investment for your home."
    },
    {
      "title": "Add aluminum sulfate to your water.",
      "content": "Add aluminum sulfate to your water. Add one tablespoon (0.5 oz.) of aluminum sulfate to a small bucket of water. When the minerals clump and settle to the bottom, skim the water off of the top with a cup or small container. Use the soft water to wash your face or take a sponge bath. [6] X Research source"
    },
    {
      "title": "Wash your face with bottled water.",
      "content": "Wash your face with bottled water. If washing your face with tap water is having noticeably adverse effects on your skin (irritation or redness), make a point of using bottled water to wash it instead. While the cost may seem excessive, it may be worth the investment if your skin is particularly sensitive. Be sure to use enough water to rinse your face efficiently and prevent product buildup. Another alternative might be a no-rinse cleansing water, some of which both cleanse and moisturize. Using distilled water may also be a viable option."
    },
    {
      "title": "Shower elsewhere whenever possible.",
      "content": "Shower elsewhere whenever possible. If you have access to a shower somewhere other than home (e.g. at the gym or swimming pool), take the opportunity to shower there as often as possible. Cutting back on the number of showers you take in hard water will minimize the overall damage to your skin. Make a point to bring your facial cleanser and wash your face there as well."
    }
  ]
}