{
  "url": "https://www.wikihow.com/Use-the-Pok%C3%A9-Radar",
  "title": "How to Use the Poké Radar",
  "steps": [
    {
      "title": "You don't have to catch them all, just see them all.",
      "content": "You don't have to catch them all, just see them all. Once you've done this, go talk to Professor Oak in front of Pal Park and he'll give you the Poké Radar."
    },
    {
      "title": "The Radar only works in short grass, so you'll have to find some.",
      "content": "The Radar only works in short grass, so you'll have to find some. Use a repel, which will make it so you only encounter the Pokémon found in the shaking grass (granted your first party Pokémon is a higher level than the wild Pokémon in the area). Also, make sure you're not on your bike. Once you have the spot you want, use the radar."
    },
    {
      "title": "You'll need to keep track of which patches were shaking.",
      "content": "You'll need to keep track of which patches were shaking. Aim for grass farther away, for more chance at finding the same Pokémon again. Be careful not to go to grass right on the edge however, as this heightens the chance that the radar will not find any more shaking spots. If this happens, just recharge the radar."
    },
    {
      "title": "This can be helpful if the shaking grass patches are all different to the ones you've seen previous, you're searching for a shiny patch or the radar finds no shaking grass patches (\"The grassy patch remained silent...\"",
      "content": "This can be helpful if the shaking grass patches are all different to the ones you've seen previous, you're searching for a shiny patch or the radar finds no shaking grass patches (\"The grassy patch remained silent...\" ). Do this by walking 50 steps, being careful not to run into a shaking patch or let your repel run out."
    },
    {
      "title": "If you defeat the Pokémon you meet, the grass around you will keep rustling.",
      "content": "If you defeat the Pokémon you meet, the grass around you will keep rustling. This saves time, meaning you don't have to bother recharging the radar."
    },
    {
      "title": "Often, you'll meet dirt common Pokémon repeatedly.",
      "content": "Often, you'll meet dirt common Pokémon repeatedly. Don't fret. The Pokémon you can only catch with the Poké Radar are fairly rare. If you meet it once, there's a high likelihood you'll meet the Pokémon more regularly."
    },
    {
      "title": "If the grass is sparkling, there is probably an ultra-rare shiny Pokémon there.",
      "content": "If the grass is sparkling, there is probably an ultra-rare shiny Pokémon there. You don't want to miss that opportunity!"
    }
  ]
}