{
  "url": "https://www.wikihow.com/Train-Your-Canary",
  "title": "How to Train Your Canary",
  "steps": [
    {
      "title": "Let your canary get used to her surroundings.",
      "content": "Let your canary get used to her surroundings. It’s best to focus on training one canary at a time, with one canary in a single cage in a room. Canaries are prone to getting nervous about possible predators around them, so be patient and let your canary get familiar with the area around her cage. Avoid making sudden movements and loud noises when you enter the room so you don’t startle your bird. [3] X Research source Spend time sitting in the room with your canary for the first several days. When you enter the room, make a low sound or whistle and then repeat the same sound or whistle every time you enter the room. This will become your “special noise” for your canary, which will signal her of your presence."
    },
    {
      "title": "Keep her cage at eye level.",
      "content": "Keep her cage at eye level. Hang your bird’s cage so it sits eye level with you, as she can become stressed from having to make too many movements with her head. Place her cage in a room with some household activity so she can watch you and become comfortable with your presence. At night, cover her cage with a dark cloth so she knows when it’s night and time for bed. Take the covering off in the morning so she can recognize that it is day and time for activity."
    },
    {
      "title": "Observe your canary.",
      "content": "Observe your canary. Avoid direct eye contact when you first enter and sit in the room, as many birds associate direct eye contact with danger. Instead, watch your canary in her cage from a safe distance. As you watch your canary during the first few days, you may note she is flitting around the cage as well as feeding, bathing and preening in your presence. Once she stops flitting around and grooming herself, you can begin to make closer contact with her."
    },
    {
      "title": "Talk quietly to your canary for 10 to 15 minutes, twice a day.",
      "content": "Talk quietly to your canary for 10 to 15 minutes, twice a day. This will help your canary get familiar with you over a period of time, and build your relationship . Sit near her cage, whistle to her, and talk in a quiet tone. Over time, she will recognize your voice and come to see you as a friend. Stress can kill canaries so focus on acting calm and soothing around her. Some canary owners create a certain low noise, like a humming or shushing, that they then repeat when they move close to the canary’s cage. The canary will get used to the “special noise” and come to associate it with their owner and with comfort."
    },
    {
      "title": "Place a single toy, a mirror, or one to two perches in the cage.",
      "content": "Place a single toy, a mirror, or one to two perches in the cage. Don’t overcrowd the cage with lots of toys, accessories, or perches. Though it is important for your canary’s well-being that they move and fly around, keep the cage items to a minimum to allow your canary to move freely. Change up the accessories to allow for variety, but keep only one or two items in the cage at a time. Note how your canary interacts with the toys, especially how she flies from perch to perch. You can also place a shallow water dish in the cage, along with her normal water dish, so she can take the occasional bath. Fill the plastic shallow dish with lukewarm water and place it on the floor of the cage. Be sure to clean it every day, along with your bird’s other dishes."
    },
    {
      "title": "Put your hand in her cage, with a treat.",
      "content": "Put your hand in her cage, with a treat . After several days of observing your canary, talking to your canary, and letting her play with toys in her cage, you can try placing your hand in her cage while holding a treat. Though she may not take it right away, she will start to get used to your presence in her cage and see training as a good thing that comes with a treat. [4] X Research source Slice up vegetables like broccoli, kale, asparagus, carrots, tomatoes, and zucchini to offer as a treat. Fruits like apples, blueberries, bananas, grapes, peaches, and melons also work as great treats. Hold the treat lightly between your fingers so it is easy for your canary to pick it up. As you offer her a treat, look for any signs of stress, like panting from the mouth, jerking movements away from you, and if her feathers are lying flat against her body. If you note any of these signs, leave the treat in her cage, and remove your hand. You can try to give her a treat again the next day, but don’t be discouraged if she shows signs of stress. With enough patience and persistence, she will become more comfortable over time and start to respond to your treats. Once your canary starts to feel safe around you, she may tilt her head and squint at you. Some canaries will place one foot on your finger to show they are responsive to your presence in their cage. If your canary seems comfortable placing one foot on your finger for a long period of time, you can start to accelerate her training."
    },
    {
      "title": "Start over if your canary bites you.",
      "content": "Start over if your canary bites you. Canaries bite on occasion, but their bite is not harmful or dangerous. It will feel a slight nip. However, you should take even a small bite as a sign your canary is not willing to train at the moment. If your canary bites, take your hand out of her cage and revert to observing her in the room and talking calmly to her for several more days. Then, try to feed her a treat again while she is in her cage."
    },
    {
      "title": "Try to hold her outside of the cage.",
      "content": "Try to hold her outside of the cage. Once she starts to take treats from you and respond to your “special noise” by looking at you and placing one foot on your finger, you can try to coax her into your hands and take her out of the cage to prepare her for more intense training. It’s difficult to train your canary while she is in her cage, as it can seem threatening to her. If she is comfortable with you, she should display no signs of stress or fear when out of the cage. The right time to do this will vary from bird to bird, but try this at after four to six weeks. To hold your canary properly, put your palm on her back and wrap your fingers around her by placing your thumb and forefinger on either side of her head. As you hold her, make the “special noise” and use your fingers to gently stroke down her back and then down the front of the body. This will soothe her and make her comfortable outside of her cage, as well as in your hands."
    },
    {
      "title": "Use a perch to coax your canary out of the cage.",
      "content": "Use a perch to coax your canary out of the cage. Move to training your canary to venture out of her cage on her own by using an 18 inch (45.7 cm) perch. Make sure all the doors and windows in your house are shut so she cannot fly away. Then, insert the perch through the bars close to the cage door and then open the door. You may need to use a treat to encourage your canary to slowly step onto the perch and move out of the cage. You should also have another perch set up close to the cage, such as on branch on a potted tree or a toy perch, to give your canary somewhere to land after she flies. Avoid chasing your bird from her cage as this can spook her and make her fearful of leaving her cage. Even one bad experience can undo all the previous training and bonding you have done with your canary. Take it slow and let her come out of her cage on her own, with the help of a treat."
    },
    {
      "title": "Practice calling your canary to your hand.",
      "content": "Practice calling your canary to your hand. Once your bird starts to venture out of her cage on her own and becomes comfortable landing on perches around the room, you can train her to land on your hand. Use treats to motivate her and reward her during this training. Once your bird is out of her cage, hold a treat in your hand, between two fingers. Create a perch with your two fingers together and out straight. Call your canary to you, using the “special noise”. If she lands successfully on your two fingers, reward her with a treat. Continue to do this until she seems comfortable landing on your hand. Over time, you can hide the treat until your canary lands on your hand, or in some cases, the top of your head. With enough practice, she should get used to landing on your hand or head when called."
    },
    {
      "title": "Let your bird return to her cage on her own.",
      "content": "Let your bird return to her cage on her own. For your canary to become well trained and well tamed, she should go back into her cage on her own. Avoid chasing your canary or shooing her back into her cage, as this can scare her. Use fruit treats to encourage your bird to go back into her cage. Hold the treat between your fingers, just inside the cage. Once she is in the cage safely, reward her with the treat. On rare occasions, your bird may not want to go back into her cage, though it may be time for bed or you may be leaving the house. To do this, make the room dark and net her quickly and carefully. Be gentle as you place her back in her cage. Avoid netting your bird, unless absolutely necessary."
    }
  ]
}