{
  "url": "https://www.wikihow.com/Use-Saffron",
  "title": "How to Use Saffron",
  "steps": [
    {
      "title": "Look for quality saffron.",
      "content": "Look for quality saffron. High quality saffron is a bunch of long red strands that are bright red in color. Avoid powdered saffron, as it's usually mixed with a lot of fillers."
    },
    {
      "title": "Know what flavor to expect.",
      "content": "Know what flavor to expect. Saffron has a pungent, musty taste and scent with sweet floral accents. When used in excess, however, the taste can quickly become bitter."
    },
    {
      "title": "The colour of red saffron doesn't change if you dip in water or milk.",
      "content": "The colour of red saffron doesn't change if you dip in water or milk. Saffron has a flavor profile similar to vanilla: sweet and musky. The two typically work well together, but they are not similar enough to serve as strict substitutes for one another. Turmeric and safflower are often used instead of saffron to give foods a similar color, but the flavors are much different."
    },
    {
      "title": "Get what you pay for",
      "content": "Get what you pay for . Harvesting saffron is a labor-intensive process, so if you want high-quality saffron, prepare yourself for an expensive purchase. Examine the saffron before you buy it. Good saffron consists of fine, evenly sized threads that are deep red in color with an orange tendril on one end and a trumpet-shaped flute on the other. If the tendril looks yellow, the saffron is likely real but of slightly poorer quality. Additionally, a stronger scent also indicates a stronger, better flavor. In comparison, fake saffron may look like shredded, irregular threads with disconnected tendrils and pieces of bark mixed into the package. The scent may not be very strong and usually smells like bark."
    },
    {
      "title": "Opt for whole saffron instead of ground.",
      "content": "Opt for whole saffron instead of ground. Simply put, whole saffron has a stronger flavor than ground saffron. Ground saffron can be a good substitute if you cannot find or afford the whole spice, though. If you do decide to buy ground saffron, go through a reputable spice seller. Less honest sellers may cut saffron with other spices, including turmeric and paprika, to reduce the overall cost."
    },
    {
      "title": "Store the saffron carefully.",
      "content": "Store the saffron carefully. Saffron doesn't spoil, but it will gradually lose its flavor in storage. Proper storage can preserve the saffron for longer periods, however. Wrap the saffron threads in foil and place them in an airtight container. Store them in a cool, dark place for up to 6 months. For longer storage, keep the container of saffron in your freezer for up to 2 years. Note that ground saffron should be used within 3 to 6 months and stored in an airtight container and a cool, dark place."
    },
    {
      "title": "Crush and soak the threads",
      "content": "Crush and soak the threads . The process of crushing and soaking saffron releases the maximum amount of flavor from the threads, so it's strongly recommended. Take the saffron threads you intend to use for the recipe and crush them into a powder using a mortar and pestle. If you don't have a mortar and pestle, you can crumble the threads in between your fingers. Steep the crushed saffron in warm water, stock, milk, or white wine for 20 to 30 minutes. If there's any liquid in your recipe, use a small amount of the specified liquid from the instructions. [1] X Research source Add the saffron and soaking liquids directly to your recipe when called for."
    },
    {
      "title": "Toast the threads.",
      "content": "Toast the threads. Toasting is another common way to prepare saffron, and it's especially common for traditional paella recipes. Place a cast iron skillet on the stove over medium heat. Add the saffron threads to the hot skillet. Cook, stirring frequently, for 1 or 2 minutes. They should release an even stronger aroma but should not be allowed to burn. Cool slightly and grind the toasted saffron threads using a mortar and pestle. This powder can be soaked or added directly to the recipe."
    },
    {
      "title": "Crumble and add directly.",
      "content": "Crumble and add directly. While not ideal, you can crumble and add the threads of saffron directly to the dish while you cook it if the recipe calls for a large amount of liquid. Note that if you use commercially ground saffron, you'll typically add it directly to the dish instead of soaking it."
    },
    {
      "title": "Use a small amount.",
      "content": "Use a small amount. In large qualities, saffron will produce a bitter flavor. It's best to prepare and use very small amounts in your dishes. When possible, count the threads instead of measuring them by volume. Note that a \"pinch\" of saffron equals about 20 medium threads, and a pinch is usually enough in most recipes that serve four to six people. When using powdered saffron instead of whole threads, note that 1/4 tsp (1.25 ml) of powder equals about 1/2 tsp (2.5 ml) of threads. This amount is usually enough for recipes that serve 8 to 12 people; scale it as needed based on the number of servings."
    },
    {
      "title": "Use saffron in grain-based recipes.",
      "content": "Use saffron in grain-based recipes. Most traditional recipes calling for saffron are grain-based, including risotto, pilaf, and paella. You can find a recipe that calls for saffron or add it to a basic recipe. As a general guideline, add about 30 threads of saffron to four servings of risotto or pilaf made with 12 oz (300 g) of rice. Add 50 threads of saffron to a paella recipe that serves four. [2] X Research source"
    },
    {
      "title": "Add saffron to desserts.",
      "content": "Add saffron to desserts. Since saffron has a flavor profile similar to vanilla, it works well in many desserts that typically feature vanilla as the primary flavor. [3] X Research source This includes custard, plain pastry, and sweet breads. For custards, only add a pinch of saffron to the recipe per four servings. For pastry and plain cookies, use 15 to 20 threads of saffron for every 8 oz (200 g) of flour called for in the recipe. Note that butter accents the taste of saffron better than margarine. For sweet breads, adding 15 threads of saffron per 1 lb (450 g) of flour will create a subtle flavor, but you can add up to 60 threads for the same amount of flour if you'd prefer a stronger taste."
    },
    {
      "title": "Combine saffron with other flavors as desired.",
      "content": "Combine saffron with other flavors as desired. If you want saffron to serve as the primary flavor in a dish, you'll need to avoid adding other spices, herbs, or aromatics. When mixed with other spices, however, saffron can give dishes an overall deeper flavor. When mixing saffron into dishes flavored with other seasonings, it's best to use only a pinch. Add the saffron early on so that the flavor can blend into the other ingredients more thoroughly. Seasonings frequently paired with saffron include cinnamon, cumin, almond, onion, garlic, and vanilla. For example, you may see this combination in recipes for saffron rice. If you plan to add saffron to meat or vegetable dishes, gravitate toward those based on light meats and vegetables. For example, you could try adding it to a chicken or cauliflower dish."
    },
    {
      "title": "Do your research.",
      "content": "Do your research. While saffron is most commonly used in cooking and baking, it can also be used for medicinal or cosmetic purposes. Research the effects of saffron thoroughly before using it for non-culinary purposes, though. Early research suggests that saffron might be effective as an alternative treatment for Alzheimer’s disease, depression, menstrual discomfort, and premenstrual syndrome. There is little to no research to suggest that saffron is effective against asthma, infertility, psoriasis, digestive trouble, baldness, insomnia, pain, cancer, or other conditions. Avoid taking more than 12 to 20 grams of saffron since such large amounts can actually be toxic. You should also avoid medicinal saffron if you're pregnant or breastfeeding, or if you're suffering from bipolar disorder, low blood pressure, or various heart conditions."
    },
    {
      "title": "Take saffron extract for medicinal purposes.",
      "content": "Take saffron extract for medicinal purposes. Under the guidance of a physician, you could take a pure, high-quality saffron extract to help treat Alzheimer's disease, depression, menstrual discomfort, or premenstrual syndrome. For Alzheimer's disease, take 30 mg per day for 22 weeks to improve symptoms. Note that this will not cure the disease, however. For depression, take 15 to 30 mg per day. Continue for six to eight weeks. Results may be as effective as a low-dose antidepressant in some individuals. For menstrual discomfort, take 500 mg of an extract containing saffron, celery seed, and anise up to three times daily for the first three days of menstruation. For premenstrual syndrome, take 15 mg of an ethanol saffron extract up to twice daily while symptoms last. The effect usually kicks in after two menstrual complete menstrual cycles."
    },
    {
      "title": "Make your skin glow.",
      "content": "Make your skin glow. Topical applications of saffron are traditionally used to lighten, brighten, and clear skin. The exact application procedure will vary based on its intended purpose, though. Use a saffron milk mask to hydrate and soften skin. Soak a pinch of saffron threads in about 4 Tbsp (60 ml) of cold milk for several minutes, then splash the mixture onto freshly cleaned skin. After it dries, wash it away with lukewarm water. To treat acne, crush 5 to 6 basil leaves with 10 to 12 threads of saffron, forming a paste. Apply the paste directly to the acne. After 10 to 15 minutes pass, wash away the paste with cool water. To soften skin over the entire body, sprinkle about 30 threads into very warm bath water. Soak yourself in the water for about 20 to 25 minutes."
    },
    {
      "title": "Drink saffron milk.",
      "content": "Drink saffron milk . Aside from being a tasty beverage, saffron milk is commonly believed to help brighten your complexion when routinely enjoyed several times a week. Boil 2 cups (500 ml) of whole milk over high heat. As soon as the milk boils, add 2 Tbsp (30 ml) sliced almonds, 1/4 tsp (1.25 ml) saffron threads, 1/4 tsp (1.25 ml) ground cardamom, and 1 to 2 Tbsp (15 to 30 ml) of honey. Simmer for 5 minutes. [4] X Research source Enjoy the drink while it's still hot."
    }
  ]
}