{
  "url": "https://www.wikihow.com/Use-Fresh-Turmeric-Root",
  "title": "How to Use Fresh Turmeric for Inflammation",
  "steps": [
    {
      "title": "Rinse off your turmeric with clean water.",
      "content": "Rinse off your turmeric with clean water. Hold your turmeric root over the sink and brush away any obvious dirt or grime. Shake away any extra water so it isn’t dripping wet. [2] X Research source"
    },
    {
      "title": "Use a vegetable peeler to remove the outer skin.",
      "content": "Use a vegetable peeler to remove the outer skin. Hold your fresh turmeric over the sink and work along the edges with a peeler. Try to get rid of all the skin along the outside. Since the root is a little bumpy and uneven, it may be a little tricky to remove all the skin—just do your best! [3] X Research source Peeling turmeric is a very similar process to peeling ginger."
    },
    {
      "title": "Rub the peeled root against a fine, sharp grater.",
      "content": "Rub the peeled root against a fine, sharp grater. Since turmeric is used as a spice, you don’t need to include a lot of it in your dishes and drinks. With this in mind, use a fine grater to collect your fresh root. Rub the peeled end of the turmeric over the grater to sprinkle the spice over your favorite dishes. [5] X Research source"
    },
    {
      "title": "Refrigerate unused root in an unsealed plastic bag for up to 2-3 weeks.",
      "content": "Refrigerate unused root in an unsealed plastic bag for up to 2-3 weeks. Place the turmeric root in a paper towel, then move it into a plastic bag. Transfer the unsealed bag to the crisper drawer in your refrigerator, and try to use it within 2-3 weeks. [6] X Research source"
    },
    {
      "title": "Grate fresh turmeric over soups and other savory dishes.",
      "content": "Grate fresh turmeric over soups and other savory dishes. Heat up a bowl of your favorite soup for lunch or dinner. Before diving in, rinse and peel a section of turmeric root to remove the outer skin, then use a grater to garnish your soup with the spice. You can also sprinkle fresh turmeric over other dishes, like egg or tuna salad. [7] X Research source Fresh turmeric root is a great complement to vegetarian dishes, as well! Try sprinkling some over your favorite tofu dish and see how you like it. Turmeric is especially yummy on vegetable soups."
    },
    {
      "title": "Add a sprinkle of freshly grated turmeric to your scrambled eggs.",
      "content": "Add a sprinkle of freshly grated turmeric to your scrambled eggs. Whip up a batch of your favorite scrambled eggs. In addition to pepper, sprinkle some fresh turmeric in the eggs while they cook. By the time your eggs are scrambled, they’ll have a delicious hint of turmeric. [8] X Research source Pepper and turmeric go very well together."
    },
    {
      "title": "Mix fresh turmeric with pepper and add it to your butter.",
      "content": "Mix fresh turmeric with pepper and add it to your butter. Grate at least 1 tsp (3 g) of fresh turmeric into a bowl of softened butter, along with a small spoonful of pepper. Stir all the ingredients together to make a delicious, aromatic butter. Feel free to use this whenever you sauté or roast vegetables. [9] X Research source This can be a great topping for grilled fish, as well. This is also known as “compound butter.”"
    },
    {
      "title": "Sprinkle a spoonful of fresh turmeric over your mashed potatoes.",
      "content": "Sprinkle a spoonful of fresh turmeric over your mashed potatoes. Prepare your mashed potatoes as you normally, then heap your desired serving onto your plate. Before digging in, take a small section of fresh, peeled turmeric root and grate it over the top of your mashed potatoes. [10] X Research source Start with a small amount to see how you like the flavor."
    },
    {
      "title": "Enhance your roasted veggies with a little fresh turmeric.",
      "content": "Enhance your roasted veggies with a little fresh turmeric. Grate a small amount of fresh, peeled turmeric root on top of any cooked vegetables. Start with a small amount, then add more if you enjoy the flavor a lot! [11] X Research source Turmeric goes well with any kind of roasted vegetable."
    },
    {
      "title": "Whip up a tasty salad dressing with fresh turmeric and olive oil.",
      "content": "Whip up a tasty salad dressing with fresh turmeric and olive oil. Mix 1 ⁄ 4 c (59 mL) of tahini, 3 tablespoons (44 mL) of lemon juice, 2 US tbsp (30 mL) of olive oil, ½ tsp (1.5 g) of turmeric, and ¼ tsp (0.5 g) of cayenne pepper in a bowl. Add in a pinch of salt and regular pepper, then stir all the ingredients together. Pour your new dressing into a vinaigrette container and store it in the refrigerator until you’re ready to use it. [12] X Research source Try to use the dressing within 4 days, or else it may go bad."
    },
    {
      "title": "Top your salad with freshly grated turmeric.",
      "content": "Top your salad with freshly grated turmeric. Prepare your favorite garden or side salad as you normally would. If you’d like your greens to have an extra kick, grate a sprinkling of fresh turmeric over the top of your salad. Feel free to add more if you enjoy the flavor! [13] X Research source Fresh turmeric also tastes great on other veggie side dishes, like mashed butternut squash. [14] X Research source"
    },
    {
      "title": "Brew turmeric with ginger to make an aromatic tea.",
      "content": "Brew turmeric with ginger to make an aromatic tea. Pour some boiling water into a mug, then grate in a small spoonful of fresh ginger and turmeric root. Set a timer for 3-5 minutes to let the tea steep before enjoying the beverage. [15] X Research source If you prefer sweeter tea, try adding in some sugar or honey."
    },
    {
      "title": "Sprinkle some turmeric into your favorite smoothie.",
      "content": "Sprinkle some turmeric into your favorite smoothie. Prepare your favorite smoothie as you usually would by adding the ingredients into a blender. Before you mix everything together, sprinkle a spoonful or so of fresh turmeric root on top. Place the lid on the blender, then pulse all the ingredients into a smoothie. [16] X Research source Start with small amounts of turmeric at first. You don’t want to overpower your smoothie!"
    },
    {
      "title": "Make some aromatic “golden milk” with turmeric and cardamom.",
      "content": "Make some aromatic “golden milk” with turmeric and cardamom. Pour 1 c (240 mL) of soy milk into a saucepan, then add in a handful of peppercorns, cardamom pods, and a cinnamon stick. Grate a pinch of fresh ginger and turmeric root over the milk and spices. Let the ingredients steep for 3-5 minutes, then strain the milk into a glass. [17] X Research source As a finishing touch, stir a squeeze of honey into your milk."
    },
    {
      "title": "Whip up an anti-inflammatory drink with turmeric and coconut water.",
      "content": "Whip up an anti-inflammatory drink with turmeric and coconut water. Mix 3 c (710 mL) of coconut water, ½ cup (25 g) of ginger slices, 6 mint sprigs, 1 ⁄ 4 c (59 mL) of lemon juice, 1 tbsp (9 g) of turmeric, ¼ tsp (2 g) of cardamom, ⅛ tsp (0.6 g) of sea salt, and ⅛ tsp (0.3 g) of cayenne or black pepper into a blender. Pulse the ingredients together until they’re a smooth, even consistency, then pour the drink into a cup. Transfer the drink to a pitcher or portable cup and pour a splash of coconut water on top of the drink. Place the drink in the refrigerator overnight so it can chill, then enjoy it the next day! You can also add 2 tsp (9.9 mL) of raw honey and 1 ⁄ 4 c (59 mL) of coconut milk to make your drink sweeter and creamier."
    }
  ]
}