{
  "url": "https://www.wikihow.com/Switch-Cells-in-Excel",
  "title": "How to Switch Cells in Excel",
  "steps": [
    {
      "title": "Open your document in Excel.",
      "content": "Open your document in Excel. You can find this program in your Start menu or Applications folder. You can either open your document from Excel by clicking Open from the File tab, or you can right-click the file in your file browser and click Open With . The cells have to be touching for this to work; for example, you can switch the info in cells A4 and B4. You can not, however, switch the information in A1 and G150."
    },
    {
      "title": "Click the cell you want to switch.",
      "content": "Click the cell you want to switch. The cell will highlight to show it has been selected."
    },
    {
      "title": "Press and hold ⇧ Shift and click the cell you want to switch with.",
      "content": "Press and hold ⇧ Shift and click the cell you want to switch with. The cursor will change to a 工 to indicate it will swap information."
    },
    {
      "title": "Release ⇧ Shift.",
      "content": "Release ⇧ Shift . The information in the cells will switch. [1] X Research source"
    },
    {
      "title": "Open your document in Excel.",
      "content": "Open your document in Excel. You can find this program in your Start menu or Applications folder. You can either open your document from Excel by clicking Open from the File tab, or you can right-click the file in your file browser and click Open With . In this method, you will switch your rows with your columns."
    },
    {
      "title": "Select the entire data range you want to rotate.",
      "content": "Select the entire data range you want to rotate. You can click and hold down the mouse button and drag over the cells to select the entire range."
    },
    {
      "title": "Press Ctrl+C (Windows) or ⌘ Cmd+C (Mac).",
      "content": "Press Ctrl + C (Windows) or ⌘ Cmd + C (Mac). The selection will be outlined with a broken line to indicate it has been copied."
    },
    {
      "title": "Select a cell in a blank area.",
      "content": "Select a cell in a blank area. When you paste your cells, you don't want to paste over any data you might need."
    },
    {
      "title": "Click the arrow under Paste.",
      "content": "Click the arrow under Paste . You'll find this in the \"Home\" tab of the editing ribbon above your document."
    },
    {
      "title": "Click Paste Special….",
      "content": "Click Paste Special… . This is at the bottom of the drop-down menu."
    },
    {
      "title": "Click the box to select it next to Transpose.",
      "content": "Click the box to select it next to Transpose. The box will fill with a checkmark to indicate it has been selected."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . The information you copied in the previous step will paste with the information transposed. [2] X Research source"
    },
    {
      "title": "Download and install Kutools from https://www.extendoffice.com/download/kutools-for-excel.html.",
      "content": "Download and install Kutools from https://www.extendoffice.com/download/kutools-for-excel.html . You can try Kutools for 60 days before purchasing the license for $39.00. The program does not work with Macs."
    },
    {
      "title": "Open your document in Excel.",
      "content": "Open your document in Excel. You can find this program in your Start menu or Applications folder. You can either open your document from Excel by clicking Open from the File tab, or you can right-click the file in your file browser and click Open With ."
    },
    {
      "title": "Click the Kutools tab.",
      "content": "Click the Kutools tab. You'll find this in the ribbon above your document."
    },
    {
      "title": "Click Range and click Swap Ranges.",
      "content": "Click Range and click Swap Ranges . You'll find this button on the left of the Kutools menu."
    },
    {
      "title": "Click the first cell-range icon that looks like a red arrow pointing to a blue cell.",
      "content": "Click the first cell-range icon that looks like a red arrow pointing to a blue cell. You'll find this under the header \"Swap Range 1\"."
    },
    {
      "title": "Click to select your first cell or cell range.",
      "content": "Click to select your first cell or cell range. The cells on your document will be highlighted to indicate they are selected."
    },
    {
      "title": "Click the second cell-range icon that looks like a red arrow pointing to a blue cell.",
      "content": "Click the second cell-range icon that looks like a red arrow pointing to a blue cell. You'll find this under the header \"Swap Range 2\"."
    },
    {
      "title": "Click to select your second cell or cell range.",
      "content": "Click to select your second cell or cell range. The cells on your document will be highlighted to indicate they are selected. The cells or cell ranges you have selected will switch information."
    },
    {
      "title": "Click Ok.",
      "content": "Click Ok . The information in the selected cells will switch. [3] X Research source"
    }
  ]
}