{
  "url": "https://www.wikihow.com/Support-Someone-Stuck-in-a-Controlling-Relationship",
  "title": "How to Support Someone Stuck in a Controlling Relationship",
  "steps": [
    {
      "title": "Set up a time to talk in person.",
      "content": "Set up a time to talk in person. Choose a private, safe location. Avoid having the conversation over text or email, as the person’s partner may have access to their computer and phone. Avoid making a big deal of this conversation beforehand, or your friend (or their partner) may be suspicious of your motives. Just say something like, “Hey, I miss you. Can we get together sometime soon for a chat?”"
    },
    {
      "title": "Express your concern.",
      "content": "Express your concern. Once you’re together in a private place, tell your friend or family member that you’re worried about them. Back up your concern with specific things you’ve observed about their relationship. [1] X Research source For instance, say, “I’ve noticed that Joe puts you down whenever you talk about looking for a better job. That doesn’t seem very healthy or supportive.” Don't hesitate to continue expressing your concern in future meetings if the problem continues."
    },
    {
      "title": "Avoid attacking the character of the person’s partner.",
      "content": "Avoid attacking the character of the person’s partner. Your friend or family member may love their partner, despite their flaws. If you talk about what a terrible person you think their partner is, they could get defensive and shut down the conversation. Don’t criticize the person for staying with their partner, either. They won’t want to talk to you if they feel judged. Instead of saying, “Jane is bad news. I can’t believe you let her dictate your schedule,” say something like, “I’ve noticed that Jane doesn’t want you to see your friends on the weekends anymore. How do you feel about that?”"
    },
    {
      "title": "Listen to what your friend or family member tells you.",
      "content": "Listen to what your friend or family member tells you. Let the other person steer the conversation. Try to suspend your judgment of their relationship, and don’t interrupt them. Instead, focus on understanding what they have to say. Take the person seriously, no matter what they tell you. They understand their relationship better than anyone else does. Ask good follow-up questions to make sure you’re understanding them fully. Try, \"So, what you're saying is you feel like you have to stay even though you are unhappy?\" Reassure the person that any abusive behavior they’re experiencing is not their fault. “Don’t beat yourself up about this. I know that’s easier said than done, but this is her fault, not yours.”"
    },
    {
      "title": "Offer to help your friend or family member however you can.",
      "content": "Offer to help your friend or family member however you can. Ask them what they need. Let them know that you’re there for them and want to support them. Don’t make assumptions about what your friend or family member wants or needs. Let them tell you what kind of support is best. This kind of conversation may have to take place on numerous occasions over time. Just be steady rather than pushy. Your friend or family member may not be ready to leave their relationship. If that’s the case, let them know that you’ll still be there to help them if and when they ever need anything."
    },
    {
      "title": "Help the person find resources for dealing with their situation.",
      "content": "Help the person find resources for dealing with their situation. Find some reading materials about controlling relationships, locate counselors in your area, and track down the numbers of some helpful hotlines. Share these resources with your friend or family member. Do not give the person pamphlets or books to read unless they have a safe, private place to keep them. Likewise, don’t send them information online unless their partner does not have access to their computer and phone."
    },
    {
      "title": "Offer to help the person leave the relationship.",
      "content": "Offer to help the person leave the relationship. Many people stay in their controlling relationships because leaving is too logistically difficult. If your friend or family member wants to leave but doesn’t know how, offer to keep their personal items at your house, give them rides to counseling appointments, or let them stay with you while they look for an apartment. Don’t promise more than you can realistically give. Once you make the offer, the other person will depend on you to follow through."
    },
    {
      "title": "Remain supportive even if the person doesn’t leave right away.",
      "content": "Remain supportive even if the person doesn’t leave right away. Sometimes it takes a long time for a person who’s being abused to work up the courage to leave their partner. Remain available and supportive for your friend or family member, even if it’s painful to see them in a bad relationship. [2] X Research source Your ongoing support and willingness to listen may mean more to the other person than you realize. Avoid pressuring the person to leave their partner, or they may turn away from you. If they leave, it has to be their own choice."
    },
    {
      "title": "Notice patterns of isolation.",
      "content": "Notice patterns of isolation. A controlling person often discourages or forbids their partner from spending time with others. They may speak badly of their partner’s friends and family or act jealous when their partner sees other people. [3] X Research source If your friend or family member has become less and less available after getting together with their partner, it could be a warning sign that their partner is trying to isolate them. If the person tells you their partner doesn’t approve of their friends or social life, it could be another red flag."
    },
    {
      "title": "Be alert for excessive criticism.",
      "content": "Be alert for excessive criticism. Controlling people try to gain the upper hand over their partner by breaking down their self-esteem. One way they do this is by criticizing their partner’s appearance, personality, or abilities. Criticism may be overt, or it may take the form of backhanded compliments or hurtful “jokes.” [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Notice if the person’s partner says things like “You’d look so great if you lost some weight” or “Why are you going back to school? You were no good at school before.”"
    },
    {
      "title": "Keep an eye out for manipulative behavior.",
      "content": "Keep an eye out for manipulative behavior. Does the person’s partner get them to do things they normally wouldn’t do? Using guilt, threats, or pressure to control a partner’s behavior is a common tactic in unhealthy relationships. [5] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source If your friend or family member has been acting out of character lately, consider whether their partner might have something to do with it. Statements like “If you ever left me, I’d probably kill myself” or “I do all these things for you, and then you repay me by making your own plans and leaving me alone” are giveaways of a manipulative relationship. Be aware that your friend's safety or even life might be threatened, and they could be unwilling to disclose that. The harder it is for them to make contact with you, the more serious the situation may be."
    },
    {
      "title": "Notice if your friend’s partner is suspicious or nosy.",
      "content": "Notice if your friend’s partner is suspicious or nosy. Controlling partners always want to know what the other person is doing and with whom. If your friend or family member has to call their partner frequently to check in, or if they have to get their partner’s permission to make plans with other people, the relationship is probably unhealthy. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Another major red flag is if the person’s partner reads their text and email conversations."
    }
  ]
}