{
  "url": "https://www.wikihow.com/Speak-Old-English",
  "title": "How to Speak Old English",
  "steps": [
    {
      "title": "Learn the vowel sounds.",
      "content": "Learn the vowel sounds. Old English vowels are quite different from Modern English, and it's important to pronounce them as distinctly as you can. Many words change meaning if you mispronounce the vowel, even if it sounds like the same letter in Modern English. Here's the list, with examples from the Mid-Atlantic American accent: [1] X Research source a as in father; [ɑ] in the international phonetic alphabet æ as in cat [æ] e as in fate [e] i as in feet [i] o as in boat [o] u as in tool [u] y as in the German über or French tu [y]. Move your lips as though you were saying \"oo,\" but make an \"ee\" sound instead."
    },
    {
      "title": "Learn special consonants.",
      "content": "Learn special consonants. Most Old English consonants are pronounced the same as they are in Modern English. Here are the exceptions: [2] X Research source The letters Ð ð (\"eth\") and Þ þ (\"thorn\") are used for \"th.\" These are interchangable; replacing an ð with þ does not change the meaning, and either can be pronounced as in \"that\" or \"thin,\" depending on the word. h is pronounced with a throaty rasp, as in Scottish \"loch.\" c is pronounced sometime as a k, and sometimes as a ch as in chin. Some texts write the \"ch\" pronunciation as ċ , a c with a dot over it. g is pronounced sometimes as the g in goal, and sometimes as the y in yes. The y pronunciation is sometimes written with a dot over it, ġ ."
    },
    {
      "title": "Follow vowel length if possible.",
      "content": "Follow vowel length if possible. Texts meant for students will mark \"long\" vowels with a dash (ā), and leave short vowels unmarked. This literally refers to the length of time you pronounce the vowel. The pronunciation guide above applies to both long and short vowels; just hold the longer one for a moment. Using the wrong type of vowel can change the meaning of the word. [3] X Research source If this is too difficult for you, you can use a less accurate pronunciation that follows a more Modern English style of short and long vowels. For example, pronounce a short e as in \"bet\" and a long ē as in \"fate.\" If your text does not mark vowel length, you can look up the word in an Old English dictionary to find a pronunciation guide."
    },
    {
      "title": "Pronounce double consonants.",
      "content": "Pronounce double consonants. When you see the same consonant written twice, pronounce it twice, \"sticking\" on the sound to use it as the end of one syllable as well as the beginning of the next syllable. Try saying \"big gun\" or \"hat trick\" in English to get a feel for this sound. [4] X Research source"
    },
    {
      "title": "Practice simple words.",
      "content": "Practice simple words. You've already learned all you need to know to pronounce the letters in this word. Here are some words to read, pronunciations in Mid-Atlantic American dialect, and definitions: hām (khaawm): home læn (lan): loan (short ae) nædre (naad-rey): snake (long ae ) pipor (pee-poar): pepper slīm (sleeem): slime snoru (snoa-roo): daughter-in-law rūh (roookh): shaggy mys (mös): mouse (long y)"
    },
    {
      "title": "Practice your f, s and ð/þ sounds.",
      "content": "Practice your f, s and ð/þ sounds. At the beginning or end of words, these are pronounced \"unvoiced\" as in father, sight, and thick. When they show up between vowels or other voiced sounds, these are \"voiced,\" pronounced as in vulture, zoo, and that. If you haven't guessed it already, any sound made with your vocal chords is \"voiced,\" and any sound made with just an airy breath is \"voiceless.\" Try these examples: fēdan (feey–dan): to feed lufu (loo–voo): love slīdan (sleee–dan): to slide mēsan (meey–zan): a dining table pæð (paath): path (pronounce th as in path) leðer (ley–theyr): leather ( pronounce th as in leather)"
    },
    {
      "title": "Learn your g and c sounds.",
      "content": "Learn your g and c sounds. As mentioned earlier, g and c can be pronounced in different ways. It's not always possible to tell which pronunciation to use without looking it up, but here's a guide that works for many words: [5] X Research source C is usually a \"k\" sound before a consonant, or when next to a back vowel (a, æ, o, u, y): clif (kleef) = cliff; staca (sta-ka) = stake; cū (kooo) = cow C is usually a \"ch\" sound when next to a front vowel (i or e): brēc (breeych) = breeches; ceris (chey–rees) = cherry. G is usually a hard \"g\" sound before a consonant, before a back vowel (a, æ, o, u, y), and after n: grund (groond) = ground; gāt (gaat) = goat; þing (theeng) = thing. G is usually a \"y\" next to a front vowel (i or e): bodig (boa–dee-y) = body; segel (sey-yeyl) = sail; gingra (yeen–gra) = younger. G following a back vowel or consonant (besides n) is pronounced as [ɣ], a sound that no longer exists in English. Just use the sound \"wa\" for now, or practice raising your tongue in a \"k\" position while saying \"ch\" as in \"loch.\""
    },
    {
      "title": "Learn cg and sc.",
      "content": "Learn cg and sc. These are practically the only combinations of letters that change sound when put together. Any other combination of consonants (no matter how difficult it seems!) is pronounced as it looks. Here are the two exceptions: [6] X Research source CG is pronounced as the dg in edge: hrycg (khrödg) = ridge SC is pronounced as the sh in show: scinu (shee-noo) = shin"
    },
    {
      "title": "Read texts aloud.",
      "content": "Read texts aloud. Few people can hold a conversation in Old English. Reading aloud is the first stage to learning spoken Old English, and as close as most students get. You can find texts in Old English at sacred-texts.com , but a physical student text with long vowel marks and an English translation will be easiest to follow. Here's your first snippet, the opening lines of Beowulf: Hwæt! We Gar-Dena in gear-dagum / þeod-cyninga, þrym gefrunon / hu ða æþelingas ellen fremedon! \"Yo! We have heard tell of the majesty of the Speardanes, of the Folk-kings, how the princes did valorous deeds.\" [7] X Research source Search for Beowulf recitations online to see whether you have the right pronunciation."
    },
    {
      "title": "Learn more vocabulary.",
      "content": "Learn more vocabulary. Order an Old English to Modern English dictionary from an online bookstore, and use it to work your way through an Old English text. Study the vocabulary as you would a foreign language. [8] X Research source You can also use online dictionaries, such as the Bosworth-Toller Anglo-Saxon Dictionary, or the John R. Clark Hall dictionary. Due to copyright reasons, almost all of these are from the 19th and early 20th century. These will work fine, but they may not always agree with a more modern dictionary that benefits from another hundred years of scholarship."
    },
    {
      "title": "Listen to spoken Old English.",
      "content": "Listen to spoken Old English. Search for online videos of scholars reciting Old English texts, such as Beowulf or the Exeter Book. Repeat what they say to practice Old English sounds, and make the poetry feel more alive. Many videos will not perfectly match what you learned here. Different scholars and linguists have different ideas about how Old English would have been spoken. There is also variation between different regions or time periods of Old English, and usually some hints of the reader's original accent."
    },
    {
      "title": "Learn grammar.",
      "content": "Learn grammar. This guide has not even begun to touch on how to put an original sentence together, or how to translate a passage. This is a massive topic that's best left to a longer book. Look for a beginner's guide to Old English if you want to become a true student of the language. [9] X Research source Here's one basic difference between Old and Modern English: Old English uses \"declensions\" instead of word order. [10] X Research source This means the ending of every noun changes to show where it belongs in the meaning of the sentence. If you can't find a word in the dictionary, look for a word that looks similar, but has a different ending."
    },
    {
      "title": "Find a partner to practice with.",
      "content": "Find a partner to practice with. Learning to speak a language is very hard when you have no one to speak it to. For a dead language like Old English, it can be tricky to find a partner. Your best chance might be searching for other students online. University students in England working toward English degrees often learn Old English. There are also Old English communities on social media and video-sharing sites. Join them and ask for help finding resources."
    }
  ]
}