{
  "url": "https://www.wikihow.com/Treat-a-Human-Bite",
  "title": "How to Treat a Human Bite",
  "steps": [
    {
      "title": "Ask for the biter’s medical history.",
      "content": "Ask for the biter’s medical history. If it’s possible, ask the person who bit you for their medical history. You want to make sure they have current vaccinations and do not have other serious medical conditions such as hepatitis. This can help your figure out if you should see a doctor and what type of treatment is the best for you. If you can’t get the medical history of the person who bit you, administer first aid and then see your doctor. The two diseases of highest concern are hepatitis B and tetanus. Though they don’t occur with every bite, hepatitis and tetanus can develop, especially with infected bites. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Transmission of HIV or hepatitis B during a bite incident is not likely but it can happen. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If the biter is unknown, testing for HIV can provide peace of mind for the person who was bitten."
    },
    {
      "title": "Evaluate the wound.",
      "content": "Evaluate the wound. As soon as you experience a human bite wound, inspect the site of the bite mark. Evaluate the severity of the wound and try to determine the best course of treatment. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Remember that all human bites are serious. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Human bites can range from everything from deep flesh bites from a fight or other situation, to something like a tooth scraping on your fingers or knuckles. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If a human bite breaks your skin, you’ll need to see a doctor and get medical care in addition to administering first aid. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Stop any bleeding.",
      "content": "Stop any bleeding. If your wound is bleeding, apply pressure with a clean and dry cloth or bandage. Don’t administer any other first aid until you get control of any bleeding so that you don’t lose too much blood. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can lie down on a rug or bed if the bleeding is severe to help prevent you from losing body heat and going into shock. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you bleed through a bandage or cloth, don’t remove it to apply another. Simply place the new bandage on top of the wound until it stops bleeding. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If there is anything in the wound, such as tooth fragments, don’t apply too much pressure or attempt to remove the object. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Wash the wound.",
      "content": "Wash the wound. Once you’ve got any bleeding stopped, wash the wound with soap and water. This can help remove any bacteria and may minimize the risk for infection. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You don’t need to purchase any special soap; any soap will help to remove bacteria. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Make sure to wash and dry the wound thoroughly, even if it is painful. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Wash the wound until there is no visible soap or until any debris such as dirt is washed away. You may also use povidone iodine as an antibacterial treatment instead of soap and water. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can apply the iodine either directly to the wound or with a bandage. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Do not remove any embedded debris such as tooth particles because this could spread infection. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Apply an antibiotic ointment to the affected area.",
      "content": "Apply an antibiotic ointment to the affected area. Applying an antibiotic ointment or cream can help prevent infection. It may also help to reduce swelling and pain and enhance the healing. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can use anti-biotic ointments such as neomycin, polymyxin B, bacitracin to prevent infection. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source These are available at most drug and grocery stores and their online retail sites."
    },
    {
      "title": "Cover the wound with a clean bandage.",
      "content": "Cover the wound with a clean bandage. Apply a new bandage that is clean or sterile and dry once the wound is not bleeding and disinfected. This may limit exposure to bacteria and help prevent infection. [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Watch for symptoms of infection.",
      "content": "Watch for symptoms of infection. If your bite is not very large and/or you decide to not seek medical treatment, it’s important to watch the wound for signs of infection. This can help prevent serious medical problems including sepsis. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If your wound is red, hot to the touch, and very painful this is a sign of infection. [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Other symptoms of infection are fever and chills. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you experience any of these symptoms, it’s important to consult a medical professional so that you don’t develop a severe infection or other serious medical condition. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "See your doctor.",
      "content": "See your doctor. If the bite broke the skin or doesn’t heal with first aid, see your doctor as soon as possible. You may require more in-depth treatment than what you can do at home, which can minimize your risk for infection or nerve damage. [26] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source It’s important to see your doctor if a human bite breaks your skin, as it can very easily become infected. [27] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You should seek treatment for a broken skin wound within 24 hours. [28] X Research source If your wound doesn’t stop bleeding or the bite has removed significant tissue, seek help at an emergency room. [29] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have any concerns even about the smallest bite or scrape from a human mouth, talk to your doctor. [30] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Tell your doctor how you got the bite. This might help him with your treatment or getting help if it involved violence. [31] X Research source Your doctor will measure the wound and take notes on presentation including location or if you appear to have nerve or tendon damage. [32] X Research source Depending on the severity of the bite, your doctor may order blood tests or X-rays. [33] X Research source"
    },
    {
      "title": "Allow your doctor to remove any foreign objects in the wound.",
      "content": "Allow your doctor to remove any foreign objects in the wound. If there are any foreign objects in your bite wound, such as teeth, your doctor will remove them. This can help minimize your risk of infection and may relieve any pain you have. [34] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Have a plastic surgeon stitch the wound if it is on your face.",
      "content": "Have a plastic surgeon stitch the wound if it is on your face. If you have a significant bite mark on your face, your doctor should enlist the help of a plastic surgeon to stitch the wound so it will heal properly, with minimal scarring. It’s not uncommon for stitches to itch. If this is the case, you can use a light layer of antibiotic ointment to relieve itching and help prevent infection. [35] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take an antibiotic to combat infection.",
      "content": "Take an antibiotic to combat infection. Your doctor may prescribe one of several different antibiotics for a human bite wound. These can minimize your risk of developing an infection. Your doctor may prescribe one of the following antibiotics to combat infection: cephalosporin, penicillin, clindamycin, erythromycin, or aminoglycosides. [36] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Antibiotic treatment usually lasts between three to five days. [37] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If there is an infection, it may be necessary to follow up with a longer course of treatment, up to six weeks. [38] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Get a tetanus shot.",
      "content": "Get a tetanus shot. If you haven’t had a tetanus shot within five years, your doctor may prescribe a booster shot. This can help prevent the infection that causes tetanus, or lockjaw. [39] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Make sure to tell your doctor the date of your last tetanus shot or if you’ve never had one. Tetanus is a potentially fatal infection. [40] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you know the medical history of the person who bit you, a tetanus shot may not be necessary. [41] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Test for disease transmission.",
      "content": "Test for disease transmission. If your biter’s medical history is unknown to you, your doctor may test for the transmission of diseases such as HIV and hepatitis B at regular intervals. This can not only identify possible infection, but also put your mind at ease. [42] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It is very unlikely you will contract any disease such as HIV, hepatitis B, or herpes from a human bite. [43] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Use pain medication.",
      "content": "Use pain medication. It’s normal to have pain for a few days following the a bite wound. Use either over the counter pain relievers or a prescription pain medication to help alleviate pain and some swelling. Take over the counter pain relievers such as ibuprofen or acetaminophen. Ibuprofen may also help alleviate some of the swelling associate with the surgery. Your doctor may prescribe a pain medication if over the counter pain relief doesn’t work for you. [44] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Repair damages with plastic surgery.",
      "content": "Repair damages with plastic surgery. If you had an extremely severe bite that resulted in the loss of tissue, your doctor may suggest plastic surgery. This can repair your skin to its earlier state with little scarring."
    }
  ]
}