{
  "url": "https://www.wikihow.com/Trivia-Categories",
  "title": "25 Fun & Unique Trivia Categories For Your Next Game Night",
  "steps": [
    {
      "title": "Single-Named Singers",
      "content": "Single-Named Singers Have you noticed that there are a ton of musicians who go by a singular name rather than a first and last name? There are way more of them than you might think, and this makes for a very fun and unique trivia category! Here are some example questions: [1] X Research source Question: This single-named British singer names her albums based on the age she was when she wrote them ( 19, 21, 25, and 30 ). Who is she? Answer: Adele. Question: This single-named rapper was the third woman ever to win the Grammy for Best Rap Album. Who is she? Answer: Doechii. Question: This single-named singer was the frontman of The Police, and his name may remind you of a bumblebee. Who is he? Answer: Sting. Question: This single-named singer from Barbados is actually named Robyn Fenty. Who is she? Answer: Rihanna. Question: This single-named singer is known for hits like “Hips Don’t Lie” and “She Wolf.” Who is she? Answer: Shakira. Question: This single-named rapper is also known by his nickname, “Slim Shady.” Who is he? Answer: Eminem. Question: This single-named singer’s real name is Ella Marija Lani Yelich-O’Connor. Who is she? Answer: Lorde. Question: This single-named singer is the frontman of the band U2. Who is he? Answer: Bono. Question: This single-named singer and actress recorded the song “All For Us” for her HBO show, Euphoria . Who is she? Answer: Zendaya. Question: This single-named singer is the most awarded person in Grammy history. Who is she? Answer: Beyoncé ."
    },
    {
      "title": "Historic Firsts",
      "content": "Historic Firsts There’s a first time for everything under the sun, so why not create a trivia category centered around important firsts? It will appeal to history buffs, but it’s a little more unique and interesting than the general history category you’d usually find at trivia events. Here are some examples: Question: Who was the first person to walk on the moon? Answer: Neil Armstrong. Question: Who was the first woman to complete a transatlantic flight? Answer: Amelia Earhart. Question: Who was the first emperor of Rome? Answer: Augustus. Question: Who was the first female artist to be inducted into the Rock and Roll Hall of Fame? Answer: Aretha Franklin. Question: Who was the first musician to win 4 Album of the Year Grammys? Answer: Taylor Swift. Question: Who was the first U.S. president to resign from office? Answer: Richard Nixon. Question: Who was the first African American performer to win an Academy Award? Answer: Hattie McDaniel. Question: What was the first book that was mass-printed in Europe? Answer: The Gutenberg Bible. Question: In what year was the first iPhone released? Answer: 2007. Question: Who was the first person to sign the Declaration of Independence? Answer: John Hancock. [2] X Research source"
    },
    {
      "title": "Fictional Locations",
      "content": "Fictional Locations This trivia category is super whimsical and entertaining. Fictional worlds show up in all types of popular media, from movies to TV shows to books, so the category is bound to appeal to a wide range of participants. Here are some example questions to inspire you: Question: When Dorothy Gale arrives in this strange two-letter land, she knows she isn’t in Kansas anymore. What fictional location is this? Answer: Oz. Question: The novel The Hunger Games takes place in a dystopian country sometime in the future. What fictional location is this? Answer: Panem. Question: In the Lord of the Rings trilogy, Frodo must journey to this terrifying place to destroy the One Ring. What fictional location is this? Answer: Mordor. Question: In the classic children’s story Peter Pan , Peter and the Darling siblings journey to this fantastical land. What fictional location is this? Answer: Neverland. Question: In C.S. Lewis’s classic book The Lion, the Witch, and the Wardrobe , the Pevensie siblings discover a portal to a magical world in the back of a wardrobe. What fictional location is this? Answer: Narnia. Question: Anna and Elsa are royal sisters in this imaginary kingdom from Disney’s Frozen . What fictional location is this? Answer: Arendelle. Question: The TV show Game of Thrones is about the fight for control of an imaginary continent. What fictional location is this? Answer: Westeros. Question: This imaginary location from the Harry Potter series is where new Hogwarts students go to purchase school supplies. What fictional location is this? Answer: Diagon Alley. Question: This fictional town is the setting of the TV show Gilmore Girls. What fictional location is this? Answer: Stars Hollow. Question: This crime-ridden imaginary city is the home of Batman. What fictional location is this? Answer: Gotham City."
    },
    {
      "title": "Iconic Villains",
      "content": "Iconic Villains If we’re honest with ourselves, villains are often the most compelling characters in books, TV shows, and movies, and they linger with us long after we finish watching or reading. Because of this, an Iconic Villains trivia category is sure to be a hit at any trivia event! Book lovers, TV fans, and movie buffs alike will be able to score some points for their teams with fun questions like these: Question: This TV villain is known for the iconic line, “When you play the game of thrones, you win or you die.” Who is she? Answer: Cersei Lannister. Question: This book and movie villain’s real name is Tom Marvolo Riddle. Who is he? Answer: Lord Voldemort. Question: This Disney villain is known for singing “Poor Unfortunate Souls.” Who is she? Answer: Ursula. Question: This iconic sci-fi villain ends up being the father of the story’s hero. Who is he? Answer: Darth Vader. Question: This Broadway-loving villain tries to sabotage her classmates so she can get the lead role in the spring musical. Who is she? Answer: Sharpay Evans. Question: This villain erased half the population in Avengers: Infinity War , an event that came to be known as “the Blip” or “the Snap.” Who is he? Answer: Thanos. Question: This terrifying clown terrorizes the children of Derry, Maine in the movie IT . Who is he? Answer: Pennywise. Question: This supervillain is the arch-nemesis of Superman. Who is he? Answer: Lex Luthor. Question: This iconic villain is the editor-in-chief of the fictional magazine Runway in The Devil Wears Prada. Who is she? Answer: Miranda Priestly. Question: This complicated villain possessed the One Ring before it fell into the hands of Bilbo Baggins. Who is he? Answer: Gollum."
    },
    {
      "title": "Animal Kingdom",
      "content": "Animal Kingdom Animal lovers and science experts will likely love this category, which features tricky questions about various animals in the world. If you want to include some biology or science-based questions, but a general science category seems a little too dry to you, this is an amazing alternative! Here are some examples: Question: What is a group of crows called? Answer: A murder. Question: What is the largest mammal on Earth? Answer: The blue whale. Question: What is the only mammal that can fly? Answer: A bat. Question: What is a female fox called? Answer: A vixen. Question: How many bones does a shark have? Answer: Zero. Question: Which animal causes the most deaths worldwide? Answer: Mosquitos. [3] X Research source Question: What is the fastest land animal? Answer: Cheetah. Question: What is a group of porcupines called? Answer: A prickle. Question: What is an animal that only eats meat called? Answer: A carnivore. Question: What is a baby kangaroo called? Answer: A joey. [4] X Research source"
    },
    {
      "title": "Songs About Locations",
      "content": "Songs About Locations Many musicians have penned hit songs inspired by specific cities, countries, and even continents, so there are a ton of fun trivia questions you can come up with based on this. This trivia category is similar to the general music categories you may have encountered at trivia events, but it’s a little more exciting since it has a more unique angle. Question: This song about a U.S. state starts with the lyric, “All the leaves are brown and the sky is grey.” What song is it? Answer: “California Dreamin’” by the Mamas & Papas. Question: This classic country song features a fiddle-playing contest between the devil and a man named Johnny. What song is it? Answer: “The Devil Went Down to Georgia” by Charlie Daniels. Question: This song about a U.S. city appeared on an album called Illinois. What song is it? Answer: “Chicago” by Sufjan Stevens. Question: This hit 2018 pop song was named after the capital of Cuba. What song is it? Answer: “ Havana” by Camila Cabello. Question: This classic 70’s track is about a place that you can check out of anytime, but you can never leave. What song is it? Answer: “Hotel California” by the Eagles. Question: This song about a U.S. city starts with the lyric, “Start spreading the news, I’m leaving today.” What song is it? Answer: “New York, New York” by Frank Sinatra. Question: This thought-provoking rap song about a country won both Song of the Year and Record of the Year at the 2019 Grammys. What song is it? Answer: “This Is America” by Childish Gambino. Question: This song named after a European city starts with the lyric, “Slow down, you crazy child.” What song is it? Answer: “Vienna” by Billy Joel. Question: This 2008 pop song is about a wild night in Sin City. What song is it? Answer: “Waking Up in Vegas” by Katy Perry. Question: This song about a continent is by a band with the same name as Dorothy’s dog in The Wizard of Oz . What song is it? Answer: “Africa” by Toto."
    },
    {
      "title": "Early 2000s Pop Culture",
      "content": "Early 2000s Pop Culture Trivia events often include categories based on a specific decade in history. If you’re hosting your own trivia party at home or participating in the planning for a pub trivia night, an Early 2000s category is a great option to consider. Chances are that several of your participants were children or teens in the early 2000s, so the category is a fun and nostalgic opportunity for them to score some points! Question: Beyoncé started her solo career with her 2003 album Dangerously In Love. Which girl group was she a part of before this? Answer: Destiny’s Child. Question: What reality TV show did Paris Hilton and Nicole Richie star in? Answer: The Simple Life. Question: Who was the villain in 2001’s Shrek ? Answer: Lord Farquad. Question: Britney Spears performed with a giant yellow python around her shoulders at the MTV Video Music Awards in 2001. What song was she singing? Answer: “I’m a Slave 4 U.” Question: Which A-list actor famously jumped up and down on Oprah’s couch when talking about his new romantic relationship? Answer: Tom Cruise. Question: Which actor, musician, and dancer caused a stir when she wore a plunging green Versace dress to the Grammy Awards in 2000? Answer: Jennifer Lopez. Question: Tyra Banks coined this term, which means “smiling with your eyes,” on her reality show America’s Next Top Model. What is the term? Answer: Smize/Smizing. Question: What was the name of the infomercial product that was a hair clip meant to create more volume at the back of someone’s head? Answer: Bumpits. Question: This singer was unfortunately caught lip-synching during her Saturday Night Live performance in 2004. Who is she? Answer: Ashlee Simpson. Question: Which rapper interrupted Taylor Swift on stage as she tried to accept the award for Best Female Video in 2009? Answer: Kanye West."
    },
    {
      "title": "Witches and Wizards",
      "content": "Witches and Wizards Magical people have played an important role in stories throughout history, from folktales about King Arthur to modern franchises like Harry Potter . This makes for a very eclectic and wide-ranging trivia topic that’s sure to be a hit at any trivia night. Here are some sample questions: Question: This witch was known as “the good witch” in The Wizard of Oz . Who is she? Answer: Glinda. Question: This wizard was an advisor to King Arthur. Who is he? Answer: Merlin. Question: This witch was known as “the brightest witch of her age” in the Harry Potter series. Who is she? Answer: Hermione Granger. Question: This witch cursed the baby Aurora in Sleeping Beauty . Who is she? Answer: Maleficent. Question: These witch sisters terrorize Salem, Massachusetts in this classic children’s Halloween movie. Who are they? Answer: The Sanderson sisters. Question: This wizard goes from being called “_____ the Grey” to “ ____ the White” in The Lord of the Rings. Who is he? Answer: Gandalf. Question: This witch has a black cat named Salem. Who is she? Answer: Sabrina Spellman. Question: This witch is grandmother to three grandchildren and lives in a magical land called Halloweentown. Who is she? Answer: Aggie Cromwell. Question: This wizard teaches Potions at Hogwarts in the first five Harry Potter novels. Who is he? Answer: Severus Snape. Question: This green-skinned witch is the main character of the novel and Broadway show Wicked, and her name was inspired by the original author of The Wizard of Oz. Who is she? Answer: Elphaba."
    },
    {
      "title": "Alcohol & Cocktails",
      "content": "Alcohol & Cocktails If you’re hosting a 21+ trivia night or helping to plan a pub trivia event, an alcohol and cocktails category is sure to be a hit! You can test your guests’ knowledge about drinks and maybe even inspire them to order a few more. Here are some sample questions: [5] X Research source Question: What is considered to be the world’s oldest alcoholic beverage? Answer: Mead. Question: Which cocktail is made of tequila, vodka, rum, triple sec, gin, and a splash of Cola? (Hint: it’s named after an area in New York.) Answer: Long Island Iced Tea. Question: What rum brand shares its name with a coastal city in California? Answer: Malibu. Question: When the olive in a martini is replaced with a cocktail onion, what type of cocktail does it become? Answer: A Gibson. Question: What canine-inspired phrase refers to an alcoholic drink that one consumes as a hangover cure? Answer: Hair of the dog. Question: To be sold as bourbon, a whiskey’s mash must include at least 51% of what grain? Answer: Corn. Question: An authentic champagne must be made from grapes grown in the Champagne region of which country? Answer: France. Question: In what vessel is a Moscow Mule typically served? Answer: A copper mug. Question: Which cocktail is made of whiskey, sugar, bitters, and water? Answer: An Old Fashioned. Question: Which green-colored, anise-flavored liquor was banned in many countries due to its reputation for causing hallucinations? Answer: Absinthe. Question: Which cocktail is made with tequila, lime juice, a pinch of salt, and grapefruit soda? Answer: A Paloma."
    },
    {
      "title": "Internet Culture & Memes",
      "content": "Internet Culture & Memes If you want to get participants laughing at your trivia night, this category is definitely the way to go. As your guests try to figure out the right answers to these questions, they’ll be reminded of all kinds of funny memes and internet trends, which will get everyone in a good mood. [6] X Research source Question: Which Muppet is drinking a glass of Lipton tea in the “but that’s none of my business” meme? Answer: Kermit the Frog. Question: The “distracted boyfriend” meme features a man looking at another woman while walking with his girlfriend. What color shirt is the “other woman” wearing? Answer: Red. Question: This meme features a dog sitting at a table with a cup of coffee while the house burns down around him. What phrase usually appears on this image? Answer: “This is fine.” Question: Which rapper is the voice behind the viral TikTok sound “Ariana, what are you doing here?” Answer: Nicki Minaj. Question: Which cartoon character appears in the “mocking meme”, which usually features captions wRittEn LiKe tHiS? Answer: SpongeBob SquarePants. Question: The press tour for the movie Wicked produced the viral “holding space” meme. Which song from the musical were people reportedly holding space for? Answer: Defying Gravity. Question: This popular meme features three of the same Marvel superhero pointing at each other. Who is the hero? Answer: Spider-Man. Question: This meme format features two images from the “Hotline Bling” music video: one with the rapper blocking something he doesn’t like, and one with the rapper smiling and pointing at something he does like. Which rapper is this? Answer: Drake. Question: This meme features Leonardo DiCaprio toasting with a glass of champagne with fireworks in the background. What movie is it from? Answer: The Great Gatsby. Question: Which rapper is the voice behind the viral “that’s suspicious, that’s weird…” meme? Answer: Cardi B."
    },
    {
      "title": "Minor Characters",
      "content": "Minor Characters This trivia category focuses on random or lesser-known characters in popular media. The tricky questions and their random answers can easily get participants laughing, so it’s a great option if you’re looking for something that’s both difficult and silly. Question: This minor animated character is a famous pop star in Zootopia . Who is she? Answer: Gazelle. Question: This minor SpongeBob character is Mermaid Man’s sidekick. Who is he? Answer: Barnacle Boy. Question: This minor comedic character proposes to his cousin, Elizabeth Bennet, but he’s turned down. Who is he? Answer: Mr. Collins. Question: This Grey’s Anatomy scrub nurse is featured in dozens of episodes across the seasons, but she rarely speaks. She’s also a real-life scrub nurse. Who is she? Answer: BokHee. Question: This minor Harry Potter character is a dishonest reporter at The Daily Prophet . Who is she? Answer: Rita Skeeter. Question: This minor character in The Princess Diaries works at Mia’s school, and she’s known for her line, “The queen is coming.” Who is she? Answer: Vice Principal Gupta. Question: This super tough minor character from Game of Thrones was played by Bella Ramsey when they were only 13 years old. Who is she? Answer: Lady Lyanna Mormont. Question: This minor character from Modern Family has a name that will remind you of seasonings often found on the dinner table. Who is he? Answer: Pepper Saltzman. Question: This minor character in Legally Blonde and Legally Blonde 2 is often remembered for her famous line about hot dogs. Who is she? Answer: Paulette. Question: This minor character from The Hunger Games is known for her outrageous fashion choices and the fact that she calls the names of the tributes in District 12. Who is she? Answer: Effie Trinket."
    },
    {
      "title": "TV Sitcoms",
      "content": "TV Sitcoms Sitcoms are filled with comedy, and they also tend to have very devoted fan bases. As a result, this trivia category is a great way to get participants super fired up and engaged! Here are some sample questions: Question: What LA neighborhood does Will Smith’s character move to after his mom makes him leave West Philadelphia in this hit 90’s sitcom? Answer: Bel Air. Question: Which iconic sitcom has a theme song with lyrics that promise, “I’ll be there for you”? Answer: Friends . Question: Which classic TV sitcom is a story about a blended family with three daughters and three sons? Answer: The Brady Bunch. Question: Which sitcom features a fan-favorite episode about a disastrous and hilarious dinner party? Answer: The Office. Question: Which sitcom is about a formerly rich family that suddenly relocates to a middle-of-nowhere town that they had previously bought as a joke? Answer: Schitt’s Creek. Question: Which popular sitcom follows a group of teachers at an elementary school in Philadelphia? Answer: Abbott Elementary. Question: Which sitcom features a supporting character named Titus Andromedon? Answer: Unbreakable Kimmy Schmidt. Question: Which sitcom follows a quirky teacher who becomes roommates with three men? Answer: New Girl. Question: What classic sitcom follows a group of locals who drink at a bar where everyone knows their names? Answer: Cheers. Question: Which sitcom follows a group of government employees in the fictional town of Pawnee, Indiana? Answer: Parks and Recreation."
    },
    {
      "title": "Wild & Iconic Fashion Moments",
      "content": "Wild & Iconic Fashion Moments Celebrities are known for rocking some crazy get-ups at award shows and red carpets, and this makes for a super fun and silly trivia category. Pop culture enthusiasts are sure to excel with this fun category! Here are some example questions: Question: This up-and-coming pop star dressed in a knight-in-shining-armor inspired look for the 2024 VMAs. Who is she? Answer: Chappell Roan. Question: This early 00’s couple wore matching all-denim outfits to the 2001 American Music Awards. Who are they? Answer: Britney Spears and Justin Timberlake. Question: This iconic pop star wore an outfit made of actual raw meat in 2010. Who is she? Answer: Lady Gaga. Question: This Icelandic singer attended the Oscars in a swan-inspired dress, complete with a swan neck and head wrapping around her shoulders. Who is she? Answer: Bjork. Question: This pop star donned a sheer dress made entirely of Swarovski crystals at the 2014 CFDA awards. Who is she? Answer: Rihanna. Question: This pop star arrived on the Grammys red carpet inside a plastic egg that was being carried by attendants, only to emerge during her performance at the show. Who is she? Answer: Lady Gaga. Question: This former Disney actress wore a Cinderella-inspired gown that lit up with the wave of a magic wand to the Met Gala. Who is she? Answer: Zendaya. Question: This actor brought a replica of his own head as an accessory to the Met Gala in 2019. Who is he? Answer: Jared Leto. [7] X Research source"
    },
    {
      "title": "Classic Children’s Books",
      "content": "Classic Children’s Books This nostalgic trivia category will have your guests wracking their brains to try to remember the books they enjoyed when they were younger. It’s a fun, lighthearted, and silly trivia category that’s sure to be a hit! [8] X Research source Question: In what city does the children’s book Madeline take place? Answer: Paris. Question: Which iconic picture book is about a child named Max who sails to an island inhabited by monsters? Answer: Where the Wild Things Are . Question: What kind of animal is Wilbur in Charlotte’s Web ? Answer: A pig. Question: What New York hotel does Eloise live at in the classic picture book? Answer: The Plaza. Question: Which Dr. Suess picture book features a mystical creature who “speaks for the trees”? Answer: The Lorax . Question: Which picture book is about a long string of events that will occur if you give a sweet treat to a mouse? Answer: If You Give a Mouse a Cookie. Question: Which classic picture book features holes cut through the pages? Answer: The Very Hungry Caterpillar . Question: Who wrote the popular children’s book The Giving Tree ? Answer: Shel Silverstein. Question: Which children’s chapter book follows a young girl with magical powers who attends a school run by a cruel headmistress named Miss Trunchbull? Answer: Matilda."
    },
    {
      "title": "Spongebob Squarepants",
      "content": "Spongebob Squarepants Many trivia events will feature a super specific category on a popular TV show, movie series, or franchise of some sort. A silly category based on Spongebob Squarepants is bound to be a major hit, but you could also choose a different popular piece of media, like The Office , Friends , The Simpsons, or The Bachelor. Here are a few sample questions if you do decide to go for the SpongeBob SquarePants category: Question: What’s the name of SpongeBob’s pet snail? Answer: Gary. Question: What U.S. state is Sandy Cheeks from? Answer: Texas. Question: What’s the name of the restaurant Plankton owns? Answer: The Chum Bucket. Question: What instrument does Squidward play? Answer: Clarinet. Question: Which spooky pirate ghost is a recurring character in Spongebob ? Answer: The Flying Dutchman. Question: What is the name of Plankton’s computer wife? Answer: Karen. Question: What hidden item is actually inside Patrick’s secret box? Answer: A super embarrassing picture of SpongeBob at a Christmas party. Question: What object does SpongeBob use to answer questions when he, Patrick, and Squidward are stuck in the kelp forest? Answer: The Magic Conch Shell. Question: When a disaster or chaotic event occurs in a SpongeBob episode, you can usually hear a minor character shouting out a specific phrase. What is it ? Answer: “My leg!” Question: What is the name of the super elderly fish who appears in some SpongeBob episodes? Answer: Old Man Jenkins."
    },
    {
      "title": "Pasta Shapes",
      "content": "Pasta Shapes A pasta-inspired trivia category is totally silly and random, so it’s bound to get your guests laughing. People have pretty strong opinions about pasta, as well, so this category will probably inspire some fierce competition! [9] X Research source Question: The name of this pasta shape translates to “little hairs.” Which pasta is it? Answer: Capellini. Question: This pasta is also known as “double macaroni.” Which pasta is it? Answer: Cavatappi. Question: The name of this pasta shape translates to “shells” or “seashells” in English. Which pasta is it? Answer: Conchiglie. Question: This pasta shape looks like little bow ties or butterflies. Which pasta is it? Answer: Farfalle. Question: The name of this pasta shape translates to “little ribbons” in English. Which pasta is it? Answer: Fettuccine. Question: Made from flour, egg, and potato, this pasta is technically a small dumpling. Which pasta shape is it? Answer: Gnocchi. Question: This pasta’s name means “quill,” which is a reference to the pointy ends of each noodle, which look a little like the tips of quill pens. Which pasta is it? Answer: Penne Question: Legend has it that this pasta shape was inspired by the radiator of a specific Italian car (the Bugatti). Which pasta is it? Answer: Radiatori Question: This pasta’s name means “large grooves” or “large stripes.” Which pasta is it? Answer: Rigatoni. Question: This pasta’s name means “bride” or “bridegroom,” which is thought to be a reference to this noodle’s popularity at Sicilian weddings. Which pasta is it? Answer: Ziti."
    },
    {
      "title": "Badly Explained Movie Plots",
      "content": "Badly Explained Movie Plots If you really want to get people laughing, try out a Badly Explained Movie Plots category. Each question in this category explains the plot of a popular movie in a tricky, offbeat, and humorous way. Participants will totally crack up when they realize the right answers to these silly clues! Question: Two besties (who are also neighbors) go on a long and dangerous journey to destroy a piece of jewelry. Answer: The Lord of the Rings . Question: An old woman tells a group of ocean explorers the story of the time she fell in love with a struggling artist on a boat. Answer: Titanic. Question: A young girl travels to a fantastical land and accidentally kills the first person she encounters, leading to a showdown with the deceased’s sister. Answer: The Wizard of Oz. Question: A young woman’s meeting with a matchmaker goes terribly, so she cuts off all her hair and joins the army. Answer: Mulan . Question: A 17-year-old girl finds herself in a love triangle with a hundred year old guy and a wolf. Answer: The Twilight saga . Question: A very long Saturday detention session. Answer: The Breakfast Club. Question: Two hotshots make a huge mistake at work by letting a terrifying creature into their world, and they spend the rest of the movie trying to fix it. Answer: Monsters, Inc. Question: A grandfather reads a book to his sick grandson. Answer: The Princess Bride. Question: After having a big fight with her dad, a 16-year-old girl runs away and trades her ability to speak, all in an attempt to win over her crush. Answer: The Little Mermaid. Question: Many safety issues arise as a group tours a candy factory. Answer: Charlie and the Chocolate Factory or Willy Wonka and the Chocolate Factory."
    },
    {
      "title": "General Knowledge",
      "content": "General Knowledge “General Knowledge” is a classic trivia category that is pretty much exactly what it sounds like. This category features questions about everyday facts that technically should be common knowledge, but they’re presented in tricky ways to keep things interesting. Here are some examples of General Knowledge trivia questions: Question: What is the tiny, plastic piece at the end of a shoelace called? Answer: An aglet. Question: Honeycrisp, Gala, and Fuji are popular types of which fruit? Answer: Apples. Question: What two-word activity can refer to a Catholic prayer OR a desperate, last-minute attempt to achieve something? Answer: A Hail Mary. Question: What does the “w.w.w.” stand for at the start of website addresses? Answer: World Wide Web. Question: At which museum is Da Vinci’s Mona Lisa located? Answer: The Louvre. Question: What is a word that reads the same backwards and forwards called? Answer: A palindrome. Question: What is the official language of Brazil? Answer: Portuguese. Question: Which astrological sign is represented by the symbol of The Scales? Answer: Libra. Question: What does “SPF” stand for on sunscreen products? Answer: Sun Protection Factor. Question: What is another title for the Bishop of Rome in the Catholic church? Answer: The Pope."
    },
    {
      "title": "History",
      "content": "History Many trivia events include a History category to test participants’ knowledge of past events (and how well they paid attention in history class at school!). Here are some examples of the types of questions that often appear in this category: [10] X Research source Question: Which U.S. president referred to the attack on Pearl Harbor on December 7, 1941 as “a date which will live in infamy”? Answer: Franklin D. Roosevelt. Question: Which Renaissance artist painted the ceiling of the Sistine Chapel? Answer: Michelangelo. Question: The Statue of Liberty was a gift to the United States from which country? Answer: France. Question: Which ancient civilization was responsible for building Machu Picchu? Answer: The Incas. Question: Who was the first ruler of the Mongol Empire? Answer: Genghis Khan. Question: Who was the ancient Greek goddess of love, pleasure, and beauty? Answer: Aphrodite. Question: Johannes Gutenberg is associated with which groundbreaking invention? Answer: The printing press. Question: Who was the first Black Supreme Court Justice in the U.S.? Answer: Thurgood Marshall. Question: How many wives did King Henry VIII of England have? Answer: 6. Question: What happened on the day known as “The Ides of March”? Answer: Julius Caesar was assassinated."
    },
    {
      "title": "Geography",
      "content": "Geography Geography is another common category at most trivia nights, and it offers a great opportunity for well-traveled people to rack up some points for their teams! Here are some typical Geography questions you might hear at a trivia event: Question: What is the smallest country in the world by land area? Answer: Vatican City. Question: What is the largest ocean in the world? Answer: The Pacific Ocean. Question: What is the capital of Thailand? Answer: Bangkok. Question: What is the name of the river that runs through Paris? Answer: The Seine. Question: Which continent spans all four hemispheres? Answer: Africa. Question: What city is the capital of California? Answer: Sacramento. Question: Which country is also a continent? Answer: Australia. Question: What is the largest desert in the world? Answer: Antarctica. Question: What is the biggest country in the world by land area? Answer: Russia. Question: What is the longest river in the world? Answer: The Nile. [11] X Research source"
    },
    {
      "title": "Science",
      "content": "Science Science is an awesome category to include in a trivia event because it tests participants’ knowledge of how the world works, and it also gives science buffs a chance to show off their skills. You can also include questions about various scientific topics, like anatomy, biology, physics, and space, which makes this category very expansive and interesting. Here are some examples:. [12] X Research source Question: Which scientist is known for his 3 laws of motion? Answer: Isaac Newton. Question: What is the waste product of photosynthesis? Answer: Oxygen gas. Question: How many bones are there in the adult human body? Answer: 206. Question: What is the fourth planet in our solar system? Answer: Mars. Question: What is the only metal that’s liquid at room temperature? Answer: Mercury. Question: What is the most abundant gas in the Earth’s atmosphere? Answer: Nitrogen. Question: What organ in the body is responsible for producing insulin? Answer: The pancreas. Question: What is the boundary where two tectonic plates meet called? Answer: A fault line. Question: What is the name of our galaxy? Answer: The Milky Way. Question: What’s the largest organ in the human body? Answer: The skin. Question: What are the four states of matter? Answer: Solid, liquid, gas, and plasma"
    },
    {
      "title": "Sports",
      "content": "Sports Sports fanatics will love this classic trivia category, which is all about testing their knowledge of athletics. In this category, you’ll commonly find questions about the rules of popular sports, fun facts about athletes, and famous sporting events like the Olympics. Question: How many players can a team have on the field at one time during a football game? Answer: 11. Question: What was the iconic boxer Muhammad Ali’s real name? Answer: Cassius Clay. Question: What does “NBA” stand for? Answer: National Basketball Association. Question: What is it called when a bowler makes 3 strikes in a row? Answer: A turkey. Question: How long is a marathon? Answer: 26.2 miles. Question: Which baseball player was nicknamed “The Great Bambino?” Answer: Babe Ruth. Question: Which sport uses the word “love” to designate a score of zero? Answer: Tennis. Question: What sporting event is held annually over Memorial Day weekend? Answer: Indianapolis 500. Question: Who is the most decorated gymnast of all time? Answer: Simone Biles. Question: Which athlete has the most Olympic medals? Answer: Michael Phelps. [13] X Research source"
    },
    {
      "title": "Arts & Literature",
      "content": "Arts & Literature Avid readers and creative people are often big fans of this classic trivia category, which includes questions about books, plays, writers, poets, composers, and painters. Here are some examples of the types of questions you might hear in this category: Question: Which classic novel opens with the line, “Call me Ishmael?” Answer: Moby Dick . Question: Who painted The Starry Night ? Answer: Vincent Van Gogh. Question: How many daughters did the Bennet family have in Pride and Prejudice ? Answer: 5. Question: Which book is narrated by a character named Nick Carraway? Answer: The Great Gatsby. Question: Who composed the music for The Nutcracker ? Answer: Tchaikovsky. Question: Willy Loman, a traveling salesman, is the main character of which 1949 play? Answer: Death of a Salesman. Question: What was the real name of author Mark Twain? Answer: Samuel Clemens. Question: Which artist is known for his work titled Campbell’s Soup Cans ? Answer: Andy Warhol. Question: What are Romeo and Juliet’s last names in Romeo and Juliet? Answer: Montague and Capulet. Question: Who wrote the epic poem Paradise Lost ? Answer: John Milton."
    },
    {
      "title": "Movies",
      "content": "Movies Whether you’re a true cinema buff or a casual enjoyer of movies, you’re bound to enjoy this fun trivia category. Questions often cover classic films and modern blockbusters, giving everyone a chance to score a few points for their teams. Here are a few examples: Question: What is the name of the high school in Grease ? Answer: Rydell High. Question: In which classic movie would you hear the line “Here’s looking at you, kid”? Answer: Casablanca. Question: Who stars as Katniss Everdeen in The Hunger Games ? Answer: Jennifer Lawrence. Question: What is the name of Dorothy’s dog in The Wizard of Oz ? Answer: Toto. Question: Which actress appears in all of the top 3 highest-grossing movies of all time ( Avatar, Avengers: Endgame, and Avatar: The Way of Water )? Answer: Zoë Saldaña. Question: What was the first feature-length animated movie ever released by Disney? Answer: Snow White and the Seven Dwarfs. Question: Which 2023 movie directed by Greta Gerwig is about an iconic American doll? Answer: Barbie . Question: Who directed Jurassic Park , E.T. the Extra-Terrestrial, and Jaws ? Answer: Steven Spielberg. Question: What is the name of the motel in Psycho ? Answer: The Bates Motel. Question: In which 1997 blockbuster would you find the characters Jack Dawson and Rose DeWitt Bukater? Answer: Titanic."
    },
    {
      "title": "Music",
      "content": "Music Everyone loves music, so this common trivia category is a fan-favorite. It often includes questions about classic music and modern hits, as well as fun facts about musicians and bands. Here are some examples: Question: Whitney Houston’s “I Will Always Love You” is actually a cover. Who was the original artist who recorded it? Answer: Dolly Parton. Question: Who is nicknamed the “Queen of Soul”? Answer: Aretha Franklin. Question: Who currently holds the record for the most Grammy wins of all time? Answer: Beyoncé. Question: Before releasing music as a solo artist, Stevie Nicks was a member of which band? Answer: Fleetwood Mac. Question: Who was the first winner of American Idol ? Answer: Kelly Clarkson. Question: Who was the lead guitarist for The Beatles? Answer: George Harrison. Question: Which iconic musician created an alter ego named Ziggy Stardust? Answer: David Bowie. Question: What is the highest-selling album of all time? Answer: Thriller by Michael Jackson. Question: Who is Kendrick Lamar’s diss track “Not Like Us” about? Answer: Drake. Question: Who is the first and only artist to win Album of the Year at the Grammys four times? Answer: Taylor Swift. Question: What was Elvis Presley’s first #1 hit in the U.S.? Answer: “Heartbreak Hotel.” [14] X Research source"
    },
    {
      "title": "Pop Culture & Entertainment",
      "content": "Pop Culture & Entertainment If you’re the kind of person who’s always up to date on the latest celebrity gossip, internet trends, and hit TV shows, you’ll probably love this common trivia category. Here are some example questions: Question: The “holding space” meme came from the press tour for which 2024 hit movie? Answer: Wicked. Question: What was the nickname given to the summer of 2024? (Hint: The nickname was inspired by an album released that year.) Answer: Brat Summer. Question: Who is the creator of HBO’s hit TV show The White Lotus ? Answer: Mike White. Question: Which actor starred in two movies nominated for Best Picture at the 2025 Oscars ( Dune and A Complete Unknown )? Answer: Timothée Chalamet. Question: Which up-and-coming pop star is known for being a “Midwest Princess”? Answer: Chappell Roan. Question: Which Kansas City Chiefs football player started dating Taylor Swift in 2023? Answer: Travis Kelce. Question: Which 2024 hit song is inspired by an energizing drink, usually consumed in the morning? Answer: “Espresso” by Sabrina Carpenter. Question: For which album did Beyoncé earn her first Album of the Year Grammy? Answer: Cowboy Carter . Question: The beef between which two rappers led to the release of several popular diss tracks in 2024? Answer: Drake and Kendrick Lamar. Question: Which U.S. politician went viral for her “coconut tree” speech? Answer: Kamala Harris."
    },
    {
      "title": "Kids",
      "content": "Kids Many trivia events will include a kid-friendly trivia category, especially if families with children are participating. This gives kiddos a chance to answer some questions and score points for their teams! Here are a few examples of the types of questions you might hear in this category: Question: What building does the president of the United States live in? Answer: The White House. Question: What country is known for its Great Wall? Answer: China. Question: What city is also known as The Big Apple? Answer: New York City. Question: How many states are there in the United States? Answer: 50. Question: What type of fish is Nemo in Finding Nemo ? Answer: A clownfish. Question: What painting by Leonardo da Vinci features a woman with a famously mysterious smile? Answer: The Mona Lisa. Question: The characters Count Dracula and Edward Cullen are both examples of which imaginary creature? Answer: Vampire. Question: What is the name of the snowman in Frozen ? Answer: Olaf. Question: How many sides does an octagon have? Answer: 8. Question: What is the name of the process that turns a caterpillar into a butterfly? Answer: Metamorphosis."
    },
    {
      "title": "Want some more trivia?",
      "content": "Want some more trivia? We’ve got you covered! Here are some fun trivia quizzes to take if you’re looking for more question or category inspo, or if you’re just hoping to test your skills some more. Trivia Quiz General Knowledge Quiz History Quiz Disney Trivia Quiz Harry Potter Trivia Quiz 00’s Music Quiz 90’s Trivia Quiz"
    }
  ]
}