{
  "url": "https://www.wikihow.com/Transfer-Photos-Onto-Canvas",
  "title": "How to Transfer Photos Onto Canvas",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. For this project, which gives you a beautifully rustic transfer onto canvas, you need four basic materials. See the \"Things You'll Need\" section. Nothing fancy — let's get started!"
    },
    {
      "title": "Print out your image on a laser printer.",
      "content": "Print out your image on a laser printer. Laser printers work best for photo transfer onto canvas; ink jet printers will not get the job done, unfortunately. How do you tell which kind of printer you have? If your toner is large, it's most likely a laser printer; if it's small and compact, it's most likely an ink-jet. [1] X Research source The size of your image and the size of the canvas don't need to be exact, although they look best when the two match perfectly. If you photograph is slightly smaller than the canvas — e.g. less than an inch (3 cm) — the final product will still look professional. Get ready for the image to be reversed. If you think reversal will look strange, or you're partial to the current arrangement on the photo, reverse the image before you print it out."
    },
    {
      "title": "Use a thick coat of gel medium to cover the front of your canvas completely.",
      "content": "Use a thick coat of gel medium to cover the front of your canvas completely. [2] X Research source No need to spend a whole lot of time on this step, but do make sure that there are no gaps in coverage, or the photo ultimately won't transfer."
    },
    {
      "title": "Line the image up with the canvas — ink-side down — and press down to flatten.",
      "content": "Line the image up with the canvas — ink-side down — and press down to flatten. [3] X Research source Instead of trying to line up the whole image perfectly in one fell swoop, line up one edge first so that two corners of the canvas and two corners of the photo match perfectly. Once that side is put onto the gelled canvas, flatten the rest of the photo onto the remaining canvas in a sweeping motion."
    },
    {
      "title": "Allow canvas to dry overnight.",
      "content": "Allow canvas to dry overnight. [4] X Research source Place in a cool place devoid of excessive moisture while the gel medium dries."
    },
    {
      "title": "Starting on one side of the canvas, lightly wet the surface with water from a spray bottle.",
      "content": "Starting on one side of the canvas, lightly wet the surface with water from a spray bottle. Using your hand, scrape away the wet paper to reveal the reversed image underneath. Continue spraying and lightly scraping until you've revealed as much of the image as desired. [5] X Research source Don't scrape too hard or you'll scrape away the underlying image. Expect for it to be messy. Don't be afraid to leave a small amount of distress or paper on the canvas. This is what gives the image its rustic or vintage look, and it pairs especially well with black and white or sepia tone images."
    },
    {
      "title": "Apply a final coat of gel medium to the canvas once you've stripped it of paper.",
      "content": "Apply a final coat of gel medium to the canvas once you've stripped it of paper. Allow the canvas to dry again overnight before hanging, gifting, or using. [6] X Research source"
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. This special way to preserve color images requires only the following supplies: fine tissue paper; an iron or other flattering material like a stack of books; a canvas; and sealer glue, such as Modge Podge."
    },
    {
      "title": "Trim the tissue paper so that it's the same size as the canvas you'll be using.",
      "content": "Trim the tissue paper so that it's the same size as the canvas you'll be using. Place the tissue paper onto a table or other hard surface and lay the framed canvas upside down onto it; the front of the canvas and the tissue paper should be touching. With a pencil, trace around all four sides of the canvas, and then cut around the four corners of the tissue paper."
    },
    {
      "title": "Straighten out any kinks or creases in the tissue paper with a clothes iron.",
      "content": "Straighten out any kinks or creases in the tissue paper with a clothes iron. Use the high setting without any steam."
    },
    {
      "title": "Manually place the tissue paper into your printer tray and print out your desired image.",
      "content": "Manually place the tissue paper into your printer tray and print out your desired image. This may take a few tries, but the end result will be worth it. Adjust your printer settings so that the printed image is only as big as the tissue paper. For this reason, it's best to use a standard size when selecting a canvas to use. An 8 1/2 x 11 canvas, for example, would be extremely easy to work with, while a nonstandard-sized canvas would be more difficult to get a match for."
    },
    {
      "title": "Apply a thin coat of Modge Podge to the canvas, making sure to get even coverage.",
      "content": "Apply a thin coat of Modge Podge to the canvas, making sure to get even coverage. Use a brush to get good coverage with your adhesive."
    },
    {
      "title": "Working quickly, center the tissue paper picture over the canvas before pressing it down onto the adhesive.",
      "content": "Working quickly, center the tissue paper picture over the canvas before pressing it down onto the adhesive. Get one corner centered perfectly before placing the whole image down onto the canvas."
    },
    {
      "title": "With a clean foam brush, smooth out any creases in the tissue paper.",
      "content": "With a clean foam brush, smooth out any creases in the tissue paper. Work from the inside and brush outward for best results."
    },
    {
      "title": "If necessary, trim any remaining tissue paper from the sides of the canvas for a clean look.",
      "content": "If necessary, trim any remaining tissue paper from the sides of the canvas for a clean look."
    },
    {
      "title": "Cover with another layer of clear adhesive before letting dry (optional).",
      "content": "Cover with another layer of clear adhesive before letting dry (optional). Use the same coat of Modge Podge, if desired, or pick another type of (matte, etc.) finish to seal your newly-minted canvas photo."
    }
  ]
}