{
  "url": "https://www.wikihow.com/Transfer-High-Schools",
  "title": "How to Transfer High Schools",
  "steps": [
    {
      "title": "Make sure your personal reason for transferring high schools is valid.",
      "content": "Make sure your personal reason for transferring high schools is valid. To be approved for a transfer, it must be for a valid reason. If you’re being bullied or struggling to keep up academically, your request will most likely be approved. If you’re sick of your current high school and want to transfer to one where most of your friends are, this won’t be approved. Look at your district's list of acceptable reasons to transfer to see if yours is a valid reason. [1] X Research source A list of acceptable reasons to apply for a high school transfer can be found on the school district’s website."
    },
    {
      "title": "Talk to your current guidance counselor about your planned transfer.",
      "content": "Talk to your current guidance counselor about your planned transfer. Your guidance counselor will be able to tell you about the transfer process and what steps you should take next. Ask about important deadlines for paperwork or applications, which records you'll need to find, and if they have a recommendation for which school might be best for you. [2] X Research source"
    },
    {
      "title": "Find another school within your district.",
      "content": "Find another school within your district. Since you're not moving, you'll want to find a school close to home, most likely still in your school district. By visiting your school district's website or calling a representative from your school district's office, you'll be able to figure out which schools are in your district and which one would be a good fit. [3] X Research source"
    },
    {
      "title": "Fill out all of the required paperwork.",
      "content": "Fill out all of the required paperwork. To apply for a transfer request, you’ll need to fill out a specific form. These transfer request forms can either be found online at the school’s or district’s website, or you can go to the school or district’s office and ask for them in person. There also might be other enrollment paperwork that needs to be filled out. Work with your parents or guardian to make sure all of the information that's filled out is correct. [4] X Research source"
    },
    {
      "title": "Gather all of your necessary records.",
      "content": "Gather all of your necessary records. The high school that you attend will need copies of important documents such as your birth certificate, medical records, and previous school transcripts. Make copies of these before you submit them, just to be safe. [5] X Research source"
    },
    {
      "title": "Submit your transfer request application by the deadline.",
      "content": "Submit your transfer request application by the deadline. Once the paperwork is all filled out and your records are copied, it's time to turn in your transfer request! Be sure to turn it in by the deadline given to you by your guidance counselor or other school staff member."
    },
    {
      "title": "Identify any changes in curriculum.",
      "content": "Identify any changes in curriculum. Your new high school may have different classes or curriculum than your old high school. Talk to an academic advisor or current teacher at your new school to see if the curriculum matches. Knowing whether you're ahead, behind, or right on track with your classwork beforehand will help make your transition much easier. [6] X Research source"
    },
    {
      "title": "Start building a new school support network.",
      "content": "Start building a new school support network. A new high school is a chance to start fresh. Make strong first impressions by smiling at people in the halls, introducing yourself to your peers, and taking an active part in your schoolwork. Start establishing strong connections with your teachers and coaches, too. [7] X Research source"
    },
    {
      "title": "Talk to your parents about any problems or concerns you have.",
      "content": "Talk to your parents about any problems or concerns you have. If you're feeling anxious or have some concerns about your new high school, talk to your parents. Sharing your thoughts with them will help to relieve some of your stress, and it's important to establish open communication with them. [8] X Research source"
    },
    {
      "title": "Start the transfer process as soon as you know you’re moving.",
      "content": "Start the transfer process as soon as you know you’re moving. Since moving can take place at any time during the year, it’s alright if you have to switch schools in the middle of the school year. Once you find out you’re moving, start gathering information about your new school district and find out what you’ll have to do to complete the process. [9] X Research source"
    },
    {
      "title": "Discuss how transferring will work with staff at your future school.",
      "content": "Discuss how transferring will work with staff at your future school. The staff at your future school will be able to tell you exactly what you need to do to complete your transfer, such as forms you’ll need to fill out, how to transfer in the middle of the school year, or what papers you’ll need to find. They should also inform you of all important dates and deadlines. [10] X Research source Contact your new high school by phone or email to find out all of the important information. If you live close enough to your new school that you can visit, stop by and ask them about the process in person. They may be able to give you the paperwork right then."
    },
    {
      "title": "Discover what the high school in your new district has to offer.",
      "content": "Discover what the high school in your new district has to offer. Doing a little research on your new school before you move can make you feel more prepared. Look on the school's website to find out which extracurriculars they offer, what their academics are like, how diverse the school is, and if there are any similarities to your old school. [11] X Research source There are many websites that list a school’s ratings, as well as information about how much homework is given, what the teachers are like, and reviews about the school."
    },
    {
      "title": "Collect all of the records that you’ll need to submit to the school.",
      "content": "Collect all of the records that you’ll need to submit to the school. Your new high school will need your medical records, proof of residency, past school transcripts, and any other important documents to enroll you. Gather all of these papers together, and be sure to make copies of them before you submit them to the school. [12] X Research source"
    },
    {
      "title": "Find out if all of your credits will transfer.",
      "content": "Find out if all of your credits will transfer. Many times, not all of your credits will transfer to your new school due to differences in classes and curriculum. Set up a meeting with an academic advisor at the new high school to find out which credits will transfer. It's also a good idea to ask about the graduation requirements so that you know which classes you'll need to take. [13] X Research source If you can't physically visit an academic advisor because you haven't moved yet, try emailing or calling them to get your questions answered."
    },
    {
      "title": "Visit the school you’re zoned for to get a feel for it.",
      "content": "Visit the school you’re zoned for to get a feel for it. Once you’ve moved and are about to start your new high school, try to visit it beforehand. Request a tour or meeting with the faculty or staff so that you can begin to get acquainted with the new environment. Knowing where a few classes are or where the lunch room is located before you start your first day will help relieve some nerves. [14] X Research source"
    },
    {
      "title": "Get involved in the school community to make new friends.",
      "content": "Get involved in the school community to make new friends. Moving to a new place can be overwhelming, and building new friendships will help ease this transition. Sign up for extracurricular activities, join a club or sport, or simply talk to someone about one of your favorite hobbies. Taking part in an activity or discussion about something you’re interested in will help you form friendships. [15] X Research source"
    },
    {
      "title": "Stay positive.",
      "content": "Stay positive. Focus on things you like about your new school to avoid feeling down or anxious about your transition. Maybe you really like attending school soccer games, or you've made a new friend in science class. Finding the positives in every situation will keep you motivated and happier."
    },
    {
      "title": "Find the right specialized school for you.",
      "content": "Find the right specialized school for you. If you’re hoping to transfer to a charter school, magnet school, IB program, or other specialized school, you want to make sure it’s going to be a good fit. Before you commit to the transfer process, make sure the benefits outweigh the cons. Your new school should be a good fit academically and be centered around a program that you’re truly interested in. [16] X Research source Travel time should be a strong consideration as well — you don’t want to spend several hours every day going to and from school."
    },
    {
      "title": "Contact the school for information about the transfer process.",
      "content": "Contact the school for information about the transfer process. Call or meet with a representative from the charter school, magnet school, IB program, or other specialized school that you’re hoping to transfer to. They’ll be able to tell you what you need to do to complete the application and transfer process, as well as answer any questions you might have."
    },
    {
      "title": "Start the application process early.",
      "content": "Start the application process early. Most specialized schools have a lot of people trying to get into them, making them incredibly competitive. The last thing you want to do is miss an important deadline or run out of time to complete your application, so start the process as early as possible. [17] X Research source"
    },
    {
      "title": "Write down all of the important dates and deadlines.",
      "content": "Write down all of the important dates and deadlines. To be sure that you don’t let any important deadlines or dates slip by, make a list or put them on your calendar. This includes application deadlines, testing dates, open houses, audition dates, interviews, or other paperwork due dates."
    },
    {
      "title": "Register and prepare for testing, interviews, or auditions.",
      "content": "Register and prepare for testing, interviews, or auditions. If your specialized school requires you to go through testing or do an audition or interview, register and start preparing. The more confident and practiced you are, the better you’ll do when the important day comes. [18] X Research source There are many books you can buy that will help you prepare for the type of test you’ll need to take, and you can also see if there are any local classes offered to help you as well. Practice for your audition alone and in front of others so that you’re able to get input and become used to an audience. When practicing for an interview, think about what your strengths and weaknesses are as a student and work on speaking with confidence."
    },
    {
      "title": "Gather teacher recommendations, if necessary.",
      "content": "Gather teacher recommendations, if necessary. Some specialized schools will ask for teacher recommendations. If this is true of the school you wish to transfer to, ask 2 or 3 teachers at your current school if they would write a letter for you. Make sure you ask them plenty of time in advance so that the letter isn’t rushed. [19] X Research source Ask teachers who know you well or that you have a strong connection with to write your letter. You don’t have to limit your letter recommendations to your teachers — this could be from a coach, guidance counselor, or club sponsor, too."
    },
    {
      "title": "Visit a specialized school’s open house.",
      "content": "Visit a specialized school’s open house. If the specialized school has an open house, attend it to get a feel for the school. This is a great time to take a tour, meet the faculty and staff, and ask any questions about the school that you think of. [20] X Research source"
    },
    {
      "title": "Check that your grades and coursework align with the specialized school.",
      "content": "Check that your grades and coursework align with the specialized school. Many specialized schools require that you keep a certain GPA or get mostly As and Bs in order for you to attend. If this is the case, keep your grades up throughout the transfer process. Obtain a copy of your potential new school’s curriculum to make sure it isn’t incredibly different from your current classes. [21] X Research source Ask a representative from the specialized school for information regarding their school’s curriculum, or check to see if it’s posted on their website."
    },
    {
      "title": "Submit your application completed and on time.",
      "content": "Submit your application completed and on time. Once you’ve filled out all the necessary paperwork and gathered all of your records, it’s time to submit your application. Double-check that you’ve filled everything out correctly, and submit it on time. It’s also a good idea to make a copy of your entire application in case anything goes missing. [22] X Research source"
    },
    {
      "title": "Attend orientation, if applicable.",
      "content": "Attend orientation, if applicable. If your new high school has an orientation for new students, use this as an opportunity to get to know your new school while also meeting other new students. Orientations are usually before the school year starts, giving you a chance to start the school year off feeling confident and more comfortable with your surroundings as you adjust to a new high school . Some schools require new students to attend an orientation, so check to see if this is a requirement at your new high school."
    },
    {
      "title": "Get to know your new classmates.",
      "content": "Get to know your new classmates. Once you begin school, start introducing yourself to your new peers. If you're at a magnet, arts, or similar specialized school, there are bound to be tons of other kids with passions similar to yours. Start up a conversation with someone by saying hello or asking about their interests to begin getting acquainted with people. [23] X Research source"
    }
  ]
}