{
  "url": "https://www.wikihow.com/Terminate-an-%22at-Will%22-Employee",
  "title": "How to Terminate an \"at Will\" Employee",
  "steps": [
    {
      "title": "Review the employee's personnel file.",
      "content": "Review the employee's personnel file. You must review any prior documentation concerning the employee and his or her performance or relations with the company before you make the decision to terminate his or her employment. [1] X Research source [2] X Research source While you can technically terminate an employee for any reason, you want to make sure those reasons jibe with the employee's performance record. Otherwise you'll look inconsistent and may open the door to a discrimination lawsuit. For example, if you terminate an employee for poor attention to detail, and she received a performance review two weeks ago that praised her attention to detail, that employee will be left wondering what the real reason was she lost her job. Read communications with the employee closely, in particular any performance reviews, to determine whether any promises of future employment have been made. Employee reliance on such statements can be grounds for a wrongful termination lawsuit. Be on the look out for implied promises as well as direct promises. For example, if a supervisor made the statement at the employee's last performance review that \"if you keep this up, you have a long future with this company,\" that could be interpreted as a promise of job security and continued employment. If the employee has filed a discrimination complaint any time within the last six months, consult an attorney. Termination must be handled very carefully because it is illegal for you to fire the employee in retaliation for his or her complaint."
    },
    {
      "title": "Write up all disciplinary infractions.",
      "content": "Write up all disciplinary infractions. Your company's rules and policies should be communicated clearly to all employees, and they should be provided with written notice when their violation of a rule or policy results in some form of disciplinary action. If a problem has come to your attention, but the employee's personnel file indicates the employee has never been notified or consulted about the problem, it is in your best interest to have a sit-down meeting with the employee and discuss the issue before you jump to termination. It takes preparation to safely terminate an employee, even an at-will employee, and minimize the risk of a lawsuit. Consider meeting with the employee to discuss performance issues well in advance of termination. Provide the employee with goals for improvement and set a date for a follow-up meeting. Let the employee know that he or she will face termination unless those goals are met by that time."
    },
    {
      "title": "Apply policies consistently.",
      "content": "Apply policies consistently. Avoid letting some employees slide or applying rules more strictly to employees you don't like. Consistent application of disciplinary policies instills confidence in your employees and can prevent a discrimination lawsuit. Impress upon all managers and supervisors that they are not permitted to \"look the other way\" or make agreements with employees not to write-up disciplinary infractions. Consistent enforcement of policies and procedures can be your strongest defense in wrongful termination or discrimination lawsuits. At the same time, be careful about the way disciplinary procedures are discussed in employee handbooks. If you tell employees that certain steps must be followed before they are terminated (such as having three write-ups), you risk a wrongful termination suit if you fire an employee without following all of those steps precisely. You also may have a situation that must be dealt with more quickly than your existing policies would allow. If you have a severe problem not covered by your existing policies, an employment attorney may be able to assist you in developing a safe and effective strategy that won't open your company to legal liability."
    },
    {
      "title": "Consider consulting an attorney.",
      "content": "Consider consulting an attorney. If you're worried about potential problems or have identified a particular termination as high-risk, seek guidance and assistance from an employment law attorney before going through with the termination. In many situations, your concerns can be alleviated with a simple phone call – and having a legal opinion regarding a tense situation can eliminate uncertainty. If you don't already have an attorney you regularly consult, ask colleagues in your industry who they use for employment issues or if they have a recommendation. Other attorneys you've used for other business matters in the past also may know of a good employment lawyer they would recommend. Seek the opinion of an attorney who has experience representing employers in employment discrimination or wrongful termination cases. They often can draw on past cases as examples of how you should or should not handle a particular situation."
    },
    {
      "title": "Schedule a private meeting.",
      "content": "Schedule a private meeting. When you've decided you need to terminate an employee, arrange a time when you can sit down with the person one-on-one and explain your decision. A private meeting encourages honesty and allows you and the employee to have a productive discussion with a minimum of interruptions. Prepare a list of points to follow so you don't get off-track or forget to provide important information. Especially if you've never personally discussed performance problems with the employee, get his or her side of the story before following through with the decision to terminate. When you ask the employee questions about the situation or the problems he or she is having at the company, actively listen to the employee and attempt to find a solution short of termination if possible. For example, suppose you have an employee you want to terminate because she has consistently been 30-45 minutes late for her shift every day for a week. However, when you talk to her, you learn that her husband recently started a new shift at his job that means she has to take their children to school in the morning, and that is causing her to be late. In that example, you may be able to make arrangements for her to work a later shift, or start her shift later, so she has time to take her kids to school and still arrive on time."
    },
    {
      "title": "Explain the reason for termination.",
      "content": "Explain the reason for termination. Even though you aren't legally required to provide a reason you are terminating an employee, providing a precise reason backed up with documentation can protect the company and help prevent a lawsuit. Explain your reason clearly and completely, providing documentation where possible. Stick to facts that can be supported with evidence, and avoid making accusations or repeating rumors that can't be substantiated. Not providing a reason – or providing a vague reason not backed up by facts – makes it seem like you're hiding something and invites the employee to look for another \"real\" reason for his or her termination. Be thorough in your explanation, but don't ramble on or lapse into caveats and apologies. Terminating an employee is never easy, and it's human nature to empathize with the person you're letting go – but offering praise or apologizing for your decision makes you look inconsistent and unsure."
    },
    {
      "title": "Tell the employee what happens next.",
      "content": "Tell the employee what happens next. Explain the procedure for termination, including unemployment eligibility and when and how the employee can expect his or her last paycheck, so the employee doesn't leave with questions or confusion. Let the employee know whether you will be able to offer a reference to potential employers. If the situation is fairly amicable – say, you're merely reorganizing staff in response to poor sales, but not terminating the employee for poor performance – you may want to offer additional assistance to the employee in finding a new position. If you're offering severance pay, explain how much the employee will receive and when he or she will be paid. You also should address any benefits such as health insurance that you provided to the employee."
    },
    {
      "title": "Provide all information in writing.",
      "content": "Provide all information in writing. In recognition of the fact that the employee likely will be in shock and have difficulty processing a flood of information coming at him or her, provide documents that explain post-termination procedures, particularly in regard to benefits and unemployment. If you have contact information for your state unemployment office, include this in the documents you provide to the employee. You also should provide detailed information about any benefits you provided such as health insurance, and how the employee can continue these benefits after termination. Keep in mind that the employee likely will be reluctant to contact you if he or she has questions. Do your best to anticipate problems that might arise and give the employee all the information he or she might need."
    },
    {
      "title": "Protect company property and information.",
      "content": "Protect company property and information. In some situations, particularly where an employee has access to trade secrets or other company intellectual property, you may need to have the employee sign a contract upon termination. You also may want the attorney to sign a release giving up any reasons he or she may have to sue you. [3] X Research source Keep in mind that these agreements aren't legally valid unless they are supported by valid consideration – meaning you must provide the employee with something of value in return for his or her promise, typically in the form of severance pay. Because these agreements can be costly, you should carefully weigh their necessity before deciding you want the employee to sign one. In many situations the agreement won't be worth what it costs you in severance pay. Any non-compete or non-disclosure agreement can only last for a specified period of time, and non-competes typically are only considered valid if they cover a limited geographic area. If the agreement is asking the employee to release you from liability, the language you use needs to be as specific as possible. Courts often won't enforce releases with vague, blanket releases of liability. Make sure the employee has plenty of time to read and understand any contract you want him or her to sign upon termination, and avoid giving off the impression that the employee has no choice but to sign the agreement."
    },
    {
      "title": "Complete all termination paperwork.",
      "content": "Complete all termination paperwork. Especially if the employee is potentially eligible for unemployment benefits, make sure all government and insurance documents are submitted as soon as possible to avoid any delay or complication for your former employee. The specific documents you must complete will vary by state. But in general, you must send termination information to your state's unemployment insurance. You also may have to complete documents for the employee's health insurance, retirement accounts, and other benefits. If you provided the former employee with health insurance, you must notify your group health plan administrator within 30 days of terminating the employee. Maintain consistency through these records with what you told the employee at his or her termination interview. Your reason for termination should be the same across the board particularly on all documents you submit for unemployment. If the form provides a list of common reasons and none of them are appropriate to the situation, use a blank option and write in the correct response."
    },
    {
      "title": "Ensure the confidentiality of all employee information.",
      "content": "Ensure the confidentiality of all employee information. Even after you've terminated employment, take steps to protect the employee's personal information and only discuss your reasons for terminating that employee with people who absolutely need the information to fulfill their own responsibilities. If information about the employee results in financial damage or injury to the employee, and the release of that information can be traced back to your company, you may find yourself being sued. Former employees also may bring defamation lawsuits if the reasons for their termination are widely disclosed or become the subject of company gossip. All co-workers need to know is that the employee is no longer with the company, and his or her work needs to be redistributed efficiently. When potential employers call you for a reference or background check regarding the terminated employee, avoid bad-mouthing him or her or making opinionated statements regarding the former employee's performance."
    },
    {
      "title": "Archive the employee's personnel records.",
      "content": "Archive the employee's personnel records. In many states, employees have the right to request a copy of their personnel record upon termination. Additionally, state and federal laws require you to keep these records for at least one year after the employee's termination. [4] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source [5] X Research source Generally, federal law requires you to keep all personnel records for one year after an employee is involuntarily terminated, and payroll records in particular must be kept for at least three years after the date of termination. Your state law may give employees the right to inspect personnel records or request a copy of all personnel records. Check the law in your state so you know how and when employees may request access to their personal records, and what you must do to comply."
    }
  ]
}