{
  "url": "https://www.wikihow.com/Train-Dogs-Not-to-Bark",
  "title": "How Do You Train a Dog Not to Bark?",
  "steps": [
    {
      "title": "Do not reward the barking by shouting.",
      "content": "Do not reward the barking by shouting. Training a dog not to bark early on is much easier than breaking the habit once your dog has developed it. One of the keys to this is to avoid ever reinforcing or rewarding barking in the first place. If your dog barks and you shout for quiet, you are rewarding the barking with attention in your dog’s mind. [1] X Research source Don't Shoot the Dog. Karen Pryor. Ringpress Books Your dog may even interpret the shouting as your version of barking in response. By mistaking this for approval, your dog is more likely to repeat the behavior."
    },
    {
      "title": "Ignore the barking.",
      "content": "Ignore the barking. Instead of shouting at your new dog for quiet, try first ignoring the barking. If the dog never starts associating barking with attention and responses from you, then the dog is less likely to use the behavior. [2] X Research source Don't Shoot the Dog. Karen Pryor. Ringpress Books"
    },
    {
      "title": "Distract your dog.",
      "content": "Distract your dog. If ignoring the barking doesn’t stop the behavior after several minutes, then try to distract your dog from the behavior. Continue ignoring the barking, but then drop something on the floor, open the pantry, or something else that usually gets your dog’s attention and causes the dog to investigate."
    },
    {
      "title": "Redirect to something you can positively reinforce.",
      "content": "Redirect to something you can positively reinforce. Once you have distracted your dog from the barking and the dog has approached you to investigate, then use a familiar command to the dog, such as “sit.” Reward the positive behavior immediately, which will reinforce the commanded behavior instead of any barking. [3] X Research source Don't Shoot the Dog. Karen Pryor. Ringpress Books This highlights the need for basic training with your dog as well. Distracting your dog with other basic commands that the dog understands is a great way to avoid reinforcing barking by accident. [4] X Research source Don't Shoot the Dog. Karen Pryor. Ringpress Books To learn more about teaching your dog commands, check out How to Teach Your Dog Basic Commands . Clicker training your dog is another great way to help positively reinforce desired behaviors."
    },
    {
      "title": "Bring the dog inside if the barking happens outside.",
      "content": "Bring the dog inside if the barking happens outside. If your new dog’s barking takes place in your yard at passersby, then bring the dog inside in a way that ignores the barking. wait until the dog stops barking at a passer and put his or her leash on. Next time the dog starts barking at another passer, immediately lead the dog inside by the leash. By doing it mid-bark, you teach the dog that barking means the end of having fun out in the yard. [5] X Research source Don't Shoot the Dog. Karen Pryor. Ringpress Books"
    },
    {
      "title": "Provide plenty of exercise.",
      "content": "Provide plenty of exercise. [6] X Expert Source Ty Brown Dog Trainer Expert Interview. 4 June 2020. Barking is a manner of expression for your dog, and the dog may bark in response to emotional states, especially boredom. Providing plenty of exercise and attention to your dog will help stop the dog from developing a habit to bark in response to boredom. [7] X Research source The Power of Positive Dog Training. Pat Miller. Howell Book House Spend at least two fifteen-minute training sessions with your dog each day, and take your dog out for exercise twice a day to play fetch and run—up to an hour a day for large, energetic breeds. [8] X Research source The Power of Positive Dog Training. Pat Miller. Howell Book House If your dog still seems to bark due to boredom despite being out twice a day to expel some energy, try ramping up the amount of time you spend out for each exercise session."
    },
    {
      "title": "Investigate your dog’s barking.",
      "content": "Investigate your dog’s barking. The first step to stopping your dog’s barking is to find out what’s causing the barking. You may need to do some deducing, particularly if your dog tends to bark when you aren’t around. To help you track the barking behavior, talk with your neighbors. Ask when they notice your dog barking and if there’s any pattern to the behavior. Demonstrating to your neighbors that you’re aware of and working to address your dog’s barking will also help them see you as an ally rather than a part of the problem. Leave a tape or video recorder running while you’re away. Taking video may be preferable to only taking audio as it will allow you to investigate potential visual as well as aural triggers of your dog’s barking. Record your dog at home over the course of several days and review the recordings so you’ll be able to get a better representation of your dog’s behavior."
    },
    {
      "title": "Determine the cause of the barking.",
      "content": "Determine the cause of the barking. After gathering evidence, begin looking for patterns and triggers. Common triggers include: [9] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Drawing your attention to a need. Your dog may be looking to get your attention because of an immediate need—to use the bathroom, hunger, thirst, etc. Feeling bored or frustrated. A dog may be bored or frustrated because it has been confined to a particular area or has no outlets for its energy. Barking may be a way for the dog to release anxiety or create a distraction. Feeling afraid. If a person, thing, or noise frightens your dog, it may be barking as a response. You can tell from your dog’s body language whether it’s responding out of fear—a fear posture will include the ears pulled back and the tail lowered. Feeling territorial. If a dog perceives a person or other dog as intruding on its territory, it may bark as a way of asserting a claim to that territory. You can often tell when a dog is barking territorially because its ears will be forward and its tail held up high. Feeling excited. Dogs may bark when they’re excited to see you as an expression of their eagerness. Experiencing health issues. If a dog is dealing with health issues like deafness, pain, or mental distress, it may bark as a sign that something is amiss. [10] X Research source"
    },
    {
      "title": "Take your dog to the veterinarian.",
      "content": "Take your dog to the veterinarian. If you have any reason to suspect that your dog may be barking because of a health concern, make an appointment to see your vet. Keep in mind that older dogs may bark as a result of dementia. If that’s the case, your vet may be able to prescribe a medication to help your dog cope with the symptoms. [11] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Eliminate the motivation.",
      "content": "Eliminate the motivation. Once you’ve determined what’s causing your dog to bark, work on removing the incentive. Your dog barks because it experiences some kind of reward from that behavior. If you remove that payoff, your dog will lose incentive to bark. [12] X Research source For example, if your dog barks at passersby while in the house, close the blinds or curtains to block their view. If your dog barks at passersby while in the yard, bring the dog inside when it begins barking at someone. [13] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Ignore your dog’s barking.",
      "content": "Ignore your dog’s barking. When beginning to re-train your dog, you need to start by not reacting to the barking. Dogs interpret your yelling at them or telling them to stop as attention, which in and of itself reinforces the behavior, regardless of whether you’re angry at or scolding your dog. [14] X Research source Don't Shoot the Dog. Karen Pryor. Ringpress Books When your dog barks, don’t acknowledge it in any way. Don’t look at your dog, talk to your dog, pet your dog, and definitely don’t feed or give your dog treats. Be aware that you dog's barking will get worse before it gets better if you need to break an existing habit. When you fail to react after your dog is used to you responding to barking, then the dog will interpret that as a need to bark more because it didn’t work. Avoid the urge to acknowledge the barking in any way. You may want to explain to neighbors that you are trying to stop the barking issue and apologize for the inconvenience in the meantime. If they understand you are trying to do something constructive—rather than just being incredibly irritating—hopefully they will be more sympathetic."
    },
    {
      "title": "Reward quiet.",
      "content": "Reward quiet. As soon as your dog stops barking, wait a minute to ensure that the dog doesn’t confuse the reason why, and then reward the silence with a treat. If you do this consistently, then your dog will begin to understand that the barking does not receive a reward but the quiet does. Your dog will begin to associate being quiet with receiving a treat. As that happens, begin to lengthen the amount of time the dog must be quiet before receiving a reward. If you are utilizing clicker training with your dog, then remember to mark the silence with a click before rewarding the quiet."
    },
    {
      "title": "Redirect your dog’s attention.",
      "content": "Redirect your dog’s attention. When your dog begins to bark, redirect it to do something that will distract it from the stimulus. Telling your dog to lie down is a good way to redirect, as it won’t be construed as a reward for barking. When you dog lies down quietly, reward it with a treat--but only once it’s quiet."
    },
    {
      "title": "Minimize the effect of the dog's barking on the neighbors.",
      "content": "Minimize the effect of the dog's barking on the neighbors. While in the process of re-training your dog, keep your dog out of hearing range of the neighbors as much as possible to minimize nuisance. Keep in touch with your neighbors and let them know you’re aware of your dog’s barking and are working to fix the problem. Having your neighbors on your side is the best way to maintain good will and avoid nuisance calls. [15] X Research source"
    },
    {
      "title": "Allow your dog to get enough exercise.",
      "content": "Allow your dog to get enough exercise. Dogs are social and need environmental stimuli to stay healthy and well-adjusted. Take your dog for regular walks around the neighborhood. Whenever possible, take your dog to parks or open spaces where it can run around freely."
    },
    {
      "title": "Give your dog enough attention.",
      "content": "Give your dog enough attention. [16] X Expert Source Ty Brown Dog Trainer Expert Interview. 4 June 2020. Dogs are pack animals and need to feel part of a family, so when you come home, bring your dog inside and allow it to socialize with you and your family. Don’t leave your dog outside or unattended while you’re home; it will likely lead your dog to become anxious and frustrated, leading to poor behavior."
    },
    {
      "title": "Be consistent.",
      "content": "Be consistent. Dogs are often confused by human inconsistency--sometimes when they bark, you yell, but at other times you don’t respond. As a result, your dog can’t tell whether barking is a good or a bad thing. The only way to train your dog in the behavior you want is to be consistent, so it will be able to learn the behaviors you want and don’t want it to have. [17] X Research source"
    },
    {
      "title": "Teach your dog to respond to a “quiet” command.",
      "content": "Teach your dog to respond to a “quiet” command. Teaching your dog how to respond to a “quiet” command is more productive than yelling at your dog to “be quiet” or “shut up.” As with any behavior you want to instill in your dog, consistency is key. Begin by teaching your dog to “speak” on command. You can do this by knocking on the door to simulate a visitor. When the dog barks, provide a treat (and remember to use the clicker if you’re clicker training). Once the dog responds regularly and looks for the treat, give this behavior a cue word, such as “speak.” Once your dog can reliably bark on command, teach the “quiet” command. Find a quiet environment with no distractions. Tell your dog to “speak,” then say “quiet,” wait for the to stop barking, use the clicker if you’re clicker training, and reward your dog with a treat. Repeat as necessary until your dog learns to associate the command “quiet” with stopping its barking and with being rewarded for the quiet. [18] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    }
  ]
}