{
  "url": "https://www.wikihow.com/Steam-Cabbage",
  "title": "Steaming Cabbage in the Microwave the Stove: 2 Easy & Delicious Recipes",
  "steps": [
    {
      "title": "Choose fresh, crisp cabbage.",
      "content": "Choose fresh, crisp cabbage. Regardless of the specific variety, fresh cabbage has crisp leaves without any marks or signs of browning. There should not be many loose outer leaves, and the stem should not look dry or cracked. Green cabbage should have dark green outer leaves and pale green inner leaves. The head of cabbage should be round. White cabbage has very light outer leaves with patches of white around the veined areas. It has firm leaves packed tightly around the head. Red cabbage should have tough outer leaves and a reddish purple color. The head of cabbage should be round. Savoy cabbage has crinkled leaves and consists of fairly loose leaves that range in color from dark to light green. The head of cabbage should be round. Napa cabbage is tall, rather than round, and generally has pale green leaves. Bok choy has tall white stalks with dark green leaves."
    },
    {
      "title": "Removed damaged leaves.",
      "content": "Removed damaged leaves. These leaves should be loose enough to peel away with your hands. Damaged leaves include any that are discolored or wilted. For round heads of cabbage, like green cabbage, red cabbage, and savoy cabbage, you should also remove the thickest outer leaves."
    },
    {
      "title": "Cut the cabbage into halves or quarters.",
      "content": "Cut the cabbage into halves or quarters. Hold the cabbage still with one hand. Pick up a large, sharp knife in your other hand and cut the cabbage in half through the stem end. If desired, cut the cabbage further into quarters by cutting each half in half again lengthwise. Cabbage will take longer to cook if left in halves, but otherwise, it is just as easy to prepare as quartered cabbage. If you see any signs of insects or worms inside the cabbage, you do not need to toss the whole thing out. Instead, soak the head of cabbage in heavily salted water for 20 minutes. Cut away the damaged portions and prepare as normal."
    },
    {
      "title": "Remove the core.",
      "content": "Remove the core. Cut wedge-shaped sections from the bottom of each half or quarter to remove the rough stem pieces. The stems will need to be cut out at an angle. Note that for cabbage with long, loose leaves, such as napa cabbage and bok choy, the leaves should be left intact and on the stem."
    },
    {
      "title": "Shred the cabbage, if desired.",
      "content": "Shred the cabbage, if desired. If you want to shred the cabbage before steaming it, slice each quarter into thin pieces and separate the layers by hand. Alternatively, you could shred the cabbage by sliding quartered heads across a sharp mandoline. If shredding napa cabbage or bok choy, slice the cabbage crosswise rather than lengthwise and separate the layers."
    },
    {
      "title": "Wash the cabbage.",
      "content": "Wash the cabbage. Place the cabbage in a colander and rinse it under cool, running water. Place the colander over clean paper towels and let it drain for a couple of minutes before continuing."
    },
    {
      "title": "Bring a stockpot of water to boil.",
      "content": "Bring a stockpot of water to boil. Meanwhile, fit a steamer basket into the stockpot, noting that the bottom of the basket should not come into contact with the water. The stockpot should only be about 1/4 full with water, if not less. After placing the stockpot on your stove, heat it over high heat to get a rapid boil going. You could add salt to the water, if desired, which will add subtle flavor to the cabbage as it cooks. Do not do this if you plan on salting the cabbage directly, though. The bottom of the steamer basket should never come into direct contact with the boiling water. If the boiling water reaches through the bottom of the basket, you may end up boiling the bottom part of the cabbage instead of steaming it. If you do not have a steamer basket, you could use a metal or wire mesh colander, instead. Just make sure that the colander can rest on the lip of the stockpot without falling in and without preventing the lid from fitting over it."
    },
    {
      "title": "Place the prepared cabbage in the steamer basket.",
      "content": "Place the prepared cabbage in the steamer basket. Spread the cabbage out in an even layer. If steaming shredded cabbage, you will need to make sure that the cabbage is evenly distributed throughout the bottom of the steamer basket. If steaming quarters or halves, arrange the pieces so that they are touching and facing stem-side down. Each piece should be equally exposed to the bottom of the basket."
    },
    {
      "title": "Season with salt and pepper.",
      "content": "Season with salt and pepper. Sprinkle the leaves with salt and pepper, if desired, to add flavor to the cabbage as it cooks. Use about 1 tsp (5 ml) of salt and 1/2 tsp (2.5 ml) of ground black pepper, or add more or less of the seasonings to match your own tastes. At this stage, you should not add any oil or dressings to the cabbage. Only dry seasonings, like salt and pepper, should be added."
    },
    {
      "title": "Cover and cook until tender-crisp.",
      "content": "Cover and cook until tender-crisp. The exact amount of time the cabbage needs to be steamed for will vary on the type and on how fine the cabbage was cut before you placed it in the basket. To promote even cooking, you may flip the wedges or halves over halfway through the cooking time. [1] X Research source Other than that, however, you should not lift the lid of the pot. Doing so will release the steam needed to cook the cabbage. In general, cook shredded cabbage for 5 to 8 minutes. Napa cabbage, savoy cabbage, and bok choy, however, may cook in only 3 to 5 minutes. In general, quarters should be cooked for 10 to 12 minutes. Tall cabbages like napa cabbage and bok choy tend to finish on the shorter end. Savoy cabbage can cook in as few as 5 minutes and as many as 10 minutes. Red cabbage may take a few minutes longer than other varieties. Add an additional 1 or 2 minutes onto the quartered cooking time when you are steaming cabbage halves."
    },
    {
      "title": "Serve hot.",
      "content": "Serve hot. Remove the steamer basket from the stockpot and let it drain on clean paper towels for a few minutes before serving. If desired, you could sprinkle the cabbage with additional salt and pepper or drizzle melted butter or olive oil over it. Toss well yet gently to coat. For a stronger flavor, drizzle 2 to 3 Tbsp (30 to 45 ml) of apple cider vinegar over the cabbage and toss to coat. [2] X Research source This works especially well with napa cabbage and red cabbage."
    },
    {
      "title": "Place the cabbage in a microwave-safe dish.",
      "content": "Place the cabbage in a microwave-safe dish. Arrange the cabbage so that it is in even layers inside the dish. If steaming shredded cabbage, make sure that the cabbage is evenly distributed throughout the bottom of the dish. It does not need to be in a single flat layer, but the layers of cabbage should be even to promote even cooking. Note that shredded cabbage is not recommended for microwave steaming since the bottom layer will ultimately be boiled instead of steamed. If steaming quarters or halves, arrange the pieces so that they are touching and facing stem-side down. Do not stack or layer the wedges."
    },
    {
      "title": "Add 2 to 3 Tbsp (30 to 45 ml) water.",
      "content": "Add 2 to 3 Tbsp (30 to 45 ml) water. The water level at the bottom of the dish should be kept very low. If cooking shredded cabbage, use roughly 1/4 cup (60 ml) of water for every 2 cups (500 ml) of shredded cabbage. The increased water may half-boil and half-steam, but if you do not increase the amount of water, the cabbage is not likely to cook evenly. For a boost of flavor, you could use broth instead of water. Vegetable broth is the best option, but a mild chicken broth can work just as well."
    },
    {
      "title": "Cover loosely.",
      "content": "Cover loosely. If the dish has a microwave-safe lid, use that. If not, use microwavable plastic wrap. Do not cover tightly. If the dish has a lid you can use, place the lid on slightly askew to prevent too much pressure from building up or open any vent valves. Do not pierce the plastic wrap. Instead, simply drape the plastic wrap over so that it clings to the top of the dish but not around the sides. If you do not have a lid or plastic wrap, you could cover the dish by placing an upside-down microwave-safe plate over the top of it."
    },
    {
      "title": "Microwave until tender-crisp.",
      "content": "Microwave until tender-crisp. The exact amount of time will vary based on the wattage of your microwave, how large the pieces of cabbage are, and what type of cabbage you are using. For wedges, microwave on high for 5 to 6 minutes. If steaming bok choy, however, drop this amount of time to 4 to 5 minutes. For shredded cabbage, microwave on high for 5 minutes. Pause at the halfway mark, quickly stir it with a fork or spoon, and continue cooking."
    },
    {
      "title": "Serve hot.",
      "content": "Serve hot. Let the cabbage drain in a colander or on clean paper towels and serve while still warm. If desired, sprinkle the steamed cabbage with salt and pepper or drizzle melted butter or olive oil over it. Toss well yet gently to coat. For a stronger flavor, drizzle 2 to 3 Tbsp (30 to 45 ml) of apple cider vinegar over the cabbage and toss to coat. This works especially well with napa cabbage and red cabbage."
    }
  ]
}