{
  "url": "https://www.wikihow.com/Uninstall-League-of-Legends",
  "title": "How to Completely Uninstall League of Legends From PC",
  "steps": [
    {
      "title": "Exit League of Legends.",
      "content": "Exit League of Legends. If you happen to have the game running, go ahead and close out of it."
    },
    {
      "title": "Close out of the Riot client.",
      "content": "Close out of the Riot client. You may need to close out of the Riot client first. Use the following steps to do so: Click the \"Show hidden icons\" icon in the Windows taskbar. It resembles an arrow pointing up. Right-click the Riot client icon. It resembles a red circle with a fist in the middle. Click Exit ."
    },
    {
      "title": "Click the Windows Start button .",
      "content": "Click the Windows Start button . It's the button that has the Windows logo. It's in the taskbar at the bottom of the screen, by default."
    },
    {
      "title": "Click the Settings/gear icon .",
      "content": "Click the Settings/gear icon . It's the icon that resembles a gear. On Windows 11, it's in the Apps menu. On Windows 10, it's in the sidebar to the left."
    },
    {
      "title": "Click Apps.",
      "content": "Click Apps . On Windows 11, it's in the menu bar to the left. On Windows 10, it's next to an icon that resembles four lines next to four boxes."
    },
    {
      "title": "Click Installed Apps (Win 11) or Apps & Features (Win 10).",
      "content": "Click Installed Apps (Win 11) or Apps & Features (Win 10). On Windows 11, it's the first option at the top of the Apps menu. On Windows 10, it's the first option at the top of the menu bar to the left. Alternatively, you type \"Remove Programs\" into the Windows search bar to display this page in the Start menu."
    },
    {
      "title": "Click League of Legends.",
      "content": "Click League of Legends . On Windows 11, click ⋯ next to League of Legends. This will display a drop-down menu."
    },
    {
      "title": "Click Uninstall.",
      "content": "Click Uninstall . It's at the bottom of the drop-down menu. This displays a confirmation pop-up. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Uninstall in the pop-up.",
      "content": "Click Uninstall in the pop-up. This uninstalls League of Legends."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . You will see a notification when League of Legends is finished uninstalling. Click Done to close the pop-up."
    },
    {
      "title": "Exit League of Legends.",
      "content": "Exit League of Legends. If you happen to have the game running, go ahead and close out of it. If you are not sure how to exit out of the game, you can force it to quit ."
    },
    {
      "title": "Close out of the Riot client.",
      "content": "Close out of the Riot client. You may need to close out of the Riot client first. Use the following steps to do so: Click the \"Show hidden icons\" icon in the Windows taskbar. It resembles an arrow pointing up. Right-click the Riot client icon. It resembles a red circle with a fist in the middle. Click Exit ."
    },
    {
      "title": "Click the Windows Start button .",
      "content": "Click the Windows Start button . It's the button that has the Windows logo. It's in the taskbar at the bottom of the screen, by default."
    },
    {
      "title": "Type control panel.",
      "content": "Type control panel . This displays the Control Panel in the Windows Start menu."
    },
    {
      "title": "Click Control Panel.",
      "content": "Click Control Panel . It has an icon that resembles a blue screen with some graphs. This opens the Windows Control Panel."
    },
    {
      "title": "Click Uninstall a Program.",
      "content": "Click Uninstall a Program . It's below \"Programs\" on the Category page. If you don't see this option, click Programs and Features instead."
    },
    {
      "title": "Click League of Legends.",
      "content": "Click League of Legends . It's in the list of applications installed on Windows."
    },
    {
      "title": "Click Uninstall.",
      "content": "Click Uninstall . It's at the top of the list of programs. This displays a confirmation pop-up."
    },
    {
      "title": "Click Uninstall in the pop-up.",
      "content": "Click Uninstall in the pop-up. This uninstalls League of Legends."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . You will see a notification when League of Legends is finished uninstalling. Click Done to close the pop-up."
    },
    {
      "title": "Exit League of Legends.",
      "content": "Exit League of Legends. If you happen to have the game running, go ahead and close out of it. If you are not sure how to exit out of League of Legends, you can force quit the application ."
    },
    {
      "title": "Open the Finder .",
      "content": "Open the Finder . It has an icon that resembles a blue and white smiley face. It's in the dock at the bottom of the screen."
    },
    {
      "title": "Click Applications.",
      "content": "Click Applications . It's usually in the menu bar to the left. This displays all your installed applications on your Mac."
    },
    {
      "title": "Locate League of Legends.",
      "content": "Locate League of Legends. It may be a folder called \"League of Legends\" or \"LOL.\""
    },
    {
      "title": "Drag League of Legends to the Trash.",
      "content": "Drag League of Legends to the Trash. The Trash bin is the icon that resembles a white trashcan in the Dock at the bottom of the screen. Drag the League of Legends app to the Trash to uninstall it."
    },
    {
      "title": "Empty the Trash.",
      "content": "Empty the Trash. To do so, right-click (or Command-click ) the Trash icon in the dock and click Empy Trash . This will delete the contents of the Trash bin."
    },
    {
      "title": "Press ⊞ Win+E to open File Explorer .",
      "content": "Press ⊞ Win + E to open File Explorer . File Explorer has an icon that resembles a folder with a blue clip. Click the File Explorer icon in the taskbar or Windows Start menu to open File Explorer, or use the keyboard shortcut ."
    },
    {
      "title": "Navigate to the League of Legends install folder.",
      "content": "Navigate to the League of Legends install folder. If you have no interest in reinstalling League of Legends and playing it again, you can delete the residue files, which include your save files. By default, it can be found in the Riot Games folder, unless you chose a different installation location when you installed the game. The default location for the League of Legends installation folder is C:\\Riot Games\\League of Legends ."
    },
    {
      "title": "Select the League of Legends folder.",
      "content": "Select the League of Legends folder. By default, it's in the Rio Games folder. If you are in the League of Legends folder, click the Back button to navigate back one folder."
    },
    {
      "title": "Press the Delete key.",
      "content": "Press the Delete key. This deletes the League of Legends folder."
    },
    {
      "title": "Empty the Recycling Bin.",
      "content": "Empty the Recycling Bin. To do so, right-click the Recycling Bin on your desktop and click Empty Recycling Bin . This permanently deletes all residual files."
    },
    {
      "title": "Open the Finder .",
      "content": "Open the Finder . It has an icon that resembles a blue and white smiley face. It's in the dock at the bottom of the screen."
    },
    {
      "title": "Press ⌘ Command+⇧ Shift+G.",
      "content": "Press ⌘ Command + ⇧ Shift + G . This will open the \"Go to Folder\" window. If you have no interest in reinstalling League of Legends and playing it again, you can delete the residue files, which include your save files."
    },
    {
      "title": "Enter one of the following locations and click Go.",
      "content": "Enter one of the following locations and click Go . There are three separate locations you will need to check to delete League of Legends residual files. You will need to check each location one at a time. Copy and paste one of the following locations in the bar and click Go . ~/Library/Caches/ ~/Library/Preferences/ ~/Library/Saved Application Data/"
    },
    {
      "title": "Look for any files related to League of Legends.",
      "content": "Look for any files related to League of Legends. Look for any files or folders that say \"League of Legends\" or \"Riot Games\"."
    },
    {
      "title": "Drag the files or folders to the trash.",
      "content": "Drag the files or folders to the trash. The Trash bin is the icon that resembles a white trashcan in the Dock at the bottom of the screen."
    },
    {
      "title": "Empty the Trash.",
      "content": "Empty the Trash. To do so, right-click (or Command-click ) the Trash icon in the dock and click Empy Trash . This will delete all the residual files you moved to the Trash."
    }
  ]
}