{
  "url": "https://www.wikihow.com/Spell-Save-Dc-5e",
  "title": "Beginner’s Guide to Spell Save DCs in D&D 5e (Plus How to Increase Them)",
  "steps": [
    {
      "title": "Spell save DCs determine how hard it is for targets to avoid your spell.",
      "content": "Spell save DCs determine how hard it is for targets to avoid your spell. Some spells in D&D 5e allow the target a chance to escape (or reduce) the spell’s effects. When you cast a spell that gives targets a chance to escape, they must then make a saving throw . Your character’s spell save DC is the total number that they need to meet (or exceed) in order to successfully resist the spell. [1] X Research source In Dungeons & Dragons , “DC” is an acronym for “difficulty class.” That’s why your character’s “spell save difficulty class” dictates how difficult it is to avoid their spells. For example, say your character cast the Cloudkill spell on an enemy. The enemy would have to pass a constitution saving throw or take full damage from your spell. So, if your spell save DC is 15, the enemy’s saving throw would have to equal 15 or higher to pass the save and take less damage from Cloudkill."
    },
    {
      "title": "Your character will use the same spell save DC for all their spells.",
      "content": "Your character will use the same spell save DC for all their spells. Various spells on your spell list will likely call for the target to make different kinds of saving throws , but the number they have to beat will always be the current total of your spell save DC. You can check each spell’s description to find out whether it uses a saving throw or an attack roll and which ability it uses. [2] X Research source For example, your character might have 3 different spells on their list requiring a different saving throw: Burning Hands (dexterity saving throw), Mind Sliver (intelligence saving throw), and Toll the Dead (wisdom saving throw). If you hit a target with each spell, they’d need to make 3 different saves, but each saving throw would need to beat the same number (your spell save DC)."
    },
    {
      "title": "The spell save formula is 8 + spellcasting ability modifier + proficiency.",
      "content": "The spell save formula is 8 + spellcasting ability modifier + proficiency. If you aren’t sure what your character’s spell save DC is, calculate it! The base number for your spell DC is 8. Add your character’s spellcasting ability modifier, which is based on the ability score that fuels their spellcasting. Then, add your character’s proficiency bonus, which increases as they level up. [3] X Research source To play D&D, you must roll 6 ability scores for your character: strength, wisdom, dexterity, intelligence, charisma, and constitution. A modifier is what you add to dice rolls when you try to do something related to each ability. So, for example, if your character’s spellcasting ability was intelligence, you’d look at their intelligence modifier to calculate their spell save DC. If you need to find your character’s current ability modifier or proficiency bonus, you can find charts for both in the 5e Player’s Handbook."
    },
    {
      "title": "A player character’s spellcasting ability score is based on their class.",
      "content": "A player character’s spellcasting ability score is based on their class. All spellcasters in D&D 5e rely on a single stat ( ability score ) to cast their spells. Depending on your character’s class, they’ll use either Intelligence, Charisma, or Wisdom for spellcasting. The modifier associated with that ability score is their spellcasting ability modifier—which in turn determines their spell save DC. [4] X Research source Classes that use Intelligence: wizards, artificers, fighters (eldritch knights), and rogues (arcane tricksters). Classes that use Charisma: sorcerers, bards, paladins, and warlocks. Classes that use Wisdom: clerics, druids, monks (sun soul, shadow, and four elements), and rangers."
    },
    {
      "title": "Area-of-effect spells trigger spell saves and damage multiple targets.",
      "content": "Area-of-effect spells trigger spell saves and damage multiple targets. Certain types of spells tend to utilize a spell save DC rather than an attack roll, and one of those is area-of-effect spells. They deal damage directly to enemies and most often require a dexterity or constitution saving throw to avoid. Depending on their class, your character might have area-of-effect spells like Fireball, Spirit Guardians, or Moonbeam. [5] X Research source For example, say your character cast a level 3 Fireball spell. Enemies in the area of effect would need to make a dexterity saving throw versus your spell save DC to try and evade the spell."
    },
    {
      "title": "Mind-affecting spells can enchant targets if they fail a spell save.",
      "content": "Mind-affecting spells can enchant targets if they fail a spell save. In D&D 5e, mind-affecting spells are designed to charm or trick your target, manipulating them to your advantage rather than outright dealing damage. Because they’re related to mental clarity and alertness, most mind-affecting spells will require intelligence, charisma, or wisdom saving throws. [6] X Research source For example, you might cast Feeblemind on an enemy—a spell designed to shatter their intellect, which can drastically reduce their combat abilities. They’d need to make an intelligence saving throw against it."
    },
    {
      "title": "Spells that inflict status effects force the target to make a spell save.",
      "content": "Spells that inflict status effects force the target to make a spell save. Status effects like “blinded,” “deafened,” or “paralyzed” can turn the tide of a battle in a heartbeat! Status effect spells are designed to incapacitate your character’s foes, making them less effective and giving you an advantage on the battlefield. Most status effect spells trigger constitution or wisdom saving throws. [7] X Research source For example, you might decide to immobilize an enemy, preventing them from acting, and cast the Hold Person spell—which would require them to make a wisdom saving throw against your spell DC."
    },
    {
      "title": "When targets fail against your DC, they’re fully affected by your spell.",
      "content": "When targets fail against your DC, they’re fully affected by your spell. Whether the spell you cast is designed to deal out damage, alter an enemy’s mind, or trigger a status effect, it will succeed if the target’s saving throw total is less than your save DC. Your GM (game master) will roll the saving throw for your target and tell you whether it was a success or failure. [8] X Research source For example, say an enemy tried to save against your Fireball spell but rolled a 13 when your DC is 16. That means they’d fail and take a full 8d6 points of fire damage! Alternatively, if you cast a spell like Feeblemind or Hold Person and the target failed their save against your spell DC, the spell would take full effect on them."
    },
    {
      "title": "Targets that save against your DC are less affected by your spell.",
      "content": "Targets that save against your DC are less affected by your spell. Depending on what your spell does, a target who successfully saves against your spell DC might suffer a reduced effect or might avoid its effects entirely. The target’s saving throw must be equal to or greater than your spell save DC to pass. Be sure you read all spell descriptions, which describe the effects of successful and failed saving throws. [9] X Research source For example, if you cast Fireball with a spell DC of 15 and the target rolled a 15 on their dexterity save, they would succeed in the saving throw. If your enemies saved against your Fireball spell, they’d take half the spell’s damage—not the full 8d6. A successful save reduces the damage of most area-of-effect spells. If your target succeeded against a spell like Feeblemind or Hold Person, they’d resist entirely. Most mind and status-effect spells end immediately if the target saves against your spell DC."
    },
    {
      "title": "Level up your character to increase your spell save DC.",
      "content": "Level up your character to increase your spell save DC. The easiest way to build your character’s spell save DC is to simply let it grow as they level up. This is a natural progression; as your character’s proficiency bonus increases over time, so will their spell save DC (since proficiency is one of the factors in calculating the DC). [10] X Research source Your character’s proficiency bonus increases by 1 at the 5th, 9th, 13th, and 17th level. At level 1, you’ll start with a proficiency bonus of +2, and at level 20, you’ll have a proficiency bonus of +6. So, for example, if your character started at level 1 with a spell save DC of 14, or 8 + 4 (ability score modifier) + 2 (proficiency), then their spell save DC at level 20 would be at least an 18 (or 8 + 4 + 6)."
    },
    {
      "title": "Boost your character’s main spellcasting stat to improve their DC.",
      "content": "Boost your character’s main spellcasting stat to improve their DC. Your character’s ability score modifier is the other variable in D&D 5e’s spell save DC equation—and, if you increase their main ability score, their modifier will grow too. You can easily do this while leveling up your character, either by choosing an ability score improvement or a feat that comes with a stat bonus. [11] X Research source For example, if your character’s spell save DC depends on their intelligence score modifier, you could make it your mission to keep improving that score (to a maximum score of 20). Say your character’s current intelligence score was 17, with a +3 modifier. If you increased that number to 18 while leveling them up, their modifier would become a +4—and their spell save DC would increase by 1 as well."
    },
    {
      "title": "Search for a magical item that can enhance your character’s DC.",
      "content": "Search for a magical item that can enhance your character’s DC. Magical items are scattered throughout every fantastical world as you play D&D 5e ! Furthermore, some of the more powerful items can either boost the ability score your character uses to cast spells or directly augment your character’s spell save DC. Keep an eye out for items like this in your adventures, as they can be incredibly useful. [12] X Research source For example, if your character found a headband of intellect, their intelligence score would automatically jump to 19 (if it’s currently lower than that). At higher levels, your character might find something extremely powerful, like a robe of the archmagi or rod of the pact keeper—which both give a bonus to their spell save DC. A few items can even enhance ability scores past the usual maximum of 20. For example, a tome of leadership and influence offers a +2 charisma bonus no matter what. If your character’s charisma were 19, it’d be 21 after using the tome."
    },
    {
      "title": "The highest possible natural spell save DC for most classes is 19.",
      "content": "The highest possible natural spell save DC for most classes is 19. In this case, “natural” means leveling your character up without using any extra items to augment your DC. That means you’d have 8 + 6 (the max proficiency bonus) + 5 (the usual max modifier for an ability score), for a total of 19. However, specific magical items grant a boost to your permanent (final) spell save DC, up to a total of 30. For example, if you played a warlock using a robe of the archmagi (+2 bonus), a rod of the pact keeper (+3 bonus), an ioun stone of mastery (+1 bonus), and a tome of leadership (+1 bonus) your save DC would be 26. Then, if you multi-classed and took a level in cleric, you’d be able to equip an amulet of the devout (+3 bonus), bringing your spell save DC to a whopping 29. Finding a rare item like the deck of many things (and successfully drawing the star card) would give you the final +1 bonus to give you a spell save DC of 30. Keep in mind that this is an extreme example! Most D&D PCs shouldn’t get a spell save DC that high and certainly don’t need a DC of 30 to be effective in combat."
    }
  ]
}