{
  "url": "https://www.wikihow.com/Stop-Your-Cockatiel-from-Biting",
  "title": "How to Stop Your Cockatiel from Biting",
  "steps": [
    {
      "title": "Wear long sleeves and thick gloves when handling the bird.",
      "content": "Wear long sleeves and thick gloves when handling the bird. If your cockatiel is known to bite, you can prevent injuries by wearing protective clothing. Put on a long-sleeved shirt and a thick jacket to protect your arms. Wear leather gloves to protect your fingers and hands."
    },
    {
      "title": "Don’t allow children or the elderly to handle a biting bird.",
      "content": "Don’t allow children or the elderly to handle a biting bird. Children and older adults may be injured more severely by a bird bite. Therefore, they should not handle a cockatiel that bites."
    },
    {
      "title": "Find out why the bird is biting.",
      "content": "Find out why the bird is biting. Cockatiels often communicate with their owners through biting. If you can figure out what the bird is trying to tell you, it will likely stop biting you. A cockatiel can bite when it is trying to sleep and you disturb it, when it needs to go to the bathroom, or when feeling protective and trying to warn you about a real or perceived danger. [2] X Research source Other reasons a bird may bite are if it is startled or scared, in self-defense, if it associates your hands with negative consequences (such as if you use your hands to shoo the bird away), or if it doesn’t like what you are doing. [3] X Research source Once you’ve figured out what your bird is communicating, you’ll be able to better anticipate its needs and avoid being bitten in the future."
    },
    {
      "title": "Do not react angrily or loudly to being bitten.",
      "content": "Do not react angrily or loudly to being bitten. Although you may be surprised or startled if bitten by your cockatiel, yelling or striking out at the bird will only frighten it. Sensitive cockatiels will only become more frightened if you yell or shout. This, in turn, may cause the bird to bite you again out of fear. If the cockatiel was abused or neglected in a previous home, animal shelter, or pet store, it may be prone to biting."
    },
    {
      "title": "Tell the bird “no” in a stern voice.",
      "content": "Tell the bird “no” in a stern voice. By saying “no,” you can train your bird to stop biting you—or at least stop it from biting you when you give the command. Be consistent when you do this, and say “no” every time the bird bites you or makes a move to bite you. Like any animal, cockatiels won’t learn audio commands if they are not used consistently. You’ll need to be patient with a biting cockatiel. Animal behavior does not change overnight, and it may take weeks for your pet cockatiel to stop biting if it’s grown accustomed to the behavior with you or another owner."
    },
    {
      "title": "Tip the bird slightly off balance.",
      "content": "Tip the bird slightly off balance. In addition to saying “no” to a biting cockatiel, tip its perch so that the bird is slightly off balance. This will cause the bird to regain its footing and take its attention off of biting you. Your cockatiel will also come to associate the word “no” with being tipped off balance, and will soon stop biting as soon as you give the command. Slightly tipping the bird off balance does not harm the bird in any way, and is not mean or abusive. This is simply a gentle form of showing your bird that it’s not allowed to bite you. If the bird is on your arm or shoulder, lean a little to shift the bird’s balance."
    },
    {
      "title": "Leave the bird alone when it’s biting you.",
      "content": "Leave the bird alone when it’s biting you. If you’re playing with the pet cockatiel or petting its head or body, the cockatiel may bite you to indicate that it’s tired of that attention. This does not mean that your cockatiel is angry with you, or that it will not want your attention again in the future. It may simply want you to stop touching it. [4] X Research source Pet birds have few other means of communicating with their human owners, and so biting serves as a default communication signal. Watch for signs that the bird is about to bite you. The bird will look at what it is about to bite, open its mouth, spread its legs apart or grip its perch, or even charge at you. [5] X Research source"
    },
    {
      "title": "Let your cockatiel rest if it starts biting you.",
      "content": "Let your cockatiel rest if it starts biting you. Cockatiels and other types of parrot need plenty of sleep, and may become grumpy if they don’t get enough rest. [6] X Research source If your bird has been awake for hours and begins biting, put it back in its cage. Leave the room, and allow the cockatiel to rest or sleep if it wants to. Do not reach into your cockatiel’s cage and wake it when it’s sleeping. All pet birds should be left alone while they are resting, and a rudely awakened bird may be angry and bite."
    },
    {
      "title": "Do not reward the cockatiel for biting.",
      "content": "Do not reward the cockatiel for biting. If you pet your cockatiel and give it attention every time it bites you, the bird will soon learn that biting will lead to positive attention. [7] X Research source Instead of rewarding the bird, try ignoring its bad behavior. Put the bird back in its cage and leave the room when it bites. The bird will soon learn that its biting will not result in positive attention."
    },
    {
      "title": "Trim the cockatiel’s wing feathers.",
      "content": "Trim the cockatiel’s wing feathers. Cockatiels—and male birds especially—can develop aggressive behavior if their wing feathers are fully grown out. If you notice your male cockatiel going through sporadic periods of increased biting or pecking, try trimming the feathers on the tips of its wings. [8] X Research source If you haven’t trimmed your bird’s wings before or do not feel comfortable trimming them yourself, take the cockatiel to a vet who can perform the procedure. Trimming your bird’s wing feathers will also prevent them from being able to fly away."
    },
    {
      "title": "House your cockatiel in a larger cage.",
      "content": "House your cockatiel in a larger cage. Cockatiels—like any breed of parrot—need enough space to feel comfortable and not cramped. This means that their cage needs to be large enough to comfortably accommodate the bird. If the cage that you’re currently housing the cockatiel in is too small, it will become agitated and much more likely to bite you. If this is your first time owning a cockatiel, plan to buy it a medium to large cage. Cockatiels have impressive crests and large tails, and so need more space than you might think. A cockatiel’s cage should be at least 20 inches (51 cm) wide, 20 inches (51 cm) deep, and 24 inches (61 cm) tall."
    },
    {
      "title": "Add perches or toys to your cockatiel’s cage.",
      "content": "Add perches or toys to your cockatiel’s cage. Your cockatiel will enjoy the added entertainment that these objects in its cage provide, and will experience fewer aggressive moods. Perches come in a variety of sizes, shapes, and textures, and can be made from natural or synthetic materials. Cockatiels prefer softwood perches, so look for this variety at your local pet store. To encourage your cockatiel to spend more time playing in its cage, try giving it items you can find around the home, including: toilet paper rolls, large Lego bricks, buttons, and shiny objects like metal bells. If your bird tries to eat plastic perches, remove them immediately and replace them with stainless steel perches."
    },
    {
      "title": "Cool your home during breeding season.",
      "content": "Cool your home during breeding season. Cockatiels tend to produce breeding hormones during times of seasonal change, such as from summer to fall. Cockatiels can become more aggressive—and bite more often—when they are experiencing breeding hormones. Both male and female birds can before territorial and defensive, and defend any areas that they may consider nesting sites. To diffuse these behaviors in cockatiels, lower the temperature in the room in which the cockatiel is kept. As an example, if your house is usually 75 °F (24 °C), lower the temperature to about 65 °F (18 °C) in the room where you keep your cockatiel. Don’t lower the temperature too much though, or the bird could get sick."
    }
  ]
}