{
  "url": "https://www.wikihow.com/Talk-to-Your-Parents",
  "title": "How to Talk to Your Parents",
  "steps": [
    {
      "title": "Be brave.",
      "content": "Be brave. No matter what the subject, know that you will lessen the burden on your shoulders as soon as you share it with your parents. Don’t feel worried, anxious, or embarrassed as your parents are meant to be there for you always. They may also know more than you think. [1] X Research source"
    },
    {
      "title": "Don’t worry that your parents will get upset or react poorly.",
      "content": "Don’t worry that your parents will get upset or react poorly. With proper planning and communication, you will be able to have the conversation that you’re looking for. Your parents get worried because they care about you and want the best for you. With that in mind, they will be happy that you are seeking their advice for a problem. [2] X Research source"
    },
    {
      "title": "Don’t avoid the conversation.",
      "content": "Don’t avoid the conversation. Any problems or awkwardness won’t simply go away if you avoid having a conversation with your parents. Relieve the stress by getting it out in the open. Knowing that your parents are trying to understand you and solve any problems can help alleviate your stress and anxiety. [3] X Research source"
    },
    {
      "title": "Know who you want to speak to.",
      "content": "Know who you want to speak to. Do you want to talk to both your parents or is it something mom is better suited to handle? Your relationship with each parent is going to be different so ask yourself what will be the most appropriate course of action. [4] X Research source Some topics might be easier to discuss with one parent over the other, one parent might be calmer while the other is quicker to anger. In this case, it may be best to talk to your calmer parent first and then talk to the other parent together. Know that your parents are most likely going to tell each other about a conversation you have no matter if you only tell one of them. It’s best to include both in your conversation but smart to enlist the help of one to talk to the other if you feel that’s the best course of action. For example, you don’t want to alienate your dad by only telling your mom about a school bully. Ask your mom if you can talk to your dad together because you’re scared he will get angry at you for not standing up and fighting."
    },
    {
      "title": "Set aside time to have your conversation.",
      "content": "Set aside time to have your conversation. Find out your parents’ schedule so you know when a good time to chat will be. You don’t want your parents to be distracted thinking about a meeting or having to prepare dinner. The location of your conversation is also important as you may not want any distractions like TV or your parents’ coworkers chiming in. [5] X Research source"
    },
    {
      "title": "Plan for the outcome.",
      "content": "Plan for the outcome. While you may know what you want out of the conversation, there could be several different answers your parents give you. Plan for everything. Ideally, you want the conversation to go your way but it’s okay if it doesn’t. You are never alone as there are numerous resources including teachers and other responsible adults. If the outcome is not what you desired, you can try several things: Talk to your parents again. Perhaps you caught them at a bad time. If they are already having a bad day they might not be in the best frame of mind to discuss your situation with an open mind. For example, don’t ask them if you can go to the school dance after you just made them late for your sister’s dance recital. Drop it. There’s no sense in infuriating your parents and ruining your chance at getting what you want anytime in the near future. If you have had a respectful and open conversation and both sides have pleaded their case, accept that your parent’s point of view. Showing them that you are mature enough to respect their perspective will help your case in the future as they will be more receptive to what you have to say knowing that you are able to keep your emotions in check. Seek outside support. Enlist the help of your grandparents, your friends' parents, or teachers to help plead your case. Your parents will always be protective of you so asking outside support can convince them that you can handle a situation. For example, you can ask an older sibling tell your parents that they have been to the area that you want to go to and can escort you to the location to make sure it's safe."
    },
    {
      "title": "Write down what you want to say.",
      "content": "Write down what you want to say. You don’t have to prepare an entire script but it at least gives you a few jumping off points. It will also allow you to organize your thoughts so you can get a sense of how the conversation might go. [6] X Research source You can start with saying things similar to, “Dad, I need to tell you something that I’ve been stressed about.” “Mom, do you mind if I talk to you about something?” “Mom, dad, I’ve made a huge mistake and need your help.”"
    },
    {
      "title": "Talk to your parents about trivial things everyday.",
      "content": "Talk to your parents about trivial things everyday. IF you don’t already have a relationship with your parents where you talk everyday, begin one by talking about little things. If you make it a habit to talk to your parents about anything, it will be easier for them to hear you out. It also builds your relationship stronger. [7] X Research source It’s never too late to talk to your parents. Even if you haven’t talked to them in over a year, start with a simple hello. Say something similar to, “I just wanted to let you know what I’ve been up to and chat for a little bit. We haven’t spoken in a while and I’d like to let you know what’s going on in my life.” Your parents will appreciate the gesture and may find it easier to keep the dialogue open."
    },
    {
      "title": "Test the waters.",
      "content": "Test the waters. If you think a topic is too sensitive or you know that your parents will react harshly, ease into the conversation over a period of time. Ask probing questions to get a sense of their response or to hint at what you want to talk about. For example, if you need to talk to your parents about being sexually active, say something like, “Mom, Lisa has been dating her boyfriend for a year now, it seems really serious. Do you think things can be serious in the 11th grade?” By using your friend to give context to a situation, you can gain a lot of insight into how your parents may react to you. You can pick their brain but be careful not to be too obvious as they may be able to figure out your line of questioning and ask you about your situation."
    },
    {
      "title": "Know what you want the result to be.",
      "content": "Know what you want the result to be. It’s impossible to plot out the course of a conversation if you don’t know the destination. Ask yourself what you want the dialogue to accomplish so you know what tools you can use."
    },
    {
      "title": "Ensure that your message is clear and direct.",
      "content": "Ensure that your message is clear and direct. Clearly let them know what you think, how you feel, and what you want. It’s easy to get nervous and ramble or fumble on your words. Prepare for the conversation to ease your nerves and give detailed examples until you are sure your parents understand what you are saying. [8] X Research source"
    },
    {
      "title": "Be honest.",
      "content": "Be honest. Don’t exaggerate or lie. It may be difficult to hide your emotions if the topic is highly sensitive. Speak sincerely and make sure that your parents aren’t dismissing anything you say. If you have lied in the past or are regularly dramatic, it may take time for your parents to believe you but be persistent. [9] X Research source"
    },
    {
      "title": "Understand your parents’ point of view.",
      "content": "Understand your parents’ point of view. Anticipate your parents reaction. Have you talked about related issues? If you know that they will react negatively or disagree, let them know that you understand where they are coming from. If you show that you have their feelings in mind, they may be more likely to be open to your perspective. [10] X Research source For example, if your parents are concerned with having a cell phone you can say something like, “Mom, dad, I know that you don’t want me to have a cell phone. I understand that they cost a lot of money, are a lot of responsibility, and you don’t think they’re necessary for kids my age. I know you see the other girls in my grade with their own phones and you think that it’s a waste because they just play games or use Instagram. What if I saved up for a phone and we can use a pay-as-you-go plan to make sure I only use my money? You can also check out the games and apps I download because I just want to use it for times like that time my volleyball game ran late or when you’re on the phone with grandma.”"
    },
    {
      "title": "Don’t argue or whine.",
      "content": "Don’t argue or whine. Be respectful and mature by using a positive tone. Do not be sarcastic or snarky when you hear things that you don’t agree with. If you speak to your parents as you want to be spoken to, chances are that they will take the conversation seriously. [11] X Research source"
    },
    {
      "title": "Consider talking to either your mom or your dad.",
      "content": "Consider talking to either your mom or your dad. Certain conversations are best had with certain parents. Perhaps you talked to your dad more about school or your mom about dating. Make sure you’re having the right conversation with the right person."
    },
    {
      "title": "Find the right time and place.",
      "content": "Find the right time and place. Make sure you have your parents full and undivided attention when you talk to them. Avoid public places or when they only have a short time to talk to you. Allow them to be able to digest everything you’re saying and don’t make them feel blind-sided by sneaking in an important conversation at an inappropriate time."
    },
    {
      "title": "Listen when your parents speak.",
      "content": "Listen when your parents speak. Don’t get distracted by trying to think of the next thing that you want to say. Absorb what your parents are saying to you and respond appropriately. It’s easy to dwell on something when you don’t get the response you want immediately. You may even repeat what your parents say to ensure you understood them and to let them know that you’re listening to them carefully."
    },
    {
      "title": "Create a back-and-forth discussion.",
      "content": "Create a back-and-forth discussion. You don’t want to have a one sided conversation so ask questions and elaborate if you feel your message isn’t getting across. Do not interrupt or raise your tone. However, if your parents become upset, say something similar to, “I understand you’re upset. I’m not dismissing how you feel but want to be more constructive. Should we talk later” [12] X Research source"
    },
    {
      "title": "Anticipate the outcome.",
      "content": "Anticipate the outcome. You probably want the conversation to accomplish one of these things or a combination of a few: [13] X Research source Have your parents listen and understand what you’re saying without passing any judgement or offering any commentary. Have your parents support or receive their permission to do something. Give you advice or aide. Provide you with some guidance especially if you’re in trouble. To be fair and not put you down."
    },
    {
      "title": "Identify how you are feeling.",
      "content": "Identify how you are feeling. This may be difficult especially if you need to talk about sex or open up in a way that you never had before. It’s natural to feel awkward or anxious when talking about difficult topics with your parents. Recognize what you are feeling and let your parents know so you can unburden yourself. [14] X Research source For example, if you’re worried that your parents will be disappointed then let them know immediately. Say something like, “Mom, I know that you had talked about this before and you’ll be disappointed at what I’m about to say but I know that you’ll listen to everything and give me what I’m looking for.” If your parents are particularly emotional and you expect a very harsh or unsupportive response, let them know that you have taken this into consideration yet have gathered the courage to still approach. Be proactive and diffuse the situation with positivity. “Dad, I know how mad this is going to make you but it’s important to me that I tell you because I know that you love and respect and only get mad because you want the best for me.”"
    },
    {
      "title": "Pick the right time to talk to them.",
      "content": "Pick the right time to talk to them. If your parents are already having a bad day, they may be even more prone to give you a negative response. Unless it is an emergency, wait for an appropriate time to approach your parents. Wait till you feel their mood is receptive and their day is relatively stress free. [15] X Research source For example, ask “May we talk or is now not a good time?” Going for a long drive or being out on a walk can be the perfect time; however, if you never find these opportunities you can simply make a good time. Make sure you know what you want to say ahead of time or write down key points to ensure that you don’t missing anything. You don’t want to get off guard and have your parents initiate a conversation that you aren’t ready for."
    },
    {
      "title": "Pick your battles.",
      "content": "Pick your battles. You don’t always get what you want so don’t be stubborn if your parents tell you something that you do not want to hear. If you have made your point respectfully and listen to what they say, they will be more receptive to what you have to say in the next conversation."
    },
    {
      "title": "Talk to other trusted adults.",
      "content": "Talk to other trusted adults. Sometimes our parents might be dealing with their own set of problems. If one of your parents suffers from addiction or mental health issues, talk to other adults that you trust. Whether it's teachers, relatives, or counselors, there are many resources out there for you to talk to. Before speaking to anyone that you haven’t established a relationship with, put in your research and ask your peers to help you. Reader Poll: We asked 1601 wikiHow readers who they go to when they need advice, and 61% said that they reach out to their best friend. [Take Poll] Your best friend may be a good first person to talk to if you need to work out your feelings before going to an adult."
    },
    {
      "title": "Act maturely.",
      "content": "Act maturely. If you choose not to talk to your parents, deal with your issues maturely. Don’t avoid any issues especially if it has to do with your health or safety. If you wanted to speak to your parents about another person, talk to them directly and respectfully. [16] X Research source"
    }
  ]
}