{
  "url": "https://www.wikihow.com/Write-an-Appendix",
  "title": "How to Write an Appendix",
  "steps": [
    {
      "title": "Include raw data.",
      "content": "Include raw data. The appendix should be a space where you can include raw data that you collected during your research for your paper or essay . You should include any raw data that you feel will be relevant to your paper, especially if it will help to support your findings. Only include raw data on information that you refer to or discuss in your paper, as you want to make sure the data feels relevant for your reader. [1] X Research source Raw data may include sample calculations that you refer to in the body of the paper as well as specialized data that expands on data or information you discuss in the paper. Raw statistical data can also be included in the appendix. You may also include contributory facts from other sources that will help to support your findings in the paper. Make sure you properly cite any information you are pulling from other sources."
    },
    {
      "title": "Put in supporting graphs, charts, or images.",
      "content": "Put in supporting graphs , charts, or images. The appendix should also include visual supporting documents, such as graphs, charts, images, maps, drawings or photographs. Only put in visuals that will support your findings in your paper. [2] X Research source You may include graphs or charts you have created yourself or graphs or charts from another source. Make sure you properly cite any visuals that are not your own in the appendix."
    },
    {
      "title": "Note your research instruments in the appendix.",
      "content": "Note your research instruments in the appendix. You should make sure you note the instruments you used to conduct your research . This could be a video camera, a tape recorder, or any other device that helped you gather your information. It can be helpful for your reader to understand how you used that device to conduct your research. [3] X Research source For example, you may note in the appendix: “All interviews and surveys were conducted in person in a private setting and were recorded with a tape recorder.”"
    },
    {
      "title": "Add in interview transcripts or surveys.",
      "content": "Add in interview transcripts or surveys. The appendix should also include transcripts of any interviews or surveys you conducted as part of your research. Make sure the transcripts cover the entire interview, including interview questions and answers. You may include photocopies of surveys written on by hand or saved copies of surveys completed online. [4] X Research source You should also include any correspondences you had with subjects in your research, such as copies of emails, letters, or notes written to or from your research subjects."
    },
    {
      "title": "Title the appendix.",
      "content": "Title the appendix. The appendix should be titled clearly on the top of the page. Use all capital letters, such as “APPENDIX” or sentence case, such as “Appendix.” You can use the same font and font size as you used for your chapter headings in your paper or essay. If you have more than one appendix, order them by letter or number and be consistent about the ordering. For example, if you are using letters, make sure the appendices are titled “Appendix A,” “Appendix B,” etc. If you are using numbers, make sure the appendices are titled “Appendix 1,” “Appendix 2,” etc. If you have more than one appendix, make sure each appendix begins on a new page. This will ensure the reader is not confused as to where one appendix ends and another begins."
    },
    {
      "title": "Order the content in the appendix.",
      "content": "Order the content in the appendix. You should order the content in the appendix based on when it appears in the text. This will make the appendix more user friendly and make it easier to access. [5] X Research source For example, if raw data is mentioned in the first line of your paper, place that raw data first in your appendix. Or if you mention interview questions at the very end of your paper, make sure the interview questions appear as the last point in your appendix."
    },
    {
      "title": "Place the appendix after your reference list.",
      "content": "Place the appendix after your reference list . The appendix or appendices should appear after your reference list or list of sources. If your professor prefers the appendix to appear in a different space after your paper, such as before the reference list, follow their requirements. [6] X Research source You should also make sure you list the appendix in your table of contents for the paper, if you have one. You can list it based on title, for example, “Appendix”, or “Appendix A” if you have more than one appendix."
    },
    {
      "title": "Add page numbers.",
      "content": "Add page numbers. You should make sure the appendix has page numbers at the bottom right corner or the center of the page. Use the same page number formatting for the appendix that you used for the rest of the paper. Continue the numbering from the text into the appendix so it feels like part of the whole. [7] X Research source For example, if the text ends on page 17, continue numbering from page 17 when you put in the page numbers for the appendix."
    },
    {
      "title": "Revise the appendix for clarity and cohesion.",
      "content": "Revise the appendix for clarity and cohesion. There is no standard page or word count for an appendix but it should not be long-winded or unnecessarily long. Go back through the appendix or the appendices and make sure all the included information is relevant to the text. Remove any information that does not relate to the text or illuminate it in some way. Having an overly long appendix can appear unprofessional and clutter up your paper as a whole. You may find it helpful to have someone else read through the appendix, such as a peer or a mentor. Ask them if they feel all the included information is relevant to the paper and remove any information they deem unnecessary."
    },
    {
      "title": "Check for spelling or grammar errors.",
      "content": "Check for spelling or grammar errors. You should review the appendix to make sure it is free of any spelling, grammar, or punctuation errors. Use spell check on your computer and also try to review the appendix on your own. Read through the appendix backwards so you can make sure there are no spelling errors. You want the appendix to appear as professional as possible."
    },
    {
      "title": "Refer to the appendix in the text of the paper.",
      "content": "Refer to the appendix in the text of the paper. Once you have completed the appendix, you should go back into your paper and make sure you cite information in the appendix by title. Doing this will show your reader that the appendix contains information that is relevant to your text. It will also allow them to use the appendix to access supplementary information as they read through the text. [8] X Research source For example, you may note an appendix in the text with: “My research produced the same results in both cases (see Appendix for raw data)” or “I feel my research was conclusive (see Appendix A for interview notes).”"
    }
  ]
}