{
  "url": "https://www.wikihow.com/Stop-Being-Sarcastic",
  "title": "How to Stop Being Sarcastic",
  "steps": [
    {
      "title": "Take note every time you say something sarcastic.",
      "content": "Take note every time you say something sarcastic. If you want to stop being sarcastic, the first thing you need to do is determine how and when you use it. If you’re a very sarcastic person, this could be a difficult task. You might not notice every time you use sarcasm, or it may slip out before you can catch yourself. Pay attention to every word that comes out of your mouth, and jot down a note every time you say something sarcastic. Who did you say it to? Why? Were you feeling angry, annoyed, frustrated, jealous, or insecure? Try to figure out what caused you to say something sarcastic. [2] X Research source"
    },
    {
      "title": "Identify your \"trigger situations.\"",
      "content": "Identify your \"trigger situations.\" These are any situations that elicit sarcasm from you, and you can identify them by looking at your list of sarcastic comments. What did the incidents have in common? Maybe you notice that you use sarcasm every time you are embarrassed. Perhaps you resort to sarcasm when you feel angry or defensive. By figuring out what causes you to use sarcasm, you can be on guard when you're in those situations again. Some trigger situations may seem vastly different, but have the same root cause. For example, you may use sarcasm toward your girlfriend when she points out something you're doing wrong, as well as in a meeting when you're getting constructive criticism. Both times this sarcasm stems from embarrassment and/or defensiveness. Trigger situations can be just as easily thought of as \"trigger emotions.\""
    },
    {
      "title": "Imagine that all of your words are being written down.",
      "content": "Imagine that all of your words are being written down. This might sound strange, but it can help you closely analyze what you say and identify your sarcastic comments. Pretend that a court reporter is in the room with you, transcribing every word you say. Sarcasm cannot be translated to paper. If you roll your eyes and change the inflection of your voice while sarcastically saying, “Great job!” to someone, that will look like a genuine compliment on paper. If someone reads that conversation later, will it be an accurate reflection of your thoughts and feelings? Did you mean everything you said? Remember the quote, “Say what you mean and mean what you say.” If you don’t mean what you are saying, and wouldn’t want your name attributed to it on paper, just don’t say it!"
    },
    {
      "title": "Rate your sarcasm usage.",
      "content": "Rate your sarcasm usage. On a scale of one to ten, how sarcastic are you? If you know that you’re a nine or a ten, you will have to work really hard to break that habit. If you only say the occasional sarcastic comment, you will rank yourself lower and it won’t be a total language overhaul. Once you’ve worked on changing your speech, you can rate yourself again. [3] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source If you use sarcasm multiple times a day, you're on the higher end of the spectrum. If you only find yourself using it a couple times a week, you're on the lower end of the spectrum. By being honest with yourself about where you stand, you can better measure your progress."
    },
    {
      "title": "Tell everyone about your goal to stop being sarcastic.",
      "content": "Tell everyone about your goal to stop being sarcastic. Sometimes others will notice sarcasm from you when you don’t. By telling everyone, they can remind you if you start reverting back to old ways. Make sure that you tell people you see regularly, like a friend, co-worker, or significant other. Tell them to interject whenever they catch you speaking sarcastically. [4] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Don't offended when people call you out for sarcasm. You need some tough love if you want to make a real change! By including others in your goal, you open yourself up to advice and encouragement. Having support from people around you can be extremely helpful when you're making a change. [5] X Expert Source Nicolette Tura, MA Empowerment Coach Expert Interview. 28 January 2020."
    },
    {
      "title": "Create a system to penalize yourself.",
      "content": "Create a system to penalize yourself. Create a sarcasm jar, like a swear jar, and put a dollar in it every time you say something sarcastic. By forking over cash every time you let a sarcastic comment slip, you’ll choose your words more carefully— or put a strain on your bank account! When you’ve accumulated a fair amount of money in the jar, use it for something productive, like a bill. [6] X Research source Don't use the money for a treat. That money a penalty payment, so it cannot be used for something fun. Place the jar somewhere you can see it, so that your goal is always on your mind. It will serve as a physical reminder to watch your words and avoid using sarcasm."
    },
    {
      "title": "Remind yourself why you want to reduce the sarcasm.",
      "content": "Remind yourself why you want to reduce the sarcasm. Maybe you saw a friend being sarcastic and you realized how unflattering it is. Perhaps you hurt someone’s feelings unintentionally, and want to work on speaking more kindly. Whatever your reasoning, make sure you remind yourself of it regularly. You can become the person you want to become, you just have to stay focused on your goal. [7] X Research source Try writing these reminders down and posting them somewhere that you'll see everyday."
    },
    {
      "title": "Give yourself an \"anti-sarcasm\" challenge every day.",
      "content": "Give yourself an \"anti-sarcasm\" challenge every day. This can be something like randomly telling a friend something you really admire about them, or telling a stranger on the bus that you like their shoes or their bag. Maybe you just want to tweet something every day that makes you genuinely happy. It doesn't matter what you do, just make sure it is earnest, kind, and uplifting. Not only will you get into the habit of speaking truthfully, but you will also start creating a new image of yourself to the people around you. Even if you are having a horrible day and don't particularly want to challenge yourself, just do it. You will feel better afterwards, because kindness is contagious."
    },
    {
      "title": "Practice handling “trigger situations” differently.",
      "content": "Practice handling “trigger situations” differently. Say you noticed yourself being sarcastic every time you hung out with a particular group of people that made you feel insecure. Rather than speaking sarcastically, try speaking genuinely . You can offer them sincere compliments, while remarking on your own great characteristics. If you notice that you speak sarcastically whenever you’re angry with co-workers, try addressing your frustrations instead of using sarcasm to ridicule or vent. Treat words as if they are valuable currency. By using your language to convey truthful, straightforward, sincere thoughts, you are getting the most bang for your “buck.”"
    },
    {
      "title": "Observe someone who speaks particularly kindly and genuinely.",
      "content": "Observe someone who speaks particularly kindly and genuinely. This should be someone who speaks earnestly, without any sarcasm. It doesn’t matter whether you speak with them directly or just admire from afar. How can you emulate them? How does their sincerity make you feel? Sarcasm can hurt and mock others, reveal a lack of confidence, and put others on the defensive. [8] X Research source Identify someone who makes people laugh without using sarcasm or hurting others. It is empowering and motivating to see someone who can make real, earnest jokes without putting anyone down."
    },
    {
      "title": "Reevaluate yourself regularly.",
      "content": "Reevaluate yourself regularly. Bad habits can sneak back into our lives easily if we aren’t vigilant, especially when we are feeling frustrated. Remember why you wanted to remove sarcasm from your language in the first place, and constantly check yourself. If you observe and evaluate yourself with honesty and you notice that you’re saying insincere, sarcastic things, try to figure out why. [9] X Research source Address any issues that are causing you distress or making you feel uncomfortable. Attempt to fix the problems that are causing you to revert to your sarcastic language. Remind yourself that kindness and sincerity will get you farther than sarcasm and mockery ever will."
    },
    {
      "title": "Dig deeper to the root of the problem if you continue to struggle.",
      "content": "Dig deeper to the root of the problem if you continue to struggle. If you are constantly blurting out cynical, sarcastic remarks and you just can't seem to hold back, the issue may be deeper than simply breaking a habit. Don't be ashamed to spend time \"getting in touch with your emotions,\" or even asking for help. Often times, sarcasm can be used as a defense mechanism or an emotional crutch, so solving the core problem can help change your speech. [10] X Research source If you realize you use sarcasm as a means to feel better about yourself, try to find other ways to raise your self-esteem and feel empowered, without sacrificing the feelings of others. [11] X Research source Spend time doing a hobby you love, exercise, and surround yourself with people who make you feel confident. If you believe you are struggling with anger issues or depression, don't be afraid to ask for help from a psychologist or psychiatrist."
    }
  ]
}