{
  "url": "https://www.wikihow.com/Thank-You-Note-to-Coworker",
  "title": "Thank You Messages for Coworkers (Plus How to Write the Perfect Note)",
  "steps": [
    {
      "title": "Thank your coworkers for their unique contribution.",
      "content": "Thank your coworkers for their unique contribution. Your coworkers will feel especially valued when you let them know that you appreciate everything that they bring to the table and that they're an important part of the team. Here are some things you might say: [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source \"Thanks so much for contributing your ideas to the brainstorm session last Friday. We wouldn't have come up with our launch festival theme without your creativity! I know I can always count on you for a well-placed pun.\" \"Thank you for everything you did to ensure the success of our event last weekend. The caterers would've been lost without your navigation expertise. I really appreciate your grace under pressure.\" \"Thank you for being so flexible. You were an integral part of our presentation's success—anyone else would've fumbled but you adapted on the fly to accommodate the additional demands and didn't even break a sweat. Thanks again!\" \"Just wanted to let you know that I really appreciate everything you've done for our team. We never could have hit our sales goals without you! Thanks so much!\" \"I really appreciate your work at the banquet last night. Your ideas made things run a lot more efficiently so we were able to get home earlier than we thought. Thank you for being so intuitive!\""
    },
    {
      "title": "Let coworkers know you see and appreciate their extra effort.",
      "content": "Let coworkers know you see and appreciate their extra effort. Some coworkers never hesitate to pitch in with a little extra help when things are tough, and they do it with a smile. Brighten their day with a thank-you note that tells them how much you appreciate everything they do—they'll be so happy to know that someone really sees their effort. Here are some things you could write: \"Thank you for all the work you put in on that last project. I appreciate all the extra hours you put in even when no one asked. I'm so grateful for your commitment to that project and to our team.\" \"Thanks for staying late last night to get those last orders out. It makes us look really good that we were able to keep our word on those and we couldn't have done it without you.\" \"Thank you so much for tracking down some printer ink and bringing it in this morning. I'm sorry you had to drive all the way to the other side of town, but you're a trooper—I appreciate you for going the literal extra mile! \"I really appreciate you covering when we were short-handed last night. I know you'd already worked 4 nights in a row and were looking forward to a night off, and yet you didn't hesitate to volunteer. I'll make it up to you next week!\" \"I just wanted to let you know how amazing your presentation was. The clients would've been fine with a quick verbal summary but your animated slides really blew them away. Your passion and commitment are so inspiring and I'm grateful to work with you. Thanks again!\""
    },
    {
      "title": "Send a note when a coworker teaches you something new.",
      "content": "Send a note when a coworker teaches you something new. A thank-you note tells your coworker just how much you value their knowledge and appreciate it when they share it with you. And when they see how much you value them, studies show they'll be more likely to keep helping you out in the future. Here are some examples: [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source \"Thanks for explaining the new code shortcuts to me on Monday. I wouldn't have been able to finish my project in time without your expertise! I'm so glad we work together.\" \"Thank you so much for giving me a crash course on that new software yesterday. It made my workday run so much more smoothly.\" \"I really appreciate you taking the time to show me that workaround this morning—you're a life-saver! I've already doubled my production. Thanks so much!\" \"Just wanted to let you know how grateful I am for your notes from that seminar you went to last month. I wouldn't have been able to follow this morning's presentation without them! You're really on the ball—I know where to direct my questions from now on!\" \"Thanks for helping me out with those calculations this morning. Your expertise really saved me a lot of time and kept me from starting the day frustrated. I appreciate you!\""
    },
    {
      "title": "Show gratitude to coworkers who help get you out of a tight spot.",
      "content": "Show gratitude to coworkers who help get you out of a tight spot. In any workplace you're going to face challenges. Often, it takes a little help from your coworkers to get things turned around and get back on the path to success. Let them know you appreciate their assistance with messages like these: \"Thanks for staying late with me Thursday night to collate my handouts—you're a lifesaver! I really appreciate you taking time out of your life to help get me out of a jam.\" \"Thank you for asking such thoughtful questions during my Q&A. I was worried that nobody was going to ask about the thing I most wanted to highlight and I really appreciate you bringing it up.\" \"Thanks for covering the end of my shift on Wednesday. You really helped me out of a tight spot and I appreciate you coming to bat for me. Let me know next time you need an afternoon off!\" \"Just wanted to let you know I really appreciate you helping me clean up after that doggy daycare disaster. I'll definitely wait until the outside door closes before I come in from now on! Thanks so much for your help.\" \"I am so grateful to you for coming to my rescue during the meeting this morning. I can't believe I accidentally read the wrong report! Thanks so much, and don't worry—I'll be ready to help you out next week.\""
    },
    {
      "title": "Tell that ray of sunshine how much they brighten your day.",
      "content": "Tell that ray of sunshine how much they brighten your day. People who have a positive attitude are really a breath of fresh air in the workplace, encouraging coworkers to persevere and succeed. [3] X Research source If you have a positive coworker in your workplace that makes every day a little better, why not show your appreciation with a thank-you note? Here are some examples: \"I just wanted to thank you for the positivity that you bring to work every day. No matter what happens, I know I can count on you to see a way through it. You remind me that setbacks are only temporary, and I appreciate that.\" \"Thank you so much for the positive spin you put on things at the meeting yesterday. I thought we'd reached an impasse, but you were so quick to point out the silver lining everyone was missing. I really appreciate your outlook.\" \"Reaching out to say thanks for the kindness and good humor that you spread throughout the office. There's not a day that goes by that you don't make me smile about something—you help make this a great place to work.\" \"Just wanted to shoot you a little note and say thanks for your positive attitude and sunny disposition. Even when we're right up against a deadline, you always know how to put people at ease.\" \"I am so grateful for your positivity. When I'm really stressed out, talking to you really helps me calm down and find my focus again. I appreciate you so much—thanks for working with me!\""
    },
    {
      "title": "Let coworkers know you appreciate the ideas they share.",
      "content": "Let coworkers know you appreciate the ideas they share. In many jobs, bouncing ideas off of each other is a big part of the whole work process. When it happens often, it's easy to forget to say thanks. This is especially important if they're someone who just doesn't speak up very much—a little thank-you note could really encourage them to contribute more! Here are some ideas: [4] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source \"Thank you for sharing your thoughts on the pancake project. You have a way of really thinking outside of the box and I always appreciate your perspective.\" \"Thanks for providing such inspiring and thought-provoking ideas at the brainstorming session on Sunday. I really felt like I was looking at our work in a whole new light. You're truly a credit to our profession.\" \"Thank you so much for popping in to share your suggestions for next week's event. It's so helpful to hear from people in other departments. I look forward to hearing more from you in the future!\" \"I just wanted to let you know how much I appreciated the ideas you shared with me at lunch yesterday. You really gave me a lot to think about and I'm excited to get started on this next project now. Thanks so much!\" \"Just a note to let you know how grateful I am that you were willing to bounce ideas around with me yesterday evening. Your idea sparked something in me that really got things moving. Thank you for your help, you're such a great coworker!\""
    },
    {
      "title": "Thank a coworker who's leaving for working with you.",
      "content": "Thank a coworker who's leaving for working with you. When a coworker moves up the ranks or steps out to work for a different company, a thank-you note lets them know how much you appreciated working with them. It can also set the stage for a continued collegial relationship with them even after they've moved on. For example, you might write: [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source \"Thank you so much for everything you've taught me from my first day of training. If anyone should be moving up, I'm glad it's you! Look forward to seeing what you put out in the future.\" \"Thanks for being such a great team player over the years—you've really gotten me out of a lot of jams and I wouldn't be a sales leader if it hadn't been for your guidance. Good luck in your new position—I'll miss you!\" \"Thank you for being such a creative force in our team—no doubt our slides will have less sparkle without you. I really appreciate how you can make anything fun. Good luck in your future endeavors.\" \"Congratulations and your new position and of course we'll all miss you, but I wanted to make sure you know just how grateful I am for the time I got to work with you.\" \"I know things have been tough for you here, but I've always appreciated working with you. Thank you for everything and I hope your new spot is a better fit.\""
    },
    {
      "title": "Thank a coworker for their care and empathy in an appropriate way.",
      "content": "Thank a coworker for their care and empathy in an appropriate way. Sometimes your coworkers are more than just people you share a workspace with. If a coworker offers you comfort or emotional support, a thank-you note allows you to tell them how much you appreciate them without getting too personal for the work environment. Consider saying something like: \"Thanks so much for talking to me yesterday after that meeting. I admit I was close to walking out and you really talked me off the ledge. I appreciate you.\" \"Thank you for comforting me after I got that phone call on Monday. I know you didn't know exactly what was going on, but you were there for me regardless—that means a lot to me.\" \"Thank you for getting coffee for me yesterday afternoon when I was so swamped. I was starting to get a headache and I really needed that break. I appreciate you looking out for me that way.\" \"I really appreciate you covering for me the other day so I could take a break when I got overwhelmed. Thank you so much for seeing what was going on. You're a great coworker.\" \"I'm so grateful that you were there when I got that phone call. Even though I had been expecting it, it still came as a shock. I'm glad I didn't have to face it alone and you were so kind to me. Thanks again.\""
    },
    {
      "title": "Thank them for noticing something special about your life.",
      "content": "Thank them for noticing something special about your life. When a coworker gives you a birthday or anniversary card, or sends you similar well wishes for any other special occasion, shoot them a quick thank-you note! It's a really thoughtful way to show how much you appreciate their thoughtfulness. Here are some examples: \"Thank you for the birthday card—that was so thoughtful! I'm touched that you remembered, that means a lot to me.\" \"Thanks for the cute card you made for my kid's birthday. I wasn't expecting that and I know they'll be so excited about it. It feels good to have coworkers who pay attention to things like that. Thanks again!\" \"Thank you so much for the card you made for my five-year work anniversary. It was so neat to look back at photos from when I first started. Coworkers like you remind me why I consider my coworkers like family and I'm so grateful for it.\" \"I really appreciate that anniversary card—most people don't even remember! I can definitely tell we've been working together for a long time. Thanks again, you're so thoughtful.\" \"It was so nice to see that card you had the office sign wishing me a speedy recovery. Knowing that all of you were thinking of me really warmed my heart and I'm glad to be back in the office. Thanks again!\""
    },
    {
      "title": "Acknowledge the gift specifically with a written thank-you note.",
      "content": "Acknowledge the gift specifically with a written thank-you note. Between appreciation days, birthdays, and holiday gift exchanges, coworkers often end up giving each other a lot of gifts—and a thank-you note shows your gratitude. Remember to mention the gift specifically and add a sentence about what you plan to do with it or some other relevant detail. For example: \"Thanks so much for the beautiful succulent you got for me in the exchange this year. It looks perfect in my window next to my suncatcher. This is my first succulent, so if you have any tips, please share! Thanks again.\" \"Thank you for the candle you left on my desk for my birthday. I'm so excited to light it while I relax with a good book tonight.\" \"Thank you for the gift card to Star Steakhouse—it's actually my favorite steakhouse downtown. It was so thoughtful of you to give my partner and I a dinner out. I truly appreciate you.\" \"I really appreciate the candy you got for my birthday—how did you know dark chocolate and peanut butter is my favorite kind? I'm so excited to eat these while reading a new mystery novel tonight.\" \"The gift basket you sent over was so thoughtful! I'll really enjoy wearing the cozy socks as I'm drinking the hot cocoa. Thank you so much!\""
    },
    {
      "title": "Use nice stationery.",
      "content": "Use nice stationery. Claytor recommends that you invest in some quality stationery so that getting a note from you will be \"like a little present in the mail.\" Beautiful stationery also lets the recipient know that you put some thought into your note and there's some real meaning behind it. Claytor notes \"We're always so inundated with bills and junk. Now, it's nice to... go to your mailbox and say, 'Oh, this stationery is beautiful.'\""
    },
    {
      "title": "Write out your message by hand.",
      "content": "Write out your message by hand. At a time when nearly everything is digital or virtual, a handwritten message is personal and meaningful. Claytor offers a word of caution, though, that \"you want to make sure your handwriting is legible.\" If you haven't written anything by hand in a while, try a couple of drafts to make sure you've got it down. While there's nothing wrong with sending an email to a coworker, a handwritten note is a special touch. Plus, you can be sure it won't get lost in a sea of spam in the person's inbox. What to avoid: writing anything too personal in a handwritten note. It's likely others will see or read the card and you don't want to accidentally embarrass your coworker."
    },
    {
      "title": "State specifically what you're thanking them for.",
      "content": "State specifically what you're thanking them for. Claytor emphasizes that \"you want to be very specific.\" If you can, narrow it down to a specific instance that you can point to, rather than just thanking them for some general trait or skill. For example, if you've got a coworker you want to thank for their creativity, thank them for a specific time when their creativity saved the day. Being as specific as possible helps your thank you sound more genuine. It also tells your coworker exactly what you appreciate so they know what to do more often. What to avoid: generalizing, which makes your thank you card sound less personal and less real."
    },
    {
      "title": "Add detail about the thing you're thanking them for.",
      "content": "Add detail about the thing you're thanking them for. With the next sentence of so of your thank-you note, Claytor encourages you to personalize your gratitude in some way. You might explain how the person helped you, how they changed things, or what you'll do in the future. For example, if you're thanking the person for teaching you how to do something, you might tell them how you'll use your new skills in the future. You might also include details about specific results if those are available to you. For example, if the person's suggestion resulted in a 50% increase in sales, you would definitely want to include that detail in your thank-you note! What to avoid: exaggeration. Avoid over-the-top praise or using superlatives like \"best\" or \"greatest\" unless you can back them up with numbers."
    },
    {
      "title": "Deliver the thank-you note in a timely fashion.",
      "content": "Deliver the thank-you note in a timely fashion. Claytor recommends that you deliver your thank-you note \"within 24 to 48 hours.\" If you're planning on sending it in the mail, have it stamped and in the mailbox within that time. While mailing your note does add a little formality to it, it's perfectly fine to leave a thank-you note to a coworker on their desk or somewhere else where they'll find it easily."
    },
    {
      "title": "Fosters mutual respect",
      "content": "Fosters mutual respect When you send a thank-you note to a coworker, you're telling them that you value them—and because you went out of your way to express your gratitude, they're likely to value you as well. In this atmosphere of appreciation, everyone respects each others' contributions and looks out for each other. [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source You're likely to feel less competition towards your coworkers and more of a spirit of collaboration and teamwork."
    },
    {
      "title": "Improves physical health",
      "content": "Improves physical health While research is somewhat limited, studies show that the practice of gratitude in the workplace can lead to less stress, fewer sick days, and fewer overall health complaints. You might also notice that you have higher levels of satisfaction—both with your job generally and with your coworkers specifically. [7] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Promotes genuine connection",
      "content": "Promotes genuine connection Thank you notes are a simple gesture that can make workplace relationships feel less transactional. When you thank someone for their contribution, you're also appreciating everything else in their life that got them to that point. Showing gratitude to coworkers means they feel \"seen\" and understood as real people, not just cogs in the machine. [8] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Want to deepen these connections? Take note of special events in your coworkers' lives and honor them with thank-you notes that express your gratitude and appreciation."
    },
    {
      "title": "Strengthens professional relationships",
      "content": "Strengthens professional relationships Thank you notes give you an opportunity to reach out beyond your inner circle and forge bonds with people on other teams or in other departments. Showing your appreciation for someone gives them a positive professional opinion of you, even if they're not familiar with your work. [9] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Remember to reach down as well as up. For example, if you have 10 years of experience, you might send a thank-you note to someone who's just starting out but has made a great contribution. That'll really encourage them to keep pushing."
    }
  ]
}