{
  "url": "https://www.wikihow.com/Text-a-Guy-Without-Looking-Desperate",
  "title": "How to Text a Guy Without Looking Desperate",
  "steps": [
    {
      "title": "Avoid just texting him \"Hi,\" or \"Hey.\"",
      "content": "Avoid just texting him \"Hi,\" or \"Hey.\" This comes across as boring and he'll think you don't have anything better to do than to text him. [1] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. Instead, text him something about your day or send him a picture of something cool. [2] X Research source Maybe you two have an inside joke and you see something that reminds you of it. Snap a picture of it and text it to him. This is way more interesting than a typical, \"Hey.\""
    },
    {
      "title": "It's totally fine to text him, but avoid sending long paragraphs regularly.",
      "content": "It's totally fine to text him, but avoid sending long paragraphs regularly. Think of it this way, the more you text, the more you dilute the impact of your message. Want to leave him wanting more? Send a short and sweet message. That's it! [3] X Research source For instance, you might send a text that says, \"Want to meet up sometime this week?\" It sounds confident, it sounds bold, and it doesn't sound like you're clutching the phone waiting for his response."
    },
    {
      "title": "Wait for a response before you automatically text him again.",
      "content": "Wait for a response before you automatically text him again. This is especially true if you asked him a question and definitely do not text him back and ask why he hasn't responded. [4] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. Don't text him until he responds to the text you've already sent and don't beat yourself up while you wait for a response—you may be reading too much into it and he might just be busy! [5] X Research source You might consider when you texted him—was it at a super inconvenient time when he might be away from his phone? Take this into account if you're anxiously waiting for a response. Avoid sending a string of texts in a row. You don't want him to pick up his phone only to see that you texted him a dozen times in a row."
    },
    {
      "title": "You shouldn't have to work hard to get his attention.",
      "content": "You shouldn't have to work hard to get his attention. If he's texting back single-word responses or takes days to reply, he's not as invested as you are. [6] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. In this case, you can either move on or text him a flirty response to pique his interest. [7] X Research source For example, if he texts you with a vague promise to hang out, but doesn't give you details, don't do all the planning for him. Say something like, \"As much as I like planning dates, I think it would be more fun if you decide.\" He'll either respond with date specifics or he'll pass and you won't be wasting your time and energy."
    },
    {
      "title": "It's totally fine to drop hints when you text.",
      "content": "It's totally fine to drop hints when you text. [8] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. After all, if you're interested in him, you want him to know it! Being a little cheeky or fun with your text also shows that you're not desperate for him—it shows you have a playful side. [9] X Research source For example, text, \"Stop looking so hot in the pics you post. You’re killing me over here!\" or, \"If you want to make a move, today would be the perfect time to go for it.\""
    },
    {
      "title": "There's no need to bare your soul over a text message.",
      "content": "There's no need to bare your soul over a text message. Texting should be light, fun, and simple so don't get super romantic, especially if you don't know the guy very well. [10] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. Nothing will scare him off faster than you texting revealing how much you like him or how glad you are that you two found each other. [11] X Research source Remember, you want to get him interested or curious about you. Don't put all your cards on the table right away!"
    },
    {
      "title": "Send a confident message that shows you're interested.",
      "content": "Send a confident message that shows you're interested. You've probably been told at some point that you should wait for him to make the first move. The truth is, you don't have to! You can totally text him a short message that lets him know you're interested. This also shows him you're confident and not afraid to get what you want. [12] X Research source You might text, \"Hey, I had a really great time with you yesterday. We should meet up after I get back in town.\""
    },
    {
      "title": "Ask if he wants to meet up because you've got other offers.",
      "content": "Ask if he wants to meet up because you've got other offers. Maybe he said you two should hang on on Friday night, but come Friday afternoon, you've heard nothing. Send him a text asking if he wants to do something that night because you have other things you might do and you need to know. [13] X Research source For example, text, \"Hey, I assume we're not on for tonight? I haven't heard from you and I've got other things I'd like to do if not.\" This kind of text puts you in charge since you're telling him you've got potential plans and you won't wait around for him to ask you out."
    },
    {
      "title": "You might be excited about him or think it's cute, but give him space!",
      "content": "You might be excited about him or think it's cute, but give him space! If you text your guy right after being around him, you may come off as clingy or even possessive. Give him a few hours or a day before you send him a message or a picture. This shows you're busy doing things and you have a life of your own. [14] X Research source If he's into you, this gives him time to wonder what you're up to and curiosity can make him even more interested in you."
    },
    {
      "title": "Don't overshare or you might look like you're trying too hard.",
      "content": "Don't overshare or you might look like you're trying too hard. This is super important if you don't know the guy very well. If you text a lot of personal info, he might feel overwhelmed or you may even scare him off. Stick to light, easy topics until you know each other better. [15] X Research source For example, don't gossip about mutual friends or complain about your exes. You should also avoid texting about topics that are hard to talk about by text such as politics, religion, money, and sex. Mentioning past relationships is definitely off-limits! No guy wants to hear you complain about your ex via text message, so stay positive and don't talk about them."
    },
    {
      "title": "There are no firm rules about how often you should text the guy.",
      "content": "There are no firm rules about how often you should text the guy. However, you should try to read his signals so you know how often to respond. For instance, if he always texts you back and asks you questions, by all means, answer! [16] X Research source If he takes days to respond and doesn't seem engaged, try to communicate more in person instead of by text since he doesn't seem too interested in electronic communication."
    },
    {
      "title": "If you text when you're drunk, you may say something you regret.",
      "content": "If you text when you're drunk, you may say something you regret. No one wants to check their phone the day after a long night out to find that they sent a string of embarrassing texts to a guy. If you don't trust yourself not to text while you're drinking, give your phone to a friend for the night or temporarily turn off your texting feature. You'll thank yourself later! [17] X Research source If it's too late and you've already done this, don't panic. Send a short text to apologize and point out that you'd been drinking. Then, drop it and don't worry about it anymore."
    }
  ]
}