{
  "url": "https://www.wikihow.com/Stop-Junk-Mail-by-Sending-it-Back",
  "title": "How to Stop Junk Mail by Sending it Back",
  "steps": [
    {
      "title": "Check the envelope for a return stamp.",
      "content": "Check the envelope for a return stamp. A lot of junk mail can't be returned this way, and you'll only waste post office resources if you try. However, if the envelope is marked \"address correction requested\" or \"return postage guaranteed,\" that means you can send it back. The original company that sent the mail will pay the postage."
    },
    {
      "title": "Write “Refused.",
      "content": "Write “Refused. Return to Sender” on the outside of the envelope. When a piece of mail is marked in such a way, the post office will send the item back to its original source. If the company that's sending you the junk mail receives the correspondence back, it will hopefully get message that you don't wish to receive any more mail in the future. Make sure to write in clear, legible print, so the message is easy to read. When you're marking the envelope, it's a good idea to use a felt tip marker that won't smear if it gets wet. If your handwriting is difficult to read, you may want to use block letters to ensure that the “Return to Sender” message is clear."
    },
    {
      "title": "Drop it in the mail.",
      "content": "Drop it in the mail. Once you write “Return to Sender” on your junk mail, there's no need to add postage. Simply place it in the mail as you would with any other item that you wish to send through the postal service. [1] X Research source You can place the junk mail that you wish to return in a mailbox, but it's usually better to hand it to your mail carrier or take it directly to the post office. That's because if it goes through the automated system without a worker doesn't specifically seeing the “Return to Sender” message on the mail, it may wind up back in your mail a few days later."
    },
    {
      "title": "Open the envelopes.",
      "content": "Open the envelopes. If you've tried sending your junk mail back via a “Return to Sender” message, and it still keeps turning up in your mailbox, you may need to take a more direct approach to get it to stop. That means you'll need to open the junk mail, so you can sort through the items in each envelope. [2] X Research source If you get a lot of junk mail, opening up the envelopes can be an annoying process. You may want to collect it on a weekly basis and open it all in one sitting instead of doing it each day."
    },
    {
      "title": "Gather the pre-paid return envelopes.",
      "content": "Gather the pre-paid return envelopes. When it comes to junk mail such as credit card offers and charity donation requests, the companies usually include a return envelope with pre-paid postage, so you can return the credit application, charity donation, or other requested item. After you've opened the mail, set aside all of the return envelopes, so you can correspond with the company without paying for postage. [3] X Research source"
    },
    {
      "title": "Write a note.",
      "content": "Write a note. Even if you've sent previous correspondence back “Return to Sender,” your name still might not come off the company's mailing list. Making a written request that you stop receiving the mail may be necessary to put an end to the correspondence. [4] X Research source Be polite but firm in the note. Don't resort to foul or abusive language. If you're not sure what to write, try something simple like “Please remove me from your mailing list. I do not wish to receive any future offers/solicitations, etc.” Make sure to include your name and mailing address on the note because your contact information will not be on the pre-paid return envelope."
    },
    {
      "title": "Mail it back.",
      "content": "Mail it back. Because you're using the pre-paid envelope, there's no need to add any postage to the note. You can drop it in any mailbox or leave it for your mail carrier to pick up when he makes the next delivery. [5] X Research source"
    },
    {
      "title": "Gather pre-paid return envelopes.",
      "content": "Gather pre-paid return envelopes. Just as when you're writing a note to ask a company to stop sending correspondence, you want to take advantage of the envelopes that they include for you to send items back, so you don't have to pay for postage. [6] X Research source You may want to save multiple return envelopes from the same company or organization. The more that you send back to them, the more likely they are to notice."
    },
    {
      "title": "Collect some junk to stuff in the envelopes.",
      "content": "Collect some junk to stuff in the envelopes. If a note asking a company to stop sending junk mail doesn't get your name off their mailing list, you may want to make more of a statement. Stuffing the pre-paid envelope with items from around the house makes it weigh more, so the company has to pay more when you send it back to them, which will hopefully make them think twice about sending you junk mail. [7] X Research source Stuffing the envelopes with paper items, such as napkins, newspaper or magazine clippings, a deck of cards, or confetti, is usually the easiest way to go. Stuff the envelopes until they can't hold any more material. If you're worried that they won't stay shut, you may want to reinforce the closure with tape."
    },
    {
      "title": "Send the envelopes back.",
      "content": "Send the envelopes back. It's best to drop them in a mailbox because they'll be sorted by an automated system. A mail carrier or post office clerk might notice an extra thick envelope, and throw it away, so it may not actually get back to the company. [8] X Research source"
    }
  ]
}