{
  "url": "https://www.wikihow.com/Use-the-Internet-Archive%27s-Wayback-Machine",
  "title": "How to Browse and Archive Websites with the Wayback Machine",
  "steps": [
    {
      "title": "Go to https://web.archive.org in your web browser.",
      "content": "Go to https://web.archive.org in your web browser. You can use the Wayback Machine to see older versions of websites on any computer, phone, or tablet."
    },
    {
      "title": "Enter the website you want to view and press ↵ Enter.",
      "content": "Enter the website you want to view and press ↵ Enter . You can type the full URL into the field labeled \"Enter a URL or words related to a site's homepage.\" If you don't know the address of the website, type its name (or some keywords that describe it) into the field instead. Entering an address like https://www.wikihow.com will yield different results than entering https://www.wikihow.com/Use-the-Internet-Archive%27s-Wayback-Machine . If you search for a name or keyword, you'll see a list of suggested sites to peruse. Click or tap the URL and then continue to the next step. Alternatively, you can click the Web tab at the top of the page and use the drop-down menu to search for archived websites or archive an existing website."
    },
    {
      "title": "Select a year on the bar graph.",
      "content": "Select a year on the bar graph. By default, you'll be taken to the current year on the bar graph that runs along the top of the page. There are black bars that show how many times the Wayback Machine archived the page during that year. Click an area above a year to see a 12-month calendar showing each date in that year."
    },
    {
      "title": "Click a date on the calendar.",
      "content": "Click a date on the calendar. Depending on the site you search for, you'll usually see green and/or blue circles around some of the calendar dates. If a date is circled, a snapshot of the site is available from that date. Clicking the date displays the archived version of the website. [1] X Research source If a website was archived multiple times on one day, the circle around the date will be a little larger. Hover your mouse cursor over the date to see the list of archive times, then select a time to view that version. If you see an error when you click a date or time, the site may be set up to ignore the Wayback Machine's web crawler. Errors can also mean that the website was unreachable at the time. Depending on how the site was archived, you may be able to click links on the page to see other archived content. Unfortunately, clicking links on an archived site will usually produce an error."
    },
    {
      "title": "Browse other archived versions of the site.",
      "content": "Browse other archived versions of the site. The bar graph from the previous page runs along the top of the archived website. You can use it to check out the same site on other dates. Use the blue arrows to jump to the previous or next archived snapshot, or click a different date to view it."
    },
    {
      "title": "Go to https://web.archive.org in your web browser.",
      "content": "Go to https://web.archive.org in your web browser. You can use a computer, phone, or tablet to tell the Wayback Machine to take a snapshot of a specific website. This feature is handy if you plan to use the site's current form as a citation in the future. [2] X Research source"
    },
    {
      "title": "Type the URL of the site you want to save into the \"Save Page Now\" field.",
      "content": "Type the URL of the site you want to save into the \"Save Page Now\" field. It's in the bottom-right portion of the page. URL can be acquired by performing the following: To get the full URL to the site you want to archive, visit that site in a web browser, and then copy the address from the address bar at the top of the screen. Alternatively, you can click the Web tab at the top of the page and use the drop-down menu to search for archived websites or archive an existing website."
    },
    {
      "title": "Click the SAVE PAGE button.",
      "content": "Click the SAVE PAGE button. It's the light gray button to the right of the text box. This displays the website and the text \"Saving page now\" at the top-left corner. That text will disappear once the site is saved. [3] X Research source The Wayback Machine cannot archive some websites due to their configuration. If you see an error, it's usually because the site's owner has chosen to ignore the Wayback Machine's web crawler."
    }
  ]
}