{
  "url": "https://www.wikihow.com/Stop-Your-Voice-from-Shaking",
  "title": "How to Stop Your Voice from Shaking",
  "steps": [
    {
      "title": "Breathe from your diaphragm to gain more control.",
      "content": "Breathe from your diaphragm to gain more control. Look at yourself in the mirror while you take a deep breath. If your shoulders rise, you're breathing from your chest instead of your diaphragm, which is a muscle that sits right at the base of your lungs. Breathe in and see if you can expand your rib cage outwards without moving your shoulders or chest. [1] X Expert Source Amy Chapman, MA Speech Specialist Expert Interview. 18 October 2019. Believe it or not, this will make a huge difference in the way you speak. Since the diaphragm is a muscle, it needs exercise just like, say, your biceps. Once it gets stronger, you'll be much better at controlling your voice (and the shake), since strong voices rely on steady breathing."
    },
    {
      "title": "Develop diaphragm strength to keep improving.",
      "content": "Develop diaphragm strength to keep improving. Once you discover where your diaphragm is and how to use it, it's time to make it stronger. Before or after you shower, wrap a towel around your waist. Breathe in and try to move the towel outward without letting your shoulders or chest rise. Breathe out slowly. On the next breath out, say “ah.” Do this ten times. [2] X Research source When you say “ah” while breathing from your diaphragm, you should notice that it's easier to speak loudly and steadily. Practice getting louder and softer. You can even take a few shallow breaths from your chest to compare the two sounds."
    },
    {
      "title": "Exhale on a hissing sound to pace your breath.",
      "content": "Exhale on a hissing sound to pace your breath. Breathe in using your diaphragm, and hiss the air out through your teeth while you're standing straight and tall. Repeat this exercise ten times. Hopefully, no one walks in while you're making snake noises! Weird as it may feel, controlling how quickly or slowly you release your breath is a great way to make your diaphragm stronger. [3] X Research source"
    },
    {
      "title": "Practice voice exercises to widen your vocal range.",
      "content": "Practice voice exercises to widen your vocal range. Say mm-mmm (as in the “that tastes good” kind of mm-mm), and mm-hmm. Remember to always breathe from your diaphragm during these exercises, and use your breath to make these hums loud. Repeat five times. Say “ney, ney, ney, ney” up and down your vocal range. Speak as high as you can and then move all the way down to speaking as low as you can. Have fun with this, because you're going to feel super silly. Repeat ten times. Say “ooo-eee” over and over again, sliding all the way through your vocal range. Repeat ten times. Say “mmmmm” and focus on the buzzing sensation that should be happening right at the front of your face and around your mouth. Keep that buzzing going until you've finished your breath. Repeat this five times."
    },
    {
      "title": "Do tongue twisters to get better articulation.",
      "content": "Do tongue twisters to get better articulation. Having good articulation means that people will be able to catch every syllable of the words you say. This is super important, because if people miss syllables, they might mishear you or not understand what you're saying at all. Practice these exercises once a day. [4] X Research source You can use the ones listed here or look up ones that you feel challenge you. Go as fast as you can, but only so long as you're speaking clearly. Try: “the bluebird blinks,” “three free throws,” “what time does the wristwatch strap shop shut?,” “strange strategic statistics,” and “freshly fried flying fish, freshly fried flesh.”"
    },
    {
      "title": "Read poetry, articles, or a book you're in the middle of out loud.",
      "content": "Read poetry, articles, or a book you're in the middle of out loud. The best way to get better at speaking without shakiness is to speak often. To practice in low-pressure situations, read various things out loud. Treat it like a performance. Speak loudly and softly, high and low, and get emotional. Do a private reading for a friend when you feel like you're ready for an audience. [5] X Research source If you have a particular speech you're preparing for, that's perfect! Read that out loud every day. You can also record yourself on your phone or a video camera. Watch or listen to the playback to find spots for improvement."
    },
    {
      "title": "Exercise to get rid of excess energy.",
      "content": "Exercise to get rid of excess energy. Go for a run in the morning or walk around the building before you have to give a speech, perform, or have a tough conversation."
    },
    {
      "title": "Open up your throat by sticking out your tongue.",
      "content": "Open up your throat by sticking out your tongue. Go to the bathroom right before your talk or speech. Stick your tongue out as far as you can, and say a nursery rhyme or one of your tongue twisters with your tongue out. As ridiculous as this feels, it actually opens up your throat. This will make more space for sound in there, providing you with a stronger and louder speaking voice. [6] X Research source"
    },
    {
      "title": "Center yourself by keeping your legs firmly on the ground.",
      "content": "Center yourself by keeping your legs firmly on the ground. This is important whether you're standing or sitting. Place your feet about shoulder-width apart. Keep your feet flat on the ground, and don't rock, sway, or shift your weight from side to side. This is your power stance. Embrace it. [7] X Research source"
    },
    {
      "title": "Straighten your shoulders to get a good, open posture.",
      "content": "Straighten your shoulders to get a good, open posture. Having slumped shoulders and bad posture will actually make it harder for you to breathe deeply. This means that it'll be even harder for you to speak clearly and without a shaky voice. Slouching will also make you look nervous, so it's something to avoid during public speaking for lots of reasons. [8] X Research source"
    },
    {
      "title": "Rely on your breathing exercises.",
      "content": "Rely on your breathing exercises. If you're feeling nervous as you're getting ready to start speaking, focus on your breathing. Pretend you have that towel around your waist, and push it out a few times. The oxygen will energize you, while focusing on the exercise will calm your nerves. [9] X Research source"
    },
    {
      "title": "Sip some water right before you begin speaking.",
      "content": "Sip some water right before you begin speaking. Bring a water bottle along with you just in case no one gives you water. Getting hydrated will keep your voice clear rather than scratchy and dry."
    },
    {
      "title": "Act confident even if you're nervous",
      "content": "Act confident even if you're nervous . You know your stuff. Even if you're nervous, remember that you've worked hard to be where you are. Smile, stand up straight, and look people in the eyes. Acting confident can actually make you feel more confident, so fake it 'til you make it! [10] X Research source"
    },
    {
      "title": "Start strong and open with a smile.",
      "content": "Start strong and open with a smile. Smiling will stretch your face and engage your audience (whether it's big or just one person) right off the bat. Speak loudly and clearly right away. You can moderate your voice if it sounds too loud, but it'll be better to start off in a way that lets everyone hear you. [11] X Research source Getting a good start may help you feel more confident. The first few words will be the hardest. If you don't have a good start, don't allow that to make you upset or more nervous! Take a sip of water and a deep breath, smile again, and keep going. You're gonna make it through this."
    },
    {
      "title": "Speak slowly to keep your audience engaged.",
      "content": "Speak slowly to keep your audience engaged. You probably want to rush through this speech or conversation to finish it as quickly as you can. Resist the urge! If you move too fast, you'll lose people's attention because they won't be able to understand you. [12] X Research source Some people in your audience may be taking notes, and they won't mind if you speak extra slowly."
    },
    {
      "title": "Raise your voice to let everyone hear you.",
      "content": "Raise your voice to let everyone hear you. Think about your voice and breathing exercises and project your voice so that it's loud and clear. Shakiness comes from shallow breaths and nervousness. If you're taking deep breaths to make your voice loud enough to let everyone in the audience hear you, it should naturally be less shaky. [13] X Research source A strong and loud voice will also automatically make you sound more confident, even if there is a slight shake. Remember that the most important thing is for your audience to be able to hear and understand you."
    },
    {
      "title": "Make eye contact with people in your audience",
      "content": "Make eye contact with people in your audience . Don't look down at your notes more than you absolutely need to in order to remember what you're saying. Keep your eyes on your audience. This will make you look more confident, and it'll help you keep your rib cage open for good breathing. [14] X Research source If you need to, focus on people's foreheads rather than their eyes. They won't be able to tell the difference. [15] X Research source"
    },
    {
      "title": "Keep your energy up through the whole speech or chat.",
      "content": "Keep your energy up through the whole speech or chat. This might be tough, because you'll probably start getting super tired toward the end. You've been working so hard to keep your voice strong and steady! Push through to the end and go out with a bang. [16] X Research source"
    },
    {
      "title": "Pause and sip water if you need a quick break.",
      "content": "Pause and sip water if you need a quick break. If you're feeling nervous, speaking too fast, or are worried the shake is coming back, stop. It's normal for people to pause during speeches or conversations. Cover it up with a sip of water, breathe, and keep going from there. [17] X Research source"
    },
    {
      "title": "Don't let mistakes get you down.",
      "content": "Don't let mistakes get you down. Everyone (no, really, everyone) makes mistakes. No one is going to judge you if you slip or stumble over a word, or if your voice does start to shake. It may actually make people relate to you, because they've been there. Remind yourself that everyone in your audience has been in your position, and keep on going. [18] X Research source"
    }
  ]
}