{
  "url": "https://www.wikihow.com/That-Girl-Aesthetic",
  "title": "All About the \"That Girl\" Aesthetic",
  "steps": [
    {
      "title": "The \"that girl\" aesthetic is a style and lifestyle aesthetic that focuses on self-improvement and wellness.",
      "content": "The \"that girl\" aesthetic is a style and lifestyle aesthetic that focuses on self-improvement and wellness. Typical \"that girl\" videos depict an idealized daily routine, including making a pristine bed, drinking green juice, eating avocado toast, following an extensive skincare regimen, working out, and journaling—all while basking in natural sunlight streaming through the bedroom window. [1] X Research source A self-proclaimed \"girl boss,\" “that girl” dedicates herself to achieving her dreams while also embracing a slower, more relaxed lifestyle. Despite this balanced approach, she maintains that anyone can emulate her success through sheer effort and by adhering to her straightforward daily routine."
    },
    {
      "title": "The \"that girl\" trend emerged right around the time of the pandemic.",
      "content": "The \"that girl\" trend emerged right around the time of the pandemic. The COVID-19 pandemic, as reported by the U.S. Chamber of Commerce, dramatically reshaped the $4.5 trillion wellness industry. This includes the rapid growth of online therapy, digital coaching, at-home fitness, and more. This dramatic shift has not only altered consumer behaviors, but also influenced the content that users now seek out and the influencers they aspire to emulate. [2] X Research source Adopting a specific aesthetic can provide a sense of ease and belonging. Simply emulating someone else's style of dress, speech, and daily routine can help viewers feel like they’re \"that girl.\""
    },
    {
      "title": "Some feel the aesthetic can distort your self-perception and undermine your confidence.",
      "content": "Some feel the aesthetic can distort your self-perception and undermine your confidence. Many have pointed out that the content creators driving the “that girl” aesthetic seem to showcase a very specific type of girl for their audience to aspire to. She is typically a thin, white woman with financial means, which may create an unrealistic view of how attainable this lifestyle actually is. Those with more money can more easily devote time to activities like journaling and exercising, and can afford the expensive groceries that supplement this curated aesthetic. [3] X Research source Overall, many feel that the \"that girl\" depiction fails to represent the diversity of women's experiences and backgrounds."
    },
    {
      "title": "The “that girl” aesthetic can quickly lead to burnout from trying to achieve perfection.",
      "content": "The “that girl” aesthetic can quickly lead to burnout from trying to achieve perfection. \"That Girl\" mentality encourages women to constantly strive for perfection, which is an unrealistic and unsustainable expectation. Some may find that the pursuit of being \"that girl\" can be exhausting and overwhelming. Inevitably, when life's challenges arise and things go awry, they are left grappling with feelings of shame, guilt, and disappointment. [4] X Research source"
    },
    {
      "title": "Workout sets",
      "content": "Workout sets Sets are a dream come true for “that girl” because she doesn’t have the time to be putting fancy outfits together—she’s too busy taking over the world! Since a lot of her time is dedicated to self-improvement and working out, matching workout sets are the perfect choice. What’s great about them is that you can do all of your working out in them, plus look cute enough to run some errands afterwards."
    },
    {
      "title": "Leggings",
      "content": "Leggings Leggings are an easy breezy way to be comfortable while still looking cute. They go with essentially, well, everything, and you can handle all of the tasks of the day with ease in a nice pair."
    },
    {
      "title": "Sweatshirts",
      "content": "Sweatshirts Comfort is everything to “that girl” because she’s mostly focused on improving herself on the inside out. An oversized sweatshirt paired with a set of leggings is the best way to maximize comfort with a dressed down style. Errands, cleaning, hiking, shopping, you name it—it can all be done in a cute sweatshirt."
    },
    {
      "title": "Tennis skirts",
      "content": "Tennis skirts When she needs to get a little dressed up but still look put together, “that girl” will often reach for a white tennis skirt. Whether she’s meeting up with the girlies or actually heading out to get her tennis game on, this look is polished, clean, and bright."
    },
    {
      "title": "Healthy eating",
      "content": "Healthy eating Eating healthy is a big part of the \"that girl\" aesthetic because it focuses on your well-being. While strict fad diets may be what many \"that girls\" go for, practicing intuitive eating is much healthier approach to living nutritiously . Intuitive eating encourages us to listen to our body's natural hunger cues, rather than adhering to strict dietary rules. This approach emphasizes focusing on foods that make you feel nourished and maintaining an overall balanced diet. This can help develop healthier, more sustainable eating habits. [5] X Research source Begin eating intuitively by making simple changes to your daily routine. For example, reach for options that are rich in fiber like brown rice instead of white, whole-wheat pasta, and whole-grain bread. Cut back on sugar, salt, saturated fats and replace high-calorie snack options with fruits and vegetables. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Eat your favorite foods, but only in moderation. Being \"that girl\" is all about feeling good in your body and being confident, so restricting yourself too much isn't the vibe here. Eat the foods you enjoy, but just keep an eye on the portion sizes."
    },
    {
      "title": "Working out",
      "content": "Working out Almost every \"that girl\" you come across will incorporate working out into her daily routine. And it's easy to see why, because this aesthetic is all about becoming your best self. However, it's important not to compare yourself to what you see on social media. Focus on becoming strong, healthy, and feeling your best instead of trying to look a certain way. [7] X Research source Start working out by making exercise a priority. Even if it's just for a few minutes a day, getting up and moving is ideal. Finding an exercise you enjoy will help you stick to it; for example, maybe you like dancing or hula hooping, which are both really fun ways to get up and move. If you're having a hard time motivating yourself, go to the gym with a partner or group or work with a personal trainer. Often times, having someone to hold you accountable for your goals can be really motivating. Stick to a schedule. Working out whenever you feel like it probably won't be the best idea for staying on track, so choose specific times and days that work best for you. Maybe you get off work every day at 5pm, so you could opt to go right afterwards. Or, maybe you have an hour for lunch every day and can sneak in a 15 minute walk. All in all, just stick to a routine."
    },
    {
      "title": "Skincare",
      "content": "Skincare The influencer scene is currently dominated by skincare, and for good reason. A consistent skincare routine can give you a \"lit from within\" glow that embodies the \"that girl\" aesthetic. For those new to skincare , start with the basics. There are three main goals: cleansing, addressing problem areas, and hydrating. [8] X Research source Cleansing is a simple step that's likely already part of your routine—a basic drugstore cleanser can do the trick. Next, target your specific needs with toners and serums from the wide range of options available. Finally, moisturizer is a crucial step for everyone, even oily skin types (just opt for an oil-free formula). Moisturizing helps slow down aging and maintain a healthy, fresh complexion."
    },
    {
      "title": "Journaling",
      "content": "Journaling “That girl” is all about a great self-care routine, which includes journaling . Maintaining a self-care journal can be a powerful tool for prioritizing your physical, mental, and emotional well-being. By consistently reflecting on your thoughts, feelings, and behaviors in this journal, you'll gain valuable insights into the factors that support your overall health and the triggers that contribute to stress or anxiety. [9] X Research source To start journaling, find a notebook that you'd like to dedicate to your journal goals. Make sure the pages are to your liking--i.e., lined, unlined, a certain size. Choose a time of day that feels good to you and is free of distraction. Journaling is all about clearing your mind and getting your thoughts on paper, so make sure there is minimal noise and activity around you. Then, just allow your thoughts to flow freely and without fear of judgement. You can write about your day, the people in your life, how something made you feel, your goals and upcoming plans, song lyrics, or whatever comes to mind. Keep this routine going daily."
    },
    {
      "title": "Reading",
      "content": "Reading As “that girl,” keeping your mind witty and sharp is part of the lifestyle. Reading reduces stress, helps you sleep better, and can improve your relationships. [10] X Research source Reading is meant to be relaxing, so choose genres that speak to you. Don't feel like you have to be stuck reading self-help books or \"girl boss\" novels just to fit into the \"that girl\" aesthetic (unless that's what you're into)! Carve out a little time in your schedule every day for reading. Even if it's just for 15 minutes, your brain will thank you later."
    },
    {
      "title": "Be confident.",
      "content": "Be confident. Confidence is the number one way to achieve this aesthetic. Even in the clothes she wears, \"that girl\" always promotes self-love and admires her reflection. She openly shares her love and support for other girls as well. [11] X Research source Moreover, they exude confidence in their daily lives. \"That girl\" will never allow a man to disrespect them or make inappropriate comments."
    },
    {
      "title": "Be positive.",
      "content": "Be positive. Girls who follow this trend are remarkably positive and exude warmth. The mantra \"Girls Support Girls\" is crucial for those who identify as \"that girl.\" It's essential to uplift and support other women, especially when they are facing challenges. Spread love, express gratitude, smile frequently, and share your positive energy on the internet. [12] X Research source"
    },
    {
      "title": "Maintain a healthy lifestyle.",
      "content": "Maintain a healthy lifestyle. \"That girl\" prioritizes taking care of her body and eating nutritious foods. Many of them regularly visit the gym to achieve their fitness goals. However, for those on a tighter budget, at-home workouts using helpful wikiHow tutorials can be just as effective in getting the body you desire. [13] X Research source"
    },
    {
      "title": "Focus on your career and goals.",
      "content": "Focus on your career and goals. Women who embody the \"that girl\" aesthetic are often highly ambitious and career-focused. They place a strong emphasis on their professional goals and are unwilling to let romantic relationships interfere with their personal pursuits. They tend to identify as feminists, exhibiting self-assurance, self-acceptance, and a celebration of their unique identities. [14] X Research source"
    },
    {
      "title": "The \"that girl\" aesthetic embodies the persona of \"living your best life,\" but it has its flaws.",
      "content": "The \"that girl\" aesthetic embodies the persona of \"living your best life,\" but it has its flaws. While some find the \"that girl\" aesthetic trend to be inspiring, others view it as somewhat toxic. At the end of the day, you should feel free to pursue any aesthetic you're drawn to. But never feel pressured to conform to unrealistic standards. If living the \"that girl\" lifestyle gives you motivation and makes a positive impact on your physical and mental health, then definitely go for it! But if you're feeling burned out, are constantly comparing yourself to others, get depressed when you aren't able to live up to unrealistic goals, or are becoming obsessed with being \"perfect,\" these are signs you may need to take a step back from this aesthetic. Remember, the \"that girl\" aesthetic looks different on everyone. Maybe the influencer you follow wakes up at dawn, goes for a 30-minute run, and eats a kale smoothie for breakfast. You don't have to do this just because she does—your wins will manifest in their own way."
    }
  ]
}