{
  "url": "https://www.wikihow.com/Use-Hibiclens",
  "title": "How to Use Hibiclens",
  "steps": [
    {
      "title": "Take out any body piercings and remove any jewelry before using Hibiclens.",
      "content": "Take out any body piercings and remove any jewelry before using Hibiclens. Leave them all out until after your surgery. Keeping in body piercings or continuing to wear jewelry increases the chances of infection because the metals or other materials they are made of can carry germs that can transfer to your skin. [1] X Research source Your doctor will either provide you with a bottle or tell you to buy one if it is necessary to use before your surgery. It is available in most pharmacies, but you should call beforehand to make sure they have it in stock. Your doctor will usually let you know how long you should wait after your surgery before you can start to wear piercings and other jewelry, as well as provide you with all other post-surgery care instructions."
    },
    {
      "title": "Shower or bathe with Hibiclens once a day for 3 days before your surgery.",
      "content": "Shower or bathe with Hibiclens once a day for 3 days before your surgery. Use it one more time the morning before your surgery to maximize the effectiveness of the Hibiclens. This will ensure that your skin, especially around the surgical site, is free of germs. Hibiclens looks and feels like liquid soap. However, it must be used with more care than regular shower gel."
    },
    {
      "title": "Avoid washing any part of your head or genitals with Hibiclens.",
      "content": "Avoid washing any part of your head or genitals with Hibiclens. Never apply Hibiclens to your face, hair, ears, or private parts. It contains very strong antimicrobials that will cause irritation in these sensitive areas. [2] X Research source If you accidentally get the soap in or on any of these areas, rinse the area immediately with cold water. If you get it in your eye, continue rinsing out your eye for 15-20 minutes. If any irritation persists after 1 hour, go to an urgent care clinic or emergency room for assistance."
    },
    {
      "title": "Avoid using any other products on your skin after using Hibiclens.",
      "content": "Avoid using any other products on your skin after using Hibiclens. Don’t put any lotions, creams, oils, deodorants, powders, perfumes, or cologne on your skin after washing yourself with the soap. Do not use regular soap after showering or bathing with Hibiclens, other than to wash your hands. [3] X Research source Products like these will make the Hibiclens less effective. It’s important not to put anything else on your skin after showering or bathing with Hibiclens so it can do its job. If you absolutely need to use some kind of lotion, then ask your doctor which kinds are ok to use. If you are in the hospital, they can usually provide you with one that is compatible with Hibiclens."
    },
    {
      "title": "Use only clean towels and clothes after applying Hibiclens.",
      "content": "Use only clean towels and clothes after applying Hibiclens. Don’t use any dirty towels or clothes that might introduce germs to your skin. Freshly-laundered towels and clothing are preferable. [4] X Research source Have these clean towels and clothes ready next to the shower or bath so you can dry off and put on the clean clothes right away."
    },
    {
      "title": "Sleep with clean linens the night before your surgery.",
      "content": "Sleep with clean linens the night before your surgery. Put freshly-laundered sheets on your bed the night before surgery. Sleep on them after the third time you bathe or shower with Hibiclens. This will minimize the risk of any germs getting on your skin as you sleep the night before your surgery."
    },
    {
      "title": "Wash your hair with your normal shampoo and rinse it thoroughly.",
      "content": "Wash your hair with your normal shampoo and rinse it thoroughly. Start with your hair before washing the rest of your body. Apply the shampoo as you normally would, then rinse it out extra-thoroughly to ensure there are no traces of the shampoo left in your hair. [5] X Research source Even though you won’t wash your hair with Hibiclens, you need to make sure there is no shampoo left that could transfer to other parts of your body that you will wash with Hibiclens."
    },
    {
      "title": "Use your regular soap to wash your face and genital area and rinse them well.",
      "content": "Use your regular soap to wash your face and genital area and rinse them well. Apply the soap that you normally wash your face and body with to these areas. Rinse them very thoroughly to remove all traces of it. [6] X Research source Remember to never apply Hibiclens to your face or genitals. Clean these areas first with your normal soap before proceeding to wash the rest of your body with Hibiclens."
    },
    {
      "title": "Turn off the shower or step out of the bath before applying Hibiclens.",
      "content": "Turn off the shower or step out of the bath before applying Hibiclens. This will ensure that you don’t dilute the Hibiclens with water before you apply it to your body. It will not be as effective if it gets watered down. If you have a very large shower and it is possible to step far enough away from the shower stream to avoid getting wet, then it is OK to do this."
    },
    {
      "title": "Pour a quarter-sized dollop of Hibiclens onto a clean, wet washcloth.",
      "content": "Pour a quarter-sized dollop of Hibiclens onto a clean, wet washcloth. Get a clean washcloth wet in the shower or bath. Squeeze out some of the Hibiclens onto the wet washcloth. You will be able to add more as you go if needed, so don’t worry too much about the exact amount of soap you squeeze out onto the cloth."
    },
    {
      "title": "Apply the soap to your body from the neck down.",
      "content": "Apply the soap to your body from the neck down. Gently scrub down your entire body with the Hibiclens, avoiding your head and genitals. Apply more soap to the cloth as needed until you have been able to apply the Hibiclens to your whole body. Try to do this whole process relatively quickly, in about 3 minutes or so. Start at the neck and work your way down for maximum efficiency. Don’t scrub your skin too hard or you might cause irritation."
    },
    {
      "title": "Rinse yourself off thoroughly with warm water to remove all of the Hibiclens.",
      "content": "Rinse yourself off thoroughly with warm water to remove all of the Hibiclens. Turn the shower back on or step back into the bath and rinse off your entire body. Inspect yourself to make sure there are no traces of the soap left on your body before you get out of the shower or bath. Remember not to use any regular soap after using the Hibiclens. When you are done rinsing it off, your shower or bath is over."
    },
    {
      "title": "Get out of the shower or bath and dry off with a clean towel.",
      "content": "Get out of the shower or bath and dry off with a clean towel. Grab a clean towel, preferably freshly-laundered. Pat yourself completely dry with the towel, then put it aside. [7] X Research source Never use a dirty towel after applying Hibiclens, even if it has only been used once. Towels easily harbor microbes that you can transfer to your skin."
    },
    {
      "title": "Put on clean clothes after you are dry.",
      "content": "Put on clean clothes after you are dry. Cover your body with fresh, clean clothing. Freshly-laundered clothes are ideal. It’s especially important to keep your surgical site covered with clean clothes after showering or bathing with Hibiclens."
    }
  ]
}