{
  "url": "https://www.wikihow.com/Write-an-Emotional-and-Meaningful-Song",
  "title": "How to Write an Emotional and Meaningful Song",
  "steps": [
    {
      "title": "Focus on a particular emotion.",
      "content": "Focus on a particular emotion. Choose an emotion that is strong and overwhelming for you, such as desire, anger, rage, or sadness. Focus on your experience of the emotion and any experiences or events you associate with that emotion. [1] X Research source For example, you may write about an emotion like desire. You may write about your desire for a particular person or for a particular experience."
    },
    {
      "title": "Describe an emotional experience or memory.",
      "content": "Describe an emotional experience or memory. Think about an experience or memory that you associate with strong emotions. Explore that experience or memory, delving into how you felt at the time. Make a list of emotions that you associate with the memory or experience. For example, if you decide to focus on a memory from your childhood, you may write down emotions like \"loneliness,\" \"love,\" anger,\" and \"freedom.\" Or if you are describing a recent relationship that went sour, you may write down emotions like \"regret,\" \"rage,\" \"spite,\" and \"sadness.\""
    },
    {
      "title": "Explore a meaningful relationship.",
      "content": "Explore a meaningful relationship. The relationship could be romantic, such as your relationship with your ex-lover or partner. You could also write about the relationship between you and your sibling or your best friend. For example, you may focus on a recent fight between you and your best friend. Brainstorm ideas around how the fight made you feel."
    },
    {
      "title": "Make a word list about your topic.",
      "content": "Make a word list about your topic. Write your topic in the center of the page. Then, write a list of words about your topic on the page that you can put into the song. Use descriptive, detailed words or phrases that come to mind when you think about your topic. For example, if you are writing about desire, you may write down, “summer,” “night rides,” “making out at the look out,” “dark haired boy,” and “heat.”"
    },
    {
      "title": "Listen to examples of emotional songs.",
      "content": "Listen to examples of emotional songs. To get a better idea of how to write an emotional song, listen to successful examples. You can listen to songs in a variety of genres, such as pop, dance, country, or rap. You may listen to: “When Doves Cry” by Prince “Since U Been Gone” by Kelly Clarkson “This Year” by the Mountain Goats “Fallin’” by Alicia Keys “Jolene” by Dolly Parton"
    },
    {
      "title": "Write the chorus",
      "content": "Write the chorus . The key to a meaningful song is usually the chorus, which appears after the first verse of the song. The chorus should be no longer than one to eight lines long. The same lines in the chorus are usually repeated at least one to two times. Listen to the chorus in your favorite songs to help you identify the structure. The chorus is usually the same words used in the title of the song."
    },
    {
      "title": "Include emotion in the chorus.",
      "content": "Include emotion in the chorus. Use “I” in the chorus so you connect with the listener. Keep the chorus short, simple, and powerful. Focus on a particular emotion or feeling you have about the topic of the song. Maybe you feel defiant and strong, so you may use phrases like \"I'm going to make it\" or \"I will persevere.\" [2] X Research source For example, in the Mountain Goats’ song “This Year,” the chorus is only two lines: “I am going to make it through this year/If it kills me.” The chorus is only two lines, but it explores emotions like anger, recovery, and determination. [3] X Research source You can also add inflection to the lines in the chorus to give it more emotion, like in Dolly Parton's song \"Jolene,\" where the chorus is sang as \"JoJolene, Jo-olene, Jolene, Jo-leeeeene.\""
    },
    {
      "title": "Use sensory details and images.",
      "content": "Use sensory details and images. When you write the chorus and verses for the song, focus on your senses and how it feels to experience an emotion. Describe how you feel using touch, sight, sound, taste, and smell. [4] X Research source For example, in Prince’s song “When Doves Cry,” the first verse focuses on senses like touch and sight: “Dig if you will the picture/Of you and I engaged in a kiss/The sweat of your body covers me/Can you my darling/Can you picture this?”"
    },
    {
      "title": "Express emotion without cliche.",
      "content": "Express emotion without cliche. It can be easy to fall into cliche when you talk about your emotions. Cliches are phrases or words that have become so familiar, they have lost their meaning. Go for words and phrases that are unique and particular to your experience. Use specific details that are not sentimental. It will show the listener that you are trying to connect with them on a personal, intimate level. For example, in the Mountain Goats’ song “This Year,” the songwriter describes first love in a unique way: “And then Cathy showed up/And we hung out/Trading swigs from a bottle/All bitter and clean/Locking eyes/Holding hands/Two high maintenance machines.” [5] X Research source"
    },
    {
      "title": "Add emotion to the song with a bridge.",
      "content": "Add emotion to the song with a bridge. The bridge section of a song is considered a peak emotional moment. It is usually one to four lines long and appears towards the middle to end of the song. It should have a different melody than the verse and chorus. It should contain a realization or an insight that you are sharing with the listener. For example, in Kelly Clarkson’s song “Since U Been Gone,” the bridge appears in the last section of the song and is charged with pure emotion: “You had your chance, you blew it/Out of sight, out of mind/Shut your mouth, I just can’t take it/Again and again and again and again.” [6] X Research source"
    },
    {
      "title": "Put the chorus, verses, and bridge together.",
      "content": "Put the chorus, verses, and bridge together. Once you have all the pieces of the song, put them together in a standard song structure. The typical structure is verse, chorus, verse, bridge, chorus. You can add more verses or a repetition of the chorus as you see fit. It may add more emotional punch to finish the song on one or two repetitions of the chorus, especially if you feel the chorus has a lot of meaning to you."
    },
    {
      "title": "Title the song.",
      "content": "Title the song. The title of the song usually contains words or phrases from the chorus. It should sum up the main idea or emotion explored in the song. A good title will reveal a bit about the song without being vague or unclear. For example, the title “When Doves Cry” works for Prince’s song because it ties back to the chorus and it sums up the emotional themes and ideas in the song."
    },
    {
      "title": "Try playing a melody on the guitar.",
      "content": "Try playing a melody on the guitar. Once you have the lyrics to the song down, you can add music to them to help them feel more emotional. Often, a simple guitar melody can add an emotional, intimate mood to the song. [7] X Research source Try copying the guitar melodies in your favorite songs. Add your own twist or riff to the melody to make it your own."
    },
    {
      "title": "Use piano in the song.",
      "content": "Use piano in the song. Piano can also be a good way to add emotion and meaning to song lyrics. Try playing piano on a keyboard or get access to a grand piano. Play a simple melody on the piano and sing the lyrics to the melody. Alicia Key’s song “Fallin’” is a good example of using piano in a song to create an emotional atmosphere."
    },
    {
      "title": "Add strings and drums to the song.",
      "content": "Add strings and drums to the song. Strings like violin or cello can add more of a lush, soft mood to the song. Drums can also add a slow tempo to the song, making it feel more emotional and intimate. You can ask a violinist or cellist to play on the song. You can also try to find a drummer. Alternatively, you can add strings and drums to the song using digital music equipment that imitates these sounds."
    },
    {
      "title": "Record the song a cappella.",
      "content": "Record the song a cappella. If you'd prefer not to have music with the song, do an a cappella version of the song where there is no instrumentation besides your voice. Practice singing the song a few times before you record it a cappella. Play with the inflection of words and phrases in the song. Imbue your voice with emotion when you sing the song a cappella so the listener can hear it in your voice."
    }
  ]
}