{
  "url": "https://www.wikihow.com/Win-a-Perfection-Match-in-Battle-of-Polytopia",
  "title": "How to Win a Perfection Match in Battle of Polytopia",
  "steps": [
    {
      "title": "Always play with 9 tribes on Crazy Mode.",
      "content": "Always play with 9 tribes on Crazy Mode. Whenever you play a perfection match in Polytopia, you should always play with 9 tribes on crazy mode. Not only will it give a huge difficulty bonus, but it makes it much easier to start off your civilization. When you spawn in, you may be met with a few tribes very close to you, which gives you a resource bonus. Doing this, most people end up leveling up their base on Turn 0. When you play on Crazy Mode you also get a 230% score bonus! This makes your end score go up dramatically. Just with this simple trick you'll most likely get your score to at least 25,000! Since the maximum number of tribes you can go against is 9, you can turn off special tribes or tribes that you are not interested in."
    },
    {
      "title": "Make sure you have a good spawn.",
      "content": "Make sure you have a good spawn. If you don't have a good spawn when you start off your game, it's going to be very hard to get a score of 80k. An example of a bad spawn would be: If you are isolated from the other tribes, if you don't have many resources, and if you are surrounded by mountains (if you don't have climbing)."
    },
    {
      "title": "Don't waste your money.",
      "content": "Don't waste your money. This game is a pay to win game. That means you'll have to pay money if you want a better score. Don't spend your money on tribes such as Vengir or Luxidoor, because the skills they start with are not very useful and they don't have many available resources where they spawn."
    },
    {
      "title": "Focus on your economy.",
      "content": "Focus on your economy. When you start off your game, make sure that you make the most resources as possible. This means that you will want to get these three skills: Trade, Sailing, and Forestry. If you use these skills often you may end up getting 150 resources by turn 30."
    },
    {
      "title": "Take out any tribes that could pose a threat to you in the future.",
      "content": "Take out any tribes that could pose a threat to you in the future. It is vital to know that every tribe you meet will end up attacking you at some point in the game. This means that you'll want to eliminate every tribe by turn 20. Doing this will make it much easier to build more ports and grow a larger economy."
    },
    {
      "title": "Focus on exploring and researching.",
      "content": "Focus on exploring and researching. Exploring and researching both are huge parts to getting a higher score. Researching can add around 5000 points to your score if your research everything. They both also give you altars that will increase your score and your population!"
    },
    {
      "title": "Try to add as many temples as possible by researching the Free Spirit tech and Aquatism.",
      "content": "Try to add as many temples as possible by researching the Free Spirit tech and Aquatism. Temples add 100 score for each temple placed and add 1 population to the nearest city. Temples are a vital part to getting a good score. You want to add a temple at almost every tile possible. They may be very expensive, but they are worth the cost."
    },
    {
      "title": "Add as many parks as possible.",
      "content": "Add as many parks as possible. When you've destroyed every other tribe in the game and you have no need for super units, then don't get any. Parks add 400 score, so they are very useful at the end of the game when there are no enemies left."
    },
    {
      "title": "Keep adding as many ports and temples and possible.",
      "content": "Keep adding as many ports and temples and possible. At the very end, the game is not just about building ports on the coast because it is \"useful\" add ports on the lakes or even little tiles of water. They add a higher score and will help you upgrade your city so that you can get more parks."
    }
  ]
}