{
  "url": "https://www.wikihow.com/Tape-Your-Boobs-for-a-Strapless-Dress",
  "title": "How to Tape Your Boobs for a Strapless Dress",
  "steps": [
    {
      "title": "Cut your boob tape into short and long sections.",
      "content": "Cut your boob tape into short and long sections. For this bandeau style, you’ll need about 3 short and 2 long pieces of tape for each breast. The short pieces should roughly cover your nipple, and the long pieces will need to be the vertical length of your breast. [1] X Research source Each breast is beautifully unique, and you may need more or less tape than this. If you have larger breasts, you may need more tape to cover and support your tissue. If you have smaller breasts , you may need less tape and could even cut the tape in half."
    },
    {
      "title": "Lift your breast with one hand and guide a short piece of tape upwards.",
      "content": "Lift your breast with one hand and guide a short piece of tape upwards. Start by placing one end of the tape below your nipple, and then pull the other end towards the top of your breast. Rub the tape down to help smooth everything out. [2] X Research source Use a mirror so you can see what you’re doing. Try not to touch the underside of the tape too much. The more you touch the tape, the less sticky it’ll be."
    },
    {
      "title": "Put an additional piece of tape on either side of the first piece.",
      "content": "Put an additional piece of tape on either side of the first piece. Think of it like building the cup of a bra. You want to cover and shape your breast. In the end, you’ll have 3 pieces of short tape running vertically over the front of your breast. [3] X Research source If you need more than 3 pieces of tape to cover your breast, no worries! Each breast is different, so add as many pieces as you need to feel secure."
    },
    {
      "title": "Stretch a longer strip of tape under your breast horizontally.",
      "content": "Stretch a longer strip of tape under your breast horizontally. Hold up your breast with one hand, and start taping from the outside in. Rub the tape down, following the “U” shape you’ve just made to cup your breast. [4] X Research source The shorter vertical pieces of tape will overlap with the longer piece of tape, and that’s okay. This gives you an extra layer of support."
    },
    {
      "title": "Apply another piece of longer tape above the last.",
      "content": "Apply another piece of longer tape above the last. Basically, you’re wanting to cover the entire front of your breast like the cup of a bra. Adding extra longer pieces will create more lift and support, so apply as many pieces of tape as you need. [5] X Research source"
    },
    {
      "title": "Repeat on the other breast, and voilà!",
      "content": "Repeat on the other breast, and voilà! You have created a strapless and backless bra with boob tape. [6] X Research source If you’re looking for a flatter look, consider wrapping the tape over your bust and cleavage. This will flatten your breasts while creating support."
    },
    {
      "title": "Measure the distance between your left armpit and right lower rib cage.",
      "content": "Measure the distance between your left armpit and right lower rib cage. This is how long your tape will need to be."
    },
    {
      "title": "Cut two pieces of tape to match your measurements.",
      "content": "Cut two pieces of tape to match your measurements. This taping method is rather simple, but you can always add more pieces of tape if your breasts need more support."
    },
    {
      "title": "Place one piece of tape on the side of one breast and across your ribcage.",
      "content": "Place one piece of tape on the side of one breast and across your ribcage. Stick one end of the tape underneath your armpit at the side of your breast, and then pull the other end across your torso to the bottom of your opposite rib. The tape may land near or on your hip. This taping style is in the shape of an “X,” so the first piece of tape will be one of the intersecting lines."
    },
    {
      "title": "Repeat the previous step on the other side.",
      "content": "Repeat the previous step on the other side. Mirror where you placed the tape on the opposite side, crossing it over your torso and the other piece of tape to create an “X” shape. This cross-style method will push your breasts together and provide a subtle lift perfect for strapless and backless dresses. If you’re wearing a backless dress , make sure the ends of your tape don’t show by cutting off any excess."
    },
    {
      "title": "Cut long pieces of tape that measure from armpit to armpit.",
      "content": "Cut long pieces of tape that measure from armpit to armpit. The number of pieces you’ll need all depends on you and your breasts. Try starting with 3 pieces and cutting more as you go. [7] X Research source"
    },
    {
      "title": "Lean forward and tape the underside of your breasts.",
      "content": "Lean forward and tape the underside of your breasts. Place one side of the tape under an armpit, pulling the end towards the other armpit in a long \"U\" shape as you stick it to your skin. This will make your breasts look bigger and cleavage pop. [8] X Research source Try not to pull too hard. Remember, you have to give yourself room to breathe, so make sure you're comfortable while taping."
    },
    {
      "title": "Apply new pieces of tape above the previous piece.",
      "content": "Apply new pieces of tape above the previous piece. Keep layering the tape higher and higher until you reach where a bra cup would stop. This creates a bandeau-like look that pushes your breasts together. [9] X Research source"
    },
    {
      "title": "Mold your breasts into place.",
      "content": "Mold your breasts into place. Once you’ve reached the desired lift and support, push down on the top of your breasts. [10] X Research source"
    },
    {
      "title": "Layer a piece of tape along the last piece of tape you placed.",
      "content": "Layer a piece of tape along the last piece of tape you placed. Think about how your dress is cut, and use the neckline as a guide. Basically, you want to smooth out any bulges that lifting your breasts may have caused. Hold your breasts down with one hand, and stick the tape along the top of your previous piece with the other. Now you’re ready to rock your strapless or backless dress! [11] X Research source"
    },
    {
      "title": "Cut 3 to 5 pieces of tape about the same size as your bra’s cup.",
      "content": "Cut 3 to 5 pieces of tape about the same size as your bra’s cup. This taping method creates the illusion of a strapless, seamless bra, so think about how big your average cup is. [12] X Research source The larger your cup, the more tap you’ll need. The smaller your cup, the less tap you’ll need."
    },
    {
      "title": "Stick the base of the tape under your breast and pull upwards over your nipple.",
      "content": "Stick the base of the tape under your breast and pull upwards over your nipple. Start in the middle of your breast, and rub the tape in place. You may need to use your other hand to hold your breast. This will be tape 1. [13] X Research source"
    },
    {
      "title": "Stick a new piece of tape next to tape 1.",
      "content": "Stick a new piece of tape next to tape 1. Overlap the ends of tape 2 with tape 1 at the top of your breast. This will create a triangle-like shape that lifts and smooths. [14] X Research source"
    },
    {
      "title": "Repeat with tapes 3 through 5 until your breast is secure.",
      "content": "Repeat with tapes 3 through 5 until your breast is secure. Each piece of tape should start at the base of your breast, come up over your breast, and overlap at the top of tape 1. [15] X Research source"
    },
    {
      "title": "Do the same on the other breast and boom!",
      "content": "Do the same on the other breast and boom! You’ve got a strapless and backless bra that has the girls looking flawless. [16] X Research source"
    }
  ]
}