{
  "url": "https://www.wikihow.com/Use-Blood-Meal",
  "title": "How to Use Blood Meal",
  "steps": [
    {
      "title": "Test your soil to see if it needs nitrogen.",
      "content": "Test your soil to see if it needs nitrogen. Buy a simple soil test from your local nursery or garden center and use a sample of soil from your garden or plant container. Follow the test kit instructions to get accurate results. The test will tell you the levels of nitrogen, phosphorus, and potassium. [1] X Research source For example, the test will tell you if there's a surplus of nitrogen, sufficient levels, a deficiency of nitrogen, or if it's completely depleted."
    },
    {
      "title": "See if your vegetable leaves are yellow or wilted.",
      "content": "See if your vegetable leaves are yellow or wilted. Look at your plant leaves for signs of a nitrogen deficiency. The leaves will look yellow or wilted because they don't have enough nitrogen to make chlorophyll. Plants that use a lot of nitrogen and benefit from blood meal include: [2] X Research source Tomatoes Peppers Radishes Onions Squash Cruciferous vegetables (broccoli, cabbage, cauliflower, kale, spinach, brussels sprouts) Lettuce Corn"
    },
    {
      "title": "Consider using blood meal as a deterrent for outdoor pests.",
      "content": "Consider using blood meal as a deterrent for outdoor pests. If rabbits, deer, or small garden pests continue to damage your plants, you can spread a little blood meal directly to the area. Keep in mind that if you sprinkle too much, you'll burn the grass or plants. [3] X Research source Blood meal will wash away after a strong rain, so you may need to reapply it occasionally. While blood meal may keep plant-eating pests away, it can attract meat-eaters, such as dogs, raccoons, or possums."
    },
    {
      "title": "Buy high-quality blood meal.",
      "content": "Buy high-quality blood meal. Purchase USDA approved blood meal from local nurseries, garden centers, or home improvement stores. If you purchase the blood meal online, avoid buying it from countries that have lax laws on meat production because disease can be spread through the blood meal. [4] X Research source For example, blood meal can't be imported to the U.S. from Europe because of the threat of Mad Cow disease. If you can't find high quality blood meal, consider using alfalfa meal or feather meal instead."
    },
    {
      "title": "Begin applying blood meal in early spring.",
      "content": "Begin applying blood meal in early spring. Leafy vegetables, flowers, and plants can use a lot of nitrogen when they put on most of their growth. To help plants grow, apply the blood meal in spring. Because the plants will use the nitrogen and it will gradually wash away, reapply the blood meal every 2 months during the growing season. Avoid using blood meal year round since overuse can burn the plants or your lawn. Consider switching to a general fertilizer during the rest of the year."
    },
    {
      "title": "Determine how much blood meal you need for your space.",
      "content": "Determine how much blood meal you need for your space. Measure the space where you'd like to adjust the soil. Due to blood meal being so concentrated, you'll only need 1 cup for every 20 square feet of soil. [5] X Research source For example a small container or window box may only need a few spoonfuls of blood meal while a 100 square feet garden will need 5 cups."
    },
    {
      "title": "Mix the blood meal with soil or water before spreading it.",
      "content": "Mix the blood meal with soil or water before spreading it. Read the manufacturer's instructions to determine if you need to mix the blood meal into the top few inches of soil. Some instructions may have you dilute the blood meal with water and pour it on the plant or soil. [6] X Research source While you can sprinkle a little blood meal on soil to deter animals, always mix or dilute it when adjusting nitrogen levels in your soil."
    },
    {
      "title": "Avoid using blood meal on seedlings or beans and legumes.",
      "content": "Avoid using blood meal on seedlings or beans and legumes. Although you can apply blood meal to the soil of many plants and vegetables, don't use it on peas, beans, and other legumes. The roots of legumes have bacteria that add nitrogen back into the soil. You should also avoid using blood meal on seedlings."
    },
    {
      "title": "Lower nitrogen in the soil if you've applied too much blood meal.",
      "content": "Lower nitrogen in the soil if you've applied too much blood meal. If you accidentally spread too much blood meal, you'll notice that your plants may be growing large leaves, but aren't flowering. To reduce the nitrogen and help the plant recover from nitrogen burn: Remove any dried, discolored leaves from the plant. Spread wood mulch around the plant or over the soil. Apply bone meal or a phosphorous fertilizer. Use water to leach the nitrogen away from the plant or ground."
    }
  ]
}