{
  "url": "https://www.wikihow.com/Style-a-Bang-Wave",
  "title": "How to Style a Bang Wave",
  "steps": [
    {
      "title": "Tie back the rest of your hair.",
      "content": "Tie back the rest of your hair. It’s easier to work with your bangs if you keep the rest of your hair out of the way with a hair tie or clip. You will also be styling your bangs differently than you style the rest of your hair, so it’s easiest to section them off. Brush out both your both bangs and any other short layers that frame your face. Your bangs should be damp when you begin styling them. You can either style them right after you shower, or just dampen them again with a spray bottle. For African American hair or any hair that is naturally more coarse or dry, skip the water and apply a heat protectant and a moisturizing cream or oil product instead. [1] X Research source Just make sure that you apply enough product to make your hair feel damp. Otherwise, blow drying it will hurt and cause breakage."
    },
    {
      "title": "Blow-dry your bangs.",
      "content": "Blow-dry your bangs. Even if you want to let the rest of your hair air dry, you should use a blow dryer on your bangs for best results. [2] X Research source First, apply a heat protectant. To make sure your bangs have a lot of movement, blow-dry them all toward one side of your face, then the other, and finally straight down. [3] X Research source This technique will ensure that your bangs don’t look too stiff or straight, which would clash with the loose waves in the rest of your hair."
    },
    {
      "title": "Add waves with a curling wand.",
      "content": "Add waves with a curling wand. If you have very short bangs, you may want to skip this step. Waves will cause your bangs to appear even shorter, so those with very short bangs are all done styling after blow-drying. If you have short to medium bangs, you can use a curling wand to add a bit of extra wave. Grab a small section of your bangs and twist it around the curling wand, holding it in place for only two or three seconds. Unwind your hair and adjust the curl with your fingers. Do this for the rest of your bangs. [4] X Research source The longer you hold your hair against the hot curling wand, the tighter it will be. Because you want your bangs to be wavy but not curly, only hold it for a few seconds. After you uncurl the hair from the wand, you can still form it and soften it while it’s warm. You can pull the bottom of the strand to loosen the wave, and tousle the curls together to make your bangs look softer. You can also curl your bangs with the straightener method if you do not have a curling wand. If you want to create wavy bangs without heat, you could skip blow drying and instead braid your bangs in a traditional 3-strand braid. Once the hair is dry, unbraid it to reveal wavy bangs."
    },
    {
      "title": "Texturize your hair.",
      "content": "Texturize your hair. Once you’ve finished drying your short bangs, let the rest of your hair down. To blend your bangs and your wavy hair, spritz your entire head with some texturizing spray or salt spray, and then style it with your fingers. Once you’re satisfied with how it looks, you can secure your style by spraying a bit of hairspray."
    },
    {
      "title": "Clip the rest of your hair out of the way.",
      "content": "Clip the rest of your hair out of the way. Because your bangs will be side-swept at this medium to long length, it’s much easier to separate your bangs from the rest of your hair. You can focus your hot tools and products on just this section, and this is especially helpful to simplify the process. [5] X Research source Your bangs should be damp when you style them. Dampen them with a spray bottle, or style your hair when you get out of the shower. For African American hair or any hair that is prone to drying out, skip the water and apply a heat protectant and a moisturizing cream or oil product instead. [6] X Research source Make sure that you apply enough product so that your hair is damp. Otherwise, blow drying will be painful and your hair may experience breakage."
    },
    {
      "title": "Blow-dry your bangs.",
      "content": "Blow-dry your bangs. Brush out your bangs to ensure there are no tangles. As you blow-dry, use a round brush or paddle brush to hold your hair taut with the brush so that your roots dry straight. [7] X Research source Loose waves should begin about 1/3 or half way down your hair, so you don’t want any curl near your roots. For medium to long bangs, you can part them in the middle and wear half on each side of your face, or you can sweep them all to one side. Make sure you blow-dry your bangs accordingly."
    },
    {
      "title": "Curl your bangs away from your face.",
      "content": "Curl your bangs away from your face. You can use whichever curling tool you prefer for this step: a curling wand, a curling iron, or a straightener. Start about 1/3 or half way down the strand of hair, so that the wave doesn’t begin too close to the root. Now you have the most important part about styling wavy bangs. Curl your bangs loosely away from your face. [8] X Research source If you curl them towards your face, they will be a major nuisance. By curling them away from your face, they won’t be in your face and they will blend beautifully into the rest of your hair. If you want to get wavy bangs without heat, you can skip blow drying and braid your damp hair. For bangs worn straight across, divide your hair in the middle and braid each side into a traditional 3-strand braid. If you wear your bangs to the side, you can create 1-3 braids that follow your normal part. Once your hair dries, unbraid it to reveal wavy bangs!"
    },
    {
      "title": "Use your fingers to loosen your bangs.",
      "content": "Use your fingers to loosen your bangs. After you’ve added a loose curl with your hot tool of choice, loosen them gently with your fingers. Untie the rest of your hair, and run your fingers through it to make sure the bangs blend in. Add a bit of texturizing spray if you desire, and finish with a bit of hairspray to hold your waves throughout the day."
    }
  ]
}