{
  "url": "https://www.wikihow.com/Style-a-Mullet",
  "title": "How to Style Classic and Modern Mullets",
  "steps": [
    {
      "title": "Style a classic or modern mullet with sea salt spray and light-hold gel.",
      "content": "Style a classic or modern mullet with sea salt spray and light-hold gel. For a more casual take on the mullet, spritz all over damp hair with a sea salt hair spray. Let your hair dry naturally, or blow dry it with a diffuser attachment. For a more polished vibe, warm a dollop of light-hold hair gel in your hands and run it through the ends of your mullet for a piecey and choppy look. The classic mullet features a voluminous layered top and a slightly longer back. Its asymmetrical shape and contrasting lengths give off that classic rockstar look that the mullet is so well known for! [1] X Research source The modern mullet is an updated version of the classic style, and it can be easily personalized to suit your look! It features shorter sides along with the long back section, but it can also be curly, wavy, or modified to include fades and other trends. [2] X Research source"
    },
    {
      "title": "Style a short mullet with a light-to-firm hair clay.",
      "content": "Style a short mullet with a light-to-firm hair clay. Rub a fingertip’s worth of hair clay in between your hands to warm it up. Starting from the back of the head, work your fingers through the hair to disperse the clay. Slowly work to the front, arranging the pieces as you go. [3] X Research source Hair clay will add a lot of texture, movement, and lift to the short hair mullet style. Choose your hold level based on your hair texture—e.g., curly hair may require more hold than straight hair. A short mullet is a more subtle version of the mullet that’s less risky and more appropriate for professional situations. The sides are closely cropped or even shaved, while the top and back of the hair are left untouched or lightly trimmed for neatness. [4] X Research source"
    },
    {
      "title": "Add shape to a medium or long mullet with a soft-hold mousse or gel.",
      "content": "Add shape to a medium or long mullet with a soft-hold mousse or gel. Apply a quarter-sized amount of soft-hold mousse or hair gel into your damp hair. Use your fingers to work the product through your mullet, arranging the pieces of your locks to your desired shape. Finish off by drying your hair and spritzing it with a flexible hair spray. A medium or long mullet can easily fall flat and go limp, so a soft-hold product is essential to help it maintain its shape. In a medium-length mullet , the hair at the back of the head falls around the nape of the neck. This mullet is a great choice for beginners to this style as it can easily be trimmed to a textured bob. A long mullet , on the other hand, features a back section that falls onto or past the shoulders. The tops and sides of the mullet are shorter but still long enough to be slicked backward—usually ending around the cheekbone. [5] X Research source For either of these lengths, ask your barber to cut layers down to the end of your hair to keep the longer section from looking limp."
    },
    {
      "title": "Style an extreme mullet by keeping the lengths straight and sleek.",
      "content": "Style an extreme mullet by keeping the lengths straight and sleek. Use a hair straightener to straighten the long ends at the back of your mullet—you want this look to feel super sharp and defined. Finish off the styling with a light spritz of flexible hairspray . In an extreme mullet, the sides and front of the hair are cut above the ears and eye-line, while the back section is grown out well past the shoulders. This look works best with straight hair to really emphasize the staggering contrast."
    },
    {
      "title": "Spritz sea salt spray onto a straight hair mullet.",
      "content": "Spritz sea salt spray onto a straight hair mullet. If you have straight or thin hair and want to add a little bit of volume to your mullet, use a sea salt texture spray to enhance the look of your cut. [6] X Research source Dampen your hair slightly and apply the sea salt spray all over your mullet. As your hair air dries, keep messing it up with your fingers to give it that tousled and beachy look. If you want to add more volume and lift to the front of your mullet, work in a few pumps of volumizing mousse while the hair’s still damp."
    },
    {
      "title": "Give structure to a wavy hair mullet with volumizing mousse and hair balm.",
      "content": "Give structure to a wavy hair mullet with volumizing mousse and hair balm. On damp hair, apply volumizing mousse to the roots and mid-section of your mullet. Massage a hair balm onto the ends to give some definition and create some piecey locks. Dry your hair using a blowdryer with a diffuser attachment. For a more casual and fresh-out-of-bed look, simply brush your wavy hair mullet toward the back and sides of your head. If you have wavy hair, a good hairstylist will use your hair’s natural waves to add texture, interest, and movement to the mullet hairstyle. [7] X Research source"
    },
    {
      "title": "Style a curly mullet with hair gel and curl cream.",
      "content": "Style a curly mullet with hair gel and curl cream. Wash your mullet and massage a curl cream into your strands. Then, apply a light-to-medium hold gel and use your hands to give your mullet the shape you want. On days when your hair is misbehaving or going in wayward directions, use a bit of light-hold hairspray to lock the pieces in place. Use a hair dryer with a diffuser attachment to dry your hair and set it in place. The curly mullet is specially designed and cut for curly hair with the expertise of a professional barber or hairstylist. Curly hair complements the contrast between a mullet’s shorter and longer locks, making the look more continuous and subtle. [8] X Research source"
    },
    {
      "title": "Use a light-hold hair gel to emphasize the layers in a shaggy mullet.",
      "content": "Use a light-hold hair gel to emphasize the layers in a shaggy mullet. Warm up a dollop of hair gel by massaging it between your palms. Then, run your hands through your hair, paying special attention to certain pieces that you want to look more choppy or defined. Make sure to pull out any face-framing layers before finishing your style. Shaggy or chopped mullets are heavily layered with medium to long lengths at the back of the head and slightly shorter strands up front. A shaggy mullet works well for any hair texture—straight, curly, or wavy. Licensed hair stylist Martin Nepton describes a shag mullet as having drastic face-framing layers, such as a bang, that gradually lengthens all the way around the back of the head. The layer on the top of the head, continues Nepton, will be about 3–6 inches (7.6–15.2 cm) long, depending on how messy you want your look to be."
    },
    {
      "title": "Use a round brush to add extra volume to a wispy or feathered mullet.",
      "content": "Use a round brush to add extra volume to a wispy or feathered mullet. Starting with damp hair, part your hair into 1 inch (2.5 cm) sections. Roll each section of hair around a round brush and use your hair dryer to apply heat. Keep the round brush in and wait to remove it until that section has completely cooled. [9] X Research source A wispy mullet can be cut to any length, but it must feature longer face-framing layers that are softly arranged at the front of the cut for a less extreme look. [10] X Research source A feathered mullet is similar to a classic mullet but with more lightness and volume. This style works best on medium-to-longer hair, and the stylist will feather the layers of the cut to create an airy and voluminous look. [11] X Research source"
    },
    {
      "title": "Give yourself a dramatic side part or side bangs for a side mullet.",
      "content": "Give yourself a dramatic side part or side bangs for a side mullet. A side mullet is all about the styling, as you’re simply taking the classic mullet and sweeping it off to the side! Start parting your hair in a deep side part by dampening your hair and using a tail comb to part it in your desired spot. [12] X Research source If necessary, clip your hair into place so that your locks dry and hold the part. After you do this for a few days and train your hair, you’ll be able to style your mullet as normal. Alternatively, you can comb the longer hair at the back of your head to one side or ask a stylist to cut side-swept bangs. [13] X Research source"
    },
    {
      "title": "Use a round brush and texture spray to style the bangs of a curtain mullet.",
      "content": "Use a round brush and texture spray to style the bangs of a curtain mullet. Also known as the “leaf cut,” this center-parted style features curtain bangs that are swept backward in the shape of a leaf. To style your curtain bangs, use a round brush and slowly roll the brush away from your head as you brush your bangs. Then, spritz some texturizing spray onto your bangs to give them lasting volume. The curtain mullet style is a very relaxed and casual take on the haircut, with medium-length tops and sides and a longer length in the back."
    },
    {
      "title": "Balance out the length of your mullet with some well-styled bangs.",
      "content": "Balance out the length of your mullet with some well-styled bangs. Whether you choose choppy bangs or baby bangs, a decisive fringe really helps to balance out the length at the back of a mullet. To style your bangs, hold a comb at the roots of your fringe and slowly run it through to the ends, followed by your hair dryer. Finish off with a pea-sized amount of texture paste to sculpt your bangs into the exact shape you want. Bangs can be worn with any mullet style, including both shorter and longer cuts. However, a long mullet will create a more extreme look while a shorter cut will be more subtle. [14] X Research source"
    },
    {
      "title": "Go for a wake-up-and-wear look with a fade or undercut mullet.",
      "content": "Go for a wake-up-and-wear look with a fade or undercut mullet. A shaved or faded mullet features “fading” or shaving along the sides or underside of your head. The great thing about these styles is that they require almost no styling! The most important part of the cut is the fade or shave itself (which is done by a barber), and then maintaining the short length with a trim every 2-3 weeks. [15] X Research source In a traditional fade mullet , the sides of the hair aren’t shaved but are as short as they can be without shaving. The mullet gets shorter toward the bottom of the cut and the top is the longest part of the style. [16] X Research source Burst fade mullets have a quick and dramatic transition, in contrast to the normal fade mullet that gradually fades from long to short. The style features sharp edges and lines with long locks on the top of the head. The undercut mullet is similar, but the “buzz” or “fade” is on the underside of the hair rather than the sides. An undercut mullet is cut high and short on the sides with a shaved look around the sides and back of the head. The longer locks around the top of the head are all one length rather than cut with a taper, as they would be in a mullet fade."
    },
    {
      "title": "Use grooming tonic and combing techniques for a pompadour mullet.",
      "content": "Use grooming tonic and combing techniques for a pompadour mullet. To style the long locks of your mullet into a pompadour, start with towel-dried hair and comb your hair backward from your forehead. Work a quarter-sized amount of pomade between your hands and use it to slick the sides of your hair back. Then, spray a grooming tonic through your hair. Using a comb and blow dryer on low heat, gradually dry your hair as you use your fingers to build up height in the front. Apply another quarter-sized dollop of pomade onto the top of your head and evenly distribute the product to each strand. Then, arrange your hair to your preferences—rough it up a bit with your fingers or comb it into a sleek look. As a twist on the classic, the pompadour mullet features long lengths on the top and back of the head, but the front pieces are rolled backward from the forehead to create a pompadour. [17] X Research source The sides are often faded to emphasize the volume of the pompadour."
    },
    {
      "title": "Achieve a slicked back mullet with hair balm or light-hold pomade.",
      "content": "Achieve a slicked back mullet with hair balm or light-hold pomade. Use a fine tooth comb to comb the front pieces of your hair over the top of your head. Massage a light-hold pomade or hair balm into your fingers and work the product over your slicked-back hair. Continue until the front pieces are stuck to the top of your head and blend in with the longer locks at the back. The slicked-back look works especially well if you have medium-length hair, since the front strands are long enough to reach the back of your head."
    },
    {
      "title": "Create a spiky mullet by shaping the spikes with a firm-hold hair gel.",
      "content": "Create a spiky mullet by shaping the spikes with a firm-hold hair gel. Rub a firm-hold hair gel or pomade onto your hands and hair. Use your hands to shape your locks upward and into your desired spiky look. This look is ideal for short and straight hair since it adds some volume at the top of the head to balance out the longer locks at the back. [18] X Research source"
    },
    {
      "title": "Use a strong-hold hair wax to shape your mullet into a faux hawk.",
      "content": "Use a strong-hold hair wax to shape your mullet into a faux hawk. Make sure that your mullet is cut with a large amount of hair on top of your head—these lengths will be necessary to achieve the faux hawk. Before styling, wash your hair and let it dry completely. Use a pea-sized amount of a strong-hold hair wax and warm it up between your palms. Use your fingers to push the lengths of your hair up and tweak it until you’re happy with the look. [19] X Research source You can completely separate the sections of your hair for a polished and spiky look, or simply pull everything up for a messy finish. The Euro mullet is a variation on the faux hawk mullet that was popularized by football star David Beckham. For a Euro mullet, follow the steps above but also ask your barber to cut your hair with a side fade. [20] X Research source A Euro mullet works particularly well on naturally textured hair, as extremely fine hair will struggle to support the weight of a faux hawk."
    },
    {
      "title": "Personalize any mullet with hair dye, accessories, or facial hair.",
      "content": "Personalize any mullet with hair dye, accessories, or facial hair. As with any hairstyle, you can style your mullet to fit your personal aesthetic. Try a bleached mullet for a bold hairstyle or dye your hair a fun color à la Ziggy Stardust or Billie Eilish’s neon green era (just don’t forget to apply a weekly mask for color-treated hair ). You can also add some excitement to your mullet by styling it with your favorite accessories. Try a bandana, headband, claw clip, or decorated hairpins . Mullets can also be combined with facial hair like beards and mustaches to create a more rustic and lumberjack-inspired look. If you do opt for a bearded mullet, grow the mullet so that the back lengths touch the nape of your neck while the rest of the hair is kept short."
    },
    {
      "title": "Grow your hair out to chin-length or longer.",
      "content": "Grow your hair out to chin-length or longer. To grow a mullet , you have to start with your hair at a decent length all the way around. Then, a barber or hairstylist can shape your hair to your desired mullet style—but this will be difficult for them to do if you haven’t taken the time to grow out your hair."
    },
    {
      "title": "Choose the type of mullet you want.",
      "content": "Choose the type of mullet you want. Consider how drastic you want the sides of your mullet to look and how long you want the back section to be. [21] X Research source For a more extreme look, choose a traditional mullet with a flowing back and closely cropped slides. For something more subtle and updated, try a modern mullet with faded sides and medium-length locks. Feel free to personalize your mullet with your favorite elements from haircuts that have looked good on you in the past. For example, you might work in shorter bangs, shaggy layers, or longer perimeters to tailor the mullet to your face."
    },
    {
      "title": "Make an appointment with a barber or hairstylist.",
      "content": "Make an appointment with a barber or hairstylist. Unless you’re skilled at cutting your own hair , you’re better off getting your mullet cut by a trained professional. Bring pictures of your preferred mullet look to ensure that your stylist knows exactly what you want your hair to look like."
    },
    {
      "title": "A mullet is a hairstyle with short locks in the front and long strands in the back.",
      "content": "A mullet is a hairstyle with short locks in the front and long strands in the back. Traditionally, the classic mullet featured an extreme contrast between the front and rear lengths—also known as the “business in the front, party in the back” style. Modern mullets, however, are less severe and more wearable for any hair type and texture. [22] X Research source Mullets are often confused with the also-popular shag haircut. Like mullets, the shag style is highly layered, with a shorter cut in the front than in the back. The mullet, however, is more disconnected between the front of the back, while the shag is styled with a more gradual cut between the varying lengths."
    },
    {
      "title": "Mullets originated in the 1970s and ‘80s but saw a comeback in 2021.",
      "content": "Mullets originated in the 1970s and ‘80s but saw a comeback in 2021. The mullet debuted in the 1970s as a men’s hairstyle and became synonymous with singers like David Bowie, Paul Young, and Billy Ray Cyrus. [23] X Research source In 2021, the mullet hairstyle started to trend again, with celebrities like Miley Cyrus, Rihanna, Maisie Williams, and Jacob Elordi all sporting the look. The 2021 version of the mullet is more subtle and also more gender-inclusive. People of all genders have adopted this trend, while the original mullet was thought of as a men’s look. The androgynous modern mullet is also often (but not always) associated with the LGBTQIA+ community, with prominent figures like Troye Sivan and Tegan & Sara wearing their hair in mullet styles. [24] X Research source"
    }
  ]
}