{
  "url": "https://www.wikihow.com/Whistle-with-Two-Fingers",
  "title": "How to Whistle with Two Fingers",
  "steps": [
    {
      "title": "Tuck your lips between your teeth.",
      "content": "Tuck your lips between your teeth. The first thing you need to do to whistle with your fingers is to use your lips to cover your teeth. When you whistle, your teeth and outer lips should not be visible. To accomplish this, tuck your upper and lower lips over your teeth and into your mouth. [1] X Research source"
    },
    {
      "title": "Form a U-shape with two of your fingers on one hand.",
      "content": "Form a U-shape with two of your fingers on one hand. You can use your thumb and middle finger, or the thumb and index finger. It doesn’t matter which two fingers you use. Use the two fingers that feel most comfortable to you. [2] X Research source Some people also find success whistling when they form a triangle with their fingers. In this example, the fingertips are touching."
    },
    {
      "title": "Use a finger from each hand if that feels more comfortable.",
      "content": "Use a finger from each hand if that feels more comfortable. Some people whistle using one finger from each hand. For example, they may whistle with their right and left index fingers, or even their right and left pinky fingers. Form a U-shape with these fingers in order to produce the whistling sound. [3] X Research source It really doesn’t matter which two fingers you use, as long as you form the right shape and do the proper technique."
    },
    {
      "title": "Put your two fingers in your mouth.",
      "content": "Put your two fingers in your mouth. Your fingers should be positioned so that they are each placed between the corner and center of your lips. Do not put them in too far, only to about the first knuckle. [4] X Research source The purpose of your two fingers is to keep your lips in place over your teeth."
    },
    {
      "title": "Angle your fingertips inward.",
      "content": "Angle your fingertips inward. Your fingers should be angled towards the center of your tongue, almost in the shape of a circle, but not touching. Do not touch the inside walls of your mouth with your fingers. [5] X Research source Make sure your fingers are still holding your lips over your teeth at this point."
    },
    {
      "title": "Move your tongue down and back in your mouth.",
      "content": "Move your tongue down and back in your mouth. Position your tongue so that it is down at the bottom of your mouth and behind your bottom teeth. There should be about 0.5 inches (1.3 cm) between your bottom teeth and the tip of your tongue. This allows the front space of your mouth to be open and allow the air to flow to produce the whistling sound. [6] X Research source The position of the tongue is a very important part of the technique."
    },
    {
      "title": "Inhale deeply to collect air in your mouth.",
      "content": "Inhale deeply to collect air in your mouth. When you inhale, you are collecting air in your mouth that will allow you to create the sound when you exhale. Try to inhale very deeply to collect as much air as possible."
    },
    {
      "title": "Exhale forcefully to produce the whistling sound.",
      "content": "Exhale forcefully to produce the whistling sound. Now it is time to blow the air out to produce the sound. When you let the air out, blow forcefully so that the air travels fast across your tongue and lower lip. While you’re exhaling, slightly pull your fingers down and out onto your lips and teeth to create more pressure going out. Try this inhaling and exhaling motion a few times until you’re able to produce the whistling sound."
    },
    {
      "title": "Adjust the position of your fingers, tongue, and jaw as you blow.",
      "content": "Adjust the position of your fingers, tongue, and jaw as you blow. At this point, you may not be able to produce the sound, or you may find that your whistle is very low. Try to slightly adjust the position of your fingers and jaw by moving them from side to side or up and down. You can also try to produce or enhance the sound by adjusting the position of your tongue forward and back. [7] X Research source"
    },
    {
      "title": "Practice until you produce a clear, high-volume whistle.",
      "content": "Practice until you produce a clear, high-volume whistle. Your first few tries may only produce a breathy, low-volume whistling tone. Repeat the previous step until you’re able to produce the desired sound. For some people, this may take a few minutes. For others, it may take a little bit longer. [8] X Research source"
    }
  ]
}