{
  "url": "https://www.wikihow.com/Stop-Being-a-Drama-Queen",
  "title": "How to Stop Being a Drama Queen",
  "steps": [
    {
      "title": "Know when you're creating drama.",
      "content": "Know when you're creating drama. One way to stop being a drama queen is to become self-aware enough to know when you're the one causing the drama. Do you find that you always end up getting in conflicts with people, and that no one in your life is easy to get along with? Do you find yourself getting heated, crying, or stomping your feet on a daily basis? If that's the case -- unless you're living in a war zone -- chances are that a lot of this drama is self-created. Knowing that you are the source of a lot of the drama is the first step to curbing it. [1] X Research source Once you see that you're the source, you'll stop blaming the people around you and will see that you're in control of the situation."
    },
    {
      "title": "Stop making a big deal out of everything.",
      "content": "Stop making a big deal out of everything. If you're a drama queen, then you must be an expert at taking a 3 or 4 situation up to a 10 on the drama Richter scale. The next time you're faced with a conflict or a minor disturbance, take a minute to ask yourself how big of a deal it is, in the scheme of things. Maybe your boyfriend is 10 minutes late for your date. Maybe you spilled a little bit of coffee on your sweater. Will this matter to you 10 hours from now -- or even one hour? Is it worth crying over? Is it worth ruining your day over? [2] X Research source These are important questions to ask yourself. Chances are, you'll see that you're making a big deal over nothing and will be able to move forward without throwing a fit. Making a big deal over every little thing will not help your mental state. It'll make you stressed out, sleepless, and generally irritable. Remember that minimizing your problems will actually make you feel better. If you make a big deal over everything, then no one will take you seriously when something that is actually devastating happens to you."
    },
    {
      "title": "Work on building your self-esteem.",
      "content": "Work on building your self-esteem. A lot of the time, drama queens are the way they are because they have a low self-esteem. They may feel like people will only pay attention to them or give them the time of day if they are constantly being dramatic, loud, or talking smack about people. Ask yourself if this sounds like you and think about your own self-image and how you really feel about yourself. When you get up and look in the mirror, what do you see? Work on loving the person you see there, and not basing your self-worth on how much attention people give you. [3] X Research source Of course, building confidence takes a lifetime. The sooner you start realizing that your worth should come from yourself, not from what people people think of you, the sooner you'll stop creating drama. Really think about yourself. Nobody's perfect -- what are your flaws? How can you work on addressing -- or accepting them? Part of feeling good about yourself is hanging out with people who make you feel good. Are there people like that in your life? If everyone around you is focused on putting you down, then you won't be able to feel good about yourself until you ditch them."
    },
    {
      "title": "Stop seeing yourself as the victim.",
      "content": "Stop seeing yourself as the victim. A lot of your drama may come from the fact that you feel like everyone has wronged you, that the world has treated you badly, and that you deserve a lot better than what you're getting. Of course, some of this may be true some of the time, but it's unlikely that everyone in your life is determined to make you feel horrible. Instead, get empowered by the fact that you are in control of your own destiny. Stop saying, \"I can't believe what they did to me…\" or \"I can't believe what happened to me…\" and start your sentences with something positive like, \"I did this cool thing today…\" [4] X Research source Don't give people so much power over you. Instead of obsessing over what they did to you, work on doing things to make your own life better. Ask yourself why you need to look for sympathy all the time. You don't really want that kind of attention all the time, do you? Sometimes, you may really need sympathy, so don't use up your sympathy points over nothing just to get attention."
    },
    {
      "title": "Live in the present.",
      "content": "Live in the present. People who are hung up on drama tend to live in the past, obsessing on the ways that people wronged them, past fights or drama, or just situations that they wish hadn't turned out the way they had. While the past can be informative, helping us repeat the same problems over and over again, if you get too hung up on the past, you won't be able to live in the moment or to move forward. If you live in the moment, you won't be so worried about what someone said to you or how you feel you were \"wronged,\" or even about getting people back. Instead, work on having fun with where you are, whether you're with friends or taking a long walk. Stop obsessing over the past and you'll soon find your way to a much healthier mindset."
    },
    {
      "title": "Write your thoughts down in a journal.",
      "content": "Write your thoughts down in a journal. Writing your thoughts down in a journal can help you really process the things that have happened to you, deal with them emotionally, and take the time to deal with your problems. It's far better to write down your problems than to talk about them before you're ready, especially when you have the impulse to talk about everything with everyone within earshot. Writing things down will help you think that hey, it's not the end of the world, and can help you take a step back from your drama. Try journaling at least once a day. If you have to talk to a friend about something that's been bothering you, for example, consider writing about the conflict first so you feel calmer about it. But remember, do not let anybody see any important things you have written in your journal. This could lead to more drama that you don't want, so be careful."
    },
    {
      "title": "Remind yourself that it's almost never the end of the world.",
      "content": "Remind yourself that it's almost never the end of the world. Drama queens tend to think that almost everything is worth getting mad and throwing a fit about, but that's almost never the case. While you may hate hearing people say, \"It's not the end of the world,\" sometimes this is something you have to tell yourself when you face difficult situations. Let's say you did poorly on one test. Ask yourself if it's really going to ruin or affect your life in the long run. The answer is almost never, never yes. Think about this the next time you feel the anger boiling up, or the tears brimming in your eyes."
    },
    {
      "title": "Don't feed into other people's drama.",
      "content": "Don't feed into other people's drama. Though you may be the only drama queen in your circle of friends, it's likely that there are other dramatic people around you, or just people who like to talk about their drama. Don't let them get to you, rile you up, or make you angry for no reason. If someone else is acting dramatic toward you, tell them to cool it, say it's not that big of a deal, and move on with it instead of letting it get to you. When it comes to other people who want to fight with you, rile you up, or just make a mountain out of a molehill, the most important thing is not to engage them. [5] X Research source Engaging in an argument is a choice. If someone wants to talk to you about something, insist that you'll only do it in a calm or reasonable manner."
    },
    {
      "title": "Get out of any unhealthy relationships you're in.",
      "content": "Get out of any unhealthy relationships you're in. Some people love drama so much that they are always finding themselves in relationships where they are always fighting, crying, or just generally being dramatic. If that's the case with you, then you need to ask yourself why you need this person in your life. You may care more about the drama and the person, who just fuels the fire. Instead, go for relationships, whether they're friendships or romantic relationships, that make you feel happy, content, and at peace -- at least, most of the time. [6] X Research source Of course, you may be attracted to people who are high drama. The next time you meet someone like this, ask if it's really worth it. This goes for friendships, too. Stop hanging out with your frenemies just so you have something to complain or be mad about. Only maintain friendships with people you actually care about."
    },
    {
      "title": "Take time to cool off when you need it.",
      "content": "Take time to cool off when you need it. Another thing you can do to avoid being a drama queen is to be able to recognize your triggers. If someone says something that makes your blood boil, know when you're starting to feel yourself get angry, and excuse yourself for a minute. This may seem unnatural to you, but it's a great way to give yourself time to assess the situation and avoid saying something you'll regret. Step out for a short walk. Get a drink of water in the other room. Say you need some time to think about what happened. Being able to take a few minutes to yourself will help you deal with a situation in a rational and calm way. Be honest with yourself. You may think you're ready to deal with a situation, but if your hands are shaking, you're tapping your feet, or you feel your temperature rising, then you may need some more time."
    },
    {
      "title": "Find something positive to do with yourself.",
      "content": "Find something positive to do with yourself. This may sound silly, but a lot of the time, people create drama just because they're bored. That's right. You're sitting at home, The Bachelor is boring this season, your siblings aren't home, and you don't have anyone to annoy or mess with. Suddenly, you start thinking about that one thing your friend said to you that morning, and get really really mad…and make a passive aggressive Facebook post about it. If this sounds like you, then you simply need to find more meaningful things to do with yourself. Soon, you won't have time for drama. Here are some options: Pick up a new hobby, like painting or writing poetry. You'll find that this is a much more useful way to release some of your energy. Volunteer. Spending time with people who are actually in need will remind you how much you have to be thankful for -- instead of complaining about everything. Even if you don't believe you're the type to stir up drama when bored, finding other ways to occupy your time can help."
    },
    {
      "title": "Stop making it all about you.",
      "content": "Stop making it all about you. People who are dramatic are notorious for making absolutely everything revolve around them. When people try to tell them about a problem, they tend to say, \"…that's almost as bad as something that happened to me ,\" or \"That's exactly how I felt when…\" While it's okay to try to relate to people, it's not okay to turn any situation into a problem having to do with you. People will quickly get bored and think you're an attention hog; they'll see that there's no point in confiding in you. Instead, work on respecting people, and recognizing that they have to deal with problems (and sometimes, drama!) too."
    },
    {
      "title": "Think before you speak.",
      "content": "Think before you speak. Another thing drama queens tend to do is react in the heat of the moment, blurting out rude and insensitive comments just because that's what comes to them. This is similar to giving yourself time to cool off. Before you say something, ask yourself if you really mean it, or if you'll regret it after five minutes. You may feel like insulting your best friend, boyfriend, or sister in the moment, but chances are, you'll feel like a fool in the long run. Instead, take the time to think about what you're going to say and ask yourself if it's really constructive or meant only to hurt people. Don't be afraid to say, \"Hang on, I need a minute to figure out how to react…\""
    },
    {
      "title": "Confide in a close friend -- instead of everybody.",
      "content": "Confide in a close friend -- instead of everybody. Drama queens love to broadcast their drama to anyone within shooting range. Not only is it rude to give TMI to the butcher, the baker, and the candlestick maker, but people will also quickly tire of your antics. If something is really bothering you, then you should talk to your best friend, your mother, or a close friend about it. This will help you get another perspective, let out all of your pent-up energy, and will keep you from telling your entire math class or soccer team all of your business. Talking to someone who actually cares about you first will help you see that you don't have to tell everyone about something the second it happened just because you absolutely have to get it off your chest. Instead, learn to be patient. Blurting things out won't help you deal with them."
    },
    {
      "title": "Get attention for something positive instead of your drama.",
      "content": "Get attention for something positive instead of your drama. A lot of drama queens are the way they are simply because they want people to look their way. Well, the next time you want to get people to look at you, why don't you get their attention for something positive instead? Kick butt at your next soccer tournament. Be a killer Desdemona in your school's production of Macbeth. Write an awesome article for your school paper. Do things that make you feel good, and people will be impressed by them naturally -- instead of just annoyed by all of your tears and complaints. Think about it: if you feel like people only pay attention to you when you're having drama, then you have to seriously work on finding a positive way to channel your energy."
    },
    {
      "title": "Be honest and open with people.",
      "content": "Be honest and open with people. This may sound like the impossible, if you're used to dealing with your problems by talking about the people who are bothering you instead of talking to them. However, you must know by now that this won't get you anywhere. The next time you have a real conflict, take the time to talk to the person you're having problems with in an open and honest manner that encourages communication. This doesn't mean you have to tell the person all of the horrible things you're thinking about them, but it does mean that you should have a constructive conversation with the person, if you want to resolve the issue. Take the time to calm down and to discuss the problem in a rational manner instead of getting caught up in the heat of the moment. Sure, it's easier to just complain about the person than to deal with it. But if you deal with the problem head on, the person will have more respect for you, and you'll improve your relationship. Take the time to hear the person out. Don't just tell the person everything you're feeling and expect them to have nothing to say."
    },
    {
      "title": "Avoid gossiping.",
      "content": "Avoid gossiping. Drama queens can't help themselves. They love gossip more than Perez Hilton does. If they hear something juicy, they just can't wait to share it with their 3,000 Facebook friends. But if you want to stop your antics, then one of the easiest things you can do is to stop gossiping about people. The less you gossip, the more people will respect you, and the less they'll gossip about you in turn. This can be a bad habit to kick, but once you do it, you'll be grateful for all of the positivity that flows into your life as a result. Instead of talking about people behind their backs, start praising people behind their backs. This will make you and everyone around you feel better."
    },
    {
      "title": "Stop raising your voice.",
      "content": "Stop raising your voice. Drama lovers love to yell, shout, or just speak louder than everyone else so everyone hears what they have to say. This is another bad habit you've got to kick. The next time you feel yourself getting louder, take three deep breaths, and try to get your tone of voice and volume to match that of the people around you. Don't think that you just don't have the ability to talk more quietly; everyone does. If you talk more quietly, people will want to be around you more. Nobody wants to be around a person who completely dominates them in conversation."
    },
    {
      "title": "Avoid name-calling or offending people in the heat of the moment.",
      "content": "Avoid name-calling or offending people in the heat of the moment. What's the point? It will feel good for like, point-five seconds, and then you'll look like an idiot. Do you want people cursing at you and calling you names? If you do, then you have a problem. Only tell people the things that are constructive to helping you resolve a conflict. And if you do end up saying something hurtful, apologize."
    },
    {
      "title": "Mind your own business.",
      "content": "Mind your own business. Your own drama should be enough to deal with, right? Don't get all worked up because of how your sister's boyfriend is acting, or about how your friend's cousin got into a fender bender. Stick with your own problems and don't put your nose where it doesn't belong. Drama queens love to feed off the drama of other people because they feel like there's not enough going on in their own lives; if you find positive things to fill your time, then this won't be you."
    },
    {
      "title": "Take the time to listen to people.",
      "content": "Take the time to listen to people. Drama queens are so focused on themselves and all of the things that happened to them that they don't ever really take the time to hear other people out. When someone is talking to you, make eye contact, really take in what they're saying, and don't interrupt. See the people who mean something to you on their own terms and stop looking for opportunities to talk about your own problems. Every person in your life has their own problems and dreams and goals, and you should treat them as your equals, not just as people who should care about you, you, you. People seek out good listeners because they are so hard to find. If you learn to truly listen to people, you'll be a much better friend -- and much better person -- in the process. Recognizing that other people have drama, too, will help you see that your drama isn't that exciting, after all."
    }
  ]
}