{
  "url": "https://www.wikihow.com/What-Causes-a-TV-to-Freeze-and-Pixelate",
  "title": "Why Is My TV Freezing and Pixelating? 12 Easy Solutions",
  "steps": [
    {
      "title": "Cables can become loose and cause the TV to lose signal.",
      "content": "Cables can become loose and cause the TV to lose signal. Turn off your TV and check all the cables going into your TV as well as into your set-top box, if you have cable. Then, check the cables and power cord going to the wall. Make sure they're all tight and secure. If any of the cables were loose, turn your TV on and see if that resolves the issue."
    },
    {
      "title": "If you get your TV over the internet, your signal might be weak.",
      "content": "If you get your TV over the internet, your signal might be weak. This can happen if your TV is far away from your WiFi router or there's another electronic device that's interfering. Try to use the WiFi on another device to see if the signal is active. [1] X Research source If you have several devices using the same internet connection, your TV might not have enough bandwidth to transmit the program you're trying to watch. Try turning off devices you're not using and see if that solves your problem."
    },
    {
      "title": "Plug your TV directly into your router to ensure the best connection.",
      "content": "Plug your TV directly into your router to ensure the best connection. With a wired connection, you don't have to worry about interference from other devices. [2] X Research source Check the back of your TV for an Ethernet port—it looks like a large phone jack. If you have one of those, use an Ethernet cable to connect your TV directly to your router. [3] X Research source When you switch from a WiFi to a wired connection, remember to also switch the preferred network in your TV's settings."
    },
    {
      "title": "If an app on your smart TV freezes, it might need to be updated.",
      "content": "If an app on your smart TV freezes, it might need to be updated. Exit out of the app, then check for updates to the app you're trying to watch. If there aren't any updates, try clearing the app's data and cache. Then, restart the system and see if that helps. To avoid this problem in the future, change your settings to automatically install updates."
    },
    {
      "title": "Unplug the HDMI cable between your TV and receiver.",
      "content": "Unplug the HDMI cable between your TV and receiver. Wait about 30 seconds, then plug it back in. Turn your TV on and see if that fixes the issue. You might need to wait a few seconds for the picture to adjust after you reset the connection. [4] X Research source It's also a good idea to inspect your HDMI cable and make sure it's not damaged. If the cable has become frayed or the casing is damaged, it might need to be replaced."
    },
    {
      "title": "This resets your hardware and often resolves most issues.",
      "content": "This resets your hardware and often resolves most issues. Unplug your cable box or modem from the wall, wait 10-15 seconds, then plug it back in. Turn on your TV and wait for the service to re-initialize. Once your programming is back, wait and watch to see if your picture has been restored. [5] X Research source Sometimes your service provider will push an update to the software in the cable box or modem that causes issues with reception. Power-cycling resets your hardware, similar to restarting your computer after you update the operating system."
    },
    {
      "title": "Unscrew the coax cables and pull them out, then put them back.",
      "content": "Unscrew the coax cables and pull them out, then put them back. Screw the washer on the end of the coax cable until it's \"finger tight.\" This simply means that you can't tighten it anymore with your fingers—there's no need to use pliers to get it any tighter. [6] X Research source Coax cables degrade over time and can become damaged. If adjusting this connection doesn't fix the problem, you might need a new cable."
    },
    {
      "title": "If you have cable connected to a splitter, connect it directly to the wall.",
      "content": "If you have cable connected to a splitter, connect it directly to the wall. You might have a splitter if you have cable going to more than one room of your house. Unscrew the coax from both sides of the splitter, then connect the coax coming from the wall directly to your cable box. [7] X Research source Keep in mind that while this might fix your picture issue, it also means that the cable going to another room will no longer work. You might need to have your cable company send a tech out to resolve the issue if it's important to have cable in both rooms at the same time. Cable splitters reduce the strength of the signal by half, so if you're getting a weak signal, the splitter might be the culprit."
    },
    {
      "title": "This at least ensures that the problem isn't with your TV.",
      "content": "This at least ensures that the problem isn't with your TV. Your TV is designed to automatically tune to the channels you have available, either through cable or over-the-air. Use the \"auto-tune\" function in your TV's settings to refresh the channels available and see if that corrects the problem. [8] X Research source You can typically access the TV settings using the remote that came with your TV. Search for your TV manufacturer online to find more detailed steps and tips on troubleshooting the issue."
    },
    {
      "title": "Tree limbs or buildings can block your dish's view of the satellite.",
      "content": "Tree limbs or buildings can block your dish's view of the satellite. If you've recently had severe weather, debris might be covering a portion of the dish. Water pooled in the dish can also affect the signal. Once you clear that away, you should have a better picture on your TV. If you think a building is obstructing your satellite, contact your provider. They'll have a tech come out and reinstall your dish so you'll get clear reception. Setting your antenna higher can prevent a spotty connection."
    },
    {
      "title": "Turn your antenna facing the nearest broadcast tower.",
      "content": "Turn your antenna facing the nearest broadcast tower. If you're not sure where the nearest broadcast tower is, search for a map on the internet. It also helps if your antenna is as high up as you can put it, such as at the top of a window. [9] X Research source You might get a stronger signal with an external antenna. However, they're more expensive than interior antennas and can be difficult to install because they might require you to go out on your roof. Check for obstructions that might be interfering with your signal as well. If there's been new construction in your area and there's a building between your antenna and the broadcast tower, you might not get the best signal anymore."
    },
    {
      "title": "A scratched or dirty disc can cause the image to pixelate.",
      "content": "A scratched or dirty disc can cause the image to pixelate. Take the disc out and inspect the surface. If it's dirty or scratched, you can clean it with a dry microfiber cloth. You can also buy a disc cleaning kit online or wherever electronics are sold. [10] X Research source The problem might also be with your player. Try other discs to see if you're having the same issues every time. If the TV freezes or pixelates with every disc, you might need a new player."
    }
  ]
}