{
  "url": "https://www.wikihow.com/Steam-Corn",
  "title": "How to Steam Corn On the Cob (With or Without a Steamer)",
  "steps": [
    {
      "title": "Choose a pot that is large enough to fit the corn, then fill the bottom with water.",
      "content": "Choose a pot that is large enough to fit the corn, then fill the bottom with water. You will need 2 inches (5.08 centimeters) of water. You can cook quite a large amount of corn using this method, especially if you stand the corn upright."
    },
    {
      "title": "Place a steamer basket in the bottom of the pot.",
      "content": "Place a steamer basket in the bottom of the pot. The water should not touch the bottom of the steamer basket. If it does, pour some water out, but try to keep it as close to 2 inches (5.08 centimeters) as possible. Keep in mind that you may have to refill the water as the corn steams."
    },
    {
      "title": "Add the corn and cover the pot with a lid.",
      "content": "Add the corn and cover the pot with a lid. If you are inserting the corn vertically, make sure that the stems are pointing downwards. If the corn is too big for the pot, cut the corn in half. [3] X Research source"
    },
    {
      "title": "Bring the water to a boil, then simmer it for 7 to 10 minutes.",
      "content": "Bring the water to a boil, then simmer it for 7 to 10 minutes. [4] X Research source Once the water is boiling, reduce the heat to low, and cook the corn for 7 to 10 minutes. If you like your corn more crisp, check it after about 4 minutes. The corn is ready when the kernels turn bright yellow. Keep an eye on the water; don't let it fall below 1 inch (2.54 centimeters). You will be more likely to scorch your pot this way."
    },
    {
      "title": "Use a pair of tongs to take the corn out of the pot, and transfer it to a serving plate.",
      "content": "Use a pair of tongs to take the corn out of the pot, and transfer it to a serving plate. Be careful when taking the lid off the pot.; the steam will be very hot."
    },
    {
      "title": "Serve the corn.",
      "content": "Serve the corn. At this point, you can garnish the corn with some salt, pepper, and butter."
    },
    {
      "title": "Prepare the corn.",
      "content": "Prepare the corn. Husk the corn first, then pull off any threads or strings. Rinse the corn in cool water, then use a knife to cut away any bad spots. If you'd like smaller portions, cut the cobs in half."
    },
    {
      "title": "Fill the bottom of a large skillet with water.",
      "content": "Fill the bottom of a large skillet with water. You will need about 1 to 2 inches (2.54 to 5.08 centimeters) of water. [5] X Research source"
    },
    {
      "title": "Bring the water to a boil.",
      "content": "Bring the water to a boil. Do not add any salt to the water, or your corn will turn out too tough. [6] X Research source"
    },
    {
      "title": "Add the husked corn to the skillet in a single layer.",
      "content": "Add the husked corn to the skillet in a single layer. If you need to, you can cut some of the ears of corn in half to get them to fit."
    },
    {
      "title": "Let the water return to a boil, then lower the heat, and cook the corn, covered, for 3 to 4 minutes.",
      "content": "Let the water return to a boil, then lower the heat, and cook the corn, covered, for 3 to 4 minutes. [7] X Research source Use a pair of tongs to turn the corn every minute or so that it cooks evenly. [8] X Research source The corn is ready when the kernels turn bright yellow."
    },
    {
      "title": "Remove the corn from the skillet using a pair of tongs.",
      "content": "Remove the corn from the skillet using a pair of tongs. Be careful when opening the lid. The steam rushing upwards will be very hot. Do not lean over the pot."
    },
    {
      "title": "Serve the corn.",
      "content": "Serve the corn. At this point, you can season the corn with some salt and/or butter."
    },
    {
      "title": "Preheat your oven to 400°F (205°C).",
      "content": "Preheat your oven to 400°F (205°C)."
    },
    {
      "title": "Get the corn ready.",
      "content": "Get the corn ready. If you have not yet done so, husk the corn and pull away any threads or strings. Rinse the corn, then chop off any bad spots. Cut the corn in half when you are done."
    },
    {
      "title": "Place the corn into a 3-quart (3 liters) glass baking dish.",
      "content": "Place the corn into a 3-quart (3 liters) glass baking dish. Do not grease the baking dish."
    },
    {
      "title": "Fill the baking dish with ½ inch (1.27 centimeters) of water.",
      "content": "Fill the baking dish with ½ inch (1.27 centimeters) of water. Do not add any salt to the water, or it will make the corn tough."
    },
    {
      "title": "Cover the dish with foil, and bake it for 30 minutes.",
      "content": "Cover the dish with foil, and bake it for 30 minutes. As the water heats up, it will steam the corn. [9] X Research source"
    },
    {
      "title": "Mix the parsley, butter, and salt in a small bowl just before the corn is done steaming.",
      "content": "Mix the parsley, butter, and salt in a small bowl just before the corn is done steaming. Cut the butter into cubes first, then melt it in the microwave or in a small saucepan over the stove. Stir in the parsley and salt, then set it aside. The parsley is optional, but it will give the corn more flavor."
    },
    {
      "title": "Take the corn out of the oven, and drain the water from it.",
      "content": "Take the corn out of the oven, and drain the water from it. You can also use a pair of tongs to transfer the corn from the baking dish to your serving platter."
    },
    {
      "title": "Pour the butter mixture over the corn just before serving it.",
      "content": "Pour the butter mixture over the corn just before serving it. Use a pair of tongs to turn the corn cobs around in the baking dish. This will help the butter coat them evenly. [10] X Research source"
    },
    {
      "title": "Get the corn ready.",
      "content": "Get the corn ready. Pull the husks off of the corn as well as any remaining threads or strings. Rinse the corn, then chop off any bad spots, if needed. If you want smaller portions, cut the cobs in half."
    },
    {
      "title": "Pour 2 tablespoons of water into a microwave-safe baking dish.",
      "content": "Pour 2 tablespoons of water into a microwave-safe baking dish. The dish needs to be big enough to fit your corn. Note that this method is only good for 2 or 3 ears of corn. If you need to make more, you'll have to do them in separate batches—or try another steaming method."
    },
    {
      "title": "Add the corn.",
      "content": "Add the corn. If you need to, cut the corn in half so that it fits. It should lay firmly against the bottom of the dish. You don't want the ends hanging over the edge of the dish."
    },
    {
      "title": "Cover the dish with some plastic wrap, and poke a vent hole using a fork.",
      "content": "Cover the dish with some plastic wrap, and poke a vent hole using a fork. This will allow the steam from the cooking water to escape."
    },
    {
      "title": "Cook the corn on high until it is done, about 4 to 6 minutes.",
      "content": "Cook the corn on high until it is done, about 4 to 6 minutes. The exact cooking time will vary, depending on the strength of your microwave. [11] X Research source The corn is done when the kernels turn bright yellow."
    },
    {
      "title": "Remove the plastic wrap from the dish.",
      "content": "Remove the plastic wrap from the dish. Once the corn is done steaming, use a pair of potholders to remove the dish from the microwave. Carefully pull the plastic wrap from the dish, then use a pair of tongs to serve the corn. Do not lean over the dish when removing the plastic wrap. The steam will be very, very hot. Consider using a pair of tongs to remove the plastic wrap. [12] X Research source"
    }
  ]
}