{
  "url": "https://www.wikihow.com/Update-Java",
  "title": "How to Update or Download Java on PC, Mac, or Linux",
  "steps": [
    {
      "title": "Open the Java Control Panel.",
      "content": "Open the Java Control Panel. Use the following steps to update Java on Windows: Click the Windows Start button. Type \"Configure Java\" Click Configure Java in the search results."
    },
    {
      "title": "Click the Update tab.",
      "content": "Click the Update tab. This is at the top of the Java control panel window."
    },
    {
      "title": "Click Update Now.",
      "content": "Click Update Now . You'll find this button in the bottom-right corner of the window. Doing so prompts Java to begin looking for an update. [1] X Research source If you receive a message that says you're already running the latest version of Java, then Java has already been updated to the latest version."
    },
    {
      "title": "Open Java Control Panel.",
      "content": "Open Java Control Panel. Here's how to open it on your Mac: Click the Apple icon in the menu bar at the top. Click System Settings . Scroll down and click Java in the left panel."
    },
    {
      "title": "Click the Update tab.",
      "content": "Click the Update tab. This is at the top of the Java control panel window."
    },
    {
      "title": "Click Update Now.",
      "content": "Click Update Now . You'll find this button in the bottom-right corner of the window. Doing so prompts Java to begin looking for an update. [2] X Research source If you receive a message that says you're already running the latest version of Java, then Java has already been updated to the latest version."
    },
    {
      "title": "Press Ctrl+Alt+T to open the Terminal.",
      "content": "Press Ctrl + Alt + T to open the Terminal. You can update Java easily using the Terminal in Linux using your package manager."
    },
    {
      "title": "Update your package repositories.",
      "content": "Update your package repositories. The way you will do this is different depending on your Linux distribution. Type one of the following commands and press Enter to update your repositories: Debian/Ubuntu/Mint: sudo apt update . Red Had/Fedora: sudo dnf update . OpenSUSE: sudo zypper patch . Arch Linux: sudo pacman -Syu ."
    },
    {
      "title": "Search available versions of Java.",
      "content": "Search available versions of Java. The latest version of Java is JDK 23. You can also install previous versions of Java. Use one of the following commands to search for available versions of Java: Debian/Ubuntu/Mint: sudo apt-cache search openjdk Red Hat/Fedora: sudo dnf search openjdk OpenSUSE: sudo zypper search openjdk-devel Arch Linux: sudo pacman -sS java"
    },
    {
      "title": "Update Java.",
      "content": "Update Java. Use one of the following commands to install OpenJava JDK. These commands will update Java on Linux to JDK 23. If you want to install a different version, you can modify the command to install the version of Java you want (i.e., \"sudo apt install openjdk-24\"). Use one of the following commands to install Java on Linux: Debian/Ubuntu/Mint: sudo apt install openjdk-23 . [3] X Research source Red Hat/Fedora: sudo dnf install java-23-openjdk-devel . [4] X Research source OpenSUSE: sudo zypper install java-23-openjdk-devel . Arch Linux: sudo pacman -S jdk23-openjdk"
    },
    {
      "title": "Click the Java Update notification when prompted to update.",
      "content": "Click the Java Update notification when prompted to update. By default, Java will check for updates automatically once a week. If an update is available, you will be notified that an update is ready to be installed. Click the notification when it appears. You can check your notifications by clicking the date and time on both Windows and Mac. On Windows, it's in the taskbar in the lower-right corner. On a Mac, it's in the menu bar in the upper-right corner."
    },
    {
      "title": "Click Yes and then Update.",
      "content": "Click Yes and then Update . If you are using Windows, a control access pop-up window will appear asking if you want to allow Java to make changes to your computer. Click Yes to continue. Then, click Update to update Java now. If you don't want to install the Java update when the notification appears, you can click Later instead. You will be prompted to install the Java update at a later time."
    },
    {
      "title": "Open the Java Control Panel.",
      "content": "Open the Java Control Panel. If you want Java to update automatically on your Windows PC or Mac, you can set it up to do so on your preferred schedule. Use one of the following steps to open the Java Control Panel: Windows: Click the Windows Start button and type Configure Java . Click Configure Java . Mac: Click the Apple icon at the top and then click System Settings . Click the Java icon."
    },
    {
      "title": "Click the Update tab.",
      "content": "Click the Update tab. It's the second tab at the top of the page. This displays the Update options."
    },
    {
      "title": "Select when you want to be notified of an update.",
      "content": "Select when you want to be notified of an update. Java will notify you before updating automatically. Use the drop-down menu next to \"Notify Me\" to select if you want to be notified before downloading the update or before installing the update."
    },
    {
      "title": "Ensure \"Check for Updates Automatically\" is checked.",
      "content": "Ensure \"Check for Updates Automatically\" is checked. It's the checkbox below the \"Notify Me\" drop-down menu. This option is usually checked by default."
    },
    {
      "title": "Click Advanced….",
      "content": "Click Advanced… . It's the button next to the checkbox. This displays advanced update options."
    },
    {
      "title": "Select how often you want to check for updates.",
      "content": "Select how often you want to check for updates. Click one of the radio options to the left to select how often you want to check for updates. The options are \"Daily,\" \"Weekly,\" or \"Monthly.\" If you select \"Monthly,\" Java will check for updates weekly and then notify you within 30 days. If an update is considered critical, you will be notified within the week."
    },
    {
      "title": "Select a day to check for updates.",
      "content": "Select a day to check for updates. Use the drop-down menu next to \"Every\" to select a day to check for updates. You can select any day of the week."
    },
    {
      "title": "Select a time to check updates.",
      "content": "Select a time to check updates. Use the drop-down menu next to \"At\" to select the exact hour Java will check for updates."
    },
    {
      "title": "Go to https://www.java.com/en/download/manual.jsp in a web browser.",
      "content": "Go to https://www.java.com/en/download/manual.jsp in a web browser. To install the latest version of Java, you can download it from the official website."
    },
    {
      "title": "Click the download link for your operating system.",
      "content": "Click the download link for your operating system. Java is available for Windows, Mac, and Linux. Scroll down and click the link for your operating system. If you have an internet connection, click Windows Online for the fastest installation method. If you want to install Java on a computer that doesn't have an internet connection, you'll need to click Windows Offline or Windows Offline (64-bit) to download the executable file to install Java on an offline computer. [5] X Research source If you have a 32-bit and a 64-bit web browser, you will need to download and install both the 32-bit and 64-bit versions of Java. You need administrative privileges to install Java on a Mac."
    },
    {
      "title": "Open the installation file.",
      "content": "Open the installation file. By default, your downloaded files are usually found in your \"Downloads\" folder. Double-click the installation file once it is finished downloading. On Windows, it will be an \".exe\" file. On Mac, it will be a \".dmg\" file."
    },
    {
      "title": "Follow the prompts to complete the installation.",
      "content": "Follow the prompts to complete the installation. The install wizard will display a page informing you that this version of Java is for personal use only. Java requires a separate license for commercial purposes. If you agree to the terms, click Install . This will install the latest version of Java. If you don't agree to the terms, click Remove ."
    },
    {
      "title": "Click Close.",
      "content": "Click Close . Once Java is finished installing, click Close to close the install wizard."
    }
  ]
}