{
  "url": "https://www.wikihow.com/Stretch-a-Wool-Sweater",
  "title": "How to Stretch Wool Sweaters (And Prevent Shrinking Them Again)",
  "steps": [
    {
      "title": "Fill your sink with warm water and stir in 2 tbsp (30 mL) of conditioner.",
      "content": "Fill your sink with warm water and stir in 2 tbsp (30 mL) of conditioner. Measure the hair conditioner into the sink and then gently stir the water with your hand until it’s completely dispersed. The conditioner helps to soften the wool fibers in your sweater, making it easier to stretch. [1] X Research source If you don't have any hair conditioner, use fabric softener or baby shampoo instead. Gorgis also recommends using “Tide Free & Gentle detergent because it is delicate on clothes.” This method can be used for other woolen garments such as shirts, coats, and pants. These steps are appropriate for all types of wool."
    },
    {
      "title": "Soak your wool sweater in the sink for 20-30 minutes.",
      "content": "Soak your wool sweater in the sink for 20-30 minutes. Make sure that the entire sweater is submerged in the water to soak. This allows time for the water and conditioner to thoroughly saturate and soften the fibers in your garment. If your sweater is particularly large or heavy, leave it to soak for up to 2 hours. [2] X Research source"
    },
    {
      "title": "Squeeze out the excess liquid.",
      "content": "Squeeze out the excess liquid. When time is up, lift the sweater out of the sink. Allow the bulk of the water to drip off the fabric, then gently squeeze out the rest of the drips. Avoid wringing the sweater, as this can damage the fibers. [3] X Research source Don't rinse your sweater, as this will remove the conditioner from the fibers and make it more difficult to stretch."
    },
    {
      "title": "Lay the sweater flat on a towel.",
      "content": "Lay the sweater flat on a towel. Drape a towel across a hard surface and place the damp sweater on it. Ensure that the sweater lies flat so that it doesn’t become wrinkled. Adjust the sleeves as needed so that they fit on the towel. [4] X Research source If possible, use a white towel, as this removes the risk of any dye from the towel staining your sweater. Use an absorbent towel rather than a light cotton towel for the best results."
    },
    {
      "title": "Place another towel on top of the sweater and gently press down on it.",
      "content": "Place another towel on top of the sweater and gently press down on it. Cover your wool sweater with another (preferably white and absorbent) towel. Press down on the towel and sweater gently, starting from the shoulders and working your way down. [5] X Research source Remove the top towel from the sweater once you have pressed the entire garment."
    },
    {
      "title": "Stretch the sweater back to its original shape.",
      "content": "Stretch the sweater back to its original shape. Gently pull the shoulders of the jersey apart to stretch them back to their original width, and tug on the sleeves to make them longer. Pull the body material widthways and lengthways to stretch out the fibers, and continue to adjust the sweater until it reaches your desired shape and size. [6] X Research source Hold the jersey up to your body to ensure you're stretching it in the right places. If you’re worried about distorting the sweater or stretching it too much, lay a sweater that fits on top of it. Stretch your wool sweater no larger than the sweater that fits. Gorgis warns, “Be cautious not to pull too hard, as it may damage the fabric.”"
    },
    {
      "title": "Dry the sweater flat on a towel for 24 hours.",
      "content": "Dry the sweater flat on a towel for 24 hours. Gorgis instructs, “Do not use a dryer” to dry your wool sweater. Dryers use heat to dry clothes, which could cause your sweater to shrink again. Instead, place the sweater on a clean, dry towel in a dust-free area to air dry. If the sweater is still damp after 24 hours, flip it over, place it on another dry towel, and wait a further 24 hours for it to dry completely. If the sweater is still too small, repeat the softening and stretching process to make it larger."
    },
    {
      "title": "Roll the wool sweater up in a towel.",
      "content": "Roll the wool sweater up in a towel. After squeezing out the excess water after a soak, place your damp sweater flat on a dry towel. Ensure that both arms of the sweater are lying on the towel and that the sweater is free of wrinkles. Roll the towel and sweater up tightly to absorb as much of the moisture from the sweater as possible. [7] X Research source For best results, use a fluffy, absorbent towel. White towels work best, as the dye from colored towels may stain your sweater."
    },
    {
      "title": "Stretch and pin your sweater to a corkboard.",
      "content": "Stretch and pin your sweater to a corkboard. Hold your sweater in front of your body and gently stretch it to the width of your shoulders. Keep the sweater in this stretched position and pin it onto a corkboard. Pull the bottom hem downward to lengthen the body of the sweater, then pin it in place. Stretch the arms out to the appropriate length and pin them as well. [8] X Research source Use steel pins to prevent rusting. Use extra pins to make any other necessary adjustments to the size of the sweater. If you don’t have a corkboard, use weights (like hand weights, paperweights, or books) to pin the stretched sweater to a flat surface."
    },
    {
      "title": "Check your sweater in an hour and restretch it, if necessary.",
      "content": "Check your sweater in an hour and restretch it, if necessary. Check on your sweater after an hour, as the wool may shrink a little as it dries. If the sweater isn’t back to its original size yet, simply stretch it out a little wider and longer, and then pin it in place again. Continue to stretch and pin the sweater until it is the correct size. [9] X Research source If stretching and repinning doesn’t work, you may need to soak the sweater in the water and conditioner mixture and repeat the entire stretching process. If you stretch your sweater too much, it’s possible to shrink it again by washing it with hot water and tossing it in the dryer. Be aware that it may shrink too much."
    },
    {
      "title": "No, not all sweaters can be stretched.",
      "content": "No, not all sweaters can be stretched. In general, sweaters made from wool can be stretched to a certain extent, especially when wet. Wool typically stretches more than silk, linen, or cotton. Blended and synthetic fibers usually don’t stretch, especially if they’ve shrunk. To check a sweater made from natural fibers (like wool, cashmere, or mohair), look for felting to see if the fibers can still stretch apart or if they’ve matted together to form felt. [10] X Research source If there’s some stretch, you can usually return your sweater to its original shape and size."
    },
    {
      "title": "Read the clothing care label.",
      "content": "Read the clothing care label. Your wool sweater (or any other garment) should have a care label that explains how to wash, dry, and care for it. Follow these instructions exactly to keep your wool in the best shape. [11] X Research source"
    },
    {
      "title": "Wash your wool in cold water.",
      "content": "Wash your wool in cold water. Whether you hand wash your wool or toss it in the washing machine, always use cold water because, as Ali explains, “Heat is the number one reason” that clothes shrink. Use a mild detergent or a soap specifically made for washing woolens. If you choose to machine wash, consider putting your wool items in a delicates bag to keep them in the best shape possible. [12] X Research source Some wool garments may be dry clean only. Even if you can hand or machine wash them, dry cleaning is a great way to prevent shrinkage. Spot cleaning your wool can also keep it in better shape, as you won’t be completely submerging it in water."
    },
    {
      "title": "Allow the wool to air dry.",
      "content": "Allow the wool to air dry. Because heat causes shrinkage, avoid putting your wool items in the dryer. Instead, place your freshly washed garment flat on a clean, dry towel. Keep it away from sunlight and direct heat, and allow it to air dry completely. [13] X Research source"
    }
  ]
}