{
  "url": "https://www.wikihow.com/Succeed-in-College",
  "title": "How to Be Successful in College",
  "steps": [
    {
      "title": "Avoid procrastinating.",
      "content": "Avoid procrastinating. College academics in the first term will be particularly difficult because it is material that you have never seen before. Plus, you are facing much higher expectations, especially that you are the one responsible for your motivation and success. Unlike high school, college expects you to build your education from the bottom up, rather than regurgitating whatever facts a teacher feeds you. This means much more work than you are used to. [1] X Research source Give yourself incentives to study in advance. Don't cash your paycheck until you're finished with that term paper. Celebrate with friends after you've taken the test. Treat yourself to something you've been wanting after you finish your studying goals. Choose your priorities. It is not possible to fit in all the same social, academic, employment, and logistical responsibilities in college that you did in high school. Be realistic about how much time is required to meet your academic obligations and how much you can devote to social activities."
    },
    {
      "title": "Get passionate about something.",
      "content": "Get passionate about something. Take a moment to reflect on what you enjoy doing and studying, and what you're genuinely interested in. What are your goals? What are your plans? College is another step on the ladder to the rest of your life. What do you want to do after college, and how will college prepare you for that next step? [2] X Research source"
    },
    {
      "title": "Work on your general education.",
      "content": "Work on your general education. Most colleges require a broad range of classes in the beginning, often referred to as \"general education\" or \"distribution\" requirements. Even if you've already declared your major and know what you want to study, the distribution requirements build critical skills such as written and oral communication, critical thinking and problem solving skills. Keep your mind open and look for ways to apply these skills within your major. Another reason to take advantage of this broad range of classes in college is that you're likely to change careers over your lifetime, and even a class or two can make an impact in know-how and understanding. Anecdotally, you are likely to be in a different field at the end of your career than the one in which you started. [3] X Research source"
    },
    {
      "title": "Learn to separate gossip from genuine information.",
      "content": "Learn to separate gossip from genuine information. Learn to use observations and evidence to form your own opinions. Attend special events and seminars on campus. Join clubs for students in your major or program. Read a reliable news site every day. You are your own person, and you owe it to yourself to form your own opinions about things."
    },
    {
      "title": "Talk to your professors.",
      "content": "Talk to your professors. A big mistake college students make is never forming a relationship with their professors. Forming a relationship with professors can help make your education richer and your network bigger. [4] X Research source Go to office hours with the intent of improving your mastery of the course material, and not just to \"show your face\" in an attempt to suck up, change a grade, or appear more dedicated. Office hours are your opportunity for extra help with ideas and methodologies with which you are having trouble. Arrive prepared with specific questions. Bring your class notes and your textbook. Ask specific questions about the concepts where you need help. Professors will not repeat an entire lecture that you missed. Professors want to help you, but always remember that you are responsible for your motivation and success. Look for a mentor. A mentor can be a professor or staff member who can dispense advice specific to your goals. Start with the professors in the department of your major. There is usually a program advisor who can help you choose classes make recommendations for graduate school. However, do not expect a mentor to secure a job for you after you have graduated."
    },
    {
      "title": "Form good study habits.",
      "content": "Form good study habits. Everyone studies in a different way. Having a television or music in the background is a bad idea. Some people like to study alone. Some people like studying in groups. Find out what habits work best for you. [5] X Research source Ask yourself and answer these questions: How much time does it take an idea to stick for you? Do you need weeks before the light bulb goes off, or days? What kind of a learner are you? Keep in mind that while you may have a preferred way of learning things, this does not excuse you from engaging with other teaching and learning styles. [6] X Research source Are you: An auditory learner? Do you learn by hearing something? You would rather have an idea explained aloud than reading in. A visual learner? Do you learn by seeing something? You would rather learn by looking at graphs, reading, or watching a demonstration. A kinesthetic learner? Do you learn by touching something? You would rather build whatever you're reading about, and see it in action. What time of the day do you work best? Do you bust out a lot of work in the morning, or are you a night owl?"
    },
    {
      "title": "Set an academic goal for yourself.",
      "content": "Set an academic goal for yourself. If you don't set any academic goal, you might leave college wondering whether you tried enough. Your academic goal doesn't have to be the same as someone else's goal. Try to be realistic about it when you set it; balance it out with other personal goals you may have. Getting through college isn't always about getting a 4.0 or graduating summa cum laude . It's about doing the best you're capable of, given your resources."
    },
    {
      "title": "Establish as many friendships as possible.",
      "content": "Establish as many friendships as possible. If you're at a bigger school, you may find the sheer number of new people a bit intimidating. That's okay. Everyone feels that way at first. Get past the intimidation of the numbers and you'll find dozens, if not hundreds, of people that you get with and learn from. Many people look back on their college years with good memories, often because of the friendships that they made. [7] X Research source"
    },
    {
      "title": "Get involved in clubs, traditions, and events.",
      "content": "Get involved in clubs, traditions, and events. College events are lot different from the compulsory events you might have done in high school. Because no one is forced to participate, the people who are there enjoy being there on their own. It's no secret the real draw of clubs and events is the social aspect. You'll probably meet a lot of people with similar interests, a few people you don't get along with, and a few people with absolutely amazing backgrounds. C'est la vie : it's a cross-section of life. Take the time to do clubs and events outside your immediate social circle. It's fine to invite your best friends to participate in your club's activities. But what if bringing your friends along means that you wouldn't have met another potential friend? Try to meet as many interesting people as possible during your time in college. Don't make friendship an exclusive right shared only by you and your inner circle. Reader Poll: We asked 131 wikiHow readers, and 54% agreed that the most appealing activity or group to make friends in is a club or sports team related to your interests and passions. [Take Poll]"
    },
    {
      "title": "Go to parties.",
      "content": "Go to parties. Be yourself and get in the mood for meeting new people. However, be smart and be cautious. Go with friends and use the buddy system. Be your friend's keeper. Keep an eye on your friend and see if s/he's drinking too much, and ask your friend to keep an eye on you also. Never leave your friend alone, impaired, or in an unsafe or unfamiliar environment. Be a gracious party-goer. Don't litter bottles around someone's room, make a mess in someone's kitchen, or use someone's bed without their permission. Bring cups or soda, or if you're old enough, beer or wine. It's never bad being the person that the host takes a liking to because they're generous and well-mannered. Be careful about drugs. Know which drugs are likely to harm you and which drugs are milder. (Alcohol and marijuana in moderation aren't likely to put you in the emergency room, but cocaine, meth, hallucinogens, and painkillers can all be potentially fatal, especially if you mix them with each other or with alcohol.) Some students find that college is a time to experiment with drugs, but follow your conscience. Don't do anything you're not comfortable doing. In addition, remember that you never know for sure what's in a particular drug."
    },
    {
      "title": "Engage in safe sex, if you choose to be active.",
      "content": "Engage in safe sex, if you choose to be active. Many college-bound freshmen are still alarmingly ignorant about sex. In college, people like to brag about sex. The truth is that college students have sex at a much lower rate than their braggadocio might suggest. One study found that a majority of participants had 1 or fewer sexual partner over the course of a year. Another survey found that 59% of students reported having no sexual partners in the last 30 days. Always use protection Whether you're a guy or a girl, always keep a condom on you if you're sexually active. If used correctly, a condom is 98% effective in preventing pregnancy. Don't agree on sex unless you or your partner uses protection. Contracting HIV, herpes, or another STI is as easy as having unprotected sex one time. And unlike your excitement, which will fade with time, an STI like herpes won't go away. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Understand that alcohol severely impairs your judgment and decision-making skills. Even a small amount of alcohol will decrease your inhibitions, meaning that you'll find it easier to justify having sex with someone you might not have if you were sober. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Understand this before you start drinking. Get straight on the myths about sex. Let's debunk some of the myths about sex: \"The birth control pill protects me from STIs.\" Myth. Birth control will not protect you from STIs like HIV/AIDS. [10] X Research source \"I can't get pregnant if I'm on my period.\" Myth. You can absolutely get pregnant when you're on your period. \"I can't get pregnant if I'm a virgin and it's my first time having sex.\" Myth. Unfortunately, this is false. You still have a 5% chance of getting pregnant. \"The birth control pill is effective the first day you start taking it.\" Myth. It can take up to a month for the birth control pill to become effective."
    },
    {
      "title": "Never eat alone.",
      "content": "Never eat alone. (Actually, if you feel like it, eating alone doesn't have to be a bad thing.) Taken from the name of a book by Keith Ferrazzi, the idea is that networking, or making connections that might jumpstart your career at a later date, can be made easy and doesn't have to be a bad thing. Make the most of your opportunities while you're in college. Turn time in the mess hall into a rewarding lesson in personal development."
    },
    {
      "title": "Eat healthy,",
      "content": "Eat healthy, exercise, and get enough rest. All three seem to be on the shortlist for things college students do least. If you want to succeed in college, however, and learn how to balance work, play, and a thousand different things in between, you'll need to start getting serious about your health. The optimal diet for a college student is the same as it is for everyone else: eat lean meat or protein, fruits and vegetables, whole grains, and stay away from sodas, candy, simple carbohydrates, and saturated fats. [11] X Research source Not only will you feel better, but you'll also be in better shape to avoid the infamous freshman 15. Exercise is a miracle drug, except that it's not really a drug. Exercise helps us burn fat, build muscle, lower cholesterol, ease stress, and sleep better. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Join an intramural sports team, do laps in the gym pool, or simply take the stairs instead of the elevator. If you do nothing else, try to get in 30 minutes of walking a day. Get enough sleep. One of the best ways to maximize academic performance on tests is getting a good night's sleep. [13] X Research source In fact, students who pull all nighters, students with sleep disorders, and students who routinely stay up late on weeknights all perform worse in college than students who get regular, comfortable, lasting sleep. [14] X Research source"
    },
    {
      "title": "Visit the university health center.",
      "content": "Visit the university health center. The university health center will have all sorts of information about staying healthy on campus, in addition to housing the university's best doctors. Take advantage of the free amenities your health center offers: free vaccines, condoms, and counseling are among the most common."
    },
    {
      "title": "Use the safety department, if your college has one.",
      "content": "Use the safety department, if your college has one. Many colleges and universities will have a public safety department that looks after the safety of the university population. Public safety officers will routinely: Escort you to your home or dorm if you feel unsafe. Give you valuable safety tips about living in your area (especially applicable in an urban setting). Investigate crimes that happen on campus. If you've been a victim of a crime, especially robbery, rape, coercion, or assault, please notify the campus security and/or local police."
    },
    {
      "title": "Budget out your expenses.",
      "content": "Budget out your expenses. College is a time when kids start behaving like grown-ups. Part of being a grown-up is having a budget. To make a budget, take an inventory of the money you'll have during any given month. Look at your past expenses, and budget out how much you'll allow yourself to spend during that month. The expenses should not exceed the amount of money you have. A sample budget might look like this: Total amount of income per month: $1300. Housing : $600 Food : $250 Books and school supplies : $100 Gas : $200 Discretionary spending : $150"
    },
    {
      "title": "Apply for financial aid.",
      "content": "Apply for financial aid. Apply for federal student aid, or FAFSA [15] X Research source before going to college, and check back routinely for new financial aid opportunities. Check with your college's student aid department to find out if you apply for any financial aid or merit-based scholarships. There's a lot of financial aid floating around out there if you know how to find it."
    },
    {
      "title": "Look for work-study opportunities.",
      "content": "Look for work-study opportunities. Your college or university needs employees to function, and it probably knows that giving its students a chance to work is a winning bet. Check with your school about work-study opportunities. Much of the time, you'll get paid to do a mindless, nominal task like man the library entrance. This should also give you opportunities to study while you earn a paycheck. Other times, the college or university will pay you to perform research with a teacher or department. This is where having a mentor (see above) becomes important. Letters of reference are necessary to convince the department that you are a qualified candidate for the research position. Such positions are extremely competitive, require an excellent academic background and strong letters of reference, and require a great deal of work."
    },
    {
      "title": "Save money, wherever possible.",
      "content": "Save money, wherever possible. If you're getting a scholarship or financial aid, or your parents are helping you out with expenses, try as much as possible to save money while you're still in college. After you leave college and become the arbiter of your own life, you'll have to start paying bills. Those bills will be a lot easier to pay if you stored away a little nest egg while you were still in college. Other reasons to save money in college: Study abroad costs money. Lots of it. If you want to study in Florence, Italy or Shanghai, China, or virtually anywhere else, it's going to cost you a pretty penny. There are scholarships and aid, but you can't always count on them. Student loans take time to pay off. If you're like most college students, you'll have a lot of loans to pay off once you leave college. Getting them (and the interest payments) paid off can play a huge part in what your budget looks like after you graduate."
    }
  ]
}