{
  "url": "https://www.wikihow.com/Wrap-a-Toga",
  "title": "How to Wrap a Toga",
  "steps": [
    {
      "title": "Fold the long side of a bed sheet in half.",
      "content": "Fold the long side of a bed sheet in half. Find a full, queen or king-sized flat sheet and fold it in half. If you want a longer toga, fold the sheet only a quarter. [1] X Research source"
    },
    {
      "title": "Drape one end over your shoulder.",
      "content": "Drape one end over your shoulder. With the long side of the sheet behind your back, drape one corner over one of your shoulders. Adjust the draped end until it reaches down to your waist. [2] X Research source"
    },
    {
      "title": "Pull the fabric from your backside around to your front.",
      "content": "Pull the fabric from your backside around to your front. While you hold the draped end with one hand, grab the sheet from behind your back with your other hand. Gather the fabric once it’s pulled to your front-side. [3] X Research source"
    },
    {
      "title": "Wrap the long part of the sheet around your body.",
      "content": "Wrap the long part of the sheet around your body. Holding the gathered, long fabric from your backside, wrap it around your body several times. Wrap the sheet all the way around your back, under one arm and across your chest. [4] X Research source"
    },
    {
      "title": "Toss the end over your shoulder.",
      "content": "Toss the end over your shoulder. After you wrap the long end of the sheet around your body several times, toss the final end over the shoulder you started with."
    },
    {
      "title": "Adjust your toga if you need to.",
      "content": "Adjust your toga if you need to. Fold, pin or bunch the material until it hits your legs where you want. It may take a few passes until you feel it lays right. Make sure you spend some time smoothing the layers and folds. [5] X Research source"
    },
    {
      "title": "Secure the final end on top of your shoulder.",
      "content": "Secure the final end on top of your shoulder. Use a safety pin or a decorative brooch to hold the tossed, final piece. You can also tie the ends together."
    },
    {
      "title": "Fold the long side of a bed sheet in half.",
      "content": "Fold the long side of a bed sheet in half. Find a full, queen or king-sized flat sheet and fold it in half. If you want a longer toga, fold the sheet only a quarter."
    },
    {
      "title": "Hold the sheet in front of you to drape one end over your shoulder.",
      "content": "Hold the sheet in front of you to drape one end over your shoulder. Take one end of your sheet and drape a few feet of it, front to back, over one of your shoulders. The draped end should reach down your back to your butt. [6] X Research source"
    },
    {
      "title": "Wrap the sheet around your body.",
      "content": "Wrap the sheet around your body. Holding the long end of the sheet, wrap it diagonally across your chest and under one arm. Continue wrapping across your back, under your other arm and around your chest."
    },
    {
      "title": "Tuck the wrapped end under the draped end.",
      "content": "Tuck the wrapped end under the draped end. Tuck the piece you’ve been wrapping (the long end) under the piece you draped over your shoulder."
    },
    {
      "title": "Adjust and secure the sheet.",
      "content": "Adjust and secure the sheet. Adjust the height of your toga by folding, pinning or bunching the material until it hits your legs where you want it. It may take a few passes until you feel it lays right. Spend some time smoothing the layers and folds and pin them if you need to."
    },
    {
      "title": "Fold a flat sheet",
      "content": "Fold a flat sheet in half. Fold a sheet with the short ends together, until it is the proper length for your height. It should cover from your armpits to your legs. Decide on how much leg you want to show or cover. [7] X Research source"
    },
    {
      "title": "Wrap the sheet around your chest.",
      "content": "Wrap the sheet around your chest. Holding the folded sheet horizontally behind you, pull both sides underneath your arms and around to your chest. Wrap under your arms to your backside and to your front-side."
    },
    {
      "title": "Tuck one end into the top.",
      "content": "Tuck one end into the top. After you bring the wrapped sheet around to your chest, tuck one end into the top of the sheet, like a towel. Make sure the sheet holds snugly around your chest."
    },
    {
      "title": "Adjust and secure the wrap.",
      "content": "Adjust and secure the wrap. Spend some time smoothing the layers and folds. Use safety pins to hold your wrapped toga in place."
    },
    {
      "title": "Add a belt to your toga.",
      "content": "Add a belt to your toga. Tie a belt or rope just under the bust to help secure the wrap and make a flattering empire waist."
    },
    {
      "title": "Fold a sheet in half.",
      "content": "Fold a sheet in half. While standing, hold a sheet horizontally in front of you. Fold the sheet in half, until it is the proper length. It should cover from your armpits to your legs. Decide on how much leg you want to show or cover. [8] X Research source"
    },
    {
      "title": "Wrap the sheet around your chest.",
      "content": "Wrap the sheet around your chest. Holding the folded sheet horizontally in front of you, first wrap one side around your chest and then the other side, much like a towel. Leave 3 to 4 feet (0.9 to 1.2 m) of one corner loose at the front of your body."
    },
    {
      "title": "Make halter straps.",
      "content": "Make halter straps. Twist the 4 foot (1.2 m) length a few times to make a rope. Run this twisted sheet over your shoulder and behind your neck. Tie the end of the twist to the sheet running across your chest."
    },
    {
      "title": "Adjust and secure your toga.",
      "content": "Adjust and secure your toga. Spend some time smoothing the layers and folds, then pin the toga onto your tube top. Take extra time to pin the halter securely."
    },
    {
      "title": "Add accessories to your toga.",
      "content": "Add accessories to your toga. Although optional, this adds interest. For example, tie a belt or rope just under the bust or at the natural waist. Pin a brooch on your chest just under one of the halter straps. [9] X Research source"
    },
    {
      "title": "Fold a sheet in half.",
      "content": "Fold a sheet in half. While standing, hold the sheet horizontally in front of you. Fold the ends together, until the sheet is the proper length for your height. It should cover from your waist to your feet."
    },
    {
      "title": "Wrap one end around your waist.",
      "content": "Wrap one end around your waist. Holding the folded sheet horizontally behind you at your waist, wrap a few feet of one end around your front-side to make a skirt and tuck the top of the skirt-end into the sheet, like a towel. Keep the rest behind your back."
    },
    {
      "title": "Wrap the second end around to your frontside.",
      "content": "Wrap the second end around to your frontside. While still holding the sheet at your waist wrap the longer end around to the front. When you cross the front, pin the top of the skirt together at your waist."
    },
    {
      "title": "Continue wrapping up and around your body.",
      "content": "Continue wrapping up and around your body. Continue this longer end all the way around your body, across the front of your waist, under your arm, and across your the back. Then back to the front again, under your arm."
    },
    {
      "title": "Toss the end over one shoulder.",
      "content": "Toss the end over one shoulder. Once the longer end is at the front again, cross over your chest and over the opposite shoulder. The end will drape over your shoulder and rest on your back. If you have a rope, use it to wrap around the small of your back to secure the loose end hanging in the back."
    }
  ]
}