{
  "url": "https://www.wikihow.com/Tell-if-Your-Eggs-Are-Fresh",
  "title": "How to Tell if Your Eggs Are Fresh",
  "steps": [
    {
      "title": "Fill up a large glass or bowl with room temperature water.",
      "content": "Fill up a large glass or bowl with room temperature water. The bowl or glass should be large enough so that it can hold the entire egg. Fill the container up 3/4 of the way, or enough so that the entire egg will be submerged once you put it in the container. [1] X Research source If you don’t have a bowl or glass big enough, you can use a bucket or any container that’s large enough to hold the egg."
    },
    {
      "title": "Place the egg in the water.",
      "content": "Place the egg in the water. Carefully lower the egg in the water so that it doesn’t crack if it hits the bottom of the container. If you're testing more than one egg, test each egg individually so that you can determine which ones are good and which ones are rotten. [2] X Research source"
    },
    {
      "title": "Eat the egg if it sinks to the bottom of the bowl.",
      "content": "Eat the egg if it sinks to the bottom of the bowl. If the egg sinks to the bottom, then it’s still fresh and can be used for whatever cooking purposes that you had in mind. If the egg sinks but stands upright on the bottom of the container, the egg is still fresh but should be eaten or hard-boiled as soon as possible because it is near its expiration."
    },
    {
      "title": "Throw the egg away if it floats.",
      "content": "Throw the egg away if it floats. If the egg floats, it means that air is trapped inside of the egg and it is rotten. Eating rotten eggs can lead to food poisoning and should be avoided. [3] X Research source You can compost the egg or dump the inside of the egg in the garbage disposal. Do not put egg shells down the garbage disposal."
    },
    {
      "title": "Read the sell-by date on the carton.",
      "content": "Read the sell-by date on the carton. Eggs can usually last up to 3 weeks if stored in the refrigerator. The sell by date on the carton is usually a good indication of whether the eggs are still fresh. [4] X Research source All raw eggs should be maintained in a temperature of 40 °F (4 °C) or less. The sell-by date won’t tell you whether your eggs are rotten, but will give you an idea of how old your eggs are."
    },
    {
      "title": "Crack the egg open and examine it.",
      "content": "Crack the egg open and examine it. If you crack the egg open and a white ooze comes out, there’s a good chance that it is rotten. Fresh eggs will have milky or clear whites and a perky bright yellow or orange yolk. If the egg is rotten, the whites will be thin and watery or may look pink and the yolk will flatten out. [5] X Research source The appearance of small red or brown spots, known as blood spots, does not mean the egg is rotten. This is normal and actually means that the egg is most likely very fresh."
    },
    {
      "title": "Smell the egg for a neutral scent.",
      "content": "Smell the egg for a neutral scent. Uncooked fresh eggs should have a neutral scent and should not smell sulfuric or sour. If the egg smells bad before or after you crack it, there’s a very high likelihood that it is rotten. [6] X Research source Typically rotten eggs will smell bad even before you crack them."
    },
    {
      "title": "Hold the egg next to your ear and shake it.",
      "content": "Hold the egg next to your ear and shake it. If you hear the inside of the egg sloshing around, it means the egg is rotten. If you can’t hear or feel the contents of the egg move, it means it’s fresh and you can eat it. [7] X Research source This is a less accurate method than examining or smelling the egg. If you’re unsure, try the other methods as well. For other ideas, see what other wikiHow readers have tried. Check out the wikiHow forum post, \"How do you tell if eggs are bad?\""
    }
  ]
}