{
  "url": "https://www.wikihow.com/Store-Dates",
  "title": "How to Store Dates",
  "steps": [
    {
      "title": "Place your dates in an airtight container.",
      "content": "Place your dates in an airtight container. Glass or plastic tupperware works well. Pack the dates as tightly as you want to in the container. [1] X Research source Alternatively, place the dates in a resealable plastic bag. Squeeze out the air and seal the bag."
    },
    {
      "title": "Store semi-dry dates at room temperature.",
      "content": "Store semi-dry dates at room temperature. Place the dates in the pantry, or on your kitchen counter. Make sure they are out of direct sunlight if you place them on the counter. Store them away from the stove and oven as well. [2] X Research source Deglet Noor and Zahidi dates are considered semi-dry dates."
    },
    {
      "title": "Place soft dates in the fridge.",
      "content": "Place soft dates in the fridge. Unlike semi-dry dates, soft dates are not cured before they are picked. To keep their flavor and freshness, store them in the fridge. [3] X Research source Medjool, Khadrawy, Halawy, and Barhi are examples of soft dates."
    },
    {
      "title": "Eat the dates within a week for the best flavor.",
      "content": "Eat the dates within a week for the best flavor. The dates will not go bad after a week. They actually have a very long shelf life, up to 1 month, if stored at room temperature in an airtight container. However, the intensity of their flavor decreases the longer they sit on the shelf. As the dates continue to dry, white spots may form on or beneath the skin. These are sugar crystals. You can dissolve the sugar crystals with low heat. If you notice a rotten smell, discoloration, or a loss of flavor, then the dates have expired."
    },
    {
      "title": "Store the dates in the fridge for a year.",
      "content": "Store the dates in the fridge for a year. Place your dates in the fridge. You can store dates in the fridge for up to a year if you need to. The fridge will keep your dates tasting fresh for whenever you feel like eating some. Semi-dry dates may last longer in the fridge than soft dates."
    },
    {
      "title": "Place the dates in a freezer bag.",
      "content": "Place the dates in a freezer bag. Squeeze the air out of the bag before sealing it. Alternatively, use an airtight container like plastic or glass tupperware. When you are packing the dates in the container, leave 1 centimetre (0.39 in) of headspace to allow for expansion once they freeze."
    },
    {
      "title": "Place the bag in the deepest part of the freezer.",
      "content": "Place the bag in the deepest part of the freezer. This way, the dates will freeze faster, locking in their freshness and flavor. Storing dates in the freezer is a great way to go if you plan to use them at a much later date, or if you are unsure when you will be using them. [4] X Research source"
    },
    {
      "title": "Take the dates out of the freezer 3 hours before using them.",
      "content": "Take the dates out of the freezer 3 hours before using them. This way, the dates will have enough time to thaw before you eat them or use them in a recipe. The dates should taste exactly as they did the day you bought them. If you need to use them right away, soak the dates in a bowl of hot water. They should be soft and ready to use within 30 minutes."
    },
    {
      "title": "Store the dates in the freezer for up to 3 years or more.",
      "content": "Store the dates in the freezer for up to 3 years or more. Dried fruits, like dates, can last in the freezer for many years if they are sealed properly. Make sure to store your dates in an airtight container to avoid freezer burn. [5] X Research source If after taking your dates out of the freezer, you notice discoloration, loss of flavor, or a rotten smell, then they have expired."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}