{
  "url": "https://www.wikihow.com/Treat-Jaundice",
  "title": "How to Treat Jaundice",
  "steps": [
    {
      "title": "See your doctor.",
      "content": "See your doctor. If you or your child develop any signs or symptoms of jaundice, see you doctor as soon as possible. You may not need treatment for the jaundice, but if there is an underlying condition causing it, this will require medical attention. [4] X Expert Source Raj Vuppalanchi, MD Academic Hepatologist Expert Interview. 28 October 2020. Some symptoms of short-term jaundice in adults are: Fever Chills Abdominal pain Other flu-like symptoms A change in your skin color and whites of eyes to a more yellow pallor. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Seek treatment for a child or infant with jaundice.",
      "content": "Seek treatment for a child or infant with jaundice. Children and infants can also develop jaundice. Jaundice is common in infants and it often goes away on its own within two weeks. [6] X Research source However, severe jaundice can cause serious complications for some infants. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To check for jaundice, look for a yellowish skin tone and a yellowish tone to the whites of your infant or child's eyes. If your child or infant develops jaundice, then call your doctor right away."
    },
    {
      "title": "Receive a definitive diagnosis.",
      "content": "Receive a definitive diagnosis. In adults, jaundice is often caused by underlying conditions that require treatment. Your doctor man run tests to confirm a diagnosis of these conditions causing your jaundice and then formulate a treatment plan from there. You may need to have to have blood work, an ultrasound, CT scan, or even a liver biopsy to find the cause of your jaundice. Common conditions that can cause jaundice include: Hepatitis A Chronic Hepatitis B and C Epstein-Barr viral infection, or infectious mononucleosis Excessive alcohol consumption Autoimmune or genetic disorders Gallstones Gallbladder inflammation Gallbladder cancer Pancreatitis Certain medications such as acetaminophen, penicillin, oral contraceptives and steroids may also cause jaundice. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Your doctor can diagnose jaundice by looking for signs of liver disease including bruising, spider angiomas, palmar erythema, and urinalysis that indicates the presence of bilirubin. Your doctor may also use imaging or liver biopsy to confirm a diagnosis. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Treat underlying conditions.",
      "content": "Treat underlying conditions. If your doctor discovers an underlying condition that are causing your jaundice, she will likely treat that to see if it clears up other related health issues. Treating causes and complications of underlying conditions may help relieve your jaundice. [11] X Expert Source Raj Vuppalanchi, MD Academic Hepatologist Expert Interview. 28 October 2020."
    },
    {
      "title": "Allow jaundice to clear on its own.",
      "content": "Allow jaundice to clear on its own. In most cases, jaundice will go away without treatment. Speak with your doctor to make sure that foregoing treatment is the best option for you, especially if you have underlying conditions causing jaundice. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take medication for itching.",
      "content": "Take medication for itching. [13] X Expert Source Raj Vuppalanchi, MD Academic Hepatologist Expert Interview. 28 October 2020. Some people with jaundice experience itching. If the itching becomes bothersome or affects your daily life, take a medication such as cholestyramine to relieve your symptoms. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Cholestyramine works by controlling cholesterol in the liver. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Side effects of this medication include abdominal discomfort, indigestion, nausea, flatulence, and constipation. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Get treatment for your infant.",
      "content": "Get treatment for your infant. Infant jaundice is very common and, like adult jaundice, often doesn’t require any treatment. [17] X Trustworthy Source March of Dimes Nonprofit organization devoted to improving the lives of mothers and babies. Go to source However, if your doctor diagnoses jaundice in your baby, she could call for one of the following treatments to help relieve the condition: Phototherapy, which uses light to help your baby excrete excess bilirubin Intravenous immunoglobulin, which can reduce antibodies in your baby that cause jaundice Exchange transfusion, which is a type of blood transfusion that removes small amounts of blood and dilutes bilirubin. Exchange transfusions are used only in severe cases of infant jaundice. [18] X Research source"
    },
    {
      "title": "Avoid hepatitis infections.",
      "content": "Avoid hepatitis infections. Contracting the hepatitis virus is one of the main causes of jaundice in adults. Avoiding contact with the virus as much as you possibly can may minimize your risk for contracting not only hepatitis, but also jaundice. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can prevent Hepatitis A with a vaccine. Anyone can get this vaccine. [20] X Research source Hepatitis A is spread when a person eats tiny amounts of fecal matter, most often in tainted foods. [21] X Expert Source Raj Vuppalanchi, MD Academic Hepatologist Expert Interview. 28 October 2020. Be careful when traveling for food that hasn’t been properly cooked or cleaned. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also prevent Hepatitis B with a vaccine. Any person from newborns to adults can receive this vaccine. [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There is no vaccine for hepatitis C. [24] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Hepatitis B and C are spread through the blood and bodily fluid of an infected individual, but not through casual contact. [25] X Research source Avoid reusing any type of needles—from tattoos to recreational drugs—to help prevent the spread of these viruses. [26] X Expert Source Raj Vuppalanchi, MD Academic Hepatologist Expert Interview. 28 October 2020."
    },
    {
      "title": "Stay within recommended alcohol consumption limits.",
      "content": "Stay within recommended alcohol consumption limits. Since your liver processes alcohol and is the source for jaundice, limit your alcohol consumption to daily recommended values. Not only can this help alleviate the symptoms of jaundice, but may also keep you from contracting alcohol-related liver diseases such as cirrhosis. [27] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The recommended daily limit for women is 2-3 units of alcohol. For men, the recommended daily limit is 3-4 units. As a reference point, one bottle of wine has 9-10 units of alcohol."
    },
    {
      "title": "Maintain a healthy weight.",
      "content": "Maintain a healthy weight. Keeping your weight at a within a stable and healthy range can promote your overall healthy. But this can also keep your liver healthy, and in turn prevent jaundice. [28] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Maintaining your is easy if you eat healthy, balanced, and regular meals. Food choices that are nutrient rich and contain moderate fat and complex carbohydrates, are best to promote your general health. Keep your daily calorie intake around 1,800-2,200, depending on how active you are. You should get your calories from nutrient-dense whole foods such as whole grains, fruits and vegetables, dairy, and lean proteins. Exercise is important to maintaining your weight and promoting your overall health. Participate in low-impact, moderate intensity cardiovascular activities every day. [29] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Aim to exercise for least 30 minutes of exercise most days of the week. [30] X Research source"
    },
    {
      "title": "Manage your cholesterol.",
      "content": "Manage your cholesterol. Keeping your cholesterol in check can not only help prevent jaundice, but also help maintain your overall health. You can manage your cholesterol through healthy diet and exercise or, in other cases, with prescription medication. [31] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Eating more soluble fiber, healthy fats, and foods high in omega-3 fatty acids can help manage your cholesterol. Foods such as lean cuts of meat, low-fat dairy, olive oil, salmon, almonds, oats, lentils, and vegetables contains these three nutrients. [32] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Reduce or eliminate trans fats from your diet. Trans fats increase your bad, or LDL, cholesterol. Limiting or stopping your intake of foods such as fried foods and commercial products including baked goods, cookies, and crackers may help control your cholesterol. [33] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Thirty minutes of exercise a day can help increase the levels of good, or HDL, cholesterol, in your body. [34] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There is some evidence that quitting smoking will increase your HDL cholesterol levels. [35] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Ensure your infant is getting adequate feedings.",
      "content": "Ensure your infant is getting adequate feedings. Making sure that your baby is getting enough to eat throughout the day. This is the best prevention or jaundice in infants. [36] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "If you breastfeed, your baby should get 8-12 feedings per day in the first week of life.",
      "content": "If you breastfeed, your baby should get 8-12 feedings per day in the first week of life. [37] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you are feeding your infant formula, she should get 1-2 ounces (30 to 60 milliliters) of formula every two to three hours during her first week of life. [38] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}