{
  "url": "https://www.wikihow.com/Survive-Work-with-No-Sleep",
  "title": "How to Survive Work with No Sleep",
  "steps": [
    {
      "title": "Resist the urge to hit the snooze button.",
      "content": "Resist the urge to hit the snooze button. Even if you're used to hitting the snooze button a few times before you finally get up, if you're going on little to no sleep, that snooze button will do you more harm than good. Those brief moments of light sleeping will only make you feel more tired, and you also run the risk of sleeping through your alarm. [1] X Research source Instead of hitting the snooze, set your alarm for the latest possible moment you can wake up. That way you'll get as much uninterrupted sleep as possible, even if it's only a few hours. Reader Poll: We asked 1394 wikiHow readers what they found most helpful for establishing a morning routine, and 55% of them said Setting an alarm. [Take Poll] Hitting snooze only makes it harder to get up because you aren't sticking to your routine."
    },
    {
      "title": "Eat a light, protein-rich breakfast.",
      "content": "Eat a light, protein-rich breakfast. A heavy breakfast will only make you more sleepy. Sweet, calorie-rich foods may give you a sugar spike but will cause a crash later. Instead, have a light breakfast of whole grains and protein, with a little fresh fruit. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, you might have a piece of whole-wheat toast smeared with avocado and an apple or an orange. Yogurt is also a good breakfast option. If you've had little to no sleep, you'll likely be craving sugary foods and simple carbs, so it may take a little self-discipline to force yourself to eat right. A small cup of coffee or tea with breakfast is fine, but try to avoid overloading on caffeine after a night with no sleep. It'll just leave you jittery and you'll end up more tired than before."
    },
    {
      "title": "",
      "content": "Go for a walk outside if possible. Sunlight can help restore your energy and give you a boost of vitamin D. If you have the time and the weather is hospitable, try a brisk walk around the block for 10 or 15 minutes after breakfast.<refhttps://www.sleepfoundation.org/sleep-deprivation/how-to-function-after-sleepless-nights</ref> You'll get more of a boost if there's a bit of a chill in the air. On the other hand, if it's hot and humid outside, you may want to skip the walk. Sit outside in the sun and scroll through your social media while you drink water instead.}}"
    },
    {
      "title": "Take a cold shower in the morning.",
      "content": "Take a cold shower in the morning. A cold shower improves your circulation and boosts your energy. This can be a big help if you're trying to get ready for work after a night of little to no sleep. [3] X Research source If you can't handle a completely cold shower, turn the water to cold for about 30 seconds before you get out for a brief, cold blast."
    },
    {
      "title": "Choose basic, comfortable clothes for work.",
      "content": "Choose basic, comfortable clothes for work. If you're already exhausted, the last thing you want to do is wear something uncomfortable to work. The annoyance will become unbearable after a few hours. [4] X Research source If you have to wear a uniform, make sure what you're wearing fits well and is clean and neat. You can at least make sure that your undergarments and shoes are as comfortable as possible."
    },
    {
      "title": "Warn your coworkers that you didn't get much sleep.",
      "content": "Warn your coworkers that you didn't get much sleep. It's typically a good idea to let those around you know that you're coming off of an all-nighter — especially people who work closely with you or depend on you. You don't have to go into personal details if you don't want to, but at least let them know that you're not at 100%. [5] X Research source If there's anything in particular that you want them to do to help you out, let them know. For example, if you have a secretary or assistant, you may ask them to hold all of your calls. If you have any pressing deadlines, you might ask your supervisor for an extension until you can get some rest."
    },
    {
      "title": "Work on the most difficult tasks first.",
      "content": "Work on the most difficult tasks first. If you didn't sleep much the night before, you'll typically have the most energy in the morning. Any energy you might have will substantially decrease over the course of the day. Take advantage of that energy to get anything important or challenging out of the way. If you get the important things done, your boss may take pity on you and let you leave a little earlier. But even if you have to remain at work the full day, you at least don't have to worry about struggling with difficult tasks after lunch."
    },
    {
      "title": "Reschedule or skip any meetings you're able to.",
      "content": "Reschedule or skip any meetings you're able to. Being sleep-deprived damages your communication skills and may make it more difficult for you to pick up on nonverbal cues. In a group situation, this means you're likely to say or do something you'll later come to regret. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Not getting enough sleep also gives you a short fuse, so you may become irritated at things you would ordinarily let slide. If you aren't able to reschedule or skip a meeting, it's usually a good idea to let everyone know that you got little to no sleep the night before. While it might not excuse your actions, it puts them on notice that you're not yourself."
    },
    {
      "title": "Avoid high-stakes projects or decisions if possible.",
      "content": "Avoid high-stakes projects or decisions if possible. Sometimes high-stake decisions are urgent and unavoidable. However, it's generally best not to make those kinds of decisions or take on those projects when you're sleep-deprived. [7] X Research source In some fields this may be impossible. For example, if you're a first responder or work in the medical field, you may have to make life-or-death decisions on a regular basis. If you have that kind of job, it's probably best to call out if possible, rather than risk someone's life or health by making a bad decision while exhausted from lack of sleep. If you are faced with a relatively high-stakes work issue, do what you can to take your time and work through the options objectively and logically. See if you can get other coworkers to pitch in and help you out."
    },
    {
      "title": "Leave routine busywork until the end of the day.",
      "content": "Leave routine busywork until the end of the day. You'll likely have the least energy at the end of your workday. If you're only doing routine work that doesn't require a lot of brainpower, you can afford to zone out a little. If this isn't possible, take the time you need to make sure your work is done properly. If you can, have a coworker look over what you've done before you submit it. For example, if you work in accounting or bookkeeping, you might have a coworker double-check your numbers before you submit them."
    },
    {
      "title": "Drink caffeine in small doses throughout the day.",
      "content": "Drink caffeine in small doses throughout the day. Focus on small amounts of caffeine at a time so you don't get too jittery. You might have a small cup of coffee or tea once every 3 hours or so to keep your caffeine supply even. [8] X Expert Source Alex Dimitriu, MD Sleep Specialist Expert Interview. 16 October 2019. Sugary energy drinks may cause you to crash later, so they're best avoided if you're trying to get through the day after having no sleep. Try splashing cold water in your face if you need a quick energy boost. You can also go for a quick walk, even if it's just around the office."
    },
    {
      "title": "Snack on protein-rich foods to keep your energy level up.",
      "content": "Snack on protein-rich foods to keep your energy level up. String cheese and nuts, such as almonds, are high in protein and will give your body the energy it needs to power through the day. Many companies make protein snack mixes, so you might consider getting some of those to help you through a sleep-deprived day. [9] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Constant grazing in small amounts also gives your body something to do, so you're staying mildly active, even if you're just sitting at your desk. If you can't have snacks at work, try to sneak in a small snack on breaks."
    },
    {
      "title": "Eat a light lunch with lots of veggies and lean protein.",
      "content": "Eat a light lunch with lots of veggies and lean protein. A heavy lunch will likely lead to an afternoon \"food coma,\" especially if you're already working with sleep deprivation. Have a light, colorful lunch with lean protein such as chicken or fish. [10] X Research source A salad with avocado and almonds is a good way to get some protein in your lunch without eating meat. Avoid pasta, heavy sauces, and red meat, as these types of food will only leave you more sleepy."
    },
    {
      "title": "Get some sunshine if possible.",
      "content": "Get some sunshine if possible. If it's a bright sunny day outside, try to take a short walk at lunchtime to give yourself an energy boost. You might also take your lunch outside to eat it, instead of eating in the break room or at your desk. [11] X Expert Source Alex Dimitriu, MD Sleep Specialist Expert Interview. 16 October 2019. If the weather isn't suitable for a walk outside, do what you can to get out of your workplace, even if it's only for a few minutes. A change of scenery will do you good."
    },
    {
      "title": "Take a power nap if you can.",
      "content": "Take a power nap if you can. A brief 20- to 30-minute nap in the afternoon can give your mind and body the energy it needs to make it through the rest of the day. Just make sure you don't sleep for any longer than that. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you are able to take a nap, you may want to get a coworker to come wake you up so you can make sure you don't sleep longer than you should. Caffeine needs 20 to 30 minutes to take effect, so if you drink a small cup of coffee, then take a nap for 20 minutes, you can compound the benefits. [13] X Expert Source Alex Dimitriu, MD Sleep Specialist Expert Interview. 16 October 2019."
    },
    {
      "title": "Drink lots of water.",
      "content": "Drink lots of water. Staying well-hydrated is always important, but it's even more vital if you haven't gotten enough sleep. If you're dehydrated, you'll feel even more tired and rundown than you already do when you have sleep deprivation. [14] X Research source Try to drink at least one glass of water every hour while you're at work. Avoid sugary sports drinks, which may only make you more sleepy."
    }
  ]
}