{
  "url": "https://www.wikihow.com/Stop-Twitter-Notifications",
  "title": "4 Simple Ways to Stop Twitter Notifications on All Platforms",
  "steps": [
    {
      "title": "Open the X app.",
      "content": "Open the X app. This looks like an x with a black background. If you aren't already logged in, enter your email address, username, or phone number and password to do so now. Once you mute notifications in the X app, you can also disable notifications on your iPhone/iPad or Android ."
    },
    {
      "title": "Tap the bell icon.",
      "content": "Tap the bell icon. This is at the bottom toolbar. The Notifications tab will open."
    },
    {
      "title": "Tap the cog icon.",
      "content": "Tap the cog icon. This is in the top-right corner."
    },
    {
      "title": "Tap Preferences.",
      "content": "Tap Preferences . This is the second option."
    },
    {
      "title": "Turn off push notifications.",
      "content": "Turn off push notifications. Tap Push notifications and toggle off every switch so it's grey. You can also tap Mentions and replies , Reweets , and Likes to toggle those off as well. Tap the back arrow to return to the previous page."
    },
    {
      "title": "Turn off SMS notifications.",
      "content": "Turn off SMS notifications. Tap SMS notifications and toggle off every switch so it's grey. Tap the back arrow to return to the previous page. If you don't have a phone number linked to your account, skip this step."
    },
    {
      "title": "Turn off email notifications.",
      "content": "Turn off email notifications. Tap Email notifications and toggle off every switch so it's grey."
    },
    {
      "title": "Mute notifications from people you don't follow (optional).",
      "content": "Mute notifications from people you don't follow (optional). Return to the Notifications page and tap Filters . Then, tap Muted Notifications . Toggle off every switch so it's grey. Tap Done ."
    },
    {
      "title": "Open X.",
      "content": "Open X. Go to https://twitter.com/ in your computer's web browser. If you're logged into X, this will open your X feed. If you aren't logged into X, you'll need to enter your email address (or X name, or phone number) and password in the upper-right side of the page and then click Log in ."
    },
    {
      "title": "Click the Notifications tab.",
      "content": "Click the Notifications tab. It's on the left side of the page next to a bell icon. Doing so opens a list of your recent X notifications."
    },
    {
      "title": "Click the Settings icon.",
      "content": "Click the Settings icon. It looks like a gear in the upper right corner of the \"Notifications\" panel. Clicking this icon will take you to the Notifications section of the Settings menu."
    },
    {
      "title": "Mute notifications from people you don't follow.",
      "content": "Mute notifications from people you don't follow. Click Filters , then Muted Notifications . Finally, check every box on this page to mute everything. This won't affect people who you follow, but it will prevent you from receiving annoying notifications from or about other people."
    },
    {
      "title": "Return to the Notification Settings panel and click Preferences.",
      "content": "Return to the Notification Settings panel and click Preferences . To do this, click the back navigation arrow that's next to \"Muted notifications\" twice. You'll then be able to select Preferences ."
    },
    {
      "title": "Click Email notifications.",
      "content": "Click Email notifications . You'll find this on the right side of the page."
    },
    {
      "title": "Click the switch next to \"Email notifications\" to toggle it off .",
      "content": "Click the switch next to \"Email notifications\" to toggle it off . Doing so prevents X from sending notifications to your email address. You will still receive security alerts and other urgent emails from X, but other users' activity won't get pushed to your email address anymore."
    },
    {
      "title": "Click the back arrow and select Push notifications.",
      "content": "Click the back arrow and select Push notifications . The arrow is at the top of the page next to \"Email notifications,\" and clicking it once will bring you back to the notification types. The push notifications act as alerts on your computer, so turning this off will disable those alerts."
    },
    {
      "title": "Click the switch next to \"Push notifications\" to toggle it off .",
      "content": "Click the switch next to \"Push notifications\" to toggle it off . Doing so prevents X from sending you notifications when you're using a browser. All the notifications you get from X will be muted or turned off after you've done this."
    },
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings. Tap the Settings app icon, which resembles a grey gear, on the Home Screen. [1] X Research source"
    },
    {
      "title": "Tap Notifications.",
      "content": "Tap Notifications . This option is near the top of the Settings page. [2] X Research source"
    },
    {
      "title": "Scroll down and tap X.",
      "content": "Scroll down and tap X . Since apps here are listed in alphabetical order, it'll be towards the bottom of the list."
    },
    {
      "title": "Tap the green \"Allow Notifications\" switch.",
      "content": "Tap the green \"Allow Notifications\" switch. It's at the top of the page. The switch will turn white, signifying that you will no longer receive any notifications from X. [3] X Research source You also won't see a red icon with a number next to it on the X app icon when you have unopened Twitter notifications."
    },
    {
      "title": "Open your Android's Settings.",
      "content": "Open your Android's Settings. Tap the Settings app icon, which resembles a gear, in the App Drawer. [4] X Research source You can also open Settings by swiping down from the top of the screen and tapping the gear icon near the top of the resulting drop-down menu."
    },
    {
      "title": "Scroll down and tap Apps & notifications.",
      "content": "Scroll down and tap Apps & notifications . It's near the middle of the page."
    },
    {
      "title": "Scroll down and tap X.",
      "content": "Scroll down and tap X . You'll find this towards the bottom of the list."
    },
    {
      "title": "Tap Notifications.",
      "content": "Tap Notifications . It's toward the bottom of the screen."
    },
    {
      "title": "Tap the switch next to \"All X notifications\".",
      "content": "Tap the switch next to \"All X notifications\". You will no longer receive notifications or prompts from X. [5] X Research source"
    }
  ]
}