{
  "url": "https://www.wikihow.com/Stop-Overeating",
  "title": "How to Stop Overeating",
  "steps": [
    {
      "title": "Use smaller sized plates when eating at home.",
      "content": "Use smaller sized plates when eating at home. If you start using smaller plates when you’re eating at home, you may be able to control your portions and prevent yourself from overeating. Usually salad plates or appetizer plates are smaller than typical dinner sized plates and can prevent you from eating large portions of foods. Some studies have even show that using certain color plates can help your be satisfied with less foods. Go for blue colored plates to help you eat less at each meal. [1] X Research source"
    },
    {
      "title": "Remove serving bowls from the table when eating.",
      "content": "Remove serving bowls from the table when eating. Place the food on your plate and walk away from the serving bowls. When bowls and serving platters are on the table, individuals are likely to eat more than if they pre-serve themselves and then sit down. Keeping them off the dinner table will help you resist the temptation to scoop additional helpings onto your plate. Keep all food in the kitchen instead of bringing the extras to the table with you. Another good option is to put the food away prior to sitting down at the table. Even when you go back to the kitchen to put dishes away, there is no food to nibble on while you clean up."
    },
    {
      "title": "Purchase a food scale or measuring cups.",
      "content": "Purchase a food scale or measuring cups. To make sure you’re sticking to the exact portion size recommended for you, it may be helpful to measure your food before serving it or eating it. Each person requires slightly different portion sizes of each food and quantity of servings throughout the day. In general, stick to the following portion sizes for the food groups: 3 – 4 oz of protein [2] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source , ½ cup or 1 oz of grains [3] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source , 1 cup of vegetables or 2 cups of leafy greens [4] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source and ½ cup of fruit or 1 small piece [5] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source . Adults typically need to eat protein at each meal or snack. Include 1 – 2 servings of fruit each day and 3 – 4 servings of vegetables. Grains should be included one or twice a day, but not necessarily at each meal. Food scales may be preferable to use as you don’t have to squish all your food into a measuring cup. You may also want to consider measuring plates, bowls, serving utensils and reusable containers to see how much they hold. If you’re packing meals, you’ll know in advance how much you’re eating."
    },
    {
      "title": "Order a small portion at restaurants.",
      "content": "Order a small portion at restaurants. When you’re out to eat it can be difficult to eat small portions or stick with a single item. Restaurants offer the temptation of appetizers, larger entrees and dessert courses. Not only do you have to deal with larger portion sizes, you may be tempted with multiple courses. [6] X Research source Consider ordering an appetizer for your entrée. These are generally smaller, but big enough to satisfy you for dinner. Be mindful of the complimentary bread, chips or crackers that are served. These are easy to overeat when you’re hungry and waiting for your meal to arrive. Consider asking your server to skip these or only bring a small serving. Speak to the server about the portion size before you order. If it is a large meal that could feed two people, ask them to bring half of the meal to you and put the other half in a to-go container."
    },
    {
      "title": "Steer clear of fad diets.",
      "content": "Steer clear of fad diets. Many commercialized diets and weight loss programs promise rapid weight loss in a short period of time. These diets may leave you hungry, feeling deprived and can lead to overeating or binge eating behavior. [7] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source In general, losing weight too quickly is not safe. The recommended amount of weight to safely lose is 1 – 2 pounds per week. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source These diets usually restrict entire food groups, limit meals or strictly limit calories. This may set you up for overeating in the long-term. Stick to well-balanced and nutritious diets if you’re trying to lose weight. These can help you feel less hungry and more satisfied while losing weight at the same time."
    },
    {
      "title": "Don’t skip meals.",
      "content": "Don’t skip meals. Whether you’re trying to lose weight or just have a hectic and busy schedule, skipping meals can leave you overly hungry and more at risk for overeating. [9] X Research source It’s typically recommended to to eat at least three meals daily. You may also need one or two snacks, depending on your schedule. [10] X Research source You may also prefer to eat four to six small meals instead of the more traditional three meals a day."
    },
    {
      "title": "Eat only when you are hungry.",
      "content": "Eat only when you are hungry. If you are eating out of habit and not because of hunger, you could be overeating and giving your body much more than it actually needs. Learn to identify what true physical hunger means to you. Many people eat for a large variety of other reasons, so it’ll be helpful for you to figure out what hunger is. Typical sensations of physical hunger include: hunger pangs, an empty pit feeling, slight nausea or lightheadedness, irritability or an empty feeling. If you’re not feeling these things, you may be eating for another reason (like boredom or stress). Try to avoid eating or snacking and wait until you experience true hunger to eat."
    },
    {
      "title": "Stop eating when you feel satisfied.",
      "content": "Stop eating when you feel satisfied. In addition to eating only when you’re truly hungry, your body provides another tool to help you stop overeating. This is called satisfaction or satiation. When you’re satisfied or feel sated, that’s your body’s way of telling your brain you’ve had enough food for now — it’s enough to power your body for the next few hours. There’s a range of satisfaction ranging from sated to overly full or sick. If you overeat, you most likely eat until you’re full or overly full. Instead, aim to stop eating when you’re only satisfied. This is when you’re no longer hungry, you have a sensation of food in your stomach, but feel no stretching or discomfort in your stomach. [11] X Research source Most people just instinctively eat what is in front of them, regardless of whether or not they are still hungry. Listen to your body’s cues to know when a better time to stop eating comes."
    },
    {
      "title": "Take 20 – 30 minutes to eat your meal.",
      "content": "Take 20 – 30 minutes to eat your meal. If you eat too fast you are much more likely to overeat compared to if you ate a meal more slowly. [12] X Research source It takes close to 20 minutes for the stomach to send the signal to the brain that it is satisfied. This is why eating slowly can help prevent overeating. Set a timer or keep track of the time while you eat. This can help you pace yourself throughout your meal. Try putting your fork down or taking a sip of water in between each bite to help you extend the length of your meal. Decrease distractions while you eat as well. Pay attention to what is going on around you and if you find that you are distracted by bright colours or lights, loud noises, music or lots of people, you will have to pay closer attention to your eating habits to prevent yourself from overeating."
    },
    {
      "title": "Fill half of your plate with healthy vegetables.",
      "content": "Fill half of your plate with healthy vegetables. To help cut down on excess calories if you do slip up and overeat is to try to make half of your plate a fruit or a vegetable. Fruits and vegetables are low calorie foods that don’t do much harm if you overeat them. If you find you are still hungry after eating and you must have seconds, skip the other foods and have only more veggies."
    },
    {
      "title": "Drink adequate water.",
      "content": "Drink adequate water. Water is essential for the proper functioning of your body each day. However, it’s also a great tool to help you decrease how much you eat. Aim for eight to 13 glasses of water or other hydrating clear liquids each day. This can help you tame your hunger and keep you hydrated throughout the day. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In addition to just drinking enough water throughout the day, try to drink one to two glasses right before a meal or snack. This can help you fill up your stomach with a no calorie liquid and make you feel physically full."
    },
    {
      "title": "Refrain from using food as a reward.",
      "content": "Refrain from using food as a reward. Many times, people make the mistake of rewarding themselves with an indulgent treat for sticking to a healthy eating plan for a designated amount of time. Using foods as a reward for eating healthy is counterproductive to the task at hand. Instead, allow yourself to indulge in special treats every so often for no reason at all. This will help you keep healthy eating in perspective and recognize indulgences as just that. If you do want to reward yourself for meeting a goal or for a special occasion find other activities or items that are rewarding to you. For example, you could: buy a new shirt or new outfit, treat yourself to a spa day or a special round of golf or even a new electronic toy you’ve been eyeing."
    },
    {
      "title": "See an emotional eating therapist.",
      "content": "See an emotional eating therapist. Sometimes overeating is due to emotional eating. Overeating can be an eating disorder, and it is crucial that you seek medical help if you think you have a condition that goes beyond little splurges now and then. Working with a mental health specialist that focuses in this area can help you overcome this disorder. [14] X Research source Ask your primary care doctor or research online for a local therapist that specializes in eating disorders or emotional eating. They will be greatly equipped to help you deal with emotional eating or overeating issues. Talk to them about what you think is your biggest or toughest problem to deal with, when you notice it and how you’ve attempted to deal with it in the past. Remember, even if you’re seeing a specialist, it may take some time and practice before you can eat normal sized portions on a regular basis."
    },
    {
      "title": "Journal",
      "content": "Journal . Starting a journal can be a great tool to help you decrease any issues you have with emotional eating or overeating. [15] X Research source Start journaling daily or just a few days a week. Write down your thoughts or just a few ideas either in an online journal or using a notebook and pen. You can write about what you eat, how much you eat or why you think you overate. Many times it takes a few days or weeks to find patterns in your eating patterns. It might also be a good idea to jot down a few notes on how you’re feeling or how hungry you are right before eating. This act of sitting down with your journal may force you to focus and be present with your meal. List your trigger foods in your journal. By understanding what your triggers are, you can avoid those situations that might cause temptations and make it difficult for you to stay on track. For example, if going to the movies automatically prompts you to reach for a pack of candy and a large soft drink, skip the theatre and rent a movie instead."
    },
    {
      "title": "Distract yourself.",
      "content": "Distract yourself. If a food craving hits or you're upset and craving food, try to distract yourself before your indulge in your favorite food. Many times food cravings or the desire to eat is very spontaneous and fleeting. If you just give yourself a few minutes the craving may go away or become much easier to handle. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Aim to start with 10 minutes. Go outside for a quick walk, go read a book or do a household chore for a few minutes. Then revisit your cravings. Come up with a list of ideas of other activities you can do instead of eat. This will help you feel and be more prepared when an emotional food craving hits you."
    },
    {
      "title": "Plan for slip-ups.",
      "content": "Plan for slip-ups. No matter what goal you have or what changes you’re trying to make in your life, know that everyone slips up and makes mistake. Don’t let a slip up (or two) make you feel depressed and upset with yourself. Making mistakes is normal and a part of a great learning process. If you’ve slipped up, don’t give up. Use the next meal or snack time to get back on track. Don’t let yourself get into the mindset that your whole day is ruined or you should give up just due to one mistake. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try journaling about your slip ups or talk to your therapist if you have one."
    }
  ]
}