{
  "url": "https://www.wikihow.com/Use-a-Visa-Giftcard-on-Amazon",
  "title": "2 Simple Ways to Use a Visa Gift Card on Amazon",
  "steps": [
    {
      "title": "Activate your Visa gift card.",
      "content": "Activate your Visa gift card. Most Visa gift cards are activated at the point of purchase. However, in some cases, you may need to activate your Visa gift card before using. To do so, call the toll-free number listed on the card. Be ready to enter the 16-digit number and expiration date on the gift card."
    },
    {
      "title": "Go to https://www.amazon.com/ in a web browser.",
      "content": "Go to https://www.amazon.com/ in a web browser. You can use any web browser on your PC or Mac. This will take you to Amazon's main web page. If you are not logged into Amazon, click Sign In in the upper-right corner and log in with the username and password associated with your Amazon account."
    },
    {
      "title": "Click Account & Lists.",
      "content": "Click Account & Lists . It's in the upper-right corner next to the shopping cart icon. Clicking this takes you to your account page."
    },
    {
      "title": "Click Your Payments.",
      "content": "Click Your Payments . It's on the right-hand side next to an icon that resembles a credit card and an Amazon gift card."
    },
    {
      "title": "Scroll down and click Add a payment method.",
      "content": "Scroll down and click Add a payment method . It's below your list of credit and debit cards associated with your Amazon account."
    },
    {
      "title": "Click Add a credit or debit card.",
      "content": "Click Add a credit or debit card . It's on the right-hand side below the \"Credit and Debit Cards\" header. Since a Visa gift card works like a regular debit card, it needs to be added as a credit or debit card payment method."
    },
    {
      "title": "Enter the 16-digit card number.",
      "content": "Enter the 16-digit card number. Enter this information where it says \"Card number.\""
    },
    {
      "title": "Enter the name on the card.",
      "content": "Enter the name on the card. It may be your name or it may be a message (i.e. \"A gift for you.\") Enter the name on the card where it says \"Name on card.\""
    },
    {
      "title": "Select the expiration date.",
      "content": "Select the expiration date. Use the drop-down menus next to \"Expiration date\" to select the month and the year of the expiration date of the card. [1] X Research source"
    },
    {
      "title": "Enter the CVV.",
      "content": "Enter the CVV. The 3-digit security code on the back of the card is the CVV."
    },
    {
      "title": "Click Add your card.",
      "content": "Click Add your card . It's the yellow button below the credit card fields. This adds the Visa gift card as a new payment method."
    },
    {
      "title": "Make a purchase with the gift card.",
      "content": "Make a purchase with the gift card. When you are ready to checkout after shopping on Amazon , click the shopping cart icon. Be sure the select your Visa gift card. You can tell which one it is by the last 4-digits on the card. Use the following steps to make a purchase with the Visa gift card: Make your item selections on the Amazon website. Click the shopping cart icon in the upper-right corner. Click Proceed to checkout . Click Continue to checkout . Click Change next to the current payment method listed next to \"Payment method.\" Select the Visa gift card. Click Use this payment method . Click Place your order ."
    },
    {
      "title": "Activate your Visa gift card.",
      "content": "Activate your Visa gift card. Most Visa gift cards are activated at the point of purchase. However, in some cases, you may need to activate your Visa gift card before using. To do so, call the toll-free number listed on the card. Be ready to enter the 16-digit number and expiration date on the gift card."
    },
    {
      "title": "Open the Amazon Shopping app.",
      "content": "Open the Amazon Shopping app. It has an icon that resembles an Amazon package. Tap the Amazon Shopping app icon on your Home screen or Apps menu. If you don't have the Amazon Shopping app, you can download it for free from the Google Play Store on Android phones and tablets, or the App Store on iPhone and iPad."
    },
    {
      "title": "Tap the account icon.",
      "content": "Tap the account icon. It's the icon that resembles a person at the bottom of the screen."
    },
    {
      "title": "Tap Your Account.",
      "content": "Tap Your Account . It's one of the large buttons listed at the top of the page."
    },
    {
      "title": "Scroll down and tap Your Payments.",
      "content": "Scroll down and tap Your Payments . It's the first option below the \"Payments\" header."
    },
    {
      "title": "Tap + Add next to \"Cards & accounts\".",
      "content": "Tap + Add next to \"Cards & accounts\". It's on the right-hand side next to your list of cards."
    },
    {
      "title": "Tap Add a credit or debit card.",
      "content": "Tap Add a credit or debit card . It's the second option below the \"Add a payment method\" header. Since a Visa gift card works like a regular debit card, it needs to be added as a credit or debit card payment method."
    },
    {
      "title": "Add the card number.",
      "content": "Add the card number. Enter the 16-digit card number in the field labeled \"Card number.\" Alternatively, you can tap Scan your card at the top and use your camera to scan the card automatically."
    },
    {
      "title": "Enter the expiration date.",
      "content": "Enter the expiration date. Enter the 2-digit month and year of the card's expiration date below \"Expiration date.\""
    },
    {
      "title": "Enter the name on the card.",
      "content": "Enter the name on the card. This may be your name or a message (i.e. \"A gift for you.\") Enter the name where it says \"Name on card.\""
    },
    {
      "title": "Tap Add and continue.",
      "content": "Tap Add and continue . It's the yellow button at the bottom of the page. The Amazon mobile app does not give you the option to enter the CVV number on the back of the card. Some cards require the CVV and may not allow you to charge the card without it. You can add the CVV using the Amazon website ."
    },
    {
      "title": "Make a purchase with the Amazon gift card.",
      "content": "Make a purchase with the Amazon gift card. When you checkout after shopping with the Amazon app, make sure you select the Visa gift as the payment method. You can tell which one it is by the last 4-digits. Use the following steps to make a payment with the Visa gift card. Make your selections using the Amazon app. Tap the shopping cart icon at the bottom of the screen. Tap Proceed to checkout at the top of the page. Tap Change payment method . Select your Visa gift card and tap Continue . Tap Place your order ."
    }
  ]
}