{
  "url": "https://www.wikihow.com/Upholster-a-Bench",
  "title": "How to Upholster a Bench",
  "steps": [
    {
      "title": "Choose to either reupholster an existing bench or make a new one.",
      "content": "Choose to either reupholster an existing bench or make a new one. If you are reupholstering an existing bench, you will need to unscrew the legs and reattach them later. If you are reupholstering a bench, you will also need to remove staples at the back of the base with needle nosed pliers. Then, remove the fabric, batting, and foam so that you can replace them. It is a good idea to replace them unless they are relatively new. Keep your piece of fabric to use as a template for your fabric bench cover."
    },
    {
      "title": "Measure an existing frame or decide how large you want your bench to be.",
      "content": "Measure an existing frame or decide how large you want your bench to be. If you are creating a bench from scratch, you can customize it to the space you want to fill. Measure the area in inches. [1] X Research source"
    },
    {
      "title": "Purchase a piece of 1/2 inch to 3/4 inch plywood from a home improvement or lumber store.",
      "content": "Purchase a piece of 1/2 inch to 3/4 inch plywood from a home improvement or lumber store. Ask the store to cut it to the exact size that you measured."
    },
    {
      "title": "Buy thick foam core and in a size that is greater than or equal to the size of your piece of wood.",
      "content": "Buy thick foam core and in a size that is greater than or equal to the size of your piece of wood. Your foam core should be at least three inches (7.5cm) thick to assure comfort. Purchase one and a half times the size in upholstery or outdoor fabric. Just as home improvement stores will cut plywood for little to no cost, large fabric stores can cut foam core to size. Use an electric knife to cut foam core at home. [2] X Research source"
    },
    {
      "title": "Clear a large workspace or table.",
      "content": "Clear a large workspace or table. It is easiest to upholster a bench if you are able to slide the fabric and batting along a smooth surface."
    },
    {
      "title": "Drill holes into the corners for the legs.",
      "content": "Drill holes into the corners for the legs. Practice attaching them before you start upholstering to ensure they work for your piece of furniture. You will need a drill and screws for this process."
    },
    {
      "title": "Buy a large roll of batting from a craft store.",
      "content": "Buy a large roll of batting from a craft store. You will need two and a half times the amount of batting as you need foam core."
    },
    {
      "title": "Cut a piece of batting in the exact size of the foam core and plywood base.",
      "content": "Cut a piece of batting in the exact size of the foam core and plywood base."
    },
    {
      "title": "Set your wood base on top of the worktable.",
      "content": "Set your wood base on top of the worktable. Then, get ready to layer your foam and batting."
    },
    {
      "title": "Glue the foam to the wood base using foam glue.",
      "content": "Glue the foam to the wood base using foam glue. Make sure to apply an even, thin layer atop the wood base. Let it sit according to package directions. [3] X Research source"
    },
    {
      "title": "Glue the batting to the top of the foam with a layer of foam glue.",
      "content": "Glue the batting to the top of the foam with a layer of foam glue. Apply an even layer, and then wait for it to dry. [4] X Research source"
    },
    {
      "title": "Pick your wood base, foam and batting off the table.",
      "content": "Pick your wood base, foam and batting off the table. Lay and center a large piece of batting on the table. It will need to wrap around the base and foam to create the upholstered look."
    },
    {
      "title": "Lay the wood base facing down on top of the sheet of batting.",
      "content": "Lay the wood base facing down on top of the sheet of batting. Center it on the table so that you will have more than enough batting on every side to wrap around the back of the base."
    },
    {
      "title": "Choose a mechanical staple gun, an air compressor staple gun or an electric staple gun to affix the batting and fabric.",
      "content": "Choose a mechanical staple gun, an air compressor staple gun or an electric staple gun to affix the batting and fabric. Plug in the staple gun, as needed, and refill it with staples. [5] X Research source"
    },
    {
      "title": "Starting at the center of one side, fold the batting around the bench and onto the back of the base, pulling fairly hard to create tension.",
      "content": "Starting at the center of one side, fold the batting around the bench and onto the back of the base, pulling fairly hard to create tension. Affix the batting to the base with staples within the first inch and a half of the edge of the base."
    },
    {
      "title": "Staple every inch.",
      "content": "Staple every inch. Work from the center of each side out toward the corner. Use a hammer to knock loose staples into the wood. [6] X Research source"
    },
    {
      "title": "Create round corners by pulling the batting around the center of the corner and affixing it right at the corner.",
      "content": "Create round corners by pulling the batting around the center of the corner and affixing it right at the corner. Create square corners by folding one side of the batting in toward the other side of the corner. Then, pull the batting up on the second side and affix it with several staples to the base."
    },
    {
      "title": "Continue stapling until the entire edge of the batting is wrapped around the foam core and secured.",
      "content": "Continue stapling until the entire edge of the batting is wrapped around the foam core and secured."
    },
    {
      "title": "Cut the excess batting from the bottom of the base.",
      "content": "Cut the excess batting from the bottom of the base. Make sure not to cut below the staple line."
    },
    {
      "title": "Lift the bench up again.",
      "content": "Lift the bench up again. Place your material upside down on the table. Center it. [7] X Research source"
    },
    {
      "title": "Replace the bench base face down on top of the upholstery material.",
      "content": "Replace the bench base face down on top of the upholstery material. Center it as well."
    },
    {
      "title": "Wrap the fabric around one end of the bench and secure it with the staple gun.",
      "content": "Wrap the fabric around one end of the bench and secure it with the staple gun. Pull it taught before you staple it."
    },
    {
      "title": "Continue around the perimeter of the bench.",
      "content": "Continue around the perimeter of the bench. Fold the corners in either by creating two darts on each side or by doing a square fold. Staple at least every inch, with more staples in the corners."
    },
    {
      "title": "Cut excess fabric outside of the staple line.",
      "content": "Cut excess fabric outside of the staple line. Use fabric scissors to ensure a straight, even cut. [8] X Research source"
    },
    {
      "title": "Consider placing a bottom cover on the bottom of the bench to protect the upholstery.",
      "content": "Consider placing a bottom cover on the bottom of the bench to protect the upholstery. Cut a piece of fabric that is one inch smaller than your wood base on all sides. Choose interfacing, cotton or synthetic fabric. [9] X Research source"
    },
    {
      "title": "Staple the bottom cover over the raw upholstery edges every inch or two.",
      "content": "Staple the bottom cover over the raw upholstery edges every inch or two."
    },
    {
      "title": "Reattach the legs or base.",
      "content": "Reattach the legs or base. [10] X Research source"
    }
  ]
}