{
  "url": "https://www.wikihow.com/Tell-when-a-Parakeet-Is-Sick",
  "title": "How to Tell when a Parakeet Is Sick",
  "steps": [
    {
      "title": "Be aware that a parakeet can damage its feathers for a number of reasons.",
      "content": "Be aware that a parakeet can damage its feathers for a number of reasons. The damage can occur over time or within just a few hours, depending on the cause. Some possible reasons for feather damaging include: [1] X Research source Mattie Sue Athan, <i>Parrots</i> [2] X Research source Boredom. If the bird doesn't feel mentally stimulated, it will grow bored. Picking at its feathers is a form of distracting itself, much as when a human bites at their fingernails out of boredom or frustration. Diet. If the bird isn't getting a nutrient-balanced diet, it may resort to feather plucking. Stress. A person, pet or habitat could be provoking the bird to feel stressed. Lack of exercise, overly large or small perches, noisy or busy cage location, lack of chewing toys, lack of exercise, etc., can lead to the bird being stressed. You should move the bird to a calm, quiet and low-traffic room. Illness. A medical condition or disease can cause feather plucking or loss such as French Moult."
    },
    {
      "title": "Look for signs of mites.",
      "content": "Look for signs of mites. If the feathers are patchy or thin, it may be one sign of mites. Look for other symptoms of mites or other parasites as well. These can include: [3] X Research source Crusted or scaly skin around the beak, legs, and eyes. Red lesions on the skin. Restless behavior, especially at night. Clicking noises. Tiny, moving red or black specks in the cage or feathers."
    },
    {
      "title": "Seek advice from your veterinarian.",
      "content": "Seek advice from your veterinarian. It is important to rule out an illness before assuming the feather-plucking behavior is caused by boredom, diet or stress. Moreover, unless you are an expert, it can be difficult to diagnose a bird's illness."
    },
    {
      "title": "Be alert to any changes in the bird's eating or drinking habits.",
      "content": "Be alert to any changes in the bird's eating or drinking habits. A failure to eat food or drink water is a very concerning sign, and the bird should be seen by a veterinarian immediately. [1] X Research source Mattie Sue Athan, <i>Parrots</i>"
    },
    {
      "title": "If your parakeet is lethargic, and won't respond to you calling or offering food, this is a sign of sickness.",
      "content": "If your parakeet is lethargic, and won't respond to you calling or offering food, this is a sign of sickness. This may be accompanied by huddling low on its perch, puffing up the feathers or breathing heavily. In addition, the bird may show some of these signs: [2] X Research source [4] X Research source [5] X Research source Weakness Sitting in a corner of the cage or low in the cage Falling off its perch Continuous feather ruffling Failure to preen itself A lack of activity or a strange new posture Walking in circles Having seizures or trembling Sleeping a lot Changes to its singing, or a lack of singing Hanging from the cage by its beak rather than perching."
    },
    {
      "title": "Watch for aggression.",
      "content": "Watch for aggression. A normally placid and happy parakeet may suddenly start to snap at you or behave aggressively if it feels pain or is ill. [5] X Research source"
    },
    {
      "title": "If the weather or room environment is hot, there is a possibility that the parakeet is too hot.",
      "content": "If the weather or room environment is hot, there is a possibility that the parakeet is too hot. Birds cannot sweat and must use other ways to dissipate heat from their bodies. [2] X Research source Signs that your parakeet may be too warm include: [2] X Research source Panting (rapid breathing or more breaths per minute than usual)––this is a very serious sign of overheating that needs immediate veterinary attention, first by phone, then by a visit Spreading its wings out Hot feet Flared and red nares (nasal opening) Hot beak Note that these symptoms can also be found if the bird has a fever or respiratory distress, so it's important to seek help from the vet immediately."
    },
    {
      "title": "If the weather or room environment is cold, there is a possibility that the parakeet is too cold.",
      "content": "If the weather or room environment is cold, there is a possibility that the parakeet is too cold. Signs that your parakeet may be too cold include: [2] X Research source Fluffing out its feathers Huddling or scrunching over its feet (to keep them warm) Sitting in a corner or finding a hiding spot (possibly to get away from a draft)."
    },
    {
      "title": "Check the bird's droppings.",
      "content": "Check the bird's droppings. Bird droppings consist of a dark solid portion called feces, chalky white urates, and clear urine. Normal droppings should not smell. Any change in color, consistency, or smell is a sign that something may be wrong. [6] X Research source If there is a bad odor in the cage, either from urine, droppings or another source, assume that the bird is not well. [4] X Research source Green or yellow discoloration may indicate liver disease while black or red may be a sign of internal bleeding. [7] X Research source Liquid feces usually indicate diarrhea. Wet feathers around the vent are another sign of diarrhea."
    },
    {
      "title": "Look for discharge.",
      "content": "Look for discharge. If you see discharge from the nostrils, or crusted areas, the bird is ill. [2] X Research source"
    },
    {
      "title": "If you notice or feel lumps or swollen parts of the bird's body, this is a problem in need of immediate veterinary attention.",
      "content": "If you notice or feel lumps or swollen parts of the bird's body, this is a problem in need of immediate veterinary attention. [2] X Research source"
    },
    {
      "title": "Be alert to any vomiting or regurgitation.",
      "content": "Be alert to any vomiting or regurgitation. This usually signals illness. If regurgitating the budgie may shake its head side to side and expel whole seeds. If vomiting the head will appear wet and may include mucous and seed. [2] X Research source"
    },
    {
      "title": "Check the parakeet's eyes.",
      "content": "Check the parakeet's eyes. If they look sunken, droopy, cloudy or have changed color, these are signs of poor health or an illness. A healthy parakeet will have clear and alert eyes. [2] X Research source"
    },
    {
      "title": "See the veterinarian first.",
      "content": "See the veterinarian first. Use your usual bird-experienced vet to diagnose and treat the bird's illness. You can find an avian vet by using the Association of Avian Veterinarians' database."
    },
    {
      "title": "Follow the vet's home-care instructions with great care.",
      "content": "Follow the vet's home-care instructions with great care. Be prepared to call if you're not sure about anything or if changes occur that worry you."
    },
    {
      "title": "Keep the recovering bird in a warm place that is not too hot.",
      "content": "Keep the recovering bird in a warm place that is not too hot. Avoid situating the bird anywhere with drafts, noise or bright light. Keep human and pet traffic to an absolute minimum. Remove distractions from the cage, such as toys, mirrors or bells. Ensure that the bird gets at least 10 to 12 hours of sleep. This may include making the bird's resting area off-bounds to all household members. In some cases, it may help to increase the humidity in your home. Talk to your vet about this; it can assist with improved breathing if the bird is congested, but the vet must okay it first."
    },
    {
      "title": "Keep the fluids up.",
      "content": "Keep the fluids up. This can be helped by feeding the bird foods with a high moisture content, such as leafy greens and fruit, provided the vet has said this is okay first. [2] X Research source If it is okay to give fruit, float a piece of grape or apple in the bird's water. This can encourage the bird to drink, as well as take the piece of fruit."
    },
    {
      "title": "Ask your vet to suggest a feeding regime.",
      "content": "Ask your vet to suggest a feeding regime. Recovering birds often do well on a diet high in simple carbohydrates because these are easy for the bird to digest. [2] X Research source Your bird's vet should give you appropriate suggestions."
    }
  ]
}