{
  "url": "https://www.wikihow.com/Spot-a-Player",
  "title": "How to Spot a Player",
  "steps": [
    {
      "title": "Watch out for over-confidence.",
      "content": "Watch out for over-confidence. Healthy self-confidence is great, but there's a difference between being confident and being cocky. [1] X Research source If you think this person seems a little too confident in their efforts to win you over, it could be because they've had plenty of practice. Most people become at least a little nervous around people they're attracted to. A confident person isn't necessarily a player, but if they don't break a sweat while asking you out or seems rather aloof about the whole deal, they might not be that serious about you."
    },
    {
      "title": "Calculate the age gap.",
      "content": "Calculate the age gap. If the person is old enough to be your parent, it could be a bad sign. Older players who are set in their ways frequently target younger, less experienced people who are easier to trick. Not every older person is a player, of course, but if there's a huge age gap and they exhibit other signs of being a player, that age gap may work against them. Similarly, not every player is an older person. There are plenty of young players out in the world, too."
    },
    {
      "title": "Glance at the phone.",
      "content": "Glance at the phone. When they're texting someone, lean in their direction and peek at his phone. You don't even need to see the screen; in fact, you'll learn more by keeping your eyes on they. If the person's a player, they'll probably yank their phone away faster than you can blink. Moreover, if they're always on their phone or looks at it more than they look at you, that could be another bad sign. This piece of advice isn't an invitation to swipe their phone and look at their call log, though. Many people view that as an invasion of privacy, and even guys who aren't players might get upset at the breach of trust. You usually won't need their text or call history as evidence, anyway, since being overprotective of their phone is a bad enough sign on its own."
    },
    {
      "title": "Track them down.",
      "content": "Track them down. [2] X Research source Pay attention to the places they frequent when you're not around. If they still visit the same spots they went to when they were single and picking up people, there's a good chance that they're still in the habit of charming the singles there. This does not mean that you should stalk them. A healthier way to find out where they're going is ask around and find out who might've seen them and where they were when it happened. You could also try visiting the spot you met them on an evening they might be there."
    },
    {
      "title": "Beware of flattery.",
      "content": "Beware of flattery. Honest compliments are sweet, but you probably shouldn't trust someone who's quick to flatter you to an excessive degree. Players often rely on this sort of “sweet talk” to win over people. [3] X Research source Pay attention to the types of compliments they give you. If they're general, overused compliments that could apply to nearly any person—beautiful hair, gorgeous smile, etc.—it could be a sign that they aren't putting much thought into who you are and what makes you special. You should also be cautious around those who specifically compliment your insecurities. Similarly, most players are quick to address you with one or more pet names, like “honey,” “sugar,” and “baby.” Pet names that develop after an extended relationship are usually okay, but be wary around those who use pet names from day one."
    },
    {
      "title": "Don't dismiss dishonesty.",
      "content": "Don't dismiss dishonesty. Players are also liars. Catching them in the middle of a lie can be difficult, but when you do, you shouldn't shrug it off. This is especially true if they've lied to you more than once. Lies about their past, where they spent time recently, or who they've been with are some of the most common ones to watch out for. If you're suspicious about something and confront them about it, watch his reaction. Players will generally try to laugh it off and change the topic. When that doesn't work, they may admit to the truth but somehow blame you for their lie. [4] X Research source"
    },
    {
      "title": "Consider the player's life story.",
      "content": "Consider the player's life story. Most players are egotistical, so they'll start talking about themselves before you even have the chance to ask. If a person hasn't shared much about their own life, though, ask them about it and watch for inconsistencies. [5] X Research source Everyone wants to look good in front of someone they're attracted to, but the player will usually look a little too good. If their life story seems scripted and too good to be true, it probably is. Pay attention to the details. If some of the details don't match up, it could be an indication that they're lying about who he is."
    },
    {
      "title": "Share your own story.",
      "content": "Share your own story. Since most players are overly concerned with themselves, they don't have much time to be concerned with other people. A person who is genuinely interested in you will want to know about your life and your passions, but a player won't take the time to find out. [6] X Research source Skilled players may know well enough to ask about your life, but won't be interested enough to remember what you say. Bring up things you've talked about in past conversations. It's probably fine if they occasionally forget about small details, but it's usually a bad sign if they makes a habit of forgetting."
    },
    {
      "title": "Talk about past relationships.",
      "content": "Talk about past relationships. Ask about their past relationships and talk about yours. These conversations provide the player with opportunities to manipulate your feelings. They may ask about your past relationships and fixate on the insecurities you felt during those times. By knowing what makes you insecure, they can figure out how to work that to their advantage. When talking about their own past relationships, they may leave out many of the details but stress that they've been hurt in the past. A quick mention of past hurts may not be bad, but if they play it up to evoke pity from you, it may be another manipulation tactic."
    },
    {
      "title": "Defend your own innocence.",
      "content": "Defend your own innocence. Players will often accuse the person they're seeing of cheating on them. Usually, this is done in an attempt to steer the attention away from their own guilt and their own cheating ways."
    },
    {
      "title": "Value your own time.",
      "content": "Value your own time. Pay attention to how the person asks you out and how they respond when you invite them. Good people will value your time, but a player won't. Players usually ask you out on short notice. Since they aren't genuinely looking forward to seeing you, they turn you into a backup plan and ask you out only when they don't have anything “better” lined up for an evening. If you always get a “maybe” from the guy when you ask them out, it could mean that they don't want to commit in case another, more preferable offer comes up. A person who frequently cancels last-minute might do so for similar reasons."
    },
    {
      "title": "Avoid hot-and-cold behavior.",
      "content": "Avoid hot-and-cold behavior. Players are inconsistent in their affections and may sway from one extreme to the other. You may not hear from them in weeks, and then suddenly, they'll start bombarding you with more attention than you can handle. [7] X Research source During “cold” periods, there's a good chance that they're spending their time with other lovers and is too busy with them to bother with you. During his “hot” periods, they've either lost their other options or lost interest in them. As a result, they return to you in an effort to fill the void."
    },
    {
      "title": "Change up your meeting place.",
      "content": "Change up your meeting place. If the two of you always meet at night, try asking them for a daytime date. Most players will strongly resist and reject the idea, and the excuses they give for doing so are usually pretty lame. If you can't change the time of the date, try changing the nature of it. Instead of spending time alone or going out for drinks, go somewhere with plenty of people and very little alcohol. The person's odds of getting you into bed will decrease when you do this, so if they're a player, they won't be willing to make the change."
    },
    {
      "title": "Maintain eye contact.",
      "content": "Maintain eye contact. Try to maintain eye contact when you're together in a public venue. Your eyes don't need to be locked the entire time, but their eyes should be directed your way for most of the date. Note that the occasional wandering eye may not be a terrible sign, but if their eyes are constantly wandering toward other people, there's a problem. Similarly, a wandering eye that remains stuck on another person is also a bad sign."
    },
    {
      "title": "Move slowly.",
      "content": "Move slowly. A player only cares about your body—and, more precisely, whether or not they get to enjoy it. One of the best ways to weed out the players is to take things slow with every guy you meet. Players won't have the patience to stick around. [8] X Research source"
    },
    {
      "title": "Take it public.",
      "content": "Take it public. If you're in a relationship with a player, you're probably not the only person they're seeing. Making your relationship public will make it easier for their lies to be exposed to both you and the other people, and for that reason, they'll usually reject the idea of being public about it. The way they treat you in public will be one good indication. If they refuse to treat you with any special affection or treats you just as affectionately as other people, it might be their way of keeping your relationship a secret. To that end, they might also avoid spending time with you in certain places if they think there's a better chance of being caught there. Check social media accounts, too. If they refuse to be “friends” or “followers” with you, or if they never respond to any public comments you make toward them, it could be a sign that they're trying to hide your relationship. Refusing to update their “relationship status” might be another social media clue."
    },
    {
      "title": "Get to know the friends.",
      "content": "Get to know the friends. [9] X Research source Try to spend time with their friends. Most players won't want you anywhere near their friends, and it won't be because they're afraid of another person stealing you away. If they let you meet their friends, they take the risk that someone within the group will slip and reveal information about their true self. If you do meet their friends, watch your partner's behavior around them. Some players will drop their guard and show their true colors when they're hanging around their buddies."
    },
    {
      "title": "Introduce your own family and friends.",
      "content": "Introduce your own family and friends. Invite them to meet your friends and family. Since a player isn't serious about you, they will usually refuse such offers or make excuses to get out of them at the last minute. Moreover, friends and relatives with a keen eye might be able to spot a player when they see one. A player who agrees to meet your loved ones would have to take the risk of being discovered by someone like that."
    },
    {
      "title": "Ask for opinions.",
      "content": "Ask for opinions. Ask around about the person and find out if there are any rumors about them. People in their own social circle might cover for them, but anyone who isn't attached to them won't have a need to do so. Ask your close friends to do their own investigating on your behalf, as well. They probably have a few connections you don't have, and one of those connections might have helpful information. You could even consider talking with the person's exes, but do so with caution. Some exes will intentionally paint a bad picture as an act of revenge. Additionally, an ex who believes that you “stole” the person away from them may take out their negative feelings on you."
    },
    {
      "title": "Watch how others are treated.",
      "content": "Watch how others are treated. Players lack respect for you, but that's because they lack respect for everyone. It can be difficult to tell when a person is disrespecting you, but it'll probably be easier to detect disrespect they show toward others. Pay particular attention to the way they treat and talk about others of your gender. Even disrespect they show toward certain relatives can indicate an overall sense of disrespect toward a specific gender in general. Watch how they treat workers at the places you visit, too. Players may relish in the authority they have over these staff members."
    }
  ]
}