{
  "url": "https://www.wikihow.com/Treat-a-Caterpillar-Sting",
  "title": "How to Treat a Caterpillar Sting",
  "steps": [
    {
      "title": "Remove the caterpillar without touching it.",
      "content": "Remove the caterpillar without touching it. If the caterpillar is still on your skin, use pliers, tweezers, or thick gloves to pick up the caterpillar and remove it. Never try to remove the caterpillar with your bare hands because it can sting you again. [1] X Trustworthy Source U.S. National Capital Poison Center Independent poison control center providing resources to prevent poisonings and save lives Go to source Caterpillar stings come from their tiny spines that look like hairs. That is why that it is so important to avoid touching them with your fingers."
    },
    {
      "title": "Use tape to remove spines from the skin.",
      "content": "Use tape to remove spines from the skin. Get scotch tape, duct tape, or something similar. Place it over the site of the sting, then quickly remove it. The tape will catch any poison hairs or spines that remain in your skin. This is important to minimize sting symptoms and prevent additional stings. [2] X Research source You can also use the adhesive part of a bandage to remove hairs or spines."
    },
    {
      "title": "Wash the area.",
      "content": "Wash the area. Use soap and warm water to wash the area thoroughly. In addition, wash the surrounding area as well. Finally, make sure to wash both of your hands thoroughly, just in case you came into contact with poison or stingers. [3] X Research source"
    },
    {
      "title": "Apply a baking soda and water paste.",
      "content": "Apply a baking soda and water paste. Mix one tablespoon of baking soda with one to two tablespoons of warm water. Liberally apply the paste to the area of the sting and allow it to sit for a couple of minutes. The baking soda paste should reduce itching and other discomfort. Reapply the paste every couple of hours. [4] X Trustworthy Source U.S. National Capital Poison Center Independent poison control center providing resources to prevent poisonings and save lives Go to source"
    },
    {
      "title": "Use a hydrocortisone cream.",
      "content": "Use a hydrocortisone cream. If the baking soda fails to alleviate your symptoms, rinse the baking soda paste off and then apply a liberal amount of hydrocortisone cream. Allow the cream to sit. It may take up to an hour for it to sooth the sting site. Reapply the cream according to the instructions on the product. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try an antihistamine cream.",
      "content": "Try an antihistamine cream. If hydrocortisone cream also fails, wash thoroughly, and then apply a liberal amount of antihistamine cream. Wait for up to half an hour to see if you notice a difference. In many cases, antihistamine creams have proven ineffective in soothing the symptoms of a caterpillar sting, however you may find that the cream works for you. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Apply a cold compress.",
      "content": "Apply a cold compress. After you have applied the baking soda paste or a cream, you can put a cold compress on the site of the sting. Place a bag of ice or frozen vegetables on the site of the sting for 10 to 20 minutes at a time. Reapply the cold compress every hour or two. [7] X Research source"
    },
    {
      "title": "Watch for the development of serious symptoms.",
      "content": "Watch for the development of serious symptoms. Caterpillar stings can result in a variety of symptoms. Depending on the type of caterpillar and any allergies you may have, symptoms can be very mild or very severe. Common symptoms include: [8] X Research source Itchiness and contact dermatitis, blisters , weals (welts), small red bumps, pain Acute conjunctivitis , if hairs penetrate the eyes Rash and hives Difficulty breathing Nausea and vomiting Bleeding and renal failure can occur after contact with the South American Lonomia caterpillar."
    },
    {
      "title": "Contact your doctor if you experience worsening symptoms.",
      "content": "Contact your doctor if you experience worsening symptoms. If you develop blisters, large welts, or a rash that spreads, contact your doctor immediately. This is important, as some people can develop potentially deadly allergic reactions to caterpillar stings. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Call Poison control for more information.",
      "content": "Call Poison control for more information. Poison control can be reached at 1-800-222-1222 any time of the day or night, if you have any questions about how to treat a caterpillar sting. A poison specialist will answer the phone and provide you with recommendations about how to treat the sting site. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Get a tetanus booster shot.",
      "content": "Get a tetanus booster shot. If you have not had a tetanus booster in the last five to 10 years, you should get one within 72 hours of being stung by a caterpillar. This is because the sting/wound site may become open to bacteria and infection. [11] X Research source"
    }
  ]
}