{
  "url": "https://www.wikihow.com/Tune-a-Flute",
  "title": "How to Tune a Flute",
  "steps": [
    {
      "title": "Know the terms.",
      "content": "Know the terms. A flute that is out of tune might be flat or sharp. Knowing if your flute is flat or sharp will determine how you get it back into tune. \"Flat\" refers to a pitch that is slightly lower than it is supposed to be. While a note can be flatted (B versus B-flat), in this case it's much less of a difference: simply a slight lowering of pitch. \"Sharp\" means that your pitch is slightly higher than it is supposed to be. While a note can be sharped (F versus F-sharp), in this case it's much less of a difference: simply a slight heightening of pitch."
    },
    {
      "title": "Know how your flute's size affects its tune.",
      "content": "Know how your flute's size affects its tune. When it comes to flutes, the length of the body of the instrument is one factor in determining whether it plays a particular pitch in tune. [1] X Research source The longer your flute, the lower its pitch tendency will be. As you adjust a flute's length through headjoint adjustments, you change its overall pitch. [2] X Research source"
    },
    {
      "title": "Understand the two ways to change a flute's tuning.",
      "content": "Understand the two ways to change a flute's tuning. A flute is a complex instrument, and tuning it differs significantly from the process required for other instruments. The only modification a player should generally make it with the headjoint position itself. If the scale is out of tune with itself throughout the instrument, a replacing or replacement of the headcork/crown could be necessary. If possible, do not do this on your own (as described in step 3), and take it to a certified repair person. [3] X Research source The flute's crown is the cap located on the end of the flute nearest the lip plate and embouchure hole. The crown looks like a small metal cap, but it is actually attached to a headcork assembly that is inside the headjoint. [4] X Research source Once you adjust it once, leave it in place. Don't tighten or loosen it again. The headjoint is the first of three joints that holds the flute's body together. It includes the lip plate. [5] X Research source Generally, ensembles will perform at A4=440; most flutes are designed to play at this (and a small range of other) pitch levels. After tuning your A, using a chromatic tuner, play a mid-range note (such as G) without looking at the tuner. Once you have the note established, glance at the tuner to be sure it is not playing flat or sharp. [6] X Research source If it is playing flat or sharp, the headcork could require adjustment or replacement."
    },
    {
      "title": "Measure where the cork is currently.",
      "content": "Measure where the cork is currently. The cork attached to the crown is intended to be set at a particular place, which varies by manufacturer and pitch of the flute. If it's not in place, the flute's will be offset and out of tune with itself throughout its range. Your flute's cleaning rod has a handy measuring line on it to let you know that the cork is in place. Insert the marked end of the cleaning rod into the end of the flute opposite the crown, and push it all the way through the flute until it gently touches the cork at the other end. You should be able to see a mark on the cleaning rod through the embouchure hole."
    },
    {
      "title": "Understand what the measurement means.",
      "content": "Understand what the measurement means. The placement of the tick-mark on the cleaning rod when you insert in into the flute tells you whether the cork's location is responsible for your flute's scale being inconsistent and out of tune. If the tick-mark on the cleaning rod is in the exact center of the embouchure hole, then your cork placement is not the problem and you do not need to adjust your crown. Skip on to the next step below titled \"Tuning Your Flute: Adjust its Headjoint.\" If your tick mark is too far to the left (that is, in the direction of the crown), the tubing is too long; If the tick mark is too far to the right, the cork is screwed in too far, making the tubing too short."
    },
    {
      "title": "Adjust a cork that is not centered.",
      "content": "Adjust a cork that is not centered. If your cork is not centered, your flute needs to be tuned by adjusting the cork into the correct position. Be aware that this is a difficult and delicate procedure and if it is not done correctly, it can damage your flute. Ask your music teacher or instrument repair shop to adjust it for you if you are not absolutely sure you can do it correctly. [7] X Research source Always measure the placement of the cork before adjusting, to be sure that you know whether you need to lengthen the flute tube or shorten it. To shorten a flute tube and fix a flute that is playing flat, turn the crown counterclockwise a small amount. Very gently push the crown toward the tube, which moves the cork away from the crown and shortens the flute tube. Only push until the crown sits against the headjoint, and do not continue pushing if you meet any resistance. To lengthen a flute tube and fix a flute that is playing sharp, turn the crown clockwise a small amount. Turning the crown clockwise moves the cork, so do not pull on the crown. Check the position with your cleaning rod to assure that it is now in the correct place."
    },
    {
      "title": "Leave the cork in place.",
      "content": "Leave the cork in place. Once you have made the proper adjustments to your cork, don't mess with it. It should stay in place until it is serviced by an instrument repair person. The cork will always be in the correct position when you purchase a new instrument, so there is not need ever to modify it yourself. Twisting the crown tightens and loosens the cork unnecessarily and can damage your flute, not to mention altering its tune. The flute's headjoint is not cylindrical—it is a parabolic cone—so pulling the headcork assembly the incorrect direction can irreparably damage the shape of the bore. [8] X Research source"
    },
    {
      "title": "Adjust your headjoint every time you play.",
      "content": "Adjust your headjoint every time you play. [9] X Research source The headjoint must be adjusted every time you play. [10] X Research source The length of a flute's headjoint can range from three to fifteen millimeters for optimal pitch; it will vary every time you play depending on factors such as the temperature in the room and the pitch of other instruments that you might be playing with. To check your pitch, first play an A with your tuner. [11] X Research source"
    },
    {
      "title": "Raise your pitch.",
      "content": "Raise your pitch. If you are playing flat, you need to raise your pitch by pushing in the headjoint and shortening the flute tube. Holding the body of the flute firmly in one hand above the keys, carefully but firmly push in the headjoint as much as necessary. You should use a slight twisting motion to push it in. Start by just pushing it in a bit and then check your A again before pushing it in further. Use your chromatic tuner to check that you are now playing in the correct pitch. If you are still flat, push it in a bit more."
    },
    {
      "title": "Lower your pitch.",
      "content": "Lower your pitch. If you are playing sharp, you need to flatten your pitch by pulling out your headjoint and lengthening the flute tube. Holding the body of the flute firmly in one hand, carefully pull the headjoint out a bit. Do not pull out the flute headjoint by the lip plate. The lip plate is a moveable part and doing so can cause damage to the instrument by breaking the soldering. You might have to use a slight twisting motion to pull it, but don't pull too hard. Start by just pulling it out a few millimeters and then check your A before pulling any further. Use your chromatic tuner to check that you are now playing in the correct pitch. If you are still sharp, pull it in a bit more."
    }
  ]
}