{
  "url": "https://www.wikihow.com/Spell-Check-a-Website",
  "title": "How to Spell Check a Website",
  "steps": [
    {
      "title": "Copy the URL for the website you want to spell-check.",
      "content": "Copy the URL for the website you want to spell-check. Go to the web page you want check, then click the website's address in the address bar at the top of the browser window and press either Ctrl + C (Windows) or ⌘ Command + C (Mac)."
    },
    {
      "title": "Open the Typosaur page.",
      "content": "Open the Typosaur page. Go to https://typosaur.com/ in your computer's web browser. Typosaur is ideal for determining which words are misspelled and finding replacements for them. If you want to see the physical location of the misspelled words on the web page, use the Online Spell Checker instead."
    },
    {
      "title": "Enter the URL.",
      "content": "Enter the URL. Click the text box in the middle of the Typosaur page, then press either Ctrl + V (Windows) or ⌘ Command + V (Mac) to paste in the address."
    },
    {
      "title": "Click SCAN.",
      "content": "Click SCAN . It's to the right of the text box. Doing so prompts Typosaur to begin searching for spelling mistakes."
    },
    {
      "title": "Click the number of errors.",
      "content": "Click the number of errors. You'll see the number of errors and the word ERRORS on the right side of the page. Clicking it brings up a list of misspelled words. For example, if Typosaur found 20 errors, you would click 20 ERRORS here."
    },
    {
      "title": "Review the list of misspelled words.",
      "content": "Review the list of misspelled words. Scroll down to see the list of misspelled words (in red) and their suggested proper spellings (in black)."
    },
    {
      "title": "Copy the URL for the website you want to spell-check.",
      "content": "Copy the URL for the website you want to spell-check. Go to the web page you want check, then click the website's address in the address bar at the top of the browser window and press either Ctrl + C (Windows) or ⌘ Command + C (Mac)."
    },
    {
      "title": "Open the Online Spell Checker website.",
      "content": "Open the Online Spell Checker website. Go to https://www.internetmarketingninjas.com/online-spell-checker.php in your computer's web browser."
    },
    {
      "title": "Make sure the \"Website\" box is checked.",
      "content": "Make sure the \"Website\" box is checked. It's near the top of the page."
    },
    {
      "title": "Paste in the address.",
      "content": "Paste in the address. In the text box below the \"Website\" checkbox, remove any existing text and then press either Ctrl + V (Windows) or ⌘ Command + V (Mac) to paste in the address."
    },
    {
      "title": "Enter any words to ignore.",
      "content": "Enter any words to ignore. Scroll down to the large text box in the \"Words to ignore\" section, then enter any purposefully misspelled words by typing in a word, pressing ↵ Enter , and repeating. Each word should be on its own line."
    },
    {
      "title": "Scroll down and click Ninja Check.",
      "content": "Scroll down and click Ninja Check . It's at the bottom of the page. Doing so will cause Online Spell Checker to begin searching your web page for errors."
    },
    {
      "title": "Click OK when prompted.",
      "content": "Click OK when prompted. This signifies that Online Spell Checker has finished checking your web page for errors."
    },
    {
      "title": "Click the number in the \"Possible Misspelling\" column.",
      "content": "Click the number in the \"Possible Misspelling\" column. Doing so will open a new page. If you don't see a number in the \"Possible Misspelling\" column, your web page doesn't have any spelling mistakes that register with the Online Spell Checker. You may still want to run the web page through Typosaur to double-check."
    },
    {
      "title": "Review the spelling mistakes.",
      "content": "Review the spelling mistakes. Scroll through your website's text; any red pieces of text are potentially misspelled."
    }
  ]
}