{
  "url": "https://www.wikihow.com/Why-Do-I-Have-a-Double-Chin-when-I%27m-Skinny",
  "title": "Why Some Thin People Have Double Chins (& How to Get Rid of Them)",
  "steps": [
    {
      "title": "Genetics",
      "content": "Genetics Due to your genetics, you might simply store stubborn, excess fat under your chin and around your neck instead of other areas. Having a softer jawline or a less prominent chin can also give you the appearance of a double chin. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For instance, other people commonly carry their weight around their hips, thighs, or abdomen."
    },
    {
      "title": "Posture",
      "content": "Posture Constantly looking down at your phone or computer screen or slumping your shoulders can cause you to develop a double chin, even if you’re skinny. Poor posture weakens the muscles around your jaw and neck, causing the skin to loosen and droop around your chin. [2] X Research source This phenomenon, often referred to as \"tech neck,\" occurs because people tend to tilt their heads downward for extended periods while using handheld devices (like phones and tablets). While staring at the computer screen, even office workers tend to look down at the keyboard when typing for 8 hours a day. This repeated downward gaze can lead to a loss of skin elasticity and the weakening of neck muscles over time, resulting in the appearance of a double chin. Additionally, poor posture associated with prolonged device use exacerbates this effect, further contributing to skin sagging and fat accumulation in the neck area."
    },
    {
      "title": "Age",
      "content": "Age As you age, your skin loses collagen, or the protein that gives your skin structure and elasticity. When the skin around your jaw and neck gets less tight and begins to sag, you might develop a double chin. [3] X Research source Your metabolism also starts to slow down as you age, which can lead to increased weight gain around your chin and neck."
    },
    {
      "title": "Diet and activity level",
      "content": "Diet and activity level Even if you’re at a low and healthy weight, you might have excess body fat compared to your muscle mass, which leaves you with stubborn fat around your jawline. So, your double chin might be due to not getting enough exercise each day or eating more refined and processed foods than fruits, vegetables, and whole grains. [4] X Research source"
    },
    {
      "title": "Hypothyroidism",
      "content": "Hypothyroidism Your thyroid, which is located in your neck, controls hormones in your body that affect your metabolism. When you have hypothyroidism, or an underactive thyroid, you don’t produce as many hormones. This can lead to weight gain under your chin as well as all across your body. [5] X Research source Facial swelling is another symptom of hypothyroidism which can cause the appearance of a double chin. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you aren’t diagnosed with an underactive thyroid but think you have one, look for possible signs of hypothyroidism like fatigue, weight gain, and an intolerance to cold. Then, talk to your doctor about getting diagnosed. Work with your doctor to treat your hypothyroidism as well as reduce your double chin."
    },
    {
      "title": "Do daily chin exercises.",
      "content": "Do daily chin exercises. To lessen the look of your double chin , practice exercises that help strengthen the muscles around your jaw and neck. While you can’t reduce the fat below your chin specifically, working your muscles might tighten up the area (there's not much scientific research behind these exercises, but anecdotal evidence suggests they can help). [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try repeating 1 (or all!) of these exercises 10 to 15 times each day: Lip pucker : Tilt your head back so you’re staring at the ceiling. Then, pucker your lips into a kissing position and hold them for 20 seconds. Tongue stretch : Keep your head straight, stick out your tongue as far as you can, and hold it for 5 seconds. Jaw jut : Tilt your head back so you’re staring at the ceiling. Then, jut your lower jaw forward and hold it for 10 seconds. Sideways jaw jut : Tilt your head back so you’re staring at the ceiling. Rotate your head to the right, jut your jaw forward, and hold for 10 seconds. Then, turn your head to the left, jut out your jaw, and hold it for 10 seconds. Ball press : Place a small ball, like a tennis ball, underneath your chin. Then, press your chin and the ball to your chest and hold it for 5 seconds. Neck stretch : Tilt your head back so you’re staring at the ceiling. Then, push your tongue to the roof of your mouth and hold it for 10 seconds."
    },
    {
      "title": "Improve your posture.",
      "content": "Improve your posture. If you find yourself slouching at your desk at work or looking down at your phone as you walk, take a few moments to adjust your posture . Whether you’re sitting, standing, or walking, keep your back straight, roll your shoulders back, and stare straight ahead. Then, hold your phone or tablet at eye level as you use it. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you work at a desk, adjust your computer screen and chair so you are sitting up and looking at it straight on. Use a phone stand or tablet holder to prop up your device and keep it at eye level as you’re working or relaxing. If you’re sitting for a long time, take a 5 to 15 minute break every hour to stand up, stretch, or go for a quick walk."
    },
    {
      "title": "Eat a balanced diet.",
      "content": "Eat a balanced diet. Eating a nutrient-rich diet not only helps you lose the stubborn fat under your chin, but makes you healthier and feel better, too. Simply eat foods from the 5 main food groups each day: vegetables, fruits, grains, proteins, and dairy. [9] X Research source While sweets and snacks can also be a part of a balanced diet, limit how often and how much you eat processed and sugary foods. [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Fruits and veggies : Most adults need about 2 to 3 cups of fruits and vegetables each day, like berries, apples, oranges, broccoli, spinach, carrots, and potatoes. Grains : The average adult needs 6 to 10 ounces of grains each day, half of which are whole grains. So, eat foods like whole wheat bread, brown rice, pasta, and quinoa. Protein : Most adults need 5 to 7 ounces of lean protein each day. This includes seafood, poultry, beef, eggs, beans, lentils, soy, and nuts. Dairy : Most adults need 3 cups of high-calcium, low-fat dairy like milk, yogurt, and cheese (or their lactose-free alternatives)."
    },
    {
      "title": "Exercise for at least 150 minutes each week.",
      "content": "Exercise for at least 150 minutes each week. The other piece to reducing your double chin, as well as living a healthier life, is exercising most days. If you’re not used to physical activity, work your way up to your weekly goal with 15-minute walks around your neighborhood or going for a leisurely bike ride. [11] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Gradually add 1 to 2 days of muscle-strengthening exercises to your weekly routine, like doing push-ups, squats, crunches, and glute bridges."
    },
    {
      "title": "Kybella injections",
      "content": "Kybella injections Kybella is a non-surgical treatment that’s made from deoxycholic acid and injected under your chin. This naturally occurring acid shrinks and destroys many of the fat cells to completely remove some of them from your body. So, the results are usually long-lasting or even permanent. [12] X Research source Kybella is typically recommended for people who maintain a healthy weight and who don’t have excess, sagging skin. Most patients need about 2 to 4 sessions of Kybella which take about 20 minutes each. The average patient returns to their normal life after 1 to 2 days. The most common side effects are swelling, redness, and bruising."
    },
    {
      "title": "Cryolipolysis (CoolSculpting)",
      "content": "Cryolipolysis (CoolSculpting) CoolSculpting is another non-invasive procedure that freezes and kills the stubborn fat cells from your double chin. During the treatment, your doctor places a cold, suctioning device under your chin. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The average patient needs 1 to 2 treatments which usually last 30 to 45 minutes each. There’s no significant recovery time needed when getting CoolSculpting, though you may experience swelling, numbness, or redness."
    },
    {
      "title": "Liposuction",
      "content": "Liposuction Liposuction is a surgical procedure that completely removes the fat cells under your chin. For most surgeries, you are either placed under local or general anesthesia. Your doctor cuts a small incision and then inserts a suction tube to remove the fat along your neck and chin. [14] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Most double chin procedures take less than 1 hour to complete. Recovery can take up to 2 weeks, though you can typically return to normal activities after 1 to 2 days. Liposuction is regarded as low risk, though infection can occur."
    },
    {
      "title": "Face or neck lift",
      "content": "Face or neck lift Face and neck lifts are surgical treatments that can remove excess skin around your jaw and neck, tighten up the area, and remove your double chin. Most surgeries are performed under general anesthesia. During the procedure, your doctor cuts a small incision near your ears to tighten and reposition your skin. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Face and neck lifts are generally recommended for older patients who have significant skin sagging. Depending on the type of lift, surgery may take up to 4 hours. Most patients make a full recovery in 2 to 4 weeks. Face and neck lifts generally come with more risks, including bleeding, scarring, infection, and facial asymmetry. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}