{
  "url": "https://www.wikihow.com/Use-Geofilters-on-Snapchat",
  "title": "Enable Geofilters on Snapchat: Location-based Filters Made Simple",
  "steps": [
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. Before you can find and use geofilters, you'll need to make sure Snapchat can find your location. If Snapchat isn't already open, tap the icon of a white ghost on a yellow background to open it now. Geofilter availability depends on your location."
    },
    {
      "title": "Tap the profile icon.",
      "content": "Tap the profile icon. If you don't have your profile photo set, it'll just be a yellow-and-white outline of a head and shoulders at the top-left corner of the screen."
    },
    {
      "title": "Tap the gear icon .",
      "content": "Tap the gear icon . It's at the top-right corner of the screen. The Settings menu will open."
    },
    {
      "title": "Tap Permissions.",
      "content": "Tap Permissions . You can find this under the Additional Services header."
    },
    {
      "title": "Tap Tap to enable next to \"Location\".",
      "content": "Tap Tap to enable next to \"Location\". Snapchat must have location access to be able to find and use geofilters. A pop-up menu will open."
    },
    {
      "title": "Allow Snapchat location permission.",
      "content": "Allow Snapchat location permission. The steps will vary depending on your device. Once this permission is turned on, you can use geofilters. You can't enable location services for Snapchat if your phone's location services are disabled."
    },
    {
      "title": "Create a Snap.",
      "content": "Create a Snap. Tap the large round button at the bottom-center of the screen to capture a photo, or tap and hold the button to record a video . Once you capture your Snap, a preview will appear. Filters are different from lenses, which are the funny effects you can add to your photo or video when capturing your Snaps. Instead of selecting a geofilter before taking your Snap, you'll apply your geofilter after you capture your photo or video."
    },
    {
      "title": "Swipe left through the filters.",
      "content": "Swipe left through the filters. Swiping across the image or video preview displays different filters over your Snap. Geofilters are the filters that display information about your current location, such as the neighborhood name, weather, altitude, college mascot, or information about a local event. If this is your first time using a Snapchat feature that requires location services, you'll be prompted to enable them now. Tap Allow when prompted, and then follow the on-screen instructions to let Snapchat access your location. If you don't see any geofilters for your town or area, it's likely that nobody in your area has created a geofilter. Geofilter options often change when you travel to various locations. Try traveling to a nearby neighborhood or city if you don't find any in your area."
    },
    {
      "title": "Send the Snap.",
      "content": "Send the Snap. Tap the arrow icon to send the Snap to a friend or group chat, or tap Stories to post the Snap to your Story ."
    },
    {
      "title": "Manually enable your location.",
      "content": "Manually enable your location. If you still aren't getting geofilters in Snapchat, you may need to allow Snapchat location permission through your phone or tablet's settings rather than the app's settings. The steps to do this will vary depending on your device: iPhone and iPad : Open the Settings app and tap Privacy & Security . Tap Location Services , then enable \"Location Services.\" Scroll down and tap Snapchat . Enable \"Precise Location\". Android : On your home screen, tap and hold the Snapchat icon. Tap App info on the menu. Select Permissions . Tap Location and select when you want your location to be available. Toggle on Use precise location . [1] X Research source"
    },
    {
      "title": "Restart the Snapchat app.",
      "content": "Restart the Snapchat app. If you can't find a geofilter you know is supposed to be there, you may just need to restart the app."
    },
    {
      "title": "Restart your phone or tablet.",
      "content": "Restart your phone or tablet. If geofilters aren't working, or you're having any other problems with Snapchat, a quick restart of your Android, iPhone, or iPad can fix minor software bugs."
    },
    {
      "title": "On-Demand geofilters in Snapchat have been discontinued.",
      "content": "On-Demand geofilters in Snapchat have been discontinued. Before February 2023, Snapchat users were able to create and upload their own custom geofilters for specific places or events. [2] X Research source While this feature is no longer available, you can still easily find and use Snapchat-approved location filters."
    }
  ]
}