{
  "url": "https://www.wikihow.com/Wash-Your-Face",
  "title": "The Best Way to Wash Your Face (Plus Product Recommendations)",
  "steps": [
    {
      "title": "A mild cleanser cleans skin gently without irritation.",
      "content": "A mild cleanser cleans skin gently without irritation. No matter what skin type you have, for daily cleansing, pick a face wash that’s fragrance- and alcohol-free. Using cleansers that are too harsh can strip your skin of its natural oils, leading to breakouts and dry skin. [1] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source First, figure out what skin type you have , then check out our cleanser recommendations below: For oily or acne-prone skin: Oil-free cleanser (that won’t clog pores) [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source For dry skin: Hydrating cleanser (to moisturize while you wash) For combination or normal skin: Gentle foaming cleanser (to cleanse dirt and grime gently) For sensitive skin: Fragrance-free cleanser (to avoid irritating skin) For aging skin: Gentle cleanser (to cleanse dirt and grime without drying)"
    },
    {
      "title": "Take off your makeup to avoid clogged pores.",
      "content": "Take off your makeup to avoid clogged pores. Face cleansers are meant to cleanse your skin, not remove makeup. If you like to wear makeup during the day, use a gentle makeup remover on a cotton pad to take everything off before washing your face. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have acne-prone or oily skin, go for a water-based makeup remover (instead of an oil-based one) to avoid clogged pores."
    },
    {
      "title": "Use lukewarm water to gently wet your skin.",
      "content": "Use lukewarm water to gently wet your skin. Hot water strips your skin of its natural oils, and cold water doesn’t remove dirt and grime effectively. Turn your tap to a temperature that’s just above room temp, then splash your face with water. [4] X Research source If you have long hair, pull it back into a bun or ponytail before you start washing your face. This will make it much easier to cleanse your skin."
    },
    {
      "title": "Gently apply face wash to your skin in a circular motion.",
      "content": "Gently apply face wash to your skin in a circular motion. Pour a coin-sized amount of cleanser onto your hands, then rub your palms together to lather it up. Rub the cleanser all over your face, including your cheeks, nose, forehead, chin, and jawline for about 10 seconds. [5] X Research source Using a washcloth or a cleansing device to wash your face might sound like a good idea, but actually, they can be too harsh on your skin. For daily cleansing, just use your hands. Don’t use cleanser around your eyes. The skin there is so delicate that it rarely needs cleansing—just splashing the area with water will do."
    },
    {
      "title": "Be gentle with your skin as you rinse and dry to avoid irritation.",
      "content": "Be gentle with your skin as you rinse and dry to avoid irritation. Use lukewarm water again, and splash it onto your face to rinse off the cleanser. Grab a clean towel and pat your skin dry, trying not to rub or scrub your face. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Rubbing your skin with a towel can be irritating, which can lead to dry skin or acne breakouts. Be sure to dry your skin with a clean towel. Using a dirty towel can introduce bacteria into your skin, which can lead to clogged pores."
    },
    {
      "title": "Use toner to tackle red marks or dark spots.",
      "content": "Use toner to tackle red marks or dark spots. Using a toner is totally optional, and not everyone needs one in their skincare routine. However, using a toner can help smooth out your skin tone and complexion. To add a toner to your skincare routine, pour a pea-sized amount onto a cotton swab and gently rub it into your skin right after cleansing. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For oily or acne-prone skin: Cleansing toner (to prevent breakouts) For dry skin: Hydrating toner (to moisturize throughout the day) For combination or normal skin: Toner with witch hazel and aloe (to smooth skin and close the pores) For sensitive skin: Soothing toner (for hydration without irritation) For aging skin: Toner with vitamin C (to hydrate and plump skin) If you use serums, acne cream, or other products on your skin, now is the time to apply those as well."
    },
    {
      "title": "Apply moisturizer to lock in hydration after cleansing.",
      "content": "Apply moisturizer to lock in hydration after cleansing. Washing your face is very drying, and all skin types need some moisture afterward. Find a moisturizer that’s for your skin type, then rub moisturizer all over your skin with your fingertips. [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source For oily or acne-prone skin: Hydrating gel [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source For dry skin: Thick salve or ointment For combination or normal skin: Moisturizing lotion For sensitive skin: Fragrance-free moisturizer For aging skin: Cream-based moisturizer [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Cleanse your skin in the morning and at night to keep it clean.",
      "content": "Cleanse your skin in the morning and at night to keep it clean. Experts recommend washing your face 2 times per day, or after you sweat. This will help keep your skin clean and avoid oil-buildup and breakouts. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Overwashing your face can be just as damaging as not washing it enough. Although it might seem like a good idea to cleanse your skin more often throughout the day, your face needs its natural oils to function. Try to stick to washing once in the morning and once at night for the best results. If you feel like your skin needs a refresh during the day, splash it with lukewarm water and then pat your face dry. This will help wipe away any excess oil or grime on your skin. Don’t feel like you need to include a whole slew of products in order to have a great routine. Try adding in products one at a time to figure out what works best for you! Reader Poll: We asked 799 wikiHow readers about what products make up their daily skincare routine, and 56% of them shared that they use just water and maybe one product . [Take Poll]"
    },
    {
      "title": "Exfoliating",
      "content": "Exfoliating removes dead skin cells and opens up your pores. Over-exfoliating can be drying and can lead to breakouts, so try to exfoliate instead of washing your face no more than once a week. To exfoliate, wet your skin with lukewarm water, then gently rub a chemical exfoliant or a physical exfoliant onto your skin. Rinse your skin with lukewarm water, pat it dry, then follow up with a moisturizer. [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Chemical exfoliants are better for dry or sensitive skin, and physical exfoliants are better for normal or oily skin. Exfoliating is very drying, so always follow up with a moisturizer afterwards."
    },
    {
      "title": "Use sunscreen to prevent dark marks and hyperpigmentation.",
      "content": "Use sunscreen to prevent dark marks and hyperpigmentation. An important part of your skin care routine is using SPF 30 or higher sunscreen every day. Apply it after your moisturizer and before your makeup (if you wear it) to protect against UV rays when you head outside. [13] X Research source Make sure to reapply your sunscreen every 2 hours, or as often as the bottle tells you to. If you have oily skin, look for an oil-free sunscreen to avoid clogged pores or breakouts. For all other skin types, look for a sunscreen that’s formulated for your face. Remember, UV rays are always there, even on cloudy days! Sunscreen will protect your skin even when you can’t see the sun."
    }
  ]
}