{
  "url": "https://www.wikihow.com/Why-Can%27t-I-Receive-Money-on-Cash-App",
  "title": "8 Simple Things to Try When You Can't Receive Money on Cash App",
  "steps": [
    {
      "title": "The app depends on a reliable internet connection to work.",
      "content": "The app depends on a reliable internet connection to work. If you're in a low-data zone or are constantly going in and out of Wi-Fi networks, the app won't be able to send or receive data over the internet, so you'll get an error. To fix this, improve your internet connection, which might include turning off Wi-Fi to use mobile data only or switching to Wi-Fi instead of data."
    },
    {
      "title": "An out-of-date app version can be preventing you from receiving money.",
      "content": "An out-of-date app version can be preventing you from receiving money. To fix this, update the app through the Google Play Store or App Store ."
    },
    {
      "title": "You can't receive money that you don't have in your Cash app balance.",
      "content": "You can't receive money that you don't have in your Cash app balance. Make sure you have the funds available in Cash app by opening the app and tapping the bank icon. You'll see your Cash balance listed at the top of your screen."
    },
    {
      "title": "A simple typo can cause transactions to fail.",
      "content": "A simple typo can cause transactions to fail. Make sure you have your connected bank information, including your account and routing numbers, entered correctly. To fix this, simply open Cash app, tap the bank icon (bottom left corner), tap your Cash balance, and look at the account and routing numbers there. Compare those numbers to your bank account (you can find this information in their banking app or online after you sign in). If anything is wrong, tap your profile picture and tap Linked Banks . Tap your bank account and tap Remove or Replace with the corrected information."
    },
    {
      "title": "If you're receiving money through Instant Pay, your debit card cannot be expired.",
      "content": "If you're receiving money through Instant Pay, your debit card cannot be expired. To fix this, you can request a new card from your bank and you can request that the money from Cash be transferred to you the standard way, which will take a little longer to get to you. [1] X Research source Although receiving money the standard way takes a few more days to get to you instead of instantly, it's much faster than waiting for your bank to send you a new debit card."
    },
    {
      "title": "Especially if you're new to Cash app, you'll need to follow a few prompts first.",
      "content": "Especially if you're new to Cash app, you'll need to follow a few prompts first. Simply tap on the transaction in question (it's usually pending ) and follow the on-screen prompts to receive your money. [2] X Research source"
    },
    {
      "title": "Most accounts have a $25,000 weekly Cash Out limit.",
      "content": "Most accounts have a $25,000 weekly Cash Out limit. Although your Cash App account can receive unlimited amounts of money, you can only Cash Out a limited amount. [3] X Research source Cash App is mainly available in the US and UK, so if you're not in those countries, you might run into issues using the app."
    },
    {
      "title": "If you can't figure out why your app isn't letting you Cash Out, contact Cash App.",
      "content": "If you can't figure out why your app isn't letting you Cash Out, contact Cash App. You can contact them using the app or on their website. [4] X Research source"
    }
  ]
}