{
  "url": "https://www.wikihow.com/Write-a-Free-Verse-Poem",
  "title": "How to Write a Free Verse Poem",
  "steps": [
    {
      "title": "Choose a subject or theme.",
      "content": "Choose a subject or theme. Maybe you’d like to write a poem about your new baby brother or your favorite pet rock. You can also focus on a specific event like your last birthday party, or a theme like love, anger, or sadness. [1] X Expert Source Alicia Cook Professional Writer Expert Interview. 11 December 2020. If you're having trouble choosing a subject, try closing your eyes and visualizing events, people, or objects that are meaningful to you. Select one that stands out, particularly if it is one that you have an emotional connection to. Reader Poll: We asked 485 wikiHow readers what type of emotion they draw the most inspiration from, and 46% of them said sadness. [Take Poll]"
    },
    {
      "title": "Think about how you may want to approach the topic or subject.",
      "content": "Think about how you may want to approach the topic or subject. Are you going to write from a certain point of view, like first person or third person? Are you focusing on the specific scene or are you going to write more generally about a certain theme? It can be helpful to decide ahead of time what you want to say about the topic; if writing about a beloved deceased pet, your goal may be to recapture the pet's personality and character in your poem. You may also want to consider how you can choose certain wording or phrasing to describe the subject, situation, or theme you are trying to portray. If you are trying to describe a fight scene, for example, you may want to use short words with sharp consonants like cut, bash, hit, kick, punch, jab, jump. Keep in mind longer words with soft sounds, as well as breaks between lines or words, will cause the reader to slow down."
    },
    {
      "title": "Write down a list of key words or images that relate to your subject or theme.",
      "content": "Write down a list of key words or images that relate to your subject or theme. Because you don’t need to be too worried about rhyming, meter, or structure, feel free to explore your topic and write down as many images and descriptions as you can think of. For example, if you are describing your last birthday party, you may start by describing who was at the party, the gifts you received, and how you felt during the party. Or you may decide to write a poem about your pet rock and imagine how the rock would see the world. If you’re stuck on how to describe a certain event or feeling, use sensory descriptions that explore sight, touch, taste, smell, and sound. So instead of simply writing, “I blew out the candles,” you may want to include sensory details like the heat of the candles on the cake, the smell of burning wax, and the way the candles on the cake looked right before you blew them out. [2] X Research source"
    },
    {
      "title": "Create a first draft.",
      "content": "Create a first draft. Use the list of keywords to help you describe a scene or explore a theme. Focus on using devices like metaphor, simile, alliteration, and personification. These devices will help you to create a stronger, more effective free verse poem. [3] X Research source Don’t worry too much about creating a perfect first draft, as you will edit and revise it in your next draft."
    },
    {
      "title": "Revise and edit the draft.",
      "content": "Revise and edit the draft. Read your first draft out loud and take note of any lines or sections that have a certain rhythm or tone, as well as any lines where a word or phrase sounds off or flat. [4] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Look at places where you could expand or improve on a description. For example, instead of telling the reader, “they were happy” you could use a more visual description, such as “they were wearing big smiles.” Also remember that poetry does not necessitate the use of complete sentences, so \"they were wearing big smiles\" might be shortened to \"wearing big smiles.\" A poem can have logic without using complete sentences. Think about how the breaks between words or lines affects the meaning of the poem. If you’re describing a roller coaster ride, maybe you want to play around with the line structure and have words move up or down the page. Or if you’re describing a moment where you felt trapped or claustrophobic, perhaps you want to condense the lines so they appear as one block of text. [5] X Research source"
    },
    {
      "title": "Read your final draft to someone else before you hand it in.",
      "content": "Read your final draft to someone else before you hand it in. It can be difficult to view your poem with a careful eye, especially if you have been working hard on it and have created several drafts. So don’t be afraid to read it aloud to a willing audience and listen to their feedback. [6] X Research source The goal is to create a free verse poem that explores your subject or theme in a unique way that sounds good and has emotion or feeling. Be sure to ask your audience if they think your poem has all of these elements."
    },
    {
      "title": "Feel free to express yourself, but don’t forget you are still writing a poem.",
      "content": "Feel free to express yourself, but don’t forget you are still writing a poem. Technically, there is no set structure to a free verse poem, as there are no rules around meter or rhyme scheme. So, you have the freedom to express yourself in almost any way you can imagine. But, some poets argue that the lack of rules can actually be more difficult and challenging, or as the poet Robert Frost describes the difficulty of composing a free verse poem, it’s like “playing tennis without a net.” [7] X Research source Though there are no rules for a free verse poem, it is still a form of artistic expression, so its important to create striking images and emotions that your reader can see and feel and to express yourself clearly."
    },
    {
      "title": "Look at several examples of effective free verse poetry.",
      "content": "Look at several examples of effective free verse poetry. Though free verse may not have been Robert Frost’s preference, many other poets have used the openness of the form to their advantage and have approached free verse poetry in their own unique ways. It may be useful for you look at several examples more closely, including: \"After the Sea\" by Walt Whitman [8] X Research source \"Little Father\" by Li-Young Lee [9] X Research source \"Winter Poem\" by Nikki Giovanni [10] X Research source \"Fog\" by Carl Sandberg [11] X Research source \"in Just-\" by e.e. cummings [12] X Research source"
    },
    {
      "title": "Analyze the examples.",
      "content": "Analyze the examples. Read the examples out loud and consider how they are effective. Do they have a certain rhythm or meter, despite appearing free verse and not using rhyme? Do they create strong images through description, word choice, or a certain mood or tone? Identify any metaphors or similes. [13] X Research source Think about how they work effectively to reveal details or create images associated with the subject of the poem. Make note of any examples of alliteration, which is a literary device where the first sound in a series of words is the same. Alliteration is one way the poet can create a particular mood, feeling, or sound to the poem. [14] X Research source For example, in Whitman’s poem \"After the Storm\", there are two instances of alliteration in the first line of the poem, “sea-ship” and “whistling winds”, which then set the tone for the rest of the poem. Identify any personification. Personification is a device that takes an inanimate object and describes it as though it were animate or alive. [15] X Research source For example, in Sandberg’s \"Fog\", the fog is personified as having “little cat feet”, and in Giovanni’s \"Winter Poem\", the snowflake is personified as “happy” and the other snowflakes are addressed as “its cousins and brothers.” Consider if the poem breaks with the traditional form of a line poem, and how the poem’s form adds to the overall meaning or theme of the poem. For example, in e.e. cumming’s poem \"in Just-\", the breaking up of the lines so there is more space between certain words and the arrangement of certain words so they move down the page suggest a certain choppiness or shift downward in the poem."
    }
  ]
}