{
  "url": "https://www.wikihow.com/Use-an-Offset-Smoker",
  "title": "Offset Smoker 101: How to Use It & Cook Flavorful Food",
  "steps": [
    {
      "title": "Season the smoker if necessary.",
      "content": "Season the smoker if necessary. If you're using a new offset smoker, wipe down the entire smoker with soapy water. Rinse the smoker to wash away any dust, grease, or shavings. Let the smoker dry and then spritz vegetable oil over the inside of the cooking chamber. Open all of the vents on the smoker and light a fire in the firebox. Burn a fire for 30 minutes with the vents open. [1] X Research source Let the fire die out and cool the smoker to use another time. Or use the smoker once it's burned hot for 30 minutes. Keep in mind that this is just a rough estimate. Actual time can depend on the wood, the humidity, the altitude, amongst other factors."
    },
    {
      "title": "Set two temperature probes in the smoker.",
      "content": "Set two temperature probes in the smoker. Buy two digital air probes that you can insert into the cooking chamber. Place one probe near your food at each end of the cooking chamber for the most accurate readings. Use probes attached to wires if you'd like to be able to move them, or mount the probes onto the grates of the cooking chamber. [2] X Research source Avoid relying on the built-in thermometer at the top of the smoker's lid. This thermometer measures the temperature that's on top of the grill instead of the space where your food is smoking."
    },
    {
      "title": "Open the air intake vent and chimney vent.",
      "content": "Open the air intake vent and chimney vent. Since fire needs oxygen, open the air intake vent on the side of the firebox. You'll also need to open the vent on the chimney, so smoke can be released. [3] X Research source The vents can also be called dampers or baffles. You'll adjust these during the smoking process to regulate heat and smoke within the smoker."
    },
    {
      "title": "Light a chimney full of briquettes.",
      "content": "Light a chimney full of briquettes. Fill a chimney starter full of charcoal briquettes and light them. Heat the briquettes until they begin to glow and ash over. This should take about 15 minutes. [4] X Research source"
    },
    {
      "title": "Spread the coals in the firebox and close the lid.",
      "content": "Spread the coals in the firebox and close the lid. Once the briquettes are lightly ashy and hot, dump them into the firebox. If you want to add flavor to the smoke, include one or two logs of hardwood--the options include hickory, mesquite, apple, and maple. Close the lid on the firebox and cooking chamber. [5] X Research source Avoid making the fire completely with wood because it's hard to regulate and maintain over a long period of time."
    },
    {
      "title": "Bring the smoker up to temperature.",
      "content": "Bring the smoker up to temperature. Monitor the temperature inside the cooking chamber until it gets as hot as you'd like. Most people prefer to smoke food between 225 째F (107 째C) and 275 째F (135 째C). Keep the firebox and cooking chamber doors closed while you're preheating the smoker. [6] X Research source"
    },
    {
      "title": "Arrange your food on the grill grate.",
      "content": "Arrange your food on the grill grate. Place the food you want to smoke on the racks in the cooking chamber. If you like, put cold meat directly into the smoker without bringing it to room temperature first since it will absorb more smoke when it's cold. Close the lid of the cooking chamber. [7] X Research source"
    },
    {
      "title": "Add briquettes to the firebox to maintain the fire.",
      "content": "Add briquettes to the firebox to maintain the fire. If you need to maintain the heat in the smoker or bring it higher, add unlit charcoal briquettes to the firebox. Use a grill hoe to scoot the ashy coals to one side to make room for half a chimney full of new briquettes on the other side. [8] X Research source You'll need to check the temperature and firebox every 30 minutes or so to ensure that the fire is still going."
    },
    {
      "title": "Increase the heat in the smoker, if necessary.",
      "content": "Increase the heat in the smoker, if necessary. If the temperature inside the cooking chamber is dropping or stalling and you've already added new briquettes, add a log of wood to the firebox. Open the air intake vent on the side of the firebox to really get the fire going nice and hot. For an extreme increase in temperature, you can also open the chimney vent. Close the vents as soon as the smoker is at the right temperature. [9] X Research source Keep an eye on the smoker temperature while the vents are open. You'll only need to keep the vents open for one to two minutes to bring the heat up."
    },
    {
      "title": "Reduce the temperature in the smoker, if necessary.",
      "content": "Reduce the temperature in the smoker, if necessary. If the temperature inside the cooking chamber is getting too hot, ensure that the vents are closed. If the temperature is still high, open the cooking chamber lid for about a minute. This will drop the temperature quickly. [10] X Research source"
    },
    {
      "title": "Add a few wood chunks to the firebox.",
      "content": "Add a few wood chunks to the firebox. Place 1 to 2 large chunks of wood for smoking into the firebox every hour or so. Set the wood next to the fire, so it smolders instead of burns quickly. Avoid using wood chips because these will burn off too quickly. [11] X Research source Use hardwoods, fruitwoods, or nutwoods to get the best flavored smoke for your food. You don't need to soak the wood since the moisture might cool off the coals in the firebox."
    },
    {
      "title": "Rotate the food once an hour.",
      "content": "Rotate the food once an hour. Every hour, open the cooking chamber lid and use tongs to move the food. Turn the food so that pieces at the cooler side of the cooking chamber are moved nearer to the firebox. [12] X Research source If you're smoking a single, large piece of meat, it's still important to rotate the meat so it smokes evenly."
    },
    {
      "title": "Place a pan of water in the firebox.",
      "content": "Place a pan of water in the firebox. If you're worried that your food will dry out over a long smoking session, introduce moisture into the firebox. Set a metal rack over the coals in the firebox. Fill a disposable aluminum pan with water and set the pan on the rack. The smoke will become moist before it flows into the cooking chamber. [13] X Research source"
    },
    {
      "title": "Spray the food to keep it moist.",
      "content": "Spray the food to keep it moist. Add moisture by spraying the food with apple juice, water, or beer. Fill a clean spray bottle with your liquid and spritz the food towards the end of the smoking session. Spritz the food when it starts to look dry. Spray the food every 15 minutes or so by the end of the smoking session. [14] X Research source"
    }
  ]
}