{
  "url": "https://www.wikihow.com/Use-Facebook",
  "title": "How to Use Facebook",
  "steps": [
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. Go to https://www.facebook.com/ in your computer's web browser, or tap the Facebook app icon if you're on mobile. This will bring you to the Facebook login page if you aren't currently logged into a Facebook account. If you haven't yet downloaded the Facebook app for your iPhone or Android , you can do so for free."
    },
    {
      "title": "Create a Facebook account",
      "content": "Create a Facebook account . You can do this both on the desktop version of Facebook and in the Facebook mobile app."
    },
    {
      "title": "Go to your Facebook page.",
      "content": "Go to your Facebook page. This will differ slightly depending on whether you're using a computer or a mobile item (e.g., a smartphone): Desktop - Click the tab with your name on it in the upper-right side of the window. Mobile - Tap ☰ in the lower- or upper-right corner of the screen, then tap your name at the top of the resulting menu."
    },
    {
      "title": "Add a profile picture.",
      "content": "Add a profile picture. You can add a picture of yourself (or anything else) to your profile so that other users can identify you: Desktop - Click Add Photo in the upper-left side of your Facebook profile, click Upload Photo , select a photo from your computer, and click Open . Mobile - Tap the square profile picture icon at the top of the page, tap Select Profile Picture , tap a photo that you want to use, and tap Use . You can also add a photo to the top of your Facebook profile by clicking or tapping Add Cover Photo , clicking Upload Photo (desktop) or tapping Change Cover Photo (mobile), and selecting a photo from your computer or mobile platform."
    },
    {
      "title": "Edit your account information.",
      "content": "Edit your account information. If you didn't add certain information while setting up your Facebook account (or you want to remove some of the stuff that you did add), you can do so from your profile page: Desktop - Click About below your cover photo area, click a subject below the \"About\" heading on the left side of the page (e.g., Places You've Lived ), hover your mouse over an item and click Edit when it appears, and edit the item. Mobile - Scroll down and tap About just above the \"What's on your mind?\" text box, tap the \"Edit\" pencil icon to the right of an item, tap the Edit option, and edit the item."
    },
    {
      "title": "Save any changes.",
      "content": "Save any changes. Click or tap Save on the page on which you made your changes to save them and apply them to your profile. Now that you've set up your Facebook account, it's time to add some friends ."
    },
    {
      "title": "Select the search bar.",
      "content": "Select the search bar. Click or tap the search bar that's at the top of the page or screen. This will place your cursor in the search bar, and your on-screen keyboard will appear if you're on mobile."
    },
    {
      "title": "Enter a friend's name.",
      "content": "Enter a friend's name. Type in the name of a person whom you want to add as a friend on Facebook, then click or tap the name that you just typed when it appears below the text box. You can also press ↵ Enter or tap Search as soon as you're done typing to search."
    },
    {
      "title": "Select your friend.",
      "content": "Select your friend. Once you find the profile for the friend in question, click their profile picture to open their public profile page. Skip this step on mobile."
    },
    {
      "title": "Click or tap Add Friend.",
      "content": "Click or tap Add Friend . It's near the top of the page (desktop) or to the right of the friend's name (mobile). Doing so will send a friend request to the person; if they accept it, you'll be able to see their Facebook profile and posts."
    },
    {
      "title": "Use Facebook's suggested friends.",
      "content": "Use Facebook's suggested friends. Facebook will come up with a list of recommended friends for you. This is most relevant when you've added a few friends already, but you can view suggested friends at any time: Desktop - Click your name tab, click Friends below the cover photo, click ＋ Find Friends , and click Add Friend next to each friend whom you want to add. Mobile - Tap ☰ , tap Friends , tap the Suggestions tab, and tap Add Friend next to each friend whom you want to add."
    },
    {
      "title": "Add more friends.",
      "content": "Add more friends. Facebook is at its best when you have several friends with whom you can connect, so feel free to search for as many friends as you like. Once you've added a sufficient number of friends, you can move on to posting information."
    },
    {
      "title": "Go back to your profile.",
      "content": "Go back to your profile. Click your name tab in the upper-right corner of the Facebook window to do so."
    },
    {
      "title": "Click the status text box.",
      "content": "Click the status text box. This text box, which usually has \"What's on your mind?\" written in it, is in the middle of the page, just below the cover photo and list of tabs. Doing so opens the status text box."
    },
    {
      "title": "Create your post.",
      "content": "Create your post. The basis of any status is text, which you can add by typing into the status box, but you may want to add other elements to your post as well: You can add a photo to the post by clicking Photo/Video below the text box and then selecting the proper photo or video file from your computer. To tag a friend in the post, type @ followed by the first few letters of their name, then click their name in the menu that appears. You can also check into a location by clicking Check in below the text box and then entering an address."
    },
    {
      "title": "Change your post's privacy if desired.",
      "content": "Change your post's privacy if desired. By default, your posts will only be available for your friends to see, but you can change this by clicking the Friends drop-down box to the left of the Post button and then clicking a different privacy setting."
    },
    {
      "title": "Click Post.",
      "content": "Click Post . It's at the bottom of the status window. Doing so will create your post and add it to your profile page."
    },
    {
      "title": "Comment on other people's posts.",
      "content": "Comment on other people's posts. If you're friends with someone, you can click Comment below a post that they make and then enter a comment to add below their original post. Any friends who see your content will see this post in their News Feed pages as well."
    },
    {
      "title": "Go back to your profile.",
      "content": "Go back to your profile. Tap ☰ in the lower- or upper-right corner of the screen, then tap your name at the top of the resulting menu."
    },
    {
      "title": "Scroll down and tap the status box.",
      "content": "Scroll down and tap the status box. It's below the section of tabs that are under your profile picture. Doing so opens the Status text box and brings up your mobile platform's on-screen keyboard."
    },
    {
      "title": "Create your post.",
      "content": "Create your post. The basis of any status is text, which you can add by typing into the status box, but you may want to add other elements to your post as well: You can add a photo to the post by tapping Photo/Video below the text box and then selecting the proper photo or video file. To tag a friend in the post, type @ followed by the first few letters of their name, then tap their name in the menu that appears. You can also check into a location by tapping Check in below the text box and then entering an address."
    },
    {
      "title": "Change your post's privacy if desired.",
      "content": "Change your post's privacy if desired. By default, your posts will only be available for your friends to see, but you can change this by tapping the Friends drop-down box in the upper-left side of the text area and then tapping a new privacy setting (e.g., Public or Only me ) and tapping Done ."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . It's in the top-right corner of the screen. Doing so will create your post and add it to your profile page."
    },
    {
      "title": "Comment on other people's posts.",
      "content": "Comment on other people's posts. If you're friends with someone, you can tap Comment below a post that they make and then enter a comment to add below their original post. Any friends who see your content will see this post in their News Feed pages as well."
    },
    {
      "title": "Go to the News Feed.",
      "content": "Go to the News Feed. Click the f icon in the upper-left side of the Facebook page to do so."
    },
    {
      "title": "Click Photo/Video.",
      "content": "Click Photo/Video . You'll find this green-and-white icon near the top of the News Feed."
    },
    {
      "title": "Select a photo or video from your computer.",
      "content": "Select a photo or video from your computer. In the File Explorer (Windows) or Finder (Mac) window that opens, go to the location of the picture that you want to upload, then click it once. To select multiple photos or videos at once, hold down Ctrl (Windows) or ⌘ Command (Mac) while clicking each photo/video you want to upload."
    },
    {
      "title": "Click Open.",
      "content": "Click Open . It's in the bottom-right corner of the window. Your image(s) and/or video(s) will upload to Facebook."
    },
    {
      "title": "Add text to your post if you like.",
      "content": "Add text to your post if you like. While unnecessary, you can add text to your post by clicking the \"Say something about...\" text box above the photo(s)/video(s) and typing in your text."
    },
    {
      "title": "Click Post.",
      "content": "Click Post . It's at the bottom of the status box. Doing so will create your post and add it to your profile page. Any friends who see your content will see this post in their News Feed pages as well."
    },
    {
      "title": "Go to the News Feed.",
      "content": "Go to the News Feed. Tap twice the square \"News Feed\" icon in the bottom-left (iPhone) or top-left (Android) corner of the screen."
    },
    {
      "title": "Tap Photo.",
      "content": "Tap Photo . It's near the top of the News Feed page. Doing so opens a list of your phone's (or tablet's) photos and videos. On Android, the Photo option is in the upper-right side of the News Feed page."
    },
    {
      "title": "Select a photo or video.",
      "content": "Select a photo or video. Tap the item that you want to upload to Facebook to do so. To select more than one photo or video at a time, tap each video/photo that you want to upload."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . It's in the top-right corner of the screen. Your photo(s)/video(s) will begin uploading to Facebook."
    },
    {
      "title": "Add text to your post if you like.",
      "content": "Add text to your post if you like. While unnecessary, you can add text to your post by tapping the text box above your photos and typing in your text."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . It's in the top-right corner of the screen."
    },
    {
      "title": "Tap the \"News Feed\" checkbox.",
      "content": "Tap the \"News Feed\" checkbox. You'll see this in a pop-up window at the bottom of the screen. This ensures that your post will go straight to your profile and News Feed."
    },
    {
      "title": "Tap Share Now.",
      "content": "Tap Share Now . It's at the bottom of the screen. Doing so will create your post and add it to your profile page. Any friends who see your content will see this post in their News Feed pages as well."
    },
    {
      "title": "Like your friends' posts",
      "content": "Like your friends' posts . \"Liking\" posts is a way of interacting with your friends' content in order to show your appreciation for it. There are also several reactions that you can use in addition to the standard \"thumbs-up\" icon one sees on Facebook."
    },
    {
      "title": "Add GIFs to Facebook",
      "content": "Add GIFs to Facebook . GIFs, which are animated images, can be added both to your Facebook posts and to your comments. Facebook includes a large database of GIF reactions specifically for comments."
    },
    {
      "title": "Chat with your friends",
      "content": "Chat with your friends . Facebook has a built-in chat feature that you can use to keep in touch with your other Facebook friends. You can also install the Facebook Messenger app for your iPhone or Android if you want to chat with Facebook friends on your mobile item."
    },
    {
      "title": "Treat other people well and stay safe.",
      "content": "Treat other people well and stay safe. Remember not to give out personal information to strangers, and make sure you treat everyone with the courtesy and respect they deserve."
    },
    {
      "title": "Create a Facebook page",
      "content": "Create a Facebook page . Facebook pages are non-personal pages dedicated to a theme, location, or concept. You can use Facebook pages for anything from artist appreciation to business, and you can create as many free pages as you like."
    },
    {
      "title": "Get fans for your Facebook business page",
      "content": "Get fans for your Facebook business page . If you have a Facebook page for your business , organization, art, or anything else, you can employ some practices to gain more fans, which in turn leads to more exposure for your work."
    },
    {
      "title": "Advertise on Facebook",
      "content": "Advertise on Facebook . Facebook is a powerful tool that you can use to advertise your business to millions of potential customers, and the first step in doing so is creating a set of ads. Keep in mind that Facebook advertising isn't as popular as it used to be; if you have another platform on which you can advertise, it might be better to try out your ads there instead."
    },
    {
      "title": "Prevent Facebook tracking",
      "content": "Prevent Facebook tracking . If you're worried about Facebook tracking your activity, you aren't alone. Thankfully, you can cut down on the amount of data that Facebook has about you in order to limit its tracking."
    }
  ]
}