{
  "url": "https://www.wikihow.com/Unhide-Apps-on-iPhone",
  "title": "7 Easy Methods to Unhide Hidden Apps on iPhone",
  "steps": [
    {
      "title": "Open the App Store.",
      "content": "Open the App Store. If you’ve hidden apps using the App Store, you can restore them by re-downloading them. To get started, tap the icon on your Home Screen. [1] X Research source"
    },
    {
      "title": "Tap your profile picture at the top of the screen.",
      "content": "Tap your profile picture at the top of the screen. If you don’t have a profile pic, tap the Account Button . It looks like a circle with a grey silhouette of a head and shoulders inside. This will open an Account screen. [2] X Research source"
    },
    {
      "title": "Scroll down and select Hidden Purchases.",
      "content": "Scroll down and select Hidden Purchases . You’ll find this under the subheading Downloads and Purchases . Tap it to open a screen showing all the apps you’ve hidden. [3] X Research source You can also find apps you’ve hidden or uninstalled by searching for them by name in the App Store. Tap the Search button at the bottom right corner of the screen to open a search screen."
    },
    {
      "title": "Re-download the app to unhide it.",
      "content": "Re-download the app to unhide it. Scroll through the list until you find the app you want, then tap the Download button next to it. This will re-download the app onto your phone. [4] X Research source You might also see a cloud icon next to the app name. If you paid for the app, you won’t need to purchase it a second time."
    },
    {
      "title": "Swipe through your Home Screens to find the App Library.",
      "content": "Swipe through your Home Screens to find the App Library. The App Library is a screen where all your apps are organized into groups by category. If an app has downloaded straight into the library or you’ve moved it into the App Library from your Home Screen, it can be a bit of a challenge to find it. Start by swiping right through your Home Screen pages until the App Library pops up. [5] X Research source The App Library has a search bar at the top with the words App Library in it. The apps are arranged in grey boxes with smaller app icons inside."
    },
    {
      "title": "Search for the name of the app you’re looking for.",
      "content": "Search for the name of the app you’re looking for. Tap the search field at the top of the screen. This will open an alphabetical list of all your apps. You can also use the keyboard to type in the name of the app you want. [6] X Research source"
    },
    {
      "title": "Tap and hold the app icon.",
      "content": "Tap and hold the app icon. This will cause a context menu to pop up with various options related to the app. [7] X Research source"
    },
    {
      "title": "Select Add to Home Screen.",
      "content": "Select Add to Home Screen . If the app doesn’t already appear on your Home Screen somewhere, this will be in the list of options in the context menu. Tap it to create an app icon on your Home Screen. [8] X Research source You can also tap and hold the icon, then drag it to the left to move it from the library to the Home Screen. Tap Done in the upper right corner of the screen to confirm the change."
    },
    {
      "title": "Change your settings to keep new apps from going to the library.",
      "content": "Change your settings to keep new apps from going to the library. Since the release of iOS 14, newly downloaded apps automatically appear in the App Library instead of on the Home Screen. To keep this from happening: [9] X Research source Open Settings . Scroll down to Home Screen . Under Newly Downloaded Apps , select Add to Home Screen . New apps will still show up in the App Library, but they’ll also appear on your Home Screen."
    },
    {
      "title": "Tap and hold an empty spot on any Home Screen page.",
      "content": "Tap and hold an empty spot on any Home Screen page. If a bunch of your app icons have gone missing all at once, it’s possible you’ve hidden the Home Screen page where they used to appear. To find it, go to any Home Screen page and tap and hold any spot until the icons start jiggling. [10] X Research source"
    },
    {
      "title": "Select the row of dots at the bottom of the screen.",
      "content": "Select the row of dots at the bottom of the screen. This will open up a display of all your Home Screen pages, including ones that you’ve hidden. Scroll through the list until you find the page you want. [11] X Research source Hidden pages will have an empty circle beneath them, while unhidden pages will have a checkmark underneath."
    },
    {
      "title": "Touch the circle under the page you want to unhide.",
      "content": "Touch the circle under the page you want to unhide. A checkmark will appear in the empty circle beneath the page. When you’re finished, tap Done in the upper right corner of the screen. [12] X Research source"
    },
    {
      "title": "Tap the folder with the app in it to open it.",
      "content": "Tap the folder with the app in it to open it. It’s easy to accidentally bundle apps into folders, making them harder to spot on your Home Screen. To get the apps out of their folders, start by tapping on the folder to expand it. [13] X Research source"
    },
    {
      "title": "Touch and hold the app until it starts to jiggle.",
      "content": "Touch and hold the app until it starts to jiggle. Once the folder is open, tap the app you want to take out of the folder. Instead of releasing the icon right away, hold it until the icons in the folder start jiggling. [14] X Research source"
    },
    {
      "title": "Drag and drop the app from the folder to the Home Screen.",
      "content": "Drag and drop the app from the folder to the Home Screen. Simply pull the app out of the folder and place it anywhere on the Home Screen. When you’re finished, tap Done in the upper right corner of the screen. [15] X Research source"
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. Resetting your Home Screen will display all the apps you’ve downloaded on the Home Screen in alphabetical order. It will also get rid of any folders you’ve created. Go to your Home Screen and tap the Settings icon to get started. [16] X Research source"
    },
    {
      "title": "Select General.",
      "content": "Select General. Scroll down in the Settings menu until you find General , then tap on it to open a new menu. [17] X Research source"
    },
    {
      "title": "Tap Transfer or Reset iPhone.",
      "content": "Tap Transfer or Reset iPhone . You’ll find this option near the bottom of the menu. [18] X Research source"
    },
    {
      "title": "Select Reset.",
      "content": "Select Reset . At the bottom of the screen, find the Reset option and tap on it. A new menu will pop up at the bottom of the screen. [19] X Research source"
    },
    {
      "title": "Choose Reset Home Screen Layout.",
      "content": "Choose Reset Home Screen Layout . When you do this, a dialog box will pop up giving you the option to either Reset Home Screen or Cancel . Select Reset Home Screen to go ahead with the changes. [20] X Research source"
    },
    {
      "title": "Go into the Settings app.",
      "content": "Go into the Settings app. iPhone’s built-in parental controls allow you to temporarily hide built-in apps. You can toggle hidden apps on and off in Screen Time . To get started, open up Settings . [21] X Research source"
    },
    {
      "title": "Select Screen Time.",
      "content": "Select Screen Time . Scroll down in the Settings menu and tap on Screen Time to open the parental controls menu. [22] X Research source"
    },
    {
      "title": "Tap Content & Privacy Restrictions.",
      "content": "Tap Content & Privacy Restrictions . At this point, you may be prompted to enter your Screen Time passcode. This will take you to a menu of Screen Time’s privacy settings. [23] X Research source"
    },
    {
      "title": "Select Allowed Apps.",
      "content": "Select Allowed Apps . You’ll find Allowed Apps near the top of the menu. Tap on it to open a list of all the built-in apps on your iPhone. [24] X Research source"
    },
    {
      "title": "Toggle on any apps you want to unhide.",
      "content": "Toggle on any apps you want to unhide. Each app in the list will have a toggle button next to it. Tap the toggle button next to any hidden apps that you want to turn back on. [25] X Research source Once you turn an app back on, the toggle will move to the right and the button will turn green ."
    },
    {
      "title": "Use the spotlight search to find apps on your phone.",
      "content": "Use the spotlight search to find apps on your phone. To open your iPhone’s built-in search function, either keep swiping left on your Home Screen or swipe down from the top of the screen until a search field appears. Type in the name of the app you’re looking for. If it’s on your phone, it should pop up in the search results. [26] X Research source It’s possible to restrict which apps appear in your search results. If you think an app may be hidden from search, go to Settings , then tap Siri & Search . Scroll down to the list of apps. Select the app you want and make sure that Show in Search is switched on."
    },
    {
      "title": "Ask Siri to open an app for you.",
      "content": "Ask Siri to open an app for you. If you’re pretty sure you have an app, but you’re having trouble finding it, you can ask Siri to open the app for you. Say something like, “Hey Siri, open iTunes.”"
    },
    {
      "title": "Do a search in the App Store.",
      "content": "Do a search in the App Store. If you’ve already downloaded an app, you’ll be able to tell by looking at its page in the App Store. Open the App Store app and tap the Search icon in the bottom right corner of the screen. Type in the name of the app you’re looking for in the text box at the top of the screen. [27] X Research source If you’ve already downloaded the app and it’s on your phone, you’ll see an OPEN button next to the title of the app. If you’ve downloaded the app before but it isn’t currently installed on your phone, a Download button will appear next to it. Apps that you’ve never installed or purchased before will display a GET button (for free apps) or a button with the price of the app."
    }
  ]
}