{
  "url": "https://www.wikihow.com/Style-Curly-Hair-(for-Men)",
  "title": "How to Style Curly Hair (for Men)",
  "steps": [
    {
      "title": "Keep your hair cropped if you have tight curls.",
      "content": "Keep your hair cropped if you have tight curls. Tight curls are noticeable even when your hair is cut short. Think about how Justin Timberlake cut his hair to control his curls. Ask your stylist to crop your hair if you want to maintain a clean appearance. [1] X Research source Get your haircut when it is dry. When your hair is curly, wet hair does not provide a good representation of how your hair looks dry."
    },
    {
      "title": "Get an undercut to keep the curls on top of your head.",
      "content": "Get an undercut to keep the curls on top of your head. Trim the sides and back of your head shorter and leave your curls on top. This way, you don’t have to worry about controlling a full head of hair and it will be easier to style. [2] X Research source The sides and back of your hair can be faded into your curls or have a defined line where they separate."
    },
    {
      "title": "Twist your curls around your finger to define them.",
      "content": "Twist your curls around your finger to define them. Wrap small sections of your curls tightly around your finger and form them in different directions. This helps make your curls look natural rather than having them styled. [3] X Research source Avoid using a curling iron since the heat could damage your hair."
    },
    {
      "title": "Use a pomade to control your curls.",
      "content": "Use a pomade to control your curls. Work a pomade through your hair to keep it out of your face and lock moisture into your hair. A cream or liquid based pomade works best to give your hair shine. [4] X Research source"
    },
    {
      "title": "Shampoo once or twice a week.",
      "content": "Shampoo once or twice a week. Pick a moisturizing, sulfate-free shampoo so it adds moisture to your hair. The natural oils in your hair keep your curls shiny and weighed down. Shampooing too often can dry your hair out and make your curls more frizzy. [5] X Research source Shampoos that contain sulfates are too drying for curly hair. They can leave your curls looking dull and frizzy. [6] X Research source Avoid using clarifying shampoos since they remove the most moisture from your hair. On days where you don’t shampoo, only rinse your hair with water when you bathe."
    },
    {
      "title": "Use leave-in conditioner 3 times a week to moisturize your hair.",
      "content": "Use leave-in conditioner 3 times a week to moisturize your hair. Make sure your hair is slightly damp when you apply the conditioner so more moisture locks in. Work the conditioner into your hair with your fingers, being sure to reach it down to your scalp. Once you apply the conditioner, you can either style your hair or blow dry it. [7] X Research source Longer hair will require more conditioner since it’s easier for the ends to become damaged. [8] X Research source"
    },
    {
      "title": "Opt for wide toothed combs rather than fine-toothed combs.",
      "content": "Opt for wide toothed combs rather than fine-toothed combs. Pick a wide-toothed comb to work your curls without damaging them. Fine-toothed combs will catch snags in your hair as well as make your curls frizzy. [9] X Research source Fine-toothed combs can also rip out your hair follicles and make you lose your hair faster. You can also work your hair with your hands to avoid using a comb altogether."
    },
    {
      "title": "Don’t be aggressive when you use a towel.",
      "content": "Don’t be aggressive when you use a towel. Use a microfiber towel since they are more gentle with your hair. Pat your hair dry instead of vigorously rubbing it with the towel. Being rough with a towel can pull and tangle your hair. [10] X Research source If you have the time, it’s best to let your hair air dry. If you shower at night, wrap your hair in a microfiber towel or old T-shirt while you sleep."
    },
    {
      "title": "Dry your hair with the diffuser attachment on a blow dryer if necessary.",
      "content": "Dry your hair with the diffuser attachment on a blow dryer if necessary. Though it’s best to let your hair air dry, if you’re in a rush you can blow dry it with low heat. Use the diffuser attachment so it works into your hair and dries it more thoroughly. The diffuser attachment will help set and define your curls, as well as control frizziness. [11] X Research source Using heat on your curls will dry your hair out, especially if you have used mousse or alcohol-based products. Fight the dryness of your hair with conditioner."
    },
    {
      "title": "Apply an anti-frizz serum in your hair.",
      "content": "Apply an anti-frizz serum in your hair. Purchase an anti-frizz serum from your hair stylist or hair care store. Work the serum into your hair with your fingers. Focus on the ends of your hair where they are the most frizzy and continue working down to the scalp."
    },
    {
      "title": "Work styling cream into your damp hair.",
      "content": "Work styling cream into your damp hair. Use a cream-based pomade. Scoop out a fingertip-sized amount of the cream and rub it on your hands. Use your fingers to lather it into your hair as you would with shampoo. Spread the cream thoroughly throughout your entire hair. [12] X Research source The cream will help add shine and control your natural curls so they are not too unruly."
    },
    {
      "title": "Shape the curls by scrunching your hands.",
      "content": "Shape the curls by scrunching your hands. For a curlier texture, squeeze your curls between your fingers and the heel of your palm. This helps set the product in further and bring out your curls. [13] X Research source Avoid using a comb, since this will flatten your hair."
    },
    {
      "title": "Let your hair air dry into shape.",
      "content": "Let your hair air dry into shape. Once you’ve styled your curls how you want them, let the pomade air dry so you don’t lose any moisture in your hair. Drying your hair in any other method will be disrupted and lose its texture. [14] X Research source"
    },
    {
      "title": "Tie your hair up in a bun",
      "content": "Tie your hair up in a bun to keep it out of your face. Keep an elastic hairband on your wrist. Pull your hair back so you can hold it all in one hand. Take the hairband off your wrist, pull it over your hair, and twist. Pull the band back around your hair to make a bun. [15] X Research source You might opt for the \"man bun,\" which is higher on your head, or a low bun if you prefer. Use a shoelace instead of an elastic band to control the tightness of the bun. Put in bobby pins to secure the bun in place if you’re wearing it looser."
    },
    {
      "title": "Work a liquid pomade into your damp hair with your fingers.",
      "content": "Work a liquid pomade into your damp hair with your fingers. Squeeze pomade into your hand the size of a quarter and rub it in your hands. Use your fingers to lather it into your hair as you would shampoo. Make sure to work it from the ends of your hair all the way down to the scalp for maximum coverage. [16] X Research source Thicker and coarser hair will require more pomade."
    },
    {
      "title": "Use a comb to smooth your hair back and distribute the pomade.",
      "content": "Use a comb to smooth your hair back and distribute the pomade. Use a wide-toothed comb to work your hair into the style that you want. This helps pull hair away from your face for a more slicked back look. [17] X Research source Run your fingers through your hair to further accentuate any curls."
    },
    {
      "title": "Add extra pomade on the hair near your face.",
      "content": "Add extra pomade on the hair near your face. Use a dime-sized amount of pomade and rub it into the hair on the sides and on top of your face to give it extra hold. This ensures your hair will stay controlled throughout the day. [18] X Research source Let the pomade air dry for the best hold and shine."
    }
  ]
}