{
  "url": "https://www.wikihow.com/Tag-People-in-Your-Twitter-Photos",
  "title": "How to Tag People in Your Twitter Photos",
  "steps": [
    {
      "title": "Open the X app on your device.",
      "content": "Open the X app on your device. It’s the black icon with a white X. Log in to your account, if you haven't already done so."
    },
    {
      "title": "Tap on the Tweet button.",
      "content": "Tap on the Tweet button. You can see the blue colour tweet button at the bottom-right corner of the app. This will open the tweet composer."
    },
    {
      "title": "Add an image from your gallery.",
      "content": "Add an image from your gallery. Tap on the image icon at the bottom-right corner of the app browse for your favourite image. Tap on an image to add it to your tweet."
    },
    {
      "title": "Tap on the Who's in this photo? option.",
      "content": "Tap on the Who's in this photo? option. This will be located at the bottom side of the picture."
    },
    {
      "title": "Search for an account to tag in your picture.",
      "content": "Search for an account to tag in your picture. You can tag up to 10 people in a photo. When you're done, hit the Done button."
    },
    {
      "title": "Tweet it!",
      "content": "Tweet it! Tap on the Tweet button to share your post with the world. That's it!"
    },
    {
      "title": "Log in to X.",
      "content": "Log in to X. Open www.twitter.com in your web browser and sign in with your account."
    },
    {
      "title": "Compose a new Tweet.",
      "content": "Compose a new Tweet. Click on the Tweet button to open the Tweet box, and write what you want to say. You will see the “Tweet” button on the left side menu panel."
    },
    {
      "title": "Add an image to your tweet.",
      "content": "Add an image to your tweet. Click on the image symbol and browse for your image. Then select an image from your computer."
    },
    {
      "title": "Click on the Tag people option.",
      "content": "Click on the Tag people option. You will see this option at the bottom-left corner of the selected image."
    },
    {
      "title": "Search for your friend's name.",
      "content": "Search for your friend's name. Tap on your friend's account to tag them. You can tag up to 10 people in a photo. When you're done, hit the Done button."
    },
    {
      "title": "Share your tweet with your followers.",
      "content": "Share your tweet with your followers. Just click on the Tweet button to post it. That's it!"
    }
  ]
}