{
  "url": "https://www.wikihow.com/Use-There,-Their-and-They%27re",
  "title": "How to Use There, Their and They're",
  "steps": [
    {
      "title": "Inspect what you have written, and think about which word you are using and decide how to spell the word you are concerned about using correctly.",
      "content": "Inspect what you have written, and think about which word you are using and decide how to spell the word you are concerned about using correctly. (Of course, your word would logically have followed information indicating or naming of whom or about what you were talking.) The chosen word would need to agree with the subject or topic to which you refer."
    },
    {
      "title": "Use \"there\" when referring to a certain place; compare \"there\" to \"here\" and \"where.\"",
      "content": "Use \"there\" when referring to a certain place; compare \"there\" to \"here\" and \"where.\" The place can be either concrete (\"over here or there by the building\") or more abstract (\"it must be difficult to be there in your mind\"). [2] X Research source"
    },
    {
      "title": "Compare \"there are\" to \"here are\" and \"where are.\"",
      "content": "Compare \"there are\" to \"here are\" and \"where are.\" There plus a \"to be\" verb such as \"are\" indicates the existence of something mentioned. [3] X Research source \"There are antiques here.\" \"Where?\" \"Look there.\" \"Oh, and, see here, we've found them!\" \"Are there many of the documents stored here?\" \"Yes, see them here, where they are safe. Do you see where they are? Right over there!\" \"There will be a picnic here, and there is a monstrous campground over there across the river. There is one of the places where they are staying tonight.\""
    },
    {
      "title": "Use \"their\" and \"theirs\" to indicate possession.",
      "content": "Use \"their\" and \"theirs\" to indicate possession. Compare to \"heir\" -- to inherit possessions as in \"an heir of their uncle who had no children.\" Their is a possessive adjective and indicates that a particular noun belongs to them. [4] X Research source \"Sam and Jan are heirs of their parents' land and possessions as their legal heirs.\" \"Their things were broken.\" Compare to \"Our things were broken.\" Yes, it shows possession. \"I see their flowers are blooming in their garden.\" \"Yes, from the seeds their grandmother gave to them last fall.\""
    },
    {
      "title": "Remember that \"they're\" is a contraction of the phrase \"they are.\"",
      "content": "Remember that \"they're\" is a contraction of the phrase \"they are.\" It is not a modifier, but only a pronoun (for a name of who or what) plus the contraction \" 're\" of the verb \"are\" (a state of being verb). [5] X Research source \"They're my friends.\" Check that \"They are my friends\" makes sense. Yes! \"I would go with you, but they're going to take me.\" To check, say \"They are going to take me.\" Yes!"
    },
    {
      "title": "Ask test questions.",
      "content": "Ask test questions. Ask yourself these questions, but they may not work in a few cases: For \"there,\" will the sentence still make sense, if you replace \"there\" with \"here\" or \"where\"? If so, it's right. For \"their,\" will the sentence still make sense if you replace \"their\" with \"our\" (to see whether it is a possessive sentence), but of course that test phrase would change to whom it belongs. \"Ours belongs to us, but theirs belongs to them.\" Still, if \"our\" fits logically it is right because it is possessive. [6] X Research source For \"they're,\" will the sentence still make sense if you replace \"they're\" with \"they are\"? If so, it's right, but if not, then \"they're\" is the wrong word."
    },
    {
      "title": "Recognize incorrect examples and learn from the mistakes.",
      "content": "Recognize incorrect examples and learn from the mistakes. By looking over others' work with a critical eye, especially by offering proofreading or copyediting help, you can become more sensitized to correct usage and practice it yourself. Wrong: Their is no one here. Wrong: Shelley wants to know if there busy. Wrong: The dogs are happily chewing on they're bones. RIGHT: I can't believe they're leaving their children there, alone!"
    },
    {
      "title": "Practice, practice, practice!",
      "content": "Practice, practice, practice! Get your English teacher or friend to say several sentences aloud that include one of these three words and write down which version they are using. Find grammar quizzes on the internet. [7] X Research source Hire a private English tutor if you're still having trouble."
    }
  ]
}