{
  "url": "https://www.wikihow.com/Use-Your-Heelys",
  "title": "How to Use Your Heelys",
  "steps": [
    {
      "title": "Use your Heely tool to pop out your sole savers.",
      "content": "Use your Heely tool to pop out your sole savers. The sole saver is the flat piece on the bottom of the shoe. Keep the sole savers in place when you want your shoes to operate like regular shoes, but when you're ready to roll, pop them out."
    },
    {
      "title": "Pop in your wheels.",
      "content": "Pop in your wheels. You should hear a click when heels are popped in all the way. You may want to stomp down on each wheel just to be safe."
    },
    {
      "title": "Find a good place to practice.",
      "content": "Find a good place to practice. Look for a somewhat sloping, smooth area, but not too steep. A sidewalk, hallway or road works well. Avoid streets with car traffic or areas with lots of cracks, stones or other obstacles on the ground."
    },
    {
      "title": "Lift your toes and rock back on your heels.",
      "content": "Lift your toes and rock back on your heels. Stand near a table at first so you can get used to how it feels to put your weight on your heels, where your wheels are. Rocking back on your heels is how you roll."
    },
    {
      "title": "Push off with one foot.",
      "content": "Push off with one foot. Now that you're familiar with your heelys, time to put them to the test. Rock back on the heel of one foot, and use the toe of your other foot to take a step and push forward. As you push forward, transfer your weight to the heel."
    },
    {
      "title": "Balance on your heels.",
      "content": "Balance on your heels. Now that you're in motion, put the heels of both feet on the ground and roll. Don't lean back too far, or you might fall on your rear end! Keep your weight balanced over your heels. Keep one foot slightly ahead of the other foot."
    },
    {
      "title": "Push again.",
      "content": "Push again. When you want to go faster, use one of your feet to push off again, just like you would if you were riding a scooter - only the wheels are attached to your foot instead of a board."
    },
    {
      "title": "Stop by leaning back on your heels.",
      "content": "Stop by leaning back on your heels. Leaning back so that the heel part of your shoes (the part behind the wheels) touches the ground will bring you to a slow stop. You can also slam your toes down, but you'll have to start running, since your upper body may keep going forward if you are moving very fast. Get comfortable with stopping both ways."
    },
    {
      "title": "Don't heely faster than you can run.",
      "content": "Don't heely faster than you can run. It will be really hard to stop yourself, and you'll probably end up falling down."
    },
    {
      "title": "Don't heely near cars.",
      "content": "Don't heely near cars. If you lose control of your wheels, you could end up in a dangerous situation!"
    },
    {
      "title": "Wear protective gear.",
      "content": "Wear protective gear. If you're going to be in a busy area, it can't hurt to wear a helmet, elbow and wrist guards, and knee pads to keep yourself from getting bruised up."
    }
  ]
}