{
  "url": "https://www.wikihow.com/Your-Connection-Is-Not-Private",
  "title": "What Causes “Your Connection Is Not Private” Errors?",
  "steps": [
    {
      "title": "This is Google Chrome’s warning that a site’s SSL certificate is bad.",
      "content": "This is Google Chrome’s warning that a site’s SSL certificate is bad. A Secure Sockets Layer (SSL) certificate (or Transport Layer Security (TLS) certificate) is a digital object that allows a web browser to verify the identity and safety of a website. These certificates are essential because they demonstrate that your private information will be encrypted and that any payment information won’t be shared. “This connection is not private” is Google Chrome’s warning that a website’s certificate is missing or invalid. [1] X Research source SSL/TLS errors are a part of HTTPS, which stands for “hypertext transfer protocol secure.” This is the process used by websites to communicate with web browsers. Every web browser has a version of this message. “This connection is not private” is simply Chrome’s wording. Other web services have similar variations. Firefox: “This connection is not secure.” Edge: “The connection for this site is not secure.” Opera: “This connection is not secure.” Safari: “This connection is not private.”"
    },
    {
      "title": "No, but they aren’t automatically dangerous per se.",
      "content": "No, but they aren’t automatically dangerous per se. Your web traffic and user input is not encrypted when you visit a site with a bad SSL/TLS certificate. But that doesn’t mean the website is malicious (although it certainly could be). So long as you don’t enter any user info, payment details, or sensitive info, you may be totally fine. That said, we recommend that you do not browse or use sites with bad SSL/TLS certificates. The odds are very good that whatever website you’re trying to visit hasn’t been updated recently. Still, it’s better safe than sorry when it comes to online safety. Many malicious websites have verified SSL/TLS certificates. A website is not automatically “safe” because it has a valid SSL/TLS cert; it just means your information is encrypted. A scammer may not care about that, though!"
    },
    {
      "title": "Expired or invalid SSL certificate",
      "content": "Expired or invalid SSL certificate In the vast majority of cases, this is the source of your “connection is not private” message. The owner of the webpage can usually fix the problem by updating their SSL certificate or fixing problems with their web server configuration. This is why you often get the “your connection is not private” message when trying to access really old websites that haven’t been updated in a long time."
    },
    {
      "title": "Misconfigured security settings",
      "content": "Misconfigured security settings It’s possible that whoever set up the website didn’t install it correctly. Or, it’s possible that the website doesn’t have security settings that match the SSL certificate. In either case, this will cause Chrome to block the website."
    },
    {
      "title": "Network issues",
      "content": "Network issues The SSL/TLS certificate is designed to prove to your browser that the website is safe, but if your internet connection is unstable, the browser may not have enough time online to read the cert. You'll often get “this connection is not private” when you’re on spotty Wi-Fi. If you get this kind of error on a website that you know is reputable (like Google, Reddit, or WikiHow), the error is probably network-related. Those big sites don’t let their encryption security lapse."
    },
    {
      "title": "Outdated browser",
      "content": "Outdated browser If your browser is very old and needs to be updated, it may not be able to interpret modern security certificates. Don’t ignore prompts to update your software, especially when it comes to your web browsers. These programs require updates to ensure they can spot and block dangerous links."
    },
    {
      "title": "Bad date and time settings",
      "content": "Bad date and time settings If your system’s date and time are incorrect, it can have some funny consequences. One of those consequences is that your web browser will have the wrong date, so when it’s time to check the SSL/TLS certificate, the browser may see the date on the certificate and think it’s incorrect."
    },
    {
      "title": "Extremely old operating system",
      "content": "Extremely old operating system Your PC’s operating system may interfere with your web browser’s ability to function correctly if it’s especially old. If you’re using a very old OS, you may be running into more SSL/TLS errors than you would if you were on a newer machine. If this is the case for your computer, it’s a very good sign your operating system is dangerously close to being a huge security liability."
    },
    {
      "title": "Malware",
      "content": "Malware If your computer is infected with anything nefarious, like malware, a trojan virus, etc., it could be messing with your web browser’s ability to read and interpret SSL/TLS certificates. This is most likely the case if you’ve noticed other symptoms of a virus on your computer."
    },
    {
      "title": "Check your website configuration.",
      "content": "Check your website configuration. If you’re seeing this error on your own website, your SSL certificate may have expired, or you may have mixed content (http and https) on the same page. Visit Qualys’ SSL Server Test page to test your certificate and find a solution to your problem."
    },
    {
      "title": "Try refreshing the page.",
      "content": "Try refreshing the page. These kinds of errors are very common, and they’re often caused by a hiccup with your internet connection. Try refreshing the page to see if the security certificate works. If it does, this was just a minor bug."
    },
    {
      "title": "Close the browser and re-open it.",
      "content": "Close the browser and re-open it. If your browser is being buggy in general and refreshing the page doesn’t work, try closing the program and then reopening it. Alternatively, you can try using a different browser. If that works, your other browser may simply need to be updated."
    },
    {
      "title": "Get off of public Wi-Fi.",
      "content": "Get off of public Wi-Fi. Public Wi-Fi networks are much more exploitable than private networks. As a result, if someone is trying to infect, hack, or damage the network, your computer may not be detecting the proper safety certificates. Alternatively, the website you’re trying to access may not be safe to use on public Wi-Fi networks. You don’t need to worry about catching anything malicious if a hacker is messing with a public Wi-Fi network, but don’t stay on it longer than you need to."
    },
    {
      "title": "Make sure your browser is up to date.",
      "content": "Make sure your browser is up to date. Go into your browser’s settings and check to see which version of the browser you’re using . If an update is available, download it to ensure you’re using the most up-to-date browser version. If you update your browser and confirm you aren’t on a public Wi-Fi network but you’re still getting security errors, the issue is almost positively the webpage itself."
    },
    {
      "title": "Confirm that you’re on the right website.",
      "content": "Confirm that you’re on the right website. Did you type the website’s URL into the web browser correctly? If you enter the wrong URL and you accidentally try to go to an old or nonexistent website, you could get an SSL/TLS error. Don’t forget the .com/.net/.edu ending of the URL! If you type in “WikiHow.net” instead of “WikiHow.com,” you’ll get the same error!"
    },
    {
      "title": "There is no fix, and the website is dangerous.",
      "content": "There is no fix, and the website is dangerous. If you’ve ruled everything else out, this is 100% not your fault—the website itself doesn’t have a valid SSL/TLS certificate, which means it’s not safe to continue browsing it. It doesn’t automatically mean that the website is trying to steal your data or anything, but it is true that you can’t rule it out."
    },
    {
      "title": "No, the message is just a warning.",
      "content": "No, the message is just a warning. So long as you do not proceed after seeing this message, you are not in any danger. Your computer has not been hacked, you do not have a virus, and nothing is wrong with your computer. The “connection is not private” message comes from your browser, not the website in question. Basically, imagine that you tried to open a door to the website—”your connection is not private” is sort of like a bouncer blocking your way!"
    }
  ]
}