{
  "url": "https://www.wikihow.com/Throw-a-Boomerang",
  "title": "How to Throw a Boomerang",
  "steps": [
    {
      "title": "Start with the proper grip.",
      "content": "Start with the proper grip. You can hold the boomerang on either arm -- the lift (leading) arm or the dingle (trailing) arm. Either way, make sure that the painted, curved side is always facing toward you and the flat side is facing away from you. [1] X Research source"
    },
    {
      "title": "Try the pinch grip.",
      "content": "Try the pinch grip. The pinch grip involves \"pinching\" the boomerang between your thumb and index finger. You throw the boomerang by flicking your wrist backwards before snapping it forwards. This creates enough momentum to pull the boomerang out of your hand and create spin. [2] X Research source"
    },
    {
      "title": "Test the cradle grip.",
      "content": "Test the cradle grip. This grip is similar to the pinch grip, except you wrap your index finger (or all four fingers) around the edge of the boomerang instead. Grip the boomerang as close to the bottom of the arm as possible, and as you throw, flick the boomerang with your index finger as if pulling a trigger. This helps to create spin. [3] X Research source"
    },
    {
      "title": "Find a large, open area.",
      "content": "Find a large, open area. Choose an area where you have at least 50 meters (164.0 ft) of space on all sides. Football fields, soccer pitches, and open park spaces are all good options. Make sure there are not too many trees or bushes for your boomerang to get caught in, or large bodies of water for it to fall into. [4] X Research source Avoid practicing your boomerang throw in crowded areas, or places with a lot of windows or parked cars. It can be difficult to predict where your boomerang will land, and a mis-thrown boomerang can cause significant injury or damage to property. [5] X Research source You should always throw from the center of an open space. This will help you to throw more consistently, while also providing some leeway on all sides if the flight of the boomerang doesn't go as planned. [6] X Research source"
    },
    {
      "title": "Watch out for weather conditions.",
      "content": "Watch out for weather conditions. Wind is one of the most important factors in the proper return of a boomerang. Ideally, you want a nice calm day, with winds between 0 to 10 mph (16 km/h). Some boomerangs will not return in completely calm weather, but most will. Avoid throwing your boomerang in high winds, as it will distort the path of the boomerang and throw it off course. [7] X Research source Light rain will not distort the flight of the boomerang. If you choose to use your boomerang on rainy days, put a protective seal on it, especially if it's made from wood, to prevent it from swelling with moisture. [8] X Research source Even though falling snow will not affect the flight of the boomerang, snow on the ground will conceal a fallen boomerang, making it almost impossible to find. [9] X Research source"
    },
    {
      "title": "Throw the boomerang around the wind.",
      "content": "Throw the boomerang around the wind. You want to throw the boomerang \"around\" the wind, meaning that you throw it to the right of an oncoming wind, and it returns on the left (or the opposite if you're left-handed). You want to throw your boomerang between 45 to 90 degrees to the right or left of an oncoming wind. [10] X Research source To figure out wind direction, pick up a fistful of grass or leaves and throw them into the air. If the leaves blow across your face to the right, you will need to turn left, and vice versa. [11] X Research source Stand so that the wind is blowing directly into your face, then turn about 45 degrees to the left or right, depending on which is your dominant hand. [12] X Research source Some boomerangs work better when thrown at a wider angle to the wind (up to 90 degrees) so experiment a little to find out which angle works best for you. [13] X Research source"
    },
    {
      "title": "Throw the boomerang vertically, with the correct layover.",
      "content": "Throw the boomerang vertically, with the correct layover. Boomerangs should be thrown vertically overhand, as if throwing a baseball, so they will cartwheel end-over-end. Hold the boomerang so that it's almost perpendicular with the ground, tilting it 5 to 20 degrees to the right (if you're right-handed) or to the left (if you're left-handed). [14] X Research source The degree to which you tilt the boomerang is called the layover. If using a wide layover, you should throw the boomerang softly, whereas more vertical layovers will require harder throws. [15] X Research source Throwing a boomerang horizontally will prevent the boomerang from returning. It will cause the boomerang to climb high into the air, before dropping straight back to the ground and potentially breaking. [16] X Research source"
    },
    {
      "title": "Throw the boomerang at the appropriate elevation.",
      "content": "Throw the boomerang at the appropriate elevation. Most boomerangs only need to be thrown at eye-level, with an elevation about 10 degrees above the ground. A good trick is to pick a point slightly above the horizon, such as some far-away tree top, and aim directly for it."
    },
    {
      "title": "Figure out the footwork.",
      "content": "Figure out the footwork. A right-handed thrower will need to pivot their right foot outwards, lift their left leg so all the weight is on the right, then step forwards onto the left foot as they throw, in a move that's known as \"casting the foot out.\" Left-handed people will do the exact opposite. This helps to put more weight behind the throw, increasing the distance the boomerang will travel. [17] X Research source"
    },
    {
      "title": "Give it some spin.",
      "content": "Give it some spin. Spinning the boomerang as you throw is perhaps the most important deciding factor in whether your boomerang returns to you or not. You can give your boomerang spin by cocking your wrist backwards, then snapping it forwards as you throw. You shouldn't just release the boomerang -- it should be ripped from your grip by the force of the spin."
    },
    {
      "title": "Focus on technique, not strength.",
      "content": "Focus on technique, not strength. Unless you're really focused on distance, the strength of your throw is not the most important thing when it comes to throwing a boomerang. Once you have the hang of putting a good spin on your throw, you can start to focus on power."
    },
    {
      "title": "Catch the boomerang.",
      "content": "Catch the boomerang. The best way to catch a returning boomerang is to extend both arms, wait until the boomerang reaches below shoulder level, then clap your hands together to catch the boomerang between your palms (known as the sandwich catch). If you've lost sight of your boomerang, or it's coming at you too fast, turn around, hunker to the ground, and cover your head with hands. [18] X Research source There are lots of trick catches you can try, such as the under-the-leg catch, the hand-to-foot catch and behind-the-back catch. You may want to wear some padded fingerless gloves to protect your hands while attempting these trick catches. [19] X Research source"
    },
    {
      "title": "Purchase a high quality boomerang.",
      "content": "Purchase a high quality boomerang. The type of boomerang you buy will have a significant impact on whether you will get it to come back to you or not. Boomerangs are made from regular pieces of wood or plastic, so it takes some skilled workmanship to imbue such everyday materials with the aerodynamic qualities that make boomerangs so unique. There are loads of boomerangs on the market, but not all of them are true returning boomerangs, so do your research before you buy."
    },
    {
      "title": "Beginners should choose a v-shaped or a tri-bladed boomerang.",
      "content": "Beginners should choose a v-shaped or a tri-bladed boomerang. Pick one that is made from lightweight materials. These boomerangs do not require a strong throw, which allows beginners to focus more on technique. They will usually travel between 10 to 25 meters (32.8 to 82.0 ft) before returning. [20] X Research source"
    },
    {
      "title": "Choose a heavier boomerang if you are advanced.",
      "content": "Choose a heavier boomerang if you are advanced. Once you have mastered the throwing technique and your boomerang is consistently returning, you can move on to intermediate and, later, advanced boomerangs. These boomerangs tend to be heavier, come in a variety of shapes and sizes, and can travel distances of up to 50 meters (164.0 ft) before returning. [21] X Research source"
    },
    {
      "title": "Pick a boomerang made for your dominant hand.",
      "content": "Pick a boomerang made for your dominant hand. Be aware that you will need either a left-handed or right-handed boomerang depending on your dominant hand. If you're left-handed, you will have considerable difficulty in throwing a right-handed boomerang with any success."
    },
    {
      "title": "Reassess your throw if your boomerang won't come back.",
      "content": "Reassess your throw if your boomerang won't come back. If your boomerang is failing to return to you, the reason is one of two things: your boomerang is of poor quality, or your throw is incorrect. If you think your throw is incorrect, focus on correcting the following common mistakes: Decrease the layover of your throw. If your throw is too horizontal, it will almost certainly fail to come back. Throw your boomerang almost vertically for best results. Don't throw the boomerang across your body. Instead, throw it straight ahead. If your throwing hand ends up across from the opposite shoulder, you know you're doing it incorrectly. Work on your spin. Focus on flicking your wrist, as this is where most of the spin comes from. You can also experiment with different grips and hand positioning to find out which is most comfortable and effective for you."
    },
    {
      "title": "Change your direction if your boomerang returns to the wrong spot.",
      "content": "Change your direction if your boomerang returns to the wrong spot. If the boomerang comes back but lands too far in front of you or too far behind you to catch, you are probably facing the wrong direction in relation to the wind. [22] X Research source If the boomerang lands in front of you, try turning a few degrees to the left, so you are throwing more directly into the wind. If the boomerang lands behind you, try turning a few degrees to the right, so you are throwing further away from the wind. These directions will be reversed if you are left-handed."
    },
    {
      "title": "Watch your boomerang closely if you keep losing sight of it.",
      "content": "Watch your boomerang closely if you keep losing sight of it. The flight of a boomerang is almost impossible to predict, so if you look away for even a second, you may not be able to find it again. If you've thrown it well, the boomerang may fly back suddenly and hit you in the face. But if you've thrown it badly, you may never be able to find it again. Wear sunglasses while practicing in case your boomerang flies into the path of the sun. They will also protect your eyes should your boomerang come back and hit you in the face. If the boomerang falls out of the sky as the result of a bad throw, make a mental note of a landmark you can use to locate it. Search for it right away, as you may not be able to find it later."
    },
    {
      "title": "Repair your boomerang if it becomes warped or nicked.",
      "content": "Repair your boomerang if it becomes warped or nicked. Boomerangs can easily become warped or dented due to repeated crash landings or fumbled catches. However, with a little love and care most of these problems can be patched up and your boomerang will still be in perfect working order. [23] X Research source To fix a warped boomerang: Place the boomerang in the microwave or hold it over the heat on an electric stove for 8-10 seconds. Bend the boomerang in the opposite direction to the warp and hold it in place until the wood cools again. [24] X Research source To fix nicks and scratches: Fill any holes with a little wood putty. Once the putty dries, sand the boomerang until smooth, then cover with a coat of polyurethane seal to keep moisture out. [25] X Research source"
    }
  ]
}