{
  "url": "https://www.wikihow.com/Stretch-Your-Elbow",
  "title": "How to Stretch Your Elbow",
  "steps": [
    {
      "title": "Position your right arm in front of you with your wrist up.",
      "content": "Position your right arm in front of you with your wrist up. You want your arm to be at a 45-degree angle to your body. If stretching both of your elbows, start with your right arm. Rotate your hand in order to have your right wrist pointing upwards. You can complete this stretch standing up or sitting down. If you’re sitting down, making sure you’re sitting with your back straight and both of your feet flat on the ground. For a simple stretch to improve your extension, simply put your upper arm flat on a table and let gravity pull your elbow straight. [2] X Expert Source Jonathan Frank, MD Sports Orthopedic Surgeon & Joint Preservation Specialist Expert Interview. 1 October 2020."
    },
    {
      "title": "Bend your right wrist so your right-hand points downward.",
      "content": "Bend your right wrist so your right-hand points downward. Start by bending your right wrist such that your right fingers start to point towards the ground. You may only be able to move your hand a small amount without assistance, but you should start to feel a stretch in your right lower arm and elbow. Bending your wrist using this method is referred to as the wrist flexor stretch."
    },
    {
      "title": "Use your left hand to bend your right hand further.",
      "content": "Use your left hand to bend your right hand further. Take your left hand and use it to pull your right fingers and hand so that your wrist bends even more. You should be able to get your right hand to be perpendicular to your lower arm with the help of your left hand. Hold your right hand in this position for 15 to 30 seconds. The stretch in your right lower arm should increase in intensity as you use your left hand. You will be able to feel the stretch, but don’t pull your right hand to the point where you feel pain."
    },
    {
      "title": "Repeat all of these steps with your left arm and hand.",
      "content": "Repeat all of these steps with your left arm and hand. Once you’ve completed the stretch on your right arm and hand, repeat the whole process on your left arm and hand. Go back and forth between your two arms until you’ve completed between 2 and 4 stretches on each arm. You will also want to hold the stretch on your left arm for 15 to 30 seconds. You can pause for a few seconds between stretches on one arm. You may also want to shake out your arm in between stretches."
    },
    {
      "title": "Face your palm downward to complete the wrist extensor stretch.",
      "content": "Face your palm downward to complete the wrist extensor stretch. The flexor stretch was completed with your palm facing upwards. The extensor stretch is completed using the exact same steps, except now your palm is facing downward. The change in your palm’s direction will switch the stretch from the under portion of your lower arm to the top portion of your lower arm. As with the flexor stretch, you will feel the stretch in your arm, but stop before it reaches the point of pain. You can also change up this stretch by holding out your arm in front of you while looking at the back of your hand, like you just got a manicure. Use your other hand to extend your fingers and wrist back. Then, push them forward. [3] X Expert Source Jonathan Frank, MD Sports Orthopedic Surgeon & Joint Preservation Specialist Expert Interview. 1 October 2020."
    },
    {
      "title": "Reach your right hand behind your head to touch your upper back.",
      "content": "Reach your right hand behind your head to touch your upper back. Start by standing up with your feet shoulder-width apart. Move your right hand to your upper back, behind your head. The palm of your right hand should be able to touch the top of your spine, just below your neck. Make sure your elbow is pointing towards the ceiling. [4] X Research source Don’t worry if you can’t reach your hand down your back. Reach down as far as you can while keeping your elbow pointed towards the ceiling."
    },
    {
      "title": "Use your left hand to stretch your triceps.",
      "content": "Use your left hand to stretch your triceps. Place your left hand on your right elbow. Pull your right elbow towards your head with your left hand. You should feel a stretch on the back of your upper arm. Hold the stretch for 10 to 30 seconds. [5] X Research source Don’t pull your right elbow to the point of pain in your arm or elbow. Repeat this stretch on your right elbow 2 or 3 times. You can pause for a few seconds between stretches on one arm. You may also want to shake out your arm in between stretches."
    },
    {
      "title": "Repeat the movements with your left hand behind your head.",
      "content": "Repeat the movements with your left hand behind your head. Once you’ve completed the stretch with your right arm, switch to complete the stretch with your left arm. This time use your right hand to pull your left elbow towards your head. Hold the stretch for 10 to 30 seconds. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Repeat this stretch on your left elbow 2 to 3 times."
    },
    {
      "title": "Stretch your tricep by pulling your arm across the front of your chest.",
      "content": "Stretch your tricep by pulling your arm across the front of your chest. One alternate way of conducting a tricep stretch is to pull your right arm across the front of your chest, rather than placing your hand behind your head. Move your right arm as if you’re trying to touch the inside of your right elbow to your left shoulder. Hold your right arm with your left hand to stretch your right tricep. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Repeat the exact same stretch with your left arm. Hold the stretch for 10 to 30 seconds."
    },
    {
      "title": "Stretch your hand using a rubber band around your fingers and thumb.",
      "content": "Stretch your hand using a rubber band around your fingers and thumb. Cup your hand such that all four fingers and your thumb are touching. Put a rubber band around all your fingers and your thumb. Slowly open your hand by moving your fingers and thumb outward. Open and close your fingers and thumb 10 times in a row. Repeat the set of 10 stretches 2 more times, resting in between sets. [8] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Once you’ve completed 3 sets of 10 stretches on one hand, switch and repeat the process on your other hand. You can pause for a few seconds between stretches on each hand. You can also shake our your arm between stretches."
    },
    {
      "title": "Squeeze a rubber ball for 10 to 15 minutes.",
      "content": "Squeeze a rubber ball for 10 to 15 minutes. Hold a soft object, like a rubber ball or stress ball, in one hand. Squeeze the soft object over and over again for 10 to 15 minutes. Once you’ve squeezed the soft object in one hand, switch and squeeze the soft object in your other hand. [9] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Repeat this stretch 2 to 3 times with each hand. As these stretches can take 10 to 15 minutes on each hand, you can repeat these stretches during the same time period or you can complete the stretches at different times throughout the day. Feel free to be doing some other activity while you’re squeezing the soft object in your hand. For example, you can do this stretch while watching TV, talking on the phone, or reading a book."
    },
    {
      "title": "Rest your arm on a stable surface to perform a forearm twist.",
      "content": "Rest your arm on a stable surface to perform a forearm twist. Find a seat somewhere such that you’re able to rest your right forearm on a table or the arm of a chair. Hold either a hammer or a dumbbell with a weight on only one end in your right hand. Start by gripping the hammer or dumbbell as far away from the weighted portion as possible. Rotate your forearm to the right and left, moving the hammer or dumbbell 180 degrees. Repeat the rotation 10 times. [10] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Do not rotate your forearm to the point of pain. If rotating your forearm is uncomfortable, move your grip closer to the heavy end of the hammer or dumbbell. Select a dumbbell weight that is comfortable for you. The actual weight of the dumbbell isn’t as important as the fact that you’re rotating your forearm using a weighted item. Complete 10 rotations in 3 sets using your right arm, then switch and repeat the stretch using your left arm. You can pause for a few seconds between stretches on each hand. You can also shake our your arm between stretches."
    },
    {
      "title": "Complete a wrist lift while holding a can of beans or soup in your hand.",
      "content": "Complete a wrist lift while holding a can of beans or soup in your hand. While holding a can of beans or soup in your right hand, hold your arm such that your forearm is perpendicular to your upper arm (which means your elbow will be at a 90-degree angle). Start with your right palm (and the can) facing downward or away from you. Bend your wrist forward and down, then return your wrist to its original position. [11] X Research source You can also use a dumbbell, rather than a can of beans or soup, if you prefer. Repeat this stretch 15 times in 3 sets on each arm. Once you’ve completed this stretch on both arms with your palm facing down, repeat the steps with your palm facing up. You can pause for a few seconds between stretches on each hand. You can also shake our your arm between stretches."
    }
  ]
}