{
  "url": "https://www.wikihow.com/Write-a-Claim-Letter",
  "title": "How to Write a Claim Letter",
  "steps": [
    {
      "title": "Use clear, concise language to get your message across.",
      "content": "Use clear, concise language to get your message across. No matter what type of claim letter you’re writing, you need to stay focused on your main point and provide all the relevant facts. Make your claim crystal clear, and back it up with rock solid evidence. Most claim letters should fit on a single page, and they should rarely if ever exceed 2 typed pages. [1] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source For example: “On June 24, 2018, I bought an Acme model 234 printer at the Best Purchase in Elkhart, Indiana. Unfortunately, the printer has caused me nothing but problems since then. On June 25,...” Avoid extraneous information like: “I have been a fan of your products for years, and have had good experiences with them previously. That’s why I bought a model 234 printer and expected more of the same. Boy was I wrong!”"
    },
    {
      "title": "Present the facts of the situation without excessive precision.",
      "content": "Present the facts of the situation without excessive precision. To make your claim effectively, you need to provide as many supporting facts as you can. However, don't be overly specific or precise with facts that you're not absolutely sure about. This is especially true when sending a demand letter to an insurance company, as they will probably look closely for any potential inaccuracies in your claim. [2] X Research source For instance, if you were in a 2-car accident caused by the other driver (who is the client of the insurer), don’t state that it happened “at 7:18 pm” even if that’s what your clock said. Instead, say “at or around 7:15 pm.” It may seem like nitpicking to you, but if the insurance company can prove that the accident happened at 7:16 pm, they may dispute your claim due to inaccurate facts."
    },
    {
      "title": "Be firm and blunt, but not sarcastic, angry, or threatening.",
      "content": "Be firm and blunt, but not sarcastic, angry, or threatening. Don’t be meek or apologetic in your claim letter—you’ve been wronged and deserve recompense. State exactly what happened, and demand exactly what you believe you deserve. At the same time, don’t let any negative emotions get the better of you. [3] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Remember that the person you’re writing to almost certainly had nothing to do with your bad experience. Being hostile towards them will only make it harder for you to get what you want. Write the letter when you are calm and composed. Have someone you trust read it over for you, or, if necessary, have them write it for you."
    },
    {
      "title": "Tell them how they can make you happy.",
      "content": "Tell them how they can make you happy. After you’ve described exactly what happened and how it has negatively impacted you, it’s equally important to explain exactly what can be done to satisfy you. Don’t be vague or non-committal, or provide multiple options. Instead, make a single, specific demand with a time limit. [4] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source For example, don’t write: “I really hope you can come up with a solution that will meet my approval.” Rather, write something like: “I expect you to replace the printer at no cost to me within the next 30 days. After that period of time, I will explore other options, such as…”"
    },
    {
      "title": "Proofread carefully and make the letter look professional.",
      "content": "Proofread carefully and make the letter look professional. It’s important that you eliminate anything that might give the recipient a reason not to take your letter seriously. Little things like a sloppy layout or a handful of typos need to be avoided. Format the letter consistently, use a quality printer and paper, and have multiple people read the letter over to check for errors. [5] X Research source To make formatting and phrasing easier, you can use templates available online. For instance, you can find a complaint letter template at https://www.usa.gov/complaint-letter ."
    },
    {
      "title": "Provide your contact information, and then the recipient’s.",
      "content": "Provide your contact information, and then the recipient’s. Whenever possible, direct your letter to a specific person at the company or organization. Search the company’s website or call them to identify the proper contact person. The following should be aligned along the top left of your letter: [6] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source 223 Apple Rd. [your address] Anytown, IN 46545 [blank space] September 3, 2018 [blank space] Ms. Jane Reardon [name of contact] Director of Consumer Inquiries [their title] Acme Corporation 100 Acme Pkwy. Acmeville, PA 16201 [blank space]"
    },
    {
      "title": "Offer a salutation and give any relevant account information.",
      "content": "Offer a salutation and give any relevant account information. Below the initial, standard salutation (“Dear…”), add a line with your account number or similar information, if applicable. This way, they can look up your account right away. If you don’t have an account number, just skip to the first paragraph. Align these to the left as well: [7] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source Dear Ms. Reardon: [blank space] Acme Rewards Member #7245436226 [blank space]"
    },
    {
      "title": "Specify your transaction or experience in the first paragraph.",
      "content": "Specify your transaction or experience in the first paragraph. Now you’re ready to begin the body of your letter. Don’t waste time with niceties; instead, clearly and concisely give the “what,” “when,” and “where” of your experience: [8] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source “On June 24, 2018, I used cash to purchase an Acme model 234 printer (serial #33445566778899) at the Best Purchase in Elkhart, Indiana (store #1122).” This first paragraph may be only 1-2 sentences long; that’s OK. Add a space after this and every subsequent paragraph, and don’t indent the first line."
    },
    {
      "title": "Explain the problem or what went wrong in paragraph two.",
      "content": "Explain the problem or what went wrong in paragraph two. This is the spot to present your particular complaint. Provide all relevant details, and remain even-keeled in your writing—indicate disappointment, not anger: [9] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source “I did not unbox and try to use the printer until August 27, 2018 (beyond Best Purchase’s return window), and it has not worked properly at any point since then. Despite following the directions exactly, the paper jams every time, ink drips out of the machine, and the printer makes loud squealing noises. The proposed solutions provided during calls to your customer service department on August 27 and August 30, 2018, did not help in any way.”"
    },
    {
      "title": "Use paragraph three to make your resolution demand.",
      "content": "Use paragraph three to make your resolution demand. After telling the person exactly what went wrong, now is the time to tell them how exactly they can make it right. Clearly state a resolution that is satisfactory to you, but that’s also reasonable given the nature of your complaint: [10] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source “To resolve this problem, I request that you ship me a new model 234 printer, free of charge, to the above address. If you wish me to ship back the current printer, I also request that you send me a prepaid return label. I have enclosed a copy of my original purchase receipt, and of my notes during my two customer service calls (August 27 & 30, 2018).”"
    },
    {
      "title": "Set a time limit in your final paragraph.",
      "content": "Set a time limit in your final paragraph. Finish the body of your letter with a brief paragraph that sets a reasonable deadline for the other person to respond. Don’t directly threaten to sue or hire an attorney if they don’t respond by then, but do indicate that you will “explore other options” to seek satisfaction: [11] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source “I look forward to your reply, and I expect to hear from you within the next 21 days. After that point, I will explore other options to seek a satisfactory resolution to my problem. You may contact me by mail at the above address, by phone at 574-259-0000, or by email at anytowner39@zmail.com.”"
    },
    {
      "title": "Sign the letter in your own hand.",
      "content": "Sign the letter in your own hand. While a complaint letter isn’t an official document, personally adding your signature in pen makes it appear more polished and more serious. Type your name below the signature, and note if you have made any enclosures: [12] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source Sincerely, [Signature] Henry A. Hazard [blank space] Enclosures"
    },
    {
      "title": "Identify the recipient and yourself in detail in the heading.",
      "content": "Identify the recipient and yourself in detail in the heading. Contact the insurance company by phone or email to get the name of the person you should write the letter to. Specifying a recipient by name is more impactful than writing a generic “to whom it may concern.” Place the following on the top left of your letter: [13] X Research source Halcyon Insurance Company attn: Hanna Dickerson, Claim Adjustment Specialist 1300 Washington Blvd. Ravenna, OH 44266 [blank space] September 17, 2018 [blank space] Re: Claimant: [add your name] Address: [your address] D.O.B.: [your birthdate] SSN: [your Social Security number, or similar ID] D.O.L: [the “date of loss” when the event occurred] Claim # [the number assigned by the insurance company] Your insured: [name of the at-fault party, in the case of an accident] [blank space]"
    },
    {
      "title": "Present the facts of the situation in the opening paragraph.",
      "content": "Present the facts of the situation in the opening paragraph. Give as many details as possible, without getting overly precise on matters such as the exact time of the accident. Be clear that you were in no way at fault. [14] X Research source For instance, if describing a car accident, mention the make and model of your car and that of the other driver. It can also help to briefly describe the weather, and you should always state if a police report was filed (and enclose a copy if possible). When describing the actual event, confirm the other driver’s fault: “Your client, Mr. Webb, ran a stop sign at 4th and Broad Streets and struck the driver’s side of my vehicle.” Add a blank space between each paragraph in the letter."
    },
    {
      "title": "Outline your medical damages or other tangible damages.",
      "content": "Outline your medical damages or other tangible damages. If you were physically injured as a result of the accident, give a full account of your documented injuries and treatments. Describe important details such as: [15] X Research source What you were diagnosed with, and by whom. When and where you’ve received treatment, and who delivered it. Any ongoing treatments, such as physical therapy. Any continuing pain or discomfort you have, and any short- and long-term prognosis given by medical professionals. Your expenses (in specific monetary amounts) for each aspect of your diagnosis and treatment—enclose copies of receipts, etc."
    },
    {
      "title": "Follow with a presentation of your intangible damages.",
      "content": "Follow with a presentation of your intangible damages. In this paragraph, describe any “pain and suffering” that is in addition to your documented medical issues. For example: [16] X Research source “Because of my injuries, I had to hire caregivers to clean and maintain my home and take my children to and from school, at a cost of $750 (receipts enclosed).” “I was forced to cancel a long-planned trip to Las Vegas at the last minute, resulting in a non-refundable loss of $1500 (document enclosed).” As “intangible” damages, though, not everything has to have a dollar figure: “My injuries have prevented me from visiting my ailing mother, which has taken a great emotional toll on both of us.”"
    },
    {
      "title": "Summarize your claim and give your demand a deadline.",
      "content": "Summarize your claim and give your demand a deadline. Use the last paragraph to add up your monetary expenses and your non-monetary damages caused by the event. Then, state a specific, reasonable monetary demand as a settlement, and provide a specific, reasonable amount of time for a response: [17] X Research source “My monetary expenses as a result of this accident add up to $8230. In addition, and as described above, the accident has significantly impacted my quality of life. Therefore, I demand a settlement of my claim in the amount of $17,000. Please respond to the above address within 14 days. Thank you.”"
    },
    {
      "title": "Sign the letter yourself in pen.",
      "content": "Sign the letter yourself in pen. This helps to further personalize the letter, especially since you are the person who has suffered due to the incident described in it. Send a signed copy, and keep an identical signed copy for your records. Sign as follows: [18] X Research source Sincerely, [Signature] Steven Payne III [blank space] Enclosures"
    }
  ]
}