{
  "url": "https://www.wikihow.com/Stop-Wrist-Pain-when-Punching",
  "title": "How to Punch Without Hurting Your Wrist: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Keep your thumb outside of your fist.",
      "content": "Keep your thumb outside of your fist. When you're making a fist for punching, start by folding your fingers into the palm of your hand. Then, wrap your thumb around your knuckles. It will likely rest on the first knuckle of your middle or ring finger, depending on how long your thumb is. Close your hand tightly enough that your fist will stay closed when you hit, but don't squeeze so tightly that your hand shakes or you cut off your circulation. Never wrap your fingers over your thumb. The force of the punch will put intense pressure on your thumb joint, and you could break or dislocate your thumb. Don't put your thumb on top of your second set of knuckles, either, since that's where you'll make contact with your target. Always be sure that your pinky finger is tucked into your palm. If it's sticking out when you throw a punch, it could also be broken or dislocated."
    },
    {
      "title": "Hold your fists up in front of your face.",
      "content": "Hold your fists up in front of your face. Before you throw a punch, raise your forearms so they're almost vertical, with your hands near your face. Not only will this help you defend yourself, but it will be easier to maintain good form during your punch if you start in this position. Check to make sure that your arms form a straight line from your elbows all the way to your knuckles."
    },
    {
      "title": "Generate power from your legs when you punch.",
      "content": "Generate power from your legs when you punch. Instead of using your arms to punch as hard as you can, move your dominant foot slightly away from the target, which should turn your body at a slight angle. Bend your knees slightly, and as you start punching, pivot on your back foot, then push off with it. This will help propel you forward and will create some of the power for the punch. [1] X Expert Source Asher Smiley Self Defense Trainer Expert Interview. 30 July 2019. Since you won't have to swing your arm quite so hard, you may be less likely to feel pain in your wrist afterward."
    },
    {
      "title": "Do not bend your wrist as you hit.",
      "content": "Do not bend your wrist as you hit. Keep your arm and wrist as straight as possible while you're swinging at your target. When you make contact, don't let your wrist buckle or bend. If your wrist is at an angle when you hit your target, you could injure yourself. Try squeezing your forearm slightly just before you contact your target. This will help stabilize your wrist. However, don't tense up your shoulder, arm, or wrist before you throw the punch, or it will throw off your accuracy and power. Keep your elbows in close to your body as you're hitting, and don't overextend your body. That can help you feel more in control of the punch, so you might be less likely to hit too hard and hurt your wrist."
    },
    {
      "title": "Strike with your first 2 knuckles.",
      "content": "Strike with your first 2 knuckles. As you're throwing your fist, aim so that you hit your target with the knuckles on your first and index fingers. [2] X Expert Source Asher Smiley Self Defense Trainer Expert Interview. 30 July 2019. These knuckles are stronger than your ring and pinky fingers, so you're less likely to injure your hand, and you'll also get more impact with less force, so the hit will be easier on your wrist. [3] X Research source If you're keeping your wrist straight as you strike, hitting with your first 2 knuckles should feel natural. You can hold your fist so your fingers are vertical, or you can rotate your hand inward at about a 45° angle."
    },
    {
      "title": "Pull your fist back quickly after you make contact.",
      "content": "Pull your fist back quickly after you make contact. Don't try to drive your fist all the way through your target—that's going to put extra pressure on your wrist. Instead, try to keep your punches snappy. Connect with your target, then quickly pull back and move your hand back in front of your face. [4] X Research source In addition to helping protect your wrist, this technique allows you to land multiple blows rapidly. Snapping your punches will also help you get your hands back up to protect your face more quickly. Even if you're working with a punching bag or another stationary target, it's a good idea to practice defending yourself."
    },
    {
      "title": "Warm up with wrist stretches before you start training.",
      "content": "Warm up with wrist stretches before you start training. Stretching your wrists before you workout can help you avoid injuries while you're practicing your punches. In addition, you can do stretches in your free time to help you strengthen the muscles in your forearms and wrists. Here are a few stretches to try: Wrist rotations: Close your hands into fist, then make small circles with your wrists. First, go clockwise for about 30 seconds, then reverse directions and rotate counterclockwise for 30 seconds. Prayer stretch: Press your palms together in front of you, similar to the way you might pray. Then, lower your hands until you feel a stretch in your wrists. Hold that stretch for about 30 seconds, then release. Wrist flexor stretch: Hold one arm out in front of you with the palm up. Then, bend your wrist backward until your hand is pointed at the floor. Use your other hand to gently press on the hand that's bent until you feel a stretch. Hold that for about 30 seconds, then switch hands. Wrist extensor stretch: This is the same as a wrist flexor stretch, but you start with your palm facing down. Bend your wrist forward until your fingers are pointed straight down, then use your opposite hand to press gently on the back of your hand until you feel a stretch. Hold the stretch for 30 seconds."
    },
    {
      "title": "Wrap your wrists",
      "content": "Wrap your wrists to stabilize them. Loop an elastic hand wrap around your thumb, then wrap it behind your hand and around your wrist 3 times. Next, pass the wrap between your thumb and forefinger and around your hand 3 times. Loop back across your wrist and under your thumb once more, then bring the wrap over the back of your hand and between your pinky and ring fingers. [5] X Research source Protect your fingers by crossing the wrap between your thumb and index finger, then make an X by wrapping all the way around your wrist, beneath your thumb, and back up. Make the same Xs between your ring and middle fingers and your middle and index fingers, as well. Finish by passing the wrap around your thumb, then around your knuckles 3 times and back down around your wrist once more. Hold the wrap in place by securing the hook-and-loop fastener right at your wrist. Most adults need a wrap that's about 180 in (460 cm) long. If you have very small hands, however, use a 120 in (300 cm) wrap."
    },
    {
      "title": "Wear boxing gloves on top of your hand wraps for more protection.",
      "content": "Wear boxing gloves on top of your hand wraps for more protection. There are a lot of different types of boxing gloves out there, but if you're just getting started, it's a good idea to start with a basic training glove. These gloves are versatile, so you can use them to protect your knuckles, thumbs, and wrists for both sparring and bag training. [6] X Research source Boxing gloves are sold by weight. Training gloves are sold in sizes from 12-18 ounces. A 16-oz glove is a good weight that will suit most people, but talk to your trainer if you're not sure what's right for you."
    },
    {
      "title": "Wear MMA gloves if you'd prefer more direct contact.",
      "content": "Wear MMA gloves if you'd prefer more direct contact. MMA gloves are fingerless gloves that come down just far enough to cover your first knuckle. They'll protect your knuckles and provide some stability for your wrists as you're hitting, but you'll have more freedom of movement than if you're wearing boxing gloves. [7] X Research source Because they're designed to help you condition your hands and wrists, these gloves won't protect your wrist as much as wraps or boxing gloves. Be sure to start out slowly when you first start wearing them."
    },
    {
      "title": "Take breaks between rounds.",
      "content": "Take breaks between rounds. When you're training, it can be easy sometimes to get caught up in what you're doing. However, it's important to remember to take a 1-2 minute break after each round of sparring or bag training. That will give your hands and wrists time to recover, so you may have less pain afterward. For instance, if you're in a sparring match with a partner, you might box for a full 3-minute round, then stop for 1 minute."
    },
    {
      "title": "Prioritize exercises that will improve your grip strength.",
      "content": "Prioritize exercises that will improve your grip strength. Working your grip will strengthen the muscles in your hands and forearms. This can make your whole wrist area stronger, as well, which could help prevent some wrist pain when you're punching. For example, you might try farmer's walks, where you hold a pair of dumbbells or kettlebells at your side, then walk 50–100 ft (15–30 m). Other exercises include pull-ups, chin-ups, deadlifts, chest presses, and shoulder presses. You can also use a hand grip strengthener, which is a device that you squeeze repeatedly. This is a great way to improve your grip strength in your downtime, like when you're watching TV."
    },
    {
      "title": "Perfect your form with a punching bag.",
      "content": "Perfect your form with a punching bag. Working on a punching bag is a great way to condition your hands and wrists to be stronger while you're hitting. Don't worry about hitting the bag as hard as you can. Instead, focus on improving your speed by keeping your punches as snappy as possible. If you do that, you'll increase your hitting strength over time. Be sure to use proper form when you're hitting the punching bag."
    },
    {
      "title": "Do wrist curls to strengthen your forearms.",
      "content": "Do wrist curls to strengthen your forearms. Holding a 3–5 lb (1.4–2.3 kg) weight in your hand, sit on a chair or bench. Turn your palms face-up and rest your forearms on your thighs. Then, slowly raise and lower the weight by bending your wrist. Repeat this for 3 sets of 15 reps. You can do this with both hands at once, or you can isolate one hand at a time, if you prefer."
    },
    {
      "title": "Try wrist rolls to strengthen your grip.",
      "content": "Try wrist rolls to strengthen your grip. Hold a wrist roller in front of you—a commercial wrist roller looks almost like a pair of handlebars with a cord attached to the center, with a weight dangling from the end of the cord. Grip the roller firmly, then rotate your wrists to roll the cord around the handle. Keep wrapping the cord until the weight touches the handle, then unroll it slowly by rotating your wrists the other way. [8] X Research source Do this first one way, then the other, for about 3-5 reps. To make your own wrist roller, take a sturdy rod, like a broomstick—be sure not to use anything flimsy that might snap. Then, tie a strong string to the center of the stick, and tie the other end to a 5–10 lb (2.3–4.5 kg) weight."
    }
  ]
}