{
  "url": "https://www.wikihow.com/What-to-Do-if-You-Lose-Your-Car-Keys",
  "title": "What to Do If You Lost Your Car Keys and Don’t Have a Spare",
  "steps": [
    {
      "title": "Call a locksmith or roadside assistance.",
      "content": "Call a locksmith or roadside assistance. Call a locksmith in the area to come make you a new key, or call roadside assistance for a tow. Have your VIN, make, model, and car registration handy so you can prove that you’re the owner of the vehicle. [1] X Research source If you have a traditional key, call a locksmith. They can make you a new key right then and there, even without the original key present. If you have a key fob, switchblade key, transponder key, or smart key, call roadside assistance . They will tow your car to the dealer where you can purchase a new key."
    },
    {
      "title": "Request a replacement key that matches the type your car uses.",
      "content": "Request a replacement key that matches the type your car uses. The process for replacing your car keys differs slightly depending on what type you have. Think about your car keys and what they look like. There are 5 main types of car keys, including: [2] X Research source Traditional car keys: these are common for cars made before the 1990s. Traditional keys are classic car keys without any extra features that you put into the ignition to start the car. Key fobs: these are plastic casings that have buttons on the front to lock and unlock your car (and set off the alarm or open your trunk). Some key fobs have physical keys hidden inside of them. Switchblade keys: these keys are a version of key fobs, but they always have a key tucked inside. To start the car, you simply pull the key out of the fob and put it in the ignition, then fold the key back inside when turning the car off. Transponder keys: these keys look similar to traditional keys, but they have a wireless element inside. Your car will check for this wireless element before turning on. Smart keys: these keys have a proximity sensor inside, which unlocks your car whenever you’re near. Smart keys are often paired with push-to-start ignitions."
    },
    {
      "title": "Retrace your steps to try to find your keys.",
      "content": "Retrace your steps to try to find your keys. When you lose your keys, it’s easy to go into panic mode. Take a deep breath, then retrace your steps . Check all of your pockets, your bags, and even your shoes. If you’re not at home, check the area underneath the car or anywhere you spent time recently. If you have a spare car key, now’s the time to find it. Check your junk drawer or your filing cabinet if you can’t remember where you put it. Once you’ve exhausted every option for where your keys might be, move onto the next step to work on replacing your car keys."
    },
    {
      "title": "Traditional keys: $20",
      "content": "Traditional keys: $20 It’s no surprise that traditional keys are the cheapest car keys to replace. A locksmith may charge between $20 and $40, or a little more if they had to drive a long way to get to you."
    },
    {
      "title": "Key fobs: $50 - $100",
      "content": "Key fobs: $50 - $100 Key fobs vary in price depending on what type of car you drive. In general, though, you can expect to pay no less than $50 (and some car keys can cost upwards of $500). [3] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Specialty locksmiths, like auto locksmiths, may be able to replace your key fob for cheaper. [4] X Research source Call a local auto locksmith and ask them about their services to see if it’s something they offer."
    },
    {
      "title": "Switchblade keys: $300",
      "content": "Switchblade keys: $300 Switchblade keys are similar to key fobs, but they’re slightly more expensive. Most dealerships charge upwards of $300 for a replacement."
    },
    {
      "title": "Transponder keys: $200",
      "content": "Transponder keys: $200 Since transponder keys have a wireless component inside, they tend to be pricier to replace. Most dealers will charge around $200 for a new transponder key. Some locksmiths may be able to make you a new transponder key as long as they have a transponder key programmer. [5] X Research source If you aren’t sure, call your local locksmith and ask about the services they provide."
    },
    {
      "title": "Smart keys: $200 - $500",
      "content": "Smart keys: $200 - $500 Smart keys are the most modern type of car key, and they’re generally the most expensive. Depending on the make, model, and year of your car, you’re probably going to spend a few hundred dollars for a replacement. [6] X Research source"
    },
    {
      "title": "Most locksmiths can make you a new key in 20 to 40 minutes.",
      "content": "Most locksmiths can make you a new key in 20 to 40 minutes. If you’re getting a new key from a locksmith, you’ll be ready to go in no time. Locksmiths don’t take long at all to replace a key, and most can do it with equipment they have in their own vehicle. [7] X Research source"
    },
    {
      "title": "Dealerships may take a few days to get you new keys.",
      "content": "Dealerships may take a few days to get you new keys. Depending on your car and who your dealership is, your dealership may have to order your keys to replace them. You may be stuck in limbo for a couple of days until your keys arrive. If your dealership has your key type on-hand and ready to go, they can typically reprogram you a new key in just a couple of minutes. [8] X Research source"
    },
    {
      "title": "Use an electronic tracker.",
      "content": "Use an electronic tracker. These modern inventions make it easy to find your keys with just the click of a button. Purchase an electronic tracker on a keychain, attach it to your keys, then set up an account on your phone. Anytime you need to find your keys, you can alert the tracker via bluetooth and listen for an alarm. Popular brands include: Tile Cube AirTags Chipolo"
    },
    {
      "title": "Keep your keys in the same spot every day.",
      "content": "Keep your keys in the same spot every day. It’s much harder to lose your keys if they’re in the exact same spot every time. Make a designated area for your keys, like a hook by the door or a small dish. Then, you’ll know exactly where to look next time you need to leave the house."
    },
    {
      "title": "Use a lanyard or keychain to make your keys bigger.",
      "content": "Use a lanyard or keychain to make your keys bigger. Small, one-colored car keys can be easy to miss. Attach a bright lanyard or a fun keychain to your keyring to make them easier to spot. Plus, a bulky keychain or a long lanyard makes it much less likely that you’ll drop your keys or they’ll accidentally slip out of your pocket."
    },
    {
      "title": "Leave a spare key with a friend or family member.",
      "content": "Leave a spare key with a friend or family member. When you buy a car, you usually get 2 sets of keys. Instead of throwing your spare key in a back closet somewhere, give it to a trusted friend or family member. That way, if you ever lose your keys again, you know exactly where your backup is."
    }
  ]
}