{
  "url": "https://www.wikihow.com/Stop-Fighting-With-Your-Sibling",
  "title": "How to Stop Fighting With Your Sibling",
  "steps": [
    {
      "title": "Put yourself in your siblings shoes if they are frustrating you.",
      "content": "Put yourself in your siblings shoes if they are frustrating you. Before you fight, think about why your sister may be in a bad mood. Ask yourself what you may have done to upset your brother. Maybe their frustrations are unrelated, or maybe you did something to upset them but don't realize it. Understanding how your sibling feels will help prevent an argument from happening."
    },
    {
      "title": "Talk about what is upsetting you with your sibling.",
      "content": "Talk about what is upsetting you with your sibling. Start a conversation so they understand why you are upset. Always talk nicely and calmly rather than raising your voice. Listen closely to what your sibling has to say. Make sure you let your sibling talk to you about their feelings too. If your sister says something to you, pay attention to her, rather than the TV or your cell phone. This will make your sister feel like you care. Avoid bringing up topics you know will start a fight, like your brother's report card grades, or your sister's new boyfriend."
    },
    {
      "title": "Create a system to prevent repeated fights from occurring.",
      "content": "Create a system to prevent repeated fights from occurring. Show your brother or sister you love them then after you talk about what is upsetting you, come up with a plan so that you can reduce the number of fights you have. Brainstorm a few healthy solutions, and decide upon a few options with your sibling. Maybe your system is taking turns choosing the TV show. Perhaps it works best for you to write out what you agree upon in a contract. If you want to use the bathroom to get ready for school, ask your brother if he could shower at night instead of in the morning. If he doesn't agree, maybe try showering at night yourself or try waking up 15 minutes earlier."
    },
    {
      "title": "Pause and relax so you don't make the fight worse if they are annoying.",
      "content": "Pause and relax so you don't make the fight worse if they are annoying. Calm yourself down by taking a few deep breaths or counting to 10. This will help you keep your cool. When you start to get defensive, most likely your sibling will too. Take a time-out, relax for a bit, and then come back to the conversation. [1] X Research source Pause for 5 seconds or 5 minutes--however long you need. If it helps, designate a cool off period and give each other space. Pause your conversation, and give each other some space. Work out your emotions individually rather than taking them out on each other. If you are having trouble relaxing, try listening to music or taking a walk. This will distract you and give you something else to think about, so you can come back and talk to your sibling calmly. If you want to do something nice for them, and help you both calm down, bring a family pet to the couch, or some other neutral area, and talk there, where you both have a calming influence, in this case, a pet, to cool the flames."
    },
    {
      "title": "Ignore obnoxious or rude comments to prevent a fight.",
      "content": "Ignore obnoxious or rude comments to prevent a fight. Siblings bicker, it’s part of the job. But, if your brother says something rude or obnoxious, try to ignore it and let it go. If you fuel his fire, then an argument might spark. Instead of telling him he is an idiot, just don’t say anything at all. If your sister teases you about your new shoes, just ignore her. If ignoring your sibling doesn't get them to stop, calmly and nicely say something like, \"Hey, can you please stop that?\""
    },
    {
      "title": "Apologize",
      "content": "Apologize to your sibling. It is best to apologize as the fight is happening, though apologize as soon as you can. Rather than lashing back, take responsibility for your behavior and apologize. If you did something wrong, apologize for what you did. If you are not in the wrong, you can still apologize to cool down the situation. [2] X Research source You will feel much better after you apologize. If you want to stop fighting with your brother or sister, remember that your goal is not to win an argument, but rather to get along. Say something like, “Hey Matt, I don’t want to fight. I’m sorry I was bored and started bothering you” or “I apologize for anything I’ve done.”"
    },
    {
      "title": "Use \"I\" statements to talk about your feelings.",
      "content": "Use \"I\" statements to talk about your feelings. Identify what is upsetting you, and tell your sibling how you feel. Start your sentence with \"I feel,\" and mention your thoughts and feelings involving the fight. \"I\" statements help you prevent future arguments by openly discussing your feelings. [3] X Research source Say something like, “Courtney, I feel really hurt that you are fought with me about borrowing your shirt. I asked for it before I took it.” You can also say, “I feel angry when you to make fun of me, even after I ask you to stop.\""
    },
    {
      "title": "Think back to past fights and look for repeating behavior patterns.",
      "content": "Think back to past fights and look for repeating behavior patterns. Think back on your last few arguments with your brother or sister. Are these fights similar at all? Can you think of any common themes or feelings? Looking at how you handled something before may give you an idea about why you are fighting now. [4] X Research source Consider the last time you and your brother fought over the TV remote. Why does this keep happening? Because you don't agree on what to watch, or because you want to be the one to choose? Maybe you continue to fight with your siblings because neither of you thinks you are wrong when if you realized you were the one who started the argument first, you could stop the fight from happening."
    },
    {
      "title": "Reach a solution together in case the fight happens again.",
      "content": "Reach a solution together in case the fight happens again. Talk about ways you can prevent this from happening again, like telling a joke or maybe leaving each other alone. Find what works for the both of you and commit to trying these solutions. Maybe you are upset with your brother because he teases you and calls you names, so every time you talk, you are defensive. Agree together that he will stop calling you names, and let go of the expectation that he will be mean to you. Then, you can both have fun together at the park"
    },
    {
      "title": "Ask your parents for help if you need to.",
      "content": "Ask your parents for help if you need to. If you and your sibling continue to fight, or if you can’t reach a conclusion, it is time to get Mom or Dad involved. They can offer a voice of reason and help you talk about the problem. Ask them for help, and they can offer ways to solve your fighting. [5] X Research source Say something like, “Dad, Ashley won’t stop changing the channel when I am watching cartoons. I have asked her to stop nicely but she won’t. Can you help?”"
    },
    {
      "title": "Respect your sibling’s personal space and privacy.",
      "content": "Respect your sibling’s personal space and privacy. You are family, though that doesn’t mean you should know everything about each other’s personal lives. Be respectful of personal space, like bedrooms, journals, or cell phones. Remembering your sibling’s boundaries will show them your love and respect. Don't read their journal or snoop around in their room when they aren't home."
    },
    {
      "title": "Express your emotions and feelings in healthy ways.",
      "content": "Express your emotions and feelings in healthy ways. When you feel angry or upset, you will likely start a fight. Work on your emotions in healthy ways rather than taking them out on the people close to you. [6] X Research source Try venting to a friend or to your parent about what is on your mind. This will get rid of your feelings so you don't carry them with you next time you talk to your brother. If you’re really angry with your brother, rather than yelling at him, try writing a letter. This is a safe place for you to vocalize your true feelings, without maybe saying harsh things to him right away. After you've written your letter, you'll be able to discuss your feelings calmly."
    },
    {
      "title": "Do something nice for your sibling to show you love and care for them.",
      "content": "Do something nice for your sibling to show you love and care for them. It’s easy to forget your sibling’s friendship if you’re stuck fighting all the time. Show your brother or sister you appreciate them by doing something nice, for no reason. It’s easy to take your family for granted. You can do things like buy them ice cream or a coffee when you are running errands. Also try things like playing their favorite game together, or buy them a new coloring book or magazine."
    },
    {
      "title": "Spend meaningful time together, as often as you can.",
      "content": "Spend meaningful time together, as often as you can. Whether you share a room with your sibling or you live across the country from each other, it’s important to spend time together when you can. Spend time together that is positive and fun, rather than spent arguing. This will strengthen your relationship and you are less likely to fight. Do an activity you both enjoy, like playing golf, walking in the park, or watching a sci-fi movie."
    },
    {
      "title": "Build trust by following through with your commitments.",
      "content": "Build trust by following through with your commitments. If you tell your brother that you will stop teasing him, do it. Be accountable to what you agree upon, and your sibling will start to trust you. Trust is important to maintain healthy relationships and prevent fights. If you both agree your fights are starting because you want to be the boss, stop ordering around your sibling and let them make decisions. If your sister doesn't trust you because you always shoot her with your Nerf gun, try shooting a stationary target outside instead."
    }
  ]
}