{
  "url": "https://www.wikihow.com/Write-a-Notable-Editorial",
  "title": "How to Write a Notable Editorial",
  "steps": [
    {
      "title": "Pick your topic and angle.",
      "content": "Pick your topic and angle. Editorials are meant to influence public opinion, promote critical thinking, and sometimes cause people to take action on an issue. Your topic should be current, interesting, and have a purpose. There are generally four types of editorials: [2] X Research source Explaining or interpreting : This format is used to explain how and why a newspaper or magazine took a certain stance on a controversial subject. Criticizing : This format criticizes actions or decisions made on a third party's part in addition to offering a better solution. It's more to get the readers to see that there is a larger problem at hand. Persuading : This type is used to move the reader to action, concentrating on solutions, not the problem. Praising : This format is used to show support for people and organizations in the community that have done something notable."
    },
    {
      "title": "Get your facts straight.",
      "content": "Get your facts straight. An editorial is a mix of fact and opinion; not solely the writer's opinion, but the opinion of the entire staff. Your fact collection should include objective reporting and research. A good op-ed needs to contain at least one \"point of enlightenment\" which can be described as \"an observation that is fresh and original.\" So, get your facts from a number of different sources, pointing out patterns, impending consequences, or a hole in current analysis."
    },
    {
      "title": "Keep it user-friendly.",
      "content": "Keep it user-friendly. Typically, editorials are for a fairly quick, captivating read. They are not meant to go on for pages and pages, belaboring the point. Nor are they meant to make the average Joe feel as if he's missed something. Make sure your editorial isn't lengthy or overly esoteric. Keep it to about 600-800 words. Anything longer and you risk losing your reader. A short, snappy, fiery piece is much more captivating than a wordy lecture. Eliminate the jargon. Your audience is reading your article for information on something they seek to understand; using technical terms or specific jargon may be off-putting and make your article difficult to take in. Keep the lowest common denominator in mind."
    },
    {
      "title": "Start your editorial with a thesis-like statement.",
      "content": "Start your editorial with a thesis-like statement. The introduction--the first one or two paragraphs--should be designed to catch the reader's attention. You can start with a rich question, a quote, or you can summarize what the whole editorial is about. Clearly state your argument. The rest of your editorial will be based on supporting this opinion. Make it as striking as possible. However, in doing so, never use \"I\"--it diminishes the strength and credibility of the paper and sounds rather informal. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Lead with an objective, unbiased explanation of the issue.",
      "content": "Lead with an objective, unbiased explanation of the issue. The body of your work should explain the issue objectively, as a reporter would, and tell why this situation is important to the reader or community as a whole. Include who, what, when, where, why, and how. Cover all your bases and pull in facts or quotations from relevant sources. This ensures that every reader has at least a base knowledge (and an non-skewed one) of the topic at hand."
    },
    {
      "title": "Present the opposing argument first.",
      "content": "Present the opposing argument first. Make sure to identify the groups who oppose you or else the movers of the debate will become foggy. State their opinions objectively, using accurate facts or quotations. Never use slander. It is fine to state positive things about the opposing side, as long as they're factual. It shows that you are taking the moral high road and giving a balanced overview. If you neglect to air the good side of your opposition, your editorial will come off biased and uninformed. Give the opposition an actual argument, and a strong one at that. You gain nothing from refuting a non-issue. Make it clear their beliefs and what they're advocating."
    },
    {
      "title": "Present your reasons/evidence that directly refute the opposition.",
      "content": "Present your reasons/evidence that directly refute the opposition . Begin this section with a transition, clearly flowing from their argument to yours. Utilize facts and quotations from others who support your opinion. Start with strong reasons that only get stronger. Don't feel limited to existing opinions--add your own, too. Whatever your reasons are, make sure to clearly come down on one side of the argument; there is no room for gray area here. Literary allusions are appropriate. It can lend to your credibility and learnedness. Call to mind images of persons or times in the past that present an imagery to your reader."
    },
    {
      "title": "Make your solution known.",
      "content": "Make your solution known. This is different than reasons and evidence. If you believe cutting the defense budget is wrong, what would you rather cut instead? Putting your solution out there is imperative to addressing the problem. If you don't have one, any solution is better than yours. Your solution needs to be clear, rational, and doable. It cannot only work in a vacuum. What's more, it should be compelling. Ideally, your readers will be drawn to action with the information and answers you've presented."
    },
    {
      "title": "Conclude your editorial with a punch, a noteworthy statement that would forever engrave the editorial into the reader's mind.",
      "content": "Conclude your editorial with a punch, a noteworthy statement that would forever engrave the editorial into the reader's mind. Use quotes or a question that would make the readers think hard. (e.g. If we will not take care of the environment, then who will?) End with a hard-hitting summary; you may have a few readers who scanned your piece absentmindedly. All in all, your audience should leave feeling more informed and moved to do something further about the issue."
    },
    {
      "title": "Proofread your work.",
      "content": "Proofread your work. A great piece is not great if it's riddled with spelling, grammar, and punctuation errors. Have someone on your team look over your work- two minds are always better than one. If you're working as part of an organization, make sure you haven't misrepresented their viewpoints. Allow your group to go over the piece to make sure everyone (at the very least, the majority) is behind the arguments you're about to make public. They can, simultaneously, present questions or ideas that you may have missed or glossed over."
    }
  ]
}