{
  "url": "https://www.wikihow.com/Use-Smart-View-on-Android",
  "title": "3 Ways to Mirror your Android Screen Using Smart View",
  "steps": [
    {
      "title": "Connect your Samsung Smart TV and Android phone to the same Wi-Fi network.",
      "content": "Connect your Samsung Smart TV and Android phone to the same Wi-Fi network. This ensures that the two devices can connect. [1] X Research source If you have a Samsung Galaxy phone, you can use Smart View, which is built into your phone, to mirror your screen to your TV. On other Androids, you can use the Screen Cast feature to mirror your screen or use the SmartThings app to cast to your TV using Smart View. [2] X Research source"
    },
    {
      "title": "Tap SmartView or Screen Mirroring on the Quick Access menu.",
      "content": "Tap SmartView or Screen Mirroring on the Quick Access menu. Swipe down from the top of the Home screen twice, then tap one of these options on the bottom. This opens a list of devices you can connect to. On some Android phones, this option may say \"Screen Mirroring\" instead. If you don’t see one of these options, you may have to swipe right to the second page of notification tiles. Alternatively, you can access Smart View in the Settings menu on Samsung Galaxy phones under \"Connected Devices.\""
    },
    {
      "title": "Select your TV.",
      "content": "Select your TV. If you are using a non-Samsung Android phone, your screen will now be mirrored to your TV . If you are using a Samsung Galaxy, you can select how you want to mirror your screen to your TV. On some apps, you can turn your phone sideways to see the phone's screen in landscape mode."
    },
    {
      "title": "Select Full screen or Multi View (Samsung only).",
      "content": "Select Full screen or Multi View (Samsung only). Tap the radio option below whichever mode you want to use. \"Full screen\" will fill your TV's display with your Android's screen, while Multi View shows your TV and phone screens in two separate windows."
    },
    {
      "title": "Tap Start Now.",
      "content": "Tap Start Now . This sends the screen mirroring request to your TV."
    },
    {
      "title": "Select Allow on the TV.",
      "content": "Select Allow on the TV. You can now see your phone screen on your TV. Any videos, pictures, games, or other content you play on your phone will now display on your TV. Additionally, you'll hear audio through the TV. Some Samsung Galaxy phones may connect with Smart View automatically."
    },
    {
      "title": "Connect your Samsung Smart TV and Android phone to the same Wi-Fi network.",
      "content": "Connect your Samsung Smart TV and Android phone to the same Wi-Fi network. This ensures that the two devices can connect. [3] X Research source"
    },
    {
      "title": "Install the SmartThings app on your phone.",
      "content": "Install the SmartThings app on your phone. If you have a Samsung smart TV but not a Samsung phone, you can download the SmartThings app from the Google Play Store to bring Smart View capability to your phone. [4] X Research source Here’s how to get it: Open the Play Store Type smartthings into the search bar. Tap the SmartThings app by Samsung Electronics Co. Tap INSTALL ."
    },
    {
      "title": "Open the SmartThings app.",
      "content": "Open the SmartThings app. It has a blue icon with five small circles connected to another small circle in the middle. Or, if you just finished installing the app, you can tap the green \"OPEN\" button to open it. The first time you open SmartThings, you will be asked to grant the app permission to access your phone's Wi-Fi network. Tap Allow to grant permission."
    },
    {
      "title": "Tap the Devices tab.",
      "content": "Tap the Devices tab. It's the second tab at the bottom of the screen."
    },
    {
      "title": "Select your TV.",
      "content": "Select your TV. This displays the remote and options menu for your TV."
    },
    {
      "title": "Tap the three-dot menu ⋮ and select Screen Mirror (Smart View).",
      "content": "Tap the three-dot menu ⋮ and select Screen Mirror (Smart View) . It's the icon with three dots in the upper-right corner."
    },
    {
      "title": "Select Full screen or Multi View (Samsung only).",
      "content": "Select Full screen or Multi View (Samsung only). Tap the radio option below whichever mode you want to use. \"Full screen\" will fill your TV's display with your phone's screen, while Multi View shows your TV screen and phone screen in two separate windows."
    },
    {
      "title": "Tap Start Now.",
      "content": "Tap Start Now . This sends the screen mirroring request to your Samsung TV."
    },
    {
      "title": "Select Allow on the TV.",
      "content": "Select Allow on the TV. You are now using Smart View to cast your phone's screen to your Samsung TV. Any videos, pictures, or music you play on your phone will display on the TV screen."
    },
    {
      "title": "Open the app you want to cast to the smart TV.",
      "content": "Open the app you want to cast to the smart TV. Whether you're using a Samsung Galaxy or any other Android, you can mirror many streaming apps from your phone screen to any smart TV from the app itself. Open an app like YouTube, Hulu, or Netflix to start mirroring your screen to a TV."
    },
    {
      "title": "Tap the cast icon in the app .",
      "content": "Tap the cast icon in the app . The placement of this icon varies by app, but you’ll usually find it at the top-right corner of the app. Look for the rectangle with Wi-Fi waves at its bottom-left corner. This will open a list of devices you can connect to on your network."
    },
    {
      "title": "Select a smart TV or streaming device.",
      "content": "Select a smart TV or streaming device. This can be a Samsung TV or any other smart TV or streaming device that supports Smart View or Chromecast . This will connect the app on your phone to your TV or streaming device."
    },
    {
      "title": "Select something to play.",
      "content": "Select something to play. The selected video or song will play on the TV but not the phone, which means you can still use your phone while streaming. You can control the playback using your phone screen."
    }
  ]
}