{
  "url": "https://www.wikihow.com/Store-Used-Coffee-Grounds",
  "title": "How to Store Used Coffee Grounds",
  "steps": [
    {
      "title": "Put your grounds on a baking sheet lined with newspaper.",
      "content": "Put your grounds on a baking sheet lined with newspaper. Keep the grounds no more than 2–3 inches (5.1–7.6 cm) thick. This will help you dry your grounds faster and will reduce the chance of them developing mold [1] X Research source"
    },
    {
      "title": "Place the baking sheet outside in the sun.",
      "content": "Place the baking sheet outside in the sun. Try to find a spot that receives sunlight for most of the day. Coffee grounds are often used as a deterrent for neighborhood pests, so you don’t need to worry about critters getting into your grounds. If you aren’t able to put your baking sheet outside, you can also put it on a counter that receives direct sunlight."
    },
    {
      "title": "Leave the baking sheet in the sun for 2-3 days.",
      "content": "Leave the baking sheet in the sun for 2-3 days. If you are placing your grounds outside, be aware of the weather. If you are experiencing windy conditions or if there is rain in the forecast, remember to bring your grounds back indoors!"
    },
    {
      "title": "Rotate the grounds and change out the newspaper once a day.",
      "content": "Rotate the grounds and change out the newspaper once a day. This will help make sure the damper grounds on the bottom get moved to the top of the tray."
    },
    {
      "title": "Preheat your oven to 200 °F (93 °C).",
      "content": "Preheat your oven to 200 °F (93 °C). You may be tempted to crank up the heat to dry your grounds faster, but a low temperature will keep your grounds from burning."
    },
    {
      "title": "Spread your grounds on an unlined baking sheet.",
      "content": "Spread your grounds on an unlined baking sheet. Try to make the grounds as level as possible, and keep the grounds no more than 2–3 inches (5.1–7.6 cm) thick."
    },
    {
      "title": "Put your tray into the preheated oven and set a timer for 10 minutes.",
      "content": "Put your tray into the preheated oven and set a timer for 10 minutes. After 10 minutes, check the tray and flip your grounds over to help the heat distribute more evenly. Continue baking, checking and flipping your grounds every 10 minutes, until completely dry. Most batches will dry completely in 20-30 minutes. [2] X Research source"
    },
    {
      "title": "Remove your dried grounds from the oven and let them cool completely.",
      "content": "Remove your dried grounds from the oven and let them cool completely. You’ll be able to double-check that they have completely dried once they are cool, which is important to do before moving them into containers."
    },
    {
      "title": "Find an airtight container in which to store your grounds.",
      "content": "Find an airtight container in which to store your grounds. You can use glass mason jars with lids or airtight plastic containers. [3] X Research source If opting to use a plastic container, make sure to invest in one that’s airtight. A normal tupperware container won’t give you that tight close you need to keep your grounds safe."
    },
    {
      "title": "Clean and dry your container completely.",
      "content": "Clean and dry your container completely. Do this before moving your dried grounds from your baking sheet to the container. Any moisture or dirt could contaminate a batch of your newly dried grounds."
    },
    {
      "title": "Fill up your container with your dried grounds using a large spoon or a measuring cup.",
      "content": "Fill up your container with your dried grounds using a large spoon or a measuring cup. The fuller the container, the less air the grounds will come into contact with, so don't be afraid to really compact the grounds and fill the container to the brim."
    },
    {
      "title": "Put a strip of newspaper on top of the grounds before sealing the lid.",
      "content": "Put a strip of newspaper on top of the grounds before sealing the lid. This will help to absorb any potential moisture that may make its way into the space."
    },
    {
      "title": "Store your used grounds in a cool, dry place.",
      "content": "Store your used grounds in a cool, dry place. Depending on your climate, even airtight containers can still sometimes allow moisture to enter. Keeping the containers cool and dry minimizes that risk."
    },
    {
      "title": "Check your grounds every 1-2 months.",
      "content": "Check your grounds every 1-2 months. This is a time to change out the newspaper strip and check the grounds to make sure they are still dry. If dried and stored properly, your grounds can last for 1-2 years!"
    }
  ]
}