{
  "url": "https://www.wikihow.com/Write-About-Languages-in-Your-CV",
  "title": "Effective Ways to Write About Language Skills in a CV or Resume",
  "steps": [
    {
      "title": "Include languages in your “skills” if it isn’t a requirement for the job.",
      "content": "Include languages in your “skills” if it isn’t a requirement for the job. If you aren’t applying to a position where your language skills are particularly relevant, there’s no need to take up precious space by giving them a dedicated section. Just list the languages you speak in the “skills” section alongside your other talents. [1] X Research source You may want to do it this way if you’re a financial worker, biologist, retail professional, or engineer. Basically, if you aren’t interacting with international customers, students, or foreign clients, it’s not worth a separate section."
    },
    {
      "title": "Create a separate “languages” section if it’s relevant to the job.",
      "content": "Create a separate “languages” section if it’s relevant to the job. If you’re applying to a job that revolves around foreign language knowledge or you need to be fluent in a language in order to be qualified, create a dedicated section to highlight your language skills. Place this section after your “skills” section and label it “languages.” This will make them stand out on the page and let the person reviewing your CV know that you’re qualified for the job. [2] X Research source You may want a separate section if you’re a teacher, translator, tutor, or in academia. If you really want to call attention to your language skills, you can place the “languages” section right below your “profile” or “summary.” You should probably include a languages section if you’re going to be traveling a lot for the job or if you’re going to be interacting with a lot of customers or clients that speak a particular language. You can still list the languages the same way you’d list skills, but you should still make it a separate section so it’s easy to find on the CV."
    },
    {
      "title": "Reference your language skills in the “summary” if you want to highlight it.",
      "content": "Reference your language skills in the “summary” if you want to highlight it. If you really want to sell your ability to speak, write, or read a language, you can mention it briefly at the beginning of the CV. This is a great option if you really want to lean on your language skills or if the job explicitly requires you to be bilingual. Mentioning it early will give your potential employer a good snapshot of your language skills before they scan the rest of the CV. [3] X Research source For example, you may write, “Creative and bilingual instructor with over 5 years of classroom experience.” You could also say, “As a fluent writer in multiple languages, successfully crafted over 100 action plans for foreign-based clients.” As an aside, you never use the pronoun “I” in your CV—even in the summary section. In order to write a strong career summary, it’s helpful to understand your key skills and which of those skills map to the competencies needed in the positions you are applying for. The summary should be brief — no more than two-three sentences — as you want to ensure the experience section of your resume doesn’t get bogged down by keywords or a lengthy overview."
    },
    {
      "title": "Use the basic-to-fluent spectrum to describe your proficiency.",
      "content": "Use the basic-to-fluent spectrum to describe your proficiency. Whether you’re creating a separate section or not, it’s important to describe your languages accurately. Use the proper adjective to describe each language skill. Either use the adjective followed by the language (“fluent in Spanish”), or list the language and put your skill level in parentheses (“Spanish (fluent)”). The proper descriptions and their meanings are as follows: Basic, or beginner – You have an elementary understanding of the language but you may have trouble in a conversation. In most cases, it isn’t worth mentioning basic language skills on a CV. [4] X Research source Conversational, or intermediate – You can hold a simple conversation and interpret common phrases/sentences with ease. You may struggle with context-dependent sentences, or misunderstand subtext. Advanced, or proficient – You can talk to any native speaker and understand them, but may need to focus to form complex sentences yourself. You may not know as many words, or speak as smoothly as someone native in the language. Fluent – You can speak, read, and write more-or-less perfectly in the language. You have no issues understanding native speakers."
    },
    {
      "title": "Note if you can’t read, write, or speak at the same fluency level.",
      "content": "Note if you can’t read, write, or speak at the same fluency level. If you are an advanced writer in a language but you can’t realistically speak it, be honest about it. Adjust your description to highlight your strength and leave the other bits out. There are four elements of language: reading, writing, speaking, and listening. You don’t need to mention listening, but you should definitely call attention to the other 3 if you aren’t equally skilled in every area of that language. [5] X Research source For example, you may write, “Hungarian (fluent speaker, advanced writer),” or, “Conversational speaker in English.” Just to clarify, you don’t need to write “French (fluent speaker, reader, and writer).” If you’re fluent, just write, “French (fluent),” or, “Fluent in French.”"
    },
    {
      "title": "Include the CEFR labels for jobs in academia or Europe.",
      "content": "Include the CEFR labels for jobs in academia or Europe. The Common European Framework of Reference for Languages (CEFR) is a standardized format for foreign language skills. Universities and educational institutions use this scale, as do most European companies that require a CV. If either of these apply to your situation, include the CEFR label in parentheses. The scale is as follows: [6] X Research source A1 – You have a very basic understanding and can hold rudimentary conversations. A2 – You understand common phrases and can communicate in basic situations. B1 – You comprehend simple conversations and can communicate well with average speakers. B2 – You can engage in specialized conversations and read/write effectively in the language. C1 – You can complete complex tasks in the language and speak in a detailed, structured way. C2 – You are indistinguishable from a native speaker and can speak, read, and write fluently."
    },
    {
      "title": "Combine CEFR labels and a standard description to play it safe.",
      "content": "Combine CEFR labels and a standard description to play it safe. Since every hiring manager may not know the CEFR labels, include them in parentheses if you’re applying for a job at a university or in Europe. This way, people familiar with the CEFR scale will see that you know enough about language skills to include it, while people that don’t know the scale will still understand your fluency level. [7] X Research source For example, you may write, “Fluent in Afrikaans (C2),” or, “Afrikaans (fluent – C2 on the CEFR scale).” Another way to do it would be to write, “Basic speaker (A2) and conversational writer (B2) in Spanish,” or, “Basic Spanish speaker (A2) and conversational writer (B2).”"
    },
    {
      "title": "Include a short, detailed description if you want to explain a little.",
      "content": "Include a short, detailed description if you want to explain a little. In most cases, simply listing your language skills is appropriate. However, you can turn each entry into a complete sentence if you’d like a little more room to describe your skills. This may be a good idea if you’re applying to a job that specifically requires or deals with foreign language skills, like if you’re applying to be an adjunct linguistics professor. [8] X Research source You may write, “Highly proficient speaker and advanced writer in Russian,” or, “Thorough understanding of written Russian and proficient conversational speaker.” Only do this if you explain your other skills the same way. You want the languages to match the rest of the CV visually and in terms of formatting."
    },
    {
      "title": "Format the language information the same way you format everything else.",
      "content": "Format the language information the same way you format everything else. Whether you’re creating a separate “languages” section or not, you don’t need to call special attention to your language skills by formatting them differently than the rest of the CV. Use the same bullet point style, typeface, and font size that you use in the rest of the CV. If you aren’t using bullet points for your “skills” section and you’re adding a separate “languages” section, don’t use bullet points. As a rule of thumb, your “languages” should match your “skills” format. For example, if you’re using commas to offset skills, the “languages” section may look like this: Arabic (fluent), English (fluent), Dutch (conversational)"
    },
    {
      "title": "List your bullet points in order from most- to least-relevant for the job.",
      "content": "List your bullet points in order from most- to least-relevant for the job. If you speak multiple languages, arrange them so that the most important language comes first. It’s up to you whether you’d like to include the language you used to write the resume since it’s assumed you know it. Still, feel free to include it if you want to make it clear. Just make sure it appears first if it’s the language the company or school uses. For example, if you’re applying to a job in France, your “languages” section may look like this: French (fluent – C2) English (fluent – C2) Russian (conversational – B1)"
    },
    {
      "title": "Include any certifications or tests that demonstrate your fluency.",
      "content": "Include any certifications or tests that demonstrate your fluency. If you’re a licensed teacher in your language or you’ve completed a proficiency test, include this in your “certifications” section. This provides concrete evidence that you have meaningful knowledge of a language, and it makes your application more attractive for hiring managers. [9] X Research source For example, if you’re applying to teach English in Japan, you may include the International English Language Test (IELTS), or the Test of English as a Foreign Language exam (TOEFL). [10] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source Every language has its own proficiency tests and licenses, so you’re going to have to look up specific exams in your language if you want to pursue them. For example, the Diploma de Español como Lengua Extranjera (DELE) is a Spanish certification, while the TORFL-1 is a Russian certification. [11] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source You may also include something like a foreign language teaching license. For example, you may write, “Pennsylvania Teaching Certificate – Instructional 1: Spanish, grades 7-12.”"
    },
    {
      "title": "Provide citations for foreign-language publications or presentations.",
      "content": "Provide citations for foreign-language publications or presentations. If you’ve published anything in another language, list this information under the “publications” section. For written work, include an MLA or APA citation (depending on your discipline). For presentations, include a date, the name of the event, and a short description of what you did. Include presentations in the “presentations” section. [12] X Research source For example, you may write, “Wilson, L. (2018). Un Análisis de T.S. Eliot. Revisión Literaria . 86-90.” to demonstrate that you’ve published work in another language. Be sure to use the untranslated title of the journal or book to signal it’s in a foreign language! You may also write, “Hosted a 20-minute lecture on Russian grammar and sentence formations at the 2016 Moscow Language Conference.”"
    },
    {
      "title": "Add a reference that can speak to your language skills if you have one.",
      "content": "Add a reference that can speak to your language skills if you have one. You typically list contact information for references at the end of the CV. If you’re adding this information, include at least one reference that can comment on your language proficiencies. If you are asked to include reference letters, ask one of the references to describe your language skills in their letter. When asked to provide references, place the letters in a separate folder or PDF file. [13] X Research source This is especially important if you’re applying for a job or position that requires proficiency in a specific language."
    }
  ]
}