{
  "url": "https://www.wikihow.com/Strengthen-Your-Lungs-After-Having-Pneumonia",
  "title": "How to Strengthen Your Lungs After Having Pneumonia",
  "steps": [
    {
      "title": "Practice deep breathing.",
      "content": "Practice deep breathing. Deep breathing helps to recover lost lung capacity. Begin either in a sitting or standing position. Place your hands on your waist and relax. Inhale as much air as possible. When you reach the maximum capacity of your lungs, hold your breath for 5 seconds. Exhale as much air as possible. Make sure that you exhale slowly and empty the lungs completely or as much as your health level permits. [1] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source Repeat the procedure 10 times in each set. It is advisable to do 3-4 sets of deep breathing exercises throughout the day."
    },
    {
      "title": "Do pursed-lip breathing.",
      "content": "Do pursed-lip breathing. Perform pursed-lip breathing will help you increase the oxygen intake of your lungs, while decreasing the amount of carbon dioxide. Start by relaxing your entire body. You can do this in a sitting or standing position. Inhale through your nose within a span of 3 seconds. Before you exhale, you need to purse your lips as if you are going to kiss somebody. Exhale through your pursed lips within a span of 6 seconds. Inhale and exhale slowly. Don’t force the air to come in and out of the lungs. [2] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021. Repeat the procedure. Pursed-lip breathing is done when the patient has shortness of breath. This breathing exercise should be repeated until shortness of breath is diminished. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try breathing from your diaphragm.",
      "content": "Try breathing from your diaphragm. The diaphragm is the muscle that pushes and pulls air in and out of the lungs. Start by lying down on your back and bend your knees. Place one of your hands on your belly and another hand on your chest. Take a deep breath. Let your belly and lower rib cage rise while making sure that the upper chest cavity won’t move. This is the challenge you need to overcome in diaphragm breathing. Inhaling should take about 3 seconds. Exhale for 6 seconds. You need to purse your lips as well to better control your breathing. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Repeat the whole procedure. At first, this exercise might be difficult for you. However, more practice and repetition of this exercise can train the diaphragm and will eventually increase your lung capacity. As time passes by, diaphragm breathing will become easier."
    },
    {
      "title": "Practice huff-cough breathing.",
      "content": "Practice huff-cough breathing. Doing huff-cough breathing will help eliminate bacteria and respiratory secretions by triggering the cough reflex. Sit down or elevate the head of the bed if you can’t get up. Relax and prepare yourself. To do the huff-cough exercise: [5] X Research source Step 1: Perform 3 to 5 deep breathing exercises. Combine your breathing with the pursed-lips and diaphragm breathing exercises. Push out air as if you are coughing. When you have done 3-5 cycles of deep breathing, open your mouth but do not exhale yet. You need to hold your breath, tighten your chest and abdomen. Step 2: Force air out from the lungs in a fast manner. If you have done this correctly, you will elicit the cough reflex and loosened secretions stuck within your respiratory tract. If phlegm comes out, spit it out and repeat the whole procedure."
    },
    {
      "title": "Drink lots of water.",
      "content": "Drink lots of water. Drink 8 glasses of water if you are an adult. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For children, the amount of water depends on body weight. Water helps mucus in the lungs to become more liquid. Water or fluids helps mucus to be brought out of the lungs and the nose and mouth more easily. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This leads to better breathing. [8] X Research source Farrell JJ, Petrik SC. Hydration and nosocomial pneumonia: killing two birds with one stone (a toothbrush). Rehabilitation Nursing. 2009 Mar-Apr;34(2):47-50, 83."
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Regular exercise and physical fitness training helps our pulmonary system cope with disease. For most individuals who exercise at sea level, the lungs saturate arterial blood with oxygen more effectively than those who don’t. This means, if there is breathing limitation due to exercising at high altitudes, or asthma or other types of chronic obstructive pulmonary disease, those who actively exercise may need extra help with ventilation such as an inhaler. Always check with your doctor before starting a new exercise routine, especially if you are older or have other medical conditions. [9] X Research source Walking, running, swimming, and cycling are all excellent ways to restore your lungs’ strength. Before you exercise, begin by stretching and bending. Each exercise session should last about 20 to 30 minutes. Stop if you feel short of breath or have palpitations. [10] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source Even just going for a walk outside can make a difference. [11] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021."
    },
    {
      "title": "Quit smoking.",
      "content": "Quit smoking. Smoking is known for being dangerous to health. It is even worse for you if your lungs have been stricken by pneumonia. One effect of nicotine is constriction of the terminal bronchioles of the lungs, which leads to airflow resistance into and out of the lungs. When you are already having trouble breathing, you certainly don’t want your lungs to become even more constricted. [12] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source Nicotine also paralyzes the cilia, or the hair-like projections found in the cells that line the airways. Cilia help remove excess fluids and particles--paralyzing them will stop them from helping you remove excess fluids in your airways caused by your pneumonia. Another effect of smoking is the irritation from the smoke itself which causes increased fluid secretion into airway passages."
    },
    {
      "title": "Take your antibiotics as prescribed.",
      "content": "Take your antibiotics as prescribed. Even when you think you’re all good, you shouldn’t stop taking your antibiotics unless your doctor tells you to do so. People who suddenly stop taking these meds or who do not take their meds on time put themselves at risk for drug resistance. This means antibiotics may not be as effective as they could have been if you don’t follow your doctor’s prescription. [13] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source"
    },
    {
      "title": "Get enough vitamins and minerals.",
      "content": "Get enough vitamins and minerals. Good nutrition helps fight illness and a good balanced diet can give you the vitamins and minerals you usually need. For a little boost, intake of multivitamins or a tablet of Vitamin C once a day may help your immune system. Before starting any new vitamins and supplements, check with your healthcare provider. [14] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021. Adequate amounts of vitamins such as A, B complex, C, E, folic acid, and irons such as iron, zinc, selenium, and copper are required. These vitamins and minerals act as antioxidants and help the immune system fight diseases, especially infectious ones like pneumonia. Zinc sulfate is helpful in the reepithelialization, or in the repair of the lining of your airways. Vitamin D and beta-carotene supplements can also boost your immune system."
    },
    {
      "title": "Stop drinking alcohol",
      "content": "Stop drinking alcohol while you are recovering. Alcohol may decrease sneezing and coughing reflexes needed to remove mucus from the lungs, interferes with antibiotics or other medicines like those taken during a bout of pneumonia. [15] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source"
    },
    {
      "title": "Keep up to date on vaccinations.",
      "content": "Keep up to date on vaccinations. There are several vaccines that are available to prevent the occurrence of pneumonia. Pneumococcal and influenza (flu) vaccines are examples of those that can be given. Some vaccines are routinely administered to children, however, in certain circumstances, vaccines may also be recommended to adults. [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source There are two types of influenza or flu vaccine of vaccines. One of them is the \"flu shot\", which contains a killed influenza virus that is administered to a muscle using a syringe. It is given to those older than 6 months, including healthy people and people with chronic medical conditions. The other one is the nasal-spray flu vaccine, which contains live, weakened viruses. Because the viruses are weakened, they will not be strong enough to cause disease, but our body will be able to produce defenses against them. It is approved for use in healthy non-pregnant people who are 2-49 years old. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Cover your mouth when you cough or when someone coughs.",
      "content": "Cover your mouth when you cough or when someone coughs. Covering your mouth when you cough or someone else does will help you to avoid sharing germs, making it less likely you will get pneumonia again. It is also important to wash your hands anytime you are around someone who is coughing or sneezing. [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Ways to cover your mouth and nose include using tissue paper, your upper sleeve, or wearing a face mask. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Wash your hands regularly.",
      "content": "Wash your hands regularly. We can get and spread pathogens (disease-causing microorganisms) from our hands because we use them to cover our mouth when coughing, turn door knobs, handle food, rub our eyes and hold our children. Without washing, pathogens multiply on our hands and spread to everything we touch. The proper handwashing technique as prescribed by the Centers for Disease Control and Prevention (CDC), is as follows: [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Wet your hands with clean, running water. Apply soap and lather the backs of your hands, between your fingers, and under your nails by rubbing your hands together. For at least 20 seconds, scrub your hands. Rinse your hands well under clean, running water. Dry your hands."
    },
    {
      "title": "Clean things that you often touch regularly and thoroughly.",
      "content": "Clean things that you often touch regularly and thoroughly. As mentioned in the previous step, our hands are effective in spreading pathogens so cleaning objects that our hands usually touch will also prevent the spread of disease. [21] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Things that you should clean include: doorknobs, light switches and remote controls."
    }
  ]
}