{
  "url": "https://www.wikihow.com/Turn-Off-Secure-Boot-on-Surface",
  "title": "How to Disable Secure Boot on Surface 4, 3, and More",
  "steps": [
    {
      "title": "Boot into the Surface UEFI",
      "content": "Boot into the Surface UEFI . With your Surface powered down, hold the volume up key on the tablet (not keyboard) or the F6 key on Surface Laptop. Then press the power button. Keep on holding the buttons down. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If neither of these options work, then hold the shift key while restarting your computer, then go to Troubleshoot > Advanced options > UEFI firmware settings , and choose Restart ."
    },
    {
      "title": "Choose the Security tab.",
      "content": "Choose the Security tab. This tab is on the left pane of the UEFI screen. If text is upside down, then make sure that the keyboard cover connector is oriented downward."
    },
    {
      "title": "Choose Change configuration under \"Secure boot\".",
      "content": "Choose Change configuration under \"Secure boot\"."
    },
    {
      "title": "Choose None from the drop-down popup that appears.",
      "content": "Choose None from the drop-down popup that appears. If you are installing a third party signed operating system, choose Microsoft and 3rd party CA instead. Then choose OK ."
    },
    {
      "title": "Choose Exit and then Restart now.",
      "content": "Choose Exit and then Restart now . You know if your Surface has secure boot off if you see a red screen or red bar when you power it on."
    },
    {
      "title": "Boot into the Surface UEFI",
      "content": "Boot into the Surface UEFI . With your Surface powered down, hold the volume up key on the tablet (not keyboard). Then press the power button. Keep on holding the buttons down."
    },
    {
      "title": "Choose Secure boot control.",
      "content": "Choose Secure boot control ."
    },
    {
      "title": "Choose Disabled or Delete secure boot keys on the popup that appears.",
      "content": "Choose Disabled or Delete secure boot keys on the popup that appears."
    },
    {
      "title": "Choose Exit setup.",
      "content": "Choose Exit setup ."
    },
    {
      "title": "Choose Yes.",
      "content": "Choose Yes . You know if your Surface has secure boot off if you see a red screen or red bar when you power it on."
    }
  ]
}