{
  "url": "https://www.wikihow.com/Store-Food-in-the-Wilderness",
  "title": "How to Store Food in the Wilderness",
  "steps": [
    {
      "title": "Bundle the food you want to preserve in a plastic bag or thin fabric.",
      "content": "Bundle the food you want to preserve in a plastic bag or thin fabric. Slip your item or items into the bag and seal it up or fold the open end over. If possible, use a rubber band, hair tie, bungee cord, length of rope, or similar object to bind the material shut. [1] X Research source Items with thick skins or rinds like fruits and vegetables can be placed underground without any kind of protective covering. Just be sure to wash them thoroughly before you eat them! [2] X Research source Natural refrigeration can extend the “shelf life” of any type of food, including fresh items like produce, meat, dairy, and bread that would quickly go bad under normal circumstances."
    },
    {
      "title": "Dig a hole deep enough to completely cover the food.",
      "content": "Dig a hole deep enough to completely cover the food. Scoop out a few handfuls of soil in a secluded spot where the earth is relatively loose. Nestle your edibles at the bottom of the hole, being sure to arrange it in such a way that no part of it will be exposed or create suspicious lumps. [4] X Research source A hand trowel or small camp spade can help speed up the process. However, these tools are by no means a necessity. The better your bundle is tucked away, the less likely it is to attract hungry animals."
    },
    {
      "title": "Bury the food and cover the hole with moss, sod, straw, or leaves.",
      "content": "Bury the food and cover the hole with moss, sod, straw, or leaves. Refill the hole with the soil you removed earlier. Then, pull up one or more patches of loose ground vegetation and smooth it down over the refilled hole. If you do this right, it should be camouflaged almost perfectly. [5] X Research source If it’s wintertime or you’re in an area with a cold climate, pack a layer of snow or ice on top of the hole to make it completely unidentifiable and keep your food fresh even longer. [6] X Research source Find some way to plainly mark your hole. That way, you’ll be able to find it easily when you come back to dig it up. Your covering serves two important purposes—preventing atmospheric heat from infiltrating the cool subterranean compartment and concealing the hole from any scavengers roaming around in the immediate vicinity."
    },
    {
      "title": "Retrieve and eat your cached food within 2-3 days.",
      "content": "Retrieve and eat your cached food within 2-3 days. Your items could potentially last for months or even years down in the cool earth, so long as they’re not tainted by bacteria introduced through excess moisture. However, it’s wise to use them up at your earliest convenience to minimize the risk of contamination or animal theft. [7] X Research source You’ll know your food has gone bad if it gives off a foul smell or shows signs of molding, rotting, or discoloration. Ground moisture ordinarily has a way of accelerating food spoilage, but in this case, it will keep your edibles nice and cool in the short term. [8] X Research source"
    },
    {
      "title": "Dig a circular fire pit roughly 1–3 feet (0.30–0.91 m) deep.",
      "content": "Dig a circular fire pit roughly 1–3 feet (0.30–0.91 m) deep. Put shovel to earth until you’ve opened up a hole deep enough to put your foot in up to the ankle or knee. The exact depth and diameter of your pit doesn’t matter much as long as it’s big enough to hold a small mound of smoldering coals. [9] X Research source Things are going to get pretty smoky, so it’s a good idea to situate your fire pit away from your campsite. Doing so will also ensure that you’re not too close if the scent of smoking meat lures large, aggressive animals."
    },
    {
      "title": "Start a fire using dead, dry wood.",
      "content": "Start a fire using dead, dry wood. Gather a few armloads of choice wood from the surrounding area, dump them into your freshly-dug pit, and use a match or flint and steel to ignite your kindling and get a fire going . Tend the fire until all of the wood is alight, then allow it to burn itself out so that only a bed of glowing coals remains. [10] X Research source Oak, ash, apple, hickory, maple, and mesquite are among the best woods to use for smoking, if you know what you’re looking for. Rotten wood is generally safe to burn, but stay away from wood covered with lichens, fungi, or mold. These substances can be harmful if ingested by humans, so you definitely don’t want to infuse them into your food. [11] X Research source"
    },
    {
      "title": "Scatter damp wood over the coals to create more smoke.",
      "content": "Scatter damp wood over the coals to create more smoke. When your source wood has been reduced to embers, throw on a few broken sticks or handfuls of wood chips collected from areas that are partially wet. The combination of the intense heat generated by the coals and the residual moisture in the damp wood will immediately create an impressive column of smoke. [12] X Research source If the ground is dry as a bone, your canteen can supply the necessary moisture."
    },
    {
      "title": "Build a rudimentary smokehouse out of sticks over your fire pit.",
      "content": "Build a rudimentary smokehouse out of sticks over your fire pit. The easiest way to do this is to lean a few fallen branches together teepee-style, then suspend several smaller stickers across the middle section to create “racks” for hanging. In a pinch, you can also simply plant a pair of ‘Y’-shaped branches in the ground and place a third, straight stick in between. [13] X Research source Use lengths of rope, twine, or parachute cord to hold your structure together. Make sure your smoking racks are hovering at least 2–3 feet (0.61–0.91 m) over the coals. If your meat sits too close to the heat, it will burn up before it has time to fully cure. [14] X Research source"
    },
    {
      "title": "Cover the outside of the smokehouse with loose vegetation to trap the smoke.",
      "content": "Cover the outside of the smokehouse with loose vegetation to trap the smoke. Once you’ve completed construction on your makeshift smoker, you’ll need to find a way to partially enclose it. To do this, fill the gaps in the stick framework with patches of moss or sod, clumps of damp, compacted leaves, or handfuls of thick mud (or some combination of these materials). Make sure your covering is dense enough to hold in the majority of the smoke being released. [15] X Research source Other sorts of heat-safe objects can also be used to make an effective covering, such as sheets of scrap metal, a repurposed drum or barrel, or even a hollowed-out appliance. [16] X Research source The basic idea here is just to keep the smoke contained so it has plenty of time to circulate around the meat and draw out as much moisture as possible."
    },
    {
      "title": "Arrange your meat near the upper part of the smokehouse.",
      "content": "Arrange your meat near the upper part of the smokehouse. Hang thin slices on the racks high above the bottom of the pit. If you intend to smoke larger chunks or whole fish, it may help to rest them on “shelves” formed by a grid of sticks or two sticks of medium thickness running parallel to one another about 1–2 inches (2.5–5.1 cm) apart. [17] X Research source Try to get the meat as far from the coals as possible. Remember, you’re trying to smoke it, not cook it. [18] X Research source"
    },
    {
      "title": "Close up the smokehouse and let the meat sit undisturbed for 1-2 days.",
      "content": "Close up the smokehouse and let the meat sit undisturbed for 1-2 days. At the end of day 1, your cuts will have absorbed enough smoke to prevent them from going bad for about a week (when kept at room temperature). By the 48 hour mark, they may be so well-preserved that you’ll be able to munch on them for up to a month! [19] X Research source Avoid opening your smoker for any reason, unless it’s to add small amounts of dry wood here and there in order to keep the coals burning. Smoking in the wild can be a bit of a hit-or-miss venture. As such, there’s no guarantee that your homemade jerky will be edible for more than a few days. It’s always best to consume smoked goods as soon as possible. [20] X Research source"
    },
    {
      "title": "Clean fruits and vegetables thoroughly with fresh water.",
      "content": "Clean fruits and vegetables thoroughly with fresh water. Plunge each piece into a nearby stream, hold it under running fall, or pour some water over it from an unused drinking container. This will help to rinse off any dirt, debris, or harmful bacteria that might be clinging to the surface, which is crucial, since you won’t actually be cooking it. [21] X Research source Don’t worry if you don’t have a good way to clean your food. The drying process itself will usually be enough to kill off most illness-causing microbes, especially if you’re relying on the sun. Most fruits are ideal for sun-drying, thanks to their high sugar and acid content. [22] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source"
    },
    {
      "title": "Cut your food into strips no more than 1⁄4 inch (0.64 cm) thick.",
      "content": "Cut your food into strips no more than 1 ⁄ 4 inch (0.64 cm) thick. For large fruits and vegetables, 1 ⁄ 4 inch (0.64 cm) strips or slices will be ideal. For meat, poultry, and fish, aim to make each slice roughly 4 inches (10 cm) wide and 8–12 inches (20–30 cm) long. The thinner you can get the strips, the quicker and better they’ll dry. [23] X Research source While you’re doing your cutting, be sure to trim off any fatty, moldy, bruised, or discolored sections."
    },
    {
      "title": "Pick out a nice, sunny spot.",
      "content": "Pick out a nice, sunny spot. The key to successful sun-drying is to set up your materials where the sun’s rays can penetrate the small strips more or less constantly. As they do, they’ll slowly evaporate internal moisture and destroy any germs that try to settle on the surface. [25] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source Avoid shady areas, or those that only receive dappled or partial sunlight. They’ll be too dim to and too cool to stave off moisture-related spoilage and decomposition."
    },
    {
      "title": "Hang the food on an improvised drying rack.",
      "content": "Hang the food on an improvised drying rack. There are several ways you can rig up a drying rack. If you’re handy with a knife, you could construct a lattice of shaved sticks. For a simpler approach, simply lay out your food on a stump or board or drape them over a rope pulled taut between two trees or a found object such as a wire hanger. [26] X Research source Other items you can use to put together a DIY drying rack include steel grate, shoelaces, or a length of parachute cord. If possible, find a way to get your drying rack off of the ground and create more circulation around the food. Better airflow means a shorter drying time. There’s also less chance of it being swiped by marauding bears or raccoons this way. [27] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source"
    },
    {
      "title": "Let the food sit out in the sun for 6-10 hours a day.",
      "content": "Let the food sit out in the sun for 6-10 hours a day. You’ll know your items are ready when they’ve taken on a darkened, leather appearance and are mostly odorless. This could take anywhere from 2-4 days, or possible even longer, depending on the type of food you’re working with, the size of your individual pieces, and the amount of unfiltered sunlight you have available. [28] X Research source To encourage your items to dehydrate faster, turn them over about halfway through their daily allotted time in the sun. Also, be sure to bring them inside or move them to a dry, sheltered spot when night falls or it looks like rain. [29] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source More specific drying times can be tough to predict, as different foods have different structures and contain different amounts of moisture. When dried properly, most foods can remain edible for an almost indefinite amount of time."
    },
    {
      "title": "Pack your perishable provisions in a cooler.",
      "content": "Pack your perishable provisions in a cooler. When it comes to keeping things like meats, dairy, produce, bread, and canned and bottled beverages cold and fresh, a trusty cooler is a must. Due to their limited insulating abilities and short lifespan of the ice used to cool them, they’re most useful for trips lasting no longer than a few days. [30] X Research source A good general rule of thumb is to always park your cooler a minimum of 100 yards (91 m) away from your campsite in order to avoid up-close encounters with bears and other unwanted visitors. [31] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source You may be able to get more mileage out of your cooler foods if you have access to a ready supply of ice."
    },
    {
      "title": "Make use of the food locker at your campsite if it has one.",
      "content": "Make use of the food locker at your campsite if it has one. Campgrounds well-established places like national parks often provide guests with metal food storage lockers. These essentially function as freestanding outdoor pantries, complete with shelves or compartments to keep food separate and organized. Most food lockers offer enough room to stash a small or medium-sized cooler in addition to condiments, dry goods, toiletries, and other loose items. [32] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source It’s important to keep your locker closed and latched whenever you’re not using it. Otherwise, anyone—or anything—that wanders near will have no trouble getting inside. Read through the regulations for the campground you’re visiting carefully. In some cases, it may actually be not to use the food locker provided for you. If you’re caught storing your food out in the open, you could get slapped with a hefty fine. [33] X Research source"
    },
    {
      "title": "Hang your food in a tree if you’re posted up in an isolated spot.",
      "content": "Hang your food in a tree if you’re posted up in an isolated spot. Toss a length of rope or parachute cord over a high tree limb. Tie one end around a small cooler or insulated food bag and pull the other end to hoist the container up at least 20 feet (6.1 m) off the ground. Loop the loose end of the line around the base of the tree and tie it off tight. Your snacks will now be virtually untouchable! [34] X Research source Accessories like carabiners and ratchet straps can help you secure your storage container and ensure that it doesn’t slip out of its lofty nest. Store food generally about 100 feet away from where your tent is as not to attract any animals or critters. Bears, raccoons, squirrels, and other critters are expert tree climbers. You can thwart their attempts to make off with your supper by suspending your stash near the outer part of the limb, where it will be harder for them to reach."
    },
    {
      "title": "Pick up or dispose of all trash and uneaten food right away.",
      "content": "Pick up or dispose of all trash and uneaten food right away. As soon as you’re finished eating, put away your leftovers in resealable containers and dump your trash in a bear-proof waste receptacle. If there isn’t a dedicated dumpster near your campsite, place your rubbish in a separate sealed container and take it with you when you leave. If possible, take a few extra minutes to rinse your empty food packages, along with any dining ware you might have used, to deaden the scent it puts off. Don’t be tempted to bury your food scraps. They may be out of sight and out of mind to you, but nearby animals will still be able to track them down and dig them up. [35] X Research source"
    }
  ]
}