{
  "url": "https://www.wikihow.com/Tell-if-Your-Computer-Has-USB-2.0-Ports",
  "title": "How to Tell if Your Computer Has USB 2.0 Ports",
  "steps": [
    {
      "title": "Click on the “Start” button and select “Control Panel.",
      "content": "Click on the “Start” button and select “Control Panel. ” The Control Panel window will display on-screen."
    },
    {
      "title": "Click on “System and Maintenance” and select “Device Manager.",
      "content": "Click on “System and Maintenance” and select “Device Manager. ”"
    },
    {
      "title": "Double-click on, or open “Universal Serial Bus controllers.",
      "content": "Double-click on, or open “Universal Serial Bus controllers. ”"
    },
    {
      "title": "Verify whether any of the USB controllers in the list are labeled as “Enhanced.",
      "content": "Verify whether any of the USB controllers in the list are labeled as “Enhanced. ” If your USB controllers are listed as “Enhanced,” then your Windows computer has USB 2.0 ports installed. [1] X Research source"
    },
    {
      "title": "Open the Applications folder and select “Utilities.",
      "content": "Open the Applications folder and select “Utilities. ”"
    },
    {
      "title": "Open “System Profiler.",
      "content": "Open “System Profiler. ” The System Profiler window will open and display on-screen."
    },
    {
      "title": "Click on “USB” in the left pane under Hardware.",
      "content": "Click on “USB” in the left pane under Hardware."
    },
    {
      "title": "Review the list of USB ports in the top pane to determine whether your computer contains any USB 2.0 ports.",
      "content": "Review the list of USB ports in the top pane to determine whether your computer contains any USB 2.0 ports. Each USB port will be labeled specifically as “USB 1.0,” USB 2.0,” or “USB 3.0.” If the USB ports aren't labeled appropriately, click on each port and make note of the value next to “Speed” in the bottom pane. If the speed is listed as “480 Mbp/sec,” then the USB port is capable of 2.0 speeds. [2] X Research source"
    }
  ]
}