{
  "url": "https://www.wikihow.com/Use-Seeds-in-Minecraft-PE",
  "title": "How to Use Seeds in Minecraft PE",
  "steps": [
    {
      "title": "Understand what a seed is.",
      "content": "Understand what a seed is. In Minecraft, the \"seed\" is a set of letters and numbers that identifies a world created by the game's world creation program. It allows everyone with that seed to experience the same world, since the world generator will recreate the exact same results when the seed is entered. Note that if you use the seed of your world, it will generates a brand new world, and any progress you made (eg. making houses, making a farm, etc.) will not be shown in the new world."
    },
    {
      "title": "Understand that version changes affect how seeds work.",
      "content": "Understand that version changes affect how seeds work. Whenever the world generator function is updated in Minecraft PE, it will make seeds act differently than they did before. This is especially important with later versions of Minecraft PE that introduced \"Infinite\" worlds. Most sites that list seeds should also list the versions that they work for. \"Infinite\" worlds are levels that can stretch on forever, and they use a different creation method than \"Old\" worlds. This means that seeds for Old worlds will provide different results when used to create an Infinite world, and vice versa. Infinite worlds were added in Minecraft PE version 0.9.0, and are not available on some older devices."
    },
    {
      "title": "Find the seed you want to use.",
      "content": "Find the seed you want to use. There are tons of seeds out there. Most Minecraft fan sites have a Seeds section that contains lists of seeds along with a description of the world that will be created. Note that if the seed is a word, it doesn't necessarily mean that the word will relate to the world that is created. For example a seed named forest probably won't create a bunch of forests, and a seed named winter won't make a winter wonderland."
    },
    {
      "title": "Enter a seed when creating a new world.",
      "content": "Enter a seed when creating a new world. You will be able to enter your seed when you start a new game. On the \"Create a World\" screen, tap the \"Advanced\" button. Select your \"World Type\". For newer seeds, select \"Infinite\" unless the site specifically says otherwise. If you don't have the option to select \"Infinite\", you'll need to use an \"Old\" world seed because your device does not support Infinite worlds. Enter your seed into the \"Seed\" box. Seeds are case-sensitive, so make sure that you enter each letter correctly. An upper-case letter in a seed will create a completely different world than a lower-case one. Select your game mode. Seeds work for both Creative and Survival mode, so just pick the one you want to play and tap \"Create World\"!"
    },
    {
      "title": "Try some of these seeds.",
      "content": "Try some of these seeds. Here are a few seeds gathered from around the internet. These seeds are all for the \"Infinite\" world type. There are literally countless more, so give these a shot and then try to find your own! 1388582293 - This will create a world with a massive network of interconnected villages. [1] X Research source ferdinand marcos - This will start you in a flat world, perfect for building. 3015911 - This will start you directly above Diamond, Iron, and Redstone blocks, giving you a great early start. 1402364920 - This will create a very unique \"Ice Spike\" biome. 106854229 - This seed will create a Mushroom Island biome near your spawn, complete with Mooshroom. 805967637 - This seed will create an unassuming village near your spawn. If you jump down the well and break the brick, however, you'll uncover a massive underground stronghold just waiting to be explored. [2] X Research source infinity - This will create a forest with interconnected floating islands above."
    },
    {
      "title": "Find and share the seed for your current world.",
      "content": "Find and share the seed for your current world. Are you playing a random game and want to share your amazing world with your friends? You can find the seed for any of your saved worlds in the latest versions of Minecraft PE. Return to the main menu and press the \"Play\" button. This will open a list of all of your saved worlds. Tap the \"Edit\" button in the upper-right corner. Look underneath the file size for the world you want to share. You will see a set of characters. This is the seed for your world. Make sure you include all the characters when sharing it, including any letters or - ."
    }
  ]
}