{
  "url": "https://www.wikihow.com/Write-an-Outline",
  "title": "How to Write an Outline",
  "steps": [
    {
      "title": "Decide if you will write your outline by hand or type it.",
      "content": "Decide if you will write your outline by hand or type it. If you're preparing your outline just for your own use, choose what works best for you. If you're preparing your outline for an assignment, follow your instructor's directions. [1] X Research source Some people process their ideas better when they write them down. Additionally, you can easily draw diagrams or examples, which might help you conceptualize the subject. However, it might take longer to write out your outline, and it won't be as neat. Typing your outline might be easier if your notes are already typed on the computer, as you can just copy and paste them into your outline. Copying and pasting also allows you to easily rearrange your sections, if necessary. Also, it will be easier to copy and paste information from your outline into your paper if you type your outline. On the other hand, it's harder to jot down notes in the margins or draw out organizational diagrams."
    },
    {
      "title": "Narrow down your topic.",
      "content": "Narrow down your topic. Outlines help you organize your thoughts, ideas, or research regarding a topic. Without a main topic, your outline has no purpose. Your topic may be based on an assignment or could stem from a personal goal. [2] X Research source If you’re working on a creative project, such as a novel, identify your concept, genre, or premise. Then, allow the outlining process to help you structure your work. It’s okay if your topic is somewhat broad when you first start, but you should have a direction. For example, your history paper topic could be French life during the German occupation of France in World War II. As you write your outline, you might narrow this down to the resistance fighters called maquisards ."
    },
    {
      "title": "Identify the purpose of your outline, such as inform, entertain or reflect.",
      "content": "Identify the purpose of your outline, such as inform, entertain or reflect. Think about what you hope to accomplish with your outline. Will you complete an essay assignment? Write a novel? Give a speech? This allows you to determine what that essay, book, or speech will do for the reader. Typically, the purpose could be to inform the reader, entertain the reader or share the writer’s reflections with the reader. [3] X Research source"
    },
    {
      "title": "Know your intended audience.",
      "content": "Know your intended audience. In some cases, you’ll be writing an outline as a class or work assignment. However, many times you are preparing them for yourself, either to help you complete an assignment or to help you accomplish a goal. If the outline is for school or work, you need to follow the formatting instructions and present your ideas in a way that’s understandable to others. [4] X Research source For a school assignment, review the assignment sheet or talk to your instructor. If the outline is for work, use an existing outline as a model for yours. If you are the only person who will see the outline, you can choose formatting that works for you. For example, you might write your outline in shorthand."
    },
    {
      "title": "Assemble your notes, research or supporting materials, if applicable.",
      "content": "Assemble your notes, research or supporting materials, if applicable. In many cases, you’ll be incorporating information you gathered through research, note taking, or personal experience. It’s important to review this information before you start your outline because you’ll be pulling your points and subpoints from it. You might incorporate some of the following: [5] X Research source Paraphrased ideas Quotes Statistics Historical facts"
    },
    {
      "title": "Brainstorm to identify your argument or main ideas.",
      "content": "Brainstorm to identify your argument or main ideas. Jot down your ideas, important bits of research, and any questions you might want answered. For a creative project, you might write down scene ideas or plot points. Write down everything you might include in your outline. You can always eliminate ideas later! Here are some ways to organize your thoughts: [6] X Research source Freewrite as ideas come to you. Create a mind map . Write your thoughts on index cards."
    },
    {
      "title": "Develop a thesis or controlling idea for your outline.",
      "content": "Develop a thesis or controlling idea for your outline. In most cases, this will be the thesis you use to complete the final product, such as an essay. [7] X Research source However, it’s okay to use a general controlling idea or premise when outlining for a novel or study guide. [8] X Research source Your thesis will help guide your outline as you create sections and subsections organizing your information. For example, you may be writing a paper about policy change. Your thesis might read, “Policy makers should take an incremental approach when making policy changes to reduce conflict, allow adjustments, and foster compromise.” Each of the 3 reasons listed in your thesis will become its own main point in your outline."
    },
    {
      "title": "Write an alphanumeric outline for the easy approach.",
      "content": "Write an alphanumeric outline for the easy approach. Although you might not recognize the name, most outlines follow the alphanumeric format. Each level of your outline will be organized using a letter or number. Here’s how an alphanumeric outline is organized, moving from main ideas to subpoints: [9] X Research source Roman Numerals - I, II, III, IV, V Capitalized Letters - A, B, C Arabic Numerals - 1, 2, 3 Lowercase Letters - a, b, c Arabic Numerals in Parentheses - (1), (2), (3)"
    },
    {
      "title": "Make a decimal outline to highlight the relationship between ideas.",
      "content": "Make a decimal outline to highlight the relationship between ideas. A decimal outline looks very similar to an alphanumeric outline. However, a decimal outline only uses numbers, and each sublevel is set off with decimals. This allows you to illustrate that each sublevel is a part of a larger argument. Here’s how it might look: [10] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source 1.0 - Incremental policy change fosters compromise 1.1 - Both sides influence the policy 1.1.1 - Each side presents a case before the vote 1.1.2 - Citizens voice their opinion 1.2 - Neither side gets everything they want"
    },
    {
      "title": "Decide if you want to write full sentences or short phrases.",
      "content": "Decide if you want to write full sentences or short phrases. Most outlines include short phrases, which are also called topic outlines. However, using full sentences can help you better understand your ideas. If you’re writing a paper based on your outline, then full sentences will give you a head start on your final paper. [11] X Research source You might use short phrases to quickly organize your ideas, to outline a speech, or to create an outline that’s just for you. You might use full sentences to make it easier to write a final paper, to make a good study guide, or to fulfill the requirements of an assignment."
    },
    {
      "title": "Group your ideas together.",
      "content": "Group your ideas together. Review your brainstorming, placing related ideas in the same group. It’s okay if you have a lot of information at first. You can always eliminate ideas you realize are unnecessary. These groups will become main points, so narrow your groups down until you have your desired number of main points. For an essay or speech, that often means 3, but a creative piece may have more. [12] X Research source If you jotted down your ideas or made a mind map, use different colored highlighters to identify ideas that belong in the same group. Sort your index cards, if you used them to brainstorm. Put cards with related ideas together. For example, you can put them in stacks, or you can line your cards out in rows to make them easier to read."
    },
    {
      "title": "Put each group in order from broad ideas to specific details.",
      "content": "Put each group in order from broad ideas to specific details. Broad ideas are more likely to be your main points, while details are the bits of information you will use to support those ideas. Depending on the purpose of your outline, you may have many subpoints and supporting details. However, aim to have at least 2-3 subpoints and 2-3 supporting details for each main idea. [13] X Research source For example, your main point might be that Mary Shelley’s Frankenstein champions emotion over reason. Your subpoints might be that Victor Frankenstein is restored by nature and that his scientific efforts create a monster. As supporting details, you might include quotes from the book. If you're writing a story or presenting a historical argument, a chronological order makes sense. For an essay or speech, pick the subtopic with the most supporting materials, and lead with this argument. From there, order your major subtopics so each one naturally flows into the next. [14] X Research source Your broad ideas should connect back to your thesis or controlling idea. If they don’t, rewrite your thesis to reflect the main ideas you’re putting into your outline."
    },
    {
      "title": "Outline your introduction as the first main point for a speech or essay.",
      "content": "Outline your introduction as the first main point for a speech or essay. You can use either phrases or full sentences, depending on which you chose to use. Some people prefer to write out their introduction, which is also okay. Here are the points you need in your introduction: [15] X Research source Hook to grab the audience 1-2 general statements about your topic Thesis"
    },
    {
      "title": "Create your body headings, if you haven’t already.",
      "content": "Create your body headings, if you haven’t already. The outline headings are your main points. You’ll label these headings with Roman Numerals for an alphanumeric outline (I, II, III) or with Arabic Numerals for a decimal outline (1.0, 2.0, 3.0). If you’re writing an essay, this would be the body of your essay. These ideas should be drawn directly from your thesis or controlling idea. [16] X Research source For example, your outline heading for the main point presented above would look like this: Phrase outline: II. Frankenstein champions emotion over reason Full sentence outline: II. In Frankenstein , Mary Shelley champions the use of emotion over reason."
    },
    {
      "title": "Write at least 2 subpoints for each main idea.",
      "content": "Write at least 2 subpoints for each main idea. Your subpoints are the second level of your outline, so you’ll label them as A, B, or C for an alphanumeric outline or to 1 decimal place for a decimal outline (1.1, 1.2). These are the ideas that further explain your main point. In an essay, they might be your reasons for making your argument. In a creative work, they might be parts of your plot point. [17] X Research source Depending on the purpose of your outline, you might have more subpoints. For example, a novel may have many subpoints. Similarly, a study guide will likely have several subpoints, as well."
    },
    {
      "title": "Add at least 2 supporting details for each subpoint.",
      "content": "Add at least 2 supporting details for each subpoint. Supporting details back up or illustrate the point you’re making. They might include direct quotes, statistics, facts, or examples. This is the third level of your outline, so you’ll use Arabic Numerals for your alphanumeric outline (1, 2, 3). For a decimal outline, you’ll go to 2 decimal places (1.1.2). [18] X Research source In an essay, this is often where you “prove” your argument. For a creative work, you might include essential details you must include in that scene, such as an internal conflict in your main character. Similar to subpoints, you may have more supporting details, depending on your purpose. A novel or study guide will likely have more supporting details."
    },
    {
      "title": "Include more layers of your outline, if necessary.",
      "content": "Include more layers of your outline, if necessary. Most basic outlines will include 3 layers, but you may need more. If this is the case, you can continue creating sublevels using the formatting structure you chose, either alphanumeric or decimal. For example, you might need more layers to provide more details. In the Frankenstein example above, you might include a 4th layer to write out your commentary about the quotes you used to support your point. Here’s how you would continue your layering: [19] X Research source Alphanumeric: Roman Numeral Capital Letter Arabic Numeral Lowercase Letter Arabic Numeral in Parentheses Decimal: 1.0 1.1 1.1.1 1.1.1.1"
    },
    {
      "title": "Outline your conclusion, if you’re writing an essay or speech.",
      "content": "Outline your conclusion, if you’re writing an essay or speech. Don’t expect to write out your final conclusion, as it will be much easier to write it once you’ve completed the essay or speech. However, it’s a good idea to start organizing your thoughts. Your subpoints might include the following: [20] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Restate your thesis. 1-2 summarizing sentences. Write a concluding statement."
    },
    {
      "title": "Read over your outline to make sure you’ve achieved your purpose.",
      "content": "Read over your outline to make sure you’ve achieved your purpose. Your outline should relate back to your thesis or main idea, address the purpose you set out to achieve and reflect your audience. If it doesn’t, you may need to revise your outline. This also gives you a chance to look for missing parts or ideas that aren’t fully fleshed. If you see areas that leave questions unanswered, it’s best to fill in those gaps in information."
    },
    {
      "title": "Revise your outline if ideas are missing or not fleshed out.",
      "content": "Revise your outline if ideas are missing or not fleshed out. In some cases, you may need to add more information, such as additional supporting details. The revision process allows you to do that. You might also want to rewrite sentences or phrases to make your ideas clearer. [21] X Research source If you are making an outline for yourself, you might not worry about this."
    },
    {
      "title": "Edit your outline if you’re turning it in for an assignment.",
      "content": "Edit your outline if you’re turning it in for an assignment. Check for typos, grammatical errors, and formatting flaws. This will ensure you get full credit for your work. Keep in mind that it’s okay to have sentence fragments if you’re making a phrase outline. It’s a good idea to have someone else check it for errors, as it’s often hard to recognize errors in your own work. While you edit your outline, refer back to your assignment sheet or rubric to make sure you've completely fulfilled the assignment. If not, go back and correct the areas that are lacking."
    },
    {
      "title": "Add layers if necessary.",
      "content": "Add layers if necessary. If you need to add additional sub-layers, use lowercase Roman numerals (i, ii, iii, iv, etc.), then lowercase letters (a, b, c, d, etc.) and then finally switch to numbers again (1, 2, 3, 4, etc.). In most cases, three or four layers will be enough. Try to combine points first before you add a fifth. [22] X Research source You can use more layers if you want to include more information. You might also include additional layers for a long creative work or a detailed study guide."
    }
  ]
}