{
  "url": "https://www.wikihow.com/Update-iOS-Software-on-an-iPad",
  "title": "3 Simple Ways to Update iOS Software on an iPad",
  "steps": [
    {
      "title": "Connect your iPad to a power source.",
      "content": "Connect your iPad to a power source. Use the charging cable that came with your iPad to connect to a power outlet or desktop computer. Your iPad update may be paused if you have insufficient battery. While updating the iOS doesn't usually cause a loss of data, it's best to backup your device just in case."
    },
    {
      "title": "Connect to Wi-Fi.",
      "content": "Connect to Wi-Fi. If you aren't already connected to Wi-Fi, do so now. Larger iOS updates require your iPad to be connected to a Wi-Fi network in order to download."
    },
    {
      "title": "Open your iPad's Settings .",
      "content": "Open your iPad's Settings . This is the cog icon."
    },
    {
      "title": "Tap General.",
      "content": "Tap General. You can find this below Screen Time ."
    },
    {
      "title": "Tap Software Update.",
      "content": "Tap Software Update . It's near the top of the page."
    },
    {
      "title": "Tap Update Now.",
      "content": "Tap Update Now . You'll see this button if there's an update available. You may also see Download and Install ."
    },
    {
      "title": "Enter your device's passcode.",
      "content": "Enter your device's passcode. Once you've entered the passcode, the download will start. The update may take some time to complete. [1] X Research source When it's finished updating, your iPad will restart and you'll be asked to enter your passcode from the lock screen again. If you're getting the Verifying Update error , try to restart your iPad first. You can also update your iPad on a computer using iTunes on Windows or the Finder on Mac ."
    },
    {
      "title": "Connect your iPad to your computer.",
      "content": "Connect your iPad to your computer. Use the wire that came with your device. This may be USB-C to USB-C or Lightning to USB. Make sure your computer is connected to Wi-Fi and that your iPad files are backed up. If you're running macOS Mojave or earlier, you'll need to use iTunes instead. [2] X Research source"
    },
    {
      "title": "Open the Finder.",
      "content": "Open the Finder . You can find this on the Dock."
    },
    {
      "title": "Click your device.",
      "content": "Click your device. This will be in the sidebar, under Locations . If you don't see your device, look on your iPad for a Trust this computer? prompt. If you see this, tap Trust . You may need to enter the passcode on your iPad."
    },
    {
      "title": "Click General.",
      "content": "Click General . This is the tab underneath your iPad's name. You may already be on this tab."
    },
    {
      "title": "Click Check for Update.",
      "content": "Click Check for Update . It'll take a few moments for the Finder to check."
    },
    {
      "title": "Click Download and Update.",
      "content": "Click Download and Update . This will start the installation process. You may be asked to enter your iPad's passcode again. Follow the on-screen instructions to complete your download. When the download is finished, your iPad should restart."
    },
    {
      "title": "Download iTunes on your computer.",
      "content": "Download iTunes on your computer. In order to download update software for your iPad, iTunes must be running the latest version available . [3] X Research source"
    },
    {
      "title": "Connect your iPad to your computer.",
      "content": "Connect your iPad to your computer. Use the wire that came with your device. This may be USB-C to USB-C or Lightning to USB. Make sure your computer is connected to Wi-Fi and that your iPad files are backed up. If iTunes doesn't launch automatically, open the iTunes app on your computer."
    },
    {
      "title": "Click your device's icon.",
      "content": "Click your device's icon. You can find this in the toolbar at the top. This will open the device page. If you don't see your device, look on your iPad for a Trust this computer? prompt. If you see this, tap Trust . You may need to enter the passcode on your iPad."
    },
    {
      "title": "Click Summary.",
      "content": "Click Summary . This is in the left panel."
    },
    {
      "title": "Click Check for Update.",
      "content": "Click Check for Update . You can find this in the top section."
    },
    {
      "title": "Click Download and Update.",
      "content": "Click Download and Update . This will start the installation process. You may be asked to enter your iPad's passcode again. Follow the on-screen instructions to complete your download. When the download is finished, your iPad should restart."
    }
  ]
}