{
  "url": "https://www.wikihow.com/String-Pearls",
  "title": "How to String Pearls",
  "steps": [
    {
      "title": "Choose a string to use.",
      "content": "Choose a string to use. Either silk or nylon thread will work. Thread comes in many colors, though white is most commonly used. If your pearls are colored, choose thread that closely resembles the color of the pearls."
    },
    {
      "title": "Gather your pearls.",
      "content": "Gather your pearls. If you are restringing pearls, cut them from the old string. Line the pearls up in the order you plan to string them. Place them in a tray or on a surface where they won't roll away. If the pearls are graduated, place them in order of smallest to largest and back to smallest."
    },
    {
      "title": "Buy or make a beading needle.",
      "content": "Buy or make a beading needle. A beading needle is a very thin needle that fits through the hole in the pearls. [1] X Research source They are available to purchase at most craft and beading stores. You can make your own beading needle by cutting a 6-inch (15.24cm) strip of beading wire. Fold it in half and cut the non folded end to a point."
    },
    {
      "title": "Thread the needle.",
      "content": "Thread the needle. Cut a piece of thread that will be used to string your pearls. The piece should be at least three times the intended length of the necklace. Pull the string through the eye of the needle. For needles made of beading wire, make your own needle eye by cutting a 4-inch (10.2cm) piece of thread, pull it through the folded wire and tie it into a loop at the folded end of the needle. Feed your stringing thread into this loop."
    },
    {
      "title": "Cut off a strand of thread about 10 inches in length.",
      "content": "Cut off a strand of thread about 10 inches in length. Once you've cut the strand, separate it into at least three finer strands. [2] X Research source"
    },
    {
      "title": "Thread one of the thinner strands through the eye of the beading needle.",
      "content": "Thread one of the thinner strands through the eye of the beading needle. After it's threaded through, tie a knot so the strand remains looped through the needle's eye. The loop will hold the thread that you'll actually use to string your pearls. Leave the loop on your needle so you can reuse it over and over again, Think of it as enlarging the \"eye\" of the needle into one big loop."
    },
    {
      "title": "Thread the loop.",
      "content": "Thread the loop. Cut off a strand of thread at least three times the desired length of your necklace, then double it over and slip the loose ends through the loop of thread you've already made. Pull the ends through far enough that they don't easily slip out."
    },
    {
      "title": "Attach the clasp.",
      "content": "Attach the clasp. Cut one of the clasp ends from your original necklace and loop the thread through it. Slip the threaded beading needle through the ring on the clasp and then back through the end loop in the thread. Tie a knot close to the clasp to prevent the loop from slipping up onto the ring incorrectly."
    },
    {
      "title": "String all pearls on the thread.",
      "content": "String all pearls on the thread. If using graduated pearls, be sure to string them in order from smallest to largest and back to smallest again. There should be plenty of extra thread."
    },
    {
      "title": "Remove the needle and tie a double knot at the end of the strand with two loose ends.",
      "content": "Remove the needle and tie a double knot at the end of the strand with two loose ends. The knot will prevent the pearls from slipping off while you tie knots. You can then push the pearls to the end of the thread where you tied the knot."
    },
    {
      "title": "Knot the first pearl.",
      "content": "Knot the first pearl. Tie a knot immediately outside the clasp to prevent the metal from scratching the first pearl. Push the first pearl up against the knot and tie another knot on the other side of the pearl. You may find it helpful to hold the loop down on the pearl and tighten. Hold the thread tightly against the pearl as the knot is pulled shut."
    },
    {
      "title": "Continue to knot the remaining pearls.",
      "content": "Continue to knot the remaining pearls. Push each pearl up against the last knot and tie an additional knot immediately on the other side of the pearl. After tying each knot, separate the two threads and pull them tightly apart to move the knot closer to the pearl. Try placing a needle through each knot to guide the knot tightly against the pearl. Keeping a finger tightly over each knot as it's being pulled will help to pull it snug against the pearl."
    },
    {
      "title": "Attach the final clasp.",
      "content": "Attach the final clasp. Once you've knotted the final pearl, cut off the end thread knot and slide the two threads through the other side of clasp. Then pull the threads tightly up to the final knotted pearl strand and tie a strong double knot."
    },
    {
      "title": "Secure the clasp.",
      "content": "Secure the clasp. If you used silk thread, apply a tiny dot of super glue with a tooth pick, carefully keeping glue off the pearl or pearl hole. Once the glue dries, cut the thread as close as possible to the knot. If you used synthetic thread, cut within a 1/4-inch of the knot and melt the loose ends with a small flame from a lighter or a match."
    },
    {
      "title": "String each pearl onto the thread.",
      "content": "String each pearl onto the thread. [3] X Research source Do this by pulling the needle and thread through the hole in each pearl."
    },
    {
      "title": "Fasten the clasp.",
      "content": "Fasten the clasp. Take one side of your clasp and tie it onto the end of the silk thread after you have strung all the pearls."
    },
    {
      "title": "String through the last pearl again.",
      "content": "String through the last pearl again. Take the wire needle back through the last pearl, in the opposite direction you were stringing before."
    },
    {
      "title": "Secure the two sides of thread.",
      "content": "Secure the two sides of thread. Tie a basic knot to tie together the first and second threads strung through the last pearl. Pull the knot so it rests as close to the last pearl as possible. Secure the knot by applying a dab of glue or clear nail polish to the knot, being careful not to get any adhesive on the pearls. If you have trouble placing the knot right against the pearl, you can pull it close using tweezers. [4] X Research source"
    },
    {
      "title": "Knot the pearls.",
      "content": "Knot the pearls. Take the needle and thread back through each pearl. After each pearl, tie a knot as you did in the step above. Secure the knot with adhesive, making sure to keep the substance off the pearls. [5] X Research source It's important to have a knot in between all of the pearls, as well as between the pearls and the clasps, because pearls and extremely fragile and could otherwise rub against and scratch each other. [6] X Research source"
    },
    {
      "title": "Attach the clasp.",
      "content": "Attach the clasp. Tie the other half of the clasp onto the other end of the string of pearls to complete the strand."
    }
  ]
}