{
  "url": "https://www.wikihow.com/Stop-Collection-Calls",
  "title": "How to Stop Collection Calls",
  "steps": [
    {
      "title": "Don't ignore debt collectors.",
      "content": "Don't ignore debt collectors. Answer the phone and find out if you owe money or not, what you can do to pay the money back while stifling collection calls, or even if it is just a mistake. Only after you completely understand the reason for the collection calls should you put an end to them. Ignoring legitimate collection calls won't stop them. The creditors have a legal right to collect the debt. Not paying money to collection agencies when it is due can have adverse effects on your credit score. Sometimes, you might forget that you owe money to a credit card company, a credit union, or your bank. If you don't answer the phone, you may not realize that you have unpaid debt before it's reported. [1] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source"
    },
    {
      "title": "Beware of rogue and illegal debt collecting practices.",
      "content": "Beware of rogue and illegal debt collecting practices. Oftentimes, collection agencies mix people up. People with common names like John Smith or Sarah Jones often receive collection calls meant for others by the same name. Sometimes, debt collectors will call all the people in a given area with the same last name, looking for the individual or family members. [2] X Research source Be aware of the concept of \"phantom\" or \"zombie\" debt. This is debt that you do not legally owe, but an unscrupulous collection agency is still attempting to collect. Phantom debt refers to a settled debt that a collection agency continues to try to collect. If you do not pay the phantom debt, the agency has no recourse against you. But once you make a payment, the money won't be refunded, and you have little if any recourse against the agency. Collectors often threaten legal action in the hopes of collecting debt faster. Debt is a civil matter and cannot be used to file criminal charges. The only way not paying a debt can be considered a crime is if the original sum was obtained under false pretenses, such as by identity theft, forgery, or other misrepresentation."
    },
    {
      "title": "Know your rights.",
      "content": "Know your rights. Under the Federal FDCPA, a collector is not allowed to make any kind of threat or use abusive language. Tell the debt collector this. If it is a rogue collector or a fraud, most likely they'll be scared off. Being in debt can be embarrassing. Most people are not willing to have their family or friends know that they have fallen behind. State and Federal laws also do not allow debt collectors to talk about your debt to other people except your lawyer or with your permission."
    },
    {
      "title": "Record the phone conversation.",
      "content": "Record the phone conversation. Lawyers love having recordings. If the collector has been using vulgar methods to intimidate you, start recording. Inform the collector at the beginning that you are taping the call as evidence for filing a formal, legal complaint with the State Attorney General and the Federal Trade Commission. If your telephone has a speaker option, use a regular tape recorder to record the conversation. Most cell phones today have recording apps or built-in recording features. [3] X Research source"
    },
    {
      "title": "Don't commit fraud.",
      "content": "Don't commit fraud. Do not lie and pretend to be another person. Don't pretend to be dead or to have moved. To do so is fraud under federal law. Collection agencies and investigators can easily determine if such a statement is false. Since collection calls are often recorded, your lie will be recorded as well."
    },
    {
      "title": "Pay your debt.",
      "content": "Pay your debt. The easiest way to stop collection calls is to pay your debt, but you need to be careful when doing so. Speak with the collector to set up a payment plan. Many collectors will encourage you to set up automatic bill-pay. Make sure that whatever plan you agree upon, you are comfortable with. Scam collection agencies love setting up automatic bill-pay and will charge you an exorbitant fee for the service."
    },
    {
      "title": "Send a letter to the collection agency.",
      "content": "Send a letter to the collection agency. Under the Fair Debt Collection Practices Act (FDCPA), you are allowed to tell debt collectors to stop calling you. Tell them in writing that you prefer to communicate with them by mail only. Send any correspondence, including disputes to both the collection agency and the creditor by certified mail and request that a return receipt be sent back to you upon delivery. [4] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Sample letters are available online. [5] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source Make sure you keep a copy of your letter. Written communication works to your advantage as you will have a record of everything that is said, whereas phone communication is only recorded on occasion. If the creditor still contacts you after your written request, you can file a “cease and desist“ letter. Find a consumer lawyer who can draft such a letter. If the problem continues, you might even have a case to sue the collection agency. Debt collectors are also prohibited from contacting you while you are at work."
    },
    {
      "title": "Contact a lawyer.",
      "content": "Contact a lawyer. There are many lawyers who concentrate on debt collection. They'll be able to help you if you owe money or if a collector is illegally harassing you. These lawyers will charge you a fee or will take a percentage of what they collect on your behalf. The Fair Debt Collection Practices Act, unlike most laws, actually spells out how much money you might receive if you win your case. The amounts can range from $5000 for individual cases to $500,000 for group law suites. [6] X Research source The first thing a lawyer will do is look up the statute of limitations on your loan. Old loans, acquired decades earlier or by deceased relatives, sometimes can be the cause of collection calls. Statutes of limitations exist in many places. If the statute of limitations has expired, you could be off the hook. Even if a collection agency tries to pursue it, you are under no legal obligation to pay. When this occurs, if you do not wish to pay, you could use a cease and desist letter. Remember, you can receive a bad credit rating longer than the statute of limitations. [7] X Research source"
    },
    {
      "title": "Ask how others successfully stopped collection calls.",
      "content": "Ask how others successfully stopped collection calls. They may have come across an alternate way that works well with this particular agency. Each collection agency is different. Sometimes, they require forms to be filled out. Others only need a letter. Rather than discover this for yourself, ask for help from others. [8] X Research source"
    },
    {
      "title": "Alert the Federal Trade Commission.",
      "content": "Alert the Federal Trade Commission. Report the collectors to the FTC online. They are generally slow to move on these kinds of problems, but if they receive enough reports about one specific agency, their wrath can be formidable. [9] X Trustworthy Source Federal Trade Commission Independent U.S. government agency focused on consumer protection Go to source"
    },
    {
      "title": "Setup phone call filtering.",
      "content": "Setup phone call filtering. Only after you've exhausted all other options should blocking collection call numbers be considered. Most phone companies offer \"anonymous call rejection\". If the calling party is not displaying caller id information for whatever reason, your phone will not ring. Instead the calling party will be confronted by a phone company system that will do one or more of the following: Prompt the caller to release caller id information, Prompt the caller to leave a very short voice message which is subsequently played to you giving you a chance to accept or dump the call, or instruct the caller to call back revealing caller id information. This will weed out most collection calls."
    },
    {
      "title": "Setup your phone system as WhiteList-Only.",
      "content": "Setup your phone system as WhiteList-Only. Numbers not on your approved list (WhiteList) will not reach your phone. Collection agencies often employ caller id spoofing, sending fake or alternate caller id information to trick you into answering. However, a WhiteList-Only home phone setup puts a swift end to this, because it won't accept non-recognized numbers. WhiteList-Only can be through your phone company for around $50USD with no monthly fees. Alternatively one can switch phone service from Land Line (conventional phone system) to VoIP (Voice over IP). This requires an internet connection and performs best on a broadband link; dialup internet is generally insufficient. There are a variety of home VoIP providers that allow WhiteList-Only setup for as little as $8 USD monthly. If one is adventurous, one can setup a home PBX using Asterisk, an open source software phone system usually requiring a dedicated computer. PBX in a Flash is one such flavor of Asterisk and is well suited to the above average computer user."
    },
    {
      "title": "Setup your phone system as BlackList unwanted.",
      "content": "Setup your phone system as BlackList unwanted. Similar to WhiteList-only, sometimes also called GreenList-only, BlackList allows all calls except those explicitly blocked. Land Line phone service typically limits the customer to twenty blocked numbers whereas home VoIP providers or home PBX have no such limit. Additionally, these services often allow one to block all calls from toll free numbers: 800*, 866*, 877*, 888*."
    }
  ]
}