{
  "url": "https://www.wikihow.com/Treat-a-Bruised-Thigh-Muscle",
  "title": "How to Treat a Bruised Thigh Muscle",
  "steps": [
    {
      "title": "Rest and avoid activities that cause you pain.",
      "content": "Rest and avoid activities that cause you pain. If you find that an activity causes you pain, avoid doing it while you’re healing. Take it easy. Rest as much as you can. Allow your body to heal itself so you can return to normal as quickly as possible. [1] X Research source You could make your injury worse if you try to return to your normal activities before you’re ready."
    },
    {
      "title": "Wrap your thigh with an elastic bandage to reduce swelling.",
      "content": "Wrap your thigh with an elastic bandage to reduce swelling. Swelling is a common symptom of a bruised thigh and can be quite painful. Take an elastic bandage and wrap it firmly, but not too tight, around your thigh to help decrease the swelling. [2] X Research source A tight wrap can actually cause more swelling below the bruised area, so make sure you don’t overdo it."
    },
    {
      "title": "Ice the area every 2 hours for 20 minutes at a time.",
      "content": "Ice the area every 2 hours for 20 minutes at a time. If you’re not wearing an elastic bandage around your thigh, place a thin cloth over your skin to protect it. Hold a bag of ice or a cold pack on the injured area for 20 minutes. Then, remove the ice pack and wait at least 2 hours before you ice it again so you don’t cause any potential nerve damage. Repeat the icing every 2 hours, especially for the first 48-72 hours after your injury to help control swelling and reduce your pain. [3] X Research source"
    },
    {
      "title": "Prop your leg up on a pillow whenever you sit or lie down.",
      "content": "Prop your leg up on a pillow whenever you sit or lie down. Try to elevate your thigh to a level above your heart, which can help with swelling. Anytime you have a seat or relax on the couch or bed, place some pillows beneath your knee to prop up your leg so you’re more comfortable. [4] X Research source"
    },
    {
      "title": "Avoid massaging the bruise unless your doctor says to.",
      "content": "Avoid massaging the bruise unless your doctor says to. Massaging your bruised thigh could potentially dislodge a blood clot or cause further damage. Don’t rub on or massage your bruised thigh muscle without talking to your doctor first, just to be safe. [5] X Research source"
    },
    {
      "title": "Take pain medication and use crutches if your doctor recommends it.",
      "content": "Take pain medication and use crutches if your doctor recommends it. Check with your doctor to make sure it’s all right for you to take over-the-counter pain medications such as ibuprofen (Advil or Motrin) or acetaminophen (Tylenol). If your bruised thigh affects or limits your ability to stand or walk, your doctor may recommend that you use crutches. If they do, use them so you don’t put extra strain on your thigh while it heals. [6] X Research source If you’re in a serious amount of pain, tell your doctor. They may prescribe stronger pain medication to give you some relief."
    },
    {
      "title": "Eat nutritious foods to promote healing.",
      "content": "Eat nutritious foods to promote healing. While your bruise is healing up, take extra care to eat a healthy, balanced diet. Eat lots of fruits and vegetables rich in vitamin C, such as spinach, tomatoes, or oranges. Zinc will also help you heal up faster, so go for whole-grain foods and zinc-rich proteins, like eggs, dairy, or seafood. Make sure to include protein with every meal, since it supports muscle health. [7] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Don’t forget to drink plenty of water! Proper hydration is also a vital part of the healing process. Keeping your blood sugar levels under control will also help your bruise heal faster. Stick to low-glycemic foods, such as whole grains, fruits and vegetables, and peas and beans."
    },
    {
      "title": "See your doctor for an exam if your pain is severe.",
      "content": "See your doctor for an exam if your pain is severe. If you have pain, tenderness, swelling, or dark coloration on your skin that doesn’t get better after about 2 days, especially after you’ve taken a direct hit to your thigh, make an appointment to see your doctor. They’ll perform a physical exam, ask you questions, and review your medical history. Generally, they won’t need to do any further testing to diagnose you. [8] X Research source Because your quadricep muscles sit right on the front of your thigh, they’re wide open for direct hits. Sports, especially contact sports, can easily lead to taking a hit on your thigh that leads to bruising. [9] X Research source Bruises aren’t usually a big deal, but a bruised thigh can be a little more serious. It’s important that you see a doctor to make sure there aren’t any complications such as compartment syndrome, which can occur when blood builds up in the muscle sheath, or myositis ossificans, which is a calcification of the muscle that can occur if the bruise isn’t properly treated."
    },
    {
      "title": "Get any tests your doctor orders to make sure the injury isn’t more serious.",
      "content": "Get any tests your doctor orders to make sure the injury isn’t more serious. If your doctor is concerned there may be a more serious issue, such as a broken bone or nerve damage, they may order blood tests and imaging tests (such as an X-ray or MRI). Complete any tests your doctor orders for you so you can properly treat your injured thigh. [10] X Research source Some serious medical issues, such as a blood cancer like leukemia, can cause bruising in areas such as your thighs. They actually look and feel just like normal bruises, but they can take longer to heal and they can appear without any clear reason. [11] X Research source"
    },
    {
      "title": "Wait until you’re pain-free to return to your usual activities.",
      "content": "Wait until you’re pain-free to return to your usual activities. If you injured your thigh playing sports, you may be eager and impatient to get back out there. But if you injure yourself even further by returning before your thigh has properly healed, you could be out for even longer. Play it safe. Wait until you don’t feel any pain to return to your normal daily activities, whether that’s sports, running, or just walking around. [12] X Research source Listen to your body! Pain is your thigh telling you that it’s injured and needs some time to heal."
    },
    {
      "title": "Wear a thigh sleeve or protective padding during sports.",
      "content": "Wear a thigh sleeve or protective padding during sports. A padded thigh sleeve or protective padding can protect your thigh from direct hits. If you’re playing sports or participating in activities that could lead to impact on your thigh, put on some protective gear to reduce your chances of getting a nasty bruise. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Follow the rules of the game if you’re playing contact sports.",
      "content": "Follow the rules of the game if you’re playing contact sports. Most contact sports have rules that are designed to help keep players safe. Listen to the rules of the game so you can try to avoid unnecessary blows to your thigh. [14] X Research source For instance, American football has a rule against “spearing,” which is when a player lowers their helmet and dives directly into another player. It’s a rule that protects a player’s head and neck, but it also reduces the chances of taking a direct hit to the thigh."
    },
    {
      "title": "Stretch your quads",
      "content": "Stretch your quads before you exercise or play sports. Stretching your thigh muscles can help reduce their chances of getting injured. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Walk or bike around for about 5 minutes to warm up your thighs, then try some standing quad stretches by grasping 1 foot with your hand and gently pressing your heel towards your glutes. Hold the stretch for 20-30 seconds, then repeat the stretch on your other leg. Try to stretch your quads at least once a day and before you exercise or play sports."
    },
    {
      "title": "Strenghthen your quad muscles",
      "content": "Strenghthen your quad muscles so they’re more resilient. Stronger, bigger quads are better able to deal with direct hits. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Build up your quad muscles with exercises like forward lunges, squats, and leg presses. Shoot for 3 sets of 10-15 reps of each exercise to give your quads a great workout that will strengthen and bulk them up."
    }
  ]
}