{
  "url": "https://www.wikihow.com/Use-a-Charcoal-Grill",
  "title": "How to Use a Charcoal Grill",
  "steps": [
    {
      "title": "Lay briquettes in a charcoal chimney.",
      "content": "Lay briquettes in a charcoal chimney. About 3 pounds (1.4 kg) will be enough to fill most chimneys, and for most grills. Your chimney may also have a fill line. If so, use that as a guide. [1] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source A charcoal chimney is basically a metal cylinder with a grate at the bottom, holes in the side, and a handle on the side. You place the charcoal inside, light it efficiently and safely, then pour the briquettes in your grill when they're ready. Lighter fluid can be dangerous and is not necessary if you use a charcoal chimney."
    },
    {
      "title": "Prepare your fire starter.",
      "content": "Prepare your fire starter. Take a piece of newspaper and wad it up. Dip it in vegetable oil and place it in the bottom of the chimney, underneath its grate."
    },
    {
      "title": "Light the chimney.",
      "content": "Light the chimney. Rest it on a flat, fire-safe surface, like a concrete driveway or the grill grate. Take a long match or igniter and stick it in one of the holes on the side to light the newspaper. Let the flames travel up the coals and burn until they’re ashed over. This should take about 20 minutes. [2] X Research source Keep an eye on the chimney as you wait."
    },
    {
      "title": "Lay an even layer of charcoal for fast-cooking foods.",
      "content": "Lay an even layer of charcoal for fast-cooking foods. Lift up the grill grate, and gently dump the coals into the grill. Foods like hot dogs, hamburgers, and vegetables cook quickly and will need a layer of coals spread evenly throughout the grill. [3] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Create two zones of heat for slower-cooking foods, alternatively.",
      "content": "Create two zones of heat for slower-cooking foods, alternatively. Bone-in chicken, roasts, pork loin, and similar foods take a longer time to cook. Dump the coals in your grill, then move them to one side. This will create a zone of indirect heat so the foods will cook thoroughly without burning. [4] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Clean your grill grate.",
      "content": "Clean your grill grate. Take a clean rag and wrap it tightly around one end of a stick, spatula, or long metal spoon so that it forms a ball. Dip it in water, then run it back and forth over the now hot grill grate to remove any grease, old food, or other debris. Keep dipping the stick in water if necessary to keep it wet. [5] X Expert Source Fabricio Ferraz House Cleaning Professional Expert Interview. 16 August 2019. Some people recommend cleaning your grill with a stiff wire brush before heating it. However, this can potentially cause small metal particles to end up in your food. Cleaning with a wet rag is safe, and debris will come off of the grill grate more easily now that the coals have heated it."
    },
    {
      "title": "Add wood chips for extra smoke flavor.",
      "content": "Add wood chips for extra smoke flavor. Dump 1 or 2 handfuls of wood chips on the coals just before you add your food. This will give your food the most contact time with the smoke, helping it get the rich flavor you want. [6] X Research source Use only food-grade wood chips. You can find these wherever grilling supplies are sold. Hickory, mesquite, and applewood are popular varieties of wood chips for grilling. Soaking the wood chips in plain water for 20 minutes before grilling helps them burn slower, increasing the flavor they give your food."
    },
    {
      "title": "Place your food on the grill when it is hot.",
      "content": "Place your food on the grill when it is hot. Waiting a minute before placing your food on the grill grate ensures a good sear and keeps things from sticking. Place quick-cooking foods directly over the coals. Foods that take longer to cook should be placed to the side of the coals so they can receive indirect heat. [7] X Research source Brush a little oil on your grill surface before you place the food on it. This will also help prevent sticking."
    },
    {
      "title": "Cover the grill, if necessary.",
      "content": "Cover the grill, if necessary. Hot dogs, hamburgers, and other quick-cooking foods can be grilled with the lid off. If you have slower-cooking foods like bone-in chicken or pork loin, place the lid on the grill. This increases the amount of indirect heat, helping the foods to cook thoroughly. [8] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Add new coals every 30-60 minutes if you have any foods that take a long time to cook. Don’t open the lid too often to check on your food, since this will cause heat to escape."
    },
    {
      "title": "Adjust the grill’s dampers to control the heat.",
      "content": "Adjust the grill’s dampers to control the heat. Open the dampers if you want to increase the heat, such as to sear a steak. Close them if you want to cook something at a lower temperature, such as to roast a pork loin or vegetables. [9] X Research source Opening the dampers makes the coals burn hotter since they receive more oxygen. Closing them has the opposite effect."
    },
    {
      "title": "Check the temperature of your food.",
      "content": "Check the temperature of your food. Use an instant read digital thermometer to check the internal temperature of your food. Take the food off the grill only when it reaches the right temperature. That way, you can make sure it cooks thoroughly so it’s safe to eat. [10] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source For example, cook: [11] X Research source Pork to 160 F (71 C). Well-done beef to 170 F (77 C). Chicken pieces to 165 F (74 C)."
    },
    {
      "title": "Close the grill and dispose of the ashes.",
      "content": "Close the grill and dispose of the ashes. Once you’re done cooking, cover the grill and let everything cool down. When the grill is cool to the touch, scoop the ashes out and put them into a metal bucket or basin. Soak them in water overnight, then throw them away. [12] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    }
  ]
}