{
  "url": "https://www.wikihow.com/Write-a-Breach-of-Contract-Letter",
  "title": "How to Write a Breach of Contract Letter",
  "steps": [
    {
      "title": "Create a letterhead.",
      "content": "Create a letterhead. Your letterhead can be as simple or as elaborate as you wish. At a minimum, it should include your name, address, phone number, and e-mail address. If you use Microsoft Word, you can download free letterhead templates on Microsoft’s website. [1] X Research source"
    },
    {
      "title": "State the delivery method below the letterhead.",
      "content": "State the delivery method below the letterhead. Place the delivery method at the top left, one or two lines below the letterhead you created. It should be in all capital letters, e.g. “CERTIFIED MAIL” or “E-MAIL.” Check the contract to see if it includes a specific method of delivery for breach of contract notices. [2] X Research source If not, you may want to send more than one copy of the letter via alternate methods. The best available options are: Certified mail. This is a service of the United States Postal Service (USPS). Certified mail requires the signature of the party accepting the mail. It provides the sender with a return receipt showing the date of delivery. This proof of delivery makes it the best method for sending a breach of contract letter. It is a commonly accepted way of mailing legal documents and providing proof of delivery. [3] X Research source Get the return receipt card from the post office and enter your address and the recipient's name and address. The postal clerk will affix it to the envelope. Hand delivery. This is a good method if the recipient of a letter lives or works near you. This method works well for breach of contract letters because you know for certain that your letter was in fact delivered. It does not, however, allow for documentation of delivery. E-mail. You may choose to deliver your breach of contract letter as an attachment to an e-mail. This is appropriate if you have corresponded with them via email in the past. When delivering any legal letter or document via e-mail, request a delivery receipt. Each email service will have a different process for this. Check the instructions that came with your software or use the help function to learn how. Because some companies do not allow attachments to be opened, you may want to paste a copy of the letter in the body of the e-mail. Facsimile, or fax. Sending a letter by fax is appropriate when the recipient uses a fax for business purposes. For example you could send a fax to an attorney or real estate agent. Send the fax to their business fax number."
    },
    {
      "title": "Create an address block.",
      "content": "Create an address block. Address the letter to the appropriate person. If you are aware of an attorney representing the other party, direct all correspondence about the breach to them. If you are not sure whether the breaching party has an attorney, you may address the letter to them directly. In the case of a company, address your letter to the owner of the company. The address block should contain the addressee’s full name and mailing address. Place it at the top left of the page, just under the delivery method specification. [4] X Research source"
    },
    {
      "title": "Date the letter.",
      "content": "Date the letter. Dating your letter is important as it provides both parties with an easy way of referencing the letter later, e.g. \"the letter dated January 13, 2007.\" It also establishes the date upon which certain events occurred, or should occur. For example, you might demand that the other party cure the breach “within 10 days.” You can align the date to the left, the center, or the right, whichever you prefer. It should be one or two lines below the address block."
    },
    {
      "title": "Address the letter appropriately.",
      "content": "Address the letter appropriately. As this is a formal letter, you should address the recipient formally. For example, you would write “Dear Mr. Doe” not “Dear John.”"
    },
    {
      "title": "Write an opening paragraph.",
      "content": "Write an opening paragraph. Your opening paragraph should tell the reader why you are writing to them in clear and concise language. You may want to say, for example, “I am writing to you today because I believe that you are in breach of our contract dated May 5, 2006.”"
    },
    {
      "title": "Write a paragraph describing the breach.",
      "content": "Write a paragraph describing the breach. You want to be as detailed and specific as you can to ensure that the recipient understands exactly what they did or failed to do. It should be clear why such action (or inaction) was a breach of the contract. [5] X Research source When describing the breach, you will want to: Identify the part of the contract or agreement that describes what the other party should have done. If you have a written contract, you may want to quote parts of the agreement that specify the other party's obligations. [6] X Research source For example, “page 2, paragraph 3 of our agreement states that you will provide all reasonable and necessary clean-up at the end of each day worked.” Make a clear statement of what the party did or failed to do. Include specific dates if possible. Do not make any judgments, and avoid inflammatory language. Just describe the party’s action in plain language. [7] X Research source For example, do not say “you blatantly refused to pay me what you owe me.” You should say, “Your monthly rent payment of $400 was due on March 1st. It is now March 10th, and I have not received payment.”"
    },
    {
      "title": "Describe any remedy provided for in the contract.",
      "content": "Describe any remedy provided for in the contract. If your contract specifies what will happen in the event of a breach, describe the remedy it provides. [8] X Research source For example, if a late payment incurs interest at the rate of 8% and a one-time late charge of $35, you should describe this remedy. Again, include the page and paragraph of the contract that contains this information."
    },
    {
      "title": "Write a closing paragraph.",
      "content": "Write a closing paragraph. Your closing paragraph should tell the reader what you will do if they do not cure the breach within a given amount of time. [9] X Research source Be specific, but not threatening in your tone. Make sure to indicate a date by which the offending party should provide a remedy .Generally, the amount of time given to a breaching party to cure the breach is 30 days from the date of the letter. [10] X Research source A breach which is not cured usually results in a lawsuit. It may be a violation of state and/or federal laws to threaten a lawsuit which you do not have the right or intent to file. A court may consider this extortion. Choose your words for this paragraph carefully. [11] X Research source For example, do not say “I will file a lawsuit” or “I will sue you.” Instead say, “I will be forced to take appropriate legal action.”"
    },
    {
      "title": "Create a signature block.",
      "content": "Create a signature block. A signature block should include a closing, a space for the date, a line for your signature, and your typed name beneath the line. Common closings for business letters include \"Sincerely,\" \"Thank You in Advance,\" and \"Yours Truly.\""
    },
    {
      "title": "Prepare the letter for delivery.",
      "content": "Prepare the letter for delivery. Print your letter on plain white printer paper, date and sign it, then make a copy for your records. If you referred to specific parts of your contract, attach a copy of the contract. State that the letter contains an enclosure. If there are several enclosures, list them individually. Indicate an enclosure by the word “Enclosure” aligned to the left, two or three lines below your signature."
    },
    {
      "title": "Send the letter.",
      "content": "Send the letter. Have your letter delivered according to your chosen delivery method or methods."
    },
    {
      "title": "Store your copy of the letter with delivery information.",
      "content": "Store your copy of the letter with delivery information. Once you have delivered your breach of contract letter, file away your copy of it with documentation of delivery. The specific documentation of delivery will depend upon your delivery method. Certified mail: Check the USPS website for delivery confirmation. [12] X Research source Begin checking two or three days after mailing a breach of contract letter via certified mail. Once you receive confirmation of delivery, print it, and staple it to your copy of the letter. When you receive the green “return receipt” card, staple that to the letter as well. Hand delivery: After hand delivering your breach of contract letter, make a written notation, in blue ink, on the top right hand corner of your copy. The notation should say something like “hand delivered to (the name and address of the location where you delivered the letter, and the date).\" For example: \"Hand delivered to Mr. Doe’s office at 515 East Main St on April 13, 2015.\" Include your initials beside this notation. E-mail: Once you receive confirmation of e-mail delivery, print and staple it to your copy of the letter. Facsimile or fax: If your fax machine prints a delivery confirmation page, staple it your copy of the letter. If your fax machine does not print a delivery confirmation page, make a written notation in blue ink on the top right hand corner. The notation should say something like, \"faxed to (the name and fax number of the recipient, and the date).\" For example \"faxed to Mr. Doe at 313-555-1212 on April 13, 2015.\" Include your initials beside this notation."
    },
    {
      "title": "Wait for a response.",
      "content": "Wait for a response. Once you've sent your letter, you must wait for the period of time you designated in your letter to see if the other party responds. As your stated deadline for curing the breach approaches, you may wish to send another copy of the letter. [13] X Research source If the other party does what they were supposed to do or fixed the problem, this is called curing the breach. [14] X Research source In this case, you will want to file the letter and any other documentation about the breach and cure. It will be important to have if another breach occurs. Send the party a letter stating that the breach has been cured and thank them taking care of the problem. If the other party does not respond by fixing the problem, you may want to contact an attorney to discuss your options. [15] X Research source You may also want to consider filing a case in small claims court."
    }
  ]
}