{
  "url": "https://www.wikihow.com/Talk-Louder-if-You%27re-Shy",
  "title": "How to Talk Louder if You're Shy",
  "steps": [
    {
      "title": "Adopt a confident position.",
      "content": "Adopt a confident position. If you're shy, standing or sitting in a confident position may help boost your self-esteem. Some positions can help you project your voice better, but ultimately you should stand or sit in whatever position makes you most comfortable and confident. [1] X Research source If you're standing, put one foot slightly in front of the other and rest your body's weight on the back foot. Keep your neck straight, your head high, pull your shoulders back, and angle your torso slightly forward. If you're sitting, keep your back straight and lean forward slightly. Put your elbows and forearms on top of the table and look directly at the person you intend to speak to."
    },
    {
      "title": "Breathe",
      "content": "Breathe in a way that maximizes voice projection. If you're not used to projecting your voice, focusing on your breathing may help. Regulating your breath and maintaining an erect posture will open up your chest and facilitate a louder, more commanding voice. Inhale silently and quickly, then exhale slowly just before you begin to speak. Try to relax your abdominal region as you inhale. Keep your shoulders and chest as still as possible. Pause at the end of a sentence just before you're about to run out of breath. Then inhale so that your next phrasing feels natural."
    },
    {
      "title": "Start out speaking at a comfortable volume.",
      "content": "Start out speaking at a comfortable volume. If you're nervous about speaking loudly, it may be easier if you start out at a more comfortable tone. Spend a little time conversing at whatever volume you're comfortable with and work your way up to a louder volume gradually. [2] X Research source Remember that speaking softly and timidly is better than not talking at all. You don't have to rush into speaking loudly. Stick with what you're comfortable with until you get warmed up, then begin pushing yourself."
    },
    {
      "title": "Slow down your speech.",
      "content": "Slow down your speech. Many people speak rapidly when they're feeling nervous or anxious. However, speaking too fast can affect the clarity of your speech. Fast speech may also increase the chance of stumbling over your words or losing track of your thoughts. [3] X Research source Try practicing with a recording device and listening back to the speed and clarity of your speech. You can also ask a friend to help you practice projecting your voice. Your friend can tell you whether you need to change the volume, pitch, or speed of your speech."
    },
    {
      "title": "Listen",
      "content": "Listen to what others are saying. If you want to carry on a conversation with others, it's important to actually listen to what they're saying. Try not to spend too much time planning what you'd like to say, and focus on what others are saying while they speak. [4] X Research source Make eye contact with whoever is speaking and pay attention to what's being said. React appropriately to what's being said. Smile at something funny, frown at something sad, and nod politely to show that you're still listening."
    },
    {
      "title": "Include yourself in the conversation.",
      "content": "Include yourself in the conversation. If you wait for someone else to ask you to participate in the conversation, you might be waiting a long time. It may be difficult, but by chiming in on what's being said you'll let others know that you're interested in participating. [5] X Research source Don't cut anyone else off. Wait for a brief pause in which no one is speaking, then chime in. Say something relevant to the conversation and build off of something that someone else said. For example, you might say something like, \"I agree with what Dave said, but I also think _______.\""
    },
    {
      "title": "Work on regulating the volume of your voice.",
      "content": "Work on regulating the volume of your voice. Controlling the volume of your voice can help you speak more clearly and audibly. Try to maintain some awareness of how you sound as well as what you're saying. This is another instance in which practicing with a friend or recording device may help. [6] X Research source Instead of using a monotone voice, vary the pitch of your voice and the pace of your words. Start out using a mid-range pitch, then inflect your voice up or down as needed. Gauge your volume. You want to be loud enough to draw the attention of others, but not so loud that you make others uncomfortable. Pause after you say something important, and enunciate your words slowly and clearly so that everyone can hear what you're saying."
    },
    {
      "title": "Drink water before you plan on talking.",
      "content": "Drink water before you plan on talking. Many people experience a dry mouth or dry throat during moments of fear, which may make talking difficult. If you're shy or anxious, you might want to try keeping a glass or bottle of water on hand so you can have a drink before you speak. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Avoid caffeine or alcohol if you're already nervous/anxious. Caffeine can make you more stressed, and alcohol can lead to dependence."
    },
    {
      "title": "Release",
      "content": "Release some of your stress. Shyness and fear often result in feelings of stress and pent-up energy. If you're too nervous to speak loudly, you may find it helpful to release some of that built-up stress beforehand. Try excusing yourself to the washroom and using that moment alone to stretch and move your muscles before you return to your group and speak up . [8] X Research source Stretch your neck forward, backwards, and side-to-side. Stretch your mouth open as wide as it will go. Lean against the wall and stretch your hamstrings, then stretch your adductor (groin) muscles by spreading your legs and leaning side to side. Stand about two feet from a wall and do five quick wall push-ups."
    },
    {
      "title": "Use deep-breathing exercises to manage your symptoms.",
      "content": "Use deep-breathing exercises to manage your symptoms. Many people experiencing extreme shyness, fear, or anxiety suffer from unpleasant physical symptoms. These may include rapid heartbeat, shallow breathing, light headedness, and feelings of dread. No matter what physical symptoms your shyness causes, deep breathing can help calm you down and reduce the symptoms of fear/anxiety. [9] X Research source Inhale slowly while counting to four. Breathe deeply into your diaphragm (below your ribs), rather than shallow chest breaths. Hold the breath in your diaphragm for four seconds. Exhale slowly while counting to four. Repeat several times until you feel your heart rate and respiration slow down."
    },
    {
      "title": "Challenge your nervous thoughts.",
      "content": "Challenge your nervous thoughts. If you're shy or nervous, you might experience fearful thoughts during moments of panic. These thoughts can feel very real, but by stepping back and challenging those thoughts you can help break out of your cycle of self-doubt and shyness Ask yourself the following questions. [10] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source What am I afraid of? Is this fear realistic? Are my fears grounded in reality, or am I manufacturing/exaggerating this fear? What is the worst possible outcome? Would it be so bad, or could I handle that outcome and bounce back from it?"
    },
    {
      "title": "Try to think encouraging thoughts.",
      "content": "Try to think encouraging thoughts. Once you've broken the chain of self-doubting thoughts, you'll want to replace those thoughts with something more positive and encouraging. Remember that you have the ability to change the way you think, which in turn can alter the way you feel. [11] X Research source Try releasing your shy, nervous thoughts by telling yourself, \"Shyness and fear are just feelings. They may feel bad, but I can cope with these feelings until they pass.\" Tell yourself, \"I'm an intelligent, kind, interesting person. I may feel shy, but people will be interested in what I have to say.\" Remind yourself that you've felt shy or nervous before and things turned out okay. Try thinking about times you've succeeded or overcome your fears in the past to empower yourself."
    },
    {
      "title": "Do something you enjoy before every social gathering.",
      "content": "Do something you enjoy before every social gathering. Doing things you enjoy can release endorphins, relieve stress, and soothe anxiety . If you know you'll be in a situation where you will have to interact with others and you'll be attempting to speak louder than you're comfortable with, take a little time beforehand to do something fun and relaxing. [12] X Research source You don't need a lot of time or effort to squeeze in some down time. Even going for a short walk, listening to soothing music, or reading an engrossing book can all help you calm down and relax."
    }
  ]
}