{
  "url": "https://www.wikihow.com/What-to-Do-when-Your-Girlfriend-Is-Mad-at-You",
  "title": "What to Do When Your Girlfriend Is Mad at You (10+ Steps to Take)",
  "steps": [
    {
      "title": "If she asked for some breathing room, respect her wishes.",
      "content": "If she asked for some breathing room, respect her wishes. She might be really mad now, but she probably won’t be a few hours or days from now. If she’s furious, your first impulse might be to put an end to this as quickly as possible by fixing the problem right now. She may not be ready for that, so if she needs a breather, it’s best to give her that. [1] X Trustworthy Source New York State Government Official website for the State of New York Go to source This is probably good for you, even if it doesn’t feel like it right now. This will give you time to do some self-reflecting and figure out how you want to approach the conversation. It’s totally normal to be bummed out, even if you know you screwed up. Don’t be too hard on yourself—everyone makes mistakes! If the reverse is true and you need space but she wants to solve this right now, it’s totally okay to say, “I’m really sorry I upset you, and I do want to fix this, but I need to sort my thoughts out first. I hope that makes sense, I’m not trying to avoid you or anything.”"
    },
    {
      "title": "Swallow your pride and take a step back for a moment.",
      "content": "Swallow your pride and take a step back for a moment. It’s easy to get defensive, annoyed, or downright apathetic if your partner is mad and you think it’s undeserved. However, people rarely get angry for no reason at all, and it won’t help anything if you just “fight back” here. Try to look at things from her point of view and be honest with yourself about your behavior. [2] X Expert Source Connell Barrett Dating Coach Expert Interview. 24 September 2019. This will go much more smoothly if you acknowledge (to yourself and to her) what you did wrong. [3] X Research source If you really think you have zero responsibility here, you have two options. You can try and sit down and explain why you think you were in the right, or you can just let it go and apologize like you really were wrong, even if you think you weren’t. If you find it really hard to see how you upset her, take a walk and clear your head. Often, it’s hard to perceive our actions when it’s still the heat of the moment, and a break should give you some clarity."
    },
    {
      "title": "Don’t just go through the motions—really make it clear you’re sorry.",
      "content": "Don’t just go through the motions—really make it clear you’re sorry. Make eye contact , acknowledge that you know you did something wrong, and don’t try to offload the blame on to her. If you want to explain why you did what you did, go for it, but don’t try to undermine your mistake. If she has questions, answer them. If she still seems upset, ask her what you could do to make it up to her. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If there’s a gap between the start of the conflict and the next time the two of you talk, feel free to write your apology out. Even if you think she shares some of the blame here, now is not the time. Solve things first and then dissect the situation later when the two of you are in a more productive headspace. Reader Poll: We asked 598 wikiHow readers to tell us what action best builds trust after a fight, and 59% of them said a sincere apology . [Take Poll] By being genuine and taking accountability, you can actually build a stronger relationship during conflict."
    },
    {
      "title": "If she needs to share how she feels and it’s uncomfortable, take it like a champ.",
      "content": "If she needs to share how she feels and it’s uncomfortable, take it like a champ. You don’t need to put up with any outward abuse or anything, but if she feels compelled to rant, cry, or lash out at you a bit, let her get it off of her chest. It’s not always the healthiest way to cope with icky feelings, but she may need to express those feelings if she’s going to get over this. Do your best to not take it to heart. [5] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Whatever you do, don’t lash out at her for lashing out at you. That’s how screaming matches and fights start. If your goal here is to move on, you might just have to let her get it all out. If she tears into you and sees you sitting there nodding your head and saying, “I understand,” she’s very likely to feel how over-the-top she’s being and cut it out."
    },
    {
      "title": "You can either solve the original problem, or do something else for her.",
      "content": "You can either solve the original problem, or do something else for her. If she’s mad that you just keep forgetting to do the dishes, go do the dishes . But if she’s mad over something you can’t really “fix” (i.e. you said something mean that you can’t take back), do something to show her you care. If you aren’t sure what to do here, ask her! [6] X Research source You might say, “What can I do to make it up to you? I feel really bad and I want you to know how much you mean to me, so how can I do that?” If you forgot it was date night or something like that, you might say, “Look, I know I screwed up. Can I take you out next week? I’d been planning this big thing for you and I just got the dates mixed up. Let me make it up to you.”"
    },
    {
      "title": "Prove you’re on the same page by not repeating your mistake.",
      "content": "Prove you’re on the same page by not repeating your mistake. She’s just going to get mad in the future if you don’t show her you’ve learned something from the conflict. If she was mad you didn’t call her for two days straight, make an effort to call her every night you aren’t together. If she was mad you weren’t helping out around the house, set reminders on your phone to do the dishes, take the trash out, or clean up . You told her you were sorry, so show her you mean it! [7] X Research source This can take time. She probably won’t take much stock in a single gesture, but if you’re consistent and reasonable, she’ll let go of whatever was making her angry."
    },
    {
      "title": "With the serious talk over, do something to make her laugh or blush.",
      "content": "With the serious talk over, do something to make her laugh or blush. You know her best, so if she’s the type of gal who loves a cheesy pickup line, hit her with the corniest one-liner you have. If she loves sincere comments, double-down on the melodrama. Whatever it is that gets her smiling her heart out, do that to remind her that you two have a good thing going. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you make some minor gesture to try and get her to smile and she shies away from you, or doesn’t seem into it, let it go. Don’t push it."
    },
    {
      "title": "Physical contact will go a long way towards moving on.",
      "content": "Physical contact will go a long way towards moving on. When she seems ready, either just go for it or ask her, “Can I give you a hug?” Wrap your arms around her and just hold her. You can do that little “lift her off of the ground” move too if she’s into that. Hugs are scientifically proven to help people get over conflict, and just feeling your arms around her should make her feel a lot better. [9] X Research source Again, if you ask her for a hug and she’s not into it, let it go. No good comes from forcing someone to do something they don’t want to do."
    },
    {
      "title": "Once the conflict is resolved, humor may make it easy to move on.",
      "content": "Once the conflict is resolved, humor may make it easy to move on. This is only a good idea if the conflict didn’t center on something serious. If you’re barely getting over an issue that really hit a nerve with her, joking about it may make it seem like you’re making light of the situation. But if you’re past it, this is a good way to really deflate tension. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If she was upset that you didn’t notice her new haircut, you might smile and say, “Did you do something new with your eyebrows?” Take her personality into account here. This can be a bit of a risky move if your girlfriend is more on the sentimental side or she doesn’t get your sense of humor."
    },
    {
      "title": "It’s normal to fight now and then, but if there’s a lesson here, go over it together.",
      "content": "It’s normal to fight now and then, but if there’s a lesson here, go over it together. Reviewing the event a few days or weeks after it happened can be really helpful if the two of you weren’t “clicking” but there’s some insight to be gained. If the two of you are doing well, ask her if she wants to go over what happened. There may be a productive conversation to be had there. [11] X Research source You might ask her, “Hey, do you mind if we talk about that fight we had last week?” or, “Can we chat about how we can have more productive arguments when we’re mad at one another?”"
    },
    {
      "title": "If you really dropped the ball, it may be a while before things go back to normal.",
      "content": "If you really dropped the ball, it may be a while before things go back to normal. While you can’t control how she feels, you can show her that you’re serious about changing. Do your best to not get frustrated that you’re in the dog house, and continue to demonstrate that you’re worthy of her trust by being the best possible partner you can be. [12] X Expert Source Connell Barrett Dating Coach Expert Interview. 24 September 2019. If the argument comes up again, continue to apologize and let her vent. [13] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source If you were talking to other girls or something serious along those lines, it can take a long time for her to get over it (and understandably so). Don’t push back if she asks to see your social media accounts or probes about who you’re spending your spare time with. This should go without saying, but actively avoid doing the thing that upset her in the first place. If she lost it when she found out you spent a bunch of your shared bank account on a new car without talking to her, don’t make any big purchases without checking in with her first."
    }
  ]
}