{
  "url": "https://www.wikihow.com/Stop-Being-Bossy",
  "title": "How to Stop Being Bossy",
  "steps": [
    {
      "title": "Be patient.",
      "content": "Be patient. When you're used to being in a leadership role, it can be excruciating to step aside and wait for someone else to step up, and even more torturous to watch them fumble at a task that you can accomplish so quickly and easily. But what's the rush? Will it really be the end of the world if things don't go as smoothly as planned? Relax. Take a deep breath. Wait. You'll find that if you just have patience, everything will get done without you having to fight for it. [1] X Research source If others sense that you're being impatient, they'll be much more likely to rush and not to get the job done as well as you'd like. There's a difference between applying gentle pressure and stressing people out. Give people manageable deadlines that they can work with instead of asking for everything to be done in a ridiculously short time frame."
    },
    {
      "title": "Let go of perfectionism.",
      "content": "Let go of perfectionism. Sometimes we're bossy because we want things done right, and there's nothing wrong with striving for a job well done. However, there's more than one way to achieve a good result, and just because your way is the most efficient to get from Point A to Point B doesn't mean it's the best way. By assuming your way is the best way, you lock out the creativity of others, and you also chip away at morale. Perfectionism can actually impede excellence, because it creates a fear of making mistakes, and the possibility of making mistakes is essential for good work. If you're really having a hard time doing this, tell yourself that being a perfectionist is actually imperfect. Perfectionism is a paradox that prevents you from doing your best work. Say to yourself \"Life isn't perfect and that's okay.\""
    },
    {
      "title": "Encourage people.",
      "content": "Encourage people. Many bossy people focus their attention on incompetence, and they fail to notice potential and progress. Try to be more alert to people's individual talents. Give positive feedback. Positive feedback is psychologically fulfilling and will motivate people far more than nitpicking about their performance. [2] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source If you notice that a person is doing well and are impressed with the work that person is putting in, then you should praise that person for a job well done. Letting a person know that you're not only looking out for the negatives can help you build a strong relationship and will also help you be less bossy. Be specific about what they've done well so they know you're paying attention. For example, if you work in retail you can say \"I saw how you handled that conflict with the customer. That was really well done!\""
    },
    {
      "title": "Improve your communication skills.",
      "content": "Improve your communication skills. Many times it's not what you say that comes off as bossy, it's how you say it. Your tone, phrasing, and body language can make a person feel like an incompetent cog in a machine, or it can make them feel like you're inviting them to reach a worthwhile goal with you. It's important to pay attention to your timing, your wording, and the examples you use when you try to ask a person to get something done or to offer feedback. The smoother your communication, the more easily you'll be able to get things done without breathing down anyone's neck. Here are a few suggestions for good communication: [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Focus completely on the person talking. Avoid roaming attention like playing on your phone or staring at the ground. Be consistent with body language. Nonverbal communication says a lot. If you've got your arms crossed and you're frowning, nothing you say will be taken very positively. Take your audience into account. For instance, if you're talking to a child, you probably want your tone of voice to be different than if you're talking at a board room meeting. Keep your approach consistent with who you're talking to."
    },
    {
      "title": "Strive for consensus.",
      "content": "Strive for consensus. Nothing fosters team-building like consensus-building. You can be a facilitator, ensuring that everyone's opinion is heard, and that a decision is made that is satisfactory to everyone involved. If it's just your way or the highway, then people are much less likely to feel like they are in a supportive, beneficial environment. This kind of collaboration will help people feel included and increase trust in the group. [4] X Research source If you're in a group of people, go around in a circle asking each person \"Do you have any ideas for the best way we could do this?\" Tell people that it's okay to chime in if they have a question or comment. Create an open floor. Before moving on from an issue, make sure everyone is on the same page. If someone doesn't agree, let them know that you appreciate their feedback and hope to hear from them again in the future. You may think that laying down the law is the best way to get things done, but it will actually make people much less happy to work with you. Besides, hearing what everyone has to say can help you find new approaches for getting work done. If you feel like your way of doing things is the only way to get things done, then you'll have a hard time incorporating creative ideas from other people."
    },
    {
      "title": "Ask for honest feedback.",
      "content": "Ask for honest feedback. Ask for it honestly, not simply because it is a good idea or makes a good impression. Explain to people that you know you can come off as bossy or domineering sometimes, and you'd like to change your style. Ask them to let you know when you're coming off as bossy, whether by pulling you aside, or even by sending you an anonymous note or e-mail. Be humble and request their help. This shows that you are eager to grow and that you aren't wedded to your idea of doing things. [5] X Expert Source Stefanie Barthmare, M.Ed., LPC Psychotherapist Expert Interview. 21 May 2021. Use the \"SKS\" method for getting feedback. [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Ask these three questions to the people around you: \"What should I stop doing?\" \"What should I keep doing?\" \"What should I start doing?\""
    },
    {
      "title": "Take a step back and breathe.",
      "content": "Take a step back and breathe. If you're in the middle of a situation where you feel the urge to boss someone around, take a moment to yourself. Focus on your breath and take several deep \"belly\" breaths, inhaling so that your stomach extends out while your chest stays in place. This will activate the \"rest and digest\" part of your nervous system, calm you down, and allow you more flexibility to act. Use this technique to stop yourself from following the same old pattern of being bossy. Instead, you can choose a different path that's more personable and probably even more efficient. [7] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source"
    },
    {
      "title": "Learn to admit when you're wrong.",
      "content": "Learn to admit when you're wrong. A big part of being bossy stems from always thinking that you're right about everything. If you let this go and admit that you're just as fallible as the next person, then you'll learn to work with others and to see that they have knowledge and experience to offer you as well. The next time you made a mistake, whether it was at work or with your circle of friends, swallow your pride and admit it. Say that you did what you thought was best and it didn't turn out the way you wanted it to. People will appreciate this behavior, instead of you pretending that everything was someone else's fault. [8] X Expert Source Stefanie Barthmare, M.Ed., LPC Psychotherapist Expert Interview. 21 May 2021. If you've made a mistake, a sincere apology will help set things straight and let people know that you are open to compromise, rather than just being bossy. [9] X Research source For example, you can say \"I'm sorry about what I did. I know I make mistakes just like everyone else.\""
    },
    {
      "title": "Accept things the way they are.",
      "content": "Accept things the way they are. If you're bossy, then the hardest thing in the world can be to accept that some things will just be the way they are. This can include the weather, your coworkers, your friends, or really anything that you can't completely control or boss around. Though there are some things that are worth changing or improving, there are others that you simply cannot change. The sooner you accept this, the sooner you'll be on your way to being less bossy and having a more calm, restful mindset. Work on accepting things you can't change. Ask yourself if it's something within your control and also if it's something that will have positive consequences if changed. For example, sometimes making changes that aren't absolutely necessary may anger people around you, if they like things the way they are. Make sure it's worth it before you go around changing everything. You can say to yourself \"This is a hard thing for me to accept, but I'm going to try my best, because it's out of my control.\" Of course, it's okay not to accept some things. If something really isn't working in your environment, then wanting to change it can be an admirable and meaningful task."
    },
    {
      "title": "Know that giving up control can be as rewarding as taking it.",
      "content": "Know that giving up control can be as rewarding as taking it. You may think that giving up control means admitting failure and giving up your perfect vision of whatever you want to happen. However, in reality, giving up control can actually be a gratifying experience. Not only will you be improving your relationship with others by allowing them to gain responsibility, but you'll also be relieving your own stress, and allowing yourself to have more time to do the things you enjoy doing (and that doesn't include bossing other people around). At first, you may find it unpleasant, but the more you do it, the better it will feel. Start small to ease into this. You shouldn't give up all responsibility of your main project or stop making any decisions at all. Just give up some minor control at first, whether you let another coworker proofread a report or let your friend choose where you want to eat. You'll see that it'll get easier and easier. Giving up control can actually improve your performance and even your own health. It's good for productivity to be open to making mistakes, and giving up control will allow you to be easier on yourself."
    },
    {
      "title": "Have realistic expectations for other people.",
      "content": "Have realistic expectations for other people. [10] X Research source Bossy people often want the people around them to be someone other than who they are. They may want them to be more committed friends, harder workers, or more efficient people, and they may try everything they can to make these people change. Now, there are many situations where a person has room for improvement, such as a messy roommate or a coworker who is always late, and those problems are worth addressing. But you can't expect a person to change completely or you will be sorely disappointed. For example, if you have a messy roommate, you can certainly ask the person to do his share of the dishes, to take out the trash more often, and to clean up his or her own space. You can do this and hope the person doesn't have to be reminded, but you can't expect the person to keep everything perfect 100% of the time. There's a difference between having high expectations and unreasonable expectations. Sure, you can expect the people who work under you to pick up the slack, but you can't get them to double their pace unless they really have a lot of room for improvement."
    },
    {
      "title": "Work on your self-esteem.",
      "content": "Work on your self-esteem. A lot of the reasons that many people are bossy have to do with their lack of self-esteem. You may feel like people won't like you or they won't listen to you unless you're bossy and rude and tell them exactly what to do. Instead, you need to recognize that you're a person who is worth listening to, and that you don't have to put the pressure on so much to have others hear you out. Work on doing the things you love, addressing the flaws that can be addressed, and realizing that you're a person who is worth listening to — the first time around. Use these steps: Take an inventory of what you're good at. Make a list of things you believe are your areas of strength. If you have trouble coming up with very many, think about what positive things people have said about you over the years. Set realistic expectations for yourself. One of the easiest ways to be too hard on yourself is to have unrealistic expectations. Examine what you expect from yourself in performing the activities of your life and ask yourself if they are reasonable. You may want to consult a trusted friend or family member to get a second opinion. Focus on progress rather than perfection. Instead of setting up a really high goal, focus on small improvements that you make. For example, if you're trying to start exercising, focus on doing ten minutes more than you did the day before, rather than expecting yourself to be able to work out for two hours right off the bat."
    },
    {
      "title": "Pick your battles.",
      "content": "Pick your battles. It can be tempting to micromanage the behavior of others, and at times it may actually be positive for you to intervene, but make sure to pick which battles you fight and which you let slide. Reserve intervention for really important situations rather than stuff that can probably get by without you. This will give the people around you room to breathe and help you maintain your own sanity. You won't be running around constantly checking on everyone, and other people won't feel like you are watching their every move. Picking your battles will give everyone a little more room to breathe. It may be helpful to ask yourself in the moment, \"Is this something that really needs my attention? Is the other person capable of doing it on their own? Are there more important things going on right now that could benefit from my help?\""
    },
    {
      "title": "Be more flexible.",
      "content": "Be more flexible. People who are bossy are not very flexible people because they don't leave room for any X Factors and hate the sound of the term \"Plan B.\" However, if you want to stop being bossy, then you have to learn to be a bit more flexible instead of expecting everything to go a certain way. Maybe you've been excited about your dinner date with your best friend for weeks and have been craving Mexican food, while your friend has a hankering for sushi. Maybe your coworkers asked for an extra day to wrap up their report due to some last-minute changes. Use these techniques to improve your life flexibility: [11] X Research source Take different perspectives. If a coworker says that he wants to do a project a certain way, before you dismiss the idea, ask yourself why he might want to do that. Consider opinions before dismissing them. Strain to understand things outside your normal perspective. Avoid over-generalizing with rules of thumb. For example, you may believe that the early bird gets the worm. That may be true sometimes, but other times someone who shows up later on may have shown up at just the right time. Recognize that there are exceptions to most rules. Avoid putting too much weight on feelings of certainty and uncertainty. Your intuition isn't always right. You should certainly take your gut feelings into consideration, but sometimes it's good to wait and see rather than acting on instinct all the time."
    },
    {
      "title": "Manage your anxiety.",
      "content": "Manage your anxiety. A lot of people are bossy because they can't handle the thought of something not going exactly as they planned. They get anxious at the thought of someone arriving five minutes late, of a project to not be written exactly as they want it to be written, or of going to a new place they have never seen before instead of the place they insist on going. If your bossy behavior comes from the worry that something unexpected will derail your day, then you need to start learning to put your anxiety aside. If your anxiety isn't very severe, you can take measures to reduce it on your own, such as meditating, cutting back on caffeine, and exercising. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can also use verbal affirmations. If you start to feel overwhelmed with anxiety, say to yourself things like \"My anxiety does not control me\" or \"I am safe and protected.\" [13] X Research source If you suffer from severe anxiety and find yourself staying up nights worrying, shaking because you're so worried, or finding it hard to focus because you're obsessing over all the things that can go wrong, then you may want to see a mental health care professional."
    },
    {
      "title": "Let others make the decision.",
      "content": "Let others make the decision. To truly bossy people, this can be the scariest thing of all. But once you try it, you'll see that there was nothing to worry about. Start with the little things. If you're hanging out with friends, let them pick the movie you'll watch or the restaurant where you'll eat. If you're at work, let one of your coworkers decide on how the report should be formatted, or which person in another department should be included in the conversation. This is an effective form of exposing yourself to letting go of control and showing yourself that nothing disastrous will occur if you let go a little bit. [14] X Research source If you're known for being bossy, then people will be pleasantly surprised and will really appreciate it when you give them a chance. You can take a deep breath and say \"Why don't you make the decision about our plans? I don't mind.\""
    },
    {
      "title": "Be more spontaneous.",
      "content": "Be more spontaneous. Bossy people tend to have difficulty acting outside of set plans. Try to counteract your habitual nature and to find a way to live outside of your usual routine. Take a last-minute road trip with your friends. Take up a completely new hobby you never even considered until last week. Learn a new form of dance. Suddenly burst into song. Do whatever you don't normally do and relish in the novelty of it. Soon, you'll realize that it's fun to color outside of the lines and not have to control every detail of your life. [15] X Research source Spending more time with spontaneous people who don't plan the future very much can also help you be spontaneous yourself. See what happens when you leave your weekend open instead of planning it down to the minute. You may find that a new exciting adventure falls into your lap. Call a friend and say \"Hey, want to go on an adventure this weekend?\" You can brainstorm ideas together."
    },
    {
      "title": "Delegate.",
      "content": "Delegate. Another thing you can do to stop being bossy is to delegate some of the tasks that you need to get done. If you're planning your own wedding, instead of yelling at everyone in your orbit, ask one friend to help you pick the flowers, ask another to help make the invitations, and so on. Don't put everything on yourself and then start yelling at everyone to do everything at once; instead, be careful about who you want to do what, and you'll find that delegating is much better than bossing people around. Here are some of the benefits of delegation: Delegation frees you up to pursue the things you're best at. It can help you work with other people such that everyone is doing their best work. Delegation builds mutual trust. It shows the people around you that you trust their competence to complete the task you've asked them to do. Delegation produces the best output. Instead of having to do everything yourself, which takes time and effort, if you delegate then you'll have a number of people working toward a goal. This will help make projects more effective and productive. Ask politely when delegating tasks. You can say \"Would you be willing to do this task for me?\""
    },
    {
      "title": "Stop giving advice when it isn't needed.",
      "content": "Stop giving advice when it isn't needed. Another thing bossy people tend to do is to tell people what they should do or how they should act when that advice is not solicited. If your friend is asking for advice, that's one thing, but if your friend is just minding her own business, then you shouldn't tell her to dump her boyfriend or that she should get a haircut. Be sensitive to the needs of others and only give advice when people ask for help or when they really need help, instead of acting like a know-it-all who thinks that her way is always the best way. Constant unsolicited advice-giving shows people that you don't trust their abilities. It's a bad way to gain trust from the people around you. [16] X Research source People are less likely to take your advice if you give it unsolicited, so sometimes all you are doing is wasting your time."
    }
  ]
}