{
  "url": "https://www.wikihow.com/Thread-a-Kenmore-Sewing-Machine",
  "title": "How to Thread a Kenmore Sewing Machine",
  "steps": [
    {
      "title": "Release the clutch.",
      "content": "Release the clutch. Turn the clutch knob toward you, or counter-clockwise, to release it. The clutch knob should be located on the right side of your machine. For most models, you will need to hold the outside of the knob still with one hand while turning the inner portion of the knob toward you with the other hand. The outer portion is the hand wheel, while the inner portion is the clutch knob."
    },
    {
      "title": "Place your thread on the spool pin.",
      "content": "Place your thread on the spool pin. Situate the spool of thread so that the spool pin of your machine sits in the center hole of your spool. The thread of the spool should be wrapped around the center in a counter-clockwise rotation. For most models, the spool pin is vertical. On some models, though, like the Kenmore 385.16120, the spool pin will actually sit in a horizontal position as you wind the bobbin and thread your machine. On the Kenmore 117.591, the spool pin is located at the base of the machine and the bobbin winder, along with its corresponding parts, are located on the front right of the machine."
    },
    {
      "title": "Draw thread through the bobbin winder tension disc.",
      "content": "Draw thread through the bobbin winder tension disc. Pull thread from your spool and fit it into the small tension disc, usually located near the front top of your machine. Insert the thread into the disc from the upper right and wrap it around the entire left side, ultimately bringing it back out and to the lower right. Do not wrap it around the disc in a complete rotation."
    },
    {
      "title": "Pull the thread through the hole of the bobbin.",
      "content": "Pull the thread through the hole of the bobbin. Before placing the bobbin on your bobbin winder shaft, insert the thread through the hole in your empty bobbin spool. When done, place the bobbin on the machine's bobbin winder shaft. Make sure that the bobbin spool is flipped so that the hole appears on the top, rather than the bottom. The bobbin winder shaft usually lies to the right of your spool pin. As you place the bobbin on its shaft, make sure that the thread wraps around it a bit from the bottom of the bobbin."
    },
    {
      "title": "Push the bobbin to the right.",
      "content": "Push the bobbin to the right. Firmly push the bobbin and its shaft to the right of the machine until you hear a click. The bobbin should now be directly next to a bumper. This bumper helps control the amount of thread wound onto the bobbin."
    },
    {
      "title": "Start the machine and wind the bobbin.",
      "content": "Start the machine and wind the bobbin. Hold onto the end of the thread coming out of your bobbin with one hand. Use your foot to press on the machine's power pedal, running the machine as a result. Continue winding the bobbin until the winder stops on its own. Note that you should also consider snipping off the excess end from the top of the bobbin after you partially fill the bobbin spool. On some models, this excess thread will even snap on its own. This is true for the Kenmore 158.1340, 1345, 1350, and 1355."
    },
    {
      "title": "Cut the thread.",
      "content": "Cut the thread. Push the bobbin winder back to the left and lift the bobbin off. Cut the thread, leaving a small tail behind."
    },
    {
      "title": "Tighten the clutch.",
      "content": "Tighten the clutch. Hold the outer portion of the hand wheel still while turning the inner clutch knob away from you, in a clockwise rotation. You should feel the clutch tighten up again. On some models, you can push the hand wheel in to tighten the clutch. This is true for the Kenmore 158.1430, 1431, 1625, 1641, 1940, and 1941."
    },
    {
      "title": "Remove the extension table.",
      "content": "Remove the extension table. On most models, this can be accomplished simply by pulling it to the left. The extension table sits at the bottom left front of your machine. It covers the bobbin shuttle, so you'll need to remove it before you can load the bobbin."
    },
    {
      "title": "Open the shuttle cover.",
      "content": "Open the shuttle cover. Find the embossed or marked portion on the shuttle cover at the new front of your machine. Pull this part of the cover down to open the cover. Usually, this embossed handle is located to the left of the cover. On some models, the shuttle door is actually located just to the front of the needle plate and not on the front of the machine. The door will lift up instead of swinging out. This is true for the Kenmore 1222, 1310, 1311, 1322, and 1422. It's also true of the 1521, 1560, and 1937."
    },
    {
      "title": "Raise the needle.",
      "content": "Raise the needle. Turn the outer portion of the hand wheel toward you. Watch the needle as you turn the wheel, and stop rotating it once the needle reaches its highest point."
    },
    {
      "title": "Take the bobbin case out.",
      "content": "Take the bobbin case out. You should see a latch on your bobbin case. Pull this latch toward you to release the case from the shuttle, then pull the case straight out to remove it. Release the latch once the case is out of the machine."
    },
    {
      "title": "Insert the bobbin.",
      "content": "Insert the bobbin. Position the bobbin so that the thread winds around it in a clockwise rotation. Push the bobbin into the case, and weave the end of the thread into the slot located at the top of the case. Continue pushing it through this slot until you can pull the thread under the tension spring. The tension spring is a little piece held on top of the case with a small screw."
    },
    {
      "title": "Return the case to the shuttle.",
      "content": "Return the case to the shuttle. Lift the latch out once more and push the loaded case back into the shuttle. The latch should face the left of your machine. Release it once the case is back in the shuttle. You will usually hear a click when you release the latch. Wiggle the case around to make sure that it has been locked in place."
    },
    {
      "title": "Raise the take-up lever.",
      "content": "Raise the take-up lever. The take-up lever is a hook located at the left front of the machine, well above the needle. Rotate the outer portion of the hand wheel toward you, in a counter-clockwise rotation, until you see this level reach its highest or most outward point."
    },
    {
      "title": "Raise the presser foot.",
      "content": "Raise the presser foot. Find the presser foot lever, usually located just behind and needle and above the pressure foot. Lift it up to lift the pressure foot off the bottom of the machine."
    },
    {
      "title": "Place the thread on the machine's spool pin.",
      "content": "Place the thread on the machine's spool pin. Situation the spool of thread so that the thread winds in a counter-clockwise rotation and comes off the spool from its back. As mentioned previously, the spool pin will be vertical for most models, but some models do use a horizontal spool pin."
    },
    {
      "title": "Draw the thread through the rear thread guide.",
      "content": "Draw the thread through the rear thread guide. This thread guide is located on the top of the machine, toward the back, and usually to the left of the bobbin guide. Wrap the thread around the left side of this guide, drawing it down toward the front of the machine. You should hold the spool stationary with your right hand while threading this part of the machine. Doing so keeps the thread sufficiently taut and prevents the threading from accidentally coming loose."
    },
    {
      "title": "Wind the thread down the front of the machine and back up again.",
      "content": "Wind the thread down the front of the machine and back up again. The front of your machine should be marked with an \"A\" path and \"B\" path, or with equivalent labels. Draw the thread down the A path, hooking it into the latch at the bottom of the path, and back up through the B path at the left. For most models from the Kenmore 158 series and 385 series, there will be a tension knob at the bottom of your first thread path. There are hidden tension discs in between this knob and the machine, and you will need to wrap the thread around the bottom of this knob to insert it in between these tension discs. For other models, there will be a tension area with a check spring holder located near the front bottom of the machine instead of a tension knob. You will need to wrap the thread around the check spring holder from the back. This is the case for the Kenmore 385.11607 and 12714 models, as well as several other models from the 385 series. Note that on the Kenmore 117.591, the thread guides and all corresponding parts are located on the left side of the machine and not on the front. The threading process essentially remains the same, though. This is also true of several other models, including the Kenmore 28, 29, 40, 1100, 1101, and 1102."
    },
    {
      "title": "Thread the tension spring.",
      "content": "Thread the tension spring. The tension spring should be located at the top of your B path, or just a hair to its left. Pull the thread up and into this spring to secure it in place."
    },
    {
      "title": "Draw the thread down the front of the machine again.",
      "content": "Draw the thread down the front of the machine again. The front of your machine should have one more marked path. Draw the thread down this path, making sure that it clips into the take-up lever in the process. You should be able to release the spool at this point."
    },
    {
      "title": "Pull the thread through the lower guide.",
      "content": "Pull the thread through the lower guide. Clip the thread into the first lower thread guide at the bottom of the previous thread path. Clip it into the second lower thread guide positioned just above the needle. This second thread guide will look like a small horizontal pin."
    },
    {
      "title": "Thread the needle.",
      "content": "Thread the needle. Weave the end of the thread through the front of the needle and out from the back. Leave a small tail extending out toward the back of the machine. Note that if the eye of the needle faces side-to-side instead of front-and-back, thread the needle from the left side to the right side."
    },
    {
      "title": "Rotate the hand wheel toward you.",
      "content": "Rotate the hand wheel toward you. Loosely hold the end of your top thread with your left hand while turning the outer part of the hand wheel clockwise, or toward you. Rotate the wheel a full turn. Make sure that the presser foot has been raised before doing this."
    },
    {
      "title": "Bring up the bobbin thread.",
      "content": "Bring up the bobbin thread. You should notice a small loop coming up from the bottom of your needle plate. Gently tug on your upper thread end to straighten this loop and pull the bobbin thread out from within the shuttle."
    },
    {
      "title": "Pull both threads under the presser foot.",
      "content": "Pull both threads under the presser foot. Position both thread ends so that they are underneath the pressure foot and pointing toward the back of the machine. Leave a tail of thread roughly 3 to 4 inches (7.5 to 10 cm) long for both the top thread and bobbin thread."
    }
  ]
}