{
  "url": "https://www.wikihow.com/Tell-Someone-to-Stop-Flirting-With-You",
  "title": "How to Tell Someone to Stop Flirting With You",
  "steps": [
    {
      "title": "Drop hints about your significant other, even if you have to make up a fictional person.",
      "content": "Drop hints about your significant other, even if you have to make up a fictional person. During conversations with the flirtatious person, mention your boyfriend or girlfriend several times. Weave stories about your significant other into conversations. For example, if the offending “flirter” talks about how he or she would love to take you to a particular restaurant say, “I had an amazing time when \"John\" or \"Sally\" and I went to that restaurant –– it's where we fell in love.” [1] X Research source"
    },
    {
      "title": "Keep photos of your significant other in clear view.",
      "content": "Keep photos of your significant other in clear view. Place one or two framed photos of your boyfriend or girlfriend on your desk, keep a photo in your wallet or pin up their photo where you work. Again, if you aren't seeing anyone you can still “make-up” someone and use a photo of an attractive friend. It is not a good idea to create a fictional partner if you will see the flirter on a regular basis, as your lie will be more obvious and potentially cause more problems. If you have a serial flirter in a social context, wear a t-shirt printed with your beloved's face and include text such as \"My fiancé\" or \"My better half\" or \"I love my boyfriend/girlfriend\"."
    },
    {
      "title": "Discuss weekend plans with your significant other.",
      "content": "Discuss weekend plans with your significant other. Never be available to make plans with the person who is flirting with you. That will only encourage the behavior. Instead, talk about plans you have with your boyfriend or girlfriend. If you don't have a partner at the moment, use other excuses that fill up your calendar, such as work or family commitments, your pressing hobby needs or sporting activities (which don't allow visitors). If your flirter overhears you making plans to go out with friends and tries to insinuate themselves to come along, let your friends know in advance that they all need to ward off this person's attentions as a team. Your friends will do you proud if they know! [2] X Research source"
    },
    {
      "title": "Be very frank — In a nice way, of course.",
      "content": "Be very frank — In a nice way, of course. That way you don't have to engage in building falsehoods or half-truths, which the flirter may detect anyway. Try saying to the flirter, \"I don't want to sound mean, or rude, but I believe in being up-front and honest. I'm afraid I have to tell you, I'm not interested in going out with you. Sorry, but at least this way, we won't waste each other's time.\" If you genuinely like the person, you can then ask, \"Are you ok? I really hope we can still be friends.\" If not, the best policy is to end the discussion quickly and abruptly. Keep in mind that everybody gets rejected now and then. Don't assume the flirter can't handle it. If you are worried about hurting their feelings, remember that it is more hurtful to lead someone on than to be honest and upfront."
    },
    {
      "title": "Do not ever flirt back.",
      "content": "Do not ever flirt back. If you truly want the behavior to stop, do not laugh or give \"come hither\" looks. And be careful how you use body language to confuse the matter, as some people can get mixed signals and assume there is more that you're simply too shy to vocalize. In one infamous case, an investment manager accused his date in an email rant of giving him reason to believe they'd have a second date, based simply on her hair twirling, constant eye contact and being nice to him, so he felt petulant when she refused to see him again! While that's a particularly awkward case, body language is something over which you have control, such as: Turn your head or look away when the other person begins to flirt or uses flirtatious body language. For example, if he or she comments on your appearance, look away and do not respond. [3] X Research source Move away from the other person if he or she touches you. If the other person grabs your hand or puts his or her arm around your shoulders, back off and move away. It's fine (in fact probably desirable) to tell them not to touch you again too, saying you don't like it. Remain civil. Never lash out with nasty comments or mean remarks; it may not only encourage the behavior but can make an uncomfortable situation even worse. If you are a normally flirtatious person with everyone you meet, try to tone it down around this person because they may be unable to distinguish the fact that you act this way toward everyone and not just toward them. Alternatively, have a good friend take them aside and explain that this is the way you behave with everyone , so as to burst their balloon early on. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Walk away from the situation.",
      "content": "Walk away from the situation. If you are at an office party, social event or bar, politely excuse yourself and leave. Go and talk to other people, making it difficult for this person to get close to you again. In a professional context, you can draw the line using work as the excuse. Tell them that you (or they) have to leave because you have work to do, a meeting to attend, a deadline to meet, etc. If there is a habit of this person \"hanging about\", you'll need to get more specific and let them know that you don't appreciate having your work time interrupted so frequently. [5] X Research source"
    },
    {
      "title": "Discuss the behavior with a close friend or work colleague.",
      "content": "Discuss the behavior with a close friend or work colleague. If your friend or peer witnesses the behavior and seems to egg it on, discuss your feelings and let him or her know you want to diffuse the situation, not encourage it. Hopefully next time you are together and the flirting begins, your friend has your back and you can both provide a non-reactive response."
    },
    {
      "title": "Ask to meet the flirtatious person to have a private discussion.",
      "content": "Ask to meet the flirtatious person to have a private discussion. If subtle cues are not working you'll have to discuss your feelings. Meet with the other person in a private setting, but not in a place that is removed from other people. Places such as a coffee shop or a conference room at work are ideal. Never arrange the meeting in your car, the stationery room, your home or any other private areas that may encourage the other person to make a move."
    },
    {
      "title": "Be honest about how you feel.",
      "content": "Be honest about how you feel. [6] X Expert Source Julianne Cantarella Dating & Relationship Coach Expert Interview. 6 August 2021. While honesty is the best policy, you don't have to deliver your feelings in a brutal manner. Some kinder methods include: Begin the conversation with qualities you admire in the other person but be neutral. Talk about topics like work ethics or friendliness. Avoid making appearance or intelligence as the other persons' admirable qualities; doing so could send the wrong message. You can avoid making an accusation (which makes people react defensively) by easing into a frank conversation with an assumptive statement such as, \"I know you don't mean anything by it\" or \"I know you're an outgoing person and you don't have any intentions behind it...\" Then if the flirter doesn't immediately follow the hint, you can go on with, \"...but I'm not really comfortable with all the flirting/hugging/shoulder-rubs/hand-holding/winking/etc. at work/school/wherever. [7] X Expert Source Julianne Cantarella Dating & Relationship Coach Expert Interview. 6 August 2021. I'm in a relationship/married/not-looking-for-a-relationship/etc. and I'd rather our friendship be kept professional/platonic/not-so-flirty/etc.\" Often the other party will automatically concur they don't \"mean anything by it\" to save their own embarrassment, and since it's been said aloud, they'll have to continue showing they \"don't mean anything\" in order to save face in future. Preferably, they will steer clear or stop themselves mid-flirt the next time, because now they'll pay attention and begin to notice the flirting is not being reciprocated. Tell the person why you cannot accept his or her flirtatious advances. Consider your words before you meet with this person so that you can give a solid statement about why they need to curb their behavior. Giving false excuses may be misunderstood as an opportunity to convince you to go out with them. [8] X Research source If the flirter persists, you can point out that they are not showing respect for your wishes. If they really like you, they will respect your need to be left alone. Don't back down. Stick to your guns and don't divert from how you really feel. Don't allow the other person to lead you astray from your original thoughts and delivery."
    },
    {
      "title": "Allow the other person to respond.",
      "content": "Allow the other person to respond. Be receptive to questions or comments. You may want to anticipate possible questions and prepare responses ahead of time."
    },
    {
      "title": "Don't allow the conversation to last longer than an hour.",
      "content": "Don't allow the conversation to last longer than an hour. The idea is to stop the other person from flirting with you so don't give the conversation more time than necessary. Keep an eye on the time and when an hour has expired, cordially end the conversation and excuse yourself."
    },
    {
      "title": "Remain friendly, but distant.",
      "content": "Remain friendly, but distant. Do not seek out the other person for conversations or discussions. If you work with the other person, keep interaction limited and to a public area. Remain friendly and civil at all times, assuming behavior you'd exhibit with your child's school principal or another professional."
    },
    {
      "title": "Keep email or phone correspondence short and to the point.",
      "content": "Keep email or phone correspondence short and to the point. If you have to correspond with the other person, keep it professional and concise. Don't add jokes or personal information during your interaction. If you're not required to email or call the flirtatious person, avoid contact."
    },
    {
      "title": "Don't seek out the flirtatious person's attention.",
      "content": "Don't seek out the flirtatious person's attention. Never encourage the behavior after you've had a discussion or stopped interacting with the flirtatious person; this will send a mixed message and could rekindle the behavior. Keep any meeting limited to group situations and maintain limited to no contact with the specific person."
    }
  ]
}