{
  "url": "https://www.wikihow.com/Update-Outlook-on-PC-or-Mac",
  "title": "How to Update Outlook on PC or Mac: Full Guide to Get the Latest Version",
  "steps": [
    {
      "title": "Click the File tab.",
      "content": "Click the File tab. This button is in the upper-left corner of the Outlook app. This will open your file options in a new menu. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Note that Office products like Outlook update automatically when you update Windows. If you’re trying to add emails to Outlook, check out our guide for setting up email in Outlook ."
    },
    {
      "title": "Click Account on the File menu.",
      "content": "Click Account on the File menu. This will open your account and software information on a new page. On some versions, this option may be labeled Office Account ."
    },
    {
      "title": "Click the Update Options button.",
      "content": "Click the Update Options button. This is in the “Product Information” section. A drop-down menu will appear with various update tools."
    },
    {
      "title": "Click Update Now.",
      "content": "Click Update Now . This option will check online for available updates, and install the latest software update for Outlook. If you don't see this option here, click Enable Updates first. The Update Now button should now show up in the menu. For additional Outlook tips, take a look at our guides on using Outlook rules and managing your Outlook effectively."
    },
    {
      "title": "Click the File tab.",
      "content": "Click the File tab. This button is in the upper-left corner of the Outlook app window."
    },
    {
      "title": "Click Help.",
      "content": "Click Help . Find this option on the left-hand side, and click or hover over it to see your options."
    },
    {
      "title": "Click Check for Updates on the Help menu.",
      "content": "Click Check for Updates on the Help menu. This will check for available updates, and download the latest software update on your computer. On some versions, this option may also be named Install Updates . Make sure your PC is up to date before updating Outlook 2010. If your Windows system is not up to date, you'll be taken to the Microsoft website."
    },
    {
      "title": "Click the Help tab.",
      "content": "Click the Help tab. This button is located next to Window on your menu bar at the top of your screen. It will open a drop-down menu with help-related options. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Check for Updates.",
      "content": "Click Check for Updates . This will open the Microsoft AutoUpdate wizard in a new pop-up window. If you don’t see an option called “Check for Updates,” try running the newest version of the Microsoft AutoUpdate tool. Then look for “Check for Updates” again."
    },
    {
      "title": "Select Update in the AutoUpdate window.",
      "content": "Select Update in the AutoUpdate window. This option will allow you to check for updates manually without scheduling automatic update checks. You can check Automatically keep Microsoft Apps up to date in this menu. Outlook will automatically check for new updates in the future. Click the down arrow button next to Update to see every available Office update. You can update just Outlook from here by clicking Update next to Microsoft Outlook."
    },
    {
      "title": "Open the App Store on your Mac.",
      "content": "Open the App Store on your Mac. This is the “A” icon on a blue background in the Dock or Finder. If you have automatic updates turned on for the App Store, Outlook will update automatically as new versions are released."
    },
    {
      "title": "Click Updates in the left menu.",
      "content": "Click Updates in the left menu. Navigate to Microsoft Outlook and click Update ."
    }
  ]
}