{
  "url": "https://www.wikihow.com/Tell-Someone-You-Lied",
  "title": "How to Tell Someone You Lied",
  "steps": [
    {
      "title": "Schedule a time to sit down and talk with them.",
      "content": "Schedule a time to sit down and talk with them. [1] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Tell the other person that you need to talk to them about something. Ask them when would be a good time for them. Then, set a time when you can sit down and talk about what happened without either of you feeling rushed. [2] X Research source It’s best to tell them at a time when they’re calm and have time to talk. Make sure you choose a time that’s good for them. You might say, \"I have something I want to talk to you about. Are you available to get coffee this afternoon?\" or \"I need to tell you something important. When can we sit down and talk?\""
    },
    {
      "title": "Maintain eye contact",
      "content": "Maintain eye contact so they believe you’re telling the truth. Most people believe that maintaining eye contact means you’re being honest. While eye contact doesn’t always mean someone’s being truthful, looking someone in the eyes may help them believe you. Make sure you hold eye contact while you explain what happened. [3] X Research source It’s okay to look away for 1-2 seconds at a time. However, do your best to keep your eyes focused on theirs."
    },
    {
      "title": "Admit that what you said was a lie.",
      "content": "Admit that what you said was a lie. Telling someone you made a mistake is scary, but it’ll help you make things better. Explain to the person that you told them something that was untruthful. Then, tell them specifically what you said that was a lie. [4] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. You might say, “I need to tell you that I told you a lie. When I said that I lost your necklace, I was being untruthful. I actually just wanted to keep it.” As another example, you could say, “When I told you I didn’t have homework, I was actually lying. Now, my grade is low because I never turned in my homework.”"
    },
    {
      "title": "Use I-statements so the other person doesn’t become defensive.",
      "content": "Use I-statements so the other person doesn’t become defensive. When you admit to doing something wrong, it’s normal to want to minimize your responsibility. However, you’re the only person who’s responsible for your actions, and blaming the other person will only make them defensive. As you explain what happened, use I-statements to keep the focus on what you did. [5] X Research source Say something like, “I was afraid that you would break up with me” or “I felt like you wouldn’t understand.”"
    },
    {
      "title": "Explain why you lied to them.",
      "content": "Explain why you lied to them. The person will likely want to know why you lied, and being honest about your motive might help them forgive you. [6] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Tell them why you felt like you needed to tell a lie. Make it clear that you’re not trying to excuse your behavior, but you want them to know why you chose to lie. [7] X Research source Say, “I felt like you would be angry with me, so I decided to lie,” or “I was worried about getting in trouble, so I lied.” Then, say something like, “I’m not trying to make excuses. I just wanted you to know why I did what I did.”"
    },
    {
      "title": "Tell them the truth if there’s information they don’t know.",
      "content": "Tell them the truth if there’s information they don’t know. After you admit to lying, be completely honest about what happened. Explain the true version of events so the person has all the facts. This will help you repair the damage you did by lying. [8] X Research source For instance, let’s say you lied to take credit for someone else’s work. You might say, “In reality, Alex did all the work on this project.” Similarly, if you lied about kissing your friend’s crush, you might say, “We did kiss at the party, but it only happened one time.”"
    },
    {
      "title": "Listen",
      "content": "Listen to what the other person has to say. [9] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Give the other person a chance to explain how they feel about the situation. Listen carefully to their side of the story. To make sure you understood, paraphrase what they said back to them. [10] X Research source You might say, “It sounds like you feel betrayed my actions and aren’t sure if you can trust me.”"
    },
    {
      "title": "Tell them that you know lying was wrong.",
      "content": "Tell them that you know lying was wrong. Admitting that what you did was wrong helps them see that you’re sincere in your apology. [11] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Explain that you’ve thought about your actions and regret lying to them. As you do this, don’t make any excuses for your behavior. [12] X Research source You could say, “Lying to you was the wrong thing to do,” or “I know that lying was wrong.”"
    },
    {
      "title": "Acknowledge how the other person might feel.",
      "content": "Acknowledge how the other person might feel. Recognizing the other person’s feelings helps you show them you’re truly sorry. Consider how you would feel in the other person’s place. Then, tell them that you understand that they might feel this way. Say, “If I were in your place, I’d feel confused and unsure if I could trust me. I’d probably never want to talk to me again.”"
    },
    {
      "title": "Tell them you’re sorry for telling the lie.",
      "content": "Tell them you’re sorry for telling the lie. Say that you’re sorry, and be specific about what you’re sorry for doing. Make sure you use I-language so you keep the blame for your actions on yourself. Additionally, be careful that you don’t minimize the apology by adding excuses. For instance, say, “I’m sorry that I lied about the kiss,” “I’m sorry that I lied to get credit for your work,” or “I’m sorry I took your necklace.” Don’t make excuses like, “I’m sorry that I lied about the kiss, but I just got carried away,” or “I’m sorry I took your necklace, but you never wear it.”"
    },
    {
      "title": "Ask the person to forgive you for lying.",
      "content": "Ask the person to forgive you for lying. After you’ve apologized, tell the person you hope they’ll forgive you. Then, wait for them to decide if they can forgive you or not. If the do forgive you, work on mending your relationship. If they don’t, tell them that you understand and are open to talking in the future. [13] X Research source Be patient with the other person. They may want to think about their decision, so give them as much time as they need. If the person is a family member or partner, they might give you partial forgiveness since it’s hard to walk away from you. In this case, it’s best to keep apologizing until they totally forgive you. Apologize for what happened every time the subject comes up."
    },
    {
      "title": "Accept the blame for your decision to lie.",
      "content": "Accept the blame for your decision to lie. When you lie, it’s normal to want to justify your actions. However, doing so makes it really hard for you to mend the relationship. Admit that you were fully at fault for your decision to lie and resist the temptation to make excuses. [14] X Research source As an example, let’s say that you cheated on the person you’re dating. You might try to justify lying about it by telling yourself it would only hurt them if they knew and it was a one-time thing. However, it’s important to recognize that you aren’t lying to protect them. You’re actually lying to help yourself."
    },
    {
      "title": "Explain what you’ll do differently in the future.",
      "content": "Explain what you’ll do differently in the future. You’re more likely to restore the relationship if you’re willing to make changes. Tell them specifically what you’ll do to make sure you don’t lie in the future. Additionally, discuss how you’ll prove that they can trust you. [15] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. [16] X Research source Say something like, “Next time, I’ll tell you immediately when something like this happens,” or “I’ll give you my passcode so you can check my phone whenever you like.” You might show them you’re trustworthy by promising things like, “I’ll show you my homework assignment as soon as I get home,” “I’ll text you when I arrive to work and when I leave,” or “I won’t borrow any more of your things.”"
    },
    {
      "title": "Offer to make amends for problems your lie caused.",
      "content": "Offer to make amends for problems your lie caused. It’s possible that your lie may have really hurt someone. If this happened, do something to make it up to them. This will help you start healing your relationship. [17] X Research source As an example, let’s say you broke a lamp and someone else got blamed for it. If they paid to replace the lamp, repay them and offer to do them a favor to make up for the trouble they went through. Similarly, you might have copied someone else’s paper, causing you both to receive zeroes. You might explain to the teacher that you were solely to blame and bring the person you wronged a treat to show you’re sorry."
    },
    {
      "title": "Follow through on your promises to earn back their trust.",
      "content": "Follow through on your promises to earn back their trust. Lying can damage trust, so make sure you do everything you say you’ll do moving forward. Show them you’re reliable by keeping your word. This will help you mend your relationship with the person. [18] X Research source As an example, if you say you’ll text them at a certain time, make sure you do it. Similarly, if you promise to meet them somewhere, be on time."
    }
  ]
}