{
  "url": "https://www.wikihow.com/Stop-Being-Rude-to-Your-Parents",
  "title": "How to Stop Being Rude to Your Parents",
  "steps": [
    {
      "title": "Don't lose control.",
      "content": "Don't lose control. Often times we behave rudely because our emotions get the best of us. If you find yourself in a situation with your parents where you keep getting angrier and angrier, finding a way to calm down, collect your thoughts, and keep yourself from losing control is critical. Stop and count backwards from 10 before continuing. Take a few slow, deep breaths. Relax your body. Step outside the room for a few minutes and take a break. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Go get a drink of water. Ask to continue the discussion at another time when you are more together."
    },
    {
      "title": "Speak carefully.",
      "content": "Speak carefully. What you say and how you say it can play an important role in how people perceive your actions. If you know that you have to talk about something that is a touchy subject, try writing out what you say and imagining what their responses might be. You can even act out how the conversation might go in private so as to better prepare yourself in the event something is said that might bother you. It is okay to pause to think or even to tell your parents you need a moment to think. Do not try to be clever and sass back at your parents as this will only create a hostile atmosphere which could turn into a heated argument. Avoid name calling, cursing, sarcasm, and raising your voice above all else. Try to approach the discussion as a mature adult so that you will be treated as such. [2] X Research source Avoid statements that start with \"You,\" like \"You always,\" and \"You never,\" which can sound like accusations and make people defensive. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Instead, try to use sentences that use \"I feel\" to express yourself, like \"I feel like you don't trust me because you won't let me stay out after 10 o'clock.\""
    },
    {
      "title": "Watch your body language.",
      "content": "Watch your body language. Body language refers to all of the non-verbal communication that we make with our bodies and not our mouths. Your body can communicate aggression, anger, and disrespect even when your voice and words don't. Since it makes up about 50% of the message that you send to other people, it's very important to know what not to do in order not to send rude or aggressive messages! [4] X Research source Don't roll your eyes. Don't make vulgar hand gestures. Don't plug your ears or repeat after them mockingly. Don't glare or scowl at them. Don't clench your fists, invade their personal space, or otherwise act aggressively. Don't cross your arms in front of your chest because it tells someone you're defensive or not listening. [5] X Research source Try to keep yourself relaxed."
    },
    {
      "title": "Listen to your parents.",
      "content": "Listen to your parents. Even if you think you already know what they're going to say or you don't agree with what is being said, really stop to listen to what you parents are telling you. Ignoring them or trying to talk over them is only going to make the situation worse. Knowing how to listen to another person is just as if not more important to the communication process as speaking."
    },
    {
      "title": "Know when to stop pushing a subject.",
      "content": "Know when to stop pushing a subject. If your parents indicate that a subject is no longer up for discussion, let it go. Continuing to push them after they have told you to quit is only going to make them irritated, and it will likely not win you any points. Just think how you would feel if someone continued to bother you about something after you asked them to stop."
    },
    {
      "title": "Don't suddenly walk away.",
      "content": "Don't suddenly walk away. While it is okay to need and ask for a break in the conversation and to get some space, you should never leave without saying so first. It is important to ask for permission because if you walk away with no warning, your parents may think you are trying to further disrespect them by turning your back on them and ignoring what they're saying."
    },
    {
      "title": "Do not act aggressively.",
      "content": "Do not act aggressively. Most people know that it's not okay to hit or kick other people, but this also extends to other aggressive acts, like slamming doors or throwing or breaking things. Not only could someone get hurt, you will most likely get into serious trouble. If you find yourself regularly getting so angry that you completely lose control and want to hit, kick, or break things, you may need to talk with your parents about seeking anger counseling."
    },
    {
      "title": "Apologize for misbehavior.",
      "content": "Apologize for misbehavior. In addition to not wallowing in bad feelings, it's important to make amends with your parents if you behave rudely. Even though you may disagree with them, your parents still care about you. When you are rude to them you may hurt their feelings in addition to being disrespectful. An apology usually starts with an expression of regret for a specific action, such as \"I'm sorry for rolling my eyes at you.\" It then acknowledges why the action was a bad thing or the other person's feelings, like \"I know that when I did that, it made you angry, and that was wrong of me.\" Finally, it should express your intention to change. \"I'm working on changing my behaviors. I promise to try not to do that again.\" Apologizing for doing wrong is a mark of maturity. Not only will it help mend any broken ties between you and your parents, it will show them you are trying to be an adult, and likely it will impress them. Although a verbal apology is usually more appropriate considering your close relationship, if you find it easier to do so you can always put it in writing. Make sure that when you say it you actually sound like you mean it. An insincere apology is just as bad if not worse than not receiving one at all."
    },
    {
      "title": "Recognize rude behaviors.",
      "content": "Recognize rude behaviors. Think back to your interactions with your parents, whether they were actually arguments or regular conversations. Did you refuse to listen, roll your eyes, yell, call them names, or curse at them? All of these actions are considered rude, but there are likely others. Ask yourself, \"If someone did that to me, how would I feel?\" If you think you would be offended, chances are what you did was rude. Reader Poll: We asked 431 wikiHow readers which rude behavior they think they need to work on most, and 57% of them said speaking in an inappropriate tone or volume. [Take Poll]"
    },
    {
      "title": "Empathize with your parents.",
      "content": "Empathize with your parents. Being able to understand other people's feelings, including directly opposing viewpoints, is an important skill that takes effort to develop. Ask yourself, \"If I was my mother/father and I was on the receiving end, would I have been angry? Would I have felt hurt? What would I have done if someone treated me that way?\" This will help you understand why they reacted the way they did and help you to be less angry. [6] X Expert Source Mary Church, PhD Research & Clinical Psychologist Expert Interview. 6 August 2021. Try to focus on everything your parents have done for you and how much love they have for you. [7] X Expert Source Mary Church, PhD Research & Clinical Psychologist Expert Interview. 6 August 2021. Remember: being a parent involves a lot of hard work. In fact, parents spend 156,000 unpaid hours raising their kids (from age 0 to 18)—that's equal to 70 years of full-time employment! [8] X Expert Source Mary Church, PhD Research & Clinical Psychologist Expert Interview. 6 August 2021."
    },
    {
      "title": "Put your decision in writing.",
      "content": "Put your decision in writing. Being able to see your decision written out will make it feel more concrete and real. [9] X Research source It also means that you can put the written declaration somewhere you will frequently see it, like on your mirror, your laptop, or in your pocket, to serve as a reminder to you. Make your written statement specific and descriptive. Write about which exact behaviors, such as rolling your eyes or mouthing off, you recognize in yourself that you need to avoid. Don't be afraid to add more things if you realize later there was something you forgot."
    },
    {
      "title": "Figure out why you act this way.",
      "content": "Figure out why you act this way. Everybody does things for a reason whether they know it or not. You can think of this reason as your \"pay-off\" or motivation. Ask yourself, \"What am I getting out of acting this way?\" Your reason could be anything from a feeling of control in your relationship, relief from frustration, retaliation from having your own feelings hurt, or maybe even you're hoping to look cool in front of friends or siblings."
    },
    {
      "title": "Find other ways to satisfy yourself.",
      "content": "Find other ways to satisfy yourself. Once you've identified what you are actually getting out of your rude behavior, you can start thinking of alternative ways you can achieve your goals. Once you no longer need to rely on being rude to satisfy your needs, you will be less likely to depend on it. If you're feeling angry, instead of insulting or swearing at them, yell into a pillow later or make up words or fun phrases you can use in conversations that aren't swears, like \"that hoovers,\" or \"great goofy goblins.\" [10] X Research source If peer pressure is making you act a certain way, ask to have discussions with your parents privately so you can be rational."
    },
    {
      "title": "Reward good behavior.",
      "content": "Reward good behavior. It's important to reward yourself for behaving appropriately. This validates you when you do well so that you do not feel like you are constantly failing. It is also additional incentive to continue to do well in the future. A good reward could be anything from a slice of cake to a nice hot bubble bath to some small thing you've been wanting for a while. Eventually, you should start weaning yourself off of rewards. Remember, the point here is to be good for the sake of being good, not so you can treat yourself to nice things!"
    },
    {
      "title": "Ask your parents for help.",
      "content": "Ask your parents for help. The whole point of changing your ways to be less rude is for your parents' sake, so obviously their opinions and feelings matter. Your parents can help you with this process by providing meaningful positive and negative feedback. [11] X Research source Just explain to them what you're trying to do, and ask them to communicate with you when you do something right and when things go wrong. Ask your parents to praise you and specifically state what you did right at appropriate times, like if you didn't raise your voice in a discussion about not being allowed to go to a concert over the weekend. Encourage your parents to avoid \"You\" statements like \"You're being rude\" and instead use \"I feel\" statements to communicate their feelings when something goes wrong, like \"I feel hurt when you make nasty faces at me like that.\""
    },
    {
      "title": "Don't beat yourself up.",
      "content": "Don't beat yourself up. Everybody makes mistakes, and chances are that even after you make the decision to change, you're going to mess up. Feeling sorry for or excessively angry at yourself is just a waste of time and energy. Endlessly regretting things or hating yourself won't help you to improve. Instead, reflect on what went wrong, what you can do to make sure it won't happen again, and move on."
    }
  ]
}