{
  "url": "https://www.wikihow.com/Stretch-a-Shirt",
  "title": "How to Stretch a Shirt",
  "steps": [
    {
      "title": "Wash your shirt in the washing machine or by hand.",
      "content": "Wash your shirt in the washing machine or by hand. Stretching out your shirt by hand will be much more effective if the fabric is wet. Use cold water when you wash the shirt to avoid causing your item to shrink even more. [1] X Research source If you're hand washing, be sure to squeeze out excess water before stretching the shirt. Don't, however, wring the fabric. Instead, just press on the shirt."
    },
    {
      "title": "Place a clean towel on a flat surface.",
      "content": "Place a clean towel on a flat surface. There should be enough room to lay the shirt out flat on the towel. Spread the shirt out fully, making sure there are no folds or creases in the fabric. Lay the shirt face-up so you can see the collar."
    },
    {
      "title": "Pull on each edge of the shirt.",
      "content": "Pull on each edge of the shirt. For each edge, aim to stretch the fabric by an inch or 2 (5 cm). Start with each sleeve, gently pulling an equal amount on the ends of the left and right sleeves. Next, pull the fabric outwards along the top line and collar of the shirt, as well as the hem. Finish up by pulling on the sides. [2] X Research source"
    },
    {
      "title": "Allow the shirt to air dry on the towel.",
      "content": "Allow the shirt to air dry on the towel. Now that you've tried to stretch your shirt out, let it dry before checking if it worked. It may take several hours for the shirt to completely dry, so be patient. [3] X Research source"
    },
    {
      "title": "Fill a sink or tub with cool water.",
      "content": "Fill a sink or tub with cool water. There should be enough water in your container to completely submerge the shirt you hope to stretch. Make sure the water is room temperature or cooler. You don't want hot water, as this could further shrink the fabric."
    },
    {
      "title": "Pour 1⁄4 cup (59 ml) of hair conditioner in the tub for cotton and rayon.",
      "content": "Pour 1 ⁄ 4 cup (59 ml) of hair conditioner in the tub for cotton and rayon. Any hair conditioner will work! Once you've poured it in, give the water a good stir to mix it in. You can also use baby shampoo in place of the conditioner. Both materials will relax the fibers in your shirt and make them easier to manipulate. [4] X Research source Hair conditioner should also work well for other synthetic materials, like nylon."
    },
    {
      "title": "Add 1 to 2 tablespoons (15 to 30 ml) of vinegar to the water for wool.",
      "content": "Add 1 to 2 tablespoons (15 to 30 ml) of vinegar to the water for wool. Vinegar is a natural fabric softener, so it provides a little extra protection against damage for wool items. Before you mix in the conditioner, add the vinegar as well. This will allow you to mix both ingredients into the water at the same time. [5] X Research source"
    },
    {
      "title": "Soak the shirt for about 30 minutes.",
      "content": "Soak the shirt for about 30 minutes. Lay the shirt flat on the water and push it down to completely submerge it. Try to keep it as flat as possible when you push it down so the materials in the water can evenly affect the fibers."
    },
    {
      "title": "Drain the tub to fill it with fresh water.",
      "content": "Drain the tub to fill it with fresh water. You shouldn't need to remove the shirt while you drain the container. Once you've got fresh water, squeeze the shirt to rinse out the conditioner (or baby shampoo) and/or vinegar. Then soak the fabric for another 5 minutes. Continue draining, rinsing, and soaking until all traces of the softeners are gone."
    },
    {
      "title": "Place the shirt between 2 towels to squeeze out excess water.",
      "content": "Place the shirt between 2 towels to squeeze out excess water. Lay the shirt flat on the bottom towel, then place another towel on top. Roll the bundle up so that the excess water is transferred from your shirt to the 2 towels. Unroll the bundle and move the shirt to a new, dry towel."
    },
    {
      "title": "Pull on the various edges of the shirt.",
      "content": "Pull on the various edges of the shirt. Place your hands on opposite sides of the shirt and pull the same amount on both sides. Stretch the hemline down about 2 inches (5.1 cm), and then do the same to the collar and shoulders of the shirt."
    },
    {
      "title": "Lay the shirt on a fresh towel to air dry.",
      "content": "Lay the shirt on a fresh towel to air dry. Since your third towel is probably wet now also, move the shirt to a fourth one. Allow it to air dry completely before testing to see how well your stretching worked. You may need to wait overnight for the shirt to dry out completely."
    },
    {
      "title": "Wash your shirts in cold water.",
      "content": "Wash your shirts in cold water. The dryer isn't the only culprit in your laundry room! Hot water can shrink items, especially over time. If there are any shirts you're worried about shrinking, err on the side of caution and use the cold-water wash cycle."
    },
    {
      "title": "Dry clean wool, mohair, and cashmere shirts.",
      "content": "Dry clean wool, mohair, and cashmere shirts. Dry cleaning is generally a better option for these materials. Professionals will know how to protect your clothing better than you can at home. [6] X Research source"
    },
    {
      "title": "Follow the instructions on your clothes' tags.",
      "content": "Follow the instructions on your clothes' tags. Those tags are there for a reason! Generally, if you stick to what the tag tells you to do, you can avoid damaging or shrinking your clothes."
    },
    {
      "title": "Air dry clothes you're worried about shrinking.",
      "content": "Air dry clothes you're worried about shrinking. If you're in love with a particular shirt and the way it fits you, take the dryer out of the equation. Even if the tag says it's safe to machine dry, hot air will damage the fibers of your shirt over time."
    },
    {
      "title": "Remove damp items from the dryer as an alternative.",
      "content": "Remove damp items from the dryer as an alternative. If air drying takes too much time for your lifestyle, set your dryer to a low setting (tumble dry, for example). You can then remove your favorite shirts from the dryer once they're just damp. Lay them out to air dry the rest of the way. This should cut down on damage from the dryer while also minimizing your air drying time."
    }
  ]
}