{
  "url": "https://www.wikihow.com/Use-a-Defibrillator",
  "title": "How to Use a Defibrillator",
  "steps": [
    {
      "title": "Confirm cardiac arrest.",
      "content": "Confirm cardiac arrest. If you see a person who appears to have an emergency episode, you need to check to ensure that it is cardiac arrest before you use an AED. Check to see if the victim is unable to respond, if they are breathing, and their pulse. You can use the ABC method. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you find no pulse or breath, you need to start CPR. Airway: You need to make sure the airway is open before you check their breathing. To do this, tilt back their head and lift up their chin. [2] X Research source If you see an object obstructing the airway, remove it. Breathing: Lean in closely to listen for breathing. Look to see if their chest is rising and falling. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Circulation: Feel for a pulse. Signs of circulatory issues include color changes, sweating, and a lower level of consciousness. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Try to wake the person up.",
      "content": "Try to wake the person up. If you come upon a person and you have no idea how long they have been unconscious, you need to make sure they are actually having medical problems and are not just asleep. To try to wake them up, you can shake them, yell into their ear, or try clapping near them. If they show no signs of waking up, confirm cardiac arrest. Never shake a child or infant. This can lead to serious injury. [5] X Research source"
    },
    {
      "title": "Call the police.",
      "content": "Call the police. As soon as you assess that it is an emergency situation, you need to call the authorities. Explain to them where you are and what is going on. Let them know that you have an AED on site and that you plan to use it. If there is someone else there other than you, make them call 911 while you start working on the person in need. They can also run and grab the AED from its location. This way things will get done faster, which is important with SCA. [6] X Research source"
    },
    {
      "title": "Start CPR.",
      "content": "Start CPR. If you are not there alone, you should start giving CPR while the other person is getting the AED. If you are alone, call 911, then start CPR. Give 30 chest compressions and then 2 rescue breaths for every 30 chest compressions. The rescue breaths should be no longer than one second. Avoid overventilation and only provide enough air to see the chest expand. Keep chest compressions to 100 compressions per minute. Do not exceed 125 compressions per minute. You should compress the chest 2 inches (5 cm) downwards and allow it to fully expand upwards with as few interruptions as possible. You should give CPR right away if you don't know how long a person has been unconscious, then you should use the AED. [7] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Make sure the patient is dry.",
      "content": "Make sure the patient is dry. Before you turn on and use an AED, you need to make sure that the person you are helping is not wet. If they are, you need to dry them off. If there is water in the immediate area, you need to move the person to a dry place. Water conducts electricity. If the patient is wet or if there is water nearby, they can be seriously injured. [8] X Research source"
    },
    {
      "title": "Turn on the AED.",
      "content": "Turn on the AED. Once you are sure there is no water, you need to turn on the AED. When it comes on, it will give you instructions of how to handle the situation. It will likely tell you to attach the cables for the pads into the AED machine. You typically hook them up above the blinking light on the top of the machine. It will also instruct you to prepare the person once the pads are plugged in."
    },
    {
      "title": "Prepare the chest area.",
      "content": "Prepare the chest area. To use the AED pads, you must remove certain things from the victim. Open or cut through their shirt. If their chest is very hairy, you will have to shave it. You should also look for signs of implanted devices, such as a pacemaker. If you see any metal jewelry or accessory, remove it. The metal will conduct electricity. Most AEDs come with a razor to shave or scissor to trim the chest of a hairy person. You will be able to see a pacemaker or other implanted device through the chest. You can also look for a medical alert bracelet. If the victim is wearing a bra, you need to take it off if it has underwire in it. It can conduct electricity just like jewelry. [9] X Research source"
    },
    {
      "title": "Apply the pads.",
      "content": "Apply the pads. The electrodes for the AED are typically adhesive pads. The AED will advise you to put the electrodes or pads in place. You need to make sure that they are placed correctly so the victim will get the maximum amount of shock necessary. One pad should be placed below the collarbone on the upper right side of the victim's bare chest. The other should be placed below the peck or breast on the left, at the bottom of their heart, slightly along their side. Make sure there is no fabric or other object between the pads and their skin. Any obstruction will make the AED malfunction. If the pads are not put on properly, the AED may repeat \"check electrodes.\" If you found an implanted device or piercing, the pads should be at least 1 inch from them. [10] X Research source"
    },
    {
      "title": "Let the AED analyze.",
      "content": "Let the AED analyze. Once the pads are properly in place, you need to get everyone clear of the victim. When everyone has moved back, press the analyze button on the AED. It will begin to analyze the heart rhythm of the victim. The AED will then tell you if a shock is needed or if you need to keep doing CPR. If no shock is needed, this means that the victim has regained a pulse or has an unshockable heart rhythm. If there is no shock advised , you need to continue CPR until emergency workers arrive."
    },
    {
      "title": "Shock the victim if necessary.",
      "content": "Shock the victim if necessary. If the AED advises that you need to shock the patient, you need to make sure, once again, that the victim is clear. Once you do, push the shock button on the AED. This will send an electric shock through the electrodes to help restart the heart. The AED will only give one shock at a time. It doesn't last that long, but expect them to move with the force of the shock."
    },
    {
      "title": "Continue CPR.",
      "content": "Continue CPR. Once you have given the victim a shock, you need to continue CPR. You should do it for 2 additional minutes and then let the AED check for a heart rhythm again. Keep this up until emergency services arrive. You should also stop if the victim can breathe on their own or if they regain consciousness. [11] X Trustworthy Source Nature Respected Multidisciplinary Scientific Journal Go to source The AED will likely remind you when 2 minutes has passed and tell you to stop CPR ."
    }
  ]
}