{
  "url": "https://www.wikihow.com/Start-Walking-for-Exercise",
  "title": "How to Start Walking for Exercise",
  "steps": [
    {
      "title": "Find a good place to walk.",
      "content": "Find a good place to walk. Generally, the best locations for walking have a flat terrain, straight path, smooth surface and minimal traffic. The convenient choice would be the neighborhood around your block, but if the road is too steep, curvy or just not what you're looking for, you might want to consider other areas around your location. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Ensure you are wearing appropriate footwear. Walking puts a bit of pressure on your feet, which can cause pain if you aren’t wearing well-fitting walking shoes. Also, be sure you are wearing the correct footwear for the weather. Take your car to a park if it's too far away to walk. Parks are often flat and very peaceful. Some cities have bike boulevards or walking paths that are relatively flat and well-maintained. They also have less traffic from cars. These are good areas to pick for walking as well. If you won't be tempted to stop and browse the stores, shopping malls are also good locations for walking around. They are flat, large, and contain many different paths so you won't become bored. If you live near a large body of water, the shoreline can be a nice, relaxing place to get some fresh air and to work-in an early morning hike. If you are lucky enough to live in the country side, you can walk to your local shop, or the post box and combine a walk with a useful errand such as picking up some milk or posting a letter. If indoor exercise is your thing, use a treadmill set to a slow speed for walking."
    },
    {
      "title": "Make an exercise playlist.",
      "content": "Make an exercise playlist. It may help to have music playing as you take your walk, especially if you are easily bored from low-key activities. Consider listening to music that also gives your mind room to wander and think about other parts of your life. You can also listen to music that is upbeat that you know that will keep up your motivation to walk. Walks are an excellent opportunity to reflect and plan for the future, although take care to avoid stressful topics. Your walk should definitely be a chance to unwind! Load your favorite audio onto your phone or an MP3 player so you can listen wherever you go. A walk can also be a great opportunity to listen to an audiobook or podcast. If you are listening to music or other audio while walking outdoors, take extra care to be aware of your surroundings. Listening to something on headphones or earbuds will make it harder for you to hear approaching traffic."
    },
    {
      "title": "Set reasonable expectations for your progress.",
      "content": "Set reasonable expectations for your progress. If you have been sedentary for a long time, you will want to start out slower and aim for shorter distances. Write these tangible goals down in a notebook or calendar so that you can keep yourself on track and monitor small successes. [3] X Research source For example, you might plan to start by walking 30 minutes a day, three times a week. Note, however, that walking is a fairly mild exercise that does not require vigorous physical exertion for most people. Therefore, with the right preparation and attire, you will likely be physically capable of walking for hours. You won't meet the same fatigue that a more vigorous exercise, such as running or weightlifting, could lead to."
    },
    {
      "title": "Develop a strong mental attitude for \"slow but steady\" exercise.",
      "content": "Develop a strong mental attitude for \"slow but steady\" exercise. This will be easier for some than for others. To borrow from a popular phrase, walking is definitely a marathon, not a sprint, so get your mental endurance ready before you begin this trek. Don't expect to see fast results. Incorporating walking into your daily schedule is about making healthier choices towards a better lifestyle, and it's a change that you should maintain indefinitely. Don't use walking as a get-fit-quick scheme or as a quick, one-shot weight loss tool."
    },
    {
      "title": "Hydrate well before you begin walking.",
      "content": "Hydrate well before you begin walking. Make sure you have consumed at least 8-16 ounces (about .25-.5 liters) of water an hour before you are about to walk. Drink more water if you plan to walk for a longer time. You don't want to become dehydrated while you are exercising, especially under a hot sun. [4] X Research source You may find it convenient to carry a re-usable water bottle with you as you walk, so you can stay hydrated throughout your trek. Some people develop stomach cramps if they drink water right before or while they exercise, so be careful of that. Give your body time to process the water before diving into exercise. Don't drink so much water that you'll need a bathroom while on a long walk. Alternatively, plan a route that has a public bathroom somewhere along the way."
    },
    {
      "title": "Pick an easy first walk.",
      "content": "Pick an easy first walk. Make sure that no matter how far you get from your starting point, you are able to get back there. Walking on an oval track no more than a quarter mile (0.4 km) around should be perfect. If you feel comfortable in extending the walk past what you initially set, go for it! Walking is less physically taxing than most activities, so don't be afraid to exceed your goals."
    },
    {
      "title": "Set a time.",
      "content": "Set a time. When you first start walking, decide how many minutes you will walk. Choose a length of time you know you can make. Do not worry about how short that period is. Just keep moving until you reach it. 2-5 minutes each day is a good start. That time will increase from week to week. Pay no attention to how far you walk. It matters more that you walk for a longer period of time. Faster and farther walks will come with experience."
    },
    {
      "title": "Increase your time.",
      "content": "Increase your time. With each walk, increase your walking time by 30 seconds to one minute until you are able to sustain a 10-minute walk. Again, do not fret if you can't go longer than the day before. Set the goal and keep at it and you will reach it faster than you think. After reaching 10 minutes, your rate of increasing may slow, but continue trying to increase your walking time by five minutes each week."
    },
    {
      "title": "Work on speed and difficulty after you are able to walk for 45 minutes each day.",
      "content": "Work on speed and difficulty after you are able to walk for 45 minutes each day. Try moving off of the oval and onto the city streets. You will encounter hills and declines, and that will increase the difficulty of your walk. Continue to find more difficult terrain to work with, eventually working up to hiking up hills and cliffs for the ultimate challenge."
    },
    {
      "title": "Determine your target and maximum heart rate",
      "content": "Determine your target and maximum heart rate . You can also purchase a heart rate monitor and wear it during your exercise for increased accuracy and precision. If you are under your target heart rate (THR), you need to increase walking speed for it to be beneficial for your health. [5] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Your body won't burn fat unless you reach your THR for a sustained period of time. When it comes to walking, weight loss and aerobic health will come through sustained effort, not through increased speed or distance."
    },
    {
      "title": "Try switching things up with interval training.",
      "content": "Try switching things up with interval training. Walk at an increased rate for one to two minutes, then slow back to your normal rate for two minutes. Every day or two add an interval until you reach your desired total time, including rest periods. As you become more physically fit, reduce your rest periods until they are down to a minute or less. [6] X Research source"
    }
  ]
}