{
  "url": "https://www.wikihow.com/Use-a-Lemon-to-Lighten-Your-Skin",
  "title": "Can You Use a Lemon to Lighten Your Skin? Risks, Benefits and What Works",
  "steps": [
    {
      "title": "Some people believe you can!",
      "content": "Some people believe you can! While there are some natural health sites that recommend using lemon juice for skin lightening, scientists recommend using actual skin products. If you’d like to try using lemon juice, however, you can squeeze the juice from a lemon into a bowl and add equal parts water to it. Dip a cotton ball into the mixture and gently dab lemon juice onto any dark spots on your face. Let the lemon juice sit for 20 minutes, then rinse your face with cool water. [1] X Research source You can do this a few times per week to fade dark spots on your skin. If you’re trying to fade dark marks on your chest or back, pour your mixture into a spray bottle and spritz it all over your dark spots. Let it sit for 20 minutes, then wipe the solution off with a wet washcloth. It’s incredibly important to rinse the lemon juice off your skin before going outside. Leaving lemon juice on your skin when you go out into the sun can lead to blisters and burns."
    },
    {
      "title": "Yes, as long as you make sure not to go out into the sun.",
      "content": "Yes, as long as you make sure not to go out into the sun. Lemon peels often contain chemicals called furanocoumarins and psoralens. While these chemicals are fine on your skin when you’re in the shade, if you go outside into the sun, they can cause redness, irritation, swelling, and huge blisters. Most products that use lemon juice filter these chemicals out, which is why it’s okay to use lotions or fragrances with citrus in them. However, straight lemon juice isn’t filtered, and it can be dangerous to leave on your skin, even if you dilute it with water. If you’re worried about your reaction to lemon juice, try doing a patch test first. Rub a bit of undiluted lemon juice onto the inside of your elbow. If your skin is okay after 24 hours, it’s probably fine to use lemon juice on your face. If your elbow starts stinging or burning, rinse the lemon juice off immediately and don’t put it anywhere else on your body."
    },
    {
      "title": "You can treat oily skin with lemon juice and oatmeal.",
      "content": "You can treat oily skin with lemon juice and oatmeal. If you deal with oily skin, grind 2 tbsp (28 g) of old-fashioned oats into a fine powder. Mix the oat flour with 1 US tbsp (15 mL) of fresh lemon juice and 2 teaspoons (9.9 mL) of honey. Dab it on your skin with clean fingers, then let it sit for 15 minutes. Wipe the mask off with a warm, wet washcloth when you’re done. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "You can treat dry skin with honey, avocado, and oatmeal.",
      "content": "You can treat dry skin with honey, avocado, and oatmeal. If you’d like to hydrate your skin while fading dark marks, mix together 1/4 of a mashed avocado, 1 tsp (4.9 mL) of fresh lemon juice, 1 ⁄ 2 US tbsp (7.4 mL) of olive oil, and 1 US tbsp (15 mL) of honey. Apply the mask to clean skin and leave it on for about 20 minutes, then rinse it off with warm water. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Because citric acid is a natural lightener.",
      "content": "Because citric acid is a natural lightener. There are lots of skin products that use citric acid in them, including ones with lemon juice. However, these products use filtered lemon juice, so they aren’t dangerous to put on your skin, and they won’t cause you to blister in the sun. Unfiltered lemon juice may lighten your skin, but it can also seriously harm you, so it isn’t worth the risk. There is no way to filter or dilute lemon juice at home to make it safe for your skin. [4] X Research source"
    },
    {
      "title": "Yes, because they’re filtered.",
      "content": "Yes, because they’re filtered. Lemon juice in lotions and creams is safe to put on your skin, and they probably won’t cause irritation. Products with citric acid in them can help fade dark marks and discoloration, and they aren’t dangerous like unfiltered lemon juice is. [5] X Research source Most lemon juice products are used to tighten the skin and reduce the appearance of wrinkles."
    },
    {
      "title": "Try a skin lightening product.",
      "content": "Try a skin lightening product. Skin lightening products infiltrate your skin and reduce the melanin that creates dark spots. Look for a product with 2% hydroquinone, azelaic acid, glycolic acid, kojic acid, retinoid, or vitamin C to make sure it’s effective. If you aren’t sure which product to buy, get a recommendation from a licensed dermatologist. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Use sunscreen every day.",
      "content": "Use sunscreen every day. Sunscreen protects your skin from UV rays and stops the dark patches on your skin from getting worse. Make it a part of your routine to put on SPF 30 or higher every day to avoid dark spots and wrinkles. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "It can take anywhere from 6 to 12 months.",
      "content": "It can take anywhere from 6 to 12 months. If you’re using sunscreen and a dermatologist-approved lightening cream, you can expect to see results within a year or so. However, if your dark spots are really dark, it could take a couple of years. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Everyone’s skin is different, and yours might need more or less time to even out. If you have any questions, make an appointment with a dermatologist."
    },
    {
      "title": "Yes, if they contain mercury.",
      "content": "Yes, if they contain mercury. A lot of skin lightening products are unregulated, and some even contain mercury. Mercury can damage your kidneys and your nerves, and you can even spread mercury poisoning to others through skin-to-skin contact. If your product contains calomel, cinnabaris, quicksilver, or Hydrargyri oxydum rubrum, that means it contains mercury, and you should stop using it right away. [9] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source You can avoid unsafe skin lighteners by getting one from a licensed dermatologist. Studies show that about 12% of skin lighteners sold in beauty stores in the United States contain mercury."
    }
  ]
}