{
  "url": "https://www.wikihow.com/Use-Wallet-on-an-iPhone",
  "title": "How to Use Wallet on an iPhone: Pay for Purchases, Add Cards, & More",
  "steps": [
    {
      "title": "Open the Wallet app.",
      "content": "Open the Wallet app. It's a gray wallet icon with red, yellow, green, and blue cards in it. You'll find it on your home screen or inside a folder."
    },
    {
      "title": "Tap ＋.",
      "content": "Tap ＋ . It's in the top-right corner of the screen."
    },
    {
      "title": "Tap Debit or Credit Card to add a new card.",
      "content": "Tap Debit or Credit Card to add a new card. Alternatively, if you've added a card to Apple Wallet in the past and want to re-add it, you can select Previous Cards instead. [1] X Research source"
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . This option is at the bottom of the screen."
    },
    {
      "title": "Enter or scan your card number.",
      "content": "Enter or scan your card number. There are a few different ways to add your debit or credit card number to your Apple Wallet using your iPhone: If your card has a chip, hold your iPhone near the card to add your name and card number to Apple Wallet automatically. If that doesn't work, tap Enter Card Details Manually at the bottom. From there, you can enter the card details manually, or tap Scan Card with Camera to scan your card."
    },
    {
      "title": "Tap Next.",
      "content": "Tap Next . You'll be prompted to enter additional information, such as your card's 3-digit CVV code and expiration date. If you used the chip or your camera to scan your card, the expiration date will fill in automatically."
    },
    {
      "title": "Enter the CVV and expiration date.",
      "content": "Enter the CVV and expiration date. Tap the Security Code text box, then type in the three-digit CVV code found on the back of your card. If the expiration date was not filled automatically, enter that as well."
    },
    {
      "title": "Tap Next.",
      "content": "Tap Next . You'll find this in the top-right corner of the screen. Apple Wallet will now contact the card issuer to confirm your information. For many cards, that's all you'll need to do! Now that you've added a card, you can use Wallet on your iPhone to pay at the register at participating stores. Otherwise, you will If you're having trouble adding your card, jump to our troubleshooting tips ."
    },
    {
      "title": "Follow the on-screen instructions to confirm (if needed).",
      "content": "Follow the on-screen instructions to confirm (if needed). Depending on your card and issuer, you may be prompted to complete additional steps to add your card to the Wallet app. Some banks will require you to verify your card by sending a code to your phone via a text message. If prompted to verify your card, do the following: Check the \"Text Message\" option. Tap Next . Retrieve the verification code from the text message. Enter the code into the Wallet app. Tap Done ."
    },
    {
      "title": "Manage your card through the Settings app.",
      "content": "Manage your card through the Settings app. If you ever need to change anything about your card, such as your billing address, open the Settings app, tap Wallet & Apple Pay , and then select the card."
    },
    {
      "title": "Look for the Apple Pay symbol at the register.",
      "content": "Look for the Apple Pay symbol at the register. If the vendor supports Apple Pay, you'll usually see a sticker with the word \"Pay\" and an Apple logo, or an icon of a hand holding a credit card up to a set of radio waves. You can also use the Maps app on your iPhone to search for nearby stores that accept Apple Pay. [2] X Research source In mainland China, you can also use Apple Pay at stores displaying the UnionPay logo. In Japan, Apple Pay is accepted everywhere you see any of the EMV contactless symbols. If the card reader doesn't support Apple Pay, you can't use the Wallet app to pay with your iPhone."
    },
    {
      "title": "Use your phone's Apple Wallet shortcut to authenticate.",
      "content": "Use your phone's Apple Wallet shortcut to authenticate. The steps are different depending on your model: [3] X Research source iPhone with Face ID: Double-click the side button, and then look at your phone to authenticate (or enter your passcode). iPhone with Touch ID: Double-click the Home button."
    },
    {
      "title": "Hold your iPhone a few centimeters from the contactless reader.",
      "content": "Hold your iPhone a few centimeters from the contactless reader. Your default payment method will appear on the screen. After a few seconds, the amount of your transaction will be deducted from that account. You should see the word \"Done\" and a green checkmark on the screen. If you don't want to use your default payment method, tap your default card when it appears, and then select a different card. [4] X Research source Having trouble paying in stores? Check out our troubleshooting tips ."
    },
    {
      "title": "Open the Wallet app on your iPhone.",
      "content": "Open the Wallet app on your iPhone. If you want to change the card Apple Wallet uses as your default card, you can do so from the Wallet app. When you open the Wallet app, your default card is the one in front of the others. [5] X Research source"
    },
    {
      "title": "Tap and hold the card you want to set as your default.",
      "content": "Tap and hold the card you want to set as your default. This selects the card."
    },
    {
      "title": "Drag the card to the front.",
      "content": "Drag the card to the front. This replaces the previous default payment method."
    },
    {
      "title": "Open the app for the card you want to add.",
      "content": "Open the app for the card you want to add. While you can't add a gift card within the Wallet app, you can usually link the card's associated app with Wallet so it appears as a card. For example, if you want to add a Starbucks gift card , you'll need to open the Starbucks app. Make sure your card is already set up with that app before you continue. The steps to add cards vary by card type."
    },
    {
      "title": "Locate the Payment or Add Card section of the app.",
      "content": "Locate the Payment or Add Card section of the app. In some apps, you'll see an \"Add to Apple Wallet\" button that instantly opens Apple Wallet and prompts you to confirm. [6] X Research source Depending on the type of card you're adding, you may have to choose a payment method first. If you don't see this option, your gift card probably can't be added to the Wallet app; alternatively, the card may automatically be added to your iPhone's Wallet."
    },
    {
      "title": "Select the card or account and tap Add to Apple Wallet.",
      "content": "Select the card or account and tap Add to Apple Wallet . This opens the Wallet app."
    },
    {
      "title": "Tap Add to confirm.",
      "content": "Tap Add to confirm. It's at the top-right corner of the screen. The card is now ready to use. You can configure this card to be used automatically in stores. Just tap the card in the Wallet app, tap the three dots in a circle, and then toggle on Automatic Selection ."
    },
    {
      "title": "Use the card.",
      "content": "Use the card. Now that you've added the store card or gift card to Apple Wallet on your iPhone, you can open the Wallet app in a store, tap the card, and follow the on-screen instructions to use it. If the card has a barcode or QR code, show it to the cashier or attendant so they can scan it. For some cards, you may be able to use the added card at a contactless reader–just hold your iPhone near the reader until you see \"Done\" or a checkmark on the screen. [7] X Research source"
    },
    {
      "title": "Open the app or message containing your pass.",
      "content": "Open the app or message containing your pass. You can also use Wallet on your iPhone to store and use a variety of passes, including many concert tickets, movie tickets, membership cards, and boarding passes. If the type of pass you want to add supports the Apple Wallet app, you'll usually see the option to add the pass in the email or on the ticket itself. [8] X Research source"
    },
    {
      "title": "Tap Add to Apple Wallet.",
      "content": "Tap Add to Apple Wallet . This button usually has a colorful wallet icon on it. When you tap it, the Wallet app on your iPhone will open. If additional steps are needed, follow the on-screen instructions to finish adding the ticket or pass to your wallet."
    },
    {
      "title": "Use the pass.",
      "content": "Use the pass. Now that you've added a pass, you may receive a notification once you reach the destination where it can be used. If you do, tap the notification, use Face ID or Touch ID when prompted, and show the pass to the attendant. If this doesn't happen, open the Wallet app when you get to the gate, store, or other location, tap the pass, and show the attendant your barcode or QR code to scan. [9] X Research source"
    },
    {
      "title": "Open your iPhone's Settings .",
      "content": "Open your iPhone's Settings . If you want to make changes to the Wallet app on your iPhone, including updating card addresses and preferences, you can do so in your Settings."
    },
    {
      "title": "Tap Wallet & Apple Pay.",
      "content": "Tap Wallet & Apple Pay . This opens your Apple Pay and Wallet settings."
    },
    {
      "title": "Update your billing address.",
      "content": "Update your billing address. If you've changed your billing address, tap a payment card, then tap the current billing address to make your changes."
    },
    {
      "title": "Enable or disable Express Transit.",
      "content": "Enable or disable Express Transit. If your public transit system supports Apple Pay, you can use Express Transit to instantly scan your card at the card reader without having to unlock your iPhone first. Tap Express Transit , then select the card you want to use. Alternatively, you can tap None to disable Express Transit ."
    },
    {
      "title": "Enable or disable \"Double-Click Side Button.\"",
      "content": "Enable or disable \"Double-Click Side Button.\" By default, you can double-click the side button (on the right) and scan your face with Face ID to pay in stores with the Wallet app. If you don't want to use this feature, you can toggle off the switch to disable it. You'll still be able to use Wallet to pay in stores, but you'll need to open the app first."
    },
    {
      "title": "Set your default payment options.",
      "content": "Set your default payment options. Under the \"Transaction Defaults\" heading, you'll find options to update other details, including: Your default card Your shipping address (for when you use Apple Pay online) Your email address Your phone number"
    },
    {
      "title": "Enable or disable Apple Cash.",
      "content": "Enable or disable Apple Cash. If you want to use the Wallet app on your iPhone to send and receive money through Apple Pay, you'll need to enable the Apple Cash option. Once you enable this feature, you can use your default payment method to send money to friends and family through Messages, or right from Apple Wallet. Check out our guide to sending money through Apple Pay to learn more."
    },
    {
      "title": "Remove a card.",
      "content": "Remove a card. If there's a card in your wallet you want to remove, tap the card under \"Payment Cards,\" scroll down, and tap Remove Card to remove it."
    },
    {
      "title": "Add a compatible credit or debit card to your Wallet.",
      "content": "Add a compatible credit or debit card to your Wallet. If your local transit system supports the Apple Wallet's Express Transit mode, you can use the Wallet app to pay for public transit rides. To add your transit card: Open the Wallet app and tap + . Tap Transit Card . Search for and select your transit card. Some cards, including Hop FastPass, Ventra, and Ruubypay, must be added through their respective apps. [10] X Research source Tap Continue . Follow the on-screen instructions. [11] X Research source"
    },
    {
      "title": "Set up Express Mode.",
      "content": "Set up Express Mode. Express Mode makes it easy to use Wallet on your iPhone to pay for public transit without unlocking your screen. In some situations, Express Mode will be activated by default. If it's not, it's easy to activate this feature: [12] X Research source Open the Wallet app. Tap the three dots on your transit card. Tap Card details . Tap either Express Transit Settings or Express Mode . Select your transit card again to activate Express Mode."
    },
    {
      "title": "Hold your iPhone a few centimeters from the contactless reader to pay.",
      "content": "Hold your iPhone a few centimeters from the contactless reader to pay. There's no need to unlock your phone in Express Transit mode—just hold the phone near the reader to charge your default Express Transit card and be on your way."
    },
    {
      "title": "You can't add your card to Apple Pay.",
      "content": "You can't add your card to Apple Pay. If you can't add your debit or credit card to the iPhone Wallet app, it may be because you have Face ID, Touch ID, or your passcode disabled, or you may have disabled two-factor authentication on your Apple Account. It's also possible that your card does not support Apple Pay. If you get any of the following error messages when trying to add your card to Wallet, your card likely doesn't support Apple Pay, or there's a problem with the card. You'll need to contact your bank or issuer for help: [13] X Research source Could Not Add Card Invalid Card Card Device Limit In this case, you should also double-check to make sure you haven't already added this card to your Wallet, or to your Wallet on another device."
    },
    {
      "title": "Double-clicking the side button doesn't activate Apple Pay.",
      "content": "Double-clicking the side button doesn't activate Apple Pay. If, when paying in person with your iPhone, double-clicking the side button doesn't open the Wallet app and prompt you to authenticate with Face ID, there's an easy fix: Open your iPhone's Settings app. Tap Wallet & Apple Pay . Toggle on the \"Double-Click Side Button\" switch. [14] X Research source"
    },
    {
      "title": "You see \"Hold near reader\" when trying to pay.",
      "content": "You see \"Hold near reader\" when trying to pay. If you can't actually pay at the register with Apple Pay because \"Hold near reader\" doesn't go away, you likely need to check for and install the latest iOS updates. If that doesn't fix the problem, there could be a problem with your iPhone's NFC chip or another hardware issue. To fix these issues, you'll need to contact Apple ."
    }
  ]
}