{
  "url": "https://www.wikihow.com/Soundproof-a-Door",
  "title": "How to Soundproof Any Interior or Exterior Door",
  "steps": [
    {
      "title": "Check for any gaps around the door with a flashlight.",
      "content": "Check for any gaps around the door with a flashlight. Turn off all of the lights in both rooms surrounding the door. Ask a friend to stand on the other side of the door as you close it and shine a flashlight around the edges of the door and over its surface, or simply leave a light on in the next room. Make note of where you notice lots of light coming through, as this is also where the sound can travel. [1] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Don’t expect that you’ll be able to block out all of the light or fill every gap on the door. Instead, target the most obvious spots and see how that improves the soundproofing. This flashlight method is primarily used to detect air leaks in a home, but it’s also effective at spotting places where sound can leak through, as well."
    },
    {
      "title": "Caulk up any gaps.",
      "content": "Caulk up any gaps. Load a caulking gun with a fresh cartridge of caulk . Then, go around the doorframe looking for any small cracks or holes in the jamb. When you see one, place the tip of the caulk tube against it and squeeze out a bead into it, then wipe off any excess with a putty knife. The caulk will help to absorb the sound and keep it from passing through the door. [2] X Research source Use clear silicone, instead of caulk, around any glass on your door. This will help reduce noise and prevent cold air from coming in. Also, consider supplementing the caulk by injecting small beads of acoustic expanding foam into any larger cracks, then sanding down the excess. Great for: both interior and exterior doors."
    },
    {
      "title": "Install a door sweep at the base of the door.",
      "content": "Install a door sweep at the base of the door. Install a new door sweep by using sturdy scissors to cut it to the same width as your door, then screw it into the door itself so that the sweep just grazes the floor. [3] X Research source Check to see that the sweep is positioned correctly—it should just lightly brush against the floor as the door opens and shuts. Or, use a padded door sweep , which requires no installation—just slide it under the door. Another option is an automatic door bottom , which drops down as the door closes and lifts up as it opens. It uses a spring for these movements, so many people hire a professional for installation. Great for: interior and exterior doors."
    },
    {
      "title": "Install or replace the weather stripping around the door.",
      "content": "Install or replace the weather stripping around the door. To add or replace weather stripping , professional handyman Ryaan Tuttle says to use a sharp putty knife or screwdriver to remove any old stripping. Then, cut your new weather stripping to the dimensions of the door frame and use screws, or the included adhesive, to press the stripping into the frame where the door meets the jamb. [4] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 30 July 2021. Weather stripping comes in many materials and forms, so consult the instructions on the packaging for ideal installation instructions. Adhesive-backed foam, rubber, or felt stripping is the easiest to install, and often the cheapest, while metal stripping is more durable. [5] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Test the stripping’s fit after installation, and make sure the door shuts smoothly and completely. Great for: interior doors and especially exterior doors where the weatherstripping is most needed."
    },
    {
      "title": "Place a rug in the entryway to absorb some noise.",
      "content": "Place a rug in the entryway to absorb some noise. If the door opens onto a tile or wood floor, then the sound is likely bouncing off this space and traveling into the room. Limit this by putting a rug down over the entryway area. The fabric will help to dampen and absorb the sound coming from under the door. [6] X Research source Great for: interior and exterior doors."
    },
    {
      "title": "Place acoustic drapes over the door.",
      "content": "Place acoustic drapes over the door. Install a short curtain rod directly over the back of your door. Get a heavy fabric, acoustic drape and hang it from the rod. When you are inside the room, simply slide the drape into place for less sound from outside. [7] X Research source This is an especially good option for renters, who may be unable to seriously alter the surface of the door or its hardware. Great for: interior and exterior doors, with the bonus of helping to insulate exterior doors."
    },
    {
      "title": "Adhere mass-loaded vinyl to the door.",
      "content": "Adhere mass-loaded vinyl to the door. Remove the door from its hinges by first taking out the pins . Then, measure the length and width of the door, and use a utility knife to cut a length of mass-loaded vinyl to those dimensions. Lay the door flat, and run a thin ribbon of construction adhesive all along the edges, and at 4-5 points near the center. Lay the vinyl atop the door, and press it into the adhesive. Wait 4-5 hours for the adhesive to dry, then rehang the door on its hinges. MLV is excellent at sound reduction, but it comes at a price. You’ll likely spend at least $2 per square foot on low-quality MLV. The cost increases for thicker, more effective barriers. Great for: exterior or solid-core doors, as hollow interior doors may be too light to hold heavy materials."
    },
    {
      "title": "Coat the door with sound-absorbing paint.",
      "content": "Coat the door with sound-absorbing paint. Pick up some specialty sound absorbing paint online or at your local hardware store. Choose one that closely matches the color of your existing doors. [8] X Research source Remove the door and bring it outside. Then, with a wide brush, apply 1-2 coats of paint all over the door, letting it dry for 24 hours between coats. Many sound-absorbing paint products require their own application methods, so consult their packaging for more specific instructions before you begin. Some brands claim that acoustic paint can reduce external noise by almost 30%. Great for: interior and exterior doors."
    },
    {
      "title": "Cover the door with acoustic foam tiles.",
      "content": "Cover the door with acoustic foam tiles. Purchase acoustic panels at your local hardware or music supply store. Depending on the tiles and their installation instructions, attach them to your door using screws, staples, or glue. Many tiles can also be hung with a single nail. [9] X Research source Make sure they’re secure or they might fall off with the movement of the door. Acoustic tiles come in different noise-reduction levels, so choose the highest one for the most sound protection. If you live in a rental property, use adhesive velcro pads on the back of the foam tiles and on the wall. Similarly, you might choose to attach additional wood panels, or even drywall, to the door itself, though this is unwieldy, and not very aesthetically pleasing. Great for: interior doors, as foam panels are designed to absorb interior noises."
    },
    {
      "title": "Hang only solid-core doors for the best soundproofing.",
      "content": "Hang only solid-core doors for the best soundproofing. Architecture and construction specialist Andrew Peters says that the best thing for soundproofing is increased mass. [10] X Expert Source Andrew Peters Architecture & Construction Specialist Expert Interview. 1 December 2020. Most interior doors are made of light wood or particleboard, and are usually partially or entirely hollow on the inside, meaning they transmit sound very easily. If you’re interested in soundproofing, it’s worth it to invest in solid-core or solid wood doors. [11] X Research source Great for: exterior doors, where solid-core doors are most common and practical."
    },
    {
      "title": "Replace glass doors and windows with triple-panes.",
      "content": "Replace glass doors and windows with triple-panes. Glass is notorious for transmitting noises from one space into another. If your door has large glass inserts, they are likely not rated for sound protection. To minimize the noise, contact a glass professional and have them replaced with thick, triple-pane glass. Be aware that triple-pane glass may not provide the same level of visibility outside. Ask your installer about how the glass will look within your door before agreeing to anything. Great for: exterior doors, where glass panes are most common."
    },
    {
      "title": "Too much outside noise can negatively impact your health and productivity.",
      "content": "Too much outside noise can negatively impact your health and productivity. Continuous exposure to loud noises can take a toll on your mental and physical health, including your hearing. Noisy environments can lead to undue stress, high blood pressure, depression, and even heart diseases, so it’s vital to have a safe and quiet place to take some refuge from the loud and bustling noises outside. [12] X Research source"
    },
    {
      "title": "Soundproofing your doors is a courtesy to your neighbors.",
      "content": "Soundproofing your doors is a courtesy to your neighbors. Of course, you’re not the only one at risk of stress and high blood pressure from loud noises. [13] X Research source If you have a noisy household, then your neighbors may be suffering, as well. Soundproofing your doors is a great and courteous way to be a good neighbor (and avoid noise complaints). This is especially true if you practice instruments, or work a job that requires loud noises, like sound engineering."
    },
    {
      "title": "A soundproofed room is also an insulated room.",
      "content": "A soundproofed room is also an insulated room. Many soundproofing techniques also seal off unseen airways in your home that bleed temperature and let outside contaminants in. This is especially true if you live in an urban area. [14] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source With a soundproofed home, you can more easily regulate the interior temperature, and keep the air clean and free of pollutants."
    }
  ]
}