{
  "url": "https://www.wikihow.com/Uninstall-Google-Pay",
  "title": "How to Uninstall Google Pay (2020)",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. You'll find this gear icon in the Quick Settings menu when you swipe down from the top of your screen or the app icon that looks like a gear on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Tap Apps & notifications.",
      "content": "Tap Apps & notifications . Depending on your phone's manufacturer, you might see something different but similar, like \"Apps\" instead."
    },
    {
      "title": "Tap Google Pay.",
      "content": "Tap Google Pay . It's in the \"G\" section of the alphabetical list of apps next to Google Pay's app icon."
    },
    {
      "title": "Tap Uninstall or Disable.",
      "content": "Tap Uninstall or Disable . If you can't uninstall the app completely, you'll have to instead disable it, but you'll find either option centered at the bottom of your screen. [1] X Research source"
    },
    {
      "title": "Go to https://myaccount.google.com/.",
      "content": "Go to https://myaccount.google.com/ . You may be prompted to login to your Google account if you aren't already. You'll need to do this in a web browser on either your laptop or desktop computer or your mobile device."
    },
    {
      "title": "Click Manage your data & personalization.",
      "content": "Click Manage your data & personalization . It's usually the first tile titled \"Privacy & personalization\" next to a profile icon and paint brush."
    },
    {
      "title": "Click Delete a service or your account.",
      "content": "Click Delete a service or your account . It's under the \"Download, delete, or make a plan for your data\" header near the middle of the page."
    },
    {
      "title": "Click Delete a service.",
      "content": "Click Delete a service . This is usually the first tile in the menu next to an icon of a trash can. You might be prompted to enter your password again to continue."
    },
    {
      "title": "Click next to \"Google Pay.",
      "content": "Click next to \"Google Pay. \" You'll see this trash can icon to the right of \"Google Pay.\" Read the pop-up and check the appropriate boxes before clicking Delete Google Pay in the bottom right corner. Deleting your Google Pay account also will delete all your card information, including loyalty cards and linked payment accounts. [2] X Research source"
    }
  ]
}