{
  "url": "https://www.wikihow.com/Use-Hair-Straighteners-on-Short-Hair",
  "title": "How to Use Hair Straighteners on Short Hair",
  "steps": [
    {
      "title": "Separate your hair into sections with clips or pins.",
      "content": "Separate your hair into sections with clips or pins. Starting at the top of your head, pull your hair up so there's just about a 1 in (2.5 cm) thick section left down at the back of the neck. Use hair clips or bobby pins to secure the rest of your hair out of the way. If your hair is very short, you might need to twist small sections before you pin them. [1] X Research source There's no right or wrong number of sections—you just need to be able to focus on one area at a time. If your hair is a little longer, you might only need to use 2 or 3 clips, but if it's really short or you have a lot of layers, you might need a lot of pins to hold it up. When you have short hair, it's hard to get every single piece. By clipping the hair out of the way, it will be easier to straighten hard-to-reach spots that might normally be hidden under the rest of your hair. [2] X Research source Working in small sections will also make it easier to straighten your hair without burning yourself."
    },
    {
      "title": "Spritz the first section with a little hairspray.",
      "content": "Spritz the first section with a little hairspray. Hold your favorite hairspray at about arm's length and spray just a little onto the section you left down. Don't saturate your hair with the hairspray—just a light misting is enough. [3] X Research source It's best to spray each section before you straighten it. If you spray your hair all at once, the hairspray will dry, and it won't be as effective. By holding the hairspray at arm's length, you'll get more even coverage and you won't have too much in any one spot. [4] X Research source"
    },
    {
      "title": "Comb the first section to remove any tangles.",
      "content": "Comb the first section to remove any tangles. Use a small, fine-toothed comb and detangle the section near the back of your head from root to tips. If you have any snags or tangles, your hair won't straighten properly. [5] X Research source In addition, running the straightener over a tangle can knot your hair worse and could even break your hair."
    },
    {
      "title": "Hold the ends of a 1–1.5 in (2.5–3.8 cm) piece of hair.",
      "content": "Hold the ends of a 1–1.5 in (2.5–3.8 cm) piece of hair. Hold your straightener in one hand, then use the other hand to grab a small piece of hair from the section you left down. Run your fingers down to the end of your hair, then hold it straight out so there's tension along the whole length. [6] X Research source The added tension will make it easier to clamp the straightener onto the roots of your short hair, and you'll be able to get your hair straighter on a single pass. However, if your hair isn't long enough to hold and straighten at the same time, skip this—you don't want to risk burning your fingers!"
    },
    {
      "title": "Hold the straightener horizontally and place it close to your roots.",
      "content": "Hold the straightener horizontally and place it close to your roots. Place the top edge of the plates close to your roots. Clamp down, being careful to avoid your fingers at the ends of the hair. [7] X Research source The smaller your straightener, the easier it will be to get close to your roots. [8] X Expert Source Steven Waldman Professional Hair Stylist Expert Interview. 27 July 2021."
    },
    {
      "title": "Follow the curve of your head with the straightener for a sleek look.",
      "content": "Follow the curve of your head with the straightener for a sleek look. After you close the straightener near your roots, let go of your hair and glide the straightener all the way down to the ends. As you do that, turn the straightener so it stays parallel to your head all the way down to the ends. That will help your hair look more naturally straight, rather than the stick-straight look you sometimes get with a straightener. [9] X Research source If you want your hair to be flipped up at the ends, turn your wrist outward just as you get to the bottom. If you want it flipped under, turn your wrist inward at the ends. Just do this in one smooth motion so you don't get a kink in your hair. This is a great way to help tame a cowlick—similar to how you might brush it down while you're blowdrying it. [10] X Research source Just concentrate on the roots and keep in mind that you may need to turn up the heat on your straightener or go over the section a couple of times."
    },
    {
      "title": "Pull the straightener away from your head to add more volume.",
      "content": "Pull the straightener away from your head to add more volume. If you want a style with lots of volume, hold your hair out as you straighten it, rather than keeping the straightener close to your head. When you're doing the back and sides of your hair, hold the hair so it's parallel to the floor, then lift the hair straight up toward the ceiling when you're straightening at the top of your head. When you're finished, use the straightener to smooth down any pieces that seem out of place. [11] X Research source To add volume at just the roots, start by holding the section away from your head. As you slide the straightener down the hair, rotate your wrist so the straightener follows the curve of your head."
    },
    {
      "title": "Keep misting and straightening small sections until you're finished.",
      "content": "Keep misting and straightening small sections until you're finished. Continue straightening 1–1.5 in (2.5–3.8 cm) pieces of hair from the bottom section that you left down. Then, unpin the section of hair just above the one you just straightened—again, it should be about 1 in (2.5 cm) thick. Mist that with hairspray just like you did the first section, then straighten small pieces. [12] X Research source Continue doing this as you work your way all the way up to the top of your hair. If you'd like, spray your hair with a finishing spray to give it an extra sleek look."
    },
    {
      "title": "Spray your roots with dry shampoo if your hair doesn't normally hold a curl.",
      "content": "Spray your roots with dry shampoo if your hair doesn't normally hold a curl. If your hair is fine, you might notice that your curls tend to fall out quickly. A quick spray of dry shampoo will add texture to your hair that will help hold the curls in place longer. [13] X Research source This will also help your curls last longer since it will absorb oils that could make your hair look limp. You can also use this to add hold to freshly-washed hair."
    },
    {
      "title": "Section out your hair with pins or clips.",
      "content": "Section out your hair with pins or clips. Since you'll be working from the bottom up, use a clip to hold up your hair so you can reach the bottom. If you have any smaller pieces that you can't fit into the clip, use bobby pins to hold them out of the way. The bottom section should be about 1–1.5 in (2.5–3.8 cm) wide, but since this is a messier style, it doesn't have to be perfect. [14] X Research source If the bottom section of your hair is too short to curl, start with the first section that's at least 2–3 in (5.1–7.6 cm) long."
    },
    {
      "title": "Mist the bottom section with hairspray, then comb it through.",
      "content": "Mist the bottom section with hairspray, then comb it through. Hold the hairspray an arm's length away from your head and lightly coat the whole section. Don't saturate it, though—that will make the hair clumpy. Then, comb your hair with a fine-toothed comb to make sure it's tangle-free. [15] X Research source By holding the can or bottle farther away, you'll get a more even coating of hairspray."
    },
    {
      "title": "Grab a 1–1.5 in (2.5–3.8 cm) piece of hair and hold the ends.",
      "content": "Grab a 1–1.5 in (2.5–3.8 cm) piece of hair and hold the ends. Take a piece of hair that's about the width of the straightener and hold it out from your head. Grip the hair firmly at the ends to hold it taut. [16] X Research source This will make it easier to clamp the straightener onto your hair. You can do bigger curls if you want, but for short hair, it's best to stick to smaller sections."
    },
    {
      "title": "Clamp the straightener vertically just below the roots.",
      "content": "Clamp the straightener vertically just below the roots. Hold the straightener straight up and down as you place it on your hair. Don't start the curl right at the roots—this will create more of an old-fashioned, formal curl. Instead, start about 0.5–1 in (1.3–2.5 cm) down from the roots for more of a messy, modern look. [17] X Research source This is especially important on the top layer of hair, where the extra volume will be more obvious. If you hold the straightener horizontally, your hair will just look like it's flipped up or under at the ends."
    },
    {
      "title": "Twist the straightener, then slide it down your hair.",
      "content": "Twist the straightener, then slide it down your hair. As soon as you close the straightener on your hair, twist your wrist as far as you can—it doesn't really matter which direction right now. Then, slowly pull the straightener downward all the way to the ends. [18] X Research source If you want even more relaxed curls, tug firmly on the end of the hair once you release it from the straightener. You can also go back over the ends with the straightener for more of a beachy look."
    },
    {
      "title": "Continue curling your hair, alternating directions.",
      "content": "Continue curling your hair, alternating directions. Take the next piece of hair and curl it the same way, but this time, twist your wrist in the opposite direction. Do the same thing all the way along that section, changing directions each time. Then, unpin the next section, spray it with hairspray, and do the same thing again. However, when you get to the very front pieces, curl them away from your face for the most flattering look. [19] X Research source Alternating the direction of the curls will give the look a more lived-in, natural look. Curling your hair all in the same direction will make it look more \"done.\""
    },
    {
      "title": "Let the curls cool so they'll set.",
      "content": "Let the curls cool so they'll set. Once you get finished curling all of your hair, wait about 5-10 minutes. Once they're cool, you can finish styling them—but check the temp with your fingers first. [20] X Research source If you style the curls while they're still warm, they'll be more likely to fall flat."
    },
    {
      "title": "Work a pea-sized amount of pomade through your hair.",
      "content": "Work a pea-sized amount of pomade through your hair. Take a tiny bit of the styling product and rub it between the tips of your fingers. Then, scrunch it into your hair, being careful not to separate the curls too much. [21] X Research source This will add texture to your curls, and it will also help give them a little more hold. If you're happy with the look of your curls, you don't have to do anything else! If you want a messier look, tousle your hair a little with your fingers as you apply the pomade. [22] X Research source For even more volume, spray your hair with a little more hairspray, then scrunch. [23] X Research source"
    }
  ]
}