{
  "url": "https://www.wikihow.com/Store-Vitamins-and-Supplements",
  "title": "How to Store Vitamins and Supplements",
  "steps": [
    {
      "title": "Avoid the bathroom cabinet.",
      "content": "Avoid the bathroom cabinet. People often store vitamin and supplement tablets in their bathroom cabinets. Research has shown, however, that the humidity of bathrooms can lessen the effectiveness and potency of vitamin tablets over time. The degradation of vitamins in humid conditions is known as deliquescence. [1] X Research source This decreases the quality and shelf-life of the product, and could mean you're not getting all the nutrition you paid for. In addition, opening and closing vitamin and supplement bottles in a humid area traps a little bit of moisture into the bottle each time. Some vitamins might be especially prone to degrade in humid conditions, such as the water soluble vitamin B, vitamin C, thiamine, and vitamin B6."
    },
    {
      "title": "Don’t keep tablets in the fridge.",
      "content": "Don’t keep tablets in the fridge. Vitamins and minerals may degrade in quality if you store them in the fridge. There is a lot of moisture inside your fridge, so although it is cool and dark, it is not dry. Only store vitamins and supplements in the fridge if the label specifically tells you to. [2] X Research source"
    },
    {
      "title": "Don’t keep them near the oven or the sink.",
      "content": "Don’t keep them near the oven or the sink. The kitchen can be a good place to keep your vitamins and supplements, but there can often be moisture and vaporized fat in the air from cooking, which can settle on your pills. The temperature and humidity in the kitchen rises and falls as you use the oven and stovetop. The kitchen sink is another area that will produce a lot of moisture. Look for a dry cupboard away from the stove and sink if you want to keep them in the kitchen."
    },
    {
      "title": "Consider keeping vitamins and supplements in the bedroom.",
      "content": "Consider keeping vitamins and supplements in the bedroom. Your bedroom is perhaps the best place to store supplements, because there are few fluctuations in humidity, and the bedroom is usually cool and dry. [3] X Research source Make sure to keep them away from open windows and sunlight, which will degrade their potency. Don’t keep them near a radiator or any other source of heat. Always keep them safe and secure, and out of reach of children and pets, even if they are in a childproof container."
    },
    {
      "title": "Use an airtight container.",
      "content": "Use an airtight container. To help avoid moisture, you can keep your vitamins and supplements in an airtight container. Do not take them out of their original packaging, but put the whole package in the airtight container. An opaque container is good, but you can also use an amber or tinted one. These darker containers can also protect the supplements from light."
    },
    {
      "title": "Read the label first.",
      "content": "Read the label first. In some instances you should store vitamins or supplements in the fridge, but only if the label instructs you to do so. Although most vitamins and supplements should be stored at room temperature, there are some vitamins and supplements that require refrigeration. These include liquid vitamins, and some essential fatty acids and probiotics. Probiotics contain active cultures that can die if exposed to heat, light or air, so it is essential that you refrigerate them. [4] X Research source Still, not all essential fatty acids, liquid vitamins and probiotics are required to be kept in the refrigerator, so it’s best to check the label first. It is more likely that you will be instructed to store liquids in the fridge than other forms of vitamins or supplements. Some multivitamins tablets are best kept in the fridge too."
    },
    {
      "title": "Store the vitamins in a secure container.",
      "content": "Store the vitamins in a secure container. Make sure you secure the lid very tightly to avoid any moisture penetration. Leaving the lid loose in the refrigerator means exposing your supplements to excess moisture, which could seriously degrade the vitamins or supplements. Keep the container well out of the reach of any children or pets. Even if they are in a childproof container, you should make sure that they are inaccessible."
    },
    {
      "title": "Separate them from foods with airtight containers.",
      "content": "Separate them from foods with airtight containers. Put your supplements in a separate airtight container from foods to prevent any potential contamination. Perishable foods in the fridge could easily spoil, so it’s best to put vitamins and supplements in a separate airtight container. If foods spoil nearby your supplements, any mould or bacteria could spread to them if they are not properly separated. Remember to keep your vitamins and supplements in their original containers. Airtight containers will not completely eliminate moisture, as you will let in moisture whenever you open the container."
    },
    {
      "title": "Always read the label first.",
      "content": "Always read the label first. To ensure that you store any vitamins and supplements safely and properly, you should always start by reading the label on the packaging. This will instruct you on how and where to store the supplements. Some supplements are stored in unique ways that can be found listed on their labels. The label may advise you on the recommended dosage. The label will also give you information on the “best before” date for the vitamins or supplements. Some vitamins and supplements will not last long after you have opened them."
    },
    {
      "title": "Keep them out of the reach of children.",
      "content": "Keep them out of the reach of children. If you have kids in the house you should take care to ensure that any vitamins, supplements or other potentially toxic substances are kept safe. They should be kept out of the reach of children, in a high cupboard or shelf. You can also secure the cupboard you keep them in with a childproof lock. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source The containers may have childproof lids, but you should still take care to ensure that they are kept well out of reach. All vitamins and supplements could be hazardous if consumed by a child. Vitamins and supplements formulated for adults will have dosages inappropriate for kids."
    },
    {
      "title": "Do not use them after the “best before” date.",
      "content": "Do not use them after the “best before” date. If you store your vitamins and supplements effectively, you can maintain their potency for a long time. You should never, however, consume any supplements or vitamins that have passed their stated “best before” dates. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    }
  ]
}