{
  "url": "https://www.wikihow.com/Tsundere-Meaning",
  "title": "All About the Tsundere Archetype",
  "steps": [
    {
      "title": "A tsundere character alternates between being aloof and caring.",
      "content": "A tsundere character alternates between being aloof and caring. On the first appearance, a tsundere is very hostile, prickly, and cold to another character, but gradually thaws out and acts more warmly and kindly. In many cases, these feelings stem from the tsundere having a crush on the object of their ire. Nowadays, the term “tsundere” can be split into two common archetypes: [1] X Research source The Classic Tsundere: In older series, a tsundere was more defined as a character who transitions from being aloof to being more sensitive and amiable. Many “classic” tsunderes are characters who present themselves as tomboys but have some feminine tendencies. The Modern Tsundere: A Modern Tsundere doesn’t really undergo a long-term transition; rather, they switch between their two personas whenever provoked. The Modern Tsundere’s behavior is often geared toward a particular character."
    },
    {
      "title": "The term “tsundere” comes from the words “tsun tsun” and “dere dere.”",
      "content": "The term “tsundere” comes from the words “tsun tsun” and “dere dere.” In Japanese, the word tsun tsun (ツンツン) is an adverb for acting big-headed, haughtily, aloof, and sour. [2] X Research source The word dere dere (デレデレ), on the other hand, is an adverb for being flirtatious and in love. [3] X Research source So, it makes sense that many tsundere characters act sour and aloof when they’re in love. Some tsundere characters tend to be tempestuous by nature, with their caring side hiding beneath the surface. Other tsundere characters are more caring and kind by nature, but happen to have a more turbulent aspect of their personality hidden away. [4] X Research source"
    },
    {
      "title": "Cold",
      "content": "Cold A tsundere is often standoffish and unfriendly, especially to certain characters. For some, this blatant sense of hostility is their default setting, and other characters may have trouble communicating or getting close to this type of character. [5] X Research source A tsundere might give limited responses to a certain person or simply not speak to them at all. Example: “You hear that? I love how she pretends not to care.” - Okajima to Takebayashi in Assassination Classroom [6] X Research source"
    },
    {
      "title": "Aggressive",
      "content": "Aggressive Tsundere characters are often known for being physically violent, and often kick, slap, or punch the object of their ire. These physical tirades are typically meant to serve more of a comedic effect in the anime or manga’s overall story. [7] X Research source Example: “I mean, she’s into violent real-life experience. Listen to her and you’re liable to end up back here in the hospital.” - Naruto discussing Sakura in Naruto [8] X Research source"
    },
    {
      "title": "Rude",
      "content": "Rude A tsundere doesn’t hesitate to put people down. In fact, it’s common for this type of character to make comments like “be quiet” or “you’re a moron.” At this point, the character being taunted can’t do anything to change his image in the eyes of the tsundere. [9] X Research source The tsundere might say “baka (馬鹿) ( written phonetically is “ばか”),” which means “idiot” or “moron” in Japanese. [10] X Research source Example: “But don’t actually make me spell this stuff out. That’s embarrassing, idiot.” - Kei Sugiura in School Zone Girls [11] X Research source"
    },
    {
      "title": "Domineering",
      "content": "Domineering A tsundere can be ruthless and even dictatorial toward the object of their annoyance. For instance, they might treat the person as a pet or be extremely bossy toward them. [12] X Research source Example: “Stop ogling her, you sick mutt!” - Taiga from Toradora , calling Ryuji a dog [13] X Research source"
    },
    {
      "title": "Helpful",
      "content": "Helpful On the other side of the spectrum, tsundere characters can be very helpful in their own right—this might involve cooking their love interest a meal, physically training them, giving them gifts, and so on. In many cases, these kind gestures are followed up with aloof comments like “I’m not doing this because I like you” or “I’m only doing this because I felt bad for you.” [14] X Research source"
    },
    {
      "title": "Caring",
      "content": "Caring Despite the tsundere’s prickly reputation, these characters can be caring and supportive in their own right. For instance, they might help their love interest out when they’re sick, tutor them when they’re having difficulty with schoolwork, or even lend a listening ear when they’re struggling with a romantic issue. [15] X Research source"
    },
    {
      "title": "Asuka Langley Sohryu from Neon Genesis Evangelion",
      "content": "Asuka Langley Sohryu from Neon Genesis Evangelion Asuka enters NGE as a pilot for the Evangelion Unit-02, joining the pilot ranks of fellow teens Shinji and Rei. Throughout the series, Asuka has trouble telling people how she really feels, and sometimes behaves in an aggressive way—for instance, when she and Shinji share a kiss, she pinches his nose shut during the entire encounter. [16] X Research source Asuka’s Japanese voice actress even acknowledges that Asuka is a tsundere, though the term wasn’t really used when NGE first came out in the mid-1990s. [17] X Research source Quote: “So you’re finally awake, stupid Shinji.”"
    },
    {
      "title": "Taiga Aisaka from Toradora",
      "content": "Taiga Aisaka from Toradora Taiga has feelings for Yusaku, Ryuji’s best friend, while Ryuji has feelings for Minori, Taiga’s best friend. The solution? Ryuji and Taiga work as matchmakers for one another—though that’s easier said than done at times, given how prickly, tempestuous, and physically violent Taiga tends to be. [18] X Research source Quote: “You idiot pig, dog, yaksha, asura, gorilla!”"
    },
    {
      "title": "Erina Nakiri from Food Wars!",
      "content": "Erina Nakiri from Food Wars! Erina comes from an esteemed family in the cooking world but tends to be stand-offish as a result of her difficult childhood. She’s very cold and aloof to Soma, the prodigy chef and protagonist of the series, but eventually warms up to him over the course of the show. [19] X Research source Quote: “You’re irritating as usual!”"
    },
    {
      "title": "Levi Ackerman from Attack on Titan",
      "content": "Levi Ackerman from Attack on Titan Levi is well-known for being a prodigy among the Scouts in the brutal universe of Attack on Titan , just as he’s well-known for being cold and distant in most of his interactions with the series’ other characters. When push comes to shove, though, Levi cares deeply about his fellow soldiers and goes the extra mile to keep them safe. [20] X Research source Quote: “Don’t touch me with your filthy hand. I might get dirty.”"
    },
    {
      "title": "Kyo Sohma from Fruits Basket",
      "content": "Kyo Sohma from Fruits Basket As a member of the Sohma family, Kyo is cursed to turn into a cat under specific circumstances. As a relative outcast of his family, it’s no wonder that he’s pretty rough around the edges throughout the series—but as he gets to know Tohru, the young woman who ends up living with him and his family, he starts to reveal a different, more caring side. [21] X Research source Quote: “This isn’t any of your business! What’s your deal, anyway?”"
    },
    {
      "title": "Diona from Genshin Impact",
      "content": "Diona from Genshin Impact Known for iconic cat ears and tail (due to her Kätzlein heritage), Diona’s cute appearance strongly contrasts her brusque and prickly personality. Her hatred for alcohol and the alcohol industry contributes to this, thanks to her own father’s drinking problems. Despite this, she reveals a kind and doting personality beneath, especially to the character you play in the Genshin Impact universe. [22] X Research source Quote: “Why should I tell you? Hmph! Since you won’t stop asking… and since we are friends, I’ll tell you.”"
    },
    {
      "title": "Yandere",
      "content": "Yandere Yandere characters are the opposite of tsundere characters; where tsundere characters are distant and cold, a yandere is fanatically obsessive and possessive of their love interest. This fanaticism can border into complete insanity, with the character in question sometimes resorting to stalking, murder, and other criminal acts to be closer to their love interest. [23] X Research source Example characters: Yuno from Mirai Nikki , Ako from Netoge no Yome wa Onnanoko ja Nai to Omotta? , Misa from DEATH NOTE , Grell from Kuroshitsuji"
    },
    {
      "title": "Kuudere",
      "content": "Kuudere Kuudere characters are calm, indifferent personalities that don’t tend to show a lot of emotion to others. The “kuu” (クー) portion of the word stems from the Japanese word “kuuru” (クール), which is an English loan word for “cool.” Like tsundere characters, kuudere characters also have a kind and caring persona hidden beneath the surface. [24] X Research source Example characters: Angel from Angel Beats! , Akame from Akame ga Kill! , Kyouka from Bungou Stray Dogs , C.C. from Code Geass"
    },
    {
      "title": "Dandere",
      "content": "Dandere Dandere characters tend to be really shy, nervous, and reserved individuals—it’s only when they’re alone with someone they trust that they feel comfortable opening up. Like tsundere characters, a dandere hides their true feelings and passions beneath the surface but does so in a distinctly different way. Etymologically speaking, the “dan” portion of the word originates from the word “danmari” (黙り), which is Japanese for “silent.” [25] X Research source Example characters: Hinata from Naruto , Lotte from Little Witch Academia , Ririka from Kakegurui , Mafuyu from Given"
    },
    {
      "title": "Deredere",
      "content": "Deredere Deredere characters are known for being exuberant, easygoing, and happy Unlike tsundere characters, they embody their warm and caring characteristics constantly, rather than burying them beneath a cold persona. [26] X Research source Example characters: Chika from Love Live! Sunshine!! , Madoka from Puella Magi Madoka Magica , Usagi Tsukino from Sailor Moon , Astro Boy from Astro Boy"
    }
  ]
}