{
  "url": "https://www.wikihow.com/Unfreeze-the-Samsung-Galaxy-Tab",
  "title": "How to Fix Your Frozen Samsung Galaxy Tablet",
  "steps": [
    {
      "title": "Press the Home button.",
      "content": "Press the Home button. It's the hardware button at the bottom of the tablet's housing. This should prompt the app to minimize, allowing you to see the Home screen."
    },
    {
      "title": "Wait for the app to minimize.",
      "content": "Wait for the app to minimize. Your app may take a few seconds to minimize if it is frozen. If the app doesn't minimize after around a minute, you'll need to restart your Samsung Tab instead."
    },
    {
      "title": "Try closing the app.",
      "content": "Try closing the app. Press the app view button, which resembles two boxes in the lower-left corner of the tablet, then tap X in the upper-right side of the app's page. If the app isn't too frozen to exit this way, your app should close. If the app isn't responding to this, you can proceed with the rest of this method to force-quit the app."
    },
    {
      "title": "Open Settings.",
      "content": "Open Settings. Tap the Settings app icon, which resembles an outline of a gear, in your tablet's App Drawer. You can also swipe down from the top of the screen and then tap the \"Settings\" quick icon."
    },
    {
      "title": "Tap Apps.",
      "content": "Tap Apps . It's near the bottom of the Settings screen. Doing so opens a list of your tablet's installed apps."
    },
    {
      "title": "Select the app.",
      "content": "Select the app. Scroll through your list of apps until you find the one which is freezing, then tap its name to open its page."
    },
    {
      "title": "Tap FORCE STOP.",
      "content": "Tap FORCE STOP . This option is at the top of the page. This will cause the app to quit, though you may lose any unsaved progress in the app (if applicable). You may be prompted to confirm that you want to force-quit the app."
    },
    {
      "title": "Consider deleting the app.",
      "content": "Consider deleting the app. If your app keeps freezing, you may want to remove it from your tablet: Open Settings Tap Apps Scroll down and tap the app you want to remove. Tap UNINSTALL (if the app is a system app, tap DISABLE instead). Tap UNINSTALL or OK when prompted."
    },
    {
      "title": "Try restarting the tablet.",
      "content": "Try restarting the tablet. Press and hold both the Power button and the Volume Down button for around seven seconds to prompt the tablet to restart. [1] X Research source This won't always work if your tablet is frozen. If your tablet doesn't restart within 30 seconds, proceed with the rest of this method."
    },
    {
      "title": "Press and hold the Power button.",
      "content": "Press and hold the Power button. If your tablet won't restart like usual, you'll need to force it to shut down and then manually restart it. You'll want to use this method when dealing with a tablet which is unresponsive or sluggish."
    },
    {
      "title": "Wait for your tablet to power down.",
      "content": "Wait for your tablet to power down. In most cases, you'll only need to hold down the Power button for a few seconds; when your tablet is frozen, however, you may need to hold down the Power button for as long as two minutes. You can also remove the battery from your tablet in order to force it to turn off."
    },
    {
      "title": "Release the Power button.",
      "content": "Release the Power button. Once your tablet begins shutting down, you can let go of the Power button and allow the tablet to shut down like usual."
    },
    {
      "title": "Turn back on the tablet after one minute.",
      "content": "Turn back on the tablet after one minute. Once the tablet has been off for a minute, pressing (or pressing and holding for a few seconds) the Power button should turn back on the tablet. Once it finishes rebooting, it should no longer be frozen."
    },
    {
      "title": "Remove a problematic app if necessary.",
      "content": "Remove a problematic app if necessary. If your tablet froze due to an app opening or running for too long, you may want to remove the app entirely: Open Settings Tap Apps Scroll down and tap the app you want to remove. Tap UNINSTALL (if the app is a system app, tap DISABLE instead). Tap UNINSTALL or OK when prompted."
    },
    {
      "title": "Turn off your tablet.",
      "content": "Turn off your tablet. Press and hold the Power button, then tap the Power off option in the menu which appears. If your tablet won't turn off in this way, hold down the Power button until the tablet turns off. You can also remove the battery from your tablet in order to force it to turn off."
    },
    {
      "title": "Open the recovery screen.",
      "content": "Open the recovery screen. Once your tablet is off, press and hold the Power button and the Volume Up button at the same time, then release the Power button when the Samsung logo appears and release the Volume Up button when the Android logo appears."
    },
    {
      "title": "Select Wipe data/factory reset.",
      "content": "Select Wipe data/factory reset . Press the Volume Down button until this option is highlighted, then press the Power button to open it. [2] X Research source"
    },
    {
      "title": "Select Yes -- delete all user data.",
      "content": "Select Yes -- delete all user data . It's in the middle of the menu. Doing so will prompt your tablet to begin wiping."
    },
    {
      "title": "Wait for the factory reset to complete.",
      "content": "Wait for the factory reset to complete. This can take anywhere from a couple of minutes to well over half an hour."
    },
    {
      "title": "Set up your tablet.",
      "content": "Set up your tablet. Once the reset is complete, you'll be able to set up your tablet as though it were brand-new, and the troublesome apps and/or settings which were causing the tablet to freeze will be gone."
    }
  ]
}