{
  "url": "https://www.wikihow.com/What-Do-Clogged-Pores-Look-Like",
  "title": "What Do Clogged Pores Look Like? Identify and Unclog Them",
  "steps": [
    {
      "title": "Clogged pores look like acne or bumpy patches across the skin.",
      "content": "Clogged pores look like acne or bumpy patches across the skin. Clogged pores look different depending on the individual, so your clogged pores might not look the same as someone else's. Usually, clogged pores look like: [1] X Research source Whiteheads —this is where the clogged pore closes and bulges out to make a white dot. Blackheads —where a clogged pore closes and looks like a small black dot. Red pimples —this is when bacteria also gets into the clogged pore. The skin looks irritated and inflamed. There may even be pus near the surface of the skin. Round, dome-shaped lumps called cysts —they're usually yellow or white. Sometimes, they have a dark plug visible in the center."
    },
    {
      "title": "Increased oil production can block the pores.",
      "content": "Increased oil production can block the pores. There's a reason that teenagers experience more acne than adults—their bodies produce more hormones that stimulate oil production. More oil on the skin can lead to more clogged pores which cause acne. Fortunately, most teenagers' acne improves as they age. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Anyone can experience clogged pores and acne, but it's really common in teenagers—their hormonal shifts increase the production of oil, so the pores are more likely to become clogged. It's true that some teens don't experience acne or clogged pores as badly as others. This might be because of differences in genetics and immune systems."
    },
    {
      "title": "Sweat and excess dirt on your skin can block your pores.",
      "content": "Sweat and excess dirt on your skin can block your pores. You might notice that your pores clog more during the summer because you're sweating more. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To prevent clogged pores, wash your skin more frequently during hot summer months or after physical activities where you sweat a lot. [4] X Research source Wash your skin more often if you work around greasy food or oil, as well."
    },
    {
      "title": "Products like sunscreen, makeup, and skincare can clog pores.",
      "content": "Products like sunscreen, makeup, and skincare can clog pores. Lots of products, especially heavy creams, are comedogenic, which means they block the pores. Thick sunscreens, moisturizers, foundations, and makeup can all play a part. This is why it's important to use non-comedogenic skincare and makeup . [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To tell if an item is non-comedogenic, read the label. It should make it clear on the product description that the product won't block your pores."
    },
    {
      "title": "Steam your face to make cleansing and exfoliating more effective.",
      "content": "Steam your face to make cleansing and exfoliating more effective. To do a steam facial , place a clean towel in a bowl and pour hot—not boiling— water onto the cloth. Wring it out and place the towel on your skin. Keep the towel in place for up to 10 minutes. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This gives the steam time to clean your skin and open your pores. You could also pour hot water into the bowl and drape a dry towel over the back of your head. Lean over the bowl so the towel traps the steam. Enjoy the steamy facial for up to 10 minutes. To make the steam more effective, include a vitamin A cream in your regimen. This makes your skin cells less sticky, which can reduce clogged pores. You could moisturize with a vitamin A cream after you wash your face or apply a vitamin A serum to your skin before bed for instance."
    },
    {
      "title": "Wash your face twice a day with a non-comedogenic cleanser.",
      "content": "Wash your face twice a day with a non-comedogenic cleanser. Use a gentle cleanser that contains salicylic acid or glycolic acid —these ingredients can open up clogged pores and improve acne. Wash your skin in the morning and before bed. Use warm water, not hot, so you don't irritate your skin. With a good cleansing routine, you'll begin to see improvements in your clogged pores. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Non-comedogenic means that it won't clog your pores, so it's super important to find a non-comedogenic cleanser."
    },
    {
      "title": "Hydrate your skin with a water-based moisturizer.",
      "content": "Hydrate your skin with a water-based moisturizer . While oily skin is often responsible for clogged pores, dry skin can also clog your pores. Apply a non-comedogenic moisturizer right after you wash your skin to lock in hydration. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source It can take a few weeks to notice an improvement in your dry skin, so stick with your routine."
    },
    {
      "title": "Keep your hair and fingers away from your face.",
      "content": "Keep your hair and fingers away from your face. Oil from your hair or fingertips can easily transfer to your skin and clog your pores. Make it a habit not to touch or rest your hand on your face. Wash your hair frequently and keep it tied back, so it doesn't fall onto your face. [9] X Research source Resist the temptation to pick or squeeze your clogged pores since these can cause infection or scarring. Keep your cell phone clean and free from oil, so it doesn't get onto your skin."
    },
    {
      "title": "Use cleansing pore strips to pull out the dirt.",
      "content": "Use cleansing pore strips to pull out the dirt. Pore strips are especially helpful if you've got clogged pores on your nose. Press a pore strip onto your clean skin and slowly peel it off to get the trapped dirt out. Use pore strips once every month or every other month. Ideally, you'll get oil production under control by washing your face twice a day, so you won't need to use pore strips frequently. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try a charcoal mask to make your pores look clearer.",
      "content": "Try a charcoal mask to make your pores look clearer. Although more research is needed to determine how charcoal affects the skin, a charcoal face mask might improve the look of your pores. [11] X Research source To apply the mask , start with clean skin and brush or rub the charcoal mask onto your face. Let the mask sit for up to 10 minutes before you peel it off. If your skin tends to be sensitive, test your skin for a reaction before you apply the mask—dab a little of the mask on a spot on your wrist. Check your skin after 10 minutes and look for signs of a reaction: redness, swelling, or rash."
    },
    {
      "title": "Do mechanical exfoliation only if you're not using chemical exfoliation.",
      "content": "Do mechanical exfoliation only if you're not using chemical exfoliation. Once a week, gently scrub your skin with a light exfoliating brush or scrubber. You could also massage an exfoliating product like apricot scrub onto your skin and rinse it off with lukewarm water. These mechanical exfoliating techniques remove the dead skin that sits on the surface and can clog pores. If you're using chemical exfoliation—getting facials and peels or using skincare products that contain alpha-beta hydroxy acid, salicylic acid, or retinoids, skip mechanical exfoliation because the combination can be too much for your skin. Baking soda is often touted as a natural way to mechanically exfoliate your skin. However, it can be too rough and damage the topmost layer of your skin."
    },
    {
      "title": "Get a chemical peel as part of a regular facial treatment.",
      "content": "Get a chemical peel as part of a regular facial treatment. A chemical peel is a chemical exfoliant treatment where a dermatologist applies alpha-beta hydroxy acid, salicylic acid, or retinoids to your skin. The peel removes the outermost layer of the skin, which can open your clogged pores. Follow your dermatologist's skincare plan for recovering after the peel. Although you can find chemical peel kits for home use, it's best to visit a professional dermatologist who can create a customized peel for your skin. You might be tempted to try physical exfoliation—scrubbing your skin with exfoliating brushes or using abrasive cleansing products—but don't! If you're rough with the clogged pores, you can actually make acne worse or cause other skin problems."
    }
  ]
}