{
  "url": "https://www.wikihow.com/Work-at-an-NGO",
  "title": "How to Work at an NGO",
  "steps": [
    {
      "title": "Think about what you want to do.",
      "content": "Think about what you want to do. Take some time to think about what, exactly, you want out of a job. NGO salaries are often very low, so if you’re looking to make a lot of money, they may not be the best option. However, if you want to travel, provide aid to people, or work toward a specific, moral goal, NGOs may be a perfect fit. [1] X Research source"
    },
    {
      "title": "Look for an NGO that matches your goals.",
      "content": "Look for an NGO that matches your goals. Seek out an NGO that is concerned with the same issues you are. If you want to travel to foreign countries, look for groups like World Vision or CARE International. If you want to work in a specific field, like education, sports, or animal care, look for an organization with jobs in that arena. Try to find 4 or 5 large NGOs you would enjoy working for, that way you have options when applying for a job. [2] X Research source Groups like the World Association of Non-Governmental Organizations offer full, searchable NGO databases broken down into areas of interest. [3] X Research source"
    },
    {
      "title": "Find their mission statement and organization goals.",
      "content": "Find their mission statement and organization goals. Though most NGOs are dedicated to some sort of activist or humanitarian goal, the specific aims of each group will vary wildly. Using their website and informational handouts, look for a listed mission statement and point-by-point group goals. Make sure any NGOs you’re interested in align with your moral and ethical beliefs. [4] X Research source"
    },
    {
      "title": "Find out what they look for in job applicants.",
      "content": "Find out what they look for in job applicants. Different NGOs have different needs based on their specific mission. Look closely at what your NGO requires and work toward meeting and exceeding their expectations. This information can typically be found on the group’s website under a ‘Careers’ or ‘Get Involved’ section. Some groups, like Acumen, look for individuals with general degrees and work experience in similar positions. Some groups, like Doctors without Borders, look for trained, licensed professionals."
    },
    {
      "title": "Volunteer at local charities.",
      "content": "Volunteer at local charities. Since NGOs specialize in activism and aid, charity work is extremely important. Take time to volunteer at your local food bank, homeless shelter, and similar organizations, taking on leadership roles if at all possible. If given the choice, NGOs will hire those with significant volunteer experience over those with little or none. [5] X Research source Groups like VolunteerMatch can help you find local charities and non-profit organizations looking for volunteers. [6] X Research source"
    },
    {
      "title": "Learn a second language.",
      "content": "Learn a second language. Though not essential for all NGOs, learning a second language will be a great asset for groups specializing in international travel and aid. Popular languages like Spanish, French, and Chinese, are always good, though you may get further with small languages isolated to specific areas of interest, such as: [7] X Research source Hindi, Bengali, Telugu, or Marathi for India. Persian, Farsi, Arabic, or Kurdish for the Middle East. Tagalog or Cebuano for the Philippines."
    },
    {
      "title": "Get real-world experience through local jobs and internships.",
      "content": "Get real-world experience through local jobs and internships. If possible, take a local job or internship related to the NGO you hope to work for. This could be as simple as working at an animal shelter if you hope to go into animal rights, or serving as a tutor if you hope to do education work overseas. For smaller cities and towns, internships are often available through government boards and services. If you’re in school, look for internship opportunities through your degree program."
    },
    {
      "title": "Get a college degree.",
      "content": "Get a college degree. Though some NGOs recruit high school graduates, most organizations give precedence to those with a bachelor's degree or higher, with some even requiring graduate-level studies. If possible, work toward a degree in a field related to your organization, such as medicine or cultural studies, or something that can translate to many different NGOS, such as accounting, marketing, or computer science. [8] X Research source Entry-level NGO jobs will often require a bachelor’s degree, though the specific major usually doesn’t matter. Upper-level and specialized NGO jobs will often require a particular bachelor or master’s degree, such as in education, public health, business management, or urban planning. [9] X Research source If you don’t have a degree, still apply! In some cases, organizations will wave education requirements if you have significant work or volunteer experience."
    },
    {
      "title": "Look for job openings or internships.",
      "content": "Look for job openings or internships. As with all professions, NGOs have sporadic job openings, so keep an eye out for what they have listed and when more become available. If no positions are listed, contact the organization’s Public Relations team to see if you can leave your resume. In addition to each organization’s website, NGO job openings can be found at places like NGO Job Board, NGO Recruitment, and Idealist.org. [10] X Research source"
    },
    {
      "title": "Prepare your resume.",
      "content": "Prepare your resume. Create a version of your resume that places emphasis on relevant work experience, prior volunteer work, and education, in that order. Include a 2 to 3 sentence Summary at the beginning of the document paraphrasing the resume and stating your commitment to the NGO’s goal. Along with listing your general duties at each job and charity, include a brief statement about what you personally achieved, such as: [11] X Research source Created and managed 3 fundraisers for the local crisis center. Helped build houses for 12 low-income families. Ran multiple community center seminars on preventing child abuse."
    },
    {
      "title": "Write a specialized cover letter.",
      "content": "Write a specialized cover letter. Just like applying for regular jobs, prepare a short, clear cover letter to send with your resume. In addition to work experience and qualifications, include 2 to 3 sentences about what you can bring to the organization’s mission and why you care about this type of work. Small anecdotes are fine, but cover letters are supposed to be brief, so make sure the stories are short and relate to your qualifications and goals. [12] X Research source For humanitarian organizations, include something like “Throughout my life, I’ve always wanted to help people, and I believe now more than ever that this is the best way to do that.” For education organizations, include something like “My dream has always been to teach, and I believe I can have a greater impact through your organization.” For medical organizations, include something like “I love the work I do, and I want to use my skills to help those who truly need it.”"
    },
    {
      "title": "Apply",
      "content": "Apply for the position. Double check your resume, cover letter, and any additional texts you are required to submit. Then, take a deep breath and send in your application. If you’re lucky, they may request an interview or skill test to see if you’re right for the organization. If not, it simply means your dream job is located somewhere else, so keep applying! [13] X Research source Remember, major organizations receive tons of applications every year, so a rejection is not a statement about your qualifications or character."
    },
    {
      "title": "Have a successful job interview.",
      "content": "Have a successful job interview. If you get called back for a job interview, take some steps to make sure it goes well. Dress in business formal attire, make sure you are clean and groomed, and refresh yourself on the specifics of the job you applied for. Arrive early, bring a copy of your resume, and remember your manners. Most interviewers will ask questions about your background, and though many of these are position-specific, some common ones include: “Where do you see yourself in 5 years?” “Why do you want to work for our organization?” “Why are you interested in this line of work?”"
    },
    {
      "title": "Stay dedicated to the cause.",
      "content": "Stay dedicated to the cause. When you do something for a long time, the initial spark of motivation may start to dull. If that happens, take some time to remember why you took this job and how your work is making a difference. Go back over the NGO’s mission and goals, talk to coworkers about how you’re feeling, and try to remember why this work means so much to you. [14] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source For short-term work, try to stay in touch with the people or groups you helped via letters, e-mails, or phone calls. For long-term work, take pictures throughout the process, that way you can truly see the impact you’ve had."
    },
    {
      "title": "Be aware of world news and politics.",
      "content": "Be aware of world news and politics. Activism and humanitarian work often change what they do or how they do it in response to major events and political shifts. Make sure to read the news from a variety of sources, especially those located in countries you work with, and stay up to date with laws, polls, and movements related to your cause. [15] X Research source Many NGOs offer internal newsletters or a list of resources so employees and volunteers can stay current."
    },
    {
      "title": "Be flexible with work.",
      "content": "Be flexible with work. Some NGO positions will act like a standard 9 to 5 job where you simply clock in and clock out. Others will place abnormal, potentially taxing demands on where you live, when you work, and what you do. Be flexible with your employer and try to live a lifestyle that can accommodate these expectations. If you travel a lot, try to minimize your belongings or keep them relegated to small, compact digital devices. If you work strange hours, try to find long-distance friends you can stay connected with when nearby friends are not available."
    },
    {
      "title": "Plan a family with your job in mind.",
      "content": "Plan a family with your job in mind. Many NGOs, especially those working in third-world countries, war zones, and refugee camps, have practically no work-life balance, a fact that can strain family relationships. If you’re looking for a significant other, try to find someone who understands your job and how important it is to you. If you already have a spouse or children, make sure to spend as much time with them as you can and listen to any concerns they have about your job."
    }
  ]
}