{
  "url": "https://www.wikihow.com/Use-the-Clone-Tool-in-Gimp",
  "title": "Quick Guide to Using the Clone Tool in GIMP",
  "steps": [
    {
      "title": "Open the image that you want to fix.",
      "content": "Open the image that you want to fix. Launch the GIMP app, then go to File > Open . Select the image you’re planning to edit, then click Open in the file browser window."
    },
    {
      "title": "Activate the clone tool.",
      "content": "Activate the clone tool. It looks like a stamp. You can either activate it by clicking the icon in the toolbox (a menu of editing tools represented by icons), or by going to Tools > Paint Tools > Clone . You can also just press the letter C on your keyboard. [1] X Research source"
    },
    {
      "title": "Adjust the clone tool settings in the toolbar.",
      "content": "Adjust the clone tool settings in the toolbar. Once you’ve selected the clone tool, you’ll see a menu of tool options underneath the toolbox. From there, you can adjust the clone tool settings to get the kind of effect you want. For instance: Use the Brush menu to adjust the hardness and shape of your clone brush. Lower the opacity of the brush for a more subtle and natural effect. Change the size of the brush to clone a larger or smaller area. Check Sample Merged if you want to sample from all the layers of your image instead of just the active one (if your image has multiple layers). If you want multiple clone brush strokes to mesh smoothly together, turn on Aligned mode in the Tool Options menu. Otherwise, they will clash with each other where they overlap. You can also experiment with other alignment settings, such as Registered or Fixed , to achieve different cloning effects."
    },
    {
      "title": "Ctrl",
      "content": "Ctrl -click the part of the image you want to clone. Hold down the CTRL key on the keyboard while using your mouse to click on the area you would like to duplicate. This will select the source of the pixels you want to clone. If you skip this step, the clone brush won’t work! You must select an area to clone before you can continue."
    },
    {
      "title": "Release Ctrl and click the area you want to cover.",
      "content": "Release Ctrl and click the area you want to cover. After selecting the area you'd like to clone, let go of the CTRL key and click the spot on the image where you want to deposit your cloned pixels. You can click on as many areas as you like and the same cloned image will appear there. You can also click and drag to create a long brush stroke using the cloned pixels. By default, the brush stroke will start with the selected pixels and then copy more pixels from the area around the pixels you copied. So, for example, if you make a horizontal stroke from left to right, the stroke will contain pixels copied from the area to the right of the original spot that you selected."
    },
    {
      "title": "Repeat the process as necessary.",
      "content": "Repeat the process as necessary. You can sample pixels from as many parts of the image as you like. To get the best match between your cloned pixels and the area you want to cover, take the sample from as close to the area you’re covering as possible."
    },
    {
      "title": "Open the image where you’d like to clone a pattern.",
      "content": "Open the image where you’d like to clone a pattern. In GIMP, click the File menu and select Open . Select your image and click Open in the file browser. You can also start from a new, blank page by going to File > New ."
    },
    {
      "title": "Select the clone tool.",
      "content": "Select the clone tool. Press C on your keyboard, click the clone tool in your toolbox (it looks like a rubber stamp), or go to Tools > Paint Tools > Clone ."
    },
    {
      "title": "Select Pattern in the Source dropdown.",
      "content": "Select Pattern in the Source dropdown. In the Tool Options menu pane, click the dropdown next to Source and select Pattern ."
    },
    {
      "title": "Choose the pattern you want to clone.",
      "content": "Choose the pattern you want to clone. Click the pattern tile below the Source header to expand a menu of different patterns. Click the tile with the pattern you want to clone. You can also use the tool options menu to change things like the shape, size, and opacity of your clone brush. GIMP comes with several pre-supplied patterns, but you can also make your own. Open or create the image you want to use in GIMP, save it with a “.pat” file extension, and put it in either your system’s or GIMP’s Patterns folder. [2] X Research source"
    },
    {
      "title": "Paint the pattern onto your image.",
      "content": "Paint the pattern onto your image. Unlike when you’re using the clone brush to copy and paste pixels from one part of an image to another, you don’t need to hold down the Ctrl key to select anything when cloning a pattern. Just click and drag your brush to paint! The clone brush will automatically “tile” the pattern so it repeats smoothly from one end of the canvas to the other."
    }
  ]
}