{
  "url": "https://www.wikihow.com/Wear-a-Jockstrap",
  "title": "How to Wear a Jockstrap",
  "steps": [
    {
      "title": "Wear a jockstrap for comfort and protection while playing sports.",
      "content": "Wear a jockstrap for comfort and protection while playing sports. A jockstrap is recommended for any sport that requires running, such as track and field or basketball. For contact sports or sports involving fast-moving balls, a cup is also recommended."
    },
    {
      "title": "Make sure your jockstrap fits correctly.",
      "content": "Make sure your jockstrap fits correctly. You will want to consider waist size and pouch comfort. The jockstrap should be tight enough to lift and hold the penis and testicles close to the body, out of the way during movement, but not too tight, as chafing can contribute to jock itch."
    },
    {
      "title": "Decide if you will be wearing a cup.",
      "content": "Decide if you will be wearing a cup . A cup is a hard molded piece of plastic or metal that fits inside of a pouch in the jock strap. [1] X Research source They are recommended for any sport involving contact or speeding projectiles, such as hockey, soccer, baseball, football, or mixed martial arts. Some men wear a cup-jockstrap in daily wear, not just when playing sports, to augment their masculine appearance. Many athletes are reluctant to wear cups, particularly in football, [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source but consider that more than half of all testicular injuries occur during sports and [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source testicular torsion and testicular rupture can lead to losing a testicle."
    },
    {
      "title": "Choose your cup.",
      "content": "Choose your cup. Many cups are sport specific, so you’ll need to know the sport you are going to use it for. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You will want to consider both comfort and the degree of protection the cup offers. For a cup to work, it must fit tightly against the body. You will want to make sure your jockstrap is tight enough to prevent the cup from rolling or twisting. Look for cups with cushioned edges. A hard edge will just transfer the force of the blow to the pelvic area. A soft edge provides better cushioning during impact. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For really fast moving sports like lacrosse or baseball, consider a titanium cup. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Consider wearing compression shorts over your cup-jockstrap if you think the cup- jockstrap fits too loose and does not hold the cup tight enough against your body.",
      "content": "Consider wearing compression shorts over your cup-jockstrap if you think the cup- jockstrap fits too loose and does not hold the cup tight enough against your body. Compression shorts offer similar support as a jockstrap, and some compression shorts come with a pouch designed to hold a protective cup, but many compression shorts that have a pouch do not hold the cup tight against the body. It is better to wear a cup in a cup-jockstrap and then wear tight fitting compression shorts over the cup-jockstrap to hold the cup firmly in place and tight against the body. In many sports such as football, compression shorts are now preferred by many athletes. But remember always that the cup must be held firmly in place and tight against the body for it function properly. [7] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source"
    },
    {
      "title": "Wear a fashion jockstrap as you would regular underwear.",
      "content": "Wear a fashion jockstrap as you would regular underwear. Increasingly, men are turning to jockstraps as an everyday form of underwear due to their comfort and attractiveness."
    },
    {
      "title": "Make sure your jockstrap is comfortable.",
      "content": "Make sure your jockstrap is comfortable. Jockstraps are usually sized by waist. You will want to try several to make sure your genitals are also comfortable. Unlike in sports, you do not need to worry about how close they hold your genitals to your body. Pick a jockstrap that you find most comfortable."
    },
    {
      "title": "Decide on a style.",
      "content": "Decide on a style. Fashion jockstraps don’t just come in the typical waist band, pouch and two straps style that typifies sports jockstraps. Some have thicker straps or multiple straps, while others have more material to help shape your buttocks."
    },
    {
      "title": "Choose the material.",
      "content": "Choose the material. Like other kinds of underwear, fashion jockstraps come in a variety of materials: cotton, mesh, silk and even fur! [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Consider the shape of the pouch.",
      "content": "Consider the shape of the pouch. Fashion jockstraps come in a variety of shapes, including snug, contour and natural. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Some even come with plastic cups for “aesthetic enhancement.”"
    },
    {
      "title": "Pick your brand.",
      "content": "Pick your brand. 35% of men say they buy their underwear in order to show off the brand peeking out from the waist of their pants. Consider popular fashion brands like Jack Adams, Nasty Pig, N2N, Modus Vivendi, Pump! And Baskit. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}