{
  "url": "https://www.wikihow.com/Upgrade-Microsoft-Office",
  "title": "How to Upgrade Microsoft Office",
  "steps": [
    {
      "title": "",
      "content": "Go to the Microsoft Account page. It's at https://login.live.com/. Since Microsoft doesn't typically save your login details, you'll likely need to log into your account. If you're already signed into your Microsoft account, skip the next two steps ."
    },
    {
      "title": "Enter your email address, then click Next.",
      "content": "Enter your email address, then click Next . You must enter your Microsoft email address (e.g., an Outlook, Live, or Hotmail address)."
    },
    {
      "title": "Enter your password, then click Next.",
      "content": "Enter your password, then click Next . As long as your account details are correct, doing this will take you to your Microsoft account page."
    },
    {
      "title": "Click Services & subscriptions.",
      "content": "Click Services & subscriptions . It's a tab in the blue bar near the top of the page. Your current version of Office should be listed here. [1] X Research source"
    },
    {
      "title": "Click Install Office.",
      "content": "Click Install Office . You should see this below a textbox that says \"New: Office 2016 is now available.\" [2] X Research source"
    },
    {
      "title": "Click Install.",
      "content": "Click Install . This option is on the left side of the page. Doing so will prompt Office 2016 to download to your computer."
    },
    {
      "title": "Double-click the Office install file.",
      "content": "Double-click the Office install file. It will be in your computer's default downloads folder (e.g., the desktop)."
    },
    {
      "title": "Wait for the installation to finish.",
      "content": "Wait for the installation to finish. Once your installation is complete, Microsoft Office should be updated to the latest version."
    },
    {
      "title": "Go to the Microsoft Store.",
      "content": "Go to the Microsoft Store. To do so, visit https://www.microsoftstore.com/store/msusa/en_US/home . If you aren't logged into your Microsoft Account, click Sign in in the top-right corner of the page and enter your email address and password."
    },
    {
      "title": "Click Software & Apps.",
      "content": "Click Software & Apps . It's a tab in the grey bar near the top of the page."
    },
    {
      "title": "Click Office.",
      "content": "Click Office . This option is near the top of the drop-down menu below the Software & Apps tab."
    },
    {
      "title": "Click an Office option.",
      "content": "Click an Office option. While all options include Word, Excel, PowerPoint, and OneNote, Office 365 subscriptions also have Outlook, Publisher, Access, a terabyte of cloud storage, and free Skype calls included as well. There are three standard options for purchase: Office 365 Home - Supports five computer installs and five mobile installs. You'll pay $99.99/year or $9.99/month for this subscription. Office 365 Personal - Supports one computer install and one mobile install. You'll pay $69.99/year or $6.99/month for this subscription. Office Home & Student 2016 (PC or Mac) - Supports one computer install. You pay $149 once for this software."
    },
    {
      "title": "Click Buy and download now.",
      "content": "Click Buy and download now . It's a blue button in the bottom-right side of the page."
    },
    {
      "title": "Click Checkout.",
      "content": "Click Checkout . You'll see this option at the top of the page. You should verify that the Office option you've selected is the one you wish to purchase before continuing."
    },
    {
      "title": "Enter your email password again.",
      "content": "Enter your email password again. This is to confirm that you're authorized to access the payment information page."
    },
    {
      "title": "Enter your payment information if necessary.",
      "content": "Enter your payment information if necessary. Your Microsoft account will save your payment information if you've previously entered it, but if not, you'll need to add a payment method (e.g., a credit or debit card) and a billing address."
    },
    {
      "title": "Click Place order.",
      "content": "Click Place order . This will purchase your selected package and prompt you to install Office on your computer."
    },
    {
      "title": "Go to the Microsoft Office website.",
      "content": "Go to the Microsoft Office website. It's at https://www.office.com/ . You'll likely need to log into your Microsoft account before you can download Office to your computer. If you have the Student version of Office, you won't be able to download Office to more than one computer."
    },
    {
      "title": "Click Sign in.",
      "content": "Click Sign in . This link is in the top-right corner of the page. If you're already signed in, skip the next two steps ."
    },
    {
      "title": "Enter your Microsoft email address and password.",
      "content": "Enter your Microsoft email address and password. Your Microsoft email address will typically end in outlook.com or live.com ."
    },
    {
      "title": "Click Sign in.",
      "content": "Click Sign in . Doing so will redirect you to the product page."
    },
    {
      "title": "Click Install Office.",
      "content": "Click Install Office . You'll see this option in the top-right side of the Office webpage."
    },
    {
      "title": "Click Install.",
      "content": "Click Install . This option is on the left side of the page. Doing so will prompt Office 2016 to download to your computer."
    },
    {
      "title": "Double-click the Office install file.",
      "content": "Double-click the Office install file. It will be in your computer's default downloads folder (e.g., the desktop). You may need to confirm that you want to allow the Office software to make changes on your device."
    },
    {
      "title": "Wait for the setup to complete.",
      "content": "Wait for the setup to complete. Once it does, you'll be able to use Office like usual."
    }
  ]
}