{
  "url": "https://www.wikihow.com/Write-a-Critique-in-Five-Paragraphs",
  "title": "How to Write a Critique in Five Paragraphs",
  "steps": [
    {
      "title": "Examine the prompt or assignment.",
      "content": "Examine the prompt or assignment. Be sure you understand exactly what you are being asked to do. The assignment may use the word “critique,” or it might use a phrase such as “critical assessment,” “critical review,” or “critical evaluation.” All of these are critique assignments and will require you to not only summarize but evaluate the work you are discussing. [1] X Research source"
    },
    {
      "title": "Read the text.",
      "content": "Read the text. Keep in mind some questions and take notes as you read. These will help guide your formulation of your ideas later. [2] X Research source For example: Does the creator clearly state her/his main point or goal? If not, why do you think that is? Who do you think is the creator’s intended audience? This can be crucial to determining the success of a work; for example, a movie intended for young children might work well for its intended audience but not for adult viewers. What reactions do you have when reading or viewing this work? Does it provoke emotional responses? Do you feel confused? What questions does the work make you think of? Does it suggest other avenues of exploration or observation to you?"
    },
    {
      "title": "Do some research.",
      "content": "Do some research. You usually will not need to do a lot of research, but in order to talk about how the work relates to a larger issue or context, you will need to know what it is responding to, what context it was created in, etc. [3] X Research source For example, if you're critiquing a research article about a new treatment for the flu, a little research about other flu treatments currently available could be helpful to you when situating the work in context. As another example, if you're writing about a movie, you might want to briefly discuss the director's other films, or other important movies in this particular genre (indie, action, drama, etc.). Your school or university library is usually a good place to start when conducting research, as their databases provide verified, expert sources. Google Scholar can also be a good source for research."
    },
    {
      "title": "Give the basic information about the work.",
      "content": "Give the basic information about the work. The first paragraph is your introduction to the work, and you should give the basic information about it in this paragraph. This information will include the author’s or creator’s name(s), the title of the work, and the date of its creation. [4] X Research source For a work of fiction or a published work of journalism or research, this information is usually available in the publication itself, such as on the copyright page for a novel. For a film, you may wish to refer to a source such as IMDb to get the information you need. If you're critiquing a famous artwork, an encyclopedia of art would be a good place to find information on the creator, the title, and important dates (date of creation, date of exhibition, etc.)."
    },
    {
      "title": "Provide a context for the work.",
      "content": "Provide a context for the work. The type of context you provide will vary based on what type of work you’re evaluating. You should aim to give the reader some understanding of what issues the creator or author may have been responding to, but you don’t need to provide an exhaustive history. Just give your reader enough information to be able to understand the rest of your critique. [5] X Research source For example, if you’re assessing a research article in the sciences, a quick overview of its place in the academic discussion could be useful (e.g., “Professor X’s work on fruit flies is part of a long research tradition on Blah Blah Blah.”) If you are evaluating a painting, giving some brief information on where it was first displayed, for whom it was painted, etc., would be useful. If you are assessing a novel, it could be good to talk about what genre or literary tradition the novel is written within (e.g., fantasy, High Modernism, romance). You may also want to include details about the author’s biography that seem particularly relevant to your critique. For a media item, such as a news article, consider the social and/or political context of the media outlet the item came from (e.g., Fox News, BBC, etc.) and of the issue it is dealing with (e.g., immigration, education, entertainment)."
    },
    {
      "title": "Summarize the creator’s goal or purpose in creating the work.",
      "content": "Summarize the creator’s goal or purpose in creating the work. This element should consider what the thesis or purpose of the work is. Sometimes, this may be clearly stated, such as in a research article. For other texts or creative works, you may have to formulate what you believe to be the creator’s goal or purpose yourself. [6] X Research source The authors of research articles will often state very clearly in the abstract and in the introduction to their work what they are investigating, often with sentences that say something like this: \"In this article we provide a new framework for analyzing X and argue that it is superior to previous methods because of reason A and reason B.\" For creative works, you may not have an explicit statement from the author or creator about their purpose, but you can often infer one from the context the work occupies. For example, if you were examining the movie The Shining, you might argue that the filmmaker Stanley Kubrick's goal is to call attention to the poor treatment of Native Americans because of the strong Native American themes present in the movie. You could then present the reasons why you think that in the rest of the essay."
    },
    {
      "title": "Summarize the main points of the work.",
      "content": "Summarize the main points of the work. Describe, briefly, how the main points are made. For example, you might talk about a work's use of characters or symbolism to depict its point about society, or you could talk about the research questions and hypotheses in a journal article. [7] X Research source For example, if you were writing about The Shining, you could summarize the main points this way: \"Stanley Kubrick uses strong symbolism, such as the placement of the movie's hotel on an Indian burial ground, the naming of the hotel \"Overlook,\" and the constant presence of Native American artwork and representation, to call viewers' attention to America's treatment of Native Americans in history.\""
    },
    {
      "title": "Present your initial assessment.",
      "content": "Present your initial assessment. This will serve as your thesis statement, and should make a claim about the work’s general effectiveness and/or usefulness. Is your evaluation going to be principally positive, negative, or mixed? [8] X Research source For a research article, you will probably want to focus your thesis on whether the research and discussion supported the authors' claims. You may also wish to critique the research methodology, if there are obvious flaws present. For creative works, consider what you believe the author or creator's goal was in making the work, and then present your assessment of whether or not they achieved that goal."
    },
    {
      "title": "Organize your critical evaluations.",
      "content": "Organize your critical evaluations. These should form the bulk of your critique and should be a minimum of three paragraphs. You can choose to organize your critique differently depending on how you want to approach your critique. However, you should devote a paragraph to each main topic, using the rest of the steps in this section to develop each paragraph's discussion. [9] X Research source If you have three clear points about your work, you can organize each paragraph by point. For example, if you are analyzing a painting, you might critique the painter’s use of color, light, and composition, devoting a paragraph to each topic. If you have more than three points about your work, you can organize each paragraph thematically. For example, if you are critiquing a movie and want to talk about its treatment of women, its screenwriting, its pacing, its use of color and framing, and its acting, you might think about the broader categories that these points fall into, such as “production” (pacing, color and framing, screenwriting), “social commentary” (treatment of women), and “performance” (acting). Alternatively, you could organize your critique by “strengths” and “weaknesses.” The aim of a critique is not merely to criticize, but to point out what the creator or author has done well and what s/he has not."
    },
    {
      "title": "Discuss the techniques or styles used in the work.",
      "content": "Discuss the techniques or styles used in the work. This is particularly important when evaluating creative works, such as literature, art, and music. Offer your evaluation of how effectively the creator uses the techniques or stylistic choices s/he has made to promote her/his purpose. For example, if you are critiquing a song, you could consider how the beat or tone of the music supports or detracts from the lyrics. For a research article or a media item, you may want to consider questions such as how the data was gathered in an experiment, or what method a journalist used to discover information."
    },
    {
      "title": "Explain what types of evidence or argument are used.",
      "content": "Explain what types of evidence or argument are used. This may be more useful in a critique of a media item or research article. Consider how the author of the work uses other sources, their own evidence, and logic in their arguments. [10] X Research source Does the author use primary sources (e.g., historical documents, interviews, etc.)? Secondary sources? Quantitative data? Qualitative data? Are these sources appropriate for the argument? Has evidence been presented fairly, without distortion or selectivity? Does the argument proceed logically from the evidence used?"
    },
    {
      "title": "Determine what the work adds to the understanding of its topic.",
      "content": "Determine what the work adds to the understanding of its topic. There are a couple of ways to approach this. Your goal in this section should be an assessment of the overall usefulness of the work. If the work is a creative work, consider whether it presents its ideas in an original or interesting way. You can also consider whether it engages with key concepts or ideas in popular culture or society. If the work is a research article, you can consider whether the work enhances your understanding of a particular theory or idea in its discipline. Research articles often include a section on “further research” where they discuss the contributions their research has made and what future contributions they hope to make."
    },
    {
      "title": "Use examples for each point.",
      "content": "Use examples for each point. Back up your assertions with evidence from your text or work that support your claim about each point. For example, if you were critiquing a novel and found the writing dull, you might provide a particularly boring quotation as evidence, and then explain why the writing did not appeal to you."
    },
    {
      "title": "State your overall assessment of the work.",
      "content": "State your overall assessment of the work. This should be a statement about the overall success of the work. Did it accomplish the creator’s goal or purpose? If so, how did it achieve this success? If not, what went wrong? [11] X Research source"
    },
    {
      "title": "Summarize your key reasons for this assessment.",
      "content": "Summarize your key reasons for this assessment. While you should have already presented evidence for your claims in the body paragraphs, you should provide a short restatement of your key reasons here. This could be as simple as one sentence that says something like “Because of the researcher’s attention to detail, careful methodology, and clear description of the results, this article provides a useful overview of topic X.” [12] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Recommend any areas for improvement, if appropriate.",
      "content": "Recommend any areas for improvement, if appropriate. Your assignment or prompt will usually say if recommendations are appropriate for the critique. This element seems to be more common when critiquing a research article or media item, but it could also apply to critiques of creative works as well. [13] X Research source"
    },
    {
      "title": "Provide a list of references.",
      "content": "Provide a list of references. How you present these will depend on your instructor’s preferences and the style (MLA, APA, Chicago, etc.) that is appropriate to your discipline. However you format this list, you should always include all the sources you used in your critique."
    }
  ]
}