{
  "url": "https://www.wikihow.com/View-a-PDF-Document-in-Full-Screen-View",
  "title": "How to View a PDF Document in Full Screen View",
  "steps": [
    {
      "title": "Click Full Screen View on the View menu.",
      "content": "Click Full Screen View on the View menu. Alternatively, press CTRL + L. Acrobat displays the document in full screen view. [2] X Research source"
    },
    {
      "title": "Press the DOWN ARROW key, the RIGHT ARROW key or the ENTER key to view the next page of the document.",
      "content": "Press the DOWN ARROW key, the RIGHT ARROW key or the ENTER key to view the next page of the document."
    },
    {
      "title": "Press the UP ARROW key, the LEFT ARROW key, or SHIFT + ENTER to view the previous page of the document.",
      "content": "Press the UP ARROW key, the LEFT ARROW key, or SHIFT + ENTER to view the previous page of the document. [3] X Research source"
    },
    {
      "title": "To return to the normal view of the document, press CTRL + L.",
      "content": "To return to the normal view of the document, press CTRL + L. Note: You can also set the full screen view preferences, to enable you to use the Esc (Escape) key to return to the normal view of the document."
    },
    {
      "title": "Click Preferences on the Edit menu.",
      "content": "Click Preferences on the Edit menu. The Preferences dialog box is displayed. [4] X Research source"
    },
    {
      "title": "Select Full Screen from the list on the left side of the Preferences dialog box.",
      "content": "Select Full Screen from the list on the left side of the Preferences dialog box. The Preferences dialog box displays the full screen options. [5] X Research source"
    },
    {
      "title": "To automatically advance the document pages, select the Advance every check box and type the time in seconds that each page should be displayed in the seconds text box.",
      "content": "To automatically advance the document pages, select the Advance every check box and type the time in seconds that each page should be displayed in the seconds text box. Note: You can browse through a document using mouse or keyboard commands even if the Advance every check box is selected."
    },
    {
      "title": "To return to the first page after the last page is displayed, select the Loop after last page check box.",
      "content": "To return to the first page after the last page is displayed, select the Loop after last page check box."
    },
    {
      "title": "Select the Escape key exits check box to enable you to exit the full screen view by pressing the Esc (Escape) key.",
      "content": "Select the Escape key exits check box to enable you to exit the full screen view by pressing the Esc (Escape) key."
    },
    {
      "title": "Select the Left click to go forward one page; right click to go back one page check box to enable you to page through a document by clicking the mouse.",
      "content": "Select the Left click to go forward one page; right click to go back one page check box to enable you to page through a document by clicking the mouse. [6] X Research source"
    },
    {
      "title": "Select the Ignore all transitions check box to remove transition effects from presentations that you view in Full Screen view.",
      "content": "Select the Ignore all transitions check box to remove transition effects from presentations that you view in Full Screen view."
    },
    {
      "title": "To specify a default transition effect to display when you page through a document, select a transition effect from the Default transition drop-down list.",
      "content": "To specify a default transition effect to display when you page through a document, select a transition effect from the Default transition drop-down list. [7] X Research source"
    },
    {
      "title": "To specify the behavior of the mouse in full screen view, select an option from the Mouse cursor drop-down list.",
      "content": "To specify the behavior of the mouse in full screen view, select an option from the Mouse cursor drop-down list."
    },
    {
      "title": "Select a background color for the screen from the Background color fly-out menu.",
      "content": "Select a background color for the screen from the Background color fly-out menu. The background color is used to color the empty area of the screen, when a page of a document is not large enough to cover the entire screen."
    },
    {
      "title": "Click OK to close the Preferences dialog box.",
      "content": "Click OK to close the Preferences dialog box. The preferences you have specified will apply to all PDF documents that you view in full screen view. [8] X Research source"
    }
  ]
}