{
  "url": "https://www.wikihow.com/Take-a-Stool-Sample",
  "title": "How to Take a Stool Sample with a Stool Collection Kit",
  "steps": [
    {
      "title": "Avoid taking medicine that will affect the sample.",
      "content": "Avoid taking medicine that will affect the sample. This includes anything that might soften your stools, such as Pepto Bismol, Maalox, mineral oil, antacids and Kaopectate. Also, if you have had a Barium Swallow, a metallic compound used to see abnormalities in the esophagus and stomach during an x-ray, postpone taking the stool sample and let your doctor know. [1] X Research source Tell your doctor what medicine you’re on and what you’ve taken recently before collecting your stool sample. This will provide them with a better understanding of any test results. [2] X Research source Prokupek, Dale. Personal interview. 16 April 2020."
    },
    {
      "title": "Get a stool sample kit from your doctor.",
      "content": "Get a stool sample kit from your doctor. Your doctor will provide you with the necessary equipment for collecting your stool sample, including a container for storing the sample. Ask about the procedure and if you can receive a “hat” to help catch and collect your stool. Follow your doctor's instructions and read any directions that come with your equipment carefully. [3] X Research source"
    },
    {
      "title": "Attach a “hat” to your toilet seat.",
      "content": "Attach a “hat” to your toilet seat. The hat is a plastic device that looks like, well, a hat. It’s used to catch the feces so that it does not come into contact with toilet water. To put the hat in place, lift up the toilet seat, place the hat over the bowl, and then close the toilet seat again. Position yourself on top of the portion of the bowl covered by the hat. [4] X Research source Keep in mind that toilet water, urine, paper, and soap can all ruin the stool sample, so it’s important to use a collection device on top of your toilet. Using a hat is the best way to avoid any contamination in your sample. However, if your doctor didn’t provide you with one, there are some alternatives that we’ve listed below."
    },
    {
      "title": "Cover your toilet bowl with plastic wrap if you don’t have a hat.",
      "content": "Cover your toilet bowl with plastic wrap if you don’t have a hat. To use plastic wrap, lift up the toilet seat and then place the plastic wrap across the toilet bowl. Close the toilet seat on the plastic wrap to help secure it. [5] X Research source Tape the plastic wrap to the side of the bowl for additional security. Before you defecate, push down on the plastic to create a small dip in the plastic where the sample will collect. [6] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source"
    },
    {
      "title": "Lay a sheet of newspaper across your toilet bowl as a last resort.",
      "content": "Lay a sheet of newspaper across your toilet bowl as a last resort. If you don’t have a hat or plastic wrap, newspaper will work in a pinch. To use a piece of newspaper, lift up the toilet seat and place the newspaper across the toilet bowl, then close the toilet seat to secure it. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Tape the newspaper to the side of the bowl to hold it in place. Push down on the center of the paper to create a place for the sample to settle."
    },
    {
      "title": "Defecate into the collection device.",
      "content": "Defecate into the collection device. Sit on the toilet and go to the bathroom like you normally would. Be careful that all of the sample is collected in the collection device and does not come into contact with the toilet water. [8] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source Don’t mix any toilet paper or urine in with the sample."
    },
    {
      "title": "Deposit the sample into the container with the provided spoon.",
      "content": "Deposit the sample into the container with the provided spoon. Find the wooden spoon or small shovel-like instrument in your stool sample kit. Use the shovel to scoop a small bit of stool into the container. Try to take some stool from each end and from the middle. [9] X Research source The size of the sample will vary somewhat with the test. Sometimes your doctor will give you a container with a red line and liquid on the inside. Put in enough stool to raise the liquid to the level of the red line. If not, aim for a sample approximately the size of a grape. If you don’t have enough of a sample to fill up your container to the red line, wait until you need to defecate again and then collect more."
    },
    {
      "title": "Dispose of your collection device.",
      "content": "Dispose of your collection device. Flip over the contents of the hat or plastic wrap into the toilet. Flush away the stool and deposit the hat or plastic wrap and any other garbage into a trash bag. Tie the trash bag in a knot and throw the trash away in a garbage can outside. [10] X Research source Do not flush the hat or plastic wrap, since that could clog your toilet."
    },
    {
      "title": "Refrigerate the sample.",
      "content": "Refrigerate the sample. Place the stool sample in a sealed bag. If you cannot return it to your doctor’s office immediately, store the sample in the fridge. Label it with your name, date, and time of collection. For some tests, stool samples need to be stored at room temperature. If you aren’t sure, ask your doctor or check the instructions inside of your stool sample kit."
    },
    {
      "title": "Return the samples to your doctor as soon as possible.",
      "content": "Return the samples to your doctor as soon as possible. Try your best to deliver the sample within 24 hours. The bacteria in your stool will grow and change. Usually, your doctor will want the sample back within 2 hours to get an accurate result. [11] X Research source Follow up with your doctor to get the results of your stool sample. Typically, you will get your results in 3 to 4 days. [12] X Research source"
    }
  ]
}