{
  "url": "https://www.wikihow.com/Talk-to-a-Dog",
  "title": "How to Talk to a Dog",
  "steps": [
    {
      "title": "Keep calm and stay relaxed.",
      "content": "Keep calm and stay relaxed. If you seem tense or agitated, your dog will take notice and will be much more likely to ignore your commands. Don’t stomp around or seem mad when you’re around your pet or it may get stressed out. You should also refrain from being anxious or overly energetic or it may be hard for your dog to calm down and listen. [1] X Research source If you need to calm down, you can do deep breathing exercises or meditate . Take a big, deep yawn to help calm your dog down if it’s excited or nervous."
    },
    {
      "title": "Train your dog to look at you.",
      "content": "Train your dog to look at you. Say your dog’s name and look into its eyes when it looks at you. If your dog doesn't instinctively look at you when you call out its name, trace a line between its eyes and your eyes using your finger. The point of this exercise is to get your dog to pay attention to you when you call its name. Don't stare into your dog's eyes for too long because it could be interpreted as a sign of aggression. [2] X Research source You can draw the dog’s attention by holding a treat in the hand you’re using to signal the looking behavior. Show the dog the treat, then move it from in front of the dog's nose up to the bridge of your own nose. You may have to repeat this process 5-10 times until your dog understands. Stay consistent and don’t repeat the dog’s name more than once or it will get used to ignoring you."
    },
    {
      "title": "Praise the dog in an upbeat voice once it makes eye contact.",
      "content": "Praise the dog in an upbeat voice once it makes eye contact. Immediately give your dog a treat and praise after it makes eye contact with you. This will train it to look at you when you call out its name, which will make it much easier to issue commands. [3] X Research source Once your dog learns to look at you, you can stop giving it treats every time. If a dog doesn’t pay attention to you while you’re talking, it won’t pay attention to the commands that you give it."
    },
    {
      "title": "Teach your dog how to sit.",
      "content": "Teach your dog how to sit. Teaching your dog to sit is one of the most important commands to teach it because it forces the dog to stop and pay attention to you. Say \"sit\" and wait for your dog to sit. If it does, reward it with a treat. If your dog isn’t naturally sitting, hold a treat behind the dog's head. This will force the dog to look behind itself and it will naturally sit down. [4] X Research source Immediately after the dog sits, make sure to reward it with praise or treats to reinforce the command. Once your dog learns to sit, you can train it to perform other commands."
    },
    {
      "title": "Say your dog’s name before vocalizing a command.",
      "content": "Say your dog’s name before vocalizing a command. Saying your dog’s name will get its attention and will cause it to look in your direction. Start off all commands with its name to establish a pattern that they can follow in the future. [5] X Research source"
    },
    {
      "title": "Stay consistent with your commands and don’t repeat yourself.",
      "content": "Stay consistent with your commands and don’t repeat yourself. Using different words for the same command will be confusing for your pooch. Use the same command every time when you want your dog to do something. [6] X Research source For instance, if you use the command “come” to have your dog come to you, don’t switch up your phrase and say “get over here,” or the dog may not understand. If you say “down” to command your dog to lie down , don’t use “down” when you want the dog to get off the furniture."
    },
    {
      "title": "Keep your commands short and simple.",
      "content": "Keep your commands short and simple. Your commands should be small, one-word increments that your dog can learn and understand. Use words like “stay,” “come,” and “sit.” These words have a distinct sound and won’t be confusing for your dog. [7] X Research source On average, dogs can learn up to 150 words but won’t be able to understand sentences or phrases. [8] X Research source For instance, if you tell your dog to “come and sit down” they may get confused and will not know what to do. Other commands include “ heel ” and “give.”"
    },
    {
      "title": "Pat the ground to tell your dog it’s time to play.",
      "content": "Pat the ground to tell your dog it’s time to play. Get down on all fours and hit the ground with your palms to let your dog know it’s time to play. This will get it into a fun mood and is a great way you can communicate with your dog using your body language. [9] X Research source If your dog doesn't understand that it's playtime, you can grab a toy to reinforce the message."
    },
    {
      "title": "Listen to the pitch of your dog’s bark.",
      "content": "Listen to the pitch of your dog’s bark. If your dog does a long, low-pitched bark, it likely means that they feel threatened or nervous. If the dog makes a short, high-pitched barking noise, it means that they are excited and happy to see you. Pay attention to your dog's bark to determine what mood it's in. [10] X Research source"
    },
    {
      "title": "Pay attention to the dog's eyes.",
      "content": "Pay attention to the dog's eyes. A dog will open its eyes wide when its feeling stressed or fearful. On the other hand, relaxed dogs will often squint and show little if any white in their eyes. Dilated pupils may also be a sign that the dog feels threatened or stressed. [11] X Research source"
    },
    {
      "title": "Examine the dog's body language and tail.",
      "content": "Examine the dog's body language and tail. When a dog is in a playful mood it will bounce around and have exaggerated movements and facial expressions. An excited dog will typically wag its tail in a back and forth motion. On the other hand, an aggressive dog will stand up tall and look tense, with most of its weight distributed on all 4 legs or leaning slightly on its front legs. [12] X Research source A fearful dog will put its tail in between its legs and will often lean back, tremble, or roll on its side. Aggressive dogs may also wrinkle their muzzle or growl."
    }
  ]
}