{
  "url": "https://www.wikihow.com/Win-at-Monopoly",
  "title": "How Do You Win Monopoly? A Complete Strategy Guide",
  "steps": [
    {
      "title": "Owning properties means you can charge rent sooner.",
      "content": "Owning properties means you can charge rent sooner. As soon as you start playing Monopoly , try to buy up any property spaces that you land on and can afford. That way, your opponents don’t have a chance to buy them, and they have to pay you money if they land on the space. [1] X Research source Avoid saving your money or waiting until you've landed on Boardwalk to buy properties because it’ll put you at a disadvantage."
    },
    {
      "title": "The orange and red properties are landed on the most.",
      "content": "The orange and red properties are landed on the most. Jail is the most landed-on space, so many players will land on the orange properties (St. James Place, NY Avenue, and Tennessee Ave.) and red properties (Illinois Ave, Kentucky Ave, and Indiana Ave) on their next roll. Try to get these properties if you’re able to force players to pay you rent and spend their money. [2] X Research source Illinois Avenue is the most common property to land on during a game of Monopoly."
    },
    {
      "title": "Auctions make getting properties easier even if you don’t land on them.",
      "content": "Auctions make getting properties easier even if you don’t land on them. If a player doesn’t want to buy an unowned property, then immediately start an auction to sell it. Anyone, including the person who landed on the space, can bid any amount for the property, and whoever bids the highest wins it. Try to get into the auction early with a low bid to see if you win it. Even if another player bids against you, you can drive up the price and make them spend more money than they wanted. [3] X Research source If you see an opponent working towards a particular monopoly, take any opportunity that you get to buy the properties they want. If multiple players already own a property of the same color, they're already blocking each other. Turn your attention to other properties on the board instead."
    },
    {
      "title": "A monopoly lets you charge double the rent on those properties.",
      "content": "A monopoly lets you charge double the rent on those properties. Owning all the properties of the same color creates a monopoly, and it can help you take more money from other players. Try not to leave open spaces in a color group for others to buy if you’re able to. If no other player owns property in a color group, then it’s a good strategy to purchase it. When you have a monopoly, you also have the chance to build houses and hotels to increase rent even more. Holding a monopoly also greatly enhances your bargaining power during property trades made at later times in the game. While Mediterranean Avenue and Baltic Avenue are cheap, they are the least likely to land on because they’re so close to Go. It doesn’t hurt to get these properties, but try to prioritize the other monopolies between the Jail and Go to Jail spaces."
    },
    {
      "title": "Railroads are a good investment if you own all of them.",
      "content": "Railroads are a good investment if you own all of them. The railroad spaces are in the middle space on each side of the board, and their rent charge goes up if you own multiple. While your main focus should be on getting properties, pick up the railroads if they’re unowned when you land on their spaces for a little extra income. [4] X Research source If you see another player already going for all the railroads, then don’t be afraid to purchase one to block them from having a railroad monopoly. You can also trade it later in the game to get more money from a player who wants it."
    },
    {
      "title": "Utility spaces are rarely landed on and not worth the price.",
      "content": "Utility spaces are rarely landed on and not worth the price. Because there are only 2 Utility spaces on the board, there's only a slim chance that other players are going to land on them. If you land on these spaces, it’s usually a smarter strategy to save your money for buying other properties or building on the ones you own."
    },
    {
      "title": "Trading can be a great way to gain or sell properties for cash.",
      "content": "Trading can be a great way to gain or sell properties for cash. If you see that your opponent has a property that you need to create a monopoly, look at what you have to offer them. You can try trading them for cash if they’re willing to sell it to you, or you can offer them a property that they need for a weaker monopoly on the board. [5] X Research source Before you make a deal, decide whether or not it will be advantageous and earn you more money in the long run of the game. For example, it may be worth trading a purple property for an orange property if it helps you complete the orange Monopoly."
    },
    {
      "title": "The rent increases drastically after building the third house.",
      "content": "The rent increases drastically after building the third house. Start building houses as soon as you get a monopoly because they charge more rent for the other players. As you add the third house to a property, the rent jumps in price by a lot more than if you only had 1 or 2 houses, which can get you a lot of extra income. [6] X Research source Make sure to save some money for expenses such as rent on other properties, utilities, and luxury tax. If possible, wait until you pass the part of the board where your opponents don’t have as many pieces to build Remember that you have to build houses on a monopoly evenly, meaning that all the properties must have 1 house before you can add a second or third one."
    },
    {
      "title": "Building houses on your properties stops other players from taking them.",
      "content": "Building houses on your properties stops other players from taking them. There are only 32 houses in a game of Monopoly, so hoarding all of them on your properties prevents other players from building and increasing their rent. While switching to hotels will increase the rent prices, you give the houses back to your opponent to use. [7] X Research source If you’re near the end of the game and the cost of rent from a hotel could cause a player to go bankrupt, then it’s okay to upgrade your houses."
    },
    {
      "title": "Increasing rent suddenly puts pressure on other players.",
      "content": "Increasing rent suddenly puts pressure on other players. You’re allowed to build houses and hotels at any point during the game, even if it’s not your turn. If you notice your opponent is near one of your monopolies on the board, then quickly place some houses down so they have to pay a higher price than they were expecting. [8] X Research source"
    },
    {
      "title": "Mortgaging weaker properties gives you instant cash to spend.",
      "content": "Mortgaging weaker properties gives you instant cash to spend. Mortgaging allows you to get a big influx of money that you can use right away. If you see that your opponents are low on money and they’re near monopolies you own, mortgage one of your other properties to get some building money and add houses. That way, your opponent has to pay more rent and will go bankrupt sooner. [9] X Research source Keep in mind the following when mortgaging your property: Mortgage single properties that you own first. Don't mortgage a property from a group where you own 2 or more properties unless it's absolutely necessary. Keep in mind that mortgaged properties don’t charge rent, so players can land on those places for free. You can always pay the mortgage cost plus 10% to rebuy the properties again."
    },
    {
      "title": "Sitting in Jail keeps you from paying rent on expensive properties.",
      "content": "Sitting in Jail keeps you from paying rent on expensive properties. If you land in Jail early in the game, use a Get Out of Jail Free card or pay a $50 fine so you can keep moving around the board and buying properties. Once most of the properties are owned and built later in the game, waiting in the Jail space keeps you from spending money. Simply roll the dice and stay in Jail until you roll doubles or until you’ve paid the fine after 3 turns. [10] X Research source While you’re in Jail, you’re still able to collect rent on the properties you own, so you can still get paid."
    },
    {
      "title": "Players will have to mortgage or sell properties to have enough money.",
      "content": "Players will have to mortgage or sell properties to have enough money. Some players may try to offer properties as a trade to cover their rent, but be strict when you ask for cash. This forces players to sell buildings or mortgage their properties, which stops them from collecting as much money. [11] X Research source If players don’t have enough cash even after mortgaging properties, then they go bankrupt and lose the game."
    },
    {
      "title": "Knowing common dice rolls helps you predict where players will land.",
      "content": "Knowing common dice rolls helps you predict where players will land. Because you’re always rolling 2 dice, 7 is the most common roll on any given turn, and 2 and 12 are the least probable. Most of the time, it takes 5 or 6 dice rolls to circle the board once. Because 28 of the 40 spaces are property spaces, you will likely land on four of those 28 property spaces during a lap around the board. [12] X Research source You've got a 17% chance of rolling doubles on any given roll. You will likely roll a pair of doubles one out of every six rolls. During the average circuit around the board, you will maybe roll doubles once."
    },
    {
      "title": "Chance and Community Chest cards may force you to move or pay.",
      "content": "Chance and Community Chest cards may force you to move or pay. There are 16 Chance cards and 16 Community Chest cards, and each deck has 2 spaces on the board. While these cards aren’t major issues during the game, it’s still good to know what potential effects they have. [13] X Research source Chance cards: 10 Chance cards require you to move to a different space on the board, 2 cards reward you money, and 2 cards are penalties that charge money. There is also a card that takes away money from building owners and one Get Out of Jail Free card. Community Chest cards: 9 cards give you money, 3 cards take money away, and 2 move you somewhere else on the board. There is also one card that charges building owners and one Get Out of Jail Free card."
    }
  ]
}