{
  "url": "https://www.wikihow.com/Switch-to-Ubuntu",
  "title": "How to Switch to Ubuntu",
  "steps": [
    {
      "title": "Windows and Ubuntu software isn't cross-compatible.",
      "content": "Windows and Ubuntu software isn't cross-compatible. Before switching to Ubuntu, make sure you have replacements for all of the software you need that doesn't have an Ubuntu version available. If not, there are many alternatives available for the most common software."
    },
    {
      "title": "Use an external hard drive to copy over files or create a copy of your partitions.",
      "content": "Use an external hard drive to copy over files or create a copy of your partitions. Alternatively, use a flash drive, DVDs, or CDs to copy over files."
    },
    {
      "title": "Go to https://www.ubuntu.com and download the CD image.",
      "content": "Go to https://www.ubuntu.com and download the CD image. Do this by clicking on the Download Ubuntu button; here you can choose between the 32 and 64 bit versions, and will find instructions on how to burn them to a CD. The CD image is about 700 MB."
    },
    {
      "title": "This may involve either manually selecting the optical drive or changing the boot order in your BIOS, if simply inserting the CD and rebooting doesn't work.",
      "content": "This may involve either manually selecting the optical drive or changing the boot order in your BIOS, if simply inserting the CD and rebooting doesn't work. You can find detailed instructions on the Ubuntu Download Page. After a minute or two, you should see a windows that asks whether you want to try or install Ubuntu. Choose the 'Try Ubuntu' option, and in another minute, you should see the basic Ubuntu desktop.] You should have access to most of your hardware, including network, sound, and graphics. Some older video cards and Wi-Fi cards may have compatibility issues; in this case you might want to check the LinuxQuestions Hardware Compatibility List, as well as asking about your hardware on the [ https://ubuntuforums.org/ Ubuntu Forums"
    },
    {
      "title": "Double-click the Install icon on the desktop.",
      "content": "Double-click the Install icon on the desktop. The install program will prompt you for your language, location, and keyboard layout before you get to the hard-disk partitioning section. When Ubuntu asks for a time zone, and you do not see your city simply click on a city that is near/in your time zone (e.g. Vancouver, Canada instead of Seattle, United States). Partitioning your hard disk is the only step of the install process that has the potential to do serious harm. If you install to the wrong partition, you could accidentally nuke your Windows drive and all of its contents. That's why it is recommended to run a full backup before you start the install process. The safest way to install is to add a new hard drive or create free space on the existing drive. This is not always an option; you can re-size your partitions to free space using the sliders."
    },
    {
      "title": "If you wish, Ubuntu can bring over bookmarks, music, photos, and documents from your Windows partition.",
      "content": "If you wish, Ubuntu can bring over bookmarks, music, photos, and documents from your Windows partition. This only works if you chose to keep your Windows partition."
    },
    {
      "title": "You'll need to wait 20–40 minutes while the install completes.",
      "content": "You'll need to wait 20–40 minutes while the install completes. Once finished, reboot your PC and selecting the Ubuntu entry from the boot manager that was installed."
    }
  ]
}