{
  "url": "https://www.wikihow.com/Write-Dramatic-Monologue",
  "title": "How to Write Dramatic Monologue",
  "steps": [
    {
      "title": "Be aware of the purpose of a dramatic monologue.",
      "content": "Be aware of the purpose of a dramatic monologue. Unlike a typical monologue, a dramatic monologue should have an outpouring of feeling from the speaker. As well, it should advance the story or narrative by clarifying the speaker’s intentions, wants or beliefs, or altering the speaker’s relationship with the other characters. [2] X Research source A dramatic monologue usually occurs when a character is facing an extreme crisis, a dramatic moment in the plot, or a “do-or-die” situation where simple actions can no longer suitably convey the immense feeling or desire the character is dealing with. An effective dramatic monologue should express the goal, agenda, or backstory of the speaker. It can also try to enlist the support of other characters or the audience, or attempt to change the hearts and minds of the audience or the listener. A dramatic monologue can be used in theater, poetry and film."
    },
    {
      "title": "Understand the role of the dramatic monologue in theater.",
      "content": "Understand the role of the dramatic monologue in theater. A dramatic monologue in theater is an uninterrupted speech made by a character and is an expression of the character’s inner thoughts and feelings. [3] X Research source A monologue differs from a soliloquy [4] X Research source in that a soliloquy is literally a character talking to him/herself. A dramatic monologue has an implied audience, as the character will usually be speaking to another character in the monologue. You are likely familiar with the famous soliloquy in Shakespeare’s Hamlet, (“To be or not to be…”) but the play also has a number of dramatic monologues, including one by the ghost of Hamlet’s father. [5] X Research source Addressing Hamlet in the dramatic monologue, the ghost begins by identifying himself (“I am thy father's spirit”) before revealing to Hamlet that he was murdered by his brother, Hamlet’s uncle, and the crown was stolen from him: [6] X Research source The serpent that did sting thy father's life Now wears his crown. Thy uncle, Ay, that incestuous, that adulterous beast, With witchcraft of his wit, with traitorous gifts-- O wicked wit and gifts, that have the power So to seduce! -- won to his shameful lust The will of my most seeming-virtuous queen. Shakespeare uses a dramatic monologue to provide Hamlet's motivation to kill Claudius and to give Hamlet’s father an emotional presence in the play through a direct address to Hamlet and by extension, to the audience."
    },
    {
      "title": "Understand the role of a dramatic monologue in poetry.",
      "content": "Understand the role of a dramatic monologue in poetry. A dramatic monologue in poetry, also known as a personal poem, shares many characteristics with a theatrical monologue. There is an implied audience, there is no dialogue, and the poet speaks through an assumed voice, like a character. [7] X Research source The monologue is dramatic in that is is meant to be read to an audience. In poetry, a dramatic monologue allows the poet to express a point of view through a certain character. Robert Hayden’s Night, Death, Mississippi is a good example of a dramatic monologue in poetry, as the poem adopts the voice of an aging KKK member, listening to the sound of a lynching outside but too old to join the other KKK members. [8] X Research source With a stanza such as: Christ, it was better than hunting bear which don't know why you want him dead. Using the device of the dramatic monologue in the poem, Hayden is able to create powerful emotion through taking on the disturbing and violent voice of a character."
    },
    {
      "title": "Look at several examples of dramatic monologues.",
      "content": "Look at several examples of dramatic monologues. There's a wealth of great monologues in poetry, plays, novels, and film that can serve as models for your own dramatic monologue. It may be useful to look specifically at: Robert Browning's poem “My Last Duchess”. [9] X Research source Madame Ranevsky’s monologue in Chekhov’s The Cherry Orchard . [10] X Research source The Indianapolis monologue in Spielberg’s Jaws . [11] X Research source Jules’ shepherd monologue in Tarantino’s Pulp Fiction . [12] X Research source"
    },
    {
      "title": "Analyze a monologue.",
      "content": "Analyze a monologue. Try to do more than read it over and instead, consider how it is working from a craft perspective. You may ask questions such as: [13] X Research source To whom is the speaker addressing in the monologue? What does the speaker want from the addressee or receiver of the monologue? Why is the speaker performing the monologue at this point in the story? How does this monologue affect the overall plot and/or development of the speaker, as well as the other characters in the scene or in the story? What kind of language or description is the speaker using? What gives the speaker a unique or distinct voice? If we look at Jules’ shepherd monologue in Tarantino’s “Pulp Fiction” as an example [14] X Research source , the monologue occurs at the very end of the film, in the climax of a scene: the robbery of a diner. Jules: Well there's this passage I got memorized. Ezekiel 25:17. \"The path of the righteous man is beset on all sides by the inequities of the selfish and the tyranny of evil men. Blessed is he who, in the name of charity and good will, shepherds the weak through the valley of the darkness. For he is truly his brother's keeper and the finder of lost children. And I will strike down upon thee with great vengeance and furious anger those who attempt to poison and destroy my brothers. And you will know I am the Lord when I lay my vengeance upon you.\" The speaker is the character Jules Winnfield, a hit man played by Samuel L. Jackson. In previous scenes in the film, we are shown Jules and his partner, Vincent Vega (John Travolta) carrying out a hit on a group of college kids who stole money from their boss, Marsellus Wallace (Ving Rhames). During the hit, one of the kids shoots at Jules and Vincent, but, by some miracle, none of the bullets end up killing either men. Jules takes it as a sign from a higher power and during this dramatic monologue, explains that he is reconsidering his stance on killing others, or being “the tyranny of evil.” The dramatic monologue occurs at a key character moment for Jules, and the receiver of the monologue, a robber named “Honey Bunny”, becomes a stand in for all of the other people Jules has killed in the past. The monologue ends with Jules putting down his gun and allowing the robbers to leave unharmed, a major moment of character development. In terms of language use, Jules quotes a passage from the Bible, Ezekiel 25:17, which is a throwback to the earlier scene where he kills the college kids. Using Biblical language and then analyzing the more formal, poetic language of the Bible with curse words and casual slang like “my righteous ass” and “tryin’” instead of “trying”, Jules’ character expresses himself with a distinct tone and style in the monologue that is consistent with his speech and voice in previous scenes in the film."
    },
    {
      "title": "Consider how the dramatic monologue will serve your story.",
      "content": "Consider how the dramatic monologue will serve your story. Think about which character or characters’ development could be furthered in your story by a dramatic monologue. Though your main character or one of your principal characters will likely go through the most character development, or be changed or altered by a conflict or event in the story, they do not necessarily need to be the speaker in the dramatic monologue. For example, the ghost monologue in Hamlet is serving the overall story in two ways: it relays key information to the play’s protagonist (Hamlet), thereby setting him up to fulfill a revenge plot to get back at his murderous uncle [15] X Research source and also adds to the feeling of unnatural occurrences or not quite reality in the play. [16] X Research source So, though the ghost is not a major character, having the ghost as the speaker of the monologue still serves the overall story and furthers the action of the main character in the play. Comparatively, Jules’ monologue in “Pulp Fiction” serves to further character development in the story by allowing one of the main characters to express their emotions and explain the way his understanding of his work and of himself have evolved. The monologue illustrates the character’s progression from the beginning of the story to the end of the story and lets the viewer know a change or shift has occurred for that character."
    },
    {
      "title": "Determine where you are going to place the dramatic monologue in your story.",
      "content": "Determine where you are going to place the dramatic monologue in your story. Once you have identified the purpose of the dramatic monologue in your story (to relay information to the audience? to create dramatic tension? to signal a character shift or change?), you will need to figure out how it will fit into a scene. If it is a monologue that will show character development, you may want to place it towards the mid point or climax of the story or towards the end of the story. If it is a monologue that is going to spoken by a minor character to relay information to a main character or add to the theme or mood of the story, you may want to place it earlier in the action of the story. For example, the ghost monologue in Hamlet occurs early in the play, Act I, Scene 5. By the time the ghost appears, Shakespeare has already established Hamlet as a the main character as well as his unease or melancholy nature, and the “foul” or troubled state of the kingdom of Denmark. The monologue then moves the story forward as it causes Hamlet to take action, thereby furthering the overall plot. Comparably, Jules’ monologue takes place in the last scene of the film, and functions to show that Jules has changed or shifted. The previous scenes all served to illustrate Jules’ journey as a main character and prepares the audience for his moment of realization. The monologue resolves the conflict he struggled with throughout the rest of the film, so it is placed at the end of the film as a moment of resolution."
    },
    {
      "title": "Create a first draft.",
      "content": "Create a first draft. Remember that with a first draft, you are trying to get a feel for the character’s voice and the way they might express their desires or concerns. Don’t put pressure on yourself to create a perfect first attempt, as you will be rewriting, editing, and redrafting it. Remember to: [17] X Research source Use your character's voice. Keep in mind the language, description, and tone of that character. Focus on sensory details like taste, touch, sound, etc. to engage the audience’s empathy or emotion for the character by engaging their senses. [18] X Research source Use the present tense. This is happening now and should have a sense of urgency."
    },
    {
      "title": "Start with a compelling beginning sentence or phrase.",
      "content": "Start with a compelling beginning sentence or phrase. While it is ideal to have a hook beginning, a catchy line or phrase that will engage the viewer’s attention, make sure the monologue fits within the current scene or has enough build up to justify its presence in the scene. You could begin the scene with a short introduction to the speaker, such as in the ghost monologue: “I am thy father’s spirit.” You could then have the speaker and the other character(s) have a conversation or dialogue to build up the monologue, such as in the diner scene with Jules’ monologue, where Jules asks if the robber (Tim Roth) reads the Bible before launching into the monologue with a Biblical passage."
    },
    {
      "title": "Move into rising action or tension.",
      "content": "Move into rising action or tension. Create a build up to a reveal or explore the speaker’s motive or desire. It should be clear what the speaker is trying to communicate to the listener. In the ghost monologue, the ghost (speaker) starts a dialogue with Hamlet and over the course of the dialogue, the ghost says lines like \"Revenge his foul and most unnatural murder\". [19] X Research source Gradually, the ghost's motive for speaking to Hamlet becomes clearer. In Jules’ monologue, he recites a passage from the Bible that will frame his larger point about the “tyranny of evil”. The passage also has a double meaning as it was used by Jules in an earlier scene right before he killed the college kids. This is a callback to the previous scene but it places the same passage within a different moment in the character’s journey. The context for the passage has changed for Jules and as a result, it has also changed for the audience."
    },
    {
      "title": "Create a climax.",
      "content": "Create a climax. Just as in the story as a whole, the climax of the monologue should change the scope of the story and be a pivotal point for the speaker’s development or for the character listening to the speaker. In the ghost monologue, the climax occurs once the ghost has detailed how he was poisoned by his own brother, Hamlet’s uncle, and his crown and queen was stolen from him. This is a game changer for Hamlet (and by extension, the audience), as it then moves Hamlet to avenge his father’s death and also allows the audience to have sympathy for the wrongful death of Hamlet's father. In Jules’ monologue, the climax occurs when Jules notes that the listener (the robber) is “weak” and he is the “tyranny of evil” but, despite this evil, he is “tryin’ real hard to be the shepherd”. This climax indicates the robbers will likely live instead of die, and also illustrate the reason why Jules decides to give up his life as a hitman and be a “shepherd” rather than be an active part of the “tyranny of evil.”"
    },
    {
      "title": "Finish with a resolution.",
      "content": "Finish with a resolution. End the monologue with a moment of realization from the speaker and/or the listener and then let the larger story continue or end. The ghost monologue ends with a call to action for Hamlet to avenge his murder. In the rest of the scene, Hamlet acknowledges this new information about his murderous uncle and responds to the ghost’s call to vengeance by vowing to get even. At the end of Jules’ monologue, he punctuates his desire to be a “shepherd” rather than part of the “tyranny of evil” by cocking his gun and placing it on the table, thereby allowing the robbers to leave the scene unharmed."
    },
    {
      "title": "Place the monologue within the larger story or piece and consider how it works.",
      "content": "Place the monologue within the larger story or piece and consider how it works. Now that you feel you have a solid draft of the monologue, consider how it functions within the rest of the story. Ensure the monologue flows well within the larger story. There should be enough build up or dramatic tension in the moments before the monologue occurs to justify the need for a dramatic monologue. [20] X Research source The audience should be prepared, rather than surprised or confused, by the monologue."
    },
    {
      "title": "Read the monologue aloud to yourself.",
      "content": "Read the monologue aloud to yourself. Does the monologue sound natural? Does it sound like something the character would say? Check the timing of the monologue. Does it take too long to get started? Should it end sooner? What can be cut from the draft? Look for places where the monologue sounds redundant or the same point is stated in different ways."
    },
    {
      "title": "Read the monologue out loud to others.",
      "content": "Read the monologue out loud to others. Feedback from a live audience can help you identify issues or edits you may have overlooked. Ask your listeners if they understood the overall message or purpose of the monologue. If you are writing a dramatic monologue for a play or film, it may be useful to have two people act out the scene with the monologue. Have someone read the monologue back to you. Listening to someone else interpret your words is a great way to see if your message is clear, the character voice is believable, and there is enough detail in the monologue."
    },
    {
      "title": "Continue revising.",
      "content": "Continue revising. Many of the most celebrated monologues are the result of many, many drafts and revisions. Don’t be afraid to kill your darlings, which is a phrase in literature that means don’t be precious about removing words or terms that seem out of place or there for the sake of style, rather than substance. [21] X Research source"
    }
  ]
}