{
  "url": "https://www.wikihow.com/Win-His-Heart",
  "title": "How to Win His Heart",
  "steps": [
    {
      "title": "Be confident.",
      "content": "Be confident. The most important way you can attract the guy of your dreams is to be confident and content in your own self. You can do this by wearing a cute outfit, doing something new with your hair, trying a new makeup style, or simply just thinking positively, because confidence is one of the most attractive traits a person can possibly have and it will make you less anxious about failure, which makes it hard to take the leap and into a potential relationship. [1] X Research source Don't judge yourself or others harshly. When you focus on all your flaws that is all that you'll think you have to offer and when you focus on the flaws of others, you are making your own brain toxic with negative thoughts. Don't compare yourself to other people. Someone is always going to be more attractive than you, more successful than you, and have more romantic partners than you. Focus on the things that you have rather than the things that other people have. [2] X Research source"
    },
    {
      "title": "Smile.",
      "content": "Smile. If you want people to notice you, especially that guy of your dreams, you should send a little smile in his direction and cultivate a positive attitude. Even better make eye contact with your chosen sweetheart and give him a little smile. [3] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. It'll signal your interest in a non-threatening way and, perhaps, intrigue him."
    },
    {
      "title": "Place yourself in his path.",
      "content": "Place yourself in his path. Now this doesn't mean that you should go around stalking him wherever he goes, but if you know that he likes to frequent a particular coffee shop or book store, feel free to spend some time there and \"bump\" into him. [4] X Research source It'll give you a little chance to talk to one another without a bunch of people around like at a party. Don't do this all the time, or he'll think that you're stalking him. Once or twice is the ticket, before it becomes obvious what you're up to. (There is nothing wrong with straightforwardly asking him out, but if you're not feeling bold enough this is a good way to work up the nerve to winning him over)."
    },
    {
      "title": "Play it cool.",
      "content": "Play it cool. You don't want to be super overt and clingy about trying to win your guy's heart, because you won't come off very well. However, this doesn't mean that you need to hide your interest or pretend not to be interested. You simply want to make it so that you are interested but not overwhelming. [5] X Research source You could try dropping a compliment or two; something that isn't overwhelming (overwhelming would be \"you're the most gorgeous guy I've ever met\") like \"hey that shirt is really awesome\" or \"I really like your new haircut.\" Show that you have a life outside of thinking about him. When the two of you do talk, just casually mention some of the fun things you've done that week (even if it's things like the awesome book you read, or video game tournament you participated in, or the soccer game you won). It shows that you have interests and a life of your own. When you run into him, after chatting for a bit, say that you have to run to meet a friend or that you have to be somewhere. That way you'll come across as having things to do and people to see, rather than someone who is waiting around to bump into him."
    },
    {
      "title": "Make him laugh.",
      "content": "Make him laugh. Oftentimes the key to a person's heart is through their humor. The saying goes \"the couple that laughs together, stays together.\" If you get him laughing at things you're saying you'll make him enjoy your company more and want to be around you more often. [6] X Research source A good way to do this is to mention something that is slightly embarrassing or humbling that happened to you. Mention the time you mistook a stranger for your best friend and slapped them on the butt, or how on the way to the date you missed a step on the bus and fell out the door in front of everyone. It shows that you don't take yourself too seriously and that you can laugh at yourself. You don't need to belittle yourself or talk about how stupid you are. A confident person doesn't need to belittle themselves, because they know that they are awesome! And confidence is attractive! Reader Poll: We asked 882 wikiHow readers, and 63% of them agreed that playful banter is the type of teasing that’s the strongest indicator you have chemistry with a guy. [Take Poll]"
    },
    {
      "title": "Be nice to his friends.",
      "content": "Be nice to his friends. He will listen to his friends' advice about whether or not to date you, so you'll want to make sure that you're number one their list. This doesn't mean that you need to agree with everything they say or that you should let them walk all over you (if his friends are that bad, though, you should rethink the guy you're wanting to attract), but it does mean that you're nice to them. When you're out with him and his friends, really listen to what they say and show that you have interest in their interests. You don't have to pretend to be an expert in what they're talking about if you're not. Simply ask some questions and listen. Don't feel like you should sit on the sidelines when you're around him and his friends. Participate in activities and introduce them to things that you like and you think they might like. It'll show that you have respect for them and that you're interested in getting to know them better."
    },
    {
      "title": "Use the \"3 strikes and you're out\" rule.",
      "content": "Use the \"3 strikes and you're out\" rule. This rule allows you to avoid committing yourself to a courtship that is basically going nowhere, because who has the energy for that? It means that if you've given him opportunities to try to get to know you better and he hasn't jumped at the chance after 3 tries, then he's probably not worth further effort. If you think that maybe he is interested but simply shy, there is no reason that you shouldn't ask him out instead. That way, even if he does say \"no,\" you will have a firm answer and won't be left wondering. The reason this is a good rule to follow is that you don't really want to be after him like a lovesick, desperate puppy. If he hasn't shown interest after awhile, he's not going to, or he's only going to show interest in having sex with you because he knows that you're desperate (stay as far away from guys like that as you possibly can). Unless you're only interested in sex, you'll end up hurt by this arrangement. An example of this in action might be you meeting him at a party and chatting with him, then popping in by his favorite coffee shop and running into him there and then chatting with him in class later. If you've given him openings to ask you on a date (or even for coffee), and he hasn't gone for it after those 3 times, stop trying and move on."
    },
    {
      "title": "Have a successful first date.",
      "content": "Have a successful first date. Now that you've gotten past the flirting stage, you'll need to have that first date. A good way to win his heart is to have a successful first date that you both enjoy. It'll will make him want to spend more time with you. [7] X Research source Make sure that you have topics to talk about, because it can be awkward during a first date not to blurt out something that is more appropriate for a closer relationship (probably not a good time to go into your anxiety problems). Some conversation starters might be: what are your typical Sunday activities, what is a band or album that you loved, what was the last movie that you saw and what did you think about it, what is the funniest thing you've ever seen in public. Dress appropriately . This means that you wear something that you feel comfortable in, but which also suits the occasion. So if you're off to a 4-star restaurant, something a little fancier is in order (a dress, or nice slacks and a nice button-up or blouse). If you're going to a coffee shop, dress just a little nicer than your usual attire (button down instead of t-shirt, no ratty jeans, etc.). Remember that you want to be yourself for the date. You don't want your guy to be expecting you to be someone you're not further in the relationship. That's not fair to either of you. You don't have to bring all your quirks out into the open right away, but you shouldn't be hiding things."
    },
    {
      "title": "Pay attention to his interests.",
      "content": "Pay attention to his interests. A good way to let someone know that you're interested in them and care about them is to take an interest in their interests and in their opinions about things. [8] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. You don't have to understand those interests and you don't even necessarily have to enjoy them, but being interested enough to talk with your guy about them, will show him that you are interested in him. For example, if your guy is super into skiing and you're more the bookish type, that's okay! Make sure to ask him about his ski trips and even offer to go a few rounds yourself. Pick up on some of the terminology so that you're able to converse more freely. Make sure that he's also respecting and interested in your interests and hobbies. If he isn't, that's a pretty good sign that he's either a narcissist or not very committed to having a relationship with you."
    },
    {
      "title": "Don't take him for granted.",
      "content": "Don't take him for granted. There is nothing that makes someone feel good and cared about than by showing them that they are not being taken for granted. Find ways to demonstrate to him that you notice what he does for you and that you appreciate him in your life. Flat out saying \"I am so glad you're in my life\" is a good and easy way to make sure he knows that you value him. Do some little things that show you appreciate him. If you're crafty you could make him something (knit a hat, carve a special little box, paint a picture). Also, you could do something thoughtful for him, especially if he's having a really busy or difficult time. [9] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. Bring him some special cookies, or help him by editing his resume or essay, offer to drive his sister to the airport so he can get some extra studying in."
    },
    {
      "title": "Maintain some space.",
      "content": "Maintain some space. This step is important for both of you. You don't want to enter into a co-dependent, can't-breath-without-you kind of a relationship, as much as the movies make it look nice. Make sure that you're both getting some space from each other and from the relationship. Maintain your relationships with your friends. Hang out with them. Have sleepovers and movie watching parties that are just with your friends, no significant others allowed. [10] X Research source Pursue your hobbies and interests. Go on ski trips by yourself or with your family, go to knitting workshops, learn karate. This way, when the two of you are together again, you'll have so much to talk about!"
    },
    {
      "title": "Decide if he's truly worth it.",
      "content": "Decide if he's truly worth it. Maybe in the beginning he seemed like such a great guy, but it's a good idea to check in with the relationship before you start doing a bunch of stuff to win his heart. You want to make sure that his heart is actually what you want, or even if it's possible to win his heart. Obviously if he's emotionally, physically, or sexually abusive, you should get away now. If he isolates you from friends and family, if he demeans you or tears you down either in private or in front of people, if he manipulates you or forces you to have sex when you don't want to, if he says he'll kill himself if you ever leave him, any of these signs mean that you should get out. Some questions to ask yourself about your relationship: are the two of you open and honest with each other? Do you feel better with him, or do you feel like you're walking on eggshells? Does he respect you? Do you feel like you're the best version of your self when you're with him? Does he? You shouldn't ever feel like you need to \"fix him\" or \"make him better.\" You should be in a relationship with someone who doesn't need you to be their therapist or their mother."
    },
    {
      "title": "Tell him how you feel.",
      "content": "Tell him how you feel. Sometimes the absolute best way to get what you want in a guy is to tell him how you feel and ask him if he feels the same way. Often you can hint and hint for ages and do everything you're \"supposed\" to do and still you won't know whether you've won his heart. Be open and direct. Tell him that you really like him and that you want to see how he feels about you, or how he might feel about you in the future. [11] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. Be ready to hear the answer, even if it isn't one that you want to hear. He might not feel the same way about you that you feel about him and that's okay. Remember, it's his loss not yours."
    }
  ]
}