{
  "url": "https://www.wikihow.com/Survive-a-Doomsday-Event",
  "title": "How to Survive a Doomsday Event",
  "steps": [
    {
      "title": "Pack a bug out bag.",
      "content": "Pack a bug out bag. [1] X Research source A bug out bag is an essential piece of luggage that is packed and ready to go at a moment's notice. There are many helpful lists detailing what you should pack in your bag, depending on what type of situation you are preparing for. Things you should consider as all-around essentials include: A set of clothes. You want to pack light layers so that you can be dressed appropriately for all weather. Instead of packing a bunch of heavy clothes (sweaters, parkas, etc), try to pack light layers like a tank top, short sleeve, and long-sleeve t-shirt. Food and food preparation. It is suggested to have at least three days of prepared food packed and ready to go in a portable bug out bag. [2] X Research source This may include MRE (Meals Ready to Eat) or other non-perishable food items like protein bars, peanut butter, or canned vegetables. [3] X Research source You may also want to include simple cooking preparation gear such as a collapsible pot and a utility utensil set. Water. Include a collapsible water canteen, water filter, and at least three days worth of water. This should be about 3 liters (0.8 US gal). [4] X Research source Also include a water filter; modern water filters even come in the form of a survival straw. Portable shelter. This could be a simple sleeping bag, a bed roll, or a blanket. A tent may be more effective, but may be too heavy or large for a portable bag. First aid and/or medical kit. Pack medications that you know you will need for a pre-existing medical condition. [5] X Research source Pack other essentials like bandages, antiseptics, and gauze."
    },
    {
      "title": "Pack iodine tablets.",
      "content": "Pack iodine tablets. These tablets help stop the thyroid from absorbing radiation. This will be useful in the event of nuclear fallout. [6] X Research source"
    },
    {
      "title": "Pack sensibly.",
      "content": "Pack sensibly. Your bug out bag should be packed with mobility in mind. Prepare to have to carry and walk for a long period of time. While it is best to be prepared for what happens, it is also essential that you are able to carry your bag."
    },
    {
      "title": "Do your research on likely events.",
      "content": "Do your research on likely events. Some events are more likely than others. You can prepare for events like a house fire, flood, nuclear fallout, or government overthrow. These are “doomsday” events that can upset your livelihood. Always keep an eye on the weather and on current events. [8] X Research source offgridsurvival.com/mostlikelyshtfscenarios/ Use a police scanner to keep up to date on information in your area. You will be able to hear potential threats and how the police are responding to them. Use a battery operated weather radio to pay attention to the weather. A battery operated radio is important in case you lose power."
    },
    {
      "title": "Plan escape routes.",
      "content": "Plan escape routes. You should have multiple well-thought out escape routes detailing multiple situations. Have multiple options in case one is inaccessible. For example, know how you will escape your living quarters in case of a fire? How will you escape your town in case of an emergency? How will you escape if you cannot travel by car?"
    },
    {
      "title": "Learn how to stop panic attacks.",
      "content": "Learn how to stop panic attacks. Panic attacks occur when your brain is overcome with signals from bodily systems, such as the adrenal gland. These attacks are characterized by physical distress such as shortness of breath, fear, and vertigo. They can be brought on by stressful situations or a psychological trigger from a past event. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source To avoid panic attacks, try to stay away from smoking or caffeine. (You may be forced to do this in a doomsday scenario in any case.) Work on controlling your breathing and focusing on taking control of your body. Understand what triggers your panic attacks and try to acknowledge the stress. If you think through what makes you panic, you can work to mentally overcome or avoid the trigger."
    },
    {
      "title": "Control your breathing.",
      "content": "Control your breathing. Studies have shown that you can reduce stress by practicing deep breathing techniques. [9] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source To practice these techniques you must be in tune with your body. Try to practice deep breathing by focusing on deep breaths through your nose and out through your mouth. Try and relax further with each breath and develop a consistent breathing routine. Yoga is also a helpful way to practice healthy breathing techniques. There are many helpful tutorials online to teach you basic yoga techniques. Some basic poses that can help your breathing techniques include warrior pose and sun salutation."
    },
    {
      "title": "Learn how to redirect emotions.",
      "content": "Learn how to redirect emotions. Transference, or re-directing your emotions, is the conscious act of cognitively switching off or moving past strong emotion. This takes time and practice and may not be an easy skill to develop. [10] X Research source Learn to recognize your emotions first. This may seem difficult. Practice by writing down the strong emotions you feel and what is happening in your environment. This journal will help you to associate situations with emotions. Then, try to mentally stimulate another emotion. For example, if you know something triggers panic in you, try to embody a sense of calmness. Practicing this will help you do this automatically, although it may be difficult."
    },
    {
      "title": "Learn how to condition your brain to take control of your survival.",
      "content": "Learn how to condition your brain to take control of your survival. You never want to “space out” during a doomsday event. However, learning to disconnect from your emotions and your racing thoughts just might save your life. Learning emotional transference will help your brain more efficiently handle emotions. When you are put in a life-or-death situation, your brain is trying to save your life. Emotions and panic may hinder response time. Learning to let go of strong emotions may help your brain better protect your body."
    },
    {
      "title": "Go underground.",
      "content": "Go underground. If you are worried about the fall of civilization or a bombing, your best bet might be to seek shelter underground. [11] X Research source This might be a bunker, bomb shelter, or underground shelter. There are many companies that specialize in custom designing and producing these types of shelters."
    },
    {
      "title": "Stay hidden.",
      "content": "Stay hidden. History has shown that people panic during doomsday-like events like terrorist attacks or bombings. [12] X Research source If you want to keep yourself and your family safe, you may want to consider hiding and staying as remote as possible. This type of surviving is often described as “living off the grid,” and is total isolation from society."
    },
    {
      "title": "Protect yourself from the elements.",
      "content": "Protect yourself from the elements. If you have to escape familiar surroundings, it is important to know how to find shelter from the elements. This includes: Knowing your local geography in case you have to camp out. Learn about dangerous elements such as land formations and wild animals. Knowing how to make a quick shelter. [13] X Research source Depending on your surroundings, you can use nature around you to build a sufficient shelter like a lean-to, that will help protect your body from the elements."
    },
    {
      "title": "Get fit.",
      "content": "Get fit. Your body is the most important tool in any situation. You should make sure it is in optimal shape, especially if preparing for a doomsday event. [14] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Eat healthy foods, such as vegetables, fruits, and proteins to keep your body healthy. You should also exercise to tone your muscles to prepare for long walks or running."
    },
    {
      "title": "Condition cardio.",
      "content": "Condition cardio. Keeping your body healthy by exercising is recommended by the Center for Disease Control. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You might have to flee quickly or walk long distances. To best prepare you body for this, you should condition it by doing cardio workouts. Cardio workouts help maximize your body's blood flow. There are many types of cardio workouts, examples include running, jogging, and rowing."
    },
    {
      "title": "Stay current on shots and medicines.",
      "content": "Stay current on shots and medicines. One way to stay healthy consistently is to stay current on your health. This includes keeping up-to-date doctors visits, including dentists, optometrists, and general health."
    },
    {
      "title": "Learn to defend yourself.",
      "content": "Learn to defend yourself. You never what situation you may find yourself in so it is important to know how to defend yourself from physical threats. [16] X Research source Find a local workshop in your area to learn self defense. Sometimes, local police departments will hold courses. Watch videos online - there are numerous videos that will walk you through basic self defense and training."
    },
    {
      "title": "Learn to be self-sufficient.",
      "content": "Learn to be self-sufficient. You can “homestead” now, which is living as self-sufficiently as possible. [17] X Research source This will help you in a survival situation as you will rely less on outside resources. Homesteading includes raising your own food, like vegetables and animals. It includes learning to use renewable energy resources, like solar, wind, geothermal, and water."
    },
    {
      "title": "Grow your own food.",
      "content": "Grow your own food. Learn how to cultivate your own food from seed so that you are able to grow your own sustenance for long-term survival. This includes have a store of heirloom seeds. [18] X Research source These are non-genetically modified seeds that can be grown and reproduced without modifying them. Learn to cultivate what grows best in your agricultural zone. For example, corn does not grow best in rocky soil. Learn your soil and climate conditions. Government websites (like the USDA) often have a website dedicated to showing local plant hardiness. [19] X Research source"
    },
    {
      "title": "Learn how to live “off the grid.”",
      "content": "Learn how to live “off the grid.” [20] X Research source While you can, prepare your home for off-the-grid living. This includes: Power generation -- this can be retrofitted into your original home's architecture with things like solar panels, generators, wind power, or geothermal power. Heat generation -- this can be done through a wood burning stove or passive solar gain. Food generation -- this can be accomplished through raising backyard chickens or having a backyard garden. Water collection -- water can be collected through rain barrels or a well. Waste collection -- this can be fixed through a septic system or compost toilets."
    },
    {
      "title": "Learn what plants are edible.",
      "content": "Learn what plants are edible. Learning your local ecology can be a huge benefit to surviving. Nature produces many wild-growing medicines and foods in the forms of plants. Learn which plants in your area are good for food and medicine. [21] X Research source"
    },
    {
      "title": "Learn essential, but often over-looked, home building skills.",
      "content": "Learn essential, but often over-looked, home building skills. Ultimately, you are responsible for your own survival. Learn skills that will help make life bearable like basic sewing, cooking, and medical attention."
    }
  ]
}