{
  "url": "https://www.wikihow.com/Write-a-Condolence-Letter",
  "title": "How to Write a Condolence Letter",
  "steps": [
    {
      "title": "Find an appropriate card.",
      "content": "Find an appropriate card. Every store that sells greeting cards (grocery stores, drug stores, or gift shops) will likely have a section for sympathy cards. Look in this section first. Pick out a card you think the recipient would appreciate the most. Cards are often organized by how the recipient is related to the deceased. For example, if the recipient’s mother has died, look for cards labeled “Sympathy-Mother.” You do not have to pick out a card that specifically mentions a mother on it; however, you should make sure it doesn’t mention another relative. Read the message on the front and inside of the card to determine if it is appropriate. Is it a card that you are comfortable sending and that you think the recipient would appreciate? For example, if one or both of you is not religious, you may want to avoid the cards with religious overtones. When in doubt, a simple sympathy card that expresses your condolences and wishes for peace and comfort is just fine."
    },
    {
      "title": "Consider writing on a blank card.",
      "content": "Consider writing on a blank card. You might not find a sympathy card that you like or you feel is appropriate for the recipient. You may find the language on the card to be too flowery or religious or not appropriate to the situation. For example, if the recipient had a bad relationship with her deceased father, it might be hard to find a card that acknowledges the complicated feelings around her loss. In that case, it may be better to write your letter on a blank card. Most stores sell a wide variety of blank cards with different pictures on the front. Make sure you select a card with an appropriate picture for a condolence letter, like a nature scene or flowers. Avoid cards with lighthearted pictures, like those with animals or babies."
    },
    {
      "title": "Write your letter on nice paper.",
      "content": "Write your letter on nice paper. If you don’t have time to buy a card or don’t want to, you can write a letter. You can use stationery (letter-writing paper, often with designs on it) or some higher-quality printer or resume paper. Do not rip something out of a notebook or use the scratch paper you write reminders to yourself on. You want to show the recipient that you took some time into writing the letter, and the paper you use helps convey that thoughtfulness. You can use blank notecards you may keep for thank you notes (as long as they don’t say “thank you” on them)."
    },
    {
      "title": "Write with a pen.",
      "content": "Write with a pen. Get a pen you like to write with and that makes your handwriting look good. Be careful that the ink doesn’t smear. Be careful if using markers. Some fine-point markers are okay, but thicker markers may bleed, making the letter harder to read. Do not write in pencil, as pencil has a tendency to fade and rub away. Make sure you write neatly. Print if that makes your writing more legible. You want the recipient to be able to read your thoughts. You can type out your letter if you prefer (or if your handwriting is illegible), but this is less personal. If you go this route, make sure you at least sign your name, and maybe add a brief, handwritten sentence or two at the bottom of the letter."
    },
    {
      "title": "Start with your message of sympathy.",
      "content": "Start with your message of sympathy. This is not a time to write “How are you?” or “I was at the grocery store today and figured I’d pick up a card.” Begin with your condolences. Acknowledge how the recipient was related or connected to the person. For example, you could write, “Dear Lucy, I was so sorry to hear about the loss of your grandpa” or “Carlos, I am sending you my deepest condolences on the passing of your best friend.” It is not usually appropriate to indicate the manner of the deceased’s passing. You do not want to say, “I am so sorry to hear that your aunt died of cancer.” The recipient knows how the person died. This is especially true in cases of murder, suicide, or accidents. In this case, you could acknowledge the magnitude of the loss as “tragic” or “sudden.” If you are struggling to start the letter, you might look at some sample sympathy messages online to help."
    },
    {
      "title": "Share a memory.",
      "content": "Share a memory. If you knew the person who died, make sure you share a memory with the recipient. These stories will be precious to them. [1] X Research source For most people, having memories is part of the mourning process, and good memories can help someone kind of move through those stages of grief. If you do not have a memory to share, it is okay to skip this step. Do not feel like you need to recount a big story, or that if you only knew the person casually you have nothing to share. A simple story, or a recollection of how the person made you feel, will suffice. You can say, “I remember seeing your dad every morning on his way to work, always carrying the same leather briefcase.” It matters to the survivors of the deceased to know that their loved one made an impact on others, even in a small way. [2] X Research source Make sure the story you share is a pleasant memory. Do not write about the time you got into a fight, or how you always thought he was a jerk. As the saying goes, if you don’t have anything nice to say, don’t say it."
    },
    {
      "title": "Acknowledge importance.",
      "content": "Acknowledge importance. If you don’t have any stories to share of the deceased, you can acknowledge the impact the deceased had on the recipient’s life. This doesn’t have to be long, a sentence or two is fine. For example, you could say, “I remember the picture of your grandma you kept on your desk. I know she meant a lot to you.” You could also say, “You always laughed when you told stories about your brother. He must have been quite the character!” You can also state how much the deceased loved the recipient. You can say, \"I know your mother was always so proud of you over the years.\""
    },
    {
      "title": "Avoid platitudes.",
      "content": "Avoid platitudes. People want to try to make the grieving person feel better, and often say things meant to cheer the person up. These statements rarely do anything but annoy the bereaved. Avoid writing: “He is in a better place now.” [3] X Research source No, the better place is here, still alive, with his loved ones. “Heaven gained another angel” or “God needed her there more than we needed her here.” This can make the bereaved person feel like God is pretty unfair, taking an important person in their life away. “I know how you feel.” [4] X Research source Even if you have experienced an awful loss yourself, you still do not know how this individual feels about this particular person’s passing. Everyone’s grief is different. Avoid giving advice or sharing your own experience unless asked."
    },
    {
      "title": "Offer your support.",
      "content": "Offer your support. Let the person know how you will be there for them. Maybe you can be an emotional support and be a shoulder for them to cry on, or maybe you would be willing to help them out in a practical way. [5] X Research source It's important to make sure that that person knows that you're there for them and available for support. Offering support is important so the person doesn't feel isolated and alone, since humans strive for connection, especially in situations of loss. Never say “Let me know how I can help.” While it is well-intentioned, most people are not comfortable with reaching out for help. Take some of the burden off the bereaved and reach out to them instead. You could write, “I will call you next week to check in on you.” Remember that the recipient may not want to talk much while they are grieving, but you should still keep reaching out periodically so that they know you are there for them. If you live nearby, consider offering to bring a meal, or do a chore around the house if possible. If you are very close, you can offer to sleep over to help them at night. Try writing, “I would love to help you out around the house with anything you need done. I’ll call next week to see if you need anything.” If you don't live nearby, you can offer to hire a service to clean their house for them or a gardener to do yard work while they are grieving. It’s okay to skip this step if you are not particularly close to the recipient (for example, if this person is a work colleague or a friend’s parent)."
    },
    {
      "title": "Close with warm thoughts.",
      "content": "Close with warm thoughts. Let the recipient know that they, along with the rest of their family, will be in your thoughts (and prayers, if you are spiritual) during this difficult time. Sign the card with any closing you are comfortable with, like “Love,” “Sincerely,” or “Thinking of you.” You can end the letter with a note of optimism or positivity, such as \"While this is a difficult time, it will get better with time, and we are always here for you when you need it.\" Do not begin the letter this way, or it may seem as though you are minimizing their feelings. Make sure you sign or print your name legibly, so the recipient knows who sent it."
    },
    {
      "title": "Mail the letter promptly.",
      "content": "Mail the letter promptly. Let the recipient know you are thinking of them during a stressful time. It will mean a lot to them to know you are supporting them, particularly if you cannot attend the funeral. Mailing a letter late is better than not mailing it at all, however, and it is still thoughtful to send your condolences a month or two after the death."
    },
    {
      "title": "Find out the address on your own.",
      "content": "Find out the address on your own. Do not bother the recipient during this busy time with questions about their address or funeral arrangements. Get it from a mutual friend or through social media. If you cannot find the address, use the deceased’s obituary to find the funeral home making arrangements. You can send your letter there, and the funeral home will get it to the deceased’s family. If all else fails, you can always send an email or note through social media. Make this your last resort, however, as it is meaningful to the bereaved to get a handwritten note."
    },
    {
      "title": "Make a donation.",
      "content": "Make a donation. Consider donating to the family’s charity of choice, or sending a gift or flowers, to the recipient along with your letter. There is no obligation to do this, but it can be a nice touch. You will likely find the family's preferred charity listed in the obituary. Gifts of food are generally appreciated for funerals, where lots of people will likely be gathering together. But check to see what is needed first. [6] X Research source Supplies such as paper plates, towels, plastic eating utensils, tissues, and trash bags may be appreciated if they are hosting guests for the funeral."
    },
    {
      "title": "Deliver your letter in person.",
      "content": "Deliver your letter in person. If you can, make arrangements to attend the funeral service, or wake/viewing. Funerals are for the survivors, not the deceased, and it will matter tremendously to the person you care about that you made the effort to show up. There is usually a basket for cards at a wake or service. Do not feel like you need to talk to all of the family members. Just say hello to the person or people you know, say how sorry you are for your loss, and stay for a few minutes or as long as you like. It is okay if you can’t think of anything to say. Remember that a simple “I’m so sorry” is always best. Give the person a hug if you are comfortable."
    }
  ]
}