{
  "url": "https://www.wikihow.com/What-Can-You-Do-when-18",
  "title": "Happy 18th Birthday! 47 Things You Can Legally Do Once You Become an Adult",
  "steps": [
    {
      "title": "Participate in democracy by casting your vote in the next election.",
      "content": "Participate in democracy by casting your vote in the next election. You can pre-register to vote at 17 so that you’re good to go once you hit the legal voting age, or you can register at 18. Your reward for doing your civic duty? A sweet, sweet \"I Voted\" sticker. [1] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source Ohio, Indiana, New Mexico, and a few other states will allow 17-year-olds to vote in primary elections if they will be 18 by the general election. [2] X Research source"
    },
    {
      "title": "Celebrate 18 by (maybe) winning big in the lottery.",
      "content": "Celebrate 18 by (maybe) winning big in the lottery. While you can’t enter a casino until age 21, in most states, being 18 means you can buy a lotto card , bet on dogs and horses, and play bingo . Before you make plans to bet on the ponies or wipe the floor with Grandma at bingo for your 18th, check to make sure it’s legal in your state. A few states allow gambling before 18 (for example, Ohio permits 16-year-olds to gamble online). But some don’t permit it until 21, like Iowa, and a couple, like Utah, don’t allow it at all."
    },
    {
      "title": "Tattoos: the ultimate act of rebellion, now fully legal.",
      "content": "Tattoos: the ultimate act of rebellion, now fully legal. As an 18-year-old, you’re officially free to get a tattoo without parental approval. Start curating your collection of beautiful body art now, and pretty soon, you’ll be a walking gallery. [3] X Research source Remember, just because you can legally get Pee-wee Herman’s face tattooed overtop your own face, it doesn’t mean you should . Don't get a tattoo if you think you might regret it down the road."
    },
    {
      "title": "At 18, you no longer need anyone’s consent to pierce your belly button.",
      "content": "At 18, you no longer need anyone’s consent to pierce your belly button. Maybe you already got your ears pierced at Claire's with permission from your parents. But no matter the state, at 18, you can legally deck yourself out in piercings without anyone's permission. [4] X Research source"
    },
    {
      "title": "At 18, you’re old enough to fly the coop.",
      "content": "At 18, you’re old enough to fly the coop. As a legal adult, you can leave the nest whenever you want. Whether you’re buying your own home, moving into a college dorm, or settling into your first apartment, you’re no longer legally tethered to your parents once you turn 18. [5] X Research source If you plan on moving out once you’re 18, start preparing ahead of time. Go grocery shopping on your own and do your own laundry while you're still living in your parents’ home to get used to the independence."
    },
    {
      "title": "Do something truly exciting for your 18th: jump out of a plane.",
      "content": "Do something truly exciting for your 18th: jump out of a plane. At 18, you are now allowed to skydive —but you will have to pass an exam and sign a few liability waivers first. [6] X Research source"
    },
    {
      "title": "Celebrate 18 in a hotel.",
      "content": "Celebrate 18 in a hotel. Because minors cannot enter into contracts, most hotels do not allow anyone under 18 to reserve a room . But once you hit legal adulthood, you can travel freely. Room service, anyone?"
    },
    {
      "title": "Adults may apply to take home a furry friend.",
      "content": "Adults may apply to take home a furry friend. Taking care of a pet is a great responsibility—and that responsibility can be all yours once you’ve reached adulthood! You may have had a pet goldfish as a child, but adopting a cat or dog requires a bit more maturity, which is why many shelters require you to be 18 to adopt. [7] X Research source"
    },
    {
      "title": "Once you’re 18, you’re no longer excluded from ridesharing.",
      "content": "Once you’re 18, you’re no longer excluded from ridesharing. No more trudging to the store and wistfully sighing when a 40-year-old whizzes by on a scooter. While 16-year-olds can ride an electric scooter or bike with a parents’ permission, once you’re 18, it’s all you. [8] X Research source"
    },
    {
      "title": "You can’t get drunk, but you can get paid to help other people get drunk.",
      "content": "You can’t get drunk, but you can get paid to help other people get drunk. At 18, you can become a bartender . And depending on the state and the institution, 18-year-olds may be allowed to taste-test while studying the ins and outs of booze-making. [9] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source"
    },
    {
      "title": "Celebrate 18 with a glass of champagne—just not in the United States.",
      "content": "Celebrate 18 with a glass of champagne—just not in the United States. The legal drinking age in the United States is 21. But for many countries around the world, including France, Albania, Botswana, and Bulgaria, you can drink at 18. Imbibe responsibly, and never drink and drive! [10] X Research source"
    },
    {
      "title": "At 18, you can register for a passport.",
      "content": "At 18, you can register for a passport. While minors can get passports with parental consent, as an adult, you no longer need permission. So before you plan that trip to France, make sure you get your passport ! [11] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source"
    },
    {
      "title": "When you’re an adult, you may have sex with other adults.",
      "content": "When you’re an adult, you may have sex with other adults. In some states, the legal age of consent is 16 or 17, but by 18, no matter the state, you can legally consent to sleep with another adult. [12] X Research source Statutory rape laws vary by age and state. For instance, in Alabama, sex between a 12-year-old and a person under 16 may not be considered rape, while sex between a 12-year-old and anyone over 16 automatically is. [13] X Research source Refer to your specific state’s laws for more specific information. [14] X Research source"
    },
    {
      "title": "At 18, you can buy pornography.",
      "content": "At 18, you can buy pornography. There’s a reason they’re called “adult” videos. It is illegal to buy adult videos as a minor, but in most places, at 18, you are free to enjoy porn, from videos to vintage mags. [15] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source"
    },
    {
      "title": "If you’re not ready to commit to a purchase, you can still browse an adult store.",
      "content": "If you’re not ready to commit to a purchase, you can still browse an adult store. In most states, you cannot enter an adult store before you’ve reached adulthood. But at 18, you're finally free to see what the fuss is about. [16] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source"
    },
    {
      "title": "In most states, you can’t buy spray paint as a minor.",
      "content": "In most states, you can’t buy spray paint as a minor. But once you hit that milestone age, the world is your oyster. People use spray paint for practical purposes, such as painting old furniture or marking construction zones, but you may make wonderful art with spray paint. [17] X Research source"
    },
    {
      "title": "At 18, you’re deemed responsible enough to buy fireworks.",
      "content": "At 18, you’re deemed responsible enough to buy fireworks. Just don’t set them off in the house. Or all at once. Or near alcohol. And be respectful of pets and folks with PTSD, who might not appreciate the loud noises.... Maybe just use party poppers instead? [18] X Research source"
    },
    {
      "title": "Once you’re legal, you can buy a car.",
      "content": "Once you’re legal, you can buy a car . Technically, you can buy a car as a minor, but you can’t register it or purchase insurance until you come of age. Now that you’re 18, you can put what you earn at your new full-time job towards a shiny, new-to-you set of wheels. [19] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source"
    },
    {
      "title": "You can take the plunge into homeownership—or you can just rent.",
      "content": "You can take the plunge into homeownership—or you can just rent . Now that you’re an adult, you can legally sign a contract, and that includes a lease. Get the housewarming invitations ready, baby."
    },
    {
      "title": "Once you’re an adult, you can legally go by a different name.",
      "content": "Once you’re an adult, you can legally go by a different name. If you’ve always hated the name your parents gave you, now’s your chance to change it to something more “you.” Always wanted to go by your middle name? You can. Think the name “Sunflower” represents you better than your given name? You can take that name too. [20] X Research source Depending on your state, there may be rules about what you can change your name to. For instance, in New York, it is unlikely a petition to change your name to a well known person's name (like “Beyoncé Knowles”) would be approved. [21] X Research source"
    },
    {
      "title": "Not only can you book a room, you can host your own.",
      "content": "Not only can you book a room, you can host your own. Both AirBNB and Vrbo require hosts and vacationers to be 18. Take a trip for your milestone birthday, or, if you've got your own place, you can rent it out to vacationers. Have fun decorating!"
    },
    {
      "title": "At 18, you are free to serve your country without Mom and Dad’s OK.",
      "content": "At 18, you are free to serve your country without Mom and Dad’s OK. You can enlist at 17 with a parent’s consent. But once you’re a legal adult, you can join without their permission. [22] X Research source While enlisting in the military is optional, most men ages 18 to 25 must register with the Selective Service . [24] X Research source www.usa.gov/selective-service"
    },
    {
      "title": "Most states require you to attend school until you are 18.",
      "content": "Most states require you to attend school until you are 18. (In some states, it’s 16, and for Texas, it’s 19.) While you may graduate as a minor in some states, if you are in school as a legal adult, you may drop out or sign yourself in and out. [24] X Research source"
    },
    {
      "title": "Turning 18 means night-driving privileges.",
      "content": "Turning 18 means night-driving privileges. Depending on your state, before you turn 18, you may not be allowed to drive at night. Once you come of age, those restrictions are lifted. All states have some form of a Graduated Driver Licensing (GDL) system in place, with some offering full driving privileges to people at 16 or 17. Be sure to check your specific state’s laws. [25] X Research source For instance, Arkansas and Connecticut restrict driving at night for people under 18, while Idaho gives full driving privileges at 16, and Louisiana at 17. [26] X Research source"
    },
    {
      "title": "If you’ve found the one, shout it from the rooftops—and a courthouse.",
      "content": "If you’ve found the one, shout it from the rooftops—and a courthouse. At 18, you can get hitched without parental permission in any U.S. state. Most minors can tie the knot at 16 with parental consent—or even younger, in some states. [27] X Research source"
    },
    {
      "title": "Work full-time and get that paycheck!",
      "content": "Work full-time and get that paycheck! Once you turn 18, there are no longer rules forbidding you from working full-time. (You'll need some way to fund your tattoos.) [28] X Research source The above rule applies to non-agricultural work. Minors working in agriculture may be able to work full-time, depending on where you live. [29] X Trustworthy Source US Department of Labor Federal department responsible for promoting the wellbeing of workers Go to source For instance, in Arkansas, 16- and 17-year-olds working in agriculture may work 48 and 54 hours a week, respectively."
    },
    {
      "title": "At 18, you can legally take out a loan.",
      "content": "At 18, you can legally take out a loan. For many teens, this means car loans or college loans. Just like getting a credit card, taking out loans may help boost your credit score as long as you stay on top of payments. [30] X Research source You must have a job that pays you a salary that allows you to obtain a loan and have the capacity to incur debt. Otherwise, you’ll need to have a guarantor or some asset in your name (either movable or immovable) that you can use as collateral."
    },
    {
      "title": "Legal adults may open a bank account.",
      "content": "Legal adults may open a bank account. After all, you’ve got to have somewhere to put your lotto winnings. Your parents can open a checking and savings account in your name while you’re a minor, but once you’re 18, establishing your own bank account is a lot less of a hassle. [31] X Research source Once you’ve got your checking and savings accounts rolling, you can work on building your credit."
    },
    {
      "title": "Beef up your credit score with a shiny new credit card.",
      "content": "Beef up your credit score with a shiny new credit card. Your parents can list you as an authorized user on a shared credit card while you’re a minor, but you must wait until your 18th birthday to apply for your own credit card. Just make sure you stay on top of your payments! [32] X Research source You’ll have to provide proof of independent income until you’re 21. (Maybe now’s the time to apply for that full-time job….)"
    },
    {
      "title": "You’re now old enough to get become a truck driver.",
      "content": "You’re now old enough to get become a truck driver . Turning 18 not only means night-driving privileges. It also means you’re able to get a CDL, or Commercial Driving License. [33] X Research source While you can get your CDL at 18, until you turn 21, you are only allowed to drive commercially in your home state."
    },
    {
      "title": "You can become a homeowner.",
      "content": "You can become a homeowner . Being able to take out loans makes this a lot easier. Of course, most 18-year-olds are unlikely to be approved for a home loan, but you never know! If you’ve got the capital, you can make it work. (Isn’t that how it always goes?) [34] X Research source"
    },
    {
      "title": "The ability to sign a contract comes with the ability to invest in stock.",
      "content": "The ability to sign a contract comes with the ability to invest in stock. At 18, you’re a legal adult, and can therefore open your own brokerage account and invest in stock . Just be careful betting everything on one horse. [35] X Research source"
    },
    {
      "title": "Sue the pants off someone.",
      "content": "Sue the pants off someone. Because you can’t enter into contracts as a minor, you couldn’t sue anyone before you turned 18 without parental consent. Now there’s nothing standing in the way of getting back at anyone who’s wronged you—except for how wildly expensive it would probably be. [36] X Research source"
    },
    {
      "title": "At 18, you can become a parent.",
      "content": "At 18, you can become a parent. Depending on where you live, once you have reached the age of legal majority, you can legally adopt a child. Many states still require that you be at least 21 or even 25 to adopt, but a few will allow an 18-year-old to adopt a child. Some places will allow a minor to adopt a child, as long as the minor is the spouse of the child’s parent."
    },
    {
      "title": "Adopted individuals gain access to their adoption information at 18.",
      "content": "Adopted individuals gain access to their adoption information at 18. Adoption records are sealed until you reach adulthood. If you want to know more about your birth parents or even try to find them, you can apply for information once you turn 18. [37] X Research source"
    },
    {
      "title": "Now that you’re an adult, you make your own medical decisions.",
      "content": "Now that you’re an adult, you make your own medical decisions. An unaccompanied minor may receive care if the doctor feels it is an emergency situation. In order to receive non-urgent treatment without the consent of a parent, in most cases, you must be a legal adult. In some territories, such as Alabama, children are free to make their own medical decisions by 14. [38] X Research source"
    },
    {
      "title": "Give back for your birthday by becoming an organ donor.",
      "content": "Give back for your birthday by becoming an organ donor. While you can donate blood at 17 without a parent’s permission, organ donation is another story. [39] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source You must have the consent of a parental guardian to donate an organ before you have turned 18, but once you become a legal adult, you don’t need permission. [40] X Research source You can register as an organ donor on your license, or make an immediate impact by becoming a live organ donor. Organs such as kidneys, lungs, and part of your pancreas may be donated while you are alive. [41] X Research source"
    },
    {
      "title": "At 18, you’re in charge of your health, including vaccinations.",
      "content": "At 18, you’re in charge of your health, including vaccinations. Most places require parental consent to vaccinate minors. However, once you’re an adult, you become responsible for your own medical choices. [42] X Research source Nebraska requires parental consent until 19, while some cities, including Philadelphia and San Francisco, made special accommodations for Covid-19, allowing minors aged 12 and up to consent to their own Covid vaccines. [43] X Research source"
    },
    {
      "title": "Now that you're an adult, you can buy your own cough suppressants.",
      "content": "Now that you're an adult, you can buy your own cough suppressants. Minors can take cough medicine with the consent of parents. By legal adulthood, you are capable of purchasing your meds yourself without your parents' permission. [44] X Research source"
    },
    {
      "title": "Legal adults may pawn their belongings off.",
      "content": "Legal adults may pawn their belongings off. It doesn’t matter if you have a bank account, good credit, or income. As long as your item has some collateral value, a pawn shop will consider it. [45] X Research source Lots of people pawn jewelry or electronics, but feel free to think beyond that—people have pawned dinosaur eggs, buoys autographed by David Hasselhoff, and giant Mario figurines. [46] X Research source"
    },
    {
      "title": "It’s never too early to make your will.",
      "content": "It’s never too early to make your will. Not to be too morbid, but it’s always good to be prepared (especially if you're skydiving for your 18th). Once you reach adulthood, you can make your will to ensure your affairs are carried out just how you want after you’ve passed on. [47] X Research source"
    },
    {
      "title": "Play a role in our country’s justice system by participating in a jury.",
      "content": "Play a role in our country’s justice system by participating in a jury. Once you’re 18, you can be called to jury duty and do your civic duty. However, if you are a member of the armed forces on active duty, a firefighter or police officer, or a public officer in any federal, state, or local governments, you are excluded from jury duty, even if you want to participate. [48] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source"
    },
    {
      "title": "Shop wholesale with a Costco membership!",
      "content": "Shop wholesale with a Costco membership! You must be at least 18 to sign up for most wholesale club memberships, including Costco, Sam’s Club, and BJ’s. Stock your new apartment with an entire palette of Cap'n Crunch—or just go to the store for the free samples. [49] X Research source"
    },
    {
      "title": "You must be 18 to use a power-driven meat processing machine.",
      "content": "You must be 18 to use a power-driven meat processing machine. Many stores and restaurants employ minors, but you must be a legal adult to use a meat slicer or meat grinder. (That includes handling the individual pieces and parts of the machine!) [50] X Trustworthy Source US Department of Labor Federal department responsible for promoting the wellbeing of workers Go to source"
    },
    {
      "title": "If truck-driving isn’t for you, you can always become a realtor.",
      "content": "If truck-driving isn’t for you, you can always become a realtor. Even if you're still living at home, you can make money helping strangers find their dream house. The majority of U.S. states allow you to obtain your real estate agent license at 18. In a couple of states, 18 is still too young. You must be 19 in Alaska and Nebraska, for instance. [51] X Research source [52] X Research source"
    },
    {
      "title": "You can now begin a career as a notary public.",
      "content": "You can now begin a career as a notary public. As a notary public, you'll be in demand in multiple industries, including finance, medical, legal, tech, and more. Legal adulthood is one requirement for getting this position, but you must also pass an exam and background check. [53] X Research source"
    }
  ]
}