{
  "url": "https://www.wikihow.com/Toxica-Meaning",
  "title": "Toxica Meaning in Spanish Slang and Urban Culture",
  "steps": [
    {
      "title": "“Tóxica” is the Spanish word for “toxic,” and it's often used as slang for a toxic woman.",
      "content": "“Tóxica” is the Spanish word for “toxic,” and it's often used as slang for a toxic woman. Most nouns in Spanish are gendered, and “tóxica” specifically refers to a toxic female, while “tóxico” would denote a toxic male. A tóxica is typically a woman in a relationship who exhibits irrational and/or combative tendencies. Consider this a warning– you really won’t like a tóxica when she’s angry! Here’s an example of how to use tóxica in a sentence: Them: “She picked a fight with me because I refused to block all the girls I knew on social media.” You: “Wow. She really is a tóxica.”"
    },
    {
      "title": "Of Latin American descent.",
      "content": "Of Latin American descent. This is the first defining characteristic of a tóxica. If she has no cultural or genetic ties to Latin America, then she is plain-old-English toxic. However, if she is a Latina mami with a “spicy” attitude, she could be considered a tóxica. [1] X Research source"
    },
    {
      "title": "Jealous and possessive.",
      "content": "Jealous and possessive. Jealousy-fueled rages are often what we think of when we think of classic tóxica behavior. A true tóxica in a relationship will refuse to share her partner with anyone– coworkers, friends, and family included. That’s right, mom, your child belongs to her now, and any attempts at interference could be perceived as fighting words. Spoilers: it never ends well for the other person. [2] X Research source"
    },
    {
      "title": "Demanding.",
      "content": "Demanding. Tóxicas believe they can have their cake and eat it, too– along with a five-course meal, wine a-flowing, and don’t you dare forget her two dozen red roses! Tóxicas believe that it’s up to their spouse to make sure they get their way at all times. And if you fail to live up to a tóxica’s expectations, be afraid. Be very, very afraid."
    },
    {
      "title": "Fiery temper.",
      "content": "Fiery temper. Synonymous with many other stereotypes about Latina women, having a “fiery” personality and temper simply comes with the territory. This trait may express itself positively or negatively, as a tóxica is sure to feel the full spectrum of emotion. If you ask a tóxica whether she is a lover or fighter, her answer will be: “Both.”"
    },
    {
      "title": "There is a sense of mistrust in the relationship.",
      "content": "There is a sense of mistrust in the relationship. If your lady friend is always asking to go through your phone, share locations, or is constantly calling when you’re out to catch you in a lie– you might be in danger of dating a tóxica. Mistrust can come in many modern forms, and it’s important to identify how these incidents really make you feel. If you’re doing nothing wrong and still feel like you’re being punished, it might be time to reconsider the relationship."
    },
    {
      "title": "You feel as if you must walk on eggshells around her.",
      "content": "You feel as if you must walk on eggshells around her. If talking to your girlfriend feels like you’re treading carefully across a field of landmines, she could be a tóxica. Open and honest communication are the pillars of a healthy relationship, so being afraid to express yourself is a huge red flag. Ultimately, living in constant fear that you may trigger an episode of jealousy or anger is no way to live."
    },
    {
      "title": "Breathing the same air as another woman feels like an infidelity.",
      "content": "Breathing the same air as another woman feels like an infidelity. It’s not that she doesn’t trust you– she just doesn’t trust other women... or you. Female friends are a no-go, as is having any interactions with other women on social media. In fact, if you have to go on a trip without her, and the person on the flight next to you is a woman– you better move. Or: break-up with your tóxica, as asking her to change doesn’t often sound like a viable option."
    },
    {
      "title": "Your fights get loud.",
      "content": "Your fights get loud. If your neighbors start weighing in on your arguments, it’s not only time to move, but it’s very possible that your significant other is a tóxica. It’s no secret that Latinas are a passionate demographic and show it every chance they get-- most will tell you that it’s embedded in their DNA! Prone to expressing their feelings as loudly as possible in order to really get their points across, tóxicas are not likely to back down in the heat of the moment. Do try to de-escalate the situation but don’t underestimate your opponent. If a tóxica thinks she’s right– it's best not to disagree. Again, a potential course of action might be to cut ties with your tóxica , as these toxic behaviors have no place in healthy, loving relationships."
    },
    {
      "title": "Use it in an endearing or playful way within a healthy relationship.",
      "content": "Use it in an endearing or playful way within a healthy relationship. In the Latin American community, using nicknames to make fun of each other is simply the norm. Calling your significant other \"gordo\" or \"gorda\"-- the English equivalent being \"fatty\"-- is not at all unheard of, as long as it's done in a loving way. [3] X Research source \"Tóxica\" is no exception and can be used affectionately within the bounds of a healthy relationship. For example, if you catch your girlfriend using your phone, calling her a \"tóxica\" by implying that she's snooping through your messages is okay as long as no real boundary was crossed."
    },
    {
      "title": "Don't use it to be offensive.",
      "content": "Don't use it to be offensive. Unfortunately, the term \"tóxica\" isn't always used for good, and seriously accusing someone of being a tóxica outside of a healthy relationship can certainly take on very offensive connotations. The term can be even further demonized when used by the non-Latin American community, which has posed a problem in recent years due to its popularization on TikTok by non-Latinas assigning the hashtag it to characters they've made up for clicks. [4] X Research source"
    },
    {
      "title": "In short, do not use the term \"tóxica\" freely.",
      "content": "In short, do not use the term \"tóxica\" freely. If you must use it, do so only playfully within the boundaries of a healthy relationship. Otherwise, you might just be sticking your foot in your mouth."
    }
  ]
}