{
  "url": "https://www.wikihow.com/Teach-the-Sidestroke",
  "title": "How to Teach the Sidestroke",
  "steps": [
    {
      "title": "Have your students lie on the floor on their left side.",
      "content": "Have your students lie on the floor on their left side. Each student will eventually develop a side that they prefer – usually their dominant side – but when you’re teaching them the basics, have them start on the left. That way everyone is on the same page. [1] X Research source"
    },
    {
      "title": "Ask the students to extend their left arm above their head.",
      "content": "Ask the students to extend their left arm above their head. They should rest their head on their upper arm. Their palm should be facing down on the floor, since it will skim along the top of the water once they get into the pool. [2] X Research source"
    },
    {
      "title": "Have them use their right hand for balance.",
      "content": "Have them use their right hand for balance. With their left arms extended above their heads, your students will need a way to maintain balance. Have them place their right hands on the floor in front of their bodies, between their waist and chest. [3] X Research source"
    },
    {
      "title": "Ask them to bend their knees at a 90-degree angle.",
      "content": "Ask them to bend their knees at a 90-degree angle. Once their arms are in position, ask your students to pull the knees toward their chest, using their right hand for balance. Their thighs and calves should make a 90-degree angle. [4] X Research source"
    },
    {
      "title": "Have them kick their legs in opposite directions.",
      "content": "Have them kick their legs in opposite directions. Their top leg should kick to the front as their bottom leg kicks to the back. Their legs should extend to about a 45-degree angle. After that, have them return their legs to the starting position. [5] X Research source"
    },
    {
      "title": "Ask them to repeat the kick 4 times on each side.",
      "content": "Ask them to repeat the kick 4 times on each side. Once they’ve performed the full kick 4 times on their left side, have them flip over so they’re lying on their right side. Each student's right arm should be extended upwards, with their head resting on their upper right arm. Their left hand should be used to maintain balance. Then, they should repeat the kick. [6] X Research source"
    },
    {
      "title": "Ask your students to stand upright.",
      "content": "Ask your students to stand upright. Their arms should be hanging at their sides, with their palms facing their bodies. Their arms should be hanging loosely, not clasped to their bodies. [7] X Research source"
    },
    {
      "title": "Have them extend their left arm straight above their head.",
      "content": "Have them extend their left arm straight above their head. Their palm should be turned to the right. Ask them to rotate their heads slightly to the right as well. This will give them an idea of how their head should be positioned above the water. [8] X Research source"
    },
    {
      "title": "Have your students bend their arms at the elbows until their hands meet in the middle.",
      "content": "Have your students bend their arms at the elbows until their hands meet in the middle. Have your students bend their left arms at the elbow and bring their hands down to the chest, making a motion like they’re stroking the water. At the same time, ask them to bend their right arm at the elbow and bring their forearm up until both hands meet. [9] X Research source"
    },
    {
      "title": "Tell your students to return their arms their starting positions.",
      "content": "Tell your students to return their arms their starting positions. They should extend their left arms above their heads again, imagining that they’re gliding their hands forward in the water. At the same time, they should turn their right palm to face the floor, then straighten out their arm, imagining that they’re pushing water down. [10] X Research source"
    },
    {
      "title": "Ask them to repeat the motions 4 times on each side.",
      "content": "Ask them to repeat the motions 4 times on each side. Once they’ve performed the arm movements properly with their left arm up 4 times, ask them to switch sides. Their right arm should be above their head, with their palm and head turned to the left. Their right arm comes down to meet their left arm as it comes up. [11] X Research source"
    },
    {
      "title": "Have students push off from the side of the pool.",
      "content": "Have students push off from the side of the pool. The sidestroke is a stroke that relies on gliding, so encourage your students to push off of the side of the pool with their left arm extended in front and their head resting on it. Their right arms should be at their sides, near the top of the water. Their legs should be extended behind them. [12] X Research source"
    },
    {
      "title": "Have them kick their legs out as their hands meet.",
      "content": "Have them kick their legs out as their hands meet. As their left hand comes down and their right hand comes up to meet it, their legs should be kicking out. Remind them that their top leg should kick out front, while their bottom leg bends back. [13] X Research source Some students will naturally tend toward the inverted scissor kick, with their bottom leg kicking forward and their top leg kicking back. If that seems most comfortable for your student, that's fine!"
    },
    {
      "title": "Tell them to bring their legs together as their arms extend back out.",
      "content": "Tell them to bring their legs together as their arms extend back out. As they push themselves through the water with their right arm, their left arm should be extending back outward. As they perform this motion, their legs should come back together so they’re parallel. [14] X Research source"
    },
    {
      "title": "Ask them to swim a length of the pool on 1 side, then switch.",
      "content": "Ask them to swim a length of the pool on 1 side, then switch. It will likely take your students a few tries in the pool to figure out the timing of the arms and legs together. Give them at least the length of the pool to practice on 1 side. Then have them push off from the other side of the pool with their right arm extended out."
    },
    {
      "title": "Have them use a noodle or kick board to practice the kick.",
      "content": "Have them use a noodle or kick board to practice the kick. If your students are having a hard time with the scissor kick, take out the arms for a while. Have them rest the forearm of their guiding arm on a noodle. Then have them practice just the scissor kick in the water. [15] X Research source"
    },
    {
      "title": "Ask them to work on their arms if their timing is off.",
      "content": "Ask them to work on their arms if their timing is off. Their bodies will drag in the water a little bit, but if your students are struggling with the arm movements, tell them not to worry about the kick. Instead, have them only work on the arm movements, emphasizing that their bottom arm should push water away as their lead arm glides through the water. [16] X Research source"
    },
    {
      "title": "Ask them to alternate sidestroke and breaststroke.",
      "content": "Ask them to alternate sidestroke and breaststroke. Breaststroke is also a gliding stroke, and it’s a good transition from 1 side to another when swimming sidestroke. Have your students swim a few sidestroke strokes on 1 side. Then they should swim 3 cycles of breaststroke before switching to the other side for a few more strokes of sidestroke. Have them repeat this for a few lengths of the pool. [17] X Research source"
    }
  ]
}