{
  "url": "https://www.wikihow.com/Stop-a-Goose-Attack",
  "title": "How to Stop a Goose Attack",
  "steps": [
    {
      "title": "Watch for warning signs of an imminent attack.",
      "content": "Watch for warning signs of an imminent attack. You may be able to get away before a goose becomes too aggressive if you see the warning signs of an attack. Pay attention to any potential signs of aggression when you're near a goose. At first, a goose will bend its head back slightly. This indicates aggression. If the goose then bends its neck out straight, this shows the aggression is increasing. If a goose is about to attack, it will pump its head up and down. Geese may hiss or honk as well if they are becoming aggressive."
    },
    {
      "title": "Leave before a goose begins to chase you.",
      "content": "Leave before a goose begins to chase you. If you notice warning signs of an attack, leave before the goose begins to chase you. If the goose sees you're backing away, it may decide you're not a threat. Back away slowly until you're a good distance from the goose and it's stopped making aggressive gestures."
    },
    {
      "title": "Back away slowly if the goose becomes aggressive.",
      "content": "Back away slowly if the goose becomes aggressive. In the event the goose starts chasing you, back away slowly. Stay faced towards the goose and use your peripheral vision to guide your movements. Make sure to avoid anything you may trip over, as this may give the goose reason to attack. [1] X Research source"
    },
    {
      "title": "Remain calm.",
      "content": "Remain calm. If you appear frightened or upset, a goose could take this as a sign of aggression. It's a good idea to maintain a calm, neutral demeanor when backing away from a goose. If you're struggling to remain calm, take a few deep breaths as you back away. Keep in mind that, while geese can be territorial, an actual physical attack is very rare. [2] X Research source"
    },
    {
      "title": "Seek medical attention if you're injured.",
      "content": "Seek medical attention if you're injured. In the event a goose bites you or hits you with its wings, seek medical attention. Geese are strong, and can cause injury when provoked. You may require stitches or a cast if a goose attacks you. Go to the emergency room for assessment as soon as you get away."
    },
    {
      "title": "Do not become hostile.",
      "content": "Do not become hostile. If you're being chased by a goose, your inclination may be to scare it off. However, getting hostile will only be seen as aggression. That will cause the goose to attack. [3] X Research source Do not yell at the goose. It's better not to say anything, as to avoid provoking it. You should also not make any physical gestures towards the goose. Do not kick, swing your arms, or throw anything at the goose."
    },
    {
      "title": "Avoid turning away.",
      "content": "Avoid turning away. It's very important you face the goose until it stops pursuing you. Keep an eye on the goose at all times. Do not close your eyes or turn your back from the animal. Watch the goose carefully until it backs off. [4] X Research source"
    },
    {
      "title": "Do not run.",
      "content": "Do not run. As you should keep your eye on a goose, running is not recommended. If a goose sees you running, this may encourage it to chase you more. Also, running may make you appear excited or agitated, which a goose may perceive as aggression. Even if a goose is gaining ground, remain calm and take slow, careful steps to get away. [5] X Research source"
    },
    {
      "title": "Do not feed geese.",
      "content": "Do not feed geese. Feeding geese can easily trigger an attack. Geese may lose their fear of humans if fed too frequently. They may also become aggressive over food, going after people for not handing over food. If there are geese at a local park or nature center, encourage others to avoid feeding them. You could talk to a ranger at the park about strongly enforcing rules that prevent people from feeding geese. If you're at a park, do not feed the geese. If you have young children, strongly discourage them from feeding the birds."
    },
    {
      "title": "Put up barriers, if possible.",
      "content": "Put up barriers, if possible. If there are bothersome geese in your yard, consider putting up barriers. Small fences can protect you and your family from potentially aggressive geese. If there are geese at a public place, like a park, contact officials and request barriers."
    },
    {
      "title": "Inform the proper authorities if geese are becoming a problem.",
      "content": "Inform the proper authorities if geese are becoming a problem. It's difficult to entirely prevent geese if you live in an area where they are prevalent. However, measures can be taken to minimize attacks. You can contact your local Department of Natural Resources to report the problem. The DNR can look into ethical solutions, such as putting up extra fences or using scare tactics like orange flyers to discourage the geese from bothering people."
    }
  ]
}