{
  "url": "https://www.wikihow.com/Write-an-Address-in-Spanish",
  "title": "How to Address a Letter in Spanish",
  "steps": [
    {
      "title": "Place the address in the center-right of the envelope.",
      "content": "Place the address in the center-right of the envelope. Your placement of the address on the envelope ensures it won't be obscured by postal service markings or stamps. Start the address 4 or 5 lines from the top, to leave space for stamps and postal service markings. If you're typing your envelope, you may want to set your left margin at the mid-line of the envelope."
    },
    {
      "title": "Use the 12- or 15-point font and single line spacing.",
      "content": "Use the 12- or 15-point font and single line spacing. Any commercially available font is acceptable. Do not type in bold or italics, or underline any part of the address. If you're writing the address by hand, write in print. None of the characters should overlap or touch each other. Keep the characters between 2 and 8 millimetres (0.079 and 0.315 in)."
    },
    {
      "title": "Type the name of the recipient on the first line.",
      "content": "Type the name of the recipient on the first line. Include the full name of the recipient to ensure proper delivery. Titles or honorifics (such as señor ) can be abbreviated. If you are including both an individual's name and a business name, put them both on the same line. [2] X Research source Example: Sr. D. Jaime Lozano Seguí"
    },
    {
      "title": "Provide information about the street and location.",
      "content": "Provide information about the street and location. Spanish addresses include the street address, floor, and door number. Write the street and house or building number first, followed by a comma. For some addresses, you will also include the stairwell number after the abbreviation \"Esc.\" Put a comma after the stairwell number. Add the floor number with a º symbol, then another comma. Finally, type the door number or letter. [3] X Research source Example: Plaza de las Descalzas 27, Esc 2, 3º, C."
    },
    {
      "title": "List the post code, locality, province, and country on the remaining lines.",
      "content": "List the post code, locality, province, and country on the remaining lines. Under the street address, type the 5-digit postal code. Type a space after the postal code, then the name of the locality in all capital letters. On the next line, type the name of the province, also in all-caps. Type \"SPAIN\" on the last line of the address. [4] X Research source Example: 45012 TOLEDO / TOLEDO / SPAIN"
    },
    {
      "title": "Place the address on the right-hand side of the envelope.",
      "content": "Place the address on the right-hand side of the envelope. Most Latin American countries use the lower-right portion of the envelope for the mailing address. If you're typing the address, left-align your text from the mid-line of the envelope. Start 5 or 6 lines down to leave enough room for stamps and postal markings. [5] X Research source If typing set your line spacing to single space. If you're writing the address by hand, try to keep your lines straight and make sure they don't overlap each other. Some countries are the exception to this rule. For example, if you're mailing something to Colombia, place the address in the middle of the envelope, and center the lines rather than left-aligning them."
    },
    {
      "title": "Print neatly or use a legible font.",
      "content": "Print neatly or use a legible font. Not all Latin American countries have specific requirements for font or font size. Choose a clean, legible font in a 12- or 15-point size, if you're typing. If you're writing the address by hand, print neatly. Some countries have specific requirements. For example, Argentina Post prefers addresses to be typed in 12- or 15-point Courier or Helvetica. Argentina Post also specifies typing in all caps, with no accent marks."
    },
    {
      "title": "Provide the recipient's name on the first line.",
      "content": "Provide the recipient's name on the first line. Include the recipient's first and last name for more accurate delivery. If you use an abbreviation for a title or honorific (such as \"Sra\" for \"señora\"), you typically don't need a period at the end of the abbreviation. [6] X Research source Example: Sra Otilia Ramos Perez If you are sending a letter to a business or government department in Colombia, write out the full name without abbreviations."
    },
    {
      "title": "Identify the street address and premises on the second line.",
      "content": "Identify the street address and premises on the second line. Typically, you'll type the name of the street, followed by the street number for the specific house or building. For rural addresses, you may have a sub-locality or description of landmarks. Argentina Post specifies to use the word calle if the address is a numbered street. If the street name ends in a number, use the abbreviation \"No\" before the street number. For example: CALLE 42 No 1340. [7] X Research source A rural address in Argentina would include the name of the farm or rural school on this line, rather than a street name and number."
    },
    {
      "title": "Include additional information on the third line if necessary.",
      "content": "Include additional information on the third line if necessary. Some Latin American addresses require a third line for proper delivery. Information from the second line also may spill over onto the third, such as if you had a long street name or building name. [8] X Research source For example, addresses in Mexico identify the recipient's colonia (neighborhood) on the third line. The word colonia is typically abbreviated \"Col.\" Capitalize the first letter and put a period at the end of the abbreviation. Some urban addresses in Colombia may include the sub-locality (similar to a Mexican colonia ) on the third line. [9] X Research source"
    },
    {
      "title": "List the postal code and locality after the street address.",
      "content": "List the postal code and locality after the street address. This line is typically known as the \"city line.\" For most Latin American addresses that have postal codes, the postal code is listed first, followed by the name of the locality. Type the name of the locality in all caps. For Mexican addresses include the abbreviation for the province after the locality. For example: 02860 MEXICO, CDMX For Colombian addresses, the locality comes first, followed by the 6-digit postal code. [10] X Research source"
    },
    {
      "title": "Close with the name of the country.",
      "content": "Close with the name of the country. The final line of your address is the name of the country in all caps. For the purposes of mailing from the US or other English-speaking countries, it is acceptable to write the name of the country in English. For example, if you're mailing a letter to an address in México, you could simply write \"MEXICO\" on the country line, although you could also use the Spanish spelling, with the accent over the e . There's no need to put \"SOUTH AMERICA\" or \"CENTRAL AMERICA\" below the country name."
    }
  ]
}