{
  "url": "https://www.wikihow.com/Write-and-Publish-a-Book",
  "title": "How to Write and Publish a Book",
  "steps": [
    {
      "title": "Begin forming ideas.",
      "content": "Begin forming ideas. Write some of these ideas down. Afterward, select the ones you want. Start off by deciding what type of book you'd like to present. Is it an educational book covering topics like math, science or business and finance? Perhaps it is a novel, or maybe even an autobiography. Whichever type of writer you are is fine. The trick is following an idea down the proverbial rabbit hole. Stephen King, a famous author has noted that he doesn’t write ideas down in a notebook. To him “A writer’s notebook is the best way in the world to immortalize bad ideas.” This doesn’t mean that you shouldn’t write ideas down in a notebook you carry around. If that works for you, grab a notebook and jot your ideas down. But be cautious about which ideas you do write down. Ask yourself, if you didn’t write this idea down, would it be good enough to remember tomorrow? Once you find inspiration for an idea you want to pursue, start writing."
    },
    {
      "title": "Don't worry about errors; you can correct your writing later.",
      "content": "Don't worry about errors; you can correct your writing later. You get the best stories by continuing on and not looking at the screen, obsessing over every little error. If you keep looking at the screen, chances are you will want to change everything right away instead of continuing on with the story. When writing a book, and hoping to get it published, you will write many drafts before it’s ready to send out. Some of those drafts will probably include major changes to your story. But at the beginning, you’re just trying to build a world and get your ideas on paper, or your screen. Focus on building your characters. Some books are plot heavy, and that’s ok. But a book that people typically want to read is really about the characters and the importance of the situation you put those characters in. While the plot moves a story along, it’s the moments between characters that sell a book. Whether you’re writing fantasy like Harry Potter, or a strict novel like Freedom, by Jonathan Franzen. Focus on the “Who” you are writing about. The “When” “What” “Where” “Why” and “How” will come more naturally. [1] X Research source"
    },
    {
      "title": "Set daily writing goals.",
      "content": "Set daily writing goals. There should not be a limit on how much you can write a day but create a minimum. It will help you focus on the story. Whether you set a goal of 300 words a day, or a goal of one hour, doing so will help you stay on track. 300 words a day isn’t much but can be a great starting place. If you’re new to writing, or very busy, give yourself a smaller goal which you can easily meet. Large goals are much harder to meet and will often cause you to not write at all. You are taking one step at a time, and in the end, you will have arrived at your large, final goal. You can increase your daily goal as you continue along, or if you have more free time to write. Just make sure you can stick to it. Even if you feel stuck in your writing, press on and reach your goal. You never know when you’ll get some inspiration. Work in a quiet or empty place. Finding a quiet place where you can focus, and which you can make yours is invaluable to writing. Even if you write at a coffee shop, find a corner where you won’t be too distracted."
    },
    {
      "title": "Stay diligent.",
      "content": "Stay diligent. Many writers start out strong but quickly become distracted, frustrated with the slow process, or bored. One of the simplest and best ways to prevent this is to simply put yourself in the chair. Following and reaching your daily goal will help you stay on course. The act of sitting in your chair and chiseling away will help you make reaching that goal a reality. Try to have a set time to write every day in addition to a daily goal. John Grisham has published many best-selling books, and he started his writing career while he was a lawyer. He got up early every morning and wrote one page. Make writing a habit you can’t quit. Find that unique place to write and do it every day at the same time."
    },
    {
      "title": "Get early feedback.",
      "content": "Get early feedback. Even though you may be protective of your work and want to keep it hidden until “it’s ready”, don’t. Get frequent and early feedback on your writing from people you trust to be honest with you. If you’re not part of one already, consider joining a local writer’s workshop. These groups will help you flesh out your ideas, give you feedback, and keep you accountable. Use the internet. If you’re nervous about showing someone you know your work, find an online forum where you can get feedback and bounce ideas back and forth. Places like /r/Writing on Reddit.com offer options for you to get help on your work. [2] X Research source"
    },
    {
      "title": "Categorize your book.",
      "content": "Categorize your book. Once you finish your story, make sure it follows the guidelines which publishers Allen and Unwin follow: Junior fiction For beginner readers, aged 5-8, word length 5,000-10,000 For confident readers, aged 7-10, word length 10,000-30,000 For middle readers, aged 11-14, word length 30,000-55,000 Young adult novels For teenage readers, aged 13-16, word length 40,000-60,000 For mature teenage and older readers, aged 15+, word length 40,000-100,000 For a total list and for more information and writing and publishing, go to \"Submission Guidelines\" on the Allen and Unwin website. [1]"
    },
    {
      "title": "Recheck and re-edit your story.",
      "content": "Recheck and re-edit your story. Don’t feel like you have to stop looking at your story at a certain point. Edit as many times as you need to. While you do need to edit and give the editing process as much attention as, if not more than the actual writing, you also need a break. You’ve been living inside this story you’ve created and now it’s time for a vacation. Giving yourself time will help you get into the editing mindset. Because, as the editor, you have to look at your work with a cold eye, ready to chop up it up and make changes. When you do start editing, edit as much as you need to, but don't keep editing if you don't know what the problem is. If you don’t have a concrete solution, you’ll chop up your story and have no idea how to put it back together. Over-editing is possible and dangerous, so get others to check your work. Another pair of eyes can spot gaps that you overlooked because you’re so close to your work. Get someone you trust to give you notes and feedback. So far, you’ve been operating in a vacuum. There will be parts that need work that will be hard for you find on your own. Read others’ notes, and then put the notes away. You probably won’t like what someone else’s notes are. So read the notes, decompress, and after some time go back and incorporate the ones which are helpful. Discard the ones which aren’t."
    },
    {
      "title": "Get an editor to look over your book.",
      "content": "Get an editor to look over your book. After you’ve made a pass, or several at your book, it’s time to get a real editor to look at your work. Editing is not the same as writing. You will need someone who knows how to deconstruct a book, find the issues, and give you advice on how to put it back together. [3] X Research source A professional editor is especially valuable if you’re going to self-publish. The last thing you want is a glaring, yet silly, spelling error in your book after all of your hard work. The right editor will be able to bring clarity and flow to your narrative without changing your voice. Your editor will bring a much needed objective eye to your work and will help you not only fix those small errors but help you find the true story underneath all the extra stuff you don’t need. An editor will also, at the end of the day, make your book look professional."
    },
    {
      "title": "Do a final check to make sure you’re ready to publish.",
      "content": "Do a final check to make sure you’re ready to publish. After you and your editor have revised your book to its final form, make sure everything is in order. Make sure you have a good title you’re ready to stick with. Start building buzz on social media. Create a Facebook page and Twitter profile for your book. Post frequently with updates about what’s going on, next steps, and other exciting information."
    },
    {
      "title": "Consider getting an agent.",
      "content": "Consider getting an agent. Agents are people who will work for you and help you get your book published and sold. These people have industry contacts to help you. Agents are also elusive and not easy to get a hold of if you’re new. [4] X Research source You won’t always need an agent. If you plan to go the self-publishing route, you may find that an agent is something you can do without. Look for agents on sites like PublishersMarketplace.com. Here you can search many profiles and see what kinds of work are getting published. [5] X Research source Make sure to read over the agent’s submission guidelines before you submit your materials. You will most commonly need: Query Letter. A one-page pitch letter that describes your work. Book Synopsis. A brief summary of your story. Nonfiction proposal (if you’re writing for nonfiction). This is a very detailed document, usually around twenty to thirty pages, that outlines your argument for why your book deserves to be published. [6] X Research source Sample chapters, or your whole manuscript."
    },
    {
      "title": "Research different publishers.",
      "content": "Research different publishers. You may choose to self-publish, but getting published by a big name publisher is better for getting a larger audience. Some publishers only choose to publish or even read solicited material, manuscripts which have gone through an agent. Agents and publishers also like material which either comes from already known authors or writers. However, this doesn’t mean you can’t attract the attention of either. These people will want to see that you have a following, and are being self-promotional on social media. Some publishers such as Penguin or Allen & Unwin will also look at your manuscript if you aren’t represented by an agent. Check out self-publishing options. Self-publishing might sound like a way to circumvent a bunch of people who will just say “no” to you. But it’s hard work, and the reason there are people who publish books is because these people know how to best do it. If you’re going to self-publish, you have to find a good distributor if you’re going to publish hard copies. You can also self-publish your story as an ebook through Amazon’s self-publishing site."
    },
    {
      "title": "Narrow your publishing options.",
      "content": "Narrow your publishing options. Once you have decided on a few publishers (the more the better), start researching these publishers more in-depth. Some choose to publish for adults only and in selected genres while others may have a wider range of books that are accepted. All information should be available on the publisher’s websites. Some have different guidelines and word limits, or whether your book need be solicited or not. Almost all publishers require a hard copy (printed) manuscript of your story. Also, keep in mind the specifications. Some publishers prefer double-spaced lines, with a certain type of font in a certain size, etc. Stick to what is specified. Do not send emailed copies or ones on a disc, unless stated you may. Never send in your original or only copy of anything. You will not get your materials back."
    },
    {
      "title": "Consider self-publishing online.",
      "content": "Consider self-publishing online. Self-publishing an ebook is a viable and popular option. The biggest opportunity for this method is Amazon’s Kindle Direct Publishing. You can simply upload your manuscript to the program and begin to sell copies. The KDP service is free to use, however, Amazon will keep up to 70% of your profits. If you are self-publishing online, make sure that you have gotten your book edited professionally and have had the cover designed by a professional graphic designer. All the work of promoting your book will also fall on you when you use this method. Be realistic. You’re most likely not going to become the next breakout hit with your first book. You won’t gain fame overnight. It takes several books and many years to gain a solid reputation in most cases."
    },
    {
      "title": "Wait and stay patient.",
      "content": "Wait and stay patient. Send your copies to all available publishers that you can. It may take up to four months or more, to get your book reviewed. If you get a “yes” from a publisher, well done! You get to see it in the stores! However, the publisher may not advertise it for you. That will fall to an agent. The good news is getting an agent after you have a book deal is easier. But remember, that in most cases, the advertising usually falls on you."
    }
  ]
}