{
  "url": "https://www.wikihow.com/Stretch-Plastic-Shoes",
  "title": "How to Stretch Plastic Shoes",
  "steps": [
    {
      "title": "Wear thick socks and put on the shoe.",
      "content": "Wear thick socks and put on the shoe. Wearing thick socks before putting on the shoe will give more room for it to stretch. Wear one or two pairs to fit into the shoe snugly. If the shoes have zippers, zip them up as far as they can go. Wear thick wool socks for the maximum amount of stretching. [1] X Research source"
    },
    {
      "title": "Use the blow dryer in 20-30 second intervals.",
      "content": "Use the blow dryer in 20-30 second intervals. While on the hottest setting, hold the blow dryer a few inches away from the shoe and heat the areas that feel tight. Wiggle your foot and toes to allow the plastic to expand. [2] X Research source For shoes with zippers, as you heat the shoe, work the zipper up to promote stretching and a perfect fit. [3] X Research source"
    },
    {
      "title": "Walk while wearing the shoe until the shoe cools.",
      "content": "Walk while wearing the shoe until the shoe cools. While the shoe is still hot from the blow dryer, walk around the house to allow the shoe to stretch more. Leave on the thick socks to allow for the shoe to expand."
    },
    {
      "title": "Remove your socks and try on the shoe.",
      "content": "Remove your socks and try on the shoe. Use this time to ensure that the shoes now fit. If they still don't feel right, put the socks back on and continue to blow dry and stretch. Work the shoe with heat and your foot until it fits exactly how you want. Run your thumb between your skin and the shoe to stretch the fit for shoes that come past the ankle or calf. [4] X Research source"
    },
    {
      "title": "Fill a resealable bag halfway with water.",
      "content": "Fill a resealable bag halfway with water. Use a durable bag that will not come undone through the process. Fill it with enough water to fit inside of your shoe. Remove the excess air from the bag and seal tight. [5] X Research source Be sure not to overfill or else the bag could break and cause water damage to the shoe."
    },
    {
      "title": "Place the water-filled bag in your shoe.",
      "content": "Place the water-filled bag in your shoe. Push the bag into the toe area of your shoe. The bag should fit snugly into the shoe and fill the volume that you wish to be stretched. Ensure the seal is tight and no water is leaking."
    },
    {
      "title": "Freeze your shoes overnight.",
      "content": "Freeze your shoes overnight. Allow for the water inside of your shoe to freeze. As it freezes, the ice will expand and stretch your shoes. To protect the outer sides of your shoes (and the rest of your freezer items), you can put your shoes in another plastic bag before putting them in the freezer. [6] X Research source"
    },
    {
      "title": "Thaw your shoes for a half hour.",
      "content": "Thaw your shoes for a half hour. The following morning, allow your shoes and the bags to thaw for 20-30 minutes before removing the bags. [7] X Research source Try on your shoes to see if they have stretched enough. If not, you can repeat the freezing process again until the desired fit."
    },
    {
      "title": "Purchase a shoe stretcher that fits your style shoe.",
      "content": "Purchase a shoe stretcher that fits your style shoe. [8] X Expert Source Moe Draper Shoe Care & Repair Specialist Expert Interview. 5 April 2021. Shoe stretchers come in a variety of styles depending on the type of shoe you're trying to stretch. Different stretchers will be available for flats, boots, high heels, and other styles. Determine if you need to adjust the length, width, or both. One shoe stretcher will work on both the left and the right shoe. A 'two-way' stretcher will adjust both length and width. Other common shoe stretchers are toe stretchers, vamp stretchers, and high heel stretchers. Many stretchers have holes to add attachments for trouble areas, such as bunions. [9] X Research source"
    },
    {
      "title": "Tighten the stretcher in your shoe.",
      "content": "Tighten the stretcher in your shoe. Turn the knobs clockwise until the shoe stretcher fits tight in the shoe. After that, twist the knob three or four more times to stretch the shoe. Leave the stretcher in the shoe overnight. [10] X Expert Source Moe Draper Shoe Care & Repair Specialist Expert Interview. 5 April 2021. Remember to start small as to not overstretch the shoes too quickly."
    },
    {
      "title": "Try on your shoe.",
      "content": "Try on your shoe. Loosen the stretcher by turning the dial counter-clockwise and remove. If the shoe is still too tight, continue to use the stretcher in your shoe. Use an extra few turns when stretching again. Be careful not to overstretch the shoe as a loose shoe will not be comfortable either."
    }
  ]
}