{
  "url": "https://www.wikihow.com/Working-Outer-Quads",
  "title": "11 Outer Quad Exercises & Stretches for Your Next Workout",
  "steps": [
    {
      "title": "Leg extensions",
      "content": "Leg extensions If you’re at a gym, you can do leg extensions on a weight bench with leg rollers. Position your legs so your lower shins are under the rollers. Turn your feet slightly inward by rotating your hips, then slowly extend and lower your legs. Repeat this for about 10–12 reps and 2–3 sets. [1] X Research source Rotating your hip inward helps put more tension on your outer quads. To do leg presses at home, sit straight up in a chair with your feet on the floor about hip-width apart, rotated in at the hip. As you exhale, slowly tighten your leg muscles and straighten one knee until your leg is parallel to the floor. Hold your leg up for about 5 seconds, then slowly lower your leg as you inhale."
    },
    {
      "title": "Leg presses",
      "content": "Leg presses Sit on a leg press machine with your knees bent and your feet on the platform a little closer than hip-width apart. Grip the handles beside the machine to stabilize yourself, then press the platform up with your feet. Slowly bend your knees to bring the platform back to the starting position. Repeat this for 1 set of 12–15 reps. Using a narrower stance here will target your outer quads more than your inner quads. If you’re at home, lie on your back with one knee bent and a resistance band looped around the bottom of that foot. Slowly straighten your leg and push your foot away from you, then bend your knee and bring your foot to its starting position. [2] X Research source"
    },
    {
      "title": "Leg raises",
      "content": "Leg raises To do a leg lift , lie on your back on the floor with your legs straight and your hands by your side. Bend your knees and lift your legs so your calves are parallel to the floor, then straighten your knees so your toes are pointed at the ceiling. Keeping your legs straight and your back against the floor, bring your feet slowly back down. Repeat for 3 sets of 10–20 lifts. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try not to touch the floor when you bring your legs back down—this will put more tension on your quads, giving them more of a workout. As you get more comfortable doing this, you can make the move more challenging by raising your legs up to the ceiling without bending your knees first."
    },
    {
      "title": "Lunges",
      "content": "Lunges Stand with your feet hip-width apart and your shoulders down and back. Engage your core, then take a big step forward with one leg, bending your knees until your front thigh is parallel to the floor and your back knee is nearly touching the ground. Push yourself up and return to your starting position. Repeat this for 3 sets of 10 reps on each leg. Lunge variations include: Reverse lunges: Step backward instead of forward. Side lunges: Take a big step sideways with one foot. Bend the knee of the leg that you stepped with and keep your other leg straight, lowering yourself as much as possible. Walking lunges: Step forward in a lunge, but instead of pushing yourself back to your starting position, bring your back foot forward to meet your front foot. Alternate lunging one leg, then the other, moving forward with each step. [4] X Research source Weighted lunges : Hold dumbbells or place a barbell behind your shoulders as you do forward, walking, side, or reverse lunges. [5] X Research source"
    },
    {
      "title": "Step-ups",
      "content": "Step-ups Stand in front of a small, sturdy stool or a stair step. Place one foot on the step, then use your leg muscles to push yourself up, keeping your core tight and your back straight. Lower yourself down and repeat, alternating which foot you step with each time. Continue for as many reps as you can. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Step-ups are a great way to build real-world strength in your quads since they mimic a natural motion."
    },
    {
      "title": "Front squats",
      "content": "Front squats Front squats (or free squats) are one of the best exercises for quads. To do basic squats , stand with your feet shoulder-width apart or a little closer. Brace your core, then push your hips backward and bend your knees, lowering yourself into a sitting position. Stop once your knees are bent at a 90° angle, then push yourself back up with your legs. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Do this for at least 1 set of 12–15 reps. To make a basic squat more difficult, add a jump when you come out of it. Keep your knees soft as you come down to cushion the landing."
    },
    {
      "title": "Barbell front squats",
      "content": "Barbell front squats Grab a barbell with an underhand grip, then lift the bar until it’s resting across the fronts of your shoulders. Your hands should be upside-down, and your fingers should be pointing behind you when the bar is in place. Keep your elbows up so the bar stays secure, then stand with your feet shoulder-width apart and sit back into a squat. [8] X Research source Use a lighter weight and higher reps with this exercise—aim for around 3 sets of 12–20 reps. Keep your back up and straight to avoid straining your wrists. If it’s difficult to hold the bar like this, lift it onto the front of your shoulders, then cross your arms across your chest and hold the bar securely like that."
    },
    {
      "title": "Hack squats",
      "content": "Hack squats Start in a standing position on the leg press machine with your shoulders under the shoulder pads. Grip the handles to steady yourself, then pull inward on the handles to disengage the lock on the machine. Slowly bend your knees and lower yourself into a squat, keeping your back straight. Push up through your feet to stand back up and complete the squat. [9] X Research source Do this for about 10–12 reps per set."
    },
    {
      "title": "Split squats",
      "content": "Split squats To do a split squat , drop one foot on a bench behind you and crouch so your forward knee is at a 90° angle and your torso is leaned forward at about 35°. Push yourself up by straightening your forward leg, then lower yourself back down. Hold weights while you do this for a dumbbell split squat."
    },
    {
      "title": "Fitness ball squat",
      "content": "Fitness ball squat Theriot recommends, “Place a fitness ball against a wall with your tailbone against the ball, then squat down and let the ball roll up your back. When the ball reaches your shoulder blades, push back up.” Try to do 3 reps of 10–12 fitness ball squats."
    },
    {
      "title": "Sisyphus squats (sissy squats)",
      "content": "Sisyphus squats (sissy squats) Stand with your feet shoulder-width apart and brace yourself with one hand on a squat cage or sturdy weight bench. Brace your core, then bend your knees and bend backward to about 45°, making sure your is in a straight line from your head through your knees. [10] X Research source This is an especially challenging squat, so start off with a set of 5 or 6 reps, then build from there."
    },
    {
      "title": "Standing quad stretch",
      "content": "Standing quad stretch Christensen says, “To do a standing quad stretch , reach back and grab your ankle. Just be sure to brace your core—otherwise, you’ll be arching your lower back instead of stretching your leg.” Christensen also says, “If you can’t reach down and grab your ankle, prop it on the bed behind you and hold onto a chair, then lean your body back so you get a stretch.”"
    },
    {
      "title": "Prone quad stretch",
      "content": "Prone quad stretch Lie face-down on the floor with one knee bent and a resistance band looped around the top of that foot. Press your foot backwards away from you, using the resistance from the band to stretch your quad. Hold this for 20 seconds and repeat 3 times on each leg. [11] X Research source"
    },
    {
      "title": "Side-lying quad stretch",
      "content": "Side-lying quad stretch Lie on your side and bend your top leg, then reach behind you to grab the ankle of that leg. Pull your foot backward and hold for about 15–30 seconds. Repeat 2–4 times, then roll over to your other side and repeat the stretch on the other leg. [12] X Research source You should primarily feel this stretch in the front of your thigh."
    },
    {
      "title": "Half-kneeling quad stretch",
      "content": "Half-kneeling quad stretch Christensen recommends, “Get down on one knee and prop your back foot up, like on your couch. From that position, bring your torso upright, then lean slightly backward. That should give you a good stretch along your quad.” Hold this stretch for about 20 seconds, then repeat on the other side."
    },
    {
      "title": "Foam rolling",
      "content": "Foam rolling Lie face-down on the floor with your forearms under you and a foam roller under the front of your thighs. Use your arms and core to brace yourself, then slowly roll your body upward so the roller moves down your thighs. Once it’s just above your knees, roll back upward."
    },
    {
      "title": "",
      "content": "If you want to strengthen your outer quads, try to target them 2–3 times a week. A good outer quad workout might look something like this: Warm-up: 5–10 minutes warming up with quad stretches and light cardio. Squats: 3 sets of 10 reps each Lunges: 2 sets of 12 reps on each leg Step-ups: Continue to fatigue Cool down: 5–10 minutes of quad stretches and foam rolling"
    },
    {
      "title": "Focus on isolating exercises.",
      "content": "Focus on isolating exercises. It can be hard to target your outer quads when you’re doing compound exercises, or exercises that work multiple muscle groups at once. If you want to build your outer thighs, include a few targeted isolation exercises in each workout. To build muscle, try to include quad workouts 2–3 times a week."
    },
    {
      "title": "Narrow your stance.",
      "content": "Narrow your stance. Bringing your feet a little closer together than normal may activate your outer quads more than your inner quads. [13] X Research source Just be aware that this can put more pressure on your knees—if you have bad knees or an exercise starts to hurt, stick to a regular stance."
    },
    {
      "title": "Rotate your hips so your toes point inward.",
      "content": "Rotate your hips so your toes point inward. For moves that don’t strain your knees, you may be able to target your outer quads by rotating from the hips so your toes point inward. Just be mindful of your form, and if this causes any knee pain, switch to a normal foot position. There’s some disagreement in the training community about whether foot position affects what part of the quad is activated during a movement, but if you feel like this helps your quads and it doesn’t cause any pain, it can’t hurt to try."
    },
    {
      "title": "Use shallow or shortened movements.",
      "content": "Use shallow or shortened movements. When you’re doing exercises like leg extensions that take your leg through a full range of motion, shortening that movement will target your outer quads more than your inner quads. [14] X Research source So when you’re doing leg extensions, you might do the first half of your set by only lifting your leg about halfway, then do full leg extensions for the remainder of the set."
    },
    {
      "title": "Building your quads helps you kick, run, and jump.",
      "content": "Building your quads helps you kick, run, and jump. They’re the muscles that allow you to straighten your knees, flex your hips, and maintain your balance. The vastus lateralis connects your thighs to your knees, so working your outer quads will help give your legs strength and stability. [15] X Research source"
    },
    {
      "title": "Your outer quad muscles are the muscles along the outside of the thigh.",
      "content": "Your outer quad muscles are the muscles along the outside of the thigh. Also known as the vastus lateralis muscles, the outer quads are the largest muscles that make up your quad. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source They wrap from your thigh around to the outside of your knee, and they help extend and stabilize your knee while you’re moving. The other 4 quad muscles are the rectus femoris, vastus intermedius, tensor of the vastus intermedius, and vastus medialis."
    },
    {
      "title": "How often should I train my outer quads?",
      "content": "How often should I train my outer quads? To build your outer quads, try to train them 2–3 times a week. Aim for a total of about 6 sets a week, which should work out to about 2–3 sets per session."
    },
    {
      "title": "How many reps should I do to train my outer quads?",
      "content": "How many reps should I do to train my outer quads? It depends on which exercise you’re doing, but typically, you want to do higher reps with isolation exercises, like when you’re targeting your quads."
    },
    {
      "title": "What if outer quad exercises hurt my knees?",
      "content": "What if outer quad exercises hurt my knees? If an exercise causes you pain, you should immediately stop doing it. Try changing your position or stance to alleviate the pain. But if it continues hurting, consult your doctor before trying again."
    },
    {
      "title": "Can you isolate your outer quads?",
      "content": "Can you isolate your outer quads? You can do exercises that will target your outer quads, but you can’t really isolate them from your other quad muscles. When you engage your quads, all 5 of the quad muscles will be activated."
    }
  ]
}