{
  "url": "https://www.wikihow.com/Test-for-Oxygen",
  "title": "How to Test for Oxygen",
  "steps": [
    {
      "title": "Light a wooden splint.",
      "content": "Light a wooden splint. A splint is a long, thin strip of wood around 6 in (150 mm) long and ¼ inch (6 mm) wide. Light the splint with a lighter or match. Ask a teacher or lab assistant if you need help lighting the splint. Using a splint allows you to safely do experiments involving fire since it is longer than a match and keeps your hand at a distance. If you are at all worried about handling one, wear gloves. Always wear safety goggles when you are conducting experiments with unknown gasses."
    },
    {
      "title": "Blow out the flame so that the splint glows.",
      "content": "Blow out the flame so that the splint glows. In order to test for oxygen, the splint will need to be freshly blown out so that it is still glowing. You can't test for oxygen if the splint is still lit or if it is completely extinguished. [1] X Research source Move quickly after blowing out the splint. Keep the gas sample close by."
    },
    {
      "title": "Place the splint in a sample of gas.",
      "content": "Place the splint in a sample of gas. Use an unknown sample of gas provided to you by a teacher or laboratory in a glass reaction vessel, likely a test tube. Sometimes the splint will relight as soon as you bring it close to the mouth of the vessel. [2] X Research source You can also place the splint at the mouth of the tube containing the gas sample without putting it all the way in."
    },
    {
      "title": "Watch for the splint to re-ignite.",
      "content": "Watch for the splint to re-ignite. If the splint re-lights, the sample is oxygen. [3] X Research source The splint re-lights because the concentration of oxygen in the test sample is higher than in the air around you. [4] X Research source Sometimes the splint can re-ignite with a pop, which you may mistake for a hydrogen pop. However, a hydrogen pop is more violent and can extinguish a splint, like a mini explosion."
    },
    {
      "title": "Use a colorimetric test to get a basic approximation of oxygen levels.",
      "content": "Use a colorimetric test to get a basic approximation of oxygen levels. Fill a vial with 25 milliliters of the liquid you want to test for dissolved oxygen. Place one of the glass ampules that comes with the colorimetric testing kit into the water and snap it to break it. Let it fill with water and react for around 2 minutes. Compare the result with the color chart that came with the kit to get an approximation of the oxygen levels. [5] X Research source Rinse the vial before collecting a sample for more accurate results. Gently shake the sample in the ampule to see the color more evenly."
    },
    {
      "title": "Measure oxygen levels with a meter and sensor for accurate results.",
      "content": "Measure oxygen levels with a meter and sensor for accurate results. There are several different kinds of dissolved oxygen (DO) sensors, including the optical DO sensor, electrochemical DO sensor, polarographic DO sensor, pulsed polarographic DO sensor, and galvanic DO sensor. Generally, you place the sensor into the liquid you want to measure and read the results on a handheld meter. Depending on the liquid, you may have to take temperature, salinity, and pressure into account to get an accurate result. Some meters automatically sense these and make the adjustments for you. [6] X Research source Follow any directions that come with your particular sensor for the most accurate results."
    },
    {
      "title": "Calculate oxygen levels using the Winkler Method for a manual exercise.",
      "content": "Calculate oxygen levels using the Winkler Method for a manual exercise. Purchase a kit specifically used to test oxygen concentration using the Winkler Method. [7] X Research source Collect a water sample using the vial included with the kit. Fixate the oxygen levels right away using the included solutions of manganous sulfate and alkaline potassium iodide azide. Cap the solution until you can take it back to the lab. Finally, titrate the solution using an indicator solution and one mL of sodium bisulfate at a time. When the solution turns clear, note how many milliliters of sodium bisulfate you added. Each 0.1 mL of sodium bisulfate is 1 part per million of dissolved oxygen. [8] X Research source Make sure the sample vial is completely filled with water. If there is any air trapped in the bottle or lid, the results could be skewed. For example, if you added 1.4 mL of sodium bisulfate to the solution before it turned clear, the concentration of oxygen was 14 ppm in the original water sample."
    }
  ]
}