{
  "url": "https://www.wikihow.com/Throw-Darts-in-GTA-V",
  "title": "How to Throw Darts in GTA V",
  "steps": [
    {
      "title": "Travel to the Yellow Jack Inn.",
      "content": "Travel to the Yellow Jack Inn. [1] X Research source It is located southeast of the Sandy Shores airfield. If you want to play darts while hanging out with another character, call them on your cell phone and pick them up before travelling to the Yellow Jack Inn."
    },
    {
      "title": "Walk up to the dartboard to start a game.",
      "content": "Walk up to the dartboard to start a game. The closest NPC will be chosen as your opponent if you are not playing with a friend. If it is your first time playing, you will be shown a brief tutorial."
    },
    {
      "title": "Choose the amount of sets and legs per set you want to play.",
      "content": "Choose the amount of sets and legs per set you want to play. You can choose up to 5 legs per set, and up to 15 sets per game of darts. If you want to win a game quickly for the 100% checklist requirement, you can choose to play only one leg of one set."
    },
    {
      "title": "Throw darts for your first turn.",
      "content": "Throw darts for your first turn. You will throw three darts per turn. To win, you must be the first to reduce your score from 301 to 0. [2] X Research source If you want to win the game as quickly as possible, aim for the middle ring in the section marked “20.” Landing all three darts there will reduce your score by 180 points. The numbers around the dartboard represent the point value for each section. Throwing a dart onto the white or black areas will reduce your score by that point value. If a dart lands on the outermost ring, you’ll reduce your score by double the point value. If it lands on the middle ring, your score will be reduced by triple the point value. Throwing a dart onto the ring around the bullseye will reduce your score by 25 points, while landing it on the bullseye will reduce your score by 50 points. You can steady your aim once per leg, but it only lasts a moment. To steady your aim, either hold down the right trigger (on Xbox and Playstation consoles) or the right mouse button if you’re playing on a PC."
    },
    {
      "title": "Throw darts for your next turn.",
      "content": "Throw darts for your next turn. To do this most efficiently, aim your first dart for another triple 20. For your second dart, aim for the white area of the 11 point section. This will set you up for a win with a bullseye. Alternatively, you can aim for a triple 20, then a triple 7. Doing this will set you up for a win with a double 40, which is easier to hit than a bullseye."
    },
    {
      "title": "Throw your winning dart.",
      "content": "Throw your winning dart. If you set yourself up for a bullseye win, try your best to accurately aim for the bullseye. Otherwise, try to land on a double 40. If you missed any of the previous points, you will need to do the math to figure out the most efficient way to get to 0 with a bullseye or double. If you are on your last dart of your second turn and need an odd point value to win, this will require another turn. For instance, if you have 17 points to go, it will take another turn, since you cannot score 17 points with a bullseye or double. If your score dips below 0, your score will stay the same as before that turn. It will then be your opponent’s turn to throw a dart."
    }
  ]
}