{
  "url": "https://www.wikihow.com/Transplant-a-Jade-Plant",
  "title": "How to Transplant a Jade Plant",
  "steps": [
    {
      "title": "Transplant the jade plant in early spring.",
      "content": "Transplant the jade plant in early spring. This is the time when they are just entering a season of vigorous growth. [3] X Research source They recover from the stress of being repotted more easily and quickly during this season."
    },
    {
      "title": "Use a heavy clay, terracotta or ceramic container.",
      "content": "Use a heavy clay, terracotta or ceramic container. This will help to keep the plant upright. [4] X Research source Jade plants tend to become top heavy and fall over easily."
    },
    {
      "title": "Make sure the container has at least one drain hole in the bottom.",
      "content": "Make sure the container has at least one drain hole in the bottom. This will allow excess water to drain from the pot. If the excess water cannot drain away, it will keep the potting soil too moist and restrict air movement which can cause root rot and kill the plant."
    },
    {
      "title": "Find a container that is only 1 to 2 inches deeper and wider than the old container.",
      "content": "Find a container that is only 1 to 2 inches deeper and wider than the old container. Larger containers will encourage excessive root growth or hold too much soil around the roots which will keep them wet for too long. [5] X Research source"
    },
    {
      "title": "Use a peat-based potting mix with extra coarse builder’s sand or perlite added in.",
      "content": "Use a peat-based potting mix with extra coarse builder’s sand or perlite added in. This will allow the soil to drain more quickly. [6] X Research source You can mix the perlite or sand into the potting mix at a ratio of two-thirds potting mix and one-third perlite or sand."
    },
    {
      "title": "Put the new potting mix into the container at a depth of 1 to 2 inches.",
      "content": "Put the new potting mix into the container at a depth of 1 to 2 inches. [7] X Expert Source Andi Xoch Plant Specialist Expert Interview. 4 August 2021. The top of the jade plant root mass should be about 1 inch below the top of the container after it is transplanted."
    },
    {
      "title": "Remove the jade plant from its old container.",
      "content": "Remove the jade plant from its old container. Do this by laying the pot on its side, grasping the base of the stem in your hand and sliding the roots out. [8] X Research source"
    },
    {
      "title": "Disinfect a pair of sharp scissors with a household disinfectant like Lysol.",
      "content": "Disinfect a pair of sharp scissors with a household disinfectant like Lysol. Soak them in the disinfectant for five minutes, rinse them in tap water and dry them off with a clean towel. This will kill fungal spores and bacteria that may infect the jade plant."
    },
    {
      "title": "Trim off any roots",
      "content": "Trim off any roots that are much longer than the root mass. Then, cut the roots off so they are even with the rest of the root mass. Trimming off these long roots will cause the plant to develop a healthier root system within the root mass."
    },
    {
      "title": "Put the jade plant in the new container.",
      "content": "Put the jade plant in the new container. Then, fill in the spaces around the roots with potting mix. [9] X Expert Source Andi Xoch Plant Specialist Expert Interview. 4 August 2021."
    },
    {
      "title": "Water the jade plant with room-temperature water until it drains from the bottom.",
      "content": "Water the jade plant with room-temperature water until it drains from the bottom. This will settle the soil around the roots and give the plant some moisture. If there is a saucer beneath the container to catch the water that drains from the hole, empty it after watering the plant. Water left in the saucer could leach back up into the potting mix and keep the roots too wet."
    },
    {
      "title": "Take special care of the jade plant for four weeks after transplanting it.",
      "content": "Take special care of the jade plant for four weeks after transplanting it. The jade plant will be stressed from being transplanted and should be cared for a little differently while it recovers."
    },
    {
      "title": "Water the plant with room-temperature water when the top of the potting mix begins to dry.",
      "content": "Water the plant with room-temperature water when the top of the potting mix begins to dry. The jade plant needs to be watered more often than usual because the root system has been compromised and cannot absorb water efficiently. [10] X Research source Room-temperature water will not shock the roots like cold tap water. If the jade plant is not getting enough water, its succulent leaves will begin to shrivel and may develop brown spots. [11] X Research source"
    },
    {
      "title": "Do not overwater the plant.",
      "content": "Do not overwater the plant. Too much water will cause the leaves to turn yellow."
    },
    {
      "title": "Avoid giving the plant any fertilizer while the root system is recovering.",
      "content": "Avoid giving the plant any fertilizer while the root system is recovering. The jade plant does not need fertilizer during this time and it could burn the roots."
    },
    {
      "title": "Keep the plant out of direct sunlight.",
      "content": "Keep the plant out of direct sunlight. As the leaves are not receiving moisture as efficiently as usual, they could be burned by too much sunlight [12] X Expert Source Andi Xoch Plant Specialist Expert Interview. 4 August 2021. ."
    }
  ]
}