{
  "url": "https://www.wikihow.com/Take-on-Me-Meaning",
  "title": "An In-Depth Interpretation of ‘Take On Me’ by a-ha",
  "steps": [
    {
      "title": "Most interpretations say the song is about love that’s slipping away.",
      "content": "Most interpretations say the song is about love that’s slipping away. While there’s no one definitive meaning to “Take On Me,” most fans and analysts believe that the lyrics are being sung to a romantic partner who’s falling out of love with the singer. The song’s repeating chorus asks the recipient of the song to “take them on,” possibly implying that the singer wants their partner to stick with them and give them another chance. When the lyrics read “I’ll be gone in a day or two,” we realize that this relationship is fleeting and that the singer wants to hold onto it for as long as possible. [1] X Research source Another interpretation that supports this meaning behind the song is that “take on me” directly translates to “touch me” or “hold me” in Norwegian (the band is Norwegian). The Norwegian phrase “Ta på meg” means “touch me” or “hold me” but it literally means “Take on me” when translated to English. [2] X Research source So, many Norwegian speakers believe that “take on me” in the context of the song is meant to mean “hold onto me” or “touch me,” before the singer is “gone in a day or two.” In other words, the singer wants their S.O. to be with them physically before their time together is over. This theory is also supported by the fact that another a-ha single, “ The Sun Always Shines on T.V. ” This song’s opening lyrics are “Hold me / Touch me,” leading some fans to believe that a-ha just reused these lines but translated them directly from Norwegian to English. [3] X Research source Other less popular interpretations claim that “take on me” is a form of taunt (i.e., “Come over and fight me, then, try taking me on!”), or a statement about needing to give into fate during your short time on Earth. In the latter meaning, the song would tell of a man who’s searching for his one true love to come and “take him on,” but he hasn’t found her yet. [4] X Research source"
    },
    {
      "title": "Verse 1",
      "content": "Verse 1 The first verse of this song sets up the relationship between the couple. The narrator notices that his girlfriend is “shyin’ away” and losing interest in him. However, he professes that he’s still going to fight for her and win her back, singing, “I’ll be comin’ for your love, okay?” The narrator also expresses a certain vulnerability, admitting that the couple keeps “talking away” and that he doesn’t know what to say but he’ll “say anyway.” Here, the singer tells that he’s not quite sure how to fix the relationship or express himself, but he’s still going to try rather than stay silent and lose the woman he loves. [5] X Research source"
    },
    {
      "title": "Chorus",
      "content": "Chorus In the song’s iconic chorus, the singer repeats the titular “Take on me” and the rephrase “Take me on” before proclaiming that he’ll “be gone in a day or two.” The resounding interpretation of this chorus is that the narrator is asking his lover to be with him before he goes away or the relationship ends due to her lack of interest. However, the grammatically incorrect phrasing of “take on me” has inspired a lot of debate over what this line really means and why the band chose to include it as the song’s most defining lyric. [6] X Research source “Take me on” may be a plea for a lover to stay despite complications, similar to how English speakers might say they need to “take on” a challenging or tedious task. Alternatively, however, it may simply be a roughly translated line meaning “touch me” or “hold me,” given that the singers and songwriters of the track are not native English speakers. Ultimately, it is a pop song, so they may have just gone with whatever phrasing sounds the most catchy and in line with the track’s rhythm. In an interview with Rolling Stone Germany , two of the band’s members gave their own take on why they used the cryptic “Take On Me” as the song’s title: [7] X Research source Magne Furuholmen, co-writer and keyboardist: “We wanted to use the fact that we’re not English or American, but Norwegian, to our advantage. We didn’t want to pervert the language, but rather signal that we come from another place without sounding cheesy. Create a construction, a play on words to stand out.” Pål Waaktaar-Savoy: “‘Take On Me’ felt natural to us. We were three Norwegians listening attentively to the Londoners. We picked up expressions, and I wanted to use some of them in our songs. ‘Take On Me’ had something of a ‘You Can Take On Anyone’ or ‘Take On The World’ feel to it. ‘Take Me On’ as the first line in the chorus was out of the question for me. I knew that people would ask me about the title ‘Take On Me’ and ask what it meant—but I had to stick to my guns. ‘Take On Me’ was previously unknown as a catchphrase.”"
    },
    {
      "title": "Verse 2",
      "content": "Verse 2 In the second verse, we learn more about the singer’s emotional state—he’s “odds and ends,” implying that he’s all jumbled up and doesn’t have everything figured out. However, he’ll still “be stumblin’ away,” or continuing to get back up and try despite the fact that things are a little messy. In the last few lines, he’s also coming to terms with the fact that “life is okay” even if he loses the woman he loves. He realizes that “it’s no better to be safe than sorry,” and that he’d rather take the risk of loving and end up losing it than to play it safe and never fall in love at all. [8] X Research source"
    },
    {
      "title": "Verse 3",
      "content": "Verse 3 In the final verse before the outro (which repeats the chorus to fade out the song), the singer describes how his girlfriend says things to calm him down but he doesn’t believe that they’re true: “Oh, things that you say / Yeah, is it life or just to play / My worries away?” The narrator then describes, in one of the most poignant lines of the song, that she is “all the things [he’s] got to remember.” In a nutshell, he’s saying that all of his most important memories have her in them, and he doesn’t want to lose those memories or his positive feelings about them. [9] X Research source To close out the third verse, the singer reiterates his statement from the first chorus: “You’re shyin’ away / I’ll be comin’ for you anyway.” In other words, despite the fact that he feels her slipping away, he’s determined to hold on to her and continue fighting for their love."
    },
    {
      "title": "In the video, a couple meets in an animated world before fleeing to reality.",
      "content": "In the video, a couple meets in an animated world before fleeing to reality. The video opens with a montage of pencil-drawn comic book images. [10] X Research source We then see a young woman in the real world reading the comic book at a diner. [11] X Research source Then, we see surprise in her face as a sketched version of a-ha’s lead singer winks back at her from the comic book before reaching out a hand to beckon her in. [12] X Research source The woman is then pulled into the comic book, where she turns into a pencil-sketch version of herself. [13] X Research source The rest of the video shows the man and woman affectionately dancing together as the video alternates between comic book-style and film shots. [14] X Research source The waitress at the diner (in the real world) finds the table empty and believes that the woman has left without paying her bill. She crumples up the comic book and tosses it in the trash, causing other parts of the comic book, which are more violent, to collide with the couple’s story. [15] X Research source Two comic book characters attack and chase the couple with a wrench. [16] X Research source The lead singer opens a hole in the “wall” that allows the woman to escape back to the diner. [17] X Research source She grabs the comic book out of the trash and takes it home with her, where she desperately skims through the story to figure out what happened to the man. [18] X Research source She sees that the man appears to have been hit and killed with the wrench—however, he then appears in her “real world,” fighting to escape the comic book version of himself. The video ends on the two of them smiling at each other, reunited in the real world. [19] X Research source"
    },
    {
      "title": "It was the first music video to combine animation with live action.",
      "content": "It was the first music video to combine animation with live action. The music video, which was a sensation at the time and has since reached legendary status, uses mixed-media art to depict the story. The creators used a technique known as rotoscoping—which had never been used in a music video before—to combine illustrated frames with live action ones. The video took 16 weeks to produce and cost about $200,000 to make. [20] X Research source The innovative and revolutionary video was directed by Steve Barron (“Billie Jean,” “Money for Nothing”). It went on to win six awards at the 1986 MTV Video Music Awards, including Video of the Year. [21] X Research source In 2020, the music video became only the second music video from the 1980s to reach 1 billion views on YouTube (with the first being “Sweet Child O’Mine” by Guns & Roses). As of 2025, the video has been viewed on YouTube over 2 billion times."
    },
    {
      "title": "“Take On Me” was written amidst the mid-80s rise in synthpop music.",
      "content": "“Take On Me” was written amidst the mid-80s rise in synthpop music. Synthpop had been steadily rising in popularity as a distinct genre from the late 1970s into the early 1980s. [22] X Research source As part of the new wave movement, synthpop emerged as a counter-culture to the previously popular punk rock genre. Electronic musical synthesizers were also becoming more widely available, so the blending of electronic and acoustic elements in music emerged as an inventive and pioneering sound. [23] X Research source a-ha initially released “Take On Me” in 1984, leaving their mark in the synthpop genre and following the footsteps of other influential bands like Depeche Mode, New Order, and Duran Duran. [24] X Research source"
    },
    {
      "title": "“Take On Me” was unsuccessfully recorded twice before its final release.",
      "content": "“Take On Me” was unsuccessfully recorded twice before its final release. The band wrote “Take On Me” in 1984, changing its initial title, “All's Well That Ends Well and Moves With the Sun,” to the snappier version we know today. The song was recorded twice—however, the band wasn’t happy with either of their recorded versions, nearly giving up on the song and scrapping the track for good. The initial release in the United Kingdom only charted at 137, the lowest performance of all a-ha songs. Although it did peak at number 3 in Norway, it failed to make an international impact. The second release was accompanied by a standard performance video—this release was also a flop. [25] X Research source However, record executives at the Warner Brothers label thought that the song had too much potential to give up on. So, they decided to produce a music video to help the song reach larger audiences. Spoiler alert: it did . After the music video came out, the single was released in the U.S., where it immediately soared onto the Billboard Hot 100 and became a global hit, reaching the No. 1 spot in several countries."
    },
    {
      "title": "The song's 1985 release charted very well and is still popular today.",
      "content": "The song's 1985 release charted very well and is still popular today. The final release of the song appeared on the Billboard Hot 100 almost immediately and reached number one in October 1985. It stayed on the chart for 27 weeks. [26] X Research source In the United Kingdom, it debuted at number 55 on the UK Singles Chart and reached number 2 by the end of October, where it remained for three consecutive weeks. The song also reached the top of singles charts in countries like Austria, Belgium, Germany, Italy, the Netherlands, Sweden, Switzerland, and—of course—the band’s native Norway. [27] X Research source The song remains a popular music staple four decades after its release. As of 2025, “Take On Me” has over 2.29 billion streams on Spotify and has surpassed 5 million radio plays in the United States. [28] X Research source In 2023, the staff at Billboard magazine ranked “Take On Me” at number 26 on the list of the 500 Best Pop Songs released post-1958. On August 14th, 2020, the track was certified gold by the British Phonographic Industry. [29] X Research source"
    },
    {
      "title": "“Take on Me” has appeared in movies and shows like Glee and Deadpool 2.",
      "content": "“Take on Me” has appeared in movies and shows like Glee and Deadpool 2 . The track has been sung by cast members on television shows like Glee , Chuck , Family Guy , and Psych . It was also included on the soundtrack of films like Bumblebee and Deadpool 2 . Some commercials, such as Volkswagen’s 2010 advertisement , and video game series, like SingStar (2004), have featured the song."
    },
    {
      "title": "Many artists have covered or sampled the song, such as Weezer and Pitbull.",
      "content": "Many artists have covered or sampled the song, such as Weezer and Pitbull. Despite the popularity of “Take On Me,” few artists have covered it due to the wide vocal range that’s nearly impossible to achieve (unless you’re Morten Harket). However, some artists have risen to the challenge of releasing a cover, including Reel Big Fish , A1 , Weezer , Pentatonix , and Metallica . Other artists have opted to sample the song, so it can be found woven into tracks by musicians like Pitbull . It’s also been represented in other forms of media as a parody or homage, including Make Me Smile by Steve Harley & Cockney Rebel, Barbie Girl by Aqua, Feel Good Inc. by Gorillaz, and Take On Mars by Bohemia Interactive."
    },
    {
      "title": "The song’s impact is evident among musicians, artists, and audiences.",
      "content": "The song’s impact is evident among musicians, artists, and audiences. As, arguably one of the most famous and well-known songs of all time, “Take On Me” has had an indelible impact on the recording industry and the tastes of musical audiences. The song itself has resonant lyrics and an infectious melody that’s become the defining sound of 1980s synthpop. a-ha contributed greatly to the popularity of electronic instruments and synthesizers, which are still used today by chart-topping artists like The Weeknd, Dua Lipa, and Taylor Swift. [30] X Research source The music video for “Take On Me” was also revolutionary in both its production and its reception. The animation style of the video was something that hadn’t been seen in a mainstream way before, making it a fascinating artistic feat and buzzworthy topic for viewers of the day. The rotoscoped video also serves as an early example of how music videos can add to the lore of a song and propel it to greater popularity."
    },
    {
      "title": "a-ha is Norwegian trio Pål Waaktaar, Magne Furuholmen, and Morten Harket.",
      "content": "a-ha is Norwegian trio Pål Waaktaar, Magne Furuholmen, and Morten Harket. The synth-pop group formed in Oslo in 1982 before rising to fame after the release of their debut album Hunting High and Low (1985). The band’s founding members are Pål Waaktaar-Savoy (guitarist), Magne Furuholmen (keyboardist), and Morten Harket (lead vocalist). a-ha’s most famous track is “Take On Me,” but they’ve also released other popular singles like “The Sun Always Shines on T.V.” and “Crying in the Rain.” [31] X Research source As of 2025, a-ha has released 10 studio albums and sold over 55 million records worldwide. Each member has also released solo projects, like Morten Harket’s Wild Seed (1995), Magne Furuholmen’s Past Perfect Future Tense (2004), and Pål Waaktaar-Savoy’s band, Savoy. [32] X Research source The band has also worked with major artists like Coldplay, Pitbull, Kylie Minogue, and Adam Lambert. They have also contributed to film soundtracks, including The Living Daylights (1987) and Frozen 2 (2019). [33] X Research source"
    },
    {
      "title": "“Take On Me”’s iconic keyboard riff was written when Furuholmen was 15.",
      "content": "“Take On Me”’s iconic keyboard riff was written when Furuholmen was 15. Magne Furuholmen, the band’s keyboardist and co-songwriter, wrote the keyboard section of the song when he was fifteen years old. In an interview, Furuholmen described how he “had no idea at the time that it would be such a definitive statement. I remember Päl trying to diss it and saying, ‘oh, this sounds way too commercial, it sounds like an advertising jingle or something,’ because we were into the ‘60s and more flowery, psychedelic, darker stuff at the time.” [34] X Research source Despite this initial reaction, Furuholmen maintained that the riff was catchy and revealed that, when Morten joined the band, he was the one to say, “‘This riff has got to go on our first record. It’s a hit riff.’”"
    },
    {
      "title": "“Take On Me”’s melody was partially inspired by a Juicy Fruit advertisement.",
      "content": "“Take On Me”’s melody was partially inspired by a Juicy Fruit advertisement. Morten Harket, the band’s lead singer, explained that the initial piano riff reminded him “of an advert for chewing gum that went, ‘Juicy Fruit is a packet full of sunshine.’ That influenced the verse melody. Päl had the idea of really using my vocal range in the chorus, having notes rising in octaves like Strauss’s Also Sprach Zarathustra. As for hitting that last high note, you either have wings or you don’t—the voice is not in the throat, it’s in the blood. It’s what you envisage, what you believe. People think the chorus is the hard part in ‘Take On Me,’ but they’re wrong. The hard part was making the verses bounce.” [35] X Research source"
    },
    {
      "title": "All three members of a-ha are knights.",
      "content": "All three members of a-ha are knights. In honor of the band’s contribution to Norwegian music and global visibility for the country, the three founding members were dubbed Knights of the 1st Class of the Royal Norwegian Order of St. Olav in 2012. [36] X Research source"
    },
    {
      "title": "The name “a-ha” was originally going to be used as a song title.",
      "content": "The name “a-ha” was originally going to be used as a song title. Päl Waaktaar-Savoy wrote a song with the title “a-ha.” However, when presenting it to the band, Morten Harket thought that it would be a great name for the band itself. The group then consulted dictionaries to discover that the word “a-ha” existed in several languages, making it a great fit for a band with international aspirations. [37] X Research source"
    },
    {
      "title": "The band holds two entries in the Guinness World Records.",
      "content": "The band holds two entries in the Guinness World Records. One entry is for the longest same-pitch note in a song that made the UK’s Official Singles Chart. In “Summer Moved On” (2000), a-ha’s Morten Harket sings a 20.2-second note that claimed this record. The other entry is the record for the highest-paid concert audience in history. In January 1991, the band performed at the Maracanã as part of Rock in Rio to a crowd of 198,000. [38] X Research source"
    },
    {
      "title": "You can try Magne Furuholmen’s favorite burger in Trondheim, Norway.",
      "content": "You can try Magne Furuholmen’s favorite burger in Trondheim, Norway. Trondheim is Norway’s third-biggest city and home to an iconic red building known as Studentersamfundet, or “Student Society.” In this building, you can find a restaurant called Sesam, where Magne Furuholmen (a-ha’s keyboardist) ate a burger in 2003 after playing a concert in Studentersamfundet. Furuholmen loved this burger so much that he had Sesam’s owner travel to Oslo to cater his garden party later that year. [39] X Research source"
    }
  ]
}