{
  "url": "https://www.wikihow.com/Tell-Your-Parents-You-Lost-Something",
  "title": "How to Tell Your Parents You Lost Something",
  "steps": [
    {
      "title": "Try to predict how your parents will react.",
      "content": "Try to predict how your parents will react. If you're delivering bad news, it can help to try to predict the reaction you may receive. Before confessing you lost something, think about how your parents may feel about this. Have a little empathy so you can predict the reaction and figure out the best means to deliver the news. What did you lose? Parents are unlikely to be angered by the loss of a small item, but if you lost something big and expensive, they may be angrier. They probably worked hard for the money to pay for a bigger item. They may view the fact you lost it as a form of disrespect or irresponsibility. This is their view, however, and you should still continue to plead your case despite what they may think. Considering how your parents are likely to feel, what's the best way to approach the situation? Think about how you would react in the same situation. How would you prefer the news to be delivered?"
    },
    {
      "title": "Think of a good time and place to talk.",
      "content": "Think of a good time and place to talk. You want to make sure you don't deliver the news at a bad time. If your parents are very busy on a particular day, they may react with stress if you give them bad news. Pick a time when both of your parents are free and relatively relaxed. This can help them keep their emotions in check. Also, think about place. Where is a good place to deliver the news you lost something? [1] X Research source You may want to pick a public place, as this may force your parents to stay calm. They're unlikely to yell at, say, a restaurant. Try telling them over dinner or lunch when you're out. However, if you're nervous, you may feel more comfortable having the discussion at a more private place."
    },
    {
      "title": "Practice what you will say.",
      "content": "Practice what you will say. It's never easy to tell someone you lost something. As you'll likely be nervous during the conversation, practicing what to say can help. This can prevent you from stumbling over your words while breaking the news to your parents. It may help to write down what you want to say first. You can stand in front of a mirror and rehearse. For example, you can practice saying something like, \"Mom, Dad. I wanted to let you know I lost the car keys. I know it's expensive to have them replaced, and I'm sorry.\""
    },
    {
      "title": "Consider what you want and what your parents might want from the conversation.",
      "content": "Consider what you want and what your parents might want from the conversation. When having any difficult conversation, it's important to have goals. Before sitting down with your parents, think about what you hope to gain by telling them you lost something. [2] X Research source Do you simply want your parents to know what happened? If you lost something important, like a phone or credit card, it's important your parents have this news. The item may need replacing. You may also want to apologize and find a solution for the future. If you lost something your parents bought you, they likely want an apology. Think about how you will offer to fix the situation. Offering to replace or pay for the item shows your parents you are ready to deal with the consequences of your own actions."
    },
    {
      "title": "Raise the topic carefully.",
      "content": "Raise the topic carefully. When introducing a difficult topic, you may be nervous. Let your parents know from the get-go they may be disappointed by your news. At a moment when your parents are relatively calm, carefully let them know you have something to tell them. [3] X Research source You can begin with something like, \"Mom, I need to tell you something. I'm a little afraid you'll be disappointed.\" This way, your parents will be prepared for bad news going into the conversation. This will lessen the shock slightly when you confess to losing something."
    },
    {
      "title": "Be upfront about what happened.",
      "content": "Be upfront about what happened. At this point, there's nothing to gain from obscuring the truth. Tell your parents what you lost and how you lost it. Losing an item can be a breach of trust, and in order to regain your parents trust you should be as honest as possible going forward. [4] X Research source Accept responsibility for your mistake. Simply bite the bullet and tell them what happened right away. Do not try to minimize or excuse your behavior. Present a plan to replace the lost item using your own money whenever possible. For example, you might say, \"I wanted to let you know I lost my new phone. I'm really sorry and I should have been more careful. When I got home from the movies last night, it wasn't in my bag. I want to use my allowance money to replace it.\""
    },
    {
      "title": "Keep your emotions in check.",
      "content": "Keep your emotions in check. Saying you lost something is stressful. You may be inclined to cry or yell during the conversation, especially if your parents are mad. However, strive to keep your emotions in check. There's not much to gain by getting emotional in these kinds of situations. [5] X Research source It's a bad idea to go forward with the discussion if everyone's moods are high. If you start raising your voice, or if your parents do, it's okay to put things on pause. You can say something like, \"I see that you guys are disappointed in my actions. Maybe we can continue talking later?\""
    },
    {
      "title": "Listen without arguing.",
      "content": "Listen without arguing. You do not want to be argumentative, especially when delivering bad news. Your parents may be angry. They may express their disappointment or frustrations. Try to remain calm and listen. Do not argue or whine in response. [6] X Research source Your parents may want to discipline you in some ways. While you may find this frustrating or unfair, arguing will only make it worse. If you accept the punishment without argument, you'll come off as more mature."
    },
    {
      "title": "Use \"I\"-statements if necessary.",
      "content": "Use \"I\"-statements if necessary. \"I\"-statements focus on your personal feelings. You state your feeling, how your parents are making you feel that way, and why you feel the way you do. This can help things run more smoothly during an argument. [7] X Research source For example, you can say something like, \"I feel stressed that you're yelling at me right now because it's not helping to solve the problem.\" An \"I\"-statement can come off as less judgmental, as you're emphasizing how you feel over an objective assessment of the situation."
    },
    {
      "title": "Use your words to deescalate your parents' anger.",
      "content": "Use your words to deescalate your parents' anger. Your parents may be very angry if you lost something. They may yell or scold you. Instead of responding with hostility in return, remain calm and try to use words to deescalate things. Try saying something to acknowledge your parents' feelings. For example, \"Okay, I hear what you're saying. You're disappointed in me. You're making that very clear.\" You should let them know yelling is not helping. Try something like, \"When you yell though, it makes it hard for me to listen. I think we should work on finding a solution instead of getting angry.\""
    },
    {
      "title": "Disengage emotionally.",
      "content": "Disengage emotionally. If you lost something very expensive, your parents may be difficult to calm down. In this case, try to disengage emotionally. Try to avoid letting their anger get to you. Remind yourself everyone occasionally fights with their parents. Just because your parents are angry now, does not mean they will be angry forever. Keep reminding yourself emotions are temporary as you deal with your parents' anger and disappointment."
    },
    {
      "title": "Leave the room if necessary.",
      "content": "Leave the room if necessary. Sometimes, a conversation is not productive. If your parents are simply yelling and angry, propose you take a break. Say something like, \"I know you're mad about the phone, but yelling at me isn't helping. Can we talk about this when you've calmed down?\" Then, get up and leave the room. You can go to your bedroom until your parents are ready to talk to you."
    },
    {
      "title": "Follow up later when your parents are calm.",
      "content": "Follow up later when your parents are calm. Once everyone is calm, you can follow up regarding the conversation. Approach your parents again and say something like, \"So, I know you guys are pretty mad, but what are we going to do about the phone?\" It may be a good idea to give your parents a day to process before following up. [8] X Research source Try to figure out a solution. Your parents may want to look for the missing item. If it can't be found, they may want you to help pay for it. Be calm when working towards a solution. No one likes losing things, but you will need to deal with the situation effectively."
    }
  ]
}