{
  "url": "https://www.wikihow.com/Test-Roblox-Clothes",
  "title": "5 Simple Ways to Preview Roblox Clothing Before Uploading",
  "steps": [
    {
      "title": "Go to Customuse Previewer using a web browser.",
      "content": "Go to Customuse Previewer using a web browser. To do so, go to https://customuse.com/free-tools/roblox-clothes-preview in a web browser. This is a free web application that allows you to preview Roblox clothing on a generic model. It has three different model types from which you can choose."
    },
    {
      "title": "Click Upload Shirt or Upload Pants.",
      "content": "Click Upload Shirt or Upload Pants . They are the orange buttons on the left side of the preview. Alternatively, you can drag and drop your shirt or pants PNG file into the shirt or pants box on the left side."
    },
    {
      "title": "Select your shirt or pants file.",
      "content": "Select your shirt or pants file. Navigate to the PNG file you created for your shirt or pants design . Click the file to select it and click Open ."
    },
    {
      "title": "Select a model type.",
      "content": "Select a model type. Click one of the options in the lower-right corner of the preview window to select a model type. You can select the old “Blocky” model, the boy model, or the girl model."
    },
    {
      "title": "Preview your clothing.",
      "content": "Preview your clothing. Use the preview window to test your clothing. Click and drag to rotate the model. Roll the mouse wheel to zoom in or out. Right-click (or Command-Click on Mac) and drag to pan the model from side to side."
    },
    {
      "title": "Go to the In In-game.clothing previewer in a web browser.",
      "content": "Go to the In In-game.clothing previewer in a web browser. To do so, navigate to https://ingame.clothing/ in your web browser. This is another web application that allows you to preview clothing on a generic model. This one has four model types for you to choose from."
    },
    {
      "title": "Select a model.",
      "content": "Select a model. In-game.Clothing has four models to choose from. Click the radio option next to “Blocky,” “Rounded,” “Woman,” or “Man.” You should see a generic model appear in the preview window."
    },
    {
      "title": "Select the clothing you want to test.",
      "content": "Select the clothing you want to test. To do so, click the Shirt or Pants tab at the top."
    },
    {
      "title": "Drag and drop your template or texture into the box.",
      "content": "Drag and drop your template or texture into the box. Locate the PNG image for your shirt or pants design."
    },
    {
      "title": "Preview your clothing.",
      "content": "Preview your clothing. Use the preview window on the left to preview your design. Click and drag to rotate the model. Use the mouse wheel to zoom in and out. Right-click (or Command-click on Mac) and drag to pan the model from side to side. Additionally, you can click Download model to download the model to test in a 3D program, such as Blender 3D ."
    },
    {
      "title": "Go to the Bloxmate Previewer website.",
      "content": "Go to the Bloxmate Previewer website. To do so navigate to https://bloxmake.com/library/previewer in a web browser. Bloxmate has another online previewer you can use to preview clothing for your avatars."
    },
    {
      "title": "Click Select a PNG File.",
      "content": "Click Select a PNG File . It’s the box on the left that has an icon that resembles a cloud with an arrow pointing up."
    },
    {
      "title": "Select your clothing image.",
      "content": "Select your clothing image. Navigate to the PNG file for your clothing design or texture. Click it to select it. Then click Open ."
    },
    {
      "title": "Select the type of clothing you want to preview.",
      "content": "Select the type of clothing you want to preview. To do so, click Preview Shirt or Preview Pants below the upload box. This will generate a model with your clothing."
    },
    {
      "title": "Use the slider bar to rotate the model.",
      "content": "Use the slider bar to rotate the model. Click and drag the slider bar below the preview to rotate the model."
    },
    {
      "title": "Login to Roblox.",
      "content": "Login to Roblox. Test Out Clothing is a Roblox experience that allows you to preview clothing on your own Avatar before you upload it. Go to https://www.roblox.com/home in a web browser. If you are not already logged in, log in with the username and password associated with your Roblox account. [1] X Research source"
    },
    {
      "title": "Navigate to the Privacy & Content Maturity settings menu.",
      "content": "Navigate to the Privacy & Content Maturity settings menu. Use the following steps to do so: Click the Gear icon in the upper-right corner. Click Settings . Click Privacy & content maturity ."
    },
    {
      "title": "Ensure your inventory is visible to everybody.",
      "content": "Ensure your inventory is visible to everybody. To do so, click Trading & inventory . Then click the radio option next to “Everyone.”"
    },
    {
      "title": "Click the Create tab.",
      "content": "Click the Create tab. It’s the third tab at the top. This opens the Creator Hub."
    },
    {
      "title": "Navigate to Development Items.",
      "content": "Navigate to Development Items. To do so, click Dashboard and then click Development Items ."
    },
    {
      "title": "Upload your clothing image or template as a decal.",
      "content": "Upload your clothing image or template as a decal. Use the following steps to do so: Click Decals , Click Upload Asset , Click Upload . Select your clothing image or template. Click Open Enter a name and description of the image (optional). Scroll down and click Upload ."
    },
    {
      "title": "Open the Test Out Clothing game.",
      "content": "Open the Test Out Clothing game. To do so, click Roblox.com in the lower left corner. Then type “Test Out Clothing” in the search bar at the top. Click the Test Out Clothing game and then click the green button with the Play triangle. The URL for the Test Out Clothing game is https://www.roblox.com/games/10723706942/Test-Out-Clothing"
    },
    {
      "title": "Create a private server.",
      "content": "Create a private server. Creating a private server is free. To create a private server, click the Servers tab and then click Create Private Server below the “Servers” tab. Enter a name for your server and click Buy Now . Then when asked if you want to customize your server, click Not Now . You will see your private server listed below “Private Servers.”"
    },
    {
      "title": "Join your private server.",
      "content": "Join your private server. To do so, click Join in the box that has your private server’s name. Then click Open Roblox Game Client . You must have the Roblox Game Client installed to open it. If you do not have it installed, you will be asked to download and install it ."
    },
    {
      "title": "Remove your current clothing.",
      "content": "Remove your current clothing. To do so, click Remove on the right side. Then click Remove next to “Remove Pants” or “Remove Shirt”."
    },
    {
      "title": "Click Test Shirt or Test Pants.",
      "content": "Click Test Shirt or Test Pants . Both buttons are on the left side. This will open a panel that displays all your decals,"
    },
    {
      "title": "Click the decal of your shirt or pants template.",
      "content": "Click the decal of your shirt or pants template. This will put the clothing on your avatar."
    },
    {
      "title": "Click Close Panel.",
      "content": "Click Close Panel . This allows you to view the clothing on your avatar. You can walk around the environment. Press the left or right arrows or right-click and drag to rotate around your avatar. To leave the game, click the Roblox icon in the upper-right corner and click Leave ."
    },
    {
      "title": "Login to Roblox.",
      "content": "Login to Roblox. You can test your clothing items in Roblox Studio before uploading them. To do so, first, you need to upload the graphic as a decal. It doesn’t cost anything to do so. Go to https://www.roblox.com/home in a web browser. If you are not already logged in, log in with the username and password associated with your Roblox account. [2] X Research source"
    },
    {
      "title": "Click the Create tab.",
      "content": "Click the Create tab. It’s the third tab at the top. This opens the Creator Hub."
    },
    {
      "title": "Navigate to Development Items.",
      "content": "Navigate to Development Items. To do so, click Dashboard and then click Development Items ."
    },
    {
      "title": "Upload your clothing image or template as a decal.",
      "content": "Upload your clothing image or template as a decal. Use the following steps to do so: Click Decals , Click Upload Asset , Click Upload . Select your clothing image or template. Click Open Enter a name and description of the image (optional). Scroll down and click Upload ."
    },
    {
      "title": "Copy the ID number for your clothing.",
      "content": "Copy the ID number for your clothing. You’ll need the ID number to access it in Roblox Studio. To get the ID number, click the graphic or texture decal in the Creator Hub dashboard after you upload it. Copy the numeric portion of the URL that appears after “store/” in the address bar at the top. Highlight the ID number in the URL and press Ctrl + C (or Command + C on Mac) to copy the number."
    },
    {
      "title": "Open Roblox Studio.",
      "content": "Open Roblox Studio. Click the blue Roblox Studio icon in the Windows Start menu or Applications folder on Mac to open Roblox Studio."
    },
    {
      "title": "Open an experience.",
      "content": "Open an experience. Click an experience in Roblox Studio to open. It can be any experience. It can be one you’ve designed or it can be one of the templates."
    },
    {
      "title": "Add an avatar.",
      "content": "Add an avatar. You can use any of the avatars in Roblox Studio, including your own avatar, but the block avatar will work best. Use the following steps to add an avatar: Click Avatar in the menu bar at the top. Click Rig Builder . Select “R15” or “R6”. R15 is the more complex avatar with 15 body parts. Select a feminine or masculine body shape. Click one of the avatar types. Block Avatar will work best."
    },
    {
      "title": "Add a blank shirt or pants to the avatar.",
      "content": "Add a blank shirt or pants to the avatar. Use the following steps to do so. Click the avatar to select it. Expand “Rig” in the “Explorer” window to the right. Click the plus (+) icon next to Rig. Click Shirt or Pants"
    },
    {
      "title": "Open the clothing properties window.",
      "content": "Open the clothing properties window. Click the clothing icon with the pants or the shirt icon in the Explorer window. You should see the properties window below the Explorer window."
    },
    {
      "title": "Paste the decal ID number in the shirt or pants template field.",
      "content": "Paste the decal ID number in the shirt or pants template field. You should see a box labeled “ShirtTemplate” or “PantsTemplate” below “Appearance” in the properties window. Paste the ID number you copied from the Creator Hub dashboard. Paste it in the field to the left and press Enter . This will put the clothing on the avatar."
    },
    {
      "title": "Preview the clothing.",
      "content": "Preview the clothing. You can view the avatar with the clothing in the preview window. Roll the mouse wheel to zoom in and out. Right-click and drag to rotate the camera. Click the mouse wheel and drag to pan the camera from side to side."
    }
  ]
}