{
  "url": "https://www.wikihow.com/Unhide-Columns-in-Excel",
  "title": "How to Show Hidden Columns in Microsoft Excel & Unhide Column A",
  "steps": [
    {
      "title": "Hover your cursor directly to the right of the hidden columns.",
      "content": "Hover your cursor directly to the right of the hidden columns. When your cursor is between the column letters adjacent to the hidden columns, the cursor will change into two parallel lines with two arrows pointing horizontally. You can identify hidden columns by looking for two lines between column letters. Your cursor needs to be to the right of the two lines for this method. Placing the cursor to the left will increase the column size of the left adjacent column."
    },
    {
      "title": "Click and drag to the right.",
      "content": "Click and drag to the right. This will unhide the hidden columns between the adjacent columns. [1] X Research source Alternatively, you can double-click to immediately unhide the hidden column."
    },
    {
      "title": "Release the mouse button.",
      "content": "Release the mouse button. This will confirm the size of the unhidden columns. You’re ready to move some columns , sort your data , and add up column values !"
    },
    {
      "title": "Select the columns on both sides of the hidden columns.",
      "content": "Select the columns on both sides of the hidden columns. To do this: Hold down the ⇧ Shift key while you click both letters above the column Click the left column next to the hidden columns. Click the right column next to the hidden columns. The columns will be highlighted when you successfully select them. For example, if column B is hidden, you should click A and then C while holding down ⇧ Shift ."
    },
    {
      "title": "Right-click either of the selected columns.",
      "content": "Right-click either of the selected columns. This will open the right-click pop-up menu. [2] X Research source"
    },
    {
      "title": "Select Unhide in the right-click menu.",
      "content": "Select Unhide in the right-click menu. The hidden columns between the two selected columns will be unhidden. [3] X Research source For more helpful excel tricks, check out our intro guide to Excel ."
    },
    {
      "title": "Click the Name Box.",
      "content": "Click the Name Box. This is the drop down box to the left of the formula box. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source This method is great for unhiding the first column (A) since there isn't a column to its left that you can select to access the right-click Unhide menu option."
    },
    {
      "title": "Type A1 in the Name Box and press ↵ Enter.",
      "content": "Type A1 in the Name Box and press ↵ Enter . Replace A with the letter of the column you want to unhide."
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. It's in the upper-left corner of the Excel window."
    },
    {
      "title": "Click Find & Select.",
      "content": "Click Find & Select . This is in the \"Editing\" group in the Home tab. A drop down menu will open. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select Go To.",
      "content": "Select Go To . This will open the \"Go To\" window."
    },
    {
      "title": "Type A1 in the \"Reference\" box and click OK.",
      "content": "Type A1 in the \"Reference\" box and click OK ."
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. It's in the upper-left corner of the Excel window."
    },
    {
      "title": "Click Format.",
      "content": "Click Format . This button is in the \"Cells\" section of the Home tab; you'll find this section on the right side of the toolbar. A drop down menu will appear. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select Hide & Unhide.",
      "content": "Select Hide & Unhide . This option is below the \"Visibility\" heading in the Format drop down menu. Selecting it will open a pop up menu."
    },
    {
      "title": "Click Unhide Columns.",
      "content": "Click Unhide Columns . It's near the bottom of the Hide & Unhide menu. Doing so will immediately unhide the column you selected in the Name Box."
    },
    {
      "title": "Click the triangle in the top left corner of the spreadsheet.",
      "content": "Click the triangle in the top left corner of the spreadsheet. This is next to the row 1 label and column A label. Clicking the triangle will select the entire spreadsheet. Hiding columns can be useful for when you have data you don’t need at the moment, but want to keep in the spreadsheet. For example, if you’re tracking your bills in Excel , you might want to hide purchase categories when you’re only working with the sum totals."
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. It's in the upper-left corner of the Excel window."
    },
    {
      "title": "Click Format.",
      "content": "Click Format . This button is in the \"Cells\" section of the Home tab; you'll find this section on the right side of the toolbar. A drop down menu will appear. [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select Hide & Unhide.",
      "content": "Select Hide & Unhide . This option is below the \"Visibility\" heading in the Format drop down menu. Selecting it will open a pop up menu. [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Unhide Columns.",
      "content": "Click Unhide Columns . It's near the bottom of the Hide & Unhide menu. Doing so will immediately unhide every hidden column in the sheet. [9] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}