{
  "url": "https://www.wikihow.com/Stop-Peeing-the-Bed-when-You%27re-Drunk",
  "title": "How to Stop Wetting the Bed after Drinking Alcohol",
  "steps": [
    {
      "title": "Cut out caffeinated drinks",
      "content": "Cut out caffeinated drinks when you’re drinking alcohol. Caffeine stimulates your bladder muscles and causes you to urinate more often. Steer clear of cocktails like rum and Cokes, vodka Red Bulls, espresso martinis, or other caffeinated beverages while you’re out. Try not to have a late night coffee or energy drink, either—they may make you feel less drunk, but they could lead to you wetting the bed. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Resist caffeine or energy drinks before going out, too. Caffeine can stay in your body for up to 10 hours, and about half of it will still be in your system 6 hours after you drink. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Have fewer drinks or switch to liquor so your bladder won’t fill up.",
      "content": "Have fewer drinks or switch to liquor so your bladder won’t fill up. Part of the reason you might be wetting the bed is that you’re consuming a lot of fluids. Instead of a 16 fl oz (470 mL) beer, try having a glass of wine or a short cocktail like a gin and tonic. The alcohol content is about the same, but there’s a lot less fluid to drink. If you’re still urinating in bed, cut back on your alcohol intake as a whole. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For instance, if you typically enjoy 3 drinks before you feel drunk, cut back to 1 or 2. The less liquid and alcohol you consume, the less likely it is that you’ll pee during the night. Pace yourself and take breaks between beverages. This gives your body time to metabolize all that fluid instead of letting it build up. Drink responsibly if you’re using liquor as a low-liquid substitute. A shot of liquor is as strong as a whole can of beer or glass of wine."
    },
    {
      "title": "Switch to water once you feel intoxicated so you won’t black out.",
      "content": "Switch to water once you feel intoxicated so you won’t black out. “Blacking out” means you drank so much alcohol that you lose memories of the night. This increases your chances of wetting the bed dramatically since you’re less likely to feel the need to pee, wake up, and get out of bed to relieve yourself. To prevent a black out, sip on water between alcoholic beverages and stop drinking as soon as you feel intoxicated. Instead, drink water to stay hydrated . [5] X Research source Even if you wake up while blacked out, your inhibitions may be lowered enough that you drunkenly decide not to get up to pee. If you get blackout drunk often, it’s possible you may have a problem with alcohol. Talk to your doctor to find out if you may be drinking too much."
    },
    {
      "title": "Stop drinking 2-3 hours before bed so you have time to urinate.",
      "content": "Stop drinking 2-3 hours before bed so you have time to urinate. Once you’re done drinking, it still takes a few hours to fully empty your bladder since your body keeps making urine. Give yourself at least 2-3 hours to pass all of your urine before you go to bed after a night of drinking. This reduces the risk of your bladder getting overly full while you’re sleeping. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For instance, if you typically go to bed at 10:00 p.m., have a drink or 2 with dinner but stop drinking by 8:00 p.m. If you don’t have a set bedtime, simply stay up an extra few hours after your last drink."
    },
    {
      "title": "Urinate at the beginning and end of your bedtime routine.",
      "content": "Urinate at the beginning and end of your bedtime routine. Pee frequently when you get home after drinking to empty your bladder as much as possible before bed. Go before you start getting ready for bed , then again right before you climb under the covers. This allows you to fall asleep with a completely empty bladder. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You probably already pee before bed, but it’s possible your bladder isn’t totally empty after just one bathroom visit. For example, you might pee, wash your face, brush your teeth, put on your pajamas, and pee once again right before turning out the lights."
    },
    {
      "title": "Set an alarm during the night so you get up to urinate.",
      "content": "Set an alarm during the night so you get up to urinate. After you’ve been drinking, it’s highly likely that your body will continue to produce a lot of urine once you’re in bed. Since you’re less likely to wake up if you’re drunk, set your alarm for 2-4 hours after you go to bed. Getting up during the night to pee can help you limit your risk of wetting the bed. [8] X Research source Try different times to see what works for you. For instance, you might find that getting up about halfway through the night is best for your body."
    },
    {
      "title": "Use protective underwear or bed liners until you find what works for you.",
      "content": "Use protective underwear or bed liners until you find what works for you. It may take some trial and error to determine which changes help you stop peeing the bed. During this time, you may still have some accidents. While this is frustrating, you don’t have to wake up to wet sheets. Use protective briefs or bed liners when you go to bed drunk until you feel sure you won't wet the bed. [10] X Research source If you want an easy option, use a protective underwear liner that you can stick in your underwear. For extra protection, look for disposable briefs or boxers that collect your urine."
    },
    {
      "title": "Visit your doctor or therapist if you think you’re drinking too much.",
      "content": "Visit your doctor or therapist if you think you’re drinking too much. Wetting the bed while you’re drunk doesn’t mean you necessarily have a problem with alcohol (especially if it only happens occasionally), but you may still be engaging in unhealthy behavior. Talk to your doctor if you’re wetting the bed often or are concerned about your drinking. They can help you figure out if you may need to cut back on alcohol or get treatment for alcoholism. [11] X Research source If you’re not sure what to say, just ask “I think I’ve been drinking too much lately. What options do I have to change my habits?” Don’t feel embarrassed about discussing bedwetting with your doctor. It’s common to wet the bed when you’re drunk, and they’re used to discussing this type of issue."
    },
    {
      "title": "Ask your doctor if your medications increase your risk of bedwetting.",
      "content": "Ask your doctor if your medications increase your risk of bedwetting. While your bedwetting may be caused by drinking, some medications can increase your risk of wetting the bed after a few drinks. Talk to your doctor if you suspect you might be taking a medication that’s triggering bedwetting while you’re drunk. [12] X Research source You may be more likely to wet the bed if you’re taking the following medications: Insomnia treatments like benzodiazepines Psychiatric medications like clozapine, thioridazine, or risperidone Hypnotics or sedatives prescribed for sleeping disorders"
    },
    {
      "title": "See your doctor if you think your bedwetting is due to a medical condition.",
      "content": "See your doctor if you think your bedwetting is due to a medical condition. Some medical conditions can make you more likely to wet the bed, especially when you’re drunk. If this is the case for you, you’ll likely need to treat your underlying condition to stop peeing the bed. Your doctor will perform a physical exam and urine test to find the source of the problem. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Visit your doctor if any of the following apply to you: You’re wetting the bed on nights you don’t drink. You’re a man over the age of 65 who is suddenly wetting the bed after drinking. You have the symptoms of diabetes . You’re snoring and have disruptive sleep, which can be a sign of sleep apnea."
    }
  ]
}