{
  "url": "https://www.wikihow.com/Write-a-Sad-Song",
  "title": "How to Write a Sad Song",
  "steps": [
    {
      "title": "Learn how songs are composed.",
      "content": "Learn how songs are composed. Lyrically, songs are made up of verses, choruses, and lyrics. Familiarize yourself with these different parts of a song. This will help you establish the basics and begin the songwriting process. The verses of a song usually have the same melody but different lyrics. For example, in \"Eleanor Rigby\" the verses all follow the same melody, detailing the lives of various lonely people. If you listen closely, you'll notice all these stories follow the same melody and have roughly the same number of syllables. The chorus is a part of a song that is repeated three or four times, each time using the same melody and lyrics. In Eleanor Rigby, the chorus is, \"Ah, look at all the lonely people.\" A chorus is often used to sum up the theme or main point of a song. [1] X Research source The bridge of a song has a different melody and lyrics than the verse or chorus. It provides a break from the usual progression of the song and the lyrics may reveal a hidden insight in the song. Not all songs have bridges, so including one is optional. [2] X Research source Most songs follow this basic structure: verse-chorus-verse-chorus-bridge-chorus. However, there are many variations. Using a basic structure at first, however, can help give you direction creatively. You can always make alterations to the basic structure as you write your song."
    },
    {
      "title": "Be open to a simple melody.",
      "content": "Be open to a simple melody. If you're a beginning songwriter, a simple melody is important. You do not need an elaborate melody to convey a sad feeling. A simple melody, using a few notes or chords, is the best option for a beginning songwriter. To start, practice some popular that are also fairly simple. Use a guitar or piano to play songs like Tom Petty's \"Free Fallin'\" or Pink Floyd's \"Wish You Were Here.\" You'll notice that the melodies are not very complex and yet the songs still convey deep feeling. Experiment. Sit at the piano for a few hours or strum on your guitar. Play a variety of note and chord progressions, feeling around for the right sound. If you're a beginner, it might be best to stick to the 12 basic notes without incorporating flat or sharp notes into your song. Study chord progressions of a variety of sad songs. This may help you get a sense of how musicians compose. Look up the sheet music for your favorite sad songs online and try to play them at home. You do not have to have your melody completely established before you write your lyrics. Both your melody and lyrics will have to be tweaked accordingly as you move through the songwriting process. Just try to get a sense of the general length of your verses, choruses, and lyrics to help guide you as you compose your lyrics."
    },
    {
      "title": "Use the minor third, if possible.",
      "content": "Use the minor third, if possible. When setting your song to music, you'll need to focus on music that conveys a sad feeling. A recent study shows songs written in a minor, the minor third especially, tend to better convey feelings of sadness. If you are writing a sad song, consider switching to minor third at certain points during the song to help your listeners experience sad emotions. [3] X Research source However, listen to a variety of songs that incorporate minor third first. Switching dramatically to minor third may be jarring to listeners. Look up the sheet music for a few songs that use minor third and see how the songwriter's build up to introducing the minor third. If you're a beginner at the piano or guitar, you may not know the minor third. That's okay. While it can help convey a sad feeling, you do not need to use it to write a sad song. The most important thing is to find a melody you're comfortable playing."
    },
    {
      "title": "Listen to your favorite sad songs.",
      "content": "Listen to your favorite sad songs. If you want to write sad music, take some time to listen to your favorite sad songs. One of the best ways to find inspiration is to expose yourself to the work of other artists. This can also help you pay attention to things like melody and structure, providing you insight on how to write your own lyrics. Make a list of your favorite sad songs. They could be break up songs, songs about death and dying, songs about sad events, and so on. Spend an hour or so listening to your sad songs. As you listen, pay attention to the music and lyrics. Ask yourself why the song makes you feel sad. What does the music do to convey a feeling of sadness? How does the speaker's voice sound? What is the pacing of the song like? Try to break the song up into verses, choruses, and bridges. Identifying the different parts of a song's structure can help give you guidance as you write your own lyrics. It can also help to read the lyrics. You can look up lyrics to most songs online. Read the lyrics as if they were poetry and try to analyze them. What is the song about? How does the speaker engage with the subject? Pay close attention to all the words the speaker uses and how they work to convey a feeling of sadness."
    },
    {
      "title": "Do a free write.",
      "content": "Do a free write. A quick free write is a great way to start getting creative. Get out a pen and paper, go to a quiet space, and just write for about 10 minutes. Focus on things that make you sad. What upsets you? What makes you cry? What have been some of the saddest moments in your life? Why were these moments sad? How were you feeling during these times in your life? Try not to work too hard at censoring yourself. Just write down your thoughts as they come. Sometimes, the raw emotions you find when free writing can be used in songwriting later on."
    },
    {
      "title": "Make an outline.",
      "content": "Make an outline. Before you begin composing your lyrics, make a brief outline. Decide how many verses you will have, whether you'll have a bridge, and how long your chorus will be. Then, write the barebones of what you'll be discussing in your song. An outline does not need to use full sentences. You're just trying to convey the basics of what you'll be writing about, how many verses you'll need, and so on. Jot down your title on the top of the page. Then, write \"Verse One\" and provide a sentence fragment about your first verse. For example, \"Verse One, about the sad feeling of change.\" Then, inject your chorus if you're including one. For example, \"Chorus expressing sadness about moving away from Michigan.\" Then, outline what you want to discuss in your second verse. Keep going until your song is fully outlined. You can also take note of roughly how many syllables each verse should contain. This can help provide you structure as you begin composing your lyrics."
    },
    {
      "title": "Consider connotation as you write.",
      "content": "Consider connotation as you write. When doing any kind of creative writing, you need to consider the connotation of the words you use. Connotation is a second meaning that is associated with a word alongside its literal meaning. [4] X Research source For example, the word \"cold\" literally means low temperature. However, cold also carries connotations of closed off, mean spirited, and emotionally distance. As you write your lyrics, pause after each line and evaluate the words. Pick out the most powerful, striking words in any given line and consider what these words could potentially mean for other people. If the connotations do not convey sadness, you might want to find other words. [5] X Research source Say you're writing about a recent breakup. You have a line that says something like, \"When you left, I stood in the sun waiting for your return.\" Sunshine is generally associated with happy memories. If you were left in the sun, the listener might conclude this person's absence had a positive effect on your life. What is a different way you could phrase this? What types of weather do people associate with sad emotions? Consider replacing \"sun\" with something like \"rain\" or \"cold.\" [6] X Research source"
    },
    {
      "title": "Try simile and metaphor.",
      "content": "Try simile and metaphor. Simile and metaphor are figures of speech used frequently in songs. Similes and metaphors compare two different subjects to show their similarities. A simile is a metaphor that uses \"like\" or \"as\" (\"You lived your life like a candle in the wind\") while a metaphor simply states one thing is another (\"Your love is a red dress.\"). [7] X Research source First, get specific. What type of sadness are you trying to convey? Grief? Heartbreak? Loss? Regret? Once you've picked the specific type of emotion you're going for, write down some images and ideas that could be associated with that image. For example, say you're trying to write about grief as your song discusses a lost loved one. Think of images that convey a sense of death, like a barren field, a light flickering out, a decaying plant, and so on. From there, make a metaphor or simile. Say something like, \"Your death was a rose stomped out in its prime.\" Songs do not always make metaphors explicit. Many songs use extended metaphors, using symbolic language throughout a song to talk about one thing when they're really getting at another. Regina Spektor has a song called \"Field Below\" in which she describes a barren landscape. Between Spektor's descriptions, there are lines like, \"But you don't live downtown no more, and everything must come and go.\" This indicates the landscape is a metaphor for a personal loss. [8] X Research source"
    },
    {
      "title": "Pay attention to the musical arraignment in your favorite sad songs.",
      "content": "Pay attention to the musical arraignment in your favorite sad songs. Return to the sad songs you were listening to while hunting for inspiration. Look up the sheet music that goes along with these songs and pay attention to what notes and chords the songwriters used. Do these songs use a fast or slow tempo? How do you feel when you hear these songs? Why? How does the music push for feelings of sadness and pain? It can also be helpful to look up the sheet music for these songs. Learn to play your favorite sad songs on a piano, guitar, or other instrument. This will help you get a sense of how to compose your own melody."
    },
    {
      "title": "Adjust your melody and lyrics.",
      "content": "Adjust your melody and lyrics. After studying various sad songs, play around with your guitar, piano, or other instrument. Strum or play along as you mouth your lyrics, trying to find the right chords, keys, and tones to match the song. It might take some practice and dedication before you find something that works for you. You may have to adjust your lyrics and melody as you go to get the song to work. For example, the melody may not have enough beats for all the lyrics to fit. You'll either have to shorten your lyrics or add to the melody a bit. Remember, a melody does not have to complex, especially if you are a beginning songwriter. Try to keep the melody simple, using a few basic chords or notes throughout. As you write more songs, you can experiment with more complex music."
    },
    {
      "title": "Sing your song and see if there's room for improvement.",
      "content": "Sing your song and see if there's room for improvement. Once you've written the musical accompaniment, sing your song. You might want to make a recording and play it back to yourself. Ask a friend or family member for feedback. Specifically, ask how your friend or family members feels when he or she hears the song. If the song is not coming off as sad, you may have to tweak some of the lyrics or melody a bit to better convey the feeling. It can take quite a few drafts before you get a song where you want it."
    }
  ]
}