{
  "url": "https://www.wikihow.com/Treat-a-Gum-Infection",
  "title": "How to Treat a Gum Infection",
  "steps": [
    {
      "title": "Try an easy salt water rinse to bring swelling down.",
      "content": "Try an easy salt water rinse to bring swelling down. Pour 1 teaspoon (5.7 grams) of salt into 1 ⁄ 2 cup (120 mL) of water and stir until the salt is completely dissolved. [1] X Research source Then, rinse your mouth with the solution for about 1 minute, swishing it all around. Repeat this 2 to 3 times per day until the infection is gone to help clean your mouth and keep the swelling down. [2] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020."
    },
    {
      "title": "Make a turmeric paste to help reduce inflammation.",
      "content": "Make a turmeric paste to help reduce inflammation. Mix 1 teaspoon (2 grams) of turmeric with 1/2 teaspoon (2.5 grams) of salt and 1 ⁄ 2 teaspoon (2.5 mL) of mustard oil or vitamin E oil. [3] X Research source Stir well until the ingredients are combined and form a paste. Then, rub the paste generously onto the infected area. Leave it for 2 minutes, then spit out or swish with water to cleanse. Turmeric has both anti-inflammatory and antibacterial properties, making it a great option for treating your gum infection at home."
    },
    {
      "title": "Use an aloe vera rinse or gel to soothe pain or discomfort.",
      "content": "Use an aloe vera rinse or gel to soothe pain or discomfort. If you are using an aloe vera rinse, buy any 100% aloe vera juice, which is available at most natural foods grocery stores. Use the aloe vera juice the same as you would mouthwash, pouring about 2 tablespoons (30 mL) in a cup and swishing it around in your mouth for about 1 minute. If you prefer to use a gel, you can use any 100% aloe vera gel, or use the gel from the inside of an aloe vera plant. [4] X Research source How much aloe vera gel you use depends on big the infected area is. Start with a dime-sized amount, adding more as needed to cover all the infected gum area."
    },
    {
      "title": "Rub raw honey on your gums to help treat your gum infection.",
      "content": "Rub raw honey on your gums to help treat your gum infection. Pour a few small drops of honey onto your finger and rub the honey gently on the infected area. Try not to get too much honey on your teeth, as it is high in sugar, which can erode your enamel. Leave the honey to sit on your gums until it naturally washes away. For best results, use Manuka honey from New Zealand, which has more potent antibacterial healing properties than regular honey."
    },
    {
      "title": "Use a garlic paste to help kill oral bacteria.",
      "content": "Use a garlic paste to help kill oral bacteria. Crush 1 clove of garlic completely. Mix the crushed garlic with about 1 teaspoon (4.9 mL) of honey or coconut oil until it forms a paste. Apply the paste to your gums, let it sit for 2 minutes, and then let it wash away naturally or rinse. Like honey, garlic paste may help kill the bacteria that is causing your gum infection. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Massage your gums with clove and/or peppermint oil to relieve pain.",
      "content": "Massage your gums with clove and/or peppermint oil to relieve pain. Both clove oil and peppermint oil have a cooling effect, helping to soothe your gums and relieve pain. In addition, both oils have antiseptic and antibacterial properties that can help treat your gum infection. Clove oil may also help reduce swelling due to infection. [6] X Research source Peppermint oil also has anti-inflammatory properties, making it a great option if your gums are irritated and inflamed. [7] X Research source"
    },
    {
      "title": "Seek professional treatment if your symptoms continue or worsen.",
      "content": "Seek professional treatment if your symptoms continue or worsen. If home treatments don’t work and/or your gums are causing you a lot of discomfort or pain, make an appointment to see a dentist as soon as possible. [8] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. The sooner you get help from your dentist, the better chance you have of avoiding extensive damage to your gums and teeth. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you decide to try home treatments first, contact your dentist if you don’t see any improvement within a few days, or if the infection starts to get worse."
    },
    {
      "title": "Get your mouth examined by your dentist.",
      "content": "Get your mouth examined by your dentist. When you see a dentist for your gum infection, in most cases, the first thing they will do is examine your mouth to check for plaque and tartar buildup, both of which can cause a gum infection. Your dentist will likely also gently prod at your gums to check to see if they bleed easily, which is a sign of infection. While this may be a bit painful, any discomfort should pass quickly. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When examining your gums, your dentist may also use a probe to measure the pocket depth of the groove between your gums and teeth. If the pocket depth is more than 4 mm, this may indicate that you have a more severe infection. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get a scaling and root planing treatment to remove bacterial buildup.",
      "content": "Get a scaling and root planing treatment to remove bacterial buildup. If your dentist determines that your gum infection is due to bacteria as a result of plaque and tartar buildup and that your infection isn’t severe, they may proceed with a scaling and root planing treatment. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Scaling and root planing treatments are done with dental instruments and a laser or ultrasonic device that removes tartar and bacterial byproducts that cause inflammation. During a scaling and root planing treatment, the dentist will first scrape away the plaque and tartar from above and below the gum line. Then, your dentist will smooth out the roots of your teeth to help the gums reattach to your teeth. This treatment can also remove any plaque or tartar that is causing the pocket depth between your gums and teeth to increase. Once removed, your gums can begin to heal and the pocket gap will begin to get smaller. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In general, scaling and root planing treatments are no more (if not less) painful or uncomfortable than a normal dental cleaning."
    },
    {
      "title": "Try a prescription mouth rinse to control a minor gum infection.",
      "content": "Try a prescription mouth rinse to control a minor gum infection. If your gum infection is minor, or if you have recently had gum surgery, your dentist might prescribe you with a mouth wash containing chlorhexidine to help kill any bacteria. Prescription mouth washes are generally used the same as regular mouthwashes and often come in minty flavors to make the process easier for you. How often you should use a prescription mouth wash will depend on the specific type of wash, as well as the severity of your infection. As a result, make sure that you follow your dentist’s instructions on how often and how long you should use prescription mouthwash."
    },
    {
      "title": "Use topical or oral antibiotics to control a bacterial infection.",
      "content": "Use topical or oral antibiotics to control a bacterial infection. Like a prescription mouthwash, your dentist may prescribe a topical antibiotic gel or an oral antibiotic pill to help kill bacteria and treat your gum infection. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In some cases, your doctor may prescribe both an antibiotic gel for you to rub in between your teeth and gums and an oral antibiotic to completely eliminate the bacteria that is causing the infection. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The amount of topical or oral antibiotics that you should use will depend on the specific antibiotics, as well as your specific infection. Follow the instructions provided by your doctor or the pharmacist to make sure that you are using the antibiotics correctly."
    },
    {
      "title": "Get dental surgery if your gum infection is severe.",
      "content": "Get dental surgery if your gum infection is severe. If your gum infection has advanced to the point that home remedies and medications are not effective, your dentist will likely need to perform oral surgery to repair your gums. There are several possible surgeries that can help treat a severe gum infection. A flap surgery, for example, may be performed if your dentist needs to lift back some of the gum tissue in order to perform a more comprehensive scaling and root planing treatment. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source A soft tissue graft may be done if the infection has caused your gum line to recede. In this surgery, a small amount of tissue is removed from the roof of your mouth and attached to the infected site. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Either a bone graft or guided tissue regeneration surgery may be performed if the infection has caused some part of your tooth to root. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Brush your teeth for 2 minutes twice per day to keep your gums healthy.",
      "content": "Brush your teeth for 2 minutes twice per day to keep your gums healthy. [19] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. Maintaining good oral hygiene is the best way to prevent gum infections. To do this, make sure that you brush your teeth regularly for 2 minutes in the morning and again for 2 minutes every evening. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you aren’t sure if you brush your teeth long enough, bring a stopwatch or clock into the bathroom so you can time yourself while you brush."
    },
    {
      "title": "Floss",
      "content": "Floss at least once per day to avoid bacterial buildup. [21] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. Like brushing your teeth regularly, flossing your teeth everyday is crucial for maintain good oral hygiene and avoiding gum infections. Flossing helps you remove any particles and bacteria left behind by your toothbrush, keeping your mouth clean and free of infection. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Schedule regular dental visits to make sure your mouth is healthy.",
      "content": "Schedule regular dental visits to make sure your mouth is healthy. Even if you maintain good oral hygiene on your own, it is important that you go to the dentist every 6 to 12 months for a check-up and more extensive cleaning. [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Dentists have the ability to deep clean your teeth better than you can at home, so make sure that you stay on top of your yearly or bi-annual visits. If you have any risk factors, such as smoking, chronic dry mouth, or diabetes, you may need to see the dentist more often. If you have any of these conditions, talk to your dentist about developing an infection prevention plan. [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}