{
  "url": "https://www.wikihow.com/Write-a-Letter-from-Santa",
  "title": "How to Write a Letter from Santa",
  "steps": [
    {
      "title": "Address the letter to the specific child.",
      "content": "Address the letter to the specific child. If you want the child to believe the letter is really from Santa , you should address it to the specific child. Mention the child's age in the letter as well. Mention their name in the body of the letter at least twice in addition to addressing it to the specific child. Thread details into the letter that show Santa knows the child. For example, you could praise something specific that the child did that year. You could thread references that are specific to your household also. For example, if your house does not have a chimney, you could explain that Santa can get in anyway. You could also reference a favorite pet, the child's interests, or something he or she did recently at school. You could mention family events or excursions to make the letter seem believable."
    },
    {
      "title": "Create positive reinforcement.",
      "content": "Create positive reinforcement. Use the letter to encourage the child to continue to be good. Explain specifically what the child did that deserved rewarding. Tell the child whether he or she made Santa's naughty or nice list (only mention it if they are on the nice list though). Inform the child that if he or she continues to demonstrate similar positive behavior, the child will be rewarded at Christmas time. Focus on milestones and achievements from the past year (such as the child becoming potty trained or earning a Cub or Girl Scouts badge). This will encourage the child to demonstrate positive behavior throughout the rest of the year, also."
    },
    {
      "title": "Ask the child to do something.",
      "content": "Ask the child to do something. You could ask the child to do something specific. Children take requests from Santa seriously, so here is your chance. Ask the child to leave cookies and milk and to not forget to give a carrot to Rudolph and the other reindeer. You could instruct the child to go to sleep early on Christmas Eve. Basically, close the letter with instructions. You can ask the child to perform specific tasks throughout the year, too (whatever the child needs to work on), such as doing his or her homework on time or helping with the dishes."
    },
    {
      "title": "Stay positive.",
      "content": "Stay positive. This cannot be emphasized enough! A letter from Santa is not the time to scold or discipline a child for misbehavior! Describe good qualities the child demonstrates, such as having a good sense of humor, smiling a lot, and caring about animals. Use words that are positive. Even if your child has misbehaved in key ways, encourage him or her for the things that he or she has done right over the year. Children like to be told they are liked and loved, that they are interesting and special, that they make people smile, and that their company is appreciated. [2] X Research source Many websites have lists of affirming words that may have meaning to a child. They include “kind, respectful, willing to help, responsible, trustworthiness, gentle, and good.” Use warm, affirming words that indicate that the child is loved and appreciated."
    },
    {
      "title": "Stay in character.",
      "content": "Stay in character. When writing a letter to your child, make sure to say the things you would expect to hear Santa say. Stay jolly and merry. Talk about the reindeer or Mrs. Claus. Don't forget to Ho-Ho-Ho"
    },
    {
      "title": "Write Santa through the United States Post Office and get a letter back.",
      "content": "Write Santa through the United States Post Office and get a letter back. The Post Office has a longstanding “letters to Santa” program for children. First, have the child write a letter to Santa. Have the child address it to Santa Claus, North Pole. When the child isn’t looking, write Santa’s response on the back of the letter. Then, send the letter to the following address: North Pole Holiday Postmark, Postmaster, 4141 Postmark Dr, Anchorage, AK, 99530-9998. Be specific in the letter. Reference your child’s accomplishments, such as how proud Santa is that the child helped at something specific. Sign it, Santa Claus. Put the letter in a new envelope addressed to the child. Put a first-class stamp on it. The return address on the envelope should say Santa Claus, North Pole."
    },
    {
      "title": "Don't miss the due date.",
      "content": "Don't miss the due date. If the Anchorage postmaster receives the letter by Dec. 15, the postmaster will remove Santa’s letter addressed to your child, apply the North Pole postmark and send it back to your child. The child will then receive the letter from Santa in the mail. [3] X Research source [4] X Research source It is more believable to a child when a letter arrives in the mail. Just make sure it's not in your handwriting if the child might recognize it."
    },
    {
      "title": "Look up templates online.",
      "content": "Look up templates online. You can find many free templates online for how to write a letter from Santa Claus. [5] X Research source Many sites have customizable letters. They will provide the template, and you personalize the letter by adding identifying details about the child, such as his or her name and hometown. Some of these sites are free, and some will make you pay. There are also many sites that will allow you to download Santa stationery to write your own letter on, so the letter is more believable to the child. [6] X Research source"
    },
    {
      "title": "Use a Santa letter writing service.",
      "content": "Use a Santa letter writing service. Many museums, for-profit companies and non-profit organizations allow a child to receive a letter from Santa if the child writes one first. [7] X Research source These letters can seem believable to a child because they are designed to respond to specifics in a letter the child wrote. The letters often arrive in the regular mail, making the child convinced you didn’t send it (especially if it has a stamp or postmark from the North Pole)."
    },
    {
      "title": "Make the letter look old.",
      "content": "Make the letter look old. The letter will blatantly look fake if you just print it off the computer. You should use nice stationery or note paper instead of plain white paper, and let it look a little rumpled. Handwritten letters are more convincing as long as they don’t match your own! Have a co-worker or neighbor pen the letter. Don’t forget a North Pole return address. Make sure you sign the letter from Santa Claus."
    }
  ]
}