{
  "url": "https://www.wikihow.com/Sort-Your-Life-Out",
  "title": "How to Sort Your Life Out",
  "steps": [
    {
      "title": "Visualize your best self.",
      "content": "Visualize your best self. [1] X Research source What are your most important qualities? Understanding the unique gifts you have to offer the world can help you figure out what direction your life should take. Take a few minutes to think deeply about what makes you special. [2] X Research source Spending time in a place where you can be yourself is a good way to identify what makes you, you. Try going to your favorite place in nature, or spending time near people who get you. When you can really be yourself, what qualities emerge? It may also help to ask people you trust what good qualities they see in you. Sometimes it's difficult to see our own strengths clearly."
    },
    {
      "title": "Make a list of your priorities.",
      "content": "Make a list of your priorities. Spend time thinking about your priorities divorced from what you know your current obligations are. Take note of the happiest moments in your life, and prioritize the parts of your life that deliver these moments to you. Remember, you don’t need to think about what’s feasible and what isn’t, just what truly makes you tick. This will help you see what you cherish rather than the strategies you’ll use to get them. Keep the list short and sweet—no longer than five things. Ask yourself the following questions in order to connect with your priorities: How would you like to live your life? Would you like to be healthy and vital? Would you like to have deeper connections with people in your life? What will make you proud to be able to say about yourself in ten years time?"
    },
    {
      "title": "Write out a daily schedule.",
      "content": "Write out a daily schedule. When you have a completely average day, what does it entail? By laying out a daily schedule, not of what you want for yourself, but of what you actually do you can see your current strategies for meeting your priorities. [3] X Research source Now that you have this schedule, see if your priorities are reflected in your daily activity or not. Can you draw links between what you cherish and what you know must be taken care of each day? For example, if you already eat a nourishing breakfast in the morning, you can connect this up with a stated priority of maintaining a healthy body and mind. If you cannot see the connection between how you spend your time and what your deeper priorities are, you will know that a significant overhaul may be in order."
    },
    {
      "title": "Separate the urgent from the valuable.",
      "content": "Separate the urgent from the valuable. Looking again at your daily schedule, sort everything you do into two different categories: urgent and valuable. Everything we do holds some sort of meaning for us, otherwise we wouldn't be doing it. [4] X Research source Frankl, Viktor E. 1984. Man's search for meaning: an introduction to logotherapy. New York: Simon &amp; Schuster. Notice the things you do that are urgent, meaning that you feel as though you are under pressure and seek to avoid the consequences of not doing it . Then, look at the other activities that are valuable. If something is valuable that means that there is something intrinsically enjoyable to the activity itself, as it is in line with your priorities (even if only in a small way). For instance, you might be confused about where to place an activity like calling your mom. Ask yourself: do you call your mom daily because you would feel guilty or fear hurting her if you don't check in? Or, do you talk to her frequently because you prioritize family and talking to her sparks the joy of connection in you? Yes to the first option shows that the activity is urgent , and yes to the second means that it is valuable ."
    },
    {
      "title": "List your obligations and duties.",
      "content": "List your obligations and duties. These need not be only the obligations that we consider crucial, like paying rent and buying groceries, but also the obligations that you feel you have toward others. What are the things that you have to do, for fear of some type of punishment or shame? While these will not go away completely, recognition of what you do out of fear will sharpen your ability to see when you are acting from a priority and when you are acting out of fear, urgency or obligation. Slowly, you'll learn to make different decisions about what needs to be done and when. This time, caring for your priorities and growth rather than simply running in fear of consequences. Begin to notice which obligations can be altered, split, or delegated in order for your values and priorities to be upheld. Can an aunt, friend, or coworker help out with the obligation half time? Or maybe the task is truly the responsibility of someone else - let that person rise to the opportunity to be responsible and handle the task."
    },
    {
      "title": "Think about your relationships.",
      "content": "Think about your relationships. To live without getting overwhelmed or confused about what your priorities are, it is crucial to surround yourself with people who make you feel comfortable enough to be confident and creative. The next time you go out, be extra mindful of who gives you energy and who makes talking feel like a chore. This will bring out your gut feelings about whose presence really nourishes you, making it easier to spend your time feeling boosted rather than obligated in relation to others. Honestly ask yourself the questions: “Who makes me feel shrunken when I’m around them? Who makes me feel like my contributions are trivial?” You might be surprised (and shaken) to find that people who we love very much bring out tendencies of self-effacement and repression of our true feelings."
    },
    {
      "title": "Embrace difficult discussions.",
      "content": "Embrace difficult discussions. Our lives are filled with others who we must work and share with, and yet, often have vastly different styles and priorities from. Are there conversations you've wanted to have, but pushed aside for fear of the person's response? Without judging or accusing the other person, talk about the ways you differ. [5] X Research source Then, you can brainstorm about how you might proceed with these differences in mind. Sometimes, these differences involve quick fixes that take the frustration and dissatisfaction out of daily life. For example, you might have a co-worker who always leaves you responsible for your least favorite task, filing papers. If you calmly let your co-worker know that filing papers is a major source of upset for you, you could work out a way to share the burden. Perhaps your co-worker simply forgets to file papers and doesn't mind taking on the task entirely. Either way, you'll feel empowered for making an adjustment that frees up more time for enjoyable activities."
    },
    {
      "title": "Spend time by yourself.",
      "content": "Spend time by yourself. [6] X Research source Make checking in with yourself and your priorities a regular occurrence. Imagine that you are hanging out with a dear friend to whom you can vent your deepest insecurities and questions about the direction of your life. Now, see that you can be that friend to yourself. If you are as kind and understanding as your friend would be, you can expect an even greater degree of intimacy and understanding than you ever could from another person. The more time by yourself spent outside, the better. When possible, spend your alone time in the backyard or at a nearby park. This will make it so you have fewer reminders of the other things you need to be doing and more reminders of the beauty there for you to slow down and appreciate."
    },
    {
      "title": "Turn negative self-talk into encouragement.",
      "content": "Turn negative self-talk into encouragement. Without realizing it, many of us go through our days thinking thoughts like, \"I can't do this.\" or \"I'm not good enough.\" Every time you notice that you're putting yourself down or judging yourself to be incompetent, try countering it with an affirmation of what you can do. [7] X Research source Say you were assigned a paper in class with a long, confusing prompt. A voice might pop up that tells you that there's no way you can handle it because you're so far behind already. Respond to this voice by letting it know that you work well under pressure or that you're a savvy writer regardless of the topic."
    },
    {
      "title": "Cultivate acceptance for the past.",
      "content": "Cultivate acceptance for the past. [8] X Research source Sorting out your life is impossible without being free from past regrets and resentments. If possible, make amends with people who represent a strong lack of resolution in your life. This might be a parent you haven't seen in years or a friend who you never saw after a fight. If you are caught up in anger about a breakup or disappointed with yourself for not getting the promotion you wanted, you will lack the energy it takes to move toward change. When making amends, you don't have to commit to having a long confrontation about whatever happened. What's important is to let this person know that you have recognized unresolved issues related to them, and that you intend to move forward in your life with respect for them and gratitude for the lessons of your shared experience. Writing a brief email can show how much you've built up a past situation in your mind. Peeking into the closet and greeting some skeletons can usher in a sense of peace."
    },
    {
      "title": "Start each day with a to-do list.",
      "content": "Start each day with a to-do list. [9] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source Lists are a great way to get rid of feelings of chaos and overwhelm. They also help manage stress by giving you a visual of how much you really need to do. When you use your to-do list as a starting off point, you can begin to see how much room you have to re-negotiate your daily activities. Once you see your to-do list, rearrange the items so that things that are important to you and your happiness come before things that you normally consider urgent. For example, you might have a bill due in four days. But, you also have on your list taking a walk through your neighborhood. It seems obvious that spending your time paying the bill will relieve your stress—it’s an obligation that you could be getting out of the way! But since today is not the due date, you can choose to deal with the bill when you must, since your need for movement and refreshment is more important to your happiness today."
    },
    {
      "title": "Clean like it's spring.",
      "content": "Clean like it's spring. [10] X Research source Having a clean, open space at home, work, etc., has a powerful impact on how capable we feel of accomplishing tasks. Clean your house from top to bottom, without hesitation to throw away broken things and donate what you no longer use. Recycle old papers and receipts that are filling up drawers, and do the same with your virtual space. Delete old emails, notes, and contacts that clutter your folders. Doing this will help you feel refreshed and open to the possibility of new and different things coming into your space instead."
    },
    {
      "title": "Regulate your sleep schedule.",
      "content": "Regulate your sleep schedule. Studies have shown that after only a few days of shortened sleep, many experience worse mood and decreased ability to regulate negative emotions. [11] X Research source Baum, K. T., Desai, A., Field, J., Miller, L. E., Rausch, J. and Beebe, D. W. (2014), Sleep restriction worsens mood and emotion regulation in adolescents. Journal of Child Psychology and Psychiatry, 55: 180–190. . This means that you will feel less inspired to accomplish the things that the best version of yourself has deemed a priority. If getting 7-8 hours of sleep is not an option for you, do allow yourself to take catch-up naps after nights of less satisfying sleep. Learning to improve your sleeping habits is invaluable."
    },
    {
      "title": "Find a diet that fits you.",
      "content": "Find a diet that fits you. Sorting out your life may mean revamping what you eat and how your eating habits factor into your days. Unless you prioritize and enjoy refining your culinary skills, develop habits for when you buy and prepare food. Don't leave room for stress to arise about what you want to eat and when. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Keep a list of basic items to keep around so that you can always prepare a quick meal or nutritious snack. By having reliable options, you will also avoid the over- and under-eating that normal come along with (and worsen) stress."
    },
    {
      "title": "Exercise to clean out nervous energy.",
      "content": "Exercise to clean out nervous energy. Exercise causes your brain to release endorphins, adrenaline, and other chemicals that act to relieve excess tension and uplift mopey moods. [13] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Movement of all kind has been proven to regulate bodily functions and advance emotional well-being. Yoga, weight training, and cardiovascular exercise are all good options. [14] X Research source Remember not to commit yourself to an amount of exercise that isn't desirable for keeping your priorities. The goal is to make you more fit to live the life you want to live, not to load you up with another obligation that you don't care about. If you know that muscular endurance is not a priority for your life, choose brisk walks over weight training. Reader Poll: We asked 158 wikiHow readers and 93% of them agreed that it’s important to take time for yourself . [Take Poll] Making time to take care of your body (and mind) is part of that!"
    },
    {
      "title": "Monitor your vices.",
      "content": "Monitor your vices. Do you drink, smoke, or zone out to the television frequently? The vices aren't the problem, but how you use them can show you what your time is really being used to do. By becoming aware of the role your vices play in your life--and these do shift often--you can learn how to use them more responsibly without cutting them completely. The next time you go for a drink, for example, ask yourself: \"Is this helping me toward a priority?\" The answer is not necessarily no--you may be having a glass of wine with your family or friends whose presence you value. But, the drink may also be helping you avoid a to-do list item or hindering your ability to see your priorities in action."
    }
  ]
}