{
  "url": "https://www.wikihow.com/Take-Care-of-a-Chinese-Money-Plant",
  "title": "How to Take Care of a Chinese Money Plant",
  "steps": [
    {
      "title": "Choose an area that receives at least 4 hours of indirect sunlight a day.",
      "content": "Choose an area that receives at least 4 hours of indirect sunlight a day. Chinese money plants grow well in spots that receive plenty of sunlight throughout the day. The best spot is an east-facing window, which receives the first, weak rays of sunlight in the morning. Your money plant can handle this sunlight. A west-facing window, which receives direct sunlight late in the day, is the second-best spot. [1] X Research source Other spots are fine too, but make sure your plant gets the proper amount of sunlight there. If there isn’t enough sunlight, set up a grow light. Keep money plants out of direct sunlight. Harsh sunlight burns leaves, eventually destroying your plant."
    },
    {
      "title": "Move the plant away from any sources of high heat or cold.",
      "content": "Move the plant away from any sources of high heat or cold. Money plants grow well in temperatures from 50 to 86 °F (10 to 30 °C). Although they are pretty hardy, temperature spikes from air conditioners or heating vents can cause some problems. Try to keep your money plant in a place where the temperature stays consistent throughout the day. [2] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source Your plant will survive if the temperature dips a little lower than usual, but don’t let it stay in such a condition for very long. Curling leaves are often the result of high heat. Extreme cold causes a money plant to stop growing or freeze."
    },
    {
      "title": "Rotate the plant at least weekly to keep it growing straight.",
      "content": "Rotate the plant at least weekly to keep it growing straight. No matter where you place the plant, it won’t receive light evenly on all sides. This causes the plant to lean toward the light as it grows. Prevent this by giving each side an equal amount of exposure. Give the plant at least a quarter of a turn each week. Come up with a schedule so you don’t forget to rotate your money plant. Try doing it each time you water the plant, for instance. If you’re using a grow light, keep it directly above the plant so it won’t lean. Otherwise, continue rotating it each week."
    },
    {
      "title": "Water money plants once a week in the spring and summer.",
      "content": "Water money plants once a week in the spring and summer. Chinese money plants don’t require a ton of upkeep compared to some other houseplants. They mostly grow in the warmer months and will require more frequent watering during that time. You won’t have to give the plant more water until you notice that its soil is nearly dry. Keep in mind that summer conditions, such as high heat and exposure to sunlight, can cause the soil to dry out at a quicker rate than normal. [3] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Chinese money plants don’t require much in the way of humidity, but you can also spritz them with water if they look brown or droopy despite regular watering."
    },
    {
      "title": "Water the plant every 10 days or more in the winter.",
      "content": "Water the plant every 10 days or more in the winter. Your plant slows down during the colder months of the year. You will notice the soil staying wet for longer periods of time. Keep watching the soil and sprinkling it with water as it dries out. Let the soil nearly dry out each time so your plant stays healthy while it’s dormant. [4] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source The opposite is true during warm, dry weather. Your plant may need to be watered a little more frequently than once a week."
    },
    {
      "title": "Wait until the soil is almost dry before watering a money plant.",
      "content": "Wait until the soil is almost dry before watering a money plant. Monitor the soil by placing your finger in it. If the top 2 to 3 in (5.1 to 7.6 cm) feel somewhat dry, refresh the plant with clean water. Dry soil feels hard and dusty instead of damp and sticky. Water your money plant, then wait until the soil nearly dries out before watering it again. The right moisture level makes a big difference. If the soil is kept too damp, it will cause the plant’s roots to rot. Make sure the soil isn’t saturated with water. Money plants aren’t cut out for bone-dry soil. Add more water as soon as you notice the soil getting too dry. The plant may also start drooping when this happens."
    },
    {
      "title": "Pour water onto the soil until it runs through the bottom of the pot.",
      "content": "Pour water onto the soil until it runs through the bottom of the pot. Set the plant on top of a planter saucer. Using a watering can, sprinkle lukewarm water directly onto the soil. Watch for a stream of water to pass through the drainage holes at the bottom. Move the plant off the saucer afterward so it isn’t sitting in water. [5] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source You could also take the plant to the sink and add tap water until the soil is moist. However, distilled and filtered water are healthier for plants than tap water due to the lack of minerals. Check the soil about 2 hours after first watering it. Make sure the first 2 to 3 in (5.1 to 7.6 cm) of soil stay moist."
    },
    {
      "title": "Apply a 10-10-10 fertilizer monthly during the spring and summer.",
      "content": "Apply a 10-10-10 fertilizer monthly during the spring and summer. If you wish to give your money plant a little boost, try using a balanced liquid fertilizer. The number rating indicates the amount of each nutrient in the fertilizer. Mix about 1 teaspoon (4.9 mL) of it into 1 US gal (3,800 mL) of lukewarm water. Then, use it to moisten the soil next time your plant needs water. Many money plants do well without fertilizer. A quality fertilizer provides additional nutrients for plants to grow bigger and fuller. Your plant doesn’t need fertilizer during the winter months. It won’t be growing much then, so don’t overload it with nutrients."
    },
    {
      "title": "Repot the plant when you notice roots emerging from the pots.",
      "content": "Repot the plant when you notice roots emerging from the pots. The money plant’s roots will continue to expand, so watch for them to poke out of the drainage holes at the bottom of the pot. When this happens, get the next biggest pot size available. Choose a plastic or glazed ceramic pot with adequate drainage holes. The right pot creates the perfect environment for your plant to continue to grow. [6] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source Terracotta pots don’t retain moisture very well. You can use a terracotta pot if you’re prone to overwatering, but plastic and ceramic pots are usually a better choice."
    },
    {
      "title": "Use a well-draining potting soil when planting a money plant.",
      "content": "Use a well-draining potting soil when planting a money plant. Check your local gardening center for a good houseplant potting soil. Take the new pot and scoop soil into it with a trowel, leaving a hole in the center for the money plant. After placing the plant in the hole, spread soil over its roots. Make sure it is well-covered so the lowest leaves are right above the soil. You can use the old pot to help set up the new one. Stick the old pot in the new pot, then pack soil around it. Remove the old pot and slide the money plant into its new home! Be gentle when taking a money plant out of its old home. Grip it lightly and slide it out of the pot. If it’s stuck, run a knife or trowel around the edges of the pot to break the soil loose."
    },
    {
      "title": "Separate budding money plants by cutting them off at the stem.",
      "content": "Separate budding money plants by cutting them off at the stem. Over time, your money plant will sprout baby plants. Wait until they grow at least 2 in (5.1 cm) above the soil with a set of 3 or 4 leaves. Push aside the soil to reveal about 1 in (2.5 cm) of the main stem and roots. Use sharp, clean scissors or a knife to detach the new plant so you can grow it elsewhere if you wish. Transplant a new cutting by placing it in a glass of water until it begins sprouting roots. Put it in its own pot filled with potting soil afterward. Some people prefer leaving the young plants alone. They will continue to grow, but the pot can look a little messy as a result."
    }
  ]
}