{
  "url": "https://www.wikihow.com/Write-an-Advertisement-for-a-Pet",
  "title": "How to Write an Advertisement for a Pet",
  "steps": [
    {
      "title": "Write 2 to 3 sentences detailing why you need to re-home your pet.",
      "content": "Write 2 to 3 sentences detailing why you need to re-home your pet. Avoid using all caps or lots of exclamation points. Explain why you’re looking for a new home for your pet, whether it’s because you’re moving and can’t take them with you, or perhaps you’re unable to give them the care they need. [1] X Trustworthy Source Best Friends Animal Society Nonprofit animal welfare organization dedicated to saving animal lives by operating and supporting no-kill animal shelters Go to source For example, write something like this: “Hi, my name is Anne, and I’m looking for a new home for my cat, Henry. Henry is a great cat and I’m so sad to let him go, but I’m moving overseas and won’t be able to take him with me.”"
    },
    {
      "title": "Add photographs of your pet to help catch potential owners’ eyes.",
      "content": "Add photographs of your pet to help catch potential owners’ eyes. When taking photos, focus the camera on the pet and keep the background unfocused or out of the shot entirely. Try to avoid showing yourself or other people in the shot with the dog. Include a headshot and a full body shot—the full body shot can show the dog playing with a toy or doing something cute that might catch attention. Depending on what type of site you’re using to post the ad, you could even include a link to a video from YouTube or Vimeo to showcase your dog in action!"
    },
    {
      "title": "Write vivid descriptions to highlight your pet’s personality.",
      "content": "Write vivid descriptions to highlight your pet’s personality. Include pertinent information, like the pet’s age, size, and general appearance, but then also include a few sentences about the pet’s best qualities. Tell what they like and dislike, what their energy level generally is, and what they ideally need in their next home. [2] X Trustworthy Source Best Friends Animal Society Nonprofit animal welfare organization dedicated to saving animal lives by operating and supporting no-kill animal shelters Go to source For example, you could write something like, “Henry is a 4-year-old Siamese cat and has been neutered. He loves to play with toys and actually likes to play fetch! He’s a great companion for calm nights at home, too, and will love to sit in your lap. He does great with other cats, but doesn’t like dogs very much.”"
    },
    {
      "title": "Include details about health issues, disabilities, or behavioral issues.",
      "content": "Include details about health issues, disabilities, or behavioral issues. If there are any health needs, like medications or special diets, let the potential owner know upfront. If they need to be in a home where they’re the only pet or if they don’t do well around children, those are also important details to share. [3] X Trustworthy Source Best Friends Animal Society Nonprofit animal welfare organization dedicated to saving animal lives by operating and supporting no-kill animal shelters Go to source For example, writing, “June is an active dog who likes to play. She needs to be walked daily for at least 30 minutes. She loves going to the dog park and is gentle around children,” would give any potential owner a lot of good information. Offering to let a new owner see vet records is another great way to let them know you’re not trying to hide anything."
    },
    {
      "title": "Ask for a rehoming fee to weed out ill-intentioned people.",
      "content": "Ask for a rehoming fee to weed out ill-intentioned people. Asking for the rehoming fee ensures that the people who approach you are serious about adopting your pet. Anywhere from $50 to $300 is appropriate, just depending on the size and needs of your pet. If someone can’t afford a rehoming fee, they might not be able to afford the needs that come along with owning a pet."
    },
    {
      "title": "Include good contact information so you’re easy to reach.",
      "content": "Include good contact information so you’re easy to reach. Don’t give your home address or full name, but do give a good phone number, an email address, and a first name. It’s okay to tell what city you live in, but avoid giving overly-detailed personal information to help protect your privacy. [4] X Trustworthy Source Best Friends Animal Society Nonprofit animal welfare organization dedicated to saving animal lives by operating and supporting no-kill animal shelters Go to source If you are okay with people texting you, specify that in the ad. If you don’t want to give your phone number at all, that is okay, too. You can just provide an email address—make sure you check it regularly and get back to people quickly. You could even set up a new email account just for your pet ad. That way, you won’t have strangers emailing your personal account."
    },
    {
      "title": "Double-check the ad",
      "content": "Double-check the ad before you send it out or post it anywhere. Always check your writing for spelling or grammatical errors—you want people to take you seriously, and communicating clearly is a great way to get people to pay attention. Read your ad out loud to make sure it sounds good, or ask a friend to proofread it for you. [5] X Trustworthy Source Best Friends Animal Society Nonprofit animal welfare organization dedicated to saving animal lives by operating and supporting no-kill animal shelters Go to source Confirm that you’ve included all the pertinent details: why you’re re-homing your pet, their name, age, medical history, and personality traits, and your contact information."
    },
    {
      "title": "Disperse your ad to as many places as possible.",
      "content": "Disperse your ad to as many places as possible. For physical locations, visit veterinary offices, pet supply stores, community shops, and the humane society. For online locations, post on your personal social media feeds and ask friends and family to help spread the news, too. You could also place an ad in your local town newspaper. [6] X Trustworthy Source Best Friends Animal Society Nonprofit animal welfare organization dedicated to saving animal lives by operating and supporting no-kill animal shelters Go to source More often than not, word of mouth is the best way to find potential owners. Keep flyers with you at all times so you can give them to people who are interested or who know someone who might be interested."
    },
    {
      "title": "Replace your ad every few weeks so people know it’s still active.",
      "content": "Replace your ad every few weeks so people know it’s still active. If your pet hasn’t been re-homed within 2 weeks, refresh your ads everywhere you put them. Re-post them online and visit all the physical locations to put up new flyers so they don’t get buried amongst all the other ones. This will increase the chance that it’ll get a response. [7] X Trustworthy Source Best Friends Animal Society Nonprofit animal welfare organization dedicated to saving animal lives by operating and supporting no-kill animal shelters Go to source Once your pet has been re-homed, don’t forget to take down all your flyers."
    },
    {
      "title": "Tailor your ad to the site you’re going to use.",
      "content": "Tailor your ad to the site you’re going to use. Whether you’re selling a purebred puppy, a litter of kittens, or a chinchilla, you’ll need to write your ad to target the audience most likely to buy your pet. Check out some different sites to see what other ads look like, and modify your ad as needed. [8] X Research source For example, if you’re going to post your ad on a site that sells purebred golden retriever puppies, you’ll want to include information about the puppies’ pedigree, if either of the parents ever competed in shows, and details that showcase the puppies’ breeding."
    },
    {
      "title": "Write short, clear descriptions to keep people’s interest.",
      "content": "Write short, clear descriptions to keep people’s interest. Avoid using all caps or lots of exclamation points. Simple, concise wording is the best way to capture a potential buyer and get them to click on your ad. Include the breed and age of the animal you are selling. [9] X Research source For example, write something like, “5 German Shepherd Puppies Available Now (10 weeks old).”"
    },
    {
      "title": "Include pertinent details about the pet and any health conditions.",
      "content": "Include pertinent details about the pet and any health conditions. Write a few sentences that tell the animal’s breed (purebred or mixed), gender, age, coat or coloring, temperament, and if the pet has had its shots yet. If you’ve done any DNA testing, include the results in your ad, as well as any information about bloodlines (especially for show dogs). [10] X Research source Most people who are looking to buy a pet are looking for something very specific as far as breed and coloring goes. Including these details means you’ll get more inquiries."
    },
    {
      "title": "Offer a few free items along with the pet, like toys or food, as incentive.",
      "content": "Offer a few free items along with the pet, like toys or food, as incentive. Bedding, crates, toys, food bowls, and starter bags of food are great add-ons to include with your pet. List these things out in your ad so that people know what exactly they’ll be getting for the price they’re paying. [11] X Research source Likewise, if you are going to take care of spaying/neutering costs or any veterinary bills, specify that in your ad, too."
    },
    {
      "title": "Include clear photos with your ad to make it more engaging.",
      "content": "Include clear photos with your ad to make it more engaging. Include a headshot of the animal as well as a full body shot. If you’re selling a purebred animal, it may even be a good idea to hire a professional photographer to take pictures for you. [12] X Research source If you have photos of the animal’s parents, you can also include a photo of them so people will have an idea of what the pet will look like once it’s grown."
    },
    {
      "title": "Provide reliable contact information before posting the ad.",
      "content": "Provide reliable contact information before posting the ad. Include your name, an email address, and a phone number. Specify if you prefer texts, calls, or emails to make it easy for people to reach you. Make sure to double-check your contact information before posting your ad so there are no typos. Post your ads online, on social media sites, and at local community hot spots. [13] X Research source Refresh your ad every 2 weeks so that it doesn’t get lost among the other ads."
    },
    {
      "title": "Write an ad that shares the pet’s telling characteristics, but not its name.",
      "content": "Write an ad that shares the pet’s telling characteristics, but not its name. Experts recommend keeping your pet’s name off of flyers when they’re lost, as people with bad intentions could use their name to gain control over them. But, you do definitely want to tell what kind of animal it is, the gender, size, approximate age, and some telling characteristics, like a crooked tail or a white spot over their left eye. There are sites that provide templates for “Lost Pet” flyers. Search online and fill out the needed information to have an ad generated for you in just a few minutes. For example, write something like, “LOST DOG: Female golden retriever lost on Monday, December 17th, at the corner of Rockside and Broadview. Tan coloring, wearing an orange dog collar, very friendly.”"
    },
    {
      "title": "Include a good color photo of your pet’s face.",
      "content": "Include a good color photo of your pet’s face. If you can, provide a color photo so that your pet is easier to identify. An up-close image is better than one that is far away, but use what you have available. One good photo is better than 3 mediocre ones. Center the photo on the page and make it fill up about half of the page. Avoid using a photo that has more than one pet in it. The simpler the image, the better people will remember it."
    },
    {
      "title": "Offer a reward if you can.",
      "content": "Offer a reward if you can. Even something as small as $50 can be incentive enough for people to pay extra-special attention to their surroundings, especially neighborhood children. If you can’t afford a reward, that is okay! Lots of people put up flyers and have their pets safely returned to them without offering a reward. Make sure you receive your pet back safely before giving anyone any kind of reward."
    },
    {
      "title": "Provide a phone number where you can be called and/or texted.",
      "content": "Provide a phone number where you can be called and/or texted. Double-check that your digits are written down correctly. Specify if it’s okay for people to text you, too, or if you’d prefer they call you directly. Also give your first name so they know who they need to speak to. [14] X Research source Never give your last name or home address."
    },
    {
      "title": "Post the ad in your community, online, and at your local humane society.",
      "content": "Post the ad in your community, online, and at your local humane society. Thankfully, there are lots of pet lovers out there and people who want lost animals to be returned safely! Post your flyer online on your social media feeds, look for community groups on Facebook dedicated to lost and found pets, and call your local veterinarians and humane societies to let them know you’re looking for your pet. Print paper flyers as well. Take them around your neighborhood, give them to people, and put them up on posts wherever you can. [15] X Research source If you’re going to put up flyers on posts around your neighborhood, consider laminating them first so that they don’t get soggy and disintegrate in inclement weather."
    }
  ]
}