{
  "url": "https://www.wikihow.com/Win-Friends-and-Influence-People",
  "title": "How to Win Friends and Influence People",
  "steps": [
    {
      "title": "Dress sharply.",
      "content": "Dress sharply. Think about costumes. People wear costumes to project an image others will understand immediately, whether it's zombie, firefighter, or bride. The fact is, every outfit you wear is a costume – even your day-to-day clothes. They say a lot about you to the people who see them. [1] X Research source Use your clothes to project an image of yourself that shows people the traits they look for in a friend: confidence, happiness, stability. Generally speaking, this means wearing clean, crisp, well-fit items of clothing that are coordinated so that colors and patterns complement each other. This shows that you like yourself well enough to mind your appearance, are responsible enough to maintain it, and are confident enough not to hide it."
    },
    {
      "title": "Maintain hygiene.",
      "content": "Maintain hygiene. At handshake distance and closer, the difference between poor hygiene and proper hygiene becomes readily apparent. If you want to connect with people, you're going to need to get that close, so it pays to keep your body as clean and well-maintained as you keep your clothes. Shower daily, washing your hair no less than 3 and no more than 5 times a week; brush your teeth at least twice daily, and floss at least once daily; wash your face, comb or brush your hair, and apply deodorant every morning. [2] X Research source Be mindful of longer-term considerations such as keeping your nails clipped and, for men, keeping your facial hair properly trimmed or shaved. [3] X Research source Women can choose to shave their underarm and leg hair based on their personal preference, but be aware that some people still consider not shaving those areas a sign of poor self-image or self-discipline. To reach the widest potential audience, it's still safest to keep them shaved smooth."
    },
    {
      "title": "Take care of your hair.",
      "content": "Take care of your hair. [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source No matter the length of your hair, you should maintain it with regular cuts, thins, or trims at a salon or barber shop you trust. Be sure you can always make it look neat and sharp, even if you don't always wear it that way at home."
    },
    {
      "title": "Maintain your possessions.",
      "content": "Maintain your possessions. More specifically speaking, your home and your vehicle (if you have one) are the two most important things you should be keeping up. [5] X Research source You never know when you'll have unexpected guests, or who'll see your bike or car as you're getting into or out of it. Besides, keeping your surroundings neat helps you to feel good about your life. Cars should be washed every month or so, kept clean of detritus on the seats and floor, and be serviced according to a regular schedule for things like oil changes and tire rotation. [6] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Bicycles should be hand washed every month or so (more if your bike tends to get muddy or dusty), and tuned up twice a year at a bike shop. Your home should stay as neat as you can reasonably keep it. Clear dishes and clean the kitchen after dinner every day to avoid buildup. Wash laundry as often as you can afford to, and be sure to fold it and put it away once it's clean. If you have a yard, keep it free of debris by raking it periodically. Keep your walkway and driveway swept and neat. [7] X Research source"
    },
    {
      "title": "Control your body language.",
      "content": "Control your body language. It's been said time and again, because it's true: body language is a powerful means of communication between people. [8] X Research source This is because it's hard to fake, and says a lot about our emotional states from moment to moment. In many ways, observing a person's body language as they speak can tell you more about that person than the words he or she is speaking. That's why it's so important to do what you can to use your own body language to tell people what they'd like to hear about you. Body language is complex and very context sensitive: the same motion or posture can have different meanings based on who exhibits it, where, and when. Rather than trying to read everyone else's body language, try to make yours easy for them to read instead. Control what you can control and disregard everything else. Move boldly and without hesitation. This doesn't mean you should move quickly or sharply; rather it means your movements should broadcast an aura of confidence. When you shake someone's hand, give it a good firm squeeze – you'll be surprised how many people notice. Walk smoothly at your own pace, without stepping gingerly or hunching your shoulders. Let your arms swing as you step. Mind your posture. It's been said time and again by every third-grade teacher across the globe, but proper posture is important. Your shoulders should rest slightly back from your chest, keeping your back from hunching forward. Your neck should continue the line of your spine, and not allow your chin to jut forward. Proper posture not only demonstrates confidence and self-esteem, it also allows you to breathe more easily, and reduces the risk of chronic back pain as you get older. Use your face to your advantage. If the eyes are the windows to the soul, the face is a floodgate waiting to be opened. Always do your best to smile genuinely, [9] X Research source make generous eye contact (especially when others are talking to you), and let your face be animated, which shows sincerity and empathy. People would rather be around someone who smiles and laughs all the time than someone who always looks distant or serious."
    },
    {
      "title": "Stay active.",
      "content": "Stay active. Even an unhealthy body gets an aura of health around it when the owner of that body makes a sustained effort to reinvigorate it. Exercise as regularly as you can, and eat modestly. [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you have trouble setting any kind of a schedule, remember that any effort is still better than no effort at all. Even just a few minutes of exercise after you wake up or come home from work will help you maintain your posture, control your body language, and have more energy. [11] X Research source"
    },
    {
      "title": "Brush up on classical rhetoric.",
      "content": "Brush up on classical rhetoric. Great public speakers come and go, but few have left such a lasting impression on the Western world as Aristotle, the ancient Greek philosopher. [12] X Research source His approach to rhetoric, recorded over 2000 years ago, is still one of the most useful frameworks available for figuring out how to maximize the persuasiveness of anything you want to say. Aristotle divides the elements of any persuasive argument into three vital parts. By combining all of them harmoniously, you can craft an appeal or argument that is very difficult to resist. [13] X Research source Create a strong backbone with logos. Logos is the clarity, organization, and internal consistency of what it is you want to say. Speech that's imbued with logos can't be twisted around to mean anything other than what you want it to mean. Any attempts to do so by a naysayer will only result in him or her seeming foolish. Add credibility and believability by employing ethos. Ethos is the ethical foundation of your argument, which usually is reflected in your tone and style of delivery, as well as your personal presence of character (and reputation, if you're lucky enough to have a good one). Speech that employs ethos never leaves your personal convictions in doubt, and supports the notion that you know what you're talking about and can be trusted. Appeal to your listeners with pathos. Pathos is the part of your argument that helps it connect to the listener's personal life, experience, feelings, and imagination. By sparking sympathetic emotions in your listener, speech with a lot of pathos makes your topic as much about them as it is about you, encouraging them to feel personally invested in whatever you say."
    },
    {
      "title": "Practice active listening.",
      "content": "Practice active listening. [14] X Research source Nothing makes people like you faster than being a good listener, but there's more to it than just sitting quietly and watching the other person's lips move. Being an active listener means utilizing certain techniques that demonstrate your attention to the speaker. With practice, all of these techniques will become a natural part of your communication repertoire. [15] X Research source When there's an appropriate pause, even mid-sentence, prompt the speaker with a small noise, such as “yeah” or “mm hmm.” Don't overdo it or you'll seem impatient. Once every few sentences is enough. Whenever you think of a question to ask that will prompt the speaker to go into greater detail, ask it. Don't interrupt the speaker in mid-sentence, but otherwise, the sooner the better. This shows that you're so interested in the speaker's words, you want even more details. Use neutral affirmation. If you're not quite sure what to think of a story, or whether you agree with it, riff on the speaker's emotional state to craft a response instead. If the speaker is looking at you as though he or she can't believe the story, agree with them by saying “wow, that's crazy” or something else that allows you to bond with the speaker without having to pick a specific side just yet. When the story is finished, ask the speaker what they thought of it or how they felt about it. People love to summarize their thoughts after a longer anecdote. After the story has been summarized, re-summarize it and throw it back at the speaker. This shows the speaker that you listened and understood what they were saying, and he or she will love you for it. You can follow through with your opinion afterward to drive the conversation. For instance, suppose someone tells you a story about their cat having to go to the vet for a sudden emergency. When the story is done, say “so your cat really did have (medical issue)? But at least you got him to the vet in time. Man, that's just (your opinion here).” Use personal anecdotes, but don't overuse them. You're probably trying to show sympathy and understanding, but the listener will eventually begin to suspect you'd rather talk about yourself than listen to anyone else. Be moderate in your use of personal stories and anecdotes."
    },
    {
      "title": "Speak well.",
      "content": "Speak well. Most people tend to think their voices are more or less set in stone, but this isn't the case. Although it's not possible to go from a soprano to a baritone, it is possible to exert a surprising amount of control over the overall tone of your voice, and over the clarity of the words that you speak. [16] X Research source Sing to learn voice control. One of the best ways to train your voice is simply to sing out loud. You don't have to have an ear for singing, or sing to anyone else. Try singing in your car or at home when you're doing chores. Over time, you'll gain greater control over the sounds your throat makes through sheer repetition. Speak in smooth, round, low-register tones. [17] X Research source This doesn't mean you should try to deepen your voice; it just means you should imagine a larger space at the back of your mouth and throat when you speak, and speak to fill it. Don't drive your words through your nose or a small, tightly-clenched throat passage. Speaking in full, clear tones makes you sound more knowledgeable, and makes your voice much more pleasant to listen to. Give yourself plenty of volume. There's no need to yell when you speak, but don't speak meekly, either. Don't muffle your voice. It only makes you harder to understand, and it can also make you seem less sure of yourself."
    },
    {
      "title": "Use agreeable language.",
      "content": "Use agreeable language. Just because people understand your words doesn't mean they'll grasp your intent properly. As anyone who has argued with a relative or lover over a miscommunication knows, there are good ways and bad ways to say what you have to say. By learning a few psycholinguistic tricks, you can learn to speak your mind in a way that not only keeps the listener from feeling upset or intimidated, but actually endears him or her to you. Using “I” language is all about putting the burden of responsibility on yourself. During an argument, instead of accusing the other person of “making” you feel or act a certain way, phrase it like this: “When you (said/did/ whatever), I felt...” It seems silly in writing, but it works very well in a real argument because it keeps extra blame from being heaped onto the other person. For example, instead of saying “When you said that, it made me mad,” say “when you said that, I felt mad.” You can use this phrasing for just about any kind of disagreement: “I felt like you were...,” “I feel (emotion) when you...,” and so on. Using “we” language is all about making the other person feel included and relevant. When discussing opportunities, events, or group work, rely on “we” and “us” phrasing to cement the loyalty of your peers and suggest loyalty to those above you on the social or career ladder. For example, instead of asking someone “do you want to hang out with me this weekend?” say, “we should get together this weekend!” This puts the other person on equal footing with you and grants them power over the chance that's being offered. Giving people power is a surefire way to gain power in return, because people will be much more inclined to bend and flex for you when the time comes to return the favor if they remember their past interactions with you in a positive and empowering light. Reader Poll: We asked 641 wikiHow readers about what communication skills most attract them to someone, and only 5% named assertiveness as the most appealing trait. [Take Poll] While it's good to be direct, you're actually more likely to endear people to you by using friendly, kind, and gentle language."
    },
    {
      "title": "Match rhythms with those around you.",
      "content": "Match rhythms with those around you. Stage and street hypnotists alike use this powerful technique to dramatic effect every time they seem to “charm” someone into changing their mind or bending the rules a little bit. In principle, there isn't much to this technique, but it takes practice to become adept at using it. Start with a short “in” to the conversation and use simple questions to get the other person talking. As you use your active listening skills, pay special attention to accents, verbal tics (such as “like” and “uh”), and general phrasing. As you respond and continue to ask for what you want, speak more, but match the other person's verbal tics and patterns. Feel free to lean towards their accent a little too, but don't make a caricature of it. Speaking the way others speak puts them at ease and subtly suggests to them that they can trust you because you're like them in some indefinable way. Whenever you notice something about the other person's body language, match it. Does he shift his weight from foot to foot? Is she tapping one finger as she waits for the computer to load, or all of them? You can match these little things to create an even more powerful sympathetic bond."
    },
    {
      "title": "Demonstrate your good character.",
      "content": "Demonstrate your good character. Supportiveness, kindness, enthusiasm, boldness, and reliability are the key traits you should try to exhibit. [18] X Research source These are the traits everyone looks for in others, the traits that make you a person people want to trust in and listen to. They start with personal sincerity and dedication, and are hard to fake. However, if you focus on them, you can train yourself to exhibit them more often and more freely than you did before. Affirm yourself every day. [19] X Research source It sounds silly, but self-affirmation works. Just think about the positive traits you want to embody, and say them aloud to yourself a few times. Tell yourself you are a person who has them: “I am a kind person;” “I am an enthusiastic person;” and so on. Look for opportunities to demonstrate your better qualities. Many times, due to personal discomfort with a situation, we pass up the bolder choice in favor of the one that will attract less attention. Fight against that by reminding yourself to keep your eyes open for times when you're about to act dismissively or rudely. When you realize you're about to be that unhappy, jaded person, force yourself to be the person people want to be around instead. Even if it doesn't make any difference to the situation, it's excellent training for your mind. Eventually, you'll internalize it."
    }
  ]
}