{
  "url": "https://www.wikihow.com/Treat-Pimples-with-Fucidin",
  "title": "How to Treat Pimples with Fucidin",
  "steps": [
    {
      "title": "Wash and dry your hands.",
      "content": "Wash and dry your hands. Before applying any cream to your pimple, make sure that your hands are completely clean and dry. [1] X Research source"
    },
    {
      "title": "Open the tube of Fucidin cream.",
      "content": "Open the tube of Fucidin cream. Remove the cap and use the spike on the cap to break the seal. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If the tube is new, remove the cap and check to be sure that the seal is not broken before opening it yourself. If it is broken, return the tube and get a new one."
    },
    {
      "title": "Apply the cream to the infected pimple.",
      "content": "Apply the cream to the infected pimple. The medication should be thinly applied 3 to 4 times per day unless directed otherwise by your doctor. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Continue the treatment until the pimple heals. Rub the medication in with a clean finger or a sterile cotton swab. Use no more than a pea-sized amount and rub it into the skin until you can no longer see it. Wash your hands afterward to prevent the medication from irritating the skin on your hands. Do not apply Fucidin to uninfected areas, as it may cause irritation."
    },
    {
      "title": "Consult your doctor for advice before using it if you are pregnant or breastfeeding.",
      "content": "Consult your doctor for advice before using it if you are pregnant or breastfeeding. Similarly, do not use it on a young child or infant without discussing it with your doctor first. [4] X Research source"
    },
    {
      "title": "Use caution when applying Fucidin.",
      "content": "Use caution when applying Fucidin. Be sure to apply it only to the pimple. If you are applying the medication to your face, be careful not to get it in your eyes. Do not swallow the medication and keep it out of reach of small children. Do not apply it to mucous membranes such as your mouth or genitals."
    },
    {
      "title": "Be aware of the possible side effects.",
      "content": "Be aware of the possible side effects. Side effects are uncommon, but if they do occur, discontinue the medication immediately and get medical help. Possible side effects include: [5] X Research source Irritation where it has been applied—symptoms may include pain, burning, and, itching Rashes More severe skin eczema"
    },
    {
      "title": "Do not use Fucidin if you are allergic to it.",
      "content": "Do not use Fucidin if you are allergic to it. Know what ingredients are contained in Fucidin. If you show symptoms of an allergic reaction (difficulty breathing, swelling of the face or throat, a rash/hives, etc.) seek medical help immediately. [6] X Research source The main active ingredients are fusidic acid and hydrocortisone acetate. Here’s a quick breakdown of the other ingredients: butylhydroxyanisole (E320), cetyl alcohol, glycerol, liquid paraffin, polysorbate 60, potassium sorbate, water, all-rac-α-tocopherol, and white soft paraffin. In particular, butylhydroxyanisole (E320), cetyl alcohol, and potassium sorbate may cause an itchy rash or inflammation where applied. If you show these symptoms, discontinue the medication and consult your doctor."
    }
  ]
}