{
  "url": "https://www.wikihow.com/Write-a-T%E2%80%90BEAR-Paragraph",
  "title": "How to Write a T‐BEAR Paragraph",
  "steps": [
    {
      "title": "State your thesis.",
      "content": "State your thesis. Begin with the \"T,\" which stands for thesis. A thesis is an arguable claim that is main point of your paragraph. It is an assertion that will be supported by examples and evidence throughout the rest of the paragraph. At the beginning of your T-BEAR paragraph, ask yourself what you're trying to say in your paragraph. [1] X Research source For example, say you're writing a paper about your favorite book and why you like it. A good thesis could be something like, \" Charlotte's Web is a book that teaches readers the meaning of friendship.\""
    },
    {
      "title": "Give a brief explanation.",
      "content": "Give a brief explanation. The \"B\" stands for \"brief explanation.\" After stating your thesis, explain yourself. Offer a sentence that narrows down your thesis slightly and explains what you're going to discuss. [2] X Research source The explanation should offer any background information your reader may need to know and help you transition into presenting your supporting evidence. For example, you could write something like, \"The characters in Charlotte's Web always help each other out, but they don't expect anything in return.\""
    },
    {
      "title": "Cite examples that support your thesis.",
      "content": "Cite examples that support your thesis. Move on to the \"E,\" which means examples. Give your reader examples that help illustrate and provide support for your thesis. Offer 1 or 2 examples as evidence. Examples can be direct quotes, specific details, facts and figures, statistics, and anything else you would use to support your claim. [3] X Research source For example, you could say something like, \"At the beginning of the story, Wilbur is scared because he is going to be sent to slaughter. Charlotte helps him get out of trouble by writing words in her web, but she never asks him to do anything for her.\""
    },
    {
      "title": "Analyze your paragraph.",
      "content": "Analyze your paragraph. The \"A\" means \"analyze.\" Connect the examples you've presented with your argument. Tell readers how your ideas about the information connect to your thesis. For example, \"Even though Wilbur can't save Charlotte from dying, she tells him that being her friend is important. That, on its own, was all she needed from him.\""
    },
    {
      "title": "Repeat a few of your main points.",
      "content": "Repeat a few of your main points. The \"R\" in T-BEAR means \"review/reflect/relate.\" Here, you should start to really drive your point home. Find a way to restate the points you made in your thesis to make your point clearer. For example, \"This shows that friends are selfless. They help one another without expecting favors.\""
    },
    {
      "title": "Close with reflection that drives your essay forward.",
      "content": "Close with reflection that drives your essay forward. Reflect on the implications of what you're saying and how it relates to a larger idea. A T-BEAR paragraph is only one paragraph in a single paper. Think about other arguments you're going to make and how you could move into them with the information you just presented. [4] X Research source For example, you're going to talk about other friendships in Charlotte's Web . You could write something like, \"Charlotte and Wilbur's friendship is a model for the human friendships in the book.\""
    },
    {
      "title": "Make sure your thesis is clear and engaging.",
      "content": "Make sure your thesis is clear and engaging. When revising your essay paragraph by paragraph, read over each thesis statement carefully. Make sure it is arguable and makes a claim. The statement should be clear and easy to understand, while being engaging enough to grab a reader's attention. [5] X Research source Your first sentence should be an invitation. It should be alluring enough that readers are enticed to keep reading. For example, the statement, \" Charlotte's Web is about friendship\" states your point, but it's a little dull. It could be rewritten as, \"Friendship is vital to human happiness, and the value of that bond is shown in Charlotte's Web .\""
    },
    {
      "title": "Check that the information flows logically.",
      "content": "Check that the information flows logically. Make sure there are no sentences that seem out of place. Each paragraph should have a single focus, so remove any sentences that drift off topic and could be better placed elsewhere. [6] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source For example, say you've written, \"Charlotte and Wilbur are very good friends. Charlotte is a spider and Wilbur is a pig.\" The information about the types of animals the characters are feels a little out of place, and could be mentioned elsewhere."
    },
    {
      "title": "Make sure your closing sentences summarize your key points.",
      "content": "Make sure your closing sentences summarize your key points. It can be hard to write a closing sentence without sounding repetitive. However, it's important you summarize your main point briefly before moving on. Read the last sentences of your paragraph to make sure you've connected the information to draw a conclusion. [7] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source For example, say you end with the sentence, \"That's why Charlotte's Web is about friendship.\" This reminds readers of your point, but does not summarize the information. Instead, write something like, \"This shows how Charlotte's Web demonstrates that true friends don't keep score.\""
    },
    {
      "title": "Proofread your paragraph.",
      "content": "Proofread your paragraph. After writing your paragraph, set it aside for an hour or so. Then, come back to it and give it a careful proofreading to make sure there are no spelling or grammatical errors. Before turning in a paper, each paragraph should be carefully proofread. [8] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source It can help to have a friend or family member read over the paragraph for you. Changing the font can help you catch typos. You can also try reading your paragraph out loud or backwards."
    }
  ]
}