{
  "url": "https://www.wikihow.com/Wash-a-Wool-Blanket",
  "title": "How to Wash & Dry a Wool Blanket at Home Without Damaging It",
  "steps": [
    {
      "title": "Shake the blanket out before washing.",
      "content": "Shake the blanket out before washing. Grasp the blanket firmly with both hands and shake it repeatedly. Hang it up in a well-ventilated area of your house, away from any direct sunlight or heating sources. [1] X Research source In some cases, this step will be enough to refresh your blanket, and no further washing is needed."
    },
    {
      "title": "Brush the blanket with a soft-bristled brush.",
      "content": "Brush the blanket with a soft-bristled brush. Lay your blanket flat onto a clean surface, like a dining room table or a recently mopped floor. Following the grain of the blanket’s surface, use a soft-bristled brush to go over each section of the blanket. [2] X Research source Brushing your wool blanket removes any embedded dirt and smooths the blanket’s fibers to lay in the same direction."
    },
    {
      "title": "Treat stains with a vinegar, club soda, or detergent solution.",
      "content": "Treat stains with a vinegar, club soda, or detergent solution. Mix 2 ⁄ 3 cup (160 mL) of cold water with 1 ⁄ 3 cup (79 mL) of a mild detergent , distilled white vinegar, or club soda. Soak the stained area with the solution and blot the stain with a soft, clean cloth before rinsing with cold water. Avoid using any scrubbing motions to clean the stain. [3] X Research source Stains are best treated when cleaned immediately before they have the chance to set. If your wool blanket has a hardened or solid stain , like melted chocolate, use a spoon to gently remove the material from the wool fibers. Then, wash the blanket as normal. If your wool blanket has a dry or oily stain , like from makeup or skincare, dab at the stain with mineral spirits to dissolve and lift the oils, then rinse the area with cold water. If your wool blanket has a stubborn stain that isn’t budging with other methods, try soaking your stain with a 3:1 mixture of rubbing alcohol and water. This solution should be used sparingly and directly applied to the stain rather than used as a cleanser for the whole blanket. If your wool blanket has a dried blood stain , soak a cloth with undiluted white vinegar and apply it directly to the stain. Let sit for a few minutes before rinsing with cold water."
    },
    {
      "title": "Soak the blanket in cold water for 15 minutes.",
      "content": "Soak the blanket in cold water for 15 minutes. Fill your washing machine with cold water and a wool-specific laundry detergent . Place your wool blanket into the machine and let it pre-soak for 15 minutes. [4] X Research source Alternatively, you can soak the blanket in a large, clean bucket or washing tub filled with cold water and detergent."
    },
    {
      "title": "Wash the blanket on a delicate, cold cycle for 2-3 minutes.",
      "content": "Wash the blanket on a delicate, cold cycle for 2-3 minutes. Pour a wool-safe detergent into your machine’s detergent dispenser. Set the machine to a gentle or delicate cycle with low spin. Select a cold water temperature between 60–80 °F (16–27 °C). Let the machine run for 2-3 minutes, then cancel the cycle and switch to the rinse cycle. [5] X Research source Let the rinse cycle run completely. If you still see suds on your wool blanket, send it through one more cold rinse cycle. Keep the machine at half-full and avoid overloading it with other items. If your washer has a wool-specific cycle, use this setting instead of the gentle or delicate cycle."
    },
    {
      "title": "Roll the blanket up in a dry bath towel.",
      "content": "Roll the blanket up in a dry bath towel. Lay your wool blanket on top of a large bath towel and roll the two items together with the bath towel on the outside. The bath towel should absorb any excess moisture from the wash cycle. [6] X Research source Use more than one towel to absorb all the moisture, if necessary. Avoid wringing out the wool blanket to remove moisture, as this may ruin the wool's shape."
    },
    {
      "title": "Hang the blanket or lay it flat to air dry.",
      "content": "Hang the blanket or lay it flat to air dry. Don't put a wool blanket in the dryer, as the heat may shrink the blanket beyond repair. Lay the blanket flat over an outdoor clothesline that can support the weight of the wet blanket. Keep the blanket out of any direct sunlight, which can potentially fade the blanket’s colors or diminish its softness. [7] X Research source Flip the blanket every 1-2 hours to help dry both sides equally. Avoid using any clothespins that may stretch the blanket. If you don’t have a clothesline, hang the blanket over a door, drying rack, or on a clean towel bar instead. If you don't have space to hang your blanket, cover your dining room table or another flat surface with a layer of absorbent towels and lay the wet blanket on top of those to dry."
    },
    {
      "title": "Follow the laundry care tag instructions for your wool blanket.",
      "content": "Follow the laundry care tag instructions for your wool blanket. Look for a dry clean-only symbol on your blanket’s care label—this may look like an empty circle inside a square or an X over a bucket of water. [8] X Research source If you see one of these symbols, take your blanket to the dry cleaners instead of washing it at home. Your wool blanket’s care tag will likely also have symbols relating to its water temperature and ironing requirements. Check out our complete guide to reading washing labels to decode all the symbols on your blanket’s care tag."
    },
    {
      "title": "Wash your wool blanket every 3 months.",
      "content": "Wash your wool blanket every 3 months. If you use your wool blanket on a daily basis, washing it every 3 months with a wool-safe detergent will keep it clean. If you don’t use your wool blanket that frequently, however, you can spot-clean the wool or clean it seasonally rather than machine-washing it regularly. [9] X Research source If you only use your wool blanket in the winter months, for example, you can machine wash it once before storing it for the rest of the year."
    },
    {
      "title": "Avoid using normal laundry detergent when washing wool blankets.",
      "content": "Avoid using normal laundry detergent when washing wool blankets. Some laundry detergents may be too harsh for the soft wool fibers, especially if they contain stain removers or bleaching agents. [10] X Research source Look for mild soaps with a neutral pH (like baby shampoo ) or a wool-specific detergent like Woolite or Kookaburra Wool Wash ."
    },
    {
      "title": "Avoid washing a wool blanket on high-speed or warm water cycles.",
      "content": "Avoid washing a wool blanket on high-speed or warm water cycles. Washing a blanket in any hot water can shrink the wool and make your blanket unusable. Similarly, running a high-speed spin cycle with a wool blanket may cause damage and warping that can’t be undone. [11] X Research source Your wool blankets should always be washed on a low-spin cycle at the coldest temperature possible."
    },
    {
      "title": "Avoid drying your wool blanket in a machine dryer.",
      "content": "Avoid drying your wool blanket in a machine dryer. Any heat exposure can shrink your wool blanket or ruin its soft surface. Wool blankets must always be air-dried, either on a clothesline in the shade or laid flat on a clean surface indoors."
    },
    {
      "title": "Iron your wool blanket at 300 °F (149 °C) with a pressing cloth.",
      "content": "Iron your wool blanket at 300 °F (149 °C) with a pressing cloth. Lay the wool blanket onto an ironing table or other flat surface and place a pressing cloth on top. Set the iron to its wool setting (300 °F (149 °C)). Gently iron the fabric to smooth out any wrinkles. [12] X Research source Remember, wool blankets should rarely need ironing. It's best to use irons sparingly as they can expose wool blankets to excess heat, potentially damaging the fabric."
    },
    {
      "title": "Soften your wool blanket by washing it with leave-in hair conditioner.",
      "content": "Soften your wool blanket by washing it with leave-in hair conditioner. Add 1–2 tablespoons (15–30 mL) leave-in hair conditioner to a bucket of cold water. Mix in 2–3 tablespoons (30–44 mL) of wool-safe laundry detergent and swish the water around to combine. Place your wool blanket into the container and let it soak for a few seconds. Rinse the blanket in cool water and lay flat to air dry."
    },
    {
      "title": "Store your wool blanket in an airtight container or bag.",
      "content": "Store your wool blanket in an airtight container or bag. Place your blanket in a tightly sealed bin or a heavy-duty plastic storage bag . Add a few cedar chips or woodblocks to the container before sealing to repel moths and other pests. [13] X Research source Moth balls can also be used to keep away insects that may eat away at wool fibers. However, they can leave behind unpleasant smells that are difficult to get rid of."
    },
    {
      "title": "Mend small holes and tears with a darning needle and wool thread.",
      "content": "Mend small holes and tears with a darning needle and wool thread. Thread a darning needle with wool thread that matches the color of your blanket. Pinch the hole together and darn the hole with an anchor stitch. [14] X Research source To repair large holes in a wool blanket, find a scrap of wool fabric that matches the blanket. Patch the hole by sliding the scrap over the hole and securing it with a straight stitch on both sides of the blanket. Wool blankets are pretty pricey, so it’s usually worth repairing any moth holes in them. If left unrepaired, moth holes typically only grow bigger until the wool blanket is severely damaged and practically unusable."
    },
    {
      "title": "Try unshrinking a wool blanket with vinegar or fabric softener.",
      "content": "Try unshrinking a wool blanket with vinegar or fabric softener. Mix a solution of cold water with 1 cup (240 mL) of vinegar, fabric softener, hair conditioner, or a specialty wool product. Soak the wool blanket in this mixture for 10-15 minutes, then rinse it with cool water. Ideally, these ingredients will relax the fibers of the wool so you can stretch the blanket back into shape. Wool shrinks when exposed to warm or hot water or any other type of heat source. If you’re unsure of how to clean or repair your wool blanket without causing shrinkage, ask a local dry cleaner for their expertise in restoring the blanket."
    }
  ]
}