{
  "url": "https://www.wikihow.com/Understand-Your-Emotions",
  "title": "How to Understand Your Emotions",
  "steps": [
    {
      "title": "Understand the origin of emotions.",
      "content": "Understand the origin of emotions. Emotions are programmed responses shaped by evolution. They allow you to navigate your environment in ways that were generally adaptive in the past and are often still adaptive today. [1] X Research source For example, emotions like fear evolved over time. When our human ancestors, who had the capacity to experience fear, saw a steep cliff, they behaved more cautiously as they neared the precipice. Because they took more precautions, individuals who experienced fear were more likely to survive than those without fear. The fearful individuals lived long enough to reproduce and gave birth to children with a similar capacity for fear. Evolution selected for both negative emotions like fear and positive emotions such as happiness. Negative emotions deter individuals away from actions that are harmful or costly. On the other hand, positive emotions motivate people towards potentially beneficial actions. [2] X Research source"
    },
    {
      "title": "Know the basic emotions.",
      "content": "Know the basic emotions. Most psychologists agree that there are a set of so-called \"basic emotions\" with which all humans are endowed. These basic emotions are: anger, disgust, fear, happiness, sadness, and surprise. Researchers have since expanded the list of emotions to include contempt, pride, shame, love, and anxiety. There may be more basic emotions than that, but the extent to which they are universally experienced or culture-specific remains up for debate. [3] X Research source"
    },
    {
      "title": "Learn about the role emotions play.",
      "content": "Learn about the role emotions play. Emotions are incredibly important for our survival, our ability to thrive, and our ability to make good decisions. All emotions—even negative ones—help us navigate our world. For example, imagine you woke up one day, and you didn't feel embarrassed or have any sense of shame or social anxiety. You generally did not care at all how you acted in front of other people. Chances are you would lose all your friends if you didn't care how you acted around them. That’s because emotions help us to get along with others. [4] X Research source"
    },
    {
      "title": "Recognize how emotions affect decision-making.",
      "content": "Recognize how emotions affect decision-making. Emotions are critically important to our ability to make decisions. Emotions provide value or weight to some information, thereby biasing our decision-making in one direction or another. Several studies have found that people with lesions to parts of their brain that are involved with emotion have impaired decision-making and in some cases impaired moral behavior. [5] X Research source The most famous of these cases is Phineas Gage (PG). While working PG was accidentally impaled in the head with an iron rod, damaging a part of his brain involved in the processing of emotion. Miraculously, PG survived the accident, although he was never the same person again. His personality changed drastically. He displayed flat or inappropriate emotion, made horrible decisions, and was miserable to be around. One of the main reasons for this shift in behavior was that the rod had damaged a part of his brain involved in emotion. [6] X Research source [7] X Research source One group that has trouble in society are psychopaths. One of the key diagnostic criterion for psychopathy is a lack of emotion, something called callous-unemotional traits or a lack of empathy or guilt. Lacking these emotions can lead to antisocial and sometimes criminal behavior, highlighting the importance of emotion to our sense of morality. [8] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source"
    },
    {
      "title": "Know that emotions can become disordered.",
      "content": "Know that emotions can become disordered. Just as you could get a disorder of your kidneys or eyes, your emotions can also become disordered. If you think your emotions are potentially disordered, talk to a mental health professional about treatment options. Some of the more common disorders of emotion, or mental disorders in which emotions are affected include: [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Depression, which involves persistent and long-lasting feelings of sadness and a loss of interest. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Anxiety disorders. General anxiety disorder refers to extended and excessive worry about day-to-day occurrences. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Schizophrenia can be associated with a lack of emotions or an irritable or depressed mood. Mania, which generally occurs in bipolar disorder, refers to an extended period of abnormally and excessively elevated mood. Manic individuals may also be excessively and persistently irritable. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Record when your emotions occur.",
      "content": "Record when your emotions occur. Once you have a sense of when emotions arise and how they feel, you can take notes on your emotions to further understand them. To learn more about the specific emotions you experience and what triggers them in your life, keep a log of when you feel an emotion and write down what you think triggered it. For example, maybe you felt anger and you recalled that soon before you realized that you had to wait in line for 15 minutes for lunch, and you hate waiting in lines. You can use this information to increase or decrease the emotions that you want or don't want in your life. If you know what makes you angry, you can take steps to avoid situations that trigger that emotion. For example, once you know that you hate waiting in lines, you can only buy a small handful of groceries at a time, so you can use the express lane."
    },
    {
      "title": "Learn what each emotion feels like.",
      "content": "Learn what each emotion feels like. People report that different emotions feel different subjectively. While the clearest distinction is that negative emotions feel very different than positive emotions, different negative emotions also feel different from each other. Embarrassment feels different than sadness, which feels different from fear."
    },
    {
      "title": "Learn what anger feels like.",
      "content": "Learn what anger feels like. Anger is experienced when someone has wronged you in some way. It serves to dissuade them from doing so again in the future. Without an emotion like anger, people might repeatedly take advantage of you. [13] X Research source The experience of anger sometimes begins in the back between the shoulder blades and travels upward, along the back of the neck and around the sides of the jaws and head. When experiencing anger you may feel hot and flustered. If you notice sensations like tension, pain, and pressure in your back, neck, and jaws, you may be internalizing your anger."
    },
    {
      "title": "Learn what disgust feels like.",
      "content": "Learn what disgust feels like. Disgust is a response toward repulsive stimuli, often things that can make us physically sick. It functions to protect us from things that could make us ill. It can also be experienced when we find things metaphorically gross - like certain moral violations. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Disgust is felt primarily in the stomach, chest, and head areas of the body. You may actually feel sick or nauseous and find yourself closing off your nasal passages and moving away from the revolting stimuli. [15] X Research source"
    },
    {
      "title": "Understand what fear feels like.",
      "content": "Understand what fear feels like. Fear is experienced in response to dangerous threats like bears, heights, or guns. It helps us to avoid these things in the moment and to learn to avoid them in the future. [16] X Research source Although fear is an evolved emotional response, many of the things we are afraid of are learned. Fear is usually felt primarily in the top half of the body. However, when it involves a fear of heights, fear often involves sensation in the legs. When experiencing fear, your heart may beat faster, you may breathe quicker, your palms may feel sweaty and hot as part of your nervous system kicks into high gear. This response is the so called fight or flight response."
    },
    {
      "title": "Know what happiness feels like.",
      "content": "Know what happiness feels like. Happiness is experienced in response to things that often have implications for surviving, thriving, and passing on one's genes. Examples of things that make us happy include having sex, having children, succeeding in a valued goal, being praised by others, and being in a nice welcoming environment. [17] X Research source While happiness is perhaps one of those most easily recognizable or well-known emotions, is also one of the most difficult to define. It can involve feelings of warmth throughout the whole body, or it can involve a sense of feeling content, safe, or living the good life. [18] X Trustworthy Source Proceedings of the National Academy of Sciences Official peer-reviewed and multidisciplary journal for the National Academy of Sciences. Go to source [19] X Research source"
    },
    {
      "title": "Review what sadness feels like.",
      "content": "Review what sadness feels like. Sadness is experienced in response to a loss that we care about. It is a very painful emotion, which may act to help us to avoid losses in the future or to appreciate what we have when we get something back (such as in the case of a romantic partner). [20] X Research source Sadness often begins in the chest and moves upward through the throat and up to the eyes where we see tears. You've probably heard the expression: \"She's all choked up.\" Allowing yourself to cry fully can be a cleansing experience. Paying attention to the physical sensations in these areas and allowing the energy to move, helps us to grieve after a loss and empathize with others' suffering. [21] X Trustworthy Source Proceedings of the National Academy of Sciences Official peer-reviewed and multidisciplary journal for the National Academy of Sciences. Go to source [22] X Research source"
    },
    {
      "title": "Know what surprise feels like.",
      "content": "Know what surprise feels like. Surprise is experienced when something is unexpected but not deemed to be a threat. It is an interesting emotion in that it is relatively neutral in valence compared to the other emotions, which are often felt as positive or negative. Surprise may function to help re-orient attention to novel unexpected things. [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Surprise is felt primarily in the head and chest. It is experienced in response to the unexpected; it can feel like a bit of a jolt. [24] X Trustworthy Source Proceedings of the National Academy of Sciences Official peer-reviewed and multidisciplary journal for the National Academy of Sciences. Go to source"
    }
  ]
}