{
  "url": "https://www.wikihow.com/Store-Tulip-Bulbs",
  "title": "How to Store Tulip Bulbs in Summer & Winter",
  "steps": [
    {
      "title": "Cut the blooms off the bulb once the flower dies.",
      "content": "Cut the blooms off the bulb once the flower dies. Once your flower has lost its flowers, use a pair of pruning shears to cut the flowering stem off the bulb. This helps prevent the bulb from using more energy than it needs to. Trim as close to the base of the bulb as you can. [1] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Keep the leaves on your tulips. These help store energy for the next season."
    },
    {
      "title": "Dig up the bulbs once the leaves yellow and die.",
      "content": "Dig up the bulbs once the leaves yellow and die. Once the foliage has turned yellow and shriveled, use a garden shovel to loosen the soil around the bulb and pull it out of the ground. Shake off any excess soil, and dispose of any bulbs that appear diseased or damaged. [2] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source It typically takes about 6 weeks for the foliage to yellow and die after the tulip’s blooming period. During this time, the bulb is gathering the energy it needs from the sun in order to bloom the following spring. Do not overwater the bulbs as the leaves die. An occasional rain is okay, but the bulbs will start to rot if the soil is too wet. Healthy tulip bulbs appear full and hard. If they’re soft, shriveled, or discolored, it’s time to discard them. If there are only small spots of rot, cut them off using a sharp, sterilized knife. Diluted bleach, rubbing alcohol, or white vinegar will work as a disinfectant."
    },
    {
      "title": "Clean the bulbs and let them dry for about 2 days.",
      "content": "Clean the bulbs and let them dry for about 2 days. Remove any leaves and roots from the bulb with a pair of pruning shears or sharp scissors, then wipe the outer layer of the bulbs with a dry paper towel. Place the bulbs on a tray and store them in a cool, dry place out of the sun for 2 days. A garage or shaded area outside will work best. [3] X Research source The outer layer of the bulb may be dying if it is browned or shows signs of rot, so gently rub it with the paper towel in order to remove it. If the bulbs are stored in the sun or in moist conditions, they will retain the moisture and begin to rot."
    },
    {
      "title": "Place the bulbs in a mesh bag or in a box layered with peat.",
      "content": "Place the bulbs in a mesh bag or in a box layered with peat. A mesh bag allows air to flow to the bulbs while they are being stored. Alternatively, lay the bulbs flat on a tray or in a tote or box with layers of peat , dry sand , or vermiculite between them. This will help absorb moisture and prevent the bulbs from rotting during storage. [4] X Research source It may also help to wrap individual bulbs with small pieces of newspaper. The newspaper helps store some moisture and helps keep the bulbs at a consistent temperature. Rather than purchasing a new mesh bag, consider reusing an old onion bag."
    },
    {
      "title": "Store the bulbs in a dark, dry place or in the fridge.",
      "content": "Store the bulbs in a dark, dry place or in the fridge. In general, a garage or cellar will work well, as long as the temperatures do not drop below freezing. If you live in a warm climate where temperatures do not drop below 50 °F (10 °C), chill the bulbs in the refrigerator instead. Keep them in the crisper drawer so the fridge light doesn’t shine on them. Try to keep the temperature around 40–50 °F (4–10 °C) [5] X Research source Keep the bulbs away from light or they will start to grow prematurely. Avoid storing tulip bulbs with apples or other fruits or vegetables, as they release ethylene gas that could kill the flower inside the bulb. When stored properly, tulip bulbs can last for 12 months, but be sure to check for shriveled or moldy bulbs every 2 weeks. Remove damaged bulbs or moldy storage materials as soon as possible."
    },
    {
      "title": "Alternatively, store potted tulips in a garage or shed for the winter.",
      "content": "Alternatively, store potted tulips in a garage or shed for the winter. Storing tulip bulbs in a refrigerator helps preserve them in both summer and winter, when the ground temperature may damage them. However, if you live in an area with very cold winters or somewhere the tulips will be exposed to repeated freezing and thawing, another option is to plant them in a pot in the fall. Store the potted plants in a sheltered area, like a garage or insulated shed, to protect them from the winter weather, then move them outside once the first shoots appear in the spring. [6] X Research source Tulips typically need between 8-17 weeks of chill time around 40–50 °F (4–10 °C). If they do not receive this chill time, they won’t grow as tall. If your winters aren’t too harsh, it isn’t always necessary to dig up tulip bulbs. Many thrive in the ground."
    },
    {
      "title": "Plant the bulbs in the spring or fall.",
      "content": "Plant the bulbs in the spring or fall. If you stored your bulbs to protect them from the heat of summer, plant tulip bulbs 6-8 weeks before the first frost in the fall. If you stored your tulip bulbs over the winter, plant them in early spring so they still have time to bloom. [7] X Research source"
    },
    {
      "title": "Tulip bulbs can generally be preserved for up to 12 months.",
      "content": "Tulip bulbs can generally be preserved for up to 12 months. To ensure your bulbs last, keep them in a cool, dry environment that is well-ventilated. Many people choose to store the bulbs in a refrigerator to help maintain the proper temperature. If the bulbs aren’t stored correctly, they may rot before the 12 months are up. [8] X Research source"
    },
    {
      "title": "Storing tulip bulbs gives them a better chance of blooming in spring.",
      "content": "Storing tulip bulbs gives them a better chance of blooming in spring. When you leave tulip bulbs in the ground, it exposes them to rodents and unpredictable winter temperatures, which could damage them. Tulips thrive in cool to cold winter temperatures and need a chilling period of 3 months, so storing them helps ensure they’ll bloom properly. [9] X Research source It’s also a good idea to store your favorite heirloom varieties that may be difficult to get your hands on again."
    },
    {
      "title": "Do tulip bulbs need to be refrigerated?",
      "content": "Do tulip bulbs need to be refrigerated? Tulip bulbs don’t necessarily have to be kept in a refrigerator, but doing so can help ensure they maintain their proper temperature while you’re storing them. However, make sure you don’t store them with anything that creates ethanol, like fruits and vegetables, as this will cause the bulbs to rot. [10] X Research source It is sometimes difficult to maintain the proper level of humidity when refrigerating tulip bulbs. Storing them in a mesh bag allows for proper air circulation, but it can cause the bulbs to dry out. However, too much moisture from condensation can also lead to mold. An alternative is to store them in a garage or any other cool, dry, and dark space. Just be sure to monitor the temperature to make sure the area doesn’t become too warm."
    },
    {
      "title": "Can tulip bulbs go bad?",
      "content": "Can tulip bulbs go bad? Tulip bulbs can go bad if they’re stored improperly or for too long. Be sure to store your bulbs in a cool, dry area to avoid mold growth or damage from too-warm temperatures. If you notice any rotten or cracked bulbs, remove them immediately so the other bulbs don’t get damaged. [11] X Research source"
    },
    {
      "title": "How do you replant stored tulip bulbs?",
      "content": "How do you replant stored tulip bulbs? Plant stored tulip bulbs the same way you would fresh ones. First, examine the bulbs for any signs of mold or damage. If they look good, follow the same instructions you used when you originally planted the tulips to care for them ."
    },
    {
      "title": "Do you need to wash tulip bulbs before planting?",
      "content": "Do you need to wash tulip bulbs before planting? No, don't wash tulip bulbs before planting them, as the excess moisture can lead to fungal growth and rot. Instead, ensure that the bulbs are dry and free of any signs of mold or other damage before planting. [12] X Research source"
    }
  ]
}