{
  "url": "https://www.wikihow.com/Tame-a-Cockatiel",
  "title": "How to Tame a Cockatiel",
  "steps": [
    {
      "title": "Stay quiet and unobtrusive around a new cockatiel.",
      "content": "Stay quiet and unobtrusive around a new cockatiel. Do not attempt begin taming until it has spent a few weeks getting accustomed to its new environment. Keep the cockatiel in a quiet, calm area."
    },
    {
      "title": "Talk to the cockatiel from outside the cage.",
      "content": "Talk to the cockatiel from outside the cage. You may say anything you like, as long as your voice stays calm, without sudden changes in volume. Also try to speak softly, not loudly. Lower yourself to just above the cockatiel's eye level if you are taller than its cage, putting yourself in a less threatening position without appearing submissive. Keep this up for a few days before you make any attempt to train the bird."
    },
    {
      "title": "Make sure your bird is comfortable with you.",
      "content": "Make sure your bird is comfortable with you. At some point, now that your bird is used to the sound of your voice, he or she will begin to move toward you when you sit down to talk to your cockatiel. At this point, you can begin to train your bird, but only very slowly. [1] X Research source"
    },
    {
      "title": "Offer the cockatiel a treat.",
      "content": "Offer the cockatiel a treat. A spray of millet is commonly used to train cockatiels, since the birds are typically enthusiastic about the food, but you may use any cockatiel-appropriate food in small amounts. Hold it through the bars of the cage, but not directly at its face. This encourages the bird to make its way toward you voluntarily. Keep it steady as the bird pecks once or twice, or let it peck for up to five seconds when it demonstrates unusually good behavior. Only use the spray of millet, or whichever treat you chose, as a treat. The cockatiel may be less motivated for training if it can eat the same food without working for it."
    },
    {
      "title": "Repeat this routine daily.",
      "content": "Repeat this routine daily. Each day, set aside some time to talk to the cockatiel, keep your hand steady near the bird, then give it a treat if it calms down. Spend no more than 10 or 15 minutes per session, one or two times a day, to avoid making cockatiel anxious. At the end of each session, make the cockatiel move closer to your hand before it can get the treat. Even if a young bird is willing to play with you and appears happy, keep these sessions to no more than 15 minutes, as a young bird needs to return to its cage to eat and rest frequently."
    },
    {
      "title": "Try not to react when bitten.",
      "content": "Try not to react when bitten. If the cockatiel bites you, try to keep your reaction to a minimum. Jerking away violently, responding loudly, or ending the taming session can encourage the bird to bite again. This can be difficult to avoid due to the painful bite, so try to avoid serious bites in the first place by leaving the cockatiel alone when it is hissing, when it has fully extended its head crest, or when its crest is flattened against its head. Wear thick gardening gloves if biting is a recurring problem."
    },
    {
      "title": "Don't try to punish the cockatiel.",
      "content": "Don't try to punish the cockatiel. Cockatiels do not typically understand what you are doing when you attempt to punish them. They may enjoy it when you shout at them, return them to their cage, or otherwise react to bad behavior. Focus on praising the cockatiel during good behavior instead, or use mild forms of punishment such as ignoring the bird, or gently withdrawing the jewelry it is nibbling."
    },
    {
      "title": "Only pet the cockatiel if it remains calm.",
      "content": "Only pet the cockatiel if it remains calm. Many cockatiels will only let you pet their crest or beak, and some dislike any form of petting. Pet slowly, and withdraw slowly if the bird hisses, nips at you, or flattens its crest."
    },
    {
      "title": "Open the cage only when the cockatiel is comfortable.",
      "content": "Open the cage only when the cockatiel is comfortable. Once the bird is comfortable around you, it will stay calm as you approach it, and may even eat the treat directly from your hand. This may take weeks or months for an adult bird that is not used to close human interaction. Once you've reached this stage, you may convince the cockatiel to leave its cage, although some older birds that did not grow up socialized may not voluntarily do this. Make sure all windows and doors in the room are closed, and no other pets are present, before you open the cage."
    },
    {
      "title": "Continue moving your hand closer during training sessions.",
      "content": "Continue moving your hand closer during training sessions. Once the bird will approach you and eat from your hand, start approaching it in a similar way with an empty hand, extending two fingers horizontally. Hold the hand in position until the bird calms down, rewarding a bird with a treat if the cockatiel remains calm. Again, keep these sessions to 10 or 15 minutes, once or twice each day."
    },
    {
      "title": "Get the bird to step onto your finger.",
      "content": "Get the bird to step onto your finger. Eventually, move your hand directly to the bird's perch, or touch its feet. Once you can keep your hand there without agitating the bird, gently push the bird's lower chest with your fingers. A light nudge should be enough to slightly knock the cockatiel off balance, and cause it to step on your finger with one foot."
    },
    {
      "title": "Encourage the behavior.",
      "content": "Encourage the behavior. Each time the bird starts to step up, say a short command such as \"step up\" or \"up.\" Praise the bird and give it a small treat when it does this. Praise again when bird steps with both feet. Keep training sessions to a few minutes at a time, making sure to always end on a positive note. The cockatiel may use its beak to test the stability of your finger. Try not to jerk your hand away when the beak touches your finger."
    },
    {
      "title": "Teach the cockatiel to step down and ladder.",
      "content": "Teach the cockatiel to step down and ladder. Once the bird will step onto your finger on command, teach it to \"step down\" onto another perch using the same method. [2] X Research source Reinforce these behaviors by teaching it to \"ladder,\" or repeat the \"step up\" command from your left hand to your right and back again. [3] X Research source Train the bird to perform these movements daily, until it will do so on command without a treat. You do not need a special command for laddering. Repeat the \"step up\" command instead."
    },
    {
      "title": "Consider clicker training.",
      "content": "Consider clicker training. As the training gets more complicated, your bird may have trouble figuring out why you are giving it a treat. Try using a \"clicker,\" or make a distinct, short sound by tapping a pen, each time the bird displays good behavior. This gets the bird's attention while you fetch a treat. Once the bird is well trained, you can use just the sound of the clicker or pen as a reward, but until then the treat is still a vital part of the training. A clicker or other distinct sound is recommended over a verbal command, because it sounds the same each time and is unlikely to be encountered outside of training."
    },
    {
      "title": "Continue using clicker training for additional tricks.",
      "content": "Continue using clicker training for additional tricks. Clicker training remains an excellent tool for training pets. Whenever you start teaching the cockatiel a new command, use a clicker or make a distinctive noise by tapping a pen at the moment it shows good behavior. Fetch a treat immediately afterward, and continue daily training until the cockatiel will respond to the command with just the clicker as a reward."
    },
    {
      "title": "Teach the cockatiel to be comfortable in a towel.",
      "content": "Teach the cockatiel to be comfortable in a towel. If the cockatiel is comfortable outside its cage, put it on a white or beige towel on floor each day during its training session. Gradually bring up the corners of the towel, but stop if the bird struggles. Repeat the process each day, rewarding the bird when it stays calm, until you can fully enclose the cockatiel in the towel. This training will make it much easier to bring your cockatiel to the vet, or remove it from a dangerous situation."
    },
    {
      "title": "Teach the cockatiel to talk.",
      "content": "Teach the cockatiel to talk. Repeat a phrase a few times, with an animated facial expression and tone, at a time when the cockatiel is relaxed and happy. If the cockatiel looks at you and demonstrates a reaction, such as cocking its head or dilating its pupils, it may be interested in that word. Repeat that word frequently, but stop if the cockatiel gets bored. When it attempts to mimic you, reward it with a treat. Male cockatiels can make more sounds than females, since they use more complex calls to attract mates. Female cockatiels can still talk, but the voice may not be as clear. Most cockatiels can talk around eight months of age, although you can attempt to teach them as young as four months if the bird appears interested. It can be harder to train an adult bird not used to speaking."
    },
    {
      "title": "Encourage the bird to whistle and dance.",
      "content": "Encourage the bird to whistle and dance. While watching the cockatiel, bob your head or rock your finger back and forth to music with a steady beat. When it starts to rock back and forth, reward it with a clicker and a treat. As you continue this training, and find music that gets the cockatiel's attention, it may sway more energetically and raise its wings while doing so. [4] X Research source Similarly, whistling during these dance sessions may encourage the cockatiel to make sounds of its own."
    }
  ]
}