{
  "url": "https://www.wikihow.com/Write-About-a-Fictional-City",
  "title": "How to Write About a Fictional City",
  "steps": [
    {
      "title": "Read several examples of fictional cities.",
      "content": "Read several examples of fictional cities. To get a better sense of how to write a fictional city, you should read up on several known examples of fictional cities. Fictional cities are often essential to the fictional world of a novel or book and they often complement or reinforce the characters and events that occur in the world of the book. Examples include: [1] X Research source The fictional city of Basin City or Sin City in Frank Miller’s Sin City . The fictional city of King’s Landing in George R. Martin’s A Game of Thrones . The fictional city of Oz (The Emerald City) in L.Frank Baum’s The Wizard of Oz . The fictional city of The Shire in J.R.R. Tolkien’s The Hobbit ."
    },
    {
      "title": "Analyze the examples.",
      "content": "Analyze the examples. Once you have read through several examples of fictional cities, you should take some time to consider what makes the examples so effective. This will help you get a better sense of how to write about your fictional city. Most fictional cities are described using a map drawn by the author or by an illustrator working with the author. Examine the maps provided of the fictional cities and notice the level of detail that is put into the maps. For example, the map provided in J.R.R. Tolkien’s The Hobbit includes the names of places in the language of the novel as well as major landmarks and structures in the fictional area. Look at the naming of the areas or streets in the fictional city. The names in a fictional city can carry a lot of importance, as the names come to symbolize certain aspects of the world of the book. For example, the naming of “Sin City” in Frank Miller’s Sin City graphic novels indicates that the area is known for its sinful inhabitants. The name tells the reader something about the area and what to expect from the characters that live in the area. Note how the author describes the city. Does she use certain descriptions to characterize the city? In The Game of Thrones by George R. Martin, for example, King’s Landing is described as dirty and smelly, but it is also the seat of the throne. These descriptions create an interesting contrast for the reader."
    },
    {
      "title": "Be aware of the pros and cons of using a fictional city instead of a real city.",
      "content": "Be aware of the pros and cons of using a fictional city instead of a real city. Though it may seem easier to set your story in a real city, building a fictional city allows you to use your imagination and really delve into the possibilities of fiction. Your characters need a place to work and interact, and creating your own city frees you up to add elements from several different areas or parts of the real world. [2] X Research source Creating a fictional city will also allow you to use elements of a real city you know well, such as your hometown, and twist them around so they become fictional. If you are very familiar and comfortable in a certain real-life area, you can then use what you know and change them slightly to create a fictional world. Creating a fictional city will also improve your writing overall, as the more believable your city is in your book, the more believable the world of your book will be to readers. Making a convincing fictional city will strengthen your characters as well, as you can shape the city to fit with the actions and perspectives of your characters."
    },
    {
      "title": "Consider basing your fictional city on a real city.",
      "content": "Consider basing your fictional city on a real city. Another option is to use a real city you know well, such as your home city, and add fictional elements to the city so it is not quite real. The advantages of this are that you likely know your home city well and can use it as a template for fictional elements in the city you would like to explore. You can also take physical landmarks or areas in your home city and change them based on your imagination. This way, the fictional city feels real to you in some way."
    },
    {
      "title": "Determine the name of the city.",
      "content": "Determine the name of the city. The name of the city is one of the most elements of a fictional city. The name may be repeated often in your story by your main character, other characters, and in your descriptions. You should think of a name that has resonance and feels purposeful. [3] X Research source You may choose a name that feels generic and sort of “every small town” if you want your story to have a more universal feel to it. A name like Milton or Abbsortford, for example, does not tell readers too much about the town other than it is likely small and in North America. Avoid using a name like Springfield, as this immediately makes readers think of The Simpsons, which may not fit with your story. Consider a name that fits the region or area where your fictional city is located. If your city is located in Germany, for example, you may select a German name or a German term that could also function as a name. If your city is located in Canada, you may select a Canadian city that exists and change the name slightly to create a fictional name. Avoid names that seem obvious, such as Vengeance or Hell, as the reader will be alerted right away to the meaning behind the name. The use of obvious names can be effective if the town acts in contrast to the name. For example, a town named Hell that has the nicest, most pleasant townspeople."
    },
    {
      "title": "Create a historical record of the city.",
      "content": "Create a historical record of the city. Now that you have a name, you are going to need to think about the history behind the city. Creating a historical record of the city will help the city to feel more believable to your characters and to your readers. You should answer several key questions about your city, including: [4] X Research source Who founded the city? This could be a lone explorer who stumbled on the land or Native peoples who built up the city piece by piece using basic tools. Think about the individual or individuals responsible for founding the city. When was the city founded? This can help you get a better sense of the development of the city, as a city founded 100 years ago will have a denser history than a city founded 15 years ago. Why was the city founded? Answering this question can help you better describe the city’s past. Maybe the city was founded through colonization, where a foreign explorer claimed the land and colonized it. Or maybe the city was founded by people who discovered empty land and built it up on their own. The reasons for the city’s existence will help you get a better sense of your characters, as they may have personal ties and connections to the city due to how the city was founded and why it was founded. How old is the city? The age of the city is another important element. An older city may have city planning details that have been preserved, while a newer city may have very few old buildings and an experimental approach to city planning."
    },
    {
      "title": "Describe the landscape and climate of the city.",
      "content": "Describe the landscape and climate of the city. Is the city nestled in the mountains, surrounded by forest? Or is the city located in the desert, surrounded by sand dunes? Your city may be more urban, with a large population and a skyline of buildings and office towers, or your city may more small town, with a mid to small population and a few major streets. Focus on how a stranger to the town might view the city, including the vegetation, the terrain, and the landscape. You should also think about the climate of the city. Is it hot and humid or cold and dry? The climate may also depend on the time of year when your story is taking place. If your story takes place in the middle of winter in a fictional town located in Northern California, for example, it may be warm during the day and cooler at night."
    },
    {
      "title": "Note the demographics of the city.",
      "content": "Note the demographics of the city. The demographics of the city means the type of individuals that make up the city in terms of race, gender, and class. Though your city may be fictional, there will likely be variations in the demographics of the city. You should include details about the demographics, as this will make the city feel more believable. [5] X Research source Consider the racial and ethnic groups in your city. Are there more African American individuals than Latinos or Caucasians? Do certain ethnic groups live in certain areas of the city? Are there areas where certain ethnic groups are not allowed or feel uncomfortable being in? Think about the class dynamics in your city. This could mean a character who is middle-class lives in a certain area of the city and a character of an upper class lives in a more lavish or expensive area of the city. Your fictional city may be divided by class, with certain areas off-limits to all classes except for one class."
    },
    {
      "title": "Draw a map of the city.",
      "content": "Draw a map of the city. It can be helpful to have a physical representation of the city, even if you don’t have the best drawing skills. Make a rough sketch of the city, including major landmarks and the homes where your main characters live as well as where they work. [6] X Research source You may also notate landscape details, like a mountain range that borders the city or sand dunes that protect the city from the outside. Try to add as many details as possible, as this will help you build a more convincing fictional world. If you have a friend who is talented at illustration, you may ask them to help you draw a map of the city in more detail. You can also use online resources to help you build the map. Use a program like Photoshop, for example, to cut and paste images from the internet to create a map or a physical representation of the city."
    },
    {
      "title": "Determine what makes the fictional city unique.",
      "content": "Determine what makes the fictional city unique. Now that you have the basics of the city down, you can start to add some local color. Consider the unique or interesting elements of the city that makes it worth reading about. This could be haunted areas of the city or famous ghost stories that haunt the city. Or, this could be legends about the city that are shared and passed around by characters. [7] X Research source You should also think about what the town is known for, according to the outside world. Maybe the city is known as the center of commerce or has one of the most renowned sports teams. Consider what locals love or enjoy about the city, as this will make it feel more unique. What are the hotspots and cool hang out areas in the city? What are the locals proud of in terms of their city and what are they ashamed of or afraid of in their city?"
    },
    {
      "title": "Highlight details of the city that are essential to your story.",
      "content": "Highlight details of the city that are essential to your story. While it can be tempting to get very in-depth and detailed about your fictional world, it is also important that you focus on specific details that are an essential part of the overall story. The city should serve your characters and your story, not the other way around. Home in on certain areas in the city that are used by your characters and spend time developing these more fully. [8] X Research source For example, maybe your character spends a lot of time at the private school located in the city center. Take the time to think about small details of the school, from how the building appears within the surrounding area to the school colors and the school mascot. Focus on the area around the school and the layout of the school, including classrooms and areas your character spends a lot of time in."
    },
    {
      "title": "Use the five senses.",
      "content": "Use the five senses. A big part of creating a believable world is making the reader feel like they are actually experiencing the city, from the smell of the garbage to the noises on the street. Create descriptions that draw on sight, taste, smell, touch, and sound to help your city come alive. [9] X Research source For example, maybe your city has a polluted river that runs through the area. Think of how it smells as you walk by the river. Have your characters comment on the stench of the river and the way the river looks or sounds. Your story will likely involve several locations or settings that recur. Focus on using the five senses to describe these recurring settings well, as this will help the world of the story feel more convincing."
    },
    {
      "title": "Add real-life details to your city.",
      "content": "Add real-life details to your city. Your reader will be aware she is reading fiction and will likely accept a lot of strange and imaginative elements of the city. But it may be useful to also include elements of real life in the city. This will help your reader feel more grounded in the city as your story moves along. [10] X Research source For example, your characters may spend time in a dense urban area in the city. The area may be populated with strange creatures and monsters but it may also have elements you may find in a real-life urban area, like buildings, streets, and alleyways. Having real-life details and imagined details together can make it easier to build a believable world."
    },
    {
      "title": "Place the characters within the setting and have them move around.",
      "content": "Place the characters within the setting and have them move around. Once you have a more detailed understanding of your fictional city, it can be helpful to write your characters into the setting to see how they interact and move around. The fictional city should support your overall story and your characters should be able to access elements of the city that are necessary to move the story forward. [11] X Research source For example, if you have a character who needs to access a magical portal in the middle of the city to time travel, you should make sure the magical portal is described well in the fictional city. The magical portal should contain enough detail to be believable and your character should interact with it in an interesting way. This will ensure your fictional city is supporting your character’s needs and goals."
    },
    {
      "title": "Describe the city through the perspectives of your characters.",
      "content": "Describe the city through the perspectives of your characters. A big challenge when writing about a fictional city in a story is avoiding obvious moments of description, where you put a description of the city in a character's voice to give the reader information about the setting. This can feel like the writer is trying to \"talk\" through her characters in a way that may feel obvious and forced. You can side step this issue by using the voices of your characters to inform the ways in which you describe the fictional city. Place your character in a situation where she has to walk around or interact with a certain section of the city. Or, have your character use a facility in the city that then allows her to describe how it feels to use the facility. This will give you the opportunity to have descriptions of the fictional city through the perspective of the character, which will feel more believable and convincing to the reader than simply telling the reader about the facility. You should also have your characters treat the more fantastical or strange elements of the fictional city casually and in a straightforward manner. If your fictional city is located under water, for example, a character who has lived in the city for a long period of time may not be surprised that he has to get in his submarine to visit with his neighbor. You can describe the character getting into the submarine and programming it for its destination in a casual, everyday kind of way. This will signal to the reader that submarines are common in this fictional city and used as a form of transportation without having to directly tell the reader that this is the case."
    }
  ]
}