{
  "url": "https://www.wikihow.com/Turn-Off-the-Keyboard-Light-in-Windows-10",
  "title": "5 Ways to Disable the Keyboard Backlight on Windows 10",
  "steps": [
    {
      "title": "Open the Windows Mobility Center.",
      "content": "Open the Windows Mobility Center. Search for the Windows Mobility Center by typing into the search bar on the left side of your taskbar. The Mobility Center allows you to access some of your laptop's more decorative features, including display brightness or battery display. [1] X Research source Be sure to scan your laptop's keyboard for a key with a \"keyboard light\" icon, typically represented by a small square with rays of light shooting outwards from it. You may be able to hold down the \"Fn\" key and this other key simultaneously to filter through your keyboard light's settings. If so, keep tapping the \"keyboard light\" icon until the light turns off. [2] X Research source Your light is now off and you do not need to rely on the Windows Mobility Center."
    },
    {
      "title": "Look for the \"Keyboard\" section of the Windows Mobility Center.",
      "content": "Look for the \"Keyboard\" section of the Windows Mobility Center. The Mobility Center differs across devices, but it typically includes anywhere from 5-6 to boxes, each labeled with a different laptop feature. The \"Keyboard\" section will include an option to turn your keyboard light on or off. Not every Windows laptop will offer a \"Keyboard\" section in the Windows Mobility Center. If the option is not available, try typing the name of your computer into the Windows taskbar's search field and using the manufacturer's device manager. Some computers, particularly gaming laptops, do not allow their keyboard lights to be turned off entirely."
    },
    {
      "title": "Choose the \"Off\" circle under \"Keyboard Light.\"",
      "content": "Choose the \"Off\" circle under \"Keyboard Light.\" If you want to turn your Windows 10 keyboard light off, simply choose the circle that says \"Off\" and click \"Ok\" to exit the Windows Mobility Center and save your settings. There should also be a \"Brightness\" slider, which you can use to manually adjust the brightness of your keyboard light. If you ever want to toggle the keyboard light back on, simply revisit the Windows Mobility Center and choose the circle that says \"On\" instead!"
    },
    {
      "title": "Press the button to toggle your backlights off.",
      "content": "Press the button to toggle your backlights off. Some keyboards, like the Logitech G Pro desktop keyboard, have a physical button with an icon of a sun on it that you can press to control the LED backlights on your keys. [3] X Research source This is common with gaming keyboards."
    },
    {
      "title": "One of the F1-F12 keys will have a sun icon.",
      "content": "One of the F1 - F12 keys will have a sun icon. The sun icon designates the key that you can press to turn off the backlight effect. The exact keys to press vary depending on your keyboard's make and model. For example: Dell's backlight key, which looks like half a sunburst, can be found on the F5 , F6 , F7 , F10 , or right arrow key. [4] X Research source Since the Funtion keys serve more than one purpose, you might need to press and hold the Fn key when you press the backlight key. Acer's backlight toggle key is usually F9 . [5] X Research source Just pressing F9 may not work, so press and hold Fn at the same time to toggle the backlight key. Lenovo users can press Fn + spacebar or Fn + Esc . [6] X Research source Since the Funtion keys serve more than one purpose, you might need to press and hold the Fn key when you press the backlight key. HP laptops usually have the backlight key on F5 , F9 , or F11 . Press Fn at the same time to toggle the backlight. You may need to press these buttons multiple times if your keyboard has different lighting modes. [7] X Research source If you can't find the illumination key, or the key with the sunburst or half a sunburst icon, you can look up the make and model of your keyboard online or look through your owner's manual."
    },
    {
      "title": "Open your keyboard's software and disable the keyboard's backlighting.",
      "content": "Open your keyboard's software and disable the keyboard's backlighting. These are common with gaming or heavy-duty laptops or external keyboards, like HP Omen laptops or Logitech keyboards with the Logitech software. If you aren't sure if your keyboard has specific software, you can search online to find out quickly! Some software isn't named for your model, so it might be confusing and more difficult to find. For example, Razor laptops and peripherals use the Synapse app, but GIGABYTE laptops use the GIGABYTE Control Center; some MSI laptops use a SteelSeries GG software while some Logitech keyboards use the Logi Options+ software ."
    },
    {
      "title": "Restart your computer and press the right combination to enter BIOS.",
      "content": "Restart your computer and press the right combination to enter BIOS. The specific keys that you need to press are different between each laptop or computer manufacturer (you can see more in this wikiHow article ), but you generally press the F1 , F2 , Del , F10 , F12 , or Esc as the logo for the manufacturer is displayed on-screen."
    },
    {
      "title": "Navigate to the \"Keyboard\" section.",
      "content": "Navigate to the \"Keyboard\" section. If your mouse doesn't work, use your arrow keys to navigate and press Enter to select."
    },
    {
      "title": "Disable the Keyboard Illumination.",
      "content": "Disable the Keyboard Illumination. Note that editing your keyboard here is permanent; the next time you turn on your computer or laptop, your keyboard's backlight will still be off. The only way to revert this change is to go back into BIOS and enable this setting. [8] X Research source"
    }
  ]
}