{
  "url": "https://www.wikihow.com/Switch-to-a-Dvorak-Keyboard-Layout",
  "title": "How to Switch to a Dvorak Keyboard Layout",
  "steps": [
    {
      "title": "Figure out what kind of operating system you have.",
      "content": "Figure out what kind of operating system you have. The good news is that the Dvorak format is already configured into your operating system, so you don't have to download anything special to access it. Although QWERTY is the automatic setting, all you need to do is to change between the layouts. [1] X Research source"
    },
    {
      "title": "Change to the Dvorak keyboard layout on Windows.",
      "content": "Change to the Dvorak keyboard layout on Windows. To change to the Dvorak format on Windows XP, follow these steps: Click the \"start\" button> Control Panel> Regional and Language Options> \"Languages\" tab> \"Details\" button >\"Add\" button (under \"Settings\" tab)> in \"Keyboard layout/IME\" scroll to United States-Dvorak and click \"OK\"."
    },
    {
      "title": "Change to the Dvorak keyboard layout on your Mac.",
      "content": "Change to the Dvorak keyboard layout on your Mac. To change to the Dvorak format on your Mac, follow these steps: Click on the Apple Menu> System Preferences> International> Input Menu Tab> scroll to Dvorak [2] X Research source For Mac OS X: Apple Menu> System Preferences> Click on the keyboard icon>Input Sources>Click box next to \"Dvorak\""
    },
    {
      "title": "Switch to DVORAK on Chromebook.",
      "content": "Switch to DVORAK on Chromebook. Go to settings> device> keyboard> change language and input settings> manage input methods> and pick one of the following: After you have picked, make sure to set it as your default. US Dvorak keyboard US Programmer Dvorak keyboard UK Dvorak keyboard"
    },
    {
      "title": "Practice switching between QWERTY and Dvorak.",
      "content": "Practice switching between QWERTY and Dvorak. Once you switch to the Dvorak layout, practice switching back to QWERTY by following the same steps as above, but selecting QWERTY instead of Dvorak. As you start learning Dvorak, you may want the option of switching back to QWERTY if you need to complete a project quickly. Learning how to switch in between the two, at least while you are learning Dvorak, is a good idea."
    },
    {
      "title": "Buy a Dvorak keyboard.",
      "content": "Buy a Dvorak keyboard. Once you have made the change to Dvorak in your operating system, you may want to purchase a new keyboard. Although eventually you will not need to look at the keyboard to type comfortably, it may be useful in the beginning to have a keyboard labeled for the Dvorak type setting. [3] X Research source A Dvorak keyboard is no different internally from your current keyboard; the only difference is that the keys are labeled according to the Dvorak format. These keyboards can be bought at Staples or online on Amazon."
    },
    {
      "title": "Buy a Dvorak keyboard slip.",
      "content": "Buy a Dvorak keyboard slip. If you do not want to buy a new keyboard, you can just buy a Dvorak keyboard slip. These slips are fit right over your keyboard and are labeled according to a Dvorak keyboard setting. They can be found on Amazon. [4] X Research source This is a good option if you are using a laptop because the keyboard is built-in, so buying a new keyboard would probably not be the best option."
    },
    {
      "title": "Put stickers on your existing keyboard.",
      "content": "Put stickers on your existing keyboard. You can also buy keyboard stickers that stick to your keys. You can put each letter over the keys of your keyboard so that the keyboard is labeled like a Dvorak keyboard. These stickers are designed for the shape of the keys and will not come off."
    },
    {
      "title": "Make keyboard stickers.",
      "content": "Make keyboard stickers. If you are feeling crafty, you can go to a store like Staples, buy stickers or labels, write letters on them, and stick them to your keyboard. This is a cheaper option than buying a keyboard or a keyboard slip. You will also easily be able to peel them off to see your QWERTY keys if you decide to switch back."
    },
    {
      "title": "Learn where to put your fingers to type.",
      "content": "Learn where to put your fingers to type. If you already know how to touch-type on a QWERTY, the same fingers operate the same keys. The keys just produce different letters. The home row is: Dvorak: AOEU - ID - HTNS QWERTY: ASDF - GH - JKL If you lose track of where to put your fingers, search for the raised dots on the keyboard. In the Dvorak keyboard format, they are on U and H. Put your left index finger on U and your right on H to bring your fingers back to the home row."
    },
    {
      "title": "Don't \"peck\".",
      "content": "Don't \"peck\". Don't use one finger to find and \"peck\" at the letters of the keyboard when you are learning how to type. Keep your fingers on the keyboard and use the same fingers to reach keys as you do on the QWERTY keyboard. Since you aren't used to the keyboard you might be tempted, but don't do it! If you type like that, you'll never learn how to type correctly using Dvorak and you will not be able to type quickly or comfortably. [5] X Research source"
    },
    {
      "title": "Start slow.",
      "content": "Start slow. You're just learning this keyboard layout, so it's not expected that you can type fast! Taking the time you need is actually better than speeding through and making mistakes. By being accurate, you are beginning to create a muscle memory with your fingers that eventually will allow you to type without even thinking about what to do with your fingers."
    },
    {
      "title": "Print out a picture of the Dvorak keyboard.",
      "content": "Print out a picture of the Dvorak keyboard. As you're learning, put a Dvorak keyboard diagram next to you. This will save you time because you won't have to keep moving your fingers out of the way to see the keyboard letters. It also might help your visual memory of how the keyboard looks."
    },
    {
      "title": "Cut back on looking at the keyboard.",
      "content": "Cut back on looking at the keyboard. As you get faster and more confident at typing, don't look down at the keyboard until you make a mistake. This will help you to develop touch-type so you eventually won't have to look down at the keyboard at all."
    },
    {
      "title": "Use online resources to learn.",
      "content": "Use online resources to learn. Learning the Dvorak layout will be challenging. Luckily, there is a wide array of resources available through the internet that can help you learn. Videos are an especially useful resource because you can follow along with them. Youtube has an array of videos meant to help you learn Dvorak typing. These videos are free and readily available. If you prefer a series of lessons, there are some good programs that teach Dvorak programs. You can do some research to help you find the best program for your needs. Make sure you go through lessons at a reasonable pace. Although the lessons may be easy, do them multiple times to ensure you have mastered everything they offer. [6] X Research source"
    },
    {
      "title": "Practice, practice, practice!",
      "content": "Practice, practice, practice! Try to use Dvorak as much as possible, even if you hate how slow it is at first Practice will make you more familiar with the keyboard layout. Practicing for small amounts of time, such as fifteen minutes per day is more effective than practicing for hours once a week. [7] X Research source Make practicing fun. Instead of calling a friend, text them using instant messaging or Facebook chat. This is a way of making practicing less tedious. [8] X Research source"
    }
  ]
}