{
  "url": "https://www.wikihow.com/Use-a-Scale",
  "title": "How to Use a Scale",
  "steps": [
    {
      "title": "Purchase the right type of kitchen scale.",
      "content": "Purchase the right type of kitchen scale. Most kitchen scales for home use are digital as they are more accurate and easier to use than analog scales. [1] X Research source Look for a scale that can switch between measuring units. To give you the most flexibility when preparing food, a good scale should be able to weigh in grams, kilograms, ounces, and pounds. Also look for a scale with a “tare” function that zeroes out the weight of measuring containers. Most scales for home use have a capacity between 10 and 12 pounds. Unless you bake in large batches, you probably don’t need a scale that measures beyond that. [2] X Research source"
    },
    {
      "title": "Place a bowl or plate on the scale and zero out its weight.",
      "content": "Place a bowl or plate on the scale and zero out its weight. You should always use the tare/zero function to zero out the weight of the container before you add the food to be measured. Use the appropriate type of plate or bowl. You might want to use a bowl when using ingredients that will need to be combined, such as when you’re baking, and use a plate when weighing things like meat. You can also weigh foods directly on the scale. Always wipe off and clean your scale with a hot soapy paper towel before and after weighing, especially if you use it to weigh something like raw meat or poultry. Zero out the scale after if using multiple ingredients. For example, if you’re baking a cake, add the baking powder, then press the “zero” or “tare” button to reset the scale to zero before adding the flour or other ingredients. [3] X Research source"
    },
    {
      "title": "Make the most of your scale.",
      "content": "Make the most of your scale. Scales are great for a variety of reasons. Make sure you use your scale correctly and read the directions before use. Liquid ingredients can be measured accurately using a volumetric method (like a measuring cup), but dry ingredients should always be weighed if you want the best control over your results. [4] X Research source Control portion sizes with a scale. You can weigh just about any type of food. Make sure to weigh “deceptive” food items (foods that don’t fit well into measuring cups) like dry pasta and breakfast cereal. In addition, stick to the following portion sizes for the food groups: 3-4 oz of protein [5] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source , 1 oz of grains [6] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source , 4 oz of fruit [7] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source or 8 oz of vegetables. [8] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source Use a scale to divide portions equally. For example, if you’re baking a layer cake, a scale can help you divide the batter evenly between three pans: just zero out the weight of the pan before adding the batter. If your recipe gives volumetric measurements for dry goods, find a reliable converter to help you determine what they weigh. You can purchase these or find them online. [9] X Research source"
    },
    {
      "title": "Purchase a quality scale within your budget.",
      "content": "Purchase a quality scale within your budget. There are a variety of bathroom and home scales that you can purchase. Some will be relatively inexpensive, whereas others will cost a significant amount more. Choose a quality scale that still fits in with your budget. You want a scale that will last for several years and be able to maintain its calibration. In addition, digital scales are thought to be superior to mechanical scales as these are fragile and more inaccurate. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Many quality digital scales are accurate within 1 pound anywhere between 97 – 100% of the time. Older-model spring and dial scales may be accurate as little as 13% of the time. [11] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source You may even want to consider a newer model digital scale that can measure body fat and even track weight loss. [12] X Research source"
    },
    {
      "title": "Place the scale on a hard, flat surface.",
      "content": "Place the scale on a hard, flat surface. When you're weighing yourself, you want to make sure that your results are as accurate as possible. Put your scale on the appropriate surface to help with its accuracy. Most scales will come with directions that will say where the best place is to put your scale. Make sure to follow the manufacturer's advice. Placing your scale on carpet can cause the scale to read your weight as 10% heavier! [13] X Research source The bathroom or kitchen is usually a good place for an at-home scale. Make sure the scale is lying level. A scale that tilts or sits unevenly will not read your weight accurately."
    },
    {
      "title": "Calibrate the scale.",
      "content": "Calibrate the scale. Over time, your scale may lose its accuracy. It's normal after many times of weighing or being moved around. Check it regularly to make sure the results you're receiving are accurate. Check your scale’s accuracy by putting an item with a reliable known weight (like a dumbbell or a bag of flour or sugar) on it. Check the reading you get and make any adjustments as needed. [14] X Research source Refer to your owner’s manual to calibrate your scale regularly. Many digital scales always have a \"calibration feature\" which can help you accurately calibrate your scale."
    },
    {
      "title": "Step onto the scale.",
      "content": "Step onto the scale. Depending on which scale you purchase or have at home, there might be a slightly different way to step on the scale to get your reading. With analog scales, you can usually just step on and wait until the dial stops spinning and read your result. However, if you own a digital scale, you may have to “prime” your scale before hopping on. Some require you to tap it to \"wake it up\" and then step on before it gives you a reading. Always refer to your owner’s manual for proper weighing procedures."
    },
    {
      "title": "Weigh yourself weekly.",
      "content": "Weigh yourself weekly. Research suggests that weighing yourself regularly —at least once a week — may help contribute to weight loss and even long-term weight maintenance. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Weigh yourself at the same time every day (preferably in the morning) for the best results. In addition, try to be wearing the same thing whenever you weigh in for an accurate trend. [16] X Research source Weigh yourself in the morning for best results. Weigh in after you’ve emptied your bladder and before you’ve had breakfast to eliminate as many variables as possible. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There is some disagreement about whether or not it is helpful to weigh yourself daily. New evidence suggests that weighing yourself once daily and at the same time will help you lose weight and/or maintain your weight. [18] X Research source If, however, you have a history of disordered eating or find that you are becoming obsessive over your weight, then cut back to only doing it once or twice weekly."
    },
    {
      "title": "Use a chart to track your progress.",
      "content": "Use a chart to track your progress. If you're interested in gaining or losing weight, tracking your weight over time can help you meet your goal. If ink and paper are your thing, you can make a poster to track your numbers or use a paper journal. Otherwise you can use one of the many mobile apps and websites to help you track your weight loss. Even if you want to maintain your weight, getting on the scale and recording your weight is a good idea. You'll be able to see any unwanted weight gains or losses and be able to change your lifestyle as needed."
    },
    {
      "title": "Test the scale's accuracy.",
      "content": "Test the scale's accuracy. Many of those manual scales you might encounter will either be at your doctor's office (where they'll weigh you) or at your local gym. If you use a scale at your gym, it's very important to make sure the scale is accurate and calibrated correctly. There are most likely dozens of people who step on the scale on a regular basis. You can use a dumbbell from the gym to help calibrate the scale. Use a 25-pound dumbbell and place it gently on the scale. Move the top and bottom weights so it equals 25 pounds. The needle at the left and right should be floating in the middle of the little open slot at the ends. You can also make sure it's calibrated at zero as well. Again, the needles should be floating right in the center of the open slots at the top. [19] X Research source If the scale is not calibrated correctly, tell a staff member and have them correct it so you can use it."
    },
    {
      "title": "Remove excess clothing.",
      "content": "Remove excess clothing. Unless you're at home or at your doctor's office, you don't need to strip down into your underwear to get an accurate weight, especially if you're in a public place; however, taking off shoes, jackets or heavier layers of clothing is appropriate. Removing as much excess weight as you can also help you get a more accurate reading for your weight. [20] X Research source Remember what you typically weigh yourself in. Try to weigh yourself in the same or close to the same type of clothes each time so you get an accurate trend over time."
    },
    {
      "title": "Step on the scale.",
      "content": "Step on the scale. Like a digital or analog scale, you'll need to step on the scale to get your weight. Sometimes mechanical scales feel a little wiggly when you step on the bottom. Stand as still as you can and balance so that bottom plate is moving around when you weigh yourself. Slide the large weight along the bottom beam. The large weight has larger scale increments than the small weight (often 10 – 25 pounds). Then slide the small weight along the top beam. Once you’ve got the large weight in the general vicinity of your weight, use the small weight to zone in on the precise measurement. Add the top and bottom numbers to get your weight."
    }
  ]
}