{
  "url": "https://www.wikihow.com/Yes-Day-Rules",
  "title": "How to Have a Successful Yes Day: Ground Rules & Activity Ideas",
  "steps": [
    {
      "title": "Yes Day rules vary from family to family.",
      "content": "Yes Day rules vary from family to family. There are no set rules for Yes Days, as each parent, child, and family is different. While there are a few standard rules that most families choose to follow, it is up to you whether you implement them or not. Consider the needs of your family and how your children are likely to react when setting up your rules."
    },
    {
      "title": "Activities cannot be illegal or unsafe.",
      "content": "Activities cannot be illegal or unsafe. Your family’s safety must always come first, even on fun-filled Yes Days. Explain to your kids that Yes Day activities cannot cause harm to them, you, or anyone else. As the parent, you reserve the right to determine which activities are too dangerous. [1] X Research source For example, if your child is allergic to peanuts but really wants a candy bar with peanuts, you can deny this request as it would hurt them."
    },
    {
      "title": "Keep all Yes Day activities within budget.",
      "content": "Keep all Yes Day activities within budget. It’s entirely up to you whether or not you want to create a budget for Yes Day, but many parents agree that it’s a good idea. This way, you can still say yes to your child within reason without worrying about how you’re going to afford it. [2] X Research source If you want, set different budgets for different aspects of Yes Day, like a food budget, toy budget, and activity budget. This way, your child is encouraged to have fun while learning how to use their money responsibly."
    },
    {
      "title": "The Yes Day lasts no more than 24 hours.",
      "content": "The Yes Day lasts no more than 24 hours. It’s called a Yes Day for a reason! Many parents set their Yes Day limits for a full 24 hours while others limit them to the hours their child is normally awake. It’s entirely up to you which version you choose, but make sure your child knows the time frame they have to work with. [3] X Research source For example, if you don’t want your child waking you up at 3 am to go do something, it might be a good idea to end their Yes Day at their normal bedtime. Most parents also agree that Yes Day activities cannot have permanent results after the day is over. For example, getting a puppy wouldn’t be allowed because you’d have to continue to care for it after Yes Day. Make sure your children understand this beforehand."
    },
    {
      "title": "Set travel limits, if necessary.",
      "content": "Set travel limits, if necessary. Decide if all Yes Day activities must take place in your own town or city or if you’re willing to travel. If you live in a small town, it might be worth it to visit a bigger city for the day so your child has more options for activities. On the other hand, if your child is the type to ask to visit a completely different state, make sure they know their physical boundaries. [4] X Research source"
    },
    {
      "title": "Consider if your child should earn their Yes Day.",
      "content": "Consider if your child should earn their Yes Day. Arranging a Yes Day is a great way to make sure your child is on their best behavior. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Make sure that all homework and chores are done beforehand. Remember, though, that Yes Days aren’t necessarily meant to reward behavior and are instead a way to bond as a family, so don’t be too harsh on them."
    },
    {
      "title": "Have fun!",
      "content": "Have fun! The most important unofficial rule of Yes Days is to enjoy them. This is a day for your whole family to let go of their worries and enjoy spending time together. If the idea of setting strict rules is too stressful, don’t do it! You know what works best for your family, so plan your day accordingly."
    },
    {
      "title": "Visit exciting places in your area.",
      "content": "Visit exciting places in your area. Do some research to find fun activities and attractions near you, and let your child pick their favorites. While some of these activities cost money, there are a ton of free options as well. Your city may even have some hidden gems you didn’t know about! Here are some activities you might do for Yes Day: [6] X Research source Visit a museum Go on a short road trip Take a tour of the city Go to an arcade See a movie or a play Go to a concert Eat at your child’s favorite restaurant Go to an amusement park Go shopping for toys Visit the zoo or an aquarium"
    },
    {
      "title": "Spend the day outdoors.",
      "content": "Spend the day outdoors. If the weather’s nice, spending the day outside is a great way for your child to burn off some extra energy while having fun! Plus, many outdoor activities are free or cheap, so you don’t have to worry about spending a ton of money or going over budget. Here are some examples: [7] X Research source Go camping Have a picnic at the park Go to the beach Enjoy a day at the pool Go hiking Play your child’s favorite sport Visit different playgrounds Have a water balloon or water gun fight Draw on the sidewalk with chalk Play in the mud or leaves"
    },
    {
      "title": "Enjoy quality time at home.",
      "content": "Enjoy quality time at home. If your child is more introverted or a homebody, don’t try to force them out of their comfort zone. This is a day for them to do what they want, after all, and there are a ton of fun activities you can do from the comfort of your own home. Here are some great examples: [8] X Research source Have a movie marathon Play dress up Bake your child’s favorite dessert Play board games Build a fort in the living room Play “The Floor is Lava” Organize a treasure hunt or scavenger hunt Have a pillow fight Make slime or do fun science experiments Have a dance party"
    },
    {
      "title": "Plan the date ahead of time.",
      "content": "Plan the date ahead of time. By choosing a specific date for your Yes Day, you’ll have more time to prepare for the day, figure out your ground rules, and save up some money. The countdown to the day will also give your kids something to look forward to. A Yes Day can be any random day you choose, or it can be a special day like your child’s birthday. [9] X Research source This also gives you time to think about what your kids might like to do and plan any big surprises, like a trip to an amusement park."
    },
    {
      "title": "Set clear boundaries before doing any activities.",
      "content": "Set clear boundaries before doing any activities. Once you’ve decided on your rules, explain them to your children as clearly as possible and answer any questions they may have. Doing this before the Yes Day begins gives your kids more time to think of appropriate requests and will hopefully prevent them from feeling confused or upset if you have to refuse one of their ideas. [10] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "Be open-minded.",
      "content": "Be open-minded. Remember, the whole point of having a Yes Day is to let your kids do things they’re excited about. Even if it’s something you’d normally turn down immediately, stop and think about why you want to say no. If it isn’t dangerous and doesn’t go against any of your Yes Day rules, why not give it a shot? [11] X Research source For example, let’s say your kids have never had sushi before. You know they don’t like fish and you really don’t think they’ll enjoy it, but they want to go to the new sushi restaurant for Yes Day. Sure, they may end up not liking it, which could mean wasting some money, but the experience encourages them to get out of their comfort zone and try new things."
    },
    {
      "title": "Yes Days empower children to make their own decisions.",
      "content": "Yes Days empower children to make their own decisions. Children often feel like they’re always being told what to do, which can make them feel like they’re not in control of their own lives. Letting them take control for a day helps validate their feelings and makes them feel heard and understood. [12] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source"
    },
    {
      "title": "Yes Days help children build communication skills.",
      "content": "Yes Days help children build communication skills. By setting rules and boundaries with your child on a Yes Day, they’re able to develop their negotiation skills. If they make a request that isn’t possible, have a conversation with them to explain why and let them come up with an alternative idea. Children must also work with their siblings to come up with an activity they’ll all enjoy, which boosts cooperation and compromise. [13] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "They encourage children to problem solve.",
      "content": "They encourage children to problem solve. Kids are great at thinking outside the box, especially when given the opportunity to solve their own problems. If their chosen activity isn’t possible for whatever reason, they must think creatively to come up with another idea. This helps them develop a sense of independence and self-reliance. It may also boost self-confidence as they see how their choices can positively impact their lives. [14] X Research source"
    },
    {
      "title": "A Yes Day strengthens family bonds.",
      "content": "A Yes Day strengthens family bonds. Spending quality time as a family supports children’s emotional and psychological well-being. Studies have shown that children with positive family relationships are more likely to have higher self-esteem and social skills. Having a Yes Day allows you to understand your child’s interests to help you get to know them on a deeper level, and both you and your child can develop a greater appreciation for each other. [15] X Research source"
    },
    {
      "title": "It helps you meet your child’s attachment needs.",
      "content": "It helps you meet your child’s attachment needs. Your child, like all humans, has a need for emotional connection and autonomy. Having a Yes Day not only gives children the freedom to make their own choices, but it shows them that you trust and respect them. This helps them feel emotionally secure."
    },
    {
      "title": "Yes Days are fun and relieve stress.",
      "content": "Yes Days are fun and relieve stress. Yes Days aren’t just fun for the kids—they can be exciting for adults, too! Having a Yes Day allows you to leave your stress behind for 24 hours and focus on spending time with your loved ones. You’ll feel more relaxed and create wonderful memories that will last a lifetime. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "A Yes Day is a day where parents say yes to their child’s requests.",
      "content": "A Yes Day is a day where parents say yes to their child’s requests. On a Yes Day, children are encouraged to make choices about how the family will spend their day, including which activities they participate in, what they eat, and where they go—within reason. Parents are allowed to set rules and boundaries to ensure their children are safe and don’t go overboard with their ideas. The goal is to teach children how to make their own choices and to strengthen family bonds. [17] X Research source The concept of Yes Days was popularized after the 2021 Jennifer Garner film Yes Day . The movie was based off of the book of the same name by Amy Krouse Rosenthal and Tom Lichtenheld."
    },
    {
      "title": "What if my child asks to buy a lot of toys?",
      "content": "What if my child asks to buy a lot of toys? Many parents are worried that their child will want to spend too much money, but this is rarely the case. Most of the time, children will be excited about getting to spend a whole day doing fun activities, so buying toys isn’t always the first thing on their mind. Remember, though, that you set the rules for Yes Day. Set a budget for how much they can spend or limit how many toys they’re allowed to get. [18] X Research source"
    },
    {
      "title": "What if my children want to do different things?",
      "content": "What if my children want to do different things? If you have more than one child, odds are, they’ll all want to do different activities. To settle this, ask each one to choose a single activity they want to do so everyone gets to do something they enjoy. Usually, kids end up enjoying activities they were originally reluctant to do and everyone has a fun time! [19] X Research source Or, let your children know about the Yes Day ahead of time and tell them to work together to come up with ideas they’d all enjoy. This is a great way to teach them about cooperation!"
    },
    {
      "title": "What if my child wants to eat sugar all day and gets sick?",
      "content": "What if my child wants to eat sugar all day and gets sick? Yes Days aren’t just fun—they can be a learning experience. Because children are still learning how to navigate the world, they may make some decisions that aren’t in their best interest. If you’re okay with letting your child have a ton of sugar, let them do it so they can understand the consequences and learn the importance of self-control and moderation. [20] X Research source Remember, though, that you make the rules. If you really don’t want your child to consume a ton of sugar, create that boundary ahead of time. If there isn’t a medical reason to prevent them from eating sugar, though, it likely won’t hurt to let them experience it for one day."
    },
    {
      "title": "What if they just want to stare at screens all day?",
      "content": "What if they just want to stare at screens all day? As usual, it’s entirely up to you to decide what your kids can and cannot do on Yes Day, so feel free to limit or ban screentime. However, in most cases, children will grow bored of watching movies or playing video games and decide to do something else. They often realize it’s a waste of the Yes Day and they could do something way more fun! [21] X Research source"
    },
    {
      "title": "How often should we have a Yes Day?",
      "content": "How often should we have a Yes Day? Yes Days can happen once a month, every few months, once a year, or whatever works best for your family. Just be sure to plan ahead of time so everything runs smoothly, and remember that if Yes Days happen too frequently, your child might lose some of their excitement."
    }
  ]
}