{
  "url": "https://www.wikihow.com/Start-a-Conversation-with-Someone-on-the-Train,-Bus-or-Subway",
  "title": "How to Start a Conversation with Someone on the Train, Bus or Subway",
  "steps": [
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. Making brief eye contact can show the person that you're interested and help you gauge whether they are interested in you. Glance at the person (don't stare) and try to hold their gaze for just a second or two. Notice how they respond to your eye contact. If they meet your gaze, it’s likely positive. If they look away quickly or appear disinterested, it’s probably best not to approach. [2] X Research source Try to make eye contact again after about 30 seconds. If the person makes eye contact with you again, this is a good sign that they notice you and want to interact with you. When making eye contact, keep your facial expression light and friendly, rather than straight and serious."
    },
    {
      "title": "Smile",
      "content": "Smile at them. If you’ve successfully met their gaze, smile at the person. A small but genuine smile makes you appear interested, friendly, and approachable. If the other person smiles back, you're likely in luck in getting them to talk to you. If you want to flirt with the person, smiling is a great way to get somebody’s attention. Try a flirty smile by being coy or cocking your head a bit."
    },
    {
      "title": "Use open body language.",
      "content": "Use open body language. Make a point to appear open, comfortable, and available. Do this by keeping your arms uncrossed and pointing your hips in the direction of the person. Stand or sit up straight and show good posture . Avoid crossing your body, hunching over, or turn away from the person, as these gestures can make you appear closed off or disinterested. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Use appropriate spacing. If you’re too close, the person may feel like you’re invading their space. If you’re too far, you won’t be able to get their attention or hear what they say."
    },
    {
      "title": "Read the person's body language and notice if they’re open.",
      "content": "Read the person's body language and notice if they’re open. While you’re trying to have good body language, scope out the other person’s body language, too. If they exhibit open body language toward you, that's a great sign. Open body language looks like they are uncrossed and perhaps even pointed toward you. They should appear relaxed, not stiff or uncomfortable. If the person turns away or buries their head in a book, newspaper or magazine, that's not so good. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Notice if their hips or knees are pointed toward you as this is a good sign that they want to connect. If the person is staring out a window or turned away from you, don’t approach."
    },
    {
      "title": "Approach the person to start talking to them.",
      "content": "Approach the person to start talking to them. Once you’ve read the other person to see if they’re interested in conversing, make a move. If you’re far away, move closer. You should be a comfortable distance where you can hear each other yet not feel awkward if the conversation doesn’t work out. Find a seat near them, yet don’t crowd them. If they're standing, stand near enough to them to be able to speak with them, but don't get too close for comfort. If there’s a seat next to them, ask, “May I sit here?” Try not to be nervous. Many people are just as excited to chat with new people as you are. Reader Poll: We asked 651 wikiHow readers, and 61% said that making an observation about what’s happening around you is the best way to open the conversation. [Take Poll] So according to our readers, it might make sense to say something like: \"So nice that the train isn't too crowded today. Yesterday it was impossible to get a seat!\""
    },
    {
      "title": "Avoid disturbing someone.",
      "content": "Avoid disturbing someone. Approach with caution if someone is reading a book or newspaper, on their phone, or listening to music with headphones on. These are often ways to signal to others that they wish to be undisturbed. However, you might wish to comment on the book they’re reading if it’s one of your favorites. Make a quick comment and notice how the person responds. For example, if the person gives a quick, “Thanks” and then goes back to their book, take the hint and move on. However, if they look up and appear like they want to talk, go ahead and engage in a discussion."
    },
    {
      "title": "Ask the person an open-ended question",
      "content": "Ask the person an open-ended question to start the conversation. A question is a great way to start a conversation, but not just any question will do. Ask an open-ended question that requires more than a \"yes\" or \"no\" answer. What you ask isn't really important, as long as it's not invasive, insulting or prying. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For example, ask a practical question, such as, \"How do you get to downtown?\" instead of \"Does this bus stop at the city center?\" If you notice they have a book with them and you know the author, say, “She’s a great author. What other books of hers have you read?” Once the conservation begins, you may find that it continues very naturally."
    },
    {
      "title": "Use small talk to casually connect with someone.",
      "content": "Use small talk to casually connect with someone. Say something about how crowded or empty the bus is, mention the weather, or say something else about the commute. While this is small talk, it can break the barrier and get you talking to one another. Making small talk can lead to having an actual conversation. [6] X Research source For example, say, “How are you handling the heat? It’s been a scorcher outside!”"
    },
    {
      "title": "Pay them a compliment if you notice something you like about them.",
      "content": "Pay them a compliment if you notice something you like about them. The person might be wearing a t-shirt of a band you like or have an interesting phone case. Maybe you think the person is attractive and you want to compliment their eyes or their smile. Open the conversation by paying a compliment. Giving someone a compliment about how they look can make them feel good and put them at ease. [7] X Research source For example, you can say, “Excuse me, I just wanted to tell you you have a beautiful smile” or, “You have great taste in music, I love your shirt!”"
    },
    {
      "title": "Talk about yourself if you want to help them feel comfortable.",
      "content": "Talk about yourself if you want to help them feel comfortable. Without coming off as self-centered, say something about yourself. This will show openness and encourage the other person to follow suit. Say something simple and not too personal. [8] X Research source If you can, relate what you say to something about the other person. For example, say, “Your earrings are great. I also love to wear funky jewelry, like this ring I put on today.” Don’t talk about yourself too much, however. If you say something about yourself and the person seems interested, ask a question. For example, say, “This is my first time on the train. Do you ride often or is this your first time, too?”"
    },
    {
      "title": "Keep conversing as long as they seem interested.",
      "content": "Keep conversing as long as they seem interested. Listen attentively to the person's response to your comments or questions and then keep talking. If the person is interested in you, the conversation will probably flow fairly naturally. Continue asking good questions and get to know the person more. Notice whether they’re asking questions of you, too. For example, ask about where they’re from and what they do for a living. You can also ask if the ride the bus or train frequently."
    },
    {
      "title": "Read their cues.",
      "content": "Read their cues. Keep checking with the person to make sure they’re engaged. If they are speaking back to you, answering questions, and seem eager to keep talking, you’re doing well. Continue monitoring their body language and eye contact to note their level of engagement with you. [9] X Research source If they start to shut down, look away, or give short answers, wrap up the conversation and thank them for chatting. If they're not very responsive, it is better to end the conversation than to continue. You don't want to bother the other person if they don't want to chat."
    },
    {
      "title": "Ask for their phone number if you want to speak to them again.",
      "content": "Ask for their phone number if you want to speak to them again. If you’ve had a nice conversation and you’d like to see the person again or talk to them over the phone, ask for their phone number before either of you get off the stop. Express your interest in the person and let them know you’d like to get to know them better. Say, “It’s been really nice getting to know you. I’d like to see you again. Can I have your number?” Make it clear whether your advances are friendly or flirtatious. If flirtatious, mention going on a date. If friendly, talk about becoming friends."
    },
    {
      "title": "Go back to what you were doing if the person appears bored or disinterested.",
      "content": "Go back to what you were doing if the person appears bored or disinterested. As soon as the person appears disinterested or disengaged, stop talking to them. You can let the conversation trail off or go back to doing what you were doing before you spoke to them. Some people are fine making small talk but don’t want to have a conversation. Respect their privacy and let them be. [10] X Research source For example, put on your headphones or play on your phone."
    }
  ]
}