{
  "url": "https://www.wikihow.com/Work-up-to-a-Handstand-Push-Up",
  "title": "How to Work up to a Handstand Push Up",
  "steps": [
    {
      "title": "Start doing push ups.",
      "content": "Start doing push ups. Begin building upper body and core strength by incorporating the standard push up into your daily exercise. A proper push up should be performed with palms flat on the ground and hands directly under the shoulders, with fingers turned slightly outward. Keeping your core engaged and your body in a straight line, lower yourself until your chest touches the floor and then press your weight back up. [1] X Research source Push ups provide the foundation of upper body pushing strength and should not be neglected. Always perform push ups in a full range of motion and don’t cheat. When lowering and pressing up, make sure your elbows are bending at a 45 degree angle behind you, not straight out to the sides. At the bottom position, your body should roughly form the shape of an arrow, rather than a T. [2] X Research source Once regular push ups become easy, increase the difficulty by elevating your feet, adding weight in the form of a vest or weight plate positioned on the lower back, or doing clapping push ups."
    },
    {
      "title": "Train the shoulders directly.",
      "content": "Train the shoulders directly. In the handstand position, your entire bodyweight is being supported by the upper chest and shoulders. For this reason, it’s a good idea to hit the different muscles in the shoulders directly during your training. Overhead presses, dumbbell shoulder presses and lateral raises all target the deltoid muscles in the shoulder and will help you build the strength required to lift your body in an inverted position. Because the handstand push up is a movement that requires explosive strength, try to keep the intensity of weight training exercises high and the repetitions in the 5-8 range. This will condition the muscles to push hard against heavy weight, thus helping you gain strength. [3] X Research source If you don’t have access to weights or gym equipment, you can target the shoulder muscles by changing your push up technique. Hindu push ups and shoulder push ups both shift the emphasis of the movement to the deltoids and trapezius and more closely simulate a handstand pressing position. [4] X Research source"
    },
    {
      "title": "Develop your core strength.",
      "content": "Develop your core strength. Though the chest and shoulders are the main movers in a handstand push up, the core muscles play a major role in stabilizing the handstand, keeping you upright. Strengthen your core along with your upper body by adding sit ups, V-ups, and leg raises to your regimen. You’ll find this will make holding a handstand a lot easier once the time comes. [5] X Research source Pull-ups and hanging leg raises are also effective for strengthening the muscles of the core because they require constant tension in the midsection, similar to their function in a handstand. [6] X Research source"
    },
    {
      "title": "Perform forearm exercises.",
      "content": "Perform forearm exercises. To keep your balance while in a handstand, you have to make constant adjustments to the force applied by the forearms. Therefore, giving the forearms a little attention while exercising can pay off substantially. Try farmer’s walks or dead hangs in order to improve forearm strength—go for time on these exercises since muscular endurance translates to how long you’ll be able to balance a handstand. [7] X Research source To perform a dead hang, find a pull-up bar or ledge and simply hang from it, supporting your entire body weight by your fingers and forearms. Farmer’s walks are one of the easiest exercises to do and also one of the most beneficial. Just find two heavy objects with handles or a place to grip (kettle bells, water jugs and cement bags make great weights for farmers walks) and start walking. That’s it! If you’re crafty, you can also try making a forearm roller to build grip strength. [8] X Research source Try other arm strengthening exercises like tricep curls, lat pulldowns, push-ups, and bench presses. Reader Poll: We asked 366 wikiHow readers and only 11% said that the best exercise for building arm strength is a bench press . [Take Poll] So if your main goal is having more arm strength for your handstand push ups, another exercise may be better."
    },
    {
      "title": "Try a headstand first.",
      "content": "Try a headstand first. Before you throw yourself upside down in a handstand attempt, spend a little time in a headstand. You may have done these as a kid: this is a much easier position to get into and hold and will also train you to keep your core tight and push through the shoulders and fingers to maintain your balance. The headstand makes great preliminary practice for being inverted. [9] X Research source Headstands can cause strain on the neck if you’re not careful because your weight is being partially supported by the top of your head. Use a pillow for cushioning if it’s your first time and don’t hold it for too long. Make sure you’re bearing your weight on the shoulders and forearms/hands, not the neck itself."
    },
    {
      "title": "Kick up against the wall.",
      "content": "Kick up against the wall. Now that it’s time to actually begin training the handstand, start by using a wall. Place your hands a couple inches away from a sturdy wall and kick one leg straight up behind you, followed by the other, to lift you into a vertical position before you come to rest against the wall. Your goal at first is just to get used to kicking up into position and being upside down. Hold this stance for 10-30 seconds at first, then try increasing your time as you get stronger. [10] X Research source Once inverted, your back should be slightly arched with only the soles of the feet or toes making contact with the wall. If your back touches the wall, it means you’re too rounded or off your axis and you’ll lose balance. If you find that you’re having trouble kicking up to the wall, begin instead by facing away from the wall and walking your feet up a little at a time until you’re inverted; this can also make a good conditioning drill for relying on core and shoulder stability."
    },
    {
      "title": "Learn to balance.",
      "content": "Learn to balance. As you get more comfortable in a handstand, start coming away from the wall. Hold the handstand for as long as you can on your own, using a light press against the wall if you feel yourself falling. This will teach you to stay slightly forward on your fingers which aids in balancing. Work towards minimizing the time you spend touching the wall. In a freestanding handstand, maintain your balance by pressing hard against your fingers when you feel yourself leaning too far forward, and bending the elbows slightly while pressing against the palms when you start leaning backwards."
    },
    {
      "title": "Intensify the position.",
      "content": "Intensify the position. Add difficulty to your handstand to continue gaining stability as you get stronger. Instead of doing a full handstand against the wall, lower yourself until your elbows are bent 45 to 90 degrees and hold this position for as long as you can; alternately, shift your weight to one side and raise one hand off the ground briefly to support your weight on only one arm. When you feel ready, begin training freestanding handstands without using the wall. [11] X Research source You can also wear a weighted vest to make regular handstands more challenging, or do them on grass or uneven surfaces."
    },
    {
      "title": "Ask a spotter to help you.",
      "content": "Ask a spotter to help you. Because of the difficulty and risk involved with this move, a spotter is essential when you first start. When you kick up your legs, ask the spotter to grab them and hold them steady. Once you find your balance, have the spotter gradually release you until you are able to hold yourself steady."
    },
    {
      "title": "Do push ups using the wall as support.",
      "content": "Do push ups using the wall as support. Practice the basic inverted push up against a wall. Taking the balancing aspect out of the movement will allow you to focus on exerting the strength necessary to lower and push yourself back up. Start performing handstand push ups against a wall in place of regular push ups during your workouts. [12] X Research source Lower yourself in a slow, controlled manner and push up quickly and explosively. Doing the “negative” portion of the movement slowly will further improve stability and endurance. [13] X Research source Have the spotter grab your legs when you push them up and hold them steady until you have found your balance. Aim to complete 1-3 handstand push ups using a wall at first, then work your way up from there."
    },
    {
      "title": "Try \"bottoms-up\" push ups.",
      "content": "Try \"bottoms-up\" push ups. One alternative to lowering yourself into the push up is to start at the bottom of the movement and press yourself up from there. This will be substantially harder but makes a good progression once you’ve reached a more advanced level of strength. The bottom portion of the push up is the toughest, so the more time you spend training in that range of motion, the stronger your handstand push up will eventually be. [14] X Research source These can be done against a wall, or out of a headstand if you also want to practice balancing on the way up."
    },
    {
      "title": "Perform freestanding partial push ups.",
      "content": "Perform freestanding partial push ups. Before you move on to full range of motion handstand push ups, do a few going only a quarter or half of the way down. Your balance will be compromised by the vertical movement, so you’ll have to focus on making delicate corrections while lowering and raising yourself. Once you can perform 2-3 partial push ups without putting your feet down, you’re ready to give full, freestanding handstand push ups a shot. [15] X Research source"
    },
    {
      "title": "Attempt a handstand push up.",
      "content": "Attempt a handstand push up. Kick up to a handstand and get into a stable position to begin the push up. Lower yourself in a smooth, controlled motion, stopping when your nose is about two inches from the floor. Reverse the motion by pushing hard through the palms and shoulders, making necessary corrections until you’ve returned to an upright position with the arms extended. Congratulations, you did it! [16] X Research source If you need extra leverage to complete the push up and your balance is good enough, arch your back slightly so that your head is thrust ahead of your hands instead of being between them. This will place more emphasis on the larger, stronger muscles of the upper chest and can give you the mechanical advantage you need. [17] X Research source Don’t be discouraged if you fall or can’t push yourself all the way up on the first couple attempts. The handstand push up is a very advanced move and requires a lot of specific practice in addition to general strength. Master your handstand and focus on doing partial push ups and the full push up will come naturally."
    }
  ]
}