{
  "url": "https://www.wikihow.com/Throw-a-Hand-Grenade",
  "title": "How to Throw a Hand Grenade",
  "steps": [
    {
      "title": "Locate your target before you ready your grenade.",
      "content": "Locate your target before you ready your grenade. Unlike firearms, there's no way to \"point\" a grenade at your enemies so that is selectively deals to damage to them — grenades will indiscriminately hit anything, friend or foe, that's within their blast radius. For this reason, it's extra-important to know where your enemy is before you pull the pin. Don't even grab your grenade until you've identified an enemy position you intend to strike — you do not want to be caught with a live grenade and have nowhere to throw it. Note, however, that, in combat situations, you can expose yourself to enemy fire if you spend too much time peeking out of your cover and trying to locate your enemy. This requires you to delicately balance your need to locate your target with your need to protect yourself. Many sources recommend against spending more than just a second or two looking for your enemy."
    },
    {
      "title": "Grab your grenade in your throwing hand.",
      "content": "Grab your grenade in your throwing hand. When you've found a target and you're ready to throw, grab your grenade in the hand you usually use for throwing. Grip the grenade in the palm of your hand with the pull ring pointing up. Use your thumb to put steady pressure on the safety lever — the large, square, metal lever running from the top down the side of the grenade. Don't let up your pressure on the lever until you're ready to throw. The lever holds a small but very important part of the grenade called the striker in place — if you relax your grip on the lever after you pull the pin (this is called \"milking\" the grenade), it's possible for the striker to rotate and strike the fuse while the grenade is still in your hand. Because this can easily be deadly, it's important to get in the habit of keeping steady pressure on the lever at all times before throwing."
    },
    {
      "title": "Pull the pin with your non-throwing hand.",
      "content": "Pull the pin with your non-throwing hand. Grip the ring on the side of the lever mechanism by slipping a finger through it and remove it with a pulling, twisting motion. The safety clip holding the lever in place should fall off of the grenade. Note that, contrary to the portrayal of grenades in movies and on TV, their fuses aren't necessarily lit when you pull the pin. Rather, this happens when you release the lever and the striker is able to ignite the fuse, so keep pressure on the lever until you throw."
    },
    {
      "title": "Throw with an overhand motion.",
      "content": "Throw with an overhand motion. Hand grenades can be thrown naturally — the same way you might throw a baseball. To throw, plant your feet about shoulder-width apart, put a slight bend in your knees, cock your arm back, and hurl the grenade over your head as you take a strong step forward. Your arm should pass next to your ear and you should twist slightly at the hips. Let the grenade roll out of your fingertips as it leaves your hand. For the greatest distance and accuracy when throwing, follow through with your throwing motion. That is, after the grenade leaves your hand, let your arm continue its natural path downward and continue to twist slightly at the hips."
    },
    {
      "title": "Take cover!",
      "content": "Take cover! Use the time available before the grenade explodes to protect yourself. Crouch, kneel, or lie prone behind any available cover to protect yourself from shrapnel. Keep in mind that in the types of situations in which you're likely to use a hand grenade, you'll probably want to be wary not just of the explosion of the grenade, but also of the possibility of enemy fire, so waste no time at all taking cover. If no cover is available, flatten yourself against the ground and orient yourself toward the coming explosion. This minimizes your profile, presenting less of your body area to potentially deadly shrapnel. Once the grenade is in the air, it's (literally and figuratively) out of your hands. Without pressure from your hand to hold the safety lever in place, its spring will push it up and away from the grenade, allowing the striker to ignite the fuse. For many grenades, at this point, you'll have about four to five seconds before the grenade detonates. However, this can vary depending on the type of grenade you're using or, rarely, whether your fuse is defective."
    },
    {
      "title": "Face sideways toward your target.",
      "content": "Face sideways toward your target. Often, in combat situations, you won't have the luxury of being able to throw grenades from the standing position. For instance, if you're pinned down behind cover by enemy fire, you won't want to expose your upper body by standing up to throw. Luckily, it's also possible to throw grenades from positions that minimize your exposure to the enemy. To throw a grenade from a kneeling position, start by getting in the proper stance. Bend your knees to lower yourself near to the ground, then turn your body ninety degrees away from the direction you intend to throw so that your throwing shoulder is facing away from your target. It's hard to get the same sort of throwing power in the kneeling position that you'd get while standing, so turning to side is a smart choice because it allows you to throw across your body, maximizing your power."
    },
    {
      "title": "Drop your non-throwing leg and put your throwing leg behind you.",
      "content": "Drop your non-throwing leg and put your throwing leg behind you. Bend your non-throwing leg and press it into the ground in front of you so that your knee is pointing toward your target. At the same time, stretch your throwing leg back behind you so that the side of your boot makes contact with the ground. Keep your throwing leg straight and locked for maximum stability. Keep in mind that the kneeling stance you use to throw grenades is not the same as the typical kneeling stance you may use in ordinary noncombat situations (like when you need to pick something up off the floor). This modified stance gives added stability and support while throwing that you can't get by simply lowering one knee to the floor directly beneath you and bending the other in front of you."
    },
    {
      "title": "Extend your non-throwing hand toward the target.",
      "content": "Extend your non-throwing hand toward the target. Arm the grenade against your chest by pulling the pin and holding down the lever. As you cock your throwing arm back, stretch your other arm toward your target with your fingers extended and your thumb against the side of your hand. Keep your non-throwing arm at a slightly raised angle (about 45 o ). If you're positioning your arm correctly, you should look somewhat like you're flexing like a bodybuilder. As mentioned above, the kneeling stance doesn't have as much throwing power as the standing stance. Extending your non-throwing arm in this way allows you to gain extra leverage in your follow-through, slightly increasing your throwing force."
    },
    {
      "title": "Throw with an overhand motion and follow through.",
      "content": "Throw with an overhand motion and follow through. Launch the grenade over your head, bringing your arm past your ear and twisting at the hips as you throw. For added power, push off with your throwing leg, which should still be firmly planted against the ground behind you. Don't forget to take cover! Get as low as possible behind the sturdiest cover available. As always, if no cover is available, press yourself prone against the ground and face the direction of the blast."
    },
    {
      "title": "Lie on your back as you remove the pin.",
      "content": "Lie on your back as you remove the pin. Of all the hand grenade throwing positions, the prone stance typically offers the least power, distance, and accuracy, so, when other throwing stances are possible, they're usually preferable. However, in situations where you're pinned behind very low cover, you may not want to risk exposing yourself to enemy fire by taking the time to rise to a kneeling position when you throw. In these cases, throwing from prone may be the only way to strike the enemy without putting yourself in mortal danger. To begin, lie on your back behind your cover. You should be lying parallel to the action with your throwing arm positioned away from your target. This allows you easily grip and arm the grenade against your chest and also gives you the best possible view of the conditions around you so that you can react as necessary."
    },
    {
      "title": "Cock your throwing leg back and ready the grenade to throw.",
      "content": "Cock your throwing leg back and ready the grenade to throw. Bend your throwing leg at a 90 o angle, keeping it in contact with your other knee. Brace the side of your boot against the ground. As in the kneeling stance, this will give you added stability and power while throwing. Simultaneously, arm the grenade by pulling the pin and depressing the lever. Cock your throwing arm next to your ear and get ready to throw."
    },
    {
      "title": "Throw the grenade across your body with a rolling motion.",
      "content": "Throw the grenade across your body with a rolling motion. To throw the grenade, push off with your throwing foot and roll yourself toward your target as you launch the grenade across your body. Follow through with this motion. If needed, you can even roll all the way over. Keep your head and body low as you throw, however — the primary advantage of the prone stance is that it minimizes your exposure to enemy fire, so stay low to maintain this advantage. If you can, you may also want to use your non-throwing hand to grab any object in front of you for extra leverage."
    },
    {
      "title": "Take cover.",
      "content": "Take cover. Since you're already lying in the prone position, you won't need to \"get low\" after you release the grenade. You should, however, make sure that you're behind any available cover. As mentioned above, if there's no cover available, you'll want to orient yourself in the direction of the blast to minimize the profile area that you expose to shrapnel. It bears mentioning that, even with proper form, you'll have a very difficult time getting the same sort of throwing distance from the prone position as you might from the kneeling and (especially) the standing position. Because the grenade is likely to be closer to you when it explodes, it's even more important to protect yourself after throwing."
    },
    {
      "title": "Pick the correct grenade for your job.",
      "content": "Pick the correct grenade for your job. Hand grenades come in a huge variety of forms. Some are made for inflicting casualties on the enemy, others for merely stunning or subduing them non-lethally, and still others for inflicting damage on non-human targets. It's extremely important to be aware of the type of grenade you're throwing (and how it's used) before you throw it — if you use the wrong grenade, the results can be disastrous. Below are a few of the most common grenade types: [1] X Research source Fragmentation grenades: Produces many small pieces of shrapnel upon detonation. Usually considered lethal to non-armored targets at close ranges with rapidly decreasing effectiveness at longer ranges. Shrapnel can penetrate soft barriers like wood, plaster, and tin, but not usually cinder blocks, sandbags, and armor. Concussion grenades: Creates an explosion with extreme concussive force. This concussive effect is amplified in enclosed environments, making it useful in urban areas and bunkers, fortified enclosures, and so on. Can also be used for improvised demolition. Incendiary grenades: Produces extremely high-temperature flames. Can set fire to flammable structures, destroy equipment and weapons, and even penetrate armored vehicles in certain situations. Smoke grenades: Produces either white or colored smoke. Usually used to conceal infantry or light vehicle movement or to make positions visible to friendly forces. Stun grenades: Sometimes called \"flashbangs\", these produce a deafening bang and a bright flash, momentarily disorienting targets in the room. Riot control grenades: Usually loaded with teargas, rubber pellets, or other nonlethal deterrents, these grenades are meant to disperse and subdue crowds without causing mortal injuries."
    },
    {
      "title": "Know the lethal range of your grenade.",
      "content": "Know the lethal range of your grenade. Grenades can easily cause friendly fire casualties if they detonate too close to you or friendly forces, so it's extremely important to know what ranges are considered \"safe\" and which are not. Even if you're well outside of your grenade's lethal range, you'll want to take cover before it detonates. Though rare, it's possible for a grenade to send shrapnel, debris, or concussive blasts beyond its designated lethal range, so don't expose yourself to these dangers needlessly. For fragmentation grenades, ranges within 15-20 meters (50-65 feet) are generally considered to produce casualties. While shrapnel can potentially fly as far as 60 meters (about 200 feet), the speed of the shrapnel decreases rapidly with distance, making casualties at these ranges are rare. [2] X Research source Concussion grenades have much smaller ranges on open terrain — usually just a few meters. However, in enclosed areas, their killing power is greatly amplified. In these situations, it's best to entirely remove yourself from the bunker, enclosure, etc. before throwing the grenade in. Other grenades have much more limited damaging ranges. An incendiary grenade is usually lethal only if you come into contact with its flames, find yourself trapped in a burning building, or suffocate on its smoke in an enclosed area. Smoke grenades can cause burns at extremely close ranges but aren't usually considered lethal. Stun and riot control grenades are explicitly designed to be nonlethal, though rare accidents can result in fatalities. [3] X Research source"
    },
    {
      "title": "Take extreme care when “cooking off” your grenade.",
      "content": "Take extreme care when “cooking off” your grenade. Since grenades have a timed fuse, it's theoretically possible for an enemy target to pick up the grenade and throw it back at you. To avoid this, some soldiers use a technique called \"cooking off\" their grenade — intentionally holding it for a short time before throwing it to shorten or eliminate the amount of time that the enemy has to throw it back. To cook off a grenade, pull the pin, release the lever, count to \"one one thousand\" or \"two one thousand,\" then throw. Most combat grenades have a four or five second fuse, so don't cook off your grenade for more than one or two seconds unless you're positive its fuse is longer. Note that this technique is also sometimes used to increase a grenade's effectiveness against bunkers or other fortified emplacements — in these cases, having the grenade explode in the air above the target can be preferable to having it explode on the ground. Note also that many former Soviet Union grenades have a slightly shorter fuse than American grenades — often about three to four seconds."
    },
    {
      "title": "Avoid throwing grenades up stairs or hills.",
      "content": "Avoid throwing grenades up stairs or hills. When throwing any grenade, lethal or non-lethal, it's important to remember that the grenade can roll . Thus, if it lands on a slope, it may roll away from your target or, worse, roll back toward you. For this reason, it's generally a bad idea to through grenades onto sloped surfaces, especially up inclines that you're at the bottom of. [4] X Research source If you absolutely have to throw a grenade uphill, try cooking it off beforehand and giving it a high arc so that it explodes in the air above your target or else has little time to roll back towards you."
    },
    {
      "title": "Know the effectiveness of your cover.",
      "content": "Know the effectiveness of your cover. Taking cover before a grenade detonates can literally make the difference between life and death, especially if you're within its lethal range. Putting physical barriers between yourself and the detonating grenade is almost always a good idea (except for smoke grenades, for obvious reasons). However, not all forms of cover are equal when it comes to grenades. For your personal safety, it's important to understand the difference between \"good\" and \"bad\" cover before you throw your first grenade. The shrapnel from fragmentation grenades can penetrate wood, plaster, glass, furniture, and thin layers of metal, especially at short ranges. On the other hand, thicker, heavier materials like sandbags, cinder blocks, stone, and thick metal can usually block shrapnel — the thicker, the better. Note that the shockwave from a concussion grenade can travel long distances through enclosed spaces (even around corners). Thus, in bunkers, tight corridors, and other enclosed spaces, cover may not offer protection from concussion grenades. While incendiary grenades have a short effective range, they can burn at temperatures of over 2,200 o C (almost 4,000 o F). [5] X Research source This is hot enough to melt through steel, so distance, not cover, is essential for protecting yourself against these grenades."
    }
  ]
}