{
  "url": "https://www.wikihow.com/Treat-Pregnancy-Hemorrhoids",
  "title": "How to Help Pregnancy Hemorrhoids with Medicine & Home Treatments",
  "steps": [
    {
      "title": "Place an ice pack on the area for 15-20 minutes to reduce swelling.",
      "content": "Place an ice pack on the area for 15-20 minutes to reduce swelling. Wrap an ice pack in a hand towel or washcloth and place it directly on the swollen area for 15-20 minutes at a time. This is safe to do 3 or 4 times throughout the day, as needed. [2] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source Never put ice or an ice pack directly on your skin. The skin around your anus is particularly delicate and the ice can damage it. Follow up with a warm washcloth to calm your skin, if you like."
    },
    {
      "title": "Fill a sitz bath with warm water and sit for 15 minutes to ease the pain.",
      "content": "Fill a sitz bath with warm water and sit for 15 minutes to ease the pain. A sitz bath is a small plastic basin that you fill with warm water and attach to the seat of your toilet. Submerge your anal area in the warm water for 10-15 minutes. You can also sit in warm water in a regular bathtub, but a sitz bath may be more convenient for you. [3] X Research source The water should be warm, not hot. Check the temperature to ensure the water is between 99 and 102 °F (37 and 39 °C). [4] X Research source If your hemorrhoids itch, add 1 tbsp (15 g) of baking soda to the water. [5] X Research source You can buy a sitz bath online or at a pharmacy or medical supply store."
    },
    {
      "title": "Apply witch hazel or baking soda with a cloth to reduce swelling.",
      "content": "Apply witch hazel or baking soda with a cloth to reduce swelling. You can buy over-the-counter medicated pads to relieve your symptoms, but these home remedies work well and cost less. Soak a soft cloth in alcohol-free witch hazel and pat your anal area gently to apply it. You can apply baking soda wet or dry, so do whatever feels comfortable to you. [6] X Research source These remedies are safe to use as often as you need them."
    },
    {
      "title": "Up your fiber intake to make bowel movements easier to pass.",
      "content": "Up your fiber intake to make bowel movements easier to pass. Bowel movements can be painful during a hemorrhoid flareup. Minimize this by eating plenty of foods that are high in fiber, such as whole-grains, beans, and raw fruits and vegetables. Try to include at least one of these foods with every meal. [7] X Research source Try a fiber supplement, like Metamucil, if you're having trouble eating enough fiber-rich foods. You can buy fiber supplements online or at your local drugstore or supermarket. [8] X Research source"
    },
    {
      "title": "Keep the area clean with gentle wet wipes and squirt bottles.",
      "content": "Keep the area clean with gentle wet wipes and squirt bottles. Keeping the anal area clean after bowel movements is really important for healing. Since your anal area is inflamed, avoid scrubbing and use gentle wet wipes to clean yourself. You can also use a squirt bottle to clean the area. [9] X Research source Washing the area with mild soap and warm water after every bowel movement works, too."
    },
    {
      "title": "Wear cotton underwear and loose clothes to prevent itching.",
      "content": "Wear cotton underwear and loose clothes to prevent itching. Tight-fitting clothing can cause you to sweat, which will increase the pain and itching of hemorrhoids. Cotton is ideal because it's a breathable fabric and doesn't trap moisture like other materials. [10] X Research source"
    },
    {
      "title": "Drink plenty of fluids to prevent constipation that causes hemorrhoids.",
      "content": "Drink plenty of fluids to prevent constipation that causes hemorrhoids. Constipation, most commonly caused by dehydration, is the number 1 culprit behind hemorrhoids. Drink enough water that your urine is consistently clear or light yellow. Other fluids help keep you hydrated as well, but focus primarily on drinking water. [11] X Research source Eating plenty of foods that are high in fiber, including whole grains and raw fruits and vegetables, will also help you avoid constipation. Avoid chocolate, dairy, bananas, and red meat, which can dehydrate you and make constipation worse. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Wait rather than strain if a bowel movement won't pass easily.",
      "content": "Wait rather than strain if a bowel movement won't pass easily. Straining on the toilet can lead to the development of hemorrhoids, so try to avoid it when possible. [13] X Expert Source Wendy Powell Maternal Health & Exercise Specialist Expert Interview. 24 September 2020. If you feel like you need to go but can't without straining, wait a little while, then try again. To reduce strain, try propping your feet on a low stool when you're on the toilet. This lifts your knees above your hips, putting you in a more natural position so you don't have to strain as much. [14] X Expert Source Wendy Powell Maternal Health & Exercise Specialist Expert Interview. 24 September 2020."
    },
    {
      "title": "Avoid sitting or standing for long periods of time.",
      "content": "Avoid sitting or standing for long periods of time. Sitting or standing for long periods puts pressure on the veins around your rectal area, which can increase the chance of hemorrhoids. This is especially true if you find yourself sitting on the toilet for an extended period of time. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The toilet might very well be the only place you have to get a little quiet time to yourself, but avoid watching videos or reading while sitting on the toilet, as these activities can cause you to sit too long. While watching TV, reading, or sleeping, lie on your left side to increase blood flow to the lower half of your body. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Do Kegel exercises to strengthen your pelvic floor muscles.",
      "content": "Do Kegel exercises to strengthen your pelvic floor muscles. Strengthening the muscles around your anus makes hemorrhoids much less likely. To find your pelvic floor muscles, stop urination mid-stream. Practice until you can tighten these muscles even when you're not urinating. At that point, you can tighten your pelvic floor muscles at any time in any position, although you might find them easier to do while lying down. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Kegel exercises can also reduce the severity of bleeding and prolapse if you currently have hemorrhoids. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "See your doctor if symptoms persist for a week or more.",
      "content": "See your doctor if symptoms persist for a week or more. Hemorrhoids can be an embarrassing condition to talk about. Perhaps as a result, many people try to treat them on their own without seeking proper medical attention. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Your doctor will examine you, determine the severity of your hemorrhoids, and recommend specific treatments based on your specific circumstances. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There are many over-the-counter creams and other treatments for hemorrhoids. However, while they may help ease the associated pain and itching, they don't do anything to treat the underlying problem. Your doctor might also recommend a rectal suppository. These usually require a prescription and help relieve the symptoms of hemorrhoids. [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Ask about fiber supplements or stool softeners if you're constipated.",
      "content": "Ask about fiber supplements or stool softeners if you're constipated. Constipation is relatively common during pregnancy and the straining that naturally follows can lead to hemorrhoids. If you're already constipated, your doctor can recommend specific fiber supplements or stool softeners that will make your bowel movements easier to pass. [22] X Research source Fiber supplements are typically available over-the-counter at pharmacies, grocery, and discount stores (or online). Stool softeners, on the other hand, might require a prescription. Don't take laxatives unless your doctor specifically tells you to. They can be dangerous if you're pregnant. [23] X Research source"
    },
    {
      "title": "Discuss surgical options if your symptoms remain after delivery.",
      "content": "Discuss surgical options if your symptoms remain after delivery. Hemorrhoids are most common in the third trimester and even if they continue to plague you for a few weeks, they usually go away on their own after the birth of your baby. However, if you continue to have symptoms after delivery, your doctor might want to have your hemorrhoids surgically removed. [24] X Research source Doctors typically don't consider other more aggressive treatments, including sclerotherapy and cryotherapy, which are less invasive than surgery, unless you've had severe symptoms for over a month. [25] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Your doctor won't normally consider surgery until after delivery. [26] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Until then, do everything you can to help relieve your pain and discomfort."
    }
  ]
}