{
  "url": "https://www.wikihow.com/Use-Home-Remedies-to-Get-Rid-of-Gnats",
  "title": "How to Drive Away Gnats for Good: Easy DIY Methods",
  "steps": [
    {
      "title": "Mix apple cider vinegar, water, sugar, and dish soap to trap gnats.",
      "content": "Mix apple cider vinegar, water, sugar, and dish soap to trap gnats. Use 2 tablespoons (30 mL) of apple cider vinegar, 1 tablespoon (12 grams) of sugar, 1 ⁄ 2 teaspoon (2.5 mL) of dish soap, and 1 ⁄ 2 cup (120 mL) of warm water. Combine everything in a small bowl and place it in the infected room. Leave it overnight and clean it out in the morning. Repeat this process as many times as you need. [1] X Research source The scent of the sugar and apple cider vinegar will attract the gnats to the bowl. When they get close to the bowl, the soap suds will trap them and pull them down into the water."
    },
    {
      "title": "Cover a bowl of mashed banana with plastic wrap to attract gnats.",
      "content": "Cover a bowl of mashed banana with plastic wrap to attract gnats. Gnats love rotten fruit, so you can use this to your advantage to trap them. Simply mash up a banana, place it in a bowl, cover the bowl with plastic wrap, and poke little holes in the plastic with the tines of a fork. The gnats will enter through the holes to get to the banana but won’t be able to get back out again. Because this method doesn’t necessarily kill the gnats, make sure to dispose of the banana and the plastic wrap in the outdoor trash. You may even want to use a disposable bowl so you can just throw the entire trap away."
    },
    {
      "title": "Dilute bleach",
      "content": "Dilute bleach and pour it down the drains if gnats congregate near them. Use 1 ⁄ 2 cup (120 mL) of bleach to 1 gallon (3.8 L) of water and slowly pour it down the drain. The diluted bleach should kill any gnats that are living in the drain. Repeat this process daily until you no longer notice any gnats. [2] X Research source"
    },
    {
      "title": "Spray gnats with a mixture of water, isopropryl alcohol, and dish soap.",
      "content": "Spray gnats with a mixture of water, isopropryl alcohol, and dish soap. Mix 1 ⁄ 5 cup (47 mL) of water, 1 ⁄ 5 cup (47 mL) of isopropryl alcohol, and 1 teaspoon (4.9 mL) of dish soap in a clean spray bottle. Whenever you see gnats flying around, spray them with the mixture: they'll drop to the floor and die. [3] X Research source This is a great non-toxic way to deal with gnats. It’s unlikely to harm any of your belongings, and it won’t hurt your plants, pets, or kids. Need ideas for getting rid of fungus gnats? Get tips from wikiHow users at our Need advice on getting rid of fungus gnats forum ."
    },
    {
      "title": "Exterminate pests with a candle and a bowl of water.",
      "content": "Exterminate pests with a candle and a bowl of water. Place a candle in a bowl or on a tray that is partially filled with water. Light the candle, close the curtains, and turn off all the lights. The gnats will be attracted to either the candle or the candle’s reflection in the water. The candle itself will burn their wings, while the water will trap them. [4] X Research source"
    },
    {
      "title": "Throw out fruit that has started to rot or keep fresh produce in the fridge.",
      "content": "Throw out fruit that has started to rot or keep fresh produce in the fridge. Gnats love fruits that have started to get a little ripe—the sweet smell attracts them by the dozens. When you can, store fruits in the fridge. If you notice that fruit on the counter is starting to rot or attract bugs, throw it out or compost it. [5] X Expert Source Kevin Carrillo Pest Control Specialist, MMPC Expert Interview. 22 October 2019. Similarly, if you collect food scraps for composting, don’t leave the bucket or bowl exposed in the kitchen. Use a covered container, or take scraps directly outside to the compost heap."
    },
    {
      "title": "Keep your sink clean and clear of dirty dishes.",
      "content": "Keep your sink clean and clear of dirty dishes. Gnats love moist areas, especially if any food bits are laying around. Make it a goal to wash your dishes or load them into the dishwasher right after you eat. At the least, make sure to clean the dishes and your sink at the end of each day to prevent dirty dishes from attracting gnats. [6] X Expert Source Kevin Carrillo Pest Control Specialist, MMPC Expert Interview. 22 October 2019. Don’t leave prepared food sitting out on the counter for longer than 30 minutes. Store food in reusable containers and put them into the fridge as soon as possible. If you have a garbage disposal, make sure to run it after rinsing off your dishes so that food scraps don’t accumulate in there."
    },
    {
      "title": "Empty the trash bins",
      "content": "Empty the trash bins in your home daily if there are food scraps in them. The longer old food sits in the trash, the more likely it is to attract gnats. You may not need to do this in rooms where food isn’t getting thrown away, but in your kitchen, it can definitely help keep away gnats to take the trash out at the end of each day. [7] X Expert Source Kevin Carrillo Pest Control Specialist, MMPC Expert Interview. 22 October 2019. Similarly, if you have open trash cans outside, make sure they aren’t located next to any windows. The gnats could be attracted to the trash and then find their way indoors through the window."
    },
    {
      "title": "Move potted plants with damp soil outdoors if they’re attracting gnats.",
      "content": "Move potted plants with damp soil outdoors if they’re attracting gnats. If you notice gnats congregating around your favorite houseplant, that might mean its soil is too damp and needs to dry out a little bit. Set it outside or in a garage or shed for a few days until the soil starts to dry out. If this doesn’t work, you may want to repot your plants in fresh soil. [8] X Expert Source Kevin Carrillo Pest Control Specialist, MMPC Expert Interview. 22 October 2019. On the flip side, there are a few plants that repel gnats. These can be potted and kept indoors, or you can plant them outside if you struggle with gnat infestations outdoors. Try growing geraniums , lemon thyme, lavender, and marigolds ; these are the best natural repellants. [9] X Research source"
    },
    {
      "title": "Keep a scented dryer sheet in your pocket to repel gnats while you’re outdoors.",
      "content": "Keep a scented dryer sheet in your pocket to repel gnats while you’re outdoors. Dryer sheets are often scented to smell like lemon balm, geranium, lavender, and other fragrances that repel gnats. Simply put a scented dryer sheet in your pocket or wrap it around a belt loop to naturally keep gnats away. [10] X Research source In addition to keeping away gnats, the dryer sheet may also help repel mosquitos . If your outfit doesn’t have a pocket or belt loops, you could pin it to your clothes. It might look a little silly, but it should help!"
    },
    {
      "title": "Dab on a few drops of vanilla extract before you head outside.",
      "content": "Dab on a few drops of vanilla extract before you head outside. It turns out that gnats hate the smell of vanilla! Mix together 1 ⁄ 2 teaspoon (2.5 mL) of vanilla extract and 1 ⁄ 2 teaspoon (2.5 mL) of water. Put the mixture onto a cotton ball and rub it on your neck, wrists, collarbone, and ankles. [11] X Research source If you’re going to be outdoors for a long time, bring a small container filled with extra extract to reapply throughout the day. If you have vanilla absolutes or fragrance oils, these may also work—just make sure they contain real vanilla!"
    },
    {
      "title": "Apply peppermint cream for a minty, natural gnat repellent.",
      "content": "Apply peppermint cream for a minty, natural gnat repellent. Peppermint is another one of those scents gnats just don’t like, and you can make your own cream using essential oils and shea butter . In a small, clean container, mix together 1 ⁄ 2 cup (120 mL) of shea butter and 4-6 drops of peppermint essential oil . Rub the cream onto your hands, neck, legs, arms, and any other areas of exposed skin. [12] X Research source If you don’t have shea butter, use another moisturizer that doesn’t have added scents."
    },
    {
      "title": "Wear sunglasses and a bandana when walking through infested areas.",
      "content": "Wear sunglasses and a bandana when walking through infested areas. Sometimes, no matter how hard you try to avoid it, you might end up walking through a heavily infested gnat area. To keep them away from your eyes, mouth, and nose, wear a pair of sunglasses and wrap a bandana around your face. Once you’re away from the area, you can remove these items. Gnats won’t harm you—they don’t bite or transmit diseases—but they are annoying and can ruin a nice day. Do your best to be prepared when you go outdoors, especially if you’ll be near still water sources. Find more ideas for getting rid of gnats from fellow wikiHow users. See what they're saying at the wikiHow forum post, \"How do you get rid of gnats in your house?\""
    }
  ]
}