{
  "url": "https://www.wikihow.com/Stretch-Your-Calves",
  "title": "How to Stretch Your Calves",
  "steps": [
    {
      "title": "Warm up first.",
      "content": "Warm up first. It is important to warm up your muscles before you begin stretching. This will get the blood flowing to your calf muscles and the Achilles tendon, which can be difficult to stretch. You can warm up by marching in place, doing some calf raises, or doing jumping jacks for about 5 to 10 minutes."
    },
    {
      "title": "Stand facing a wall.",
      "content": "Stand facing a wall. Your arms should be outstretched, touching the wall. Hold them at about shoulder height. At the same time, your head should be up and your back straight. If you don’t have a wall to stand at, just bring one leg forward, bend at the knee, and continue."
    },
    {
      "title": "Take a big step backwards.",
      "content": "Take a big step backwards. Work one leg at a time. Step backwards far enough that you can feel your calf tighten a little in your back leg. At the same time, you should be able to keep your heel flat on the floor."
    },
    {
      "title": "Bend your other knee.",
      "content": "Bend your other knee. Flex your front knee at about a ninety degree angle. Continue to keep your back straight and the heel of your outstretched back leg flat on the floor. You should feel the stretch in your back leg when you are in this position."
    },
    {
      "title": "Hold the position.",
      "content": "Hold the position. You should now be able to feel your calf stretching. Remain in the stretched position for thirty seconds. Don’t forget to breathe naturally while you hold the position! Return to the starting position, and repeat with the other leg."
    },
    {
      "title": "Intensify the stretch, if you want.",
      "content": "Intensify the stretch, if you want. If you feel like the basic form of the standing calf stretch isn’t pushing you enough, try stepping a little further back. Just make sure that you are able to keep your heel flat on the floor, and that you aren’t stretching to the point of pain."
    },
    {
      "title": "Sit on the ground with your legs outstretched.",
      "content": "Sit on the ground with your legs outstretched. Get into a comfortable position on the ground. Extend the leg you want to stretch out in front of you. Bend the knee slightly upward. [1] X Research source Keep your other leg out in front, or pulled up closer to you—whatever’s most comfortable."
    },
    {
      "title": "Pull on the ball of your foot.",
      "content": "Pull on the ball of your foot. Reach forward with both of your hands and lightly grasp your foot just below your toes. Gently pull back on your foot so that you have to flex it as much as you can toward your body. [2] X Research source Your toes should point back toward your body, but don't pull so much that it hurts. You can also use an exercise band or towel wrapped around the ball of your foot instead of your hands."
    },
    {
      "title": "Hold the position.",
      "content": "Hold the position. You should feel your calf stretching, but it should not be painful. Hold the position for twenty seconds, making sure to breathe while you do the stretch. [3] X Research source Return to the original position when you’re done, and repeat with the other leg. Repeat two or three times for each leg."
    },
    {
      "title": "Try an isometric variation.",
      "content": "Try an isometric variation. Isometric exercises are based on resisting forces. To do an isometric calf stretch, start in the same position as a normal seated calf stretch. When you pull back on the ball of your foot, use your calf muscles to try and straighten your leg, but don’t actually move it. The force of your hands should be enough to keep your leg from straightening. Don’t push or pull so hard that it hurts."
    },
    {
      "title": "Do a simple calf stretch for arthritis.",
      "content": "Do a simple calf stretch for arthritis. If arthritis is causing pain in your legs, you can try an alternative calf stretch for some relief. Stand up straight while holding onto a chair. Place your left foot back while still keeping your heel on the floor. Bend your right knee, and lean toward the chair. [4] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source You should feel a slight stretch. Hold the position for a few seconds, then repeat on the other side."
    },
    {
      "title": "Get rid of a calf cramp by stretching.",
      "content": "Get rid of a calf cramp by stretching. Painful cramps in your legs can sometimes be eliminated by stretching. Stand with the cramped leg behind you and step forward with the other foot. Then, bend your front knee slightly while keeping the back leg straight with your foot flat on the floor. Hold the stretch for a few seconds, then release. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Repeat on the opposite side if needed."
    },
    {
      "title": "Incorporate calf stretches into your yoga routine.",
      "content": "Incorporate calf stretches into your yoga routine. If you practice yoga, it’s easy to stretch your calves. Many standard poses, like downward dog and pyramid pose, already work your calves. If you want to improve flexibility or strength in your calves, just try some of these poses."
    },
    {
      "title": "Ask a professional about doing calf stretches and exercises after injury.",
      "content": "Ask a professional about doing calf stretches and exercises after injury. If you are going through rehab for an injury affecting your calves, standing or seated stretches and exercises can often be very helpful. However, you should ask a physical therapist or trainer for advice on the best (and safest) stretches and exercises to use in your case, just to be sure. They may recommend that you try a heel raise, which is an exercise for your calf muscles. It is not a stretch. To do a heel raise: Hold onto the back of a chair. Raise yourself up on your toes. Hold the position for five seconds. Lower your feet back down (without holding onto the chair, if you can)."
    }
  ]
}