{
  "url": "https://www.wikihow.com/Wear-an-Eyepatch",
  "title": "How to Wear an Eyepatch",
  "steps": [
    {
      "title": "Determine whether your skin is prone to skin irritation or rashes.",
      "content": "Determine whether your skin is prone to skin irritation or rashes. Eye patches are often worn directly against the skin for extended periods of time. If your skin easily gets red, bumpy, inflamed, or itchy because of small changes in the weather or environment, it may be more sensitive to wearing an eye patch. This could affect your comfort. [1] X Trustworthy Source American College of Allergy, Asthma, and Immunology National professional organization of allergists, asthma specialists and immunologists that focuses on supporting and publishing research Go to source"
    },
    {
      "title": "Decide between an adhesive, elastic, or cloth eye patch.",
      "content": "Decide between an adhesive, elastic, or cloth eye patch. Adhesive patches are more likely to cause irritation, though hypoallergenic ones are available. [2] X Trustworthy Source American College of Allergy, Asthma, and Immunology National professional organization of allergists, asthma specialists and immunologists that focuses on supporting and publishing research Go to source Patches with elastic bands are easy to remove, but may rub because they can move around freely. [3] X Research source Cloth eye patches work with glasses, but the glasses should fit tightly and the cloth have no holes. [4] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source"
    },
    {
      "title": "Mitigate irritation by reducing direct skin contact.",
      "content": "Mitigate irritation by reducing direct skin contact. Skin lubricants like lotion, ointment, and Milk of Magnesia can reduce the irritation of using adhesive eye patches by placing an extra layer of protection between your skin and the patch before you apply the patch. [5] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source If you don't want to use a skin lubricant, use medical tape to secure gauze around where the patch would rest before attaching the patch to the gauze . [6] X Research source Try trimming away some adhesive from the patch before placing it on your eye, but leave enough adhesive so the patch remains in place. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Clean the eye area with mild soap and water.",
      "content": "Clean the eye area with mild soap and water. Do not use any other products, as your eyes can become easily irritated. Make sure to thoroughly dry the eye area near where the patch will be applied."
    },
    {
      "title": "Place the patch on your skin, if using an adhesive patch.",
      "content": "Place the patch on your skin, if using an adhesive patch. Make sure both eyes are closed and relaxed before you gently press the adhesive edges onto your skin. Don’t squint. Keeping your eyes relaxed will prevent the skin being pulled once you open your eyes. If you’d like to, trim the adhesive beforehand to make sure it doesn’t stick to your eyebrows. If you’re using a skin lubricant, place it on your skin before using the patch."
    },
    {
      "title": "Position the patch on your glasses, if using a cloth patch.",
      "content": "Position the patch on your glasses, if using a cloth patch. Some types of cloth patches can be directly slid onto the legs and lens of your glasses. You can also create a makeshift cloth eye patch by cutting out an oval swatch of opaque fabric, then taping it onto the lens of your glasses with paper tape. [8] X Research source"
    },
    {
      "title": "Slide the elastic band over your head, if using an elastic eye patch.",
      "content": "Slide the elastic band over your head, if using an elastic eye patch. These are not recommended for children who are wearing eye patches for medical reasons, as they are easy to peek around. [9] X Research source Move the eye patch into position over your eye, then adjust the band so it rests comfortably around your head."
    },
    {
      "title": "Explain why the patch is necessary to the child.",
      "content": "Explain why the patch is necessary to the child. They may not understand why they have to wear something regularly on their face and find it scary. They also might think the eye patch is uncomfortable or feel self-conscious about wearing it around others at school or daycare. [10] X Research source Avoid referring to the eye patch as something to “help their lazy eye,” as that phrase may make them feel they are somehow at fault for their struggling vision."
    },
    {
      "title": "Talk to caregivers, family, and friends about the patch.",
      "content": "Talk to caregivers, family, and friends about the patch. Ask they be supportive, and emphasize how important it is that the child wear the patch consistently. It may be helpful to have it explained to the child’s classmates why the child is wearing the patch too. [11] X Research source"
    },
    {
      "title": "Consider establishing clear rules for wearing the patch.",
      "content": "Consider establishing clear rules for wearing the patch. Explain what consequences you will enforce if the child removes the patch, as well as any rewards you will give for keeping the patch on without being difficult or complaining. [12] X Research source If the child is supposed to wear the patch only part of the time, let them use a clock or timer to mark when the patch should be put on or taken off. Let the child track their progress of when and how long they’ve been wearing the eye patch on a calendar. This will give them a sense of accomplishment. [13] X Research source"
    },
    {
      "title": "Spend time with the child when they wear the patch.",
      "content": "Spend time with the child when they wear the patch. By playing games, you can distract them from the discomfort of wearing the patch and have them associate wearing the patch with having fun with you. Certain activities can also help make the child’s weakened eye work harder. [14] X Research source It takes 10-15 minutes for the brain to adjust to having the dominant eye covered, so being present for that transition may prove particularly comforting to your child. [15] X Research source"
    }
  ]
}