{
  "url": "https://www.wikihow.com/Write-a-Personal-Financial-Plan",
  "title": "Creating a Personal Financial Plan: Step-by-Step Guide",
  "steps": [
    {
      "title": "Develop a list of your current assets and liabilities.",
      "content": "Develop a list of your current assets and liabilities. Assets are things you own that have value, while liabilities are the values of the things you owe. Assets may include cash or cash equivalents, such as checking and savings accounts; personal property, including equity in a home and/or a car; and invested assets, including stocks, bonds, and pensions. Liabilities might include current bills and debts such as car loans, home loans, medical debt, credit card debt, or student loans. See How to Get Out of Debt ."
    },
    {
      "title": "Calculate your current net worth.",
      "content": "Calculate your current net worth. Total your assets, then subtract your total liabilities from this figure. The resulting number is your current net worth. Your current net worth represents the starting point for your personal financial plan. A positive net worth means that you have more assets than liabilities, a negative net worth means the opposite."
    },
    {
      "title": "Organize your financial records.",
      "content": "Organize your financial records. Create a filing system of your tax returns, bank account statements, insurance policy information, contracts, receipts, wills, deeds, titles, bills, investment plan statements, retirement account statements, pay stubs, employee benefits statements, mortgages, and any other type of document that is related to your financial life."
    },
    {
      "title": "Track your income and expenditures, or cash flows.",
      "content": "Track your income and expenditures, or cash flows. Doing so will enable you to more carefully study how you currently spend your money — the habits that have led to your current net worth. [1] X Research source"
    },
    {
      "title": "Set short-, intermediate-, and long-term goals.",
      "content": "Set short-, intermediate-, and long-term goals. Personal financial planning revolves around goals. Consider what you want your lifestyle to be like in the present, near future, and distant future, then create an outline of your goals that is comprehensive enough to cover every facet of your life: You may find that your short-, intermediate-, and long-term goals build upon each other — saving $100 a month, for example, toward a house fund may lead toward your long-term goal of purchasing a home."
    },
    {
      "title": "Use a \"SMART\" goal-setting process.",
      "content": "Use a \"SMART\" goal -setting process. Make sure your goals are Specific , Measurable , Attainable , Rewarding , and Time-based . Doing so will ensure your goals can move past the \"dream\" stage into actual implementation. Specific goals can be clearly articulated. A vague goal like \"be financially independent\" makes it impossible to succeed or fail. Have a concise and precise goal that you can turn into a short statement. Measurable goals have some quantitative dimension to them, such as \"Get my credit score to 750\" or \"Have $12,000 in emergency savings\". Without assigning a value to a goal, it's also difficult to know if you're making progress. Attainable goals are reality-based. Don't make a goal that you cannot realistically attain: this will only discourage you from having a plan at all. Rewarding (also known as Relevant ) goals feel good once you achieve them. There should be a positive feedback loop where you finish a goal and then want to finish more. Time-based goals are not open-ended but have deadlines and milestones that you can fail or succeed at. Remember that plans are not set in stone and they can change as you have new information: if you fail at a certain milestone on the way to a goal, adjust that expectation and give it a new deadline."
    },
    {
      "title": "Think about your financial values.",
      "content": "Think about your financial values. How do you feel about money, and why? Why is money important to you? Answering these questions will help you formulate your financial goals. You may find, for example, that money is important to you because you want to have time and resources to pursue your dream of international travel. Knowing this about yourself will help you develop and prioritize your goals. [2] X Research source"
    },
    {
      "title": "Bring your family into the conversation.",
      "content": "Bring your family into the conversation. If you have a partner or a family, make your \"personal\" financial plan a \"family\" plan. Doing so will ensure that you share your values and goals with each other and make financial decisions with these shared ideas in mind. [3] X Research source You may find that your priorities differ. Engage in careful discussion to reach an agreement on compromises that will help you both feel comfortable with your financial future. Recognize that some people are more financially minded than others. Determine who will be in charge of a household budget, or consider ways to provide for each partner's need to feel some degree of control."
    },
    {
      "title": "Consider all your goals, even if some seem less \"financial\" than others.",
      "content": "Consider all your goals, even if some seem less \"financial\" than others. A goal of backpacking through Europe, for example, might not initially seem financial, but you'll need to acquire resources to make such a trip possible. Intellectual goals might include furthering your education, participating in leadership retreats, sending your children to college, and attending seminars. Think carefully about how you plan to produce income, whether this involves continuing or advancing in your current line of work or switching careers altogether. Lifestyle goals encompass the things you do for fun and entertainment, as well as the things you feel, are necessary to the quality of life for which you aim. Residence goals might include renting, purchasing a home, or relocation. Consider the lifestyle you want when you retire and set personal financial planning goals that will provide for a retirement that meets your standards."
    },
    {
      "title": "Study the options available to you to meet your financial goals.",
      "content": "Study the options available to you to meet your financial goals. Generally, your options will resolve into two categories: utilizing existing resources in new ways, or generating new income. For each goal, consider whether you should: Continue the same course of action. Expand your current situation. Change your current situation. Take a new course of action."
    },
    {
      "title": "Remember that the same goal may be met in a multitude of ways.",
      "content": "Remember that the same goal may be met in a multitude of ways. To save money for that backpacking trip to Europe, for example, you might replace your coffee shop stops with home-brewed coffee and save $20 per week. Alternatively, you might provide child care for a friend one afternoon a week and apply your earnings toward the trip."
    },
    {
      "title": "Determine whether one goal will impact another.",
      "content": "Determine whether one goal will impact another. In addition to identifying alternative courses of action within your financial goals, you should consider how your goals interact. You might consider traveling a \"lifestyle\" goal, for example, but after careful consideration realize that pursuing the educational goal of studying a foreign language will enable you to travel more cheaply — or even pursue a career as a translator or businessperson working in a foreign country."
    },
    {
      "title": "Select which strategies you'll employ to complete your financial plan.",
      "content": "Select which strategies you'll employ to complete your financial plan. Take your life situation, personal values, and current economic conditions into account. Consider how you feel about where you're currently positioned financially versus where your goals would take you in each of the categories you've considered. Do you see particular deficiencies in one area? Perhaps you should give this area special consideration. Remain practical. Step-by-step plans will move you toward your goals without leaving you feeling frustrated or defeated by the scope of your agenda."
    },
    {
      "title": "Remember that all choices involve opportunity costs.",
      "content": "Remember that all choices involve opportunity costs. An opportunity cost is what you give up when you make a choice. Saving for that backpacking trip by giving up coffee shop visits might include sacrifices of time, planning, and the conversation you enjoy with your favorite barista."
    },
    {
      "title": "Research potential decisions like a scientist.",
      "content": "Research potential decisions like a scientist. Gather as much research as you can, and carefully evaluate your data. If you are considering an investment, for example, you should pay special attention to the correlation between risk and reward — how risky is the investment, and how much reward will you receive if it is successful? Are the benefits worth the risks? [4] X Research source"
    },
    {
      "title": "Recognize that uncertainty will always be part of the picture.",
      "content": "Recognize that uncertainty will always be part of the picture. Even once you've carefully completed your research, the parameters of your situation may change. The economy may dip, lowering investment concerns. The new job you opt to pursue may leave you personally or professionally unsatisfied. Do your best and remember that you retain the ability to adjust your decisions later."
    },
    {
      "title": "Look at the big picture.",
      "content": "Look at the big picture. Now that you've developed goals, identified and evaluated alternatives, as well as created a list of the strategies you've identified, consider your current situation and then start thinking about which goals might be most realistic. Take your current net worth into account. If your liabilities approach or outweigh your current net assets, you'll want to take steps to change that ratio. While you may opt to focus on developing your net assets, don't forget that paying off debt can be a great investment. Interest charges mean that even paltry debts can become overwhelming over time. Allocating some resources toward debt reduction now may prevent serious problems from developing later. [5] X Research source"
    },
    {
      "title": "Decide which goals you'll pursue now.",
      "content": "Decide which goals you'll pursue now. Strive for a balanced approach toward short-, intermediate-, and long-term goals that will enable you to plan for a few months and a few years down the line. Focus upon incremental growth. By doing so you will create a road map that will take you toward your goals. Be realistic. You won't be able to adopt all the great strategies you've evaluated at once, but selecting a balanced range of goals will help you meet the goals you do choose and grow toward a point when you can take on additional projects."
    },
    {
      "title": "Develop a budget that incorporates your financial planning goals.",
      "content": "Develop a budget that incorporates your financial planning goals. You already know your net assets and liabilities from your analysis of your current net worth; set these into a framework that includes the decisions you've made. Then hold yourself accountable for these decisions. If you've committed to spending $80 less per month on coffee and placing that money in a savings account, a list that is in your budget. Goals such as obtaining a new job may not fit neatly into a budget but should be listed in an easy-to-reference location as part of your working financial plan."
    },
    {
      "title": "Consider hiring a professional financial adviser.",
      "content": "Consider hiring a professional financial adviser. You may be fully capable of making financial decisions, but a professional adviser has the advantage of emotional detachment from your financial situation. [6] X Research source"
    },
    {
      "title": "Think of your financial plan as a working document.",
      "content": "Think of your financial plan as a working document. Personal financial planning is a process. Life changes, and you'll need to update your plan over time as your circumstances and goals change."
    },
    {
      "title": "Plan to review your financial goals regularly.",
      "content": "Plan to review your financial goals regularly. If you find your life circumstances change quickly (as a college student, for example), you may opt to review these goals every 6 months. If your life tends to be more stable (as an adult empty-nester, for example), you might plan on an annual review."
    },
    {
      "title": "Discuss your financial plan with your partner.",
      "content": "Discuss your financial plan with your partner. If you're already in a committed relationship, hopefully, you've pursued this process as a couple. When making a relationship commitment, financial discussions should be part of the conversation about your values, goals, and plans for reaching those goals."
    }
  ]
}