{
  "url": "https://www.wikihow.com/Wash-Doll-Hair",
  "title": "How to Wash Doll Hair",
  "steps": [
    {
      "title": "Remove all the doll's clothing.",
      "content": "Remove all the doll's clothing. Before you begin washing your doll's hair, make sure you remove all of the doll's clothing. You do not want to accidentally damage a doll's clothes during the washing process. You should also remove any hair clips or accessories in a doll's hair. These can sometimes be easy to overlook, so comb through a doll's hair first to remove any hair ties."
    },
    {
      "title": "Choose a product to use in the doll's hair.",
      "content": "Choose a product to use in the doll's hair. Once you've prepared the doll, find the right product to use in its hair. The type of product you use depends on the type of doll. For a Barbie doll, use a mild conditioner and gentle soap. For shampoo, it's best to use baby shampoo. If you have a doll with similar hair to a Barbie doll, consider using these products in that situation as well. [1] X Research source If your doll is older and its hair is damaged, consider using a gentle fabric softener. This will help clean out the doll's hair and can also help restore its glow and softness. It can also remove odors that have built up in a doll's hair over time. In general, using mild products work best. Doll's hair is far more delicate than human hair, so a gentler shampoo or conditioner is ideal."
    },
    {
      "title": "Prepare the water.",
      "content": "Prepare the water. Once you've chosen your product, prepare the water. Most people recommend water that is either cold or lukewarm. Hot water can be damaging to a doll's hair. Stir in a small amount of the product you are using. Mix the product into the water."
    },
    {
      "title": "Wash the doll's hair.",
      "content": "Wash the doll's hair. Dip your doll in the water. Gently lather the shampoo into the doll's hair. As you go, try to work out any knots or tangles you notice along the way. If your doll's hair is particularly dirty, consider letting the doll sit in the water for 10 minutes. If you're using fabric softener to restore old doll hair, the process is slightly different. You should fill a small bowl or basin with as much softener as you need to coat the doll's hair. Place the doll's hair in the bowl and cover the hair until its soaked in softener. Then, let the doll sit for 20 minutes."
    },
    {
      "title": "Rinse the hair completely.",
      "content": "Rinse the hair completely. Once you're done soaking and lathering the doll's hair, rinse it completely. Once again, use lukewarm or cold water. Make sure you get all the product out. Letting shampoo or conditioner dry into hair can cause damage. If you used a product like fabric softener, it may take slightly longer to wash out."
    },
    {
      "title": "Pat the hair dry.",
      "content": "Pat the hair dry. Once you're done rinsing the hair, pat the doll's hair dry. Use a clean, dry towel and soak up large blots of water using a gentle patting motion. [2] X Research source If the doll's hair does not come completely dry with patting, you might have to set the doll aside and let it air dry."
    },
    {
      "title": "Brush the hair, removing all tangles.",
      "content": "Brush the hair, removing all tangles. After you've done some initial drying, brush the doll's hair out. If your doll has a lot of thick hair, it might be best to try and brush the hair out while it's still wet. Tangles might be easier to remove if they haven't dried into hair. If you want to leave your doll's hair with a shine, spray on some leave in conditioner. [3] X Research source"
    },
    {
      "title": "Watch out for synthetic hair.",
      "content": "Watch out for synthetic hair. Older dolls, like dolls made in the '70s, usually have synthetic hair. It is very difficult to clean or style this type of hair and it does not respond well to washing or restoration attempts. You may be better off buying a new doll than trying to clean or restore dolls with synthetic hair. [4] X Research source"
    },
    {
      "title": "Read manufacturer's instructions before attempting to wash doll hair.",
      "content": "Read manufacturer's instructions before attempting to wash doll hair. Not all doll's hair should be washed. The American Girl corporation, for example, advises against washing your doll's hair. They provide a number you can call for advice in the event your doll's hair gets damaged. [5] X Research source If you still have manufacturer's instructions for your doll, read them before attempting to wash your doll's hair on your own."
    },
    {
      "title": "Do not wash mechanical doll's hair.",
      "content": "Do not wash mechanical doll's hair. If you have a mechanical doll that's still functioning, do not wash its hair. Even if you're careful about keeping your doll's body dry, even a small amount of water could cause damage. You can wash and clean dolls according to their material. Put plastic dolls in a tub or wash them with soap. Wash cloth dolls with normal soap and dry them."
    }
  ]
}