{
  "url": "https://www.wikihow.com/Why-Does-My-Steering-Wheel-Shake",
  "title": "How to Diagnose Steering Wheel Shake",
  "steps": [
    {
      "title": "Imbalanced tires",
      "content": "Imbalanced tires Tires are supposed to spin at the same speed together, but if they aren’t equally inflated or similarly worn down, it can cause one or more of the tires to struggle to keep up. This will create a vibration that works its way from the tires to the axles to your steering wheel. [1] X Research source This kind of shaking will be present at all times, but it’ll be more extreme the faster you accelerate. The Fix: Check your tires to see if they’re all equally inflated. If they aren’t, fill the tires that are low. Then, check the treads on your tire. If any of the tires are worn out, replace them."
    },
    {
      "title": "Bad alignment",
      "content": "Bad alignment If your tires aren’t lined up, it’ll cause friction when you drive. This is typically the result of an axle that rolled over a bump in a funny way, or a natural drift from a slight misalignment over time. [2] X Research source Like imbalanced tires, you’ll probably notice this shaking getting worse when you accelerate. What happens when you let go of the wheel on a flat, empty highway? If your car immediately pulls to one side, your alignment is off. The Fix: See a mechanic and ask them to check your alignment. If it’s off, they’ll throw the vehicle on an alignment rack and fix it. This a pretty cheap and quick repair!"
    },
    {
      "title": "Bent axle",
      "content": "Bent axle If the shaky steering wheel started acting up after you hit a bump, ran over a pothole, or had a minor accident, you’ve probably bent one of your axles. With a bent axle, your tires will fight against one another when you drive, which will cause some shakiness in your wheel. [3] X Research source The Fix: See a mechanic to get the axle repaired or replaced. This can be one of the more expensive repairs for a vehicle, so get multiple quotes if you don’t like the first one."
    },
    {
      "title": "Worn-out bearings",
      "content": "Worn-out bearings If you also hear some kind of humming, rattling, or growling when you turn the wheel and it also shakes, the bearings in one or more of your wheels are bad. This happens naturally every 85,000–100,000 miles (137,000–161,000 km), although bearings can fail more frequently if you drive in any area with poor road conditions or frequent precipitation. The Fix: Visit your mechanic and ask them to install some fresh bearings inside your wheels. It’s usually ideal to swap all of them out at the same time, since if one bearing failed it’s likely the others are close to the end of their life."
    },
    {
      "title": "Brake rotor problems",
      "content": "Brake rotor problems Did you just get your brakes adjusted? If so, it’s likely that one of the brake rotors was installed incorrectly and it’s rubbing against the wheel and causing it to wobble. [4] X Research source It’s also likely that your brakes are to blame if the shaking gets worse when you slow down. The brakes themselves could be to blame if you also smell something burning. The Fix: Go back to whoever fixed your brakes and ask them to repair their work. If you didn’t get any brake work done, just visit your normal mechanic and ask them to look at your brakes."
    },
    {
      "title": "Worn suspension belt",
      "content": "Worn suspension belt If your serpentine belt is worn down or it’s misaligned, the gears in your engine bay may spin unevenly. This will cause your steering wheel to shake. Your steering wheel may also feel kind of stiff or hard to turn. [5] X Research source You’ll probably hear a scratching or whining noise coming from your engine bay if the suspension belt isn’t aligned properly, as well. The Fix: Either replace the belt yourself with a belt designed for your make and model, or take the vehicle to the mechanic and ask them to do it for you."
    },
    {
      "title": "Your engine is likely to blame, so see a mechanic ASAP.",
      "content": "Your engine is likely to blame, so see a mechanic ASAP. Shaking when you hit the gas is a sign that there’s something fundamentally wrong with the combustion process in your engine. In rare cases, your transmission could be to blame. Diagnosing and fixing acceleration issues in a shaky vehicle can be tricky, so see a mechanic to get this one fixed. [6] X Research source There are a handful of DIY repairs you might be able to make to fix this one if you know your way around a workshop, but the odds are the issue is inside of your engine, which isn’t usually a home repair."
    },
    {
      "title": "Check your gas cap and battery terminals.",
      "content": "Check your gas cap and battery terminals. It’s easy to fix two common causes for a shaky engine idle . It could be air getting into your fuel mixture, so check your gas cap to make sure it’s closed all the way. Then, inspect the battery terminals and confirm they’re properly attached . [7] X Research source A slightly unattached battery will cause your vehicle to idle at an odd tempo as the electrical current struggles to provide enough juice to the engine."
    },
    {
      "title": "Inspect your spark plugs and engine mounts.",
      "content": "Inspect your spark plugs and engine mounts. If you know your way around an engine bay, remove your spark plugs and replace them . If that doesn’t solve the problem, your engine mounts are probably damaged and need to be replaced. If a mount is damaged, the natural vibrations from your engine will make the car rattle when it idles. [8] X Research source If you aren’t confident about removing and replacing your spark plugs, just ask your mechanic to do it for you. If one of the spark plugs isn’t firing, your engine won’t get the proper combustion it needs to idle properly. See a professional mechanic to get your engine mounts replaced."
    },
    {
      "title": "Yes, and if it’s hard to control your vehicle, don't drive it.",
      "content": "Yes, and if it’s hard to control your vehicle, don't drive it. You’re fine to drive if the vibration is so minor that it doesn’t impact your ability to operate the vehicle. You still need to see a mechanic, but you aren’t at any serious risk. However, if the vibration is so bad that it makes steering difficult, your vehicle isn’t safe to operate. Either get it towed to the mechanic or drive slowly with your hazards on when the roads are empty. [9] X Research source Don’t leave this repair off for too long, especially if the shaking gets worse over time."
    }
  ]
}