{
  "url": "https://www.wikihow.com/Tie-a-Palomar-Knot",
  "title": "How to Tie a Palomar Knot",
  "steps": [
    {
      "title": "Thread the line through the hook eye.",
      "content": "Thread the line through the hook eye. Hold the fishing hook vertical with your thumb and pointer finger. Poke the fishing line through the eye of the hook, and pull about 12 inches of line through. [1] X Research source"
    },
    {
      "title": "Thread the line back through the hook eye.",
      "content": "Thread the line back through the hook eye. With the tag line pulled through the eye of the hook, poke the fishing line back through the hook eye. Leave room for about 6 inches of line on both sides of the hook eye; the tag end of the line and the looped end through the hook eye. This will ensure that you have enough line to make your overhand knot and pass the hook completely through the loop. Try not to pinch the line and push it through the hook eye. If you’re working with very fine line, pinching it will create a kink that can cause a break in your line later when you’re fishing. [2] X Research source Make sure that the tag line and reel line are not crossed over each other or twisted before you tie the overhand knot. [3] X Research source"
    },
    {
      "title": "Make an overhand knot.",
      "content": "Make an overhand knot. With both doubled up lines, make a simple overhand knot. Cross the looped line over the tag line and line leading back to the fishing reel. Turn the looped line underneath the tag and reel lines, and loosely pull it. Make sure that the hook is hanging at the bottom of the loose knot. [4] X Research source Leave enough space in the looped section of the line so the hook can later fit through the center of the loop. [5] X Research source"
    },
    {
      "title": "Drop the hook through the loop.",
      "content": "Drop the hook through the loop. Hold the overhand knot with your thumb and pointer finger, and place the finishing hook though the looped end of the line. [6] X Research source Gently pull all the lines back to make sure nothing is caught on the hook or around the sometimes rough area of the bottom of the hook eye. [7] X Research source"
    },
    {
      "title": "Pull the knot tight.",
      "content": "Pull the knot tight. Use your mouth and tongue to lubricate the line and the knotted area near the hook eye. [8] X Research source Hold onto the hook with one hand and let go of the looped line. Pull the main line and the tag line simultaneously with your other hand to secure the knot. Lubricating the knot with saliva or water reduces friction in the line, which in turn reduces the chances of having the line break later on. [9] X Research source The final knot should be secured on the top of the hook eye, not on or near the bottom of the hook eye or the hook shank. [10] X Research source"
    },
    {
      "title": "Clip the tag line.",
      "content": "Clip the tag line. Separate the tag line and the line going back to the reel, and pull them in opposite directions to make sure the knot is tied tight. Use scissors to trim off the excess end of the hanging tag line. Leave a centimeter or two of leftover tag line."
    }
  ]
}