{
  "url": "https://www.wikihow.com/Use-Hand-Signals-to-Train-a-Dog-that-is-Deaf",
  "title": "How to Use Hand Signals to Train a Dog that is Deaf",
  "steps": [
    {
      "title": "Learn hand signals to teach to your dog.",
      "content": "Learn hand signals to teach to your dog. When you are trying to train a dog that cannot hear, you will need to use sight to communicate with it. You can create your own hand signs, but it's a good idea to use established dog hand signals instead. In order to teach your dog these hand signals, you will need to learn them yourself. You only need to learn a few hand signals at a time. As you progress with training your dog, you can learn new signals and then teach them to your dog. Understanding established dog hand signals benefits your dog because many veterinarians, groomers and shelter employees also use them."
    },
    {
      "title": "Pick a few hand signals to start with and use consistently.",
      "content": "Pick a few hand signals to start with and use consistently. When training your deaf dog to understand hand signals, you should start using a few hand signals for things the dog does every day. An easy way to start is to use the first letter in sign language for everyday activities. For example, make a \"w\" in sign language before giving the dog water or make the letter \"f\" before you give the dog food. [1] X Research source"
    },
    {
      "title": "Accompany hand signals with the appropriate voice commands.",
      "content": "Accompany hand signals with the appropriate voice commands. During obedience lessons, you should still use voice commands with your dog. A deaf dog won't hear the command, but it will respond better because your facial expressions and body language will be more natural and expressive."
    },
    {
      "title": "Coordinate facial expressions with the hand signals.",
      "content": "Coordinate facial expressions with the hand signals. Dogs can read human facial expressions, and deaf dogs may rely on these more than hearing dogs. When using hand signals with your dog, use facial expressions to reinforce the message. Smile when they do well, frown or make a sad face when they misbehave, and act excited when they are playing. [2] X Research source"
    },
    {
      "title": "Use positive reinforcement training.",
      "content": "Use positive reinforcement training. When training a deaf dog, you should encourage good behavior instead of punishing bad behavior. Reward your dog with a treat, toy, pat on the head, or verbal praise when it does what you ask it to do. Withhold those rewards when your dog does something you don't want repeated."
    },
    {
      "title": "Limit the length of training sessions.",
      "content": "Limit the length of training sessions. Restrict obedience lessons to about 15 minutes when training deaf dogs. This will keep the sessions fun while not going beyond your dog's attention span. However, you want to do these short training sessions often and consistently. Several sessions a day will help your dog learn your commands more quickly and easily. If your dog still needs positive reinforcement, consider giving it a pat on the head or some other type of physical affection instead of a treat. After your dog is reliably responding to commands, you should transition from treats to praise to limit your dog's caloric intake."
    },
    {
      "title": "Expand your dog's vocabulary.",
      "content": "Expand your dog's vocabulary. You can teach your dog more than just the signs used for formal commands. After it has mastered some basic commands, continue to expand its vocabulary by making up more signs for everyday items that it uses and activities that it likes to do. For example, teach it signals for common objects, such as \"toy,\" and for daily activities, such as \"walk.\""
    },
    {
      "title": "Do your hand signal for \"sit.\"",
      "content": "Do your hand signal for \"sit.\" When you believe your dog is poised to sit down, make the hand signal you have chosen for \"sit\" just prior to it sitting. The initial goal is to have the dog understand the connection between the signal and the action it is doing. A common signal to use for sit begins with your right hand down by your side. Gradually bend your arm at the elbow, keeping your fingers straight and lifting your hand up until your fingers touch your right shoulder. Waiting for a time when the dog is naturally going to sit allows you to communicate the connection between the signal and the action."
    },
    {
      "title": "Give a reward immediately when the dog sits.",
      "content": "Give a reward immediately when the dog sits. Reinforce the dog's positive action with a reward and the \"yes\" sign to show it that it will be rewarded for that action. Keep repeating this until your dog understands the link between \"yes\" and the reward. Once your dog understands the \"yes\" and reward connection, you can use this knowledge to teach your dog additional hand signals and to reinforce good behaviors. Give a reward and the \"yes\" sign even when you catch your dog naturally performing any desired behavior, such as sitting."
    },
    {
      "title": "Transition to just a \"yes\" signal and no treat.",
      "content": "Transition to just a \"yes\" signal and no treat. You cannot give your dog a treat every time you ask it to sit forever. You need to transition off the treats once the dog responds to the signal consistently. Begin giving smaller and smaller treats once your dog has reliably responded to your command for several weeks. Then only give a treat every other time it sits for a month. Gradually eliminate the treat altogether over the course of the next month. As you eliminate the treats, you can use other forms of positive reinforcement, such as petting or playing with your dog, to praise it for its behavior. If your dog stops responding to your commands reliably, you may need to reintroduce treats. This means that it was not ready to do the trick without the treat. However, the dog should get back on track with its training easily and quickly."
    },
    {
      "title": "Don't startle a deaf dog.",
      "content": "Don't startle a deaf dog. When training a deaf dog, you need to be able to get its attention without using sound. It’s easy to scare or surprise a deaf dog that is sleeping or doesn't notice you approaching. Be thoughtful when approaching it so that it doesn't get scared and snap at you in fear. Above all, don't touch the dog without being sure that it knows you are there. You can gently wake a deaf dog up by placing your hand in front of its nose so it smells your presence. Do this consistently every time you wake your dog up. Give the dog a treat when it wakes up so that it starts to associate waking up with pleasant emotions."
    },
    {
      "title": "Use light to get your dog's attention.",
      "content": "Use light to get your dog's attention. If your dog is awake but not looking at you, you can use light to signal that you are nearby and you want its attention. Shine a flashlight or laser pointer in your dog's line of sight to get your dog's attention when it's not looking at you. You can also flick a light switch on and off to get the dog's attention. Try hooking a small flashlight onto the handle of your dog's leash. This will ensure that you have a flashlight to use with your dog when you take it on a walk."
    },
    {
      "title": "Make vibrations on the ground to get your dog's attention.",
      "content": "Make vibrations on the ground to get your dog's attention. If you don't have a light to turn on and off, you can use vibrations to let your dog know you want its attention. Tap your foot or hand on the floor of your home at least 2 feet (0.61 m) away from your dog. The dog will feel the vibrations and know you are approaching. If your dog is sleeping, you can gently scratch the floor or some object near the dog so it feels the vibration. This trick may not work if you and your dog are on very solid flooring or are outside."
    },
    {
      "title": "Put a vibrating collar on the dog.",
      "content": "Put a vibrating collar on the dog. There are specialty collars that send a small vibration to your dog's neck when you hit a button on a remote. These can be used to get your dog's attention when it is not looking at you or is far away. [3] X Research source This is a different product than an e-collar , which emits a small electrical pulse onto the dog's neck. Do not use e-collars. They are not considered humane, as they can be painful for the dog, easily overused, and can lead to the dog exhibiting aggression or fear."
    },
    {
      "title": "Consider putting a bell on your deaf dog's collar.",
      "content": "Consider putting a bell on your deaf dog's collar. While training a deaf dog can increase its safety dramatically, you will still need to do a variety of things to decrease the chance of it getting lost or injured. For instance, while a trained hearing dog can come when called, you will need to track your dog down to get its attention. To make this easier, attach something that will make noise when it moves around, such as a bell. While the bell will not irritate a dog that cannot hear it, it will likely irritate you at first. You either need to just get used to the sound of it or only make your dog wear it at certain times, such as when you are taking it outside."
    },
    {
      "title": "Keep your dog on leash.",
      "content": "Keep your dog on leash. Protect your deaf dog's safety by keeping it on a leash during walks and whenever it's in an unfenced area. A deaf dog cannot be called back when it has wandered off, so keeping it on leash is important to protect its safety. If you want your dog to be able to explore and play off leash, simply take it to an enclosed area, such as a dog park. However, you should always keep an eye on your dog around the other dogs so that you can intervene if necessary."
    },
    {
      "title": "Put an identification tag on the dog's collar that states the dog is deaf.",
      "content": "Put an identification tag on the dog's collar that states the dog is deaf. If your dog gets lost, it's important that it can be returned to you. An ID tag will allow anyone who finds your dog to get it back to you. The ID tag should state that the dog is deaf and it should include your name and phone number. Make sure that your dog always has its collar with ID on. There is always a chance that it could get out and get lost without a proper ID tag. In addition to an ID tag, make sure that your dog is microchipped. Your vet can microchip your dog to make sure that your dog is safely returned to you."
    }
  ]
}