{
  "url": "https://www.wikihow.com/Train-Your-First-Falcon",
  "title": "Falconry Training 101: Everything You Need to Know",
  "steps": [
    {
      "title": "Acquire all falconry licenses required by your jurisdiction.",
      "content": "Acquire all falconry licenses required by your jurisdiction. In the United States, you’ll need to apprentice with a licensed falconer, typically for 2 years, in order obtain a falconer’s license. You may also need to pass a written test in order to acquire a license. The application process varies by state, so look online for your specific requirements. [1] X Research source Check the government department overseeing falconry in your state and search for local falconry organizations for licensed mentors. https://www.fws.gov/offices/statelinks.html . In the U.S., apprentices are usually only allowed to own and train red-tailed hawks or American kestrels. After your 2-year apprenticeship, you’ll be able to obtain a general falconer’s license and keep falcons."
    },
    {
      "title": "Get your bird accustomed to its new environment gradually.",
      "content": "Get your bird accustomed to its new environment gradually. To get your hawk or falcon acclimated, or manned, keep it in the house with you for a week or so. Keep it hooded at first to help avoid stressing it. Then gradually expose it to new sights and sounds, such as other members of your household and your hunting dog. [3] X Research source Spend as much time as possible with your bird during the acclimation period so it becomes used to your presence. When exposing it to new stimuli, observe its behavior. If it freezes or appears agitated, place the hood over its head to calm it. When it’s not hooded, look for signs that your falcon is starting to relax, such as pruning or bathing. During the manning process, tether your bird on a short creance, which is like a leash for raptors. Your mentor, or the falconer you’re apprenticing with, can guide you through manning and show you how to handle and hood your bird."
    },
    {
      "title": "Put a piece of meat on the glove to train your bird to step up.",
      "content": "Put a piece of meat on the glove to train your bird to step up. After 1 or 2 days, your falcon should start to get used to its new surroundings. At that point, put on your glove and place a 1 inch (2.5 cm) tidbit of raw meat on it. Hold the glove near the falcon’s perch and make a signal noise, like a whistle or click. Allow your hawk or falcon to step onto you glove and eat. Continue practicing for about 30 minutes so it gets comfortable eating in front of you. As it steps up reliably, try asking it come to your glove from gradually greater distances. Never take away food from your bird, especially when you’re first training it to come to your glove. Your bird will think you’re stealing from it and lose trust in you."
    },
    {
      "title": "Begin tossing food to the ground when it jumps on your glove.",
      "content": "Begin tossing food to the ground when it jumps on your glove. When your bird reliably comes to your glove, start tossing food onto the floor instead of feeding the bird on your arm. Hold up your gloved arm and whistle or click to signal the bird to come. As soon as it comes, toss a tidbit of meat onto the floor and allow it to pounce onto the food. [4] X Research source Some falconers continue to feed their birds on the glove. However, if you’re training your hawk or falcon for hunting, teaching it to associate your glove with food could make the bird dependent on you. Tossing food onto the floor teaches the bird that your arm is a good place from which to hunt, not that your arm is where it gets a handout."
    },
    {
      "title": "Use a lure resembling your target game.",
      "content": "Use a lure resembling your target game. Choose a lure that mimics the animal you're hunting, such as a quail or rabbit, and attach small pieces of meat. You should be ready to begin lure training within the first few days of bringing home your bird. The bird will be ready once it starts to trust you and exhibits calm behavior, such as preening."
    },
    {
      "title": "Start by wiggling the lure a short distance away from your bird.",
      "content": "Start by wiggling the lure a short distance away from your bird. Get your bird’s attention by wiggling the lure 2 to 3 feet (0.61 to 0.91 m) away from its perch. It might need some convincing at first, and it might only step or walk over to the lure. As soon as it eats the piece of meat, hold your glove and signal for it to come. [5] X Research source The small pieces of meat should help encourage it to attack the lure. The part of the lure that looks like a prey animal is attached to a stick by a long string. Shake the stick to make the lure wiggle; don’t hold the lure itself in your hands."
    },
    {
      "title": "Increase the chase distance gradually.",
      "content": "Increase the chase distance gradually. When your hawk or falcon starts reliably going to the lure from 2 or 3 feet (0.61 or 0.91 m) away, double the distance. Keep practicing indoors until the bird flies to the lure from across a room. Remember to call your bird to the glove after it attacks the lure. That way, when you’re on the hunt, it’ll be trained to withdraw after it’s caught prey."
    },
    {
      "title": "Remove baiting once the bird reliably chases the lure, reinforcing the behavior by calling it back to your glove after it attacks.",
      "content": "Remove baiting once the bird reliably chases the lure, reinforcing the behavior by calling it back to your glove after it attacks. [6] X Research source Baiting the lure gets the bird’s attention in the beginning stages. Once it knows to attack the lure, teach it that it’ll be rewarded if it withdraws from the prey it catches and goes to your glove."
    },
    {
      "title": "Use a creance when you start practicing outside.",
      "content": "Use a creance when you start practicing outside. Tether your hawk or falcon to an outdoor perch with a creance that’s at least 100 feet (30 m) long. Start by wiggling the lure about 10 to 15 feet (3.0 to 4.6 m) away from your bird. As you did indoors, gradually increase the chase distance until you’ve reached the creance’s full length. Remember to call your bird to your glove and reward it with a small piece of raw meat after it attacks the lure."
    },
    {
      "title": "Practice without the creance when your bird obeys cues consistently.",
      "content": "Practice without the creance when your bird obeys cues consistently. Judge how well your bird responds to cues when it’s on the creance. When it reliably attacks the lure and goes to your glove outdoors, try practicing without the creance. The first free flight can be nerve-wracking, but if bird performs well on the creance, it should return reliably without the creance. Depending on your bird’s temperament, it should be ready for its first free flight after 1 to 3 weeks of training."
    },
    {
      "title": "Expand your bird’s range with balloons or kites.",
      "content": "Expand your bird’s range with balloons or kites. Suspend a lure or piece of raw meat from a kite or balloon. Have a helper fly the kite or balloon, have your bird perch on your gloved arm, then cue it to fly to the lure. [8] X Research source Your bird will bind to the lure or food with its talons and brings it to the ground. When it does so, call it back to your gloved arm and toss a small piece of meat onto the ground to reward it. Some falconers even use drones to train their birds. This method of training is especially helpful if you’re hunting quail or duck. It’ll help expand your bird’s range and get it used to aerial hunting."
    }
  ]
}