{
  "url": "https://www.wikihow.com/Tell-Gold-from-Brass",
  "title": "How to Tell Gold from Brass",
  "steps": [
    {
      "title": "Notice the color.",
      "content": "Notice the color. While brass and gold have similar colors, gold is shinier and more yellow. Brass is duller than gold and does not have the same vibrant yellow color as pure gold. However, if the gold is mixed with other metals, this method will be less reliable."
    },
    {
      "title": "Scratch the metal across a ceramic surface.",
      "content": "Scratch the metal across a ceramic surface. Gold is a very soft metal. When scratched across a ceramic surface, gold will leave behind a streak of gold. However, brass is harder and will leave a black streak on the same surface. Simply press the metal to an unpolished ceramic surface and pull it across the surface."
    },
    {
      "title": "Test the density of the metal.",
      "content": "Test the density of the metal. The most accurate way to test the density of the metal would be to measure the volume and the mass, then calculate the density mathematically. Luckily, there's a faster and easier approach. Use your hand to toss the metal lightly up and let it come back down (or you can just lift it and lower it quickly without it leaving your hand). Since gold is more dense than brass, it will feel heavier than you might expect. Since brass has a lower density, it will feel lighter."
    },
    {
      "title": "Look for a karat count.",
      "content": "Look for a karat count. The karat is a measurement used to designate the purity of gold. Higher ratios of gold to other metals in a piece means a higher karat count. Pure gold is 24 karat. [1] X Expert Source Jerry Ehrenwald Former President, International Gemological Institute & Graduate Gemologist Expert Interview. 12 August 2019. A brass piece will not be marked with a karat count. The karat count is typically found in an inconspicuous place such as the bottom or inside of a piece, though it varies from piece to piece."
    },
    {
      "title": "Search for the word “Brass.”",
      "content": "Search for the word “Brass.” While brass does not receive a karat count, it is sometimes marked. Many brass pieces will have the word “Brass” somewhere on the metal. This word is often stamped or engraved in the metal piece when it is forged. Just like the karat count, the location of this stamp will vary, but it is likely to be on the inside lip or the bottom of an object. [2] X Research source"
    },
    {
      "title": "Know the price of the metal.",
      "content": "Know the price of the metal. If you know what the metal piece sells for, you can easily tell the difference between brass and gold. Gold is quite expensive depending on its purity. Brass is relatively cheap compared to precious metals like gold and silver."
    },
    {
      "title": "Scan for any tarnished areas.",
      "content": "Scan for any tarnished areas. One of the most revered properties of gold is that it does not tarnish. On the other hand, brass reacts with oxygen in the environment. This reaction is called oxidation and it will cause the brass to look tarnished and discolored. If there are any oxidized areas, the piece is brass. However, the absence of oxidation cannot confirm that the piece is gold."
    },
    {
      "title": "Test an inconspicuous section.",
      "content": "Test an inconspicuous section. When testing the chemical properties of a piece of metal, you should do so in an area that is not typically visible. This will ensure that the piece isn't ruined by doing the test. Look for a lip or rim with an underside, or a piece of the metal that is otherwise covered or concealed. [3] X Research source"
    },
    {
      "title": "Apply acid to the metal.",
      "content": "Apply acid to the metal. Apply concentrated acid to the metal. Brass will react with acids and gold will not. [4] X Expert Source Jerry Ehrenwald Former President, International Gemological Institute & Graduate Gemologist Expert Interview. 12 August 2019. If you see bubbling or discoloration where the acid is applied, your piece is brass. If there is no change after applying the acid, you have gold. [5] X Research source"
    }
  ]
}