{
  "url": "https://www.wikihow.com/Use-Nasal-Spray",
  "title": "How to Use Nasal Spray",
  "steps": [
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. [1] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Washing with warm water and soap should do the trick. Prior to using your nasal spray, it is important to have clean hands to minimize any risk of infection by getting germs into your nose or spraying them up alongside the medication."
    },
    {
      "title": "Clear your nose prior to using your nasal spray by blowing it.",
      "content": "Clear your nose prior to using your nasal spray by blowing it. Remove as much mucus as possible. Do not blow too hard. For best and safest results, press down on one nostril with your finger as you blow the other, and then do the same to the other nostril. [2] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Check that you can inhale air through each nostril prior to using the nasal spray.",
      "content": "Check that you can inhale air through each nostril prior to using the nasal spray. After you have blown your nose or otherwise cleared your nasal passages, if you still cannot get air through then it is unlikely that the medication will be effective as it will not be able to travel far enough up the nasal passages. [3] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Try home remedies to clear your nostrils prior to using the nasal spray.",
      "content": "Try home remedies to clear your nostrils prior to using the nasal spray. If you have blown your nose but still find that there is a lot of congestion, try these other home remedies to diminish the congestion in your nostrils. It is important for your nasal passages to be as clear as possible before using the medication. Some things to try include: [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Taking a hot shower. Heat can help to clear out your nasal passages. Use a saline nasal spray. Using a humidifier. Contrary to popular belief, dry air actually worsens nasal congestion. Moist air, on the other hand, can help to clear out your nostrils. Drink plenty of water. Being well-hydrated can help to diminish congestion."
    },
    {
      "title": "Press the canister into the holder.",
      "content": "Press the canister into the holder. Make sure that it fits securely. Shake the canister a few times. [5] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Check the directions to make sure that you are holding the canister correctly."
    },
    {
      "title": "Place the nozzle in the nostril receiving the spray.",
      "content": "Place the nozzle in the nostril receiving the spray. At the same time, press down on the other nostril with your finger. Close your mouth, and push the canister down just as you slowly breathe in through the one nostril receiving the medicine. Make sure that you take in the medicine. Do the same with the other nostril, making sure that you press down the nostril that just received the medicine. Do not take more than the specified amount of sprays. [6] X Research source Don't sniff or inhale too hard or the medicine may drip down the back of your throat. If this happens, try to spit it out. [7] X Research source"
    },
    {
      "title": "Be careful not to blow your nose or sneeze directly after using the nasal spray.",
      "content": "Be careful not to blow your nose or sneeze directly after using the nasal spray. [8] X Research source Try to wait a few minutes to let the medication fully absorb first."
    },
    {
      "title": "Wash your hands again.",
      "content": "Wash your hands again. After you have finished using your nasal spray, it is advisable to wash your hands again. Particularly if you are using a nasal spray temporarily to treat congestion from an illness, you will want to wash your hands to ensure that minimal germs are present on your hands. This helps to prevent others from catching your infection."
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Many nasal sprays take consistent use before they become maximally effective. Wait at least 2 weeks (or whatever time-frame your doctor recommends, as it can vary depending on the type of medication) before evaluating the results of using the spray. [9] X Research source Do not take more than the recommended number of doses prescribed by your physician. Just like any other prescription medication, if you find that it is ineffective (or taking longer than you expected or hoped to work) that does not mean to double up on your dose. It could be dangerous to do so, so be sure to stick within the recommended limits of your doctor. The dosing of nasal sprays is variable and will depend upon what medication is contained within it."
    },
    {
      "title": "Clear your nose prior to using your nasal spray by blowing it.",
      "content": "Clear your nose prior to using your nasal spray by blowing it. Remove as much mucus as possible. Do not blow too hard. For best and safest results, press down on one nostril with your finger as you blow the other, and then do the same to the other nostril. [10] X Research source"
    },
    {
      "title": "Remove the lid and shake the medicine.",
      "content": "Remove the lid and shake the medicine. Prime the pump spray before using it. You do this by squirting it into the air until it becomes a mist. It is important to \"prime\" it first with this type of nasal spray to ensure that the actual medication is what gets into your nostril and then absorbed."
    },
    {
      "title": "Check the directions to make sure that you are holding the bottle correctly.",
      "content": "Check the directions to make sure that you are holding the bottle correctly. You should grasp the bottle with your middle and index fingers on top and your thumb securing the bottle."
    },
    {
      "title": "Place the nozzle in the nostril receiving the spray and press down on the other nostril with your finger.",
      "content": "Place the nozzle in the nostril receiving the spray and press down on the other nostril with your finger. Close your mouth, and squeeze the pump down just as you slowly breathe in through the one nostril receiving the medicine. Make sure that you take in the medicine. Do the same with the other nostril, making sure that you press down the nostril that just received the medicine. Do not take more than the specified amount of sprays. [11] X Research source"
    }
  ]
}