{
  "url": "https://www.wikihow.com/Study-For-Exams",
  "title": "How to Study For Exams",
  "steps": [
    {
      "title": "Review your syllabus.",
      "content": "Review your syllabus. Figure out when all of your exams will be and how much of your grade they are worth. Put these dates on your calendar or planner so they don't sneak up on you! Plan review sessions beginning at least a week in advance of each exam. Ideally, you'll do several mini-reviews well in advance, gradually increase the time in which you study, rather than trying to cram everything into one mega session the night before the test."
    },
    {
      "title": "Pay attention in class",
      "content": "Pay attention in class . This seems like a no-brainer, but actually paying attention while you're in class will help you immensely once exam time comes. Don't fall into the trap of thinking you'll just \"absorb\" knowledge; be an active learner. Try sitting at the front of the class, this will make it easier to focus. [1] X Research source Listen carefully, because teachers often give hints like \"The most important thing about this topic is...\". Or they may just place emphasis on certain words and issues. This is the real key to testing well. The more you absorb the information early on, the less studying you'll need to do."
    },
    {
      "title": "Take good notes",
      "content": "Take good notes . This is easier said than done, but learning how to take good notes will help you immensely once it comes time to study. Write down everything your teacher writes on the board or puts up in slides. Try to record as much of what the teacher says as possible, but don't allow taking notes to distract you so much that you forget to listen. [2] X Research source Review your notes daily, right after class. This will help reinforce the information you just learned."
    },
    {
      "title": "Make studying a part of your habits.",
      "content": "Make studying a part of your habits. Too often, it's easy to view studying as something that only gets done at the last minute in a huge overnight cram session. Instead, try setting aside some time every day to study. Scheduling it just like another appointment or class may help you stay motivated to continue the habit. [3] X Research source Create a digital or paper timetable to help you schedule your studying \"appointments.\" Reader Poll: We asked 943 wikiHow readers and 68% agreed that their preferred way to organize study time is by making paper revision timetables . [Take Poll]"
    },
    {
      "title": "Ask about the exam format.",
      "content": "Ask about the exam format. Ask your teacher what format the test will be in, how it will be graded, if there are any opportunities for extra credit, and if they would be willing to talk to you about highlighting in your notes, what the most important broad subjects will be, etc."
    },
    {
      "title": "Study in a clean , quiet and orderly room.",
      "content": "Study in a clean , quiet and orderly room. Keep anything and everything away from where you are that may cause you to get distracted. Jumping up to read a text message on your phone or periodically checking social media is ill-advised whilst studying."
    },
    {
      "title": "Turn on the light!",
      "content": "Turn on the light! Studying in a dark room is not recommended. Add lamps at night, or in the daytime, open the window coverings (open the window a little, too). People tend to study and focus better in a brighter, oxygenated room with little noise."
    },
    {
      "title": "Turn the TV off.",
      "content": "Turn the TV off. While many students believe that they're good at multitasking, such as studying with the TV on or while chatting online with friends, research suggests that this is not true for the vast majority of people. [4] X Research source For better studying performance, eliminate distractions such as TV and loud music with lyrics. Rapidly swapping attention between studying and watching TV makes it more difficult for your brain to prioritize information acquisition."
    },
    {
      "title": "Decide if music is right for you.",
      "content": "Decide if music is right for you. Music's effect on memory performance varies between individuals. Some studies have found music to aid the memory performance of individuals with ADD/ADHD, while reducing it in individuals without the disorder. Classical music appears to be the most effective in enhancing studying performance. You must determine whether you're better off with or without it. If you do enjoy listening to music whilst studying, make sure you're actually concentrating on the material you have to study for, and not the catchy tune that's playing in your head. [5] X Research source If you absolutely must listen to music, find instrumental music so that the words in the music don't interfere with your studying. Listen to background sounds from nature in order to keep your brain active and prevent other noises to distract you. There are several free background noise generators available online. Listening to Mozart or classical music won't make you smarter or keep information in your brain, but it may make your brain more receptive to receiving information."
    },
    {
      "title": "Focus on your work objectives.",
      "content": "Focus on your work objectives. What do you intend to accomplish during this session? Setting a concrete study goal may help you. Creating study plans is also a good idea. If 3 out of 5 lessons are easy and can be finished fast, finish them first, so you can spend quality time on the difficult lessons without fretting. Also, keeping a folder for your exam reviews is a good way to keep organized."
    },
    {
      "title": "Write yourself a study guide.",
      "content": "Write yourself a study guide. Go through your notes and rewrite the most important information. Not only will this give you a more focused way to study, but it creating it is another form of studying! Just don't spend too much time on the guide itself: you need to have time to go over it too! [6] X Research source"
    },
    {
      "title": "Reinvent your notes in other formats.",
      "content": "Reinvent your notes in other formats. Rewriting your notes is great if you're a kinesthetic learner. Mind mapping is the most effective way of doing this. Also, when you re-write something, you will probably think about what you are writing, what it's about, and why you wrote it down. Most importantly, it refreshes your memory. If you took notes a month ago and just found out that those notes will be relevant in your exam, rewriting them will remind you of them when you need it for your exam. [7] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Don't simply copy your notes over and over again. This tends to lean towards memorizing the exact wording of your notes instead of the actual concepts. Instead, read and think about the contents of your notes (such as think of examples), and then re-word them."
    },
    {
      "title": "Ask yourself questions about your material.",
      "content": "Ask yourself questions about your material. This can help you tell if you have remembered what you just studied. Don't try to remember the exact wording from your notes in your answer to yourself; synthesizing that information into an answer is a much more useful tactic. It can also help to say the answers to your questions out loud, as if you were trying to explain it to someone else."
    },
    {
      "title": "Review previous tests and assignments.",
      "content": "Review previous tests and assignments. If you missed questions on previous work, look up the answers and understand why you missed these questions. This is particularly helpful if the exam you're studying for is cumulative or comprehensive, meaning it covers things you also covered earlier in the course. [8] X Research source"
    },
    {
      "title": "Find the right hours.",
      "content": "Find the right hours. Don't study when you're really tired. It's better to get a good night's sleep after studying for a short time than to push on at two in the morning. You won't remember much and you're likely to see a performance drop the next day. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Start as early as possible.",
      "content": "Start as early as possible. Don't cram. Cramming the night before is proven to be ineffective, because you're taking in so much information at once that it's impossible to memorize it at all — in fact, you'll hardly retain anything. Studying before and going over it multiple times really is the best way to learn the material. This is especially true with things like history and theoretical subjects. [10] X Research source Always study when you have the chance, even if it is only for 15 or 20 minutes. These short study periods add up fast! Study in chunks of 25 minutes using the Pomodoro Technique. After that make a break of 5 minutes; repeat the process 3x, then make a longer pause of 30-45 minutes."
    },
    {
      "title": "Study for your learning style.",
      "content": "Study for your learning style. If you're a visual learner, using pictures can help. Auditory learners should record themselves saying notes and recite it afterwards. If you are a physical person, lecture to yourself (out loud) while also using your hands or moving around; this way it will be easier for you to memorize. [11] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020."
    },
    {
      "title": "Adjust your study techniques to fit your subject.",
      "content": "Adjust your study techniques to fit your subject. Subjects such as mathematics require a lot of practice with problem sets in order to become familiar with the processes required. Subjects in the humanities, such as history or literature, may require more information synthesis and memorization of things such as terms or dates. Whatever you do, don't just re-read the same set of notes over and over again. In order to actually learn, you need to take an active role in knowledge creation as well as information review. Try finding the \"big picture\" among what you've taken down or reorganizing your notes by theme or date."
    },
    {
      "title": "Think of your teacher.",
      "content": "Think of your teacher. Ask yourself: What is my teacher most likely to ask on the exam? What materials should I focus on to give myself the best chance of knowing what I need to know? What trick questions or wrinkles could my teacher introduce that might throw me for a loop? This may help you focus on the most important information, rather than getting stuck on things that might not matter as much."
    },
    {
      "title": "Ask for help.",
      "content": "Ask for help. If you need help, ask someone who is good at these subjects. Friends, family, tutors, and teachers are all good options. If you don't understand what the person helping you is communicating, don't be afraid to ask them to elaborate. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Asking teachers for help conveys your commitment to the material and can be helpful in the future as well as with your exams. Always remember to ask your teacher if you do not know what she is talking about or if you need more information. The teacher will probably be glad to help. There are often resources at schools and colleges that can help you cope with stress, answer study-related questions, give you study tips and other forms of guidance. Ask your teacher or visit your school's website to learn how to use these resources. Your teacher might let you record your classes if you struggle to focus. You can review the recordings when you study for your exams. [13] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020."
    },
    {
      "title": "Take breaks",
      "content": "Take breaks . You need some time to have fun and it is better to study when you are feeling relaxed than to exhaust yourself studying all day! Carefully structure your break and study time. [14] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. Usually, 20-30 minutes of study and then a 5 minute break is the most effective method. If you have trouble bringing yourself to study, instead of long uninterrupted sessions, chunk your work into 20 minute periods, taking a 10-minute break at the end of every period. Make sure that you structure the chunks logically so that you're not breaking up concepts across chunks, as this may make it more difficult to remember concepts in their entirety."
    },
    {
      "title": "Think positive but work hard.",
      "content": "Think positive but work hard. Self confidence is important; focusing on how little you've studied or how badly you think you will do on the exam just distracts you from working on achieving success. However, this doesn't mean that you shouldn't study hard. You still need to work at it, even if you have confidence in yourself. Confidence just keeps away roadblocks to success."
    },
    {
      "title": "Work with others.",
      "content": "Work with others. Arrange study dates at a library with your friends to compare notes or explain things the other one might not understand. Working with other people can help you cover gaps in your own knowledge and also help you remember more information, since you may have to explain things to them or have conversations about the topic. It's also a great way to stay motivated. [15] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. If you ask for help from others, don't joke around. Concentrate on what you are doing."
    },
    {
      "title": "Call for help.",
      "content": "Call for help. If you're stuck on a subject, do not be afraid to call a friend and ask for help. If your friends cannot help, ask a tutor for help. [16] X Research source If you have time before your exam and find that you're not understanding material, ask if your teacher will go over it with you."
    },
    {
      "title": "Get plenty of rest the night before.",
      "content": "Get plenty of rest the night before. Children in elementary school (in the UK, primary school) require on average 10-11 hours of sleep for optimal performance. Adolescents, on the other hand, typically require at least 10+ hours. Poor sleep has been found to accumulate (referred to as \"sleep debt\"); in order to make up for prolonged poor sleep habits, several weeks of daily optimal sleep may be required to return to optimal performance. [17] X Research source Don't consume caffeine or any other stimulating substance within 5-6 hours prior to sleeping. (However, if a doctor prescribed you a stimulant to take at a specific time, take it at that time regardless of when you fall asleep, and ask your doctor before changing anything.) Such substances reduce the efficiency of sleep, meaning that even with sufficient sleep time, you may not feel well rested upon waking."
    },
    {
      "title": "Eat a healthy",
      "content": "Eat a healthy , light meal. Eat a balanced breakfast full of lean protein, vegetables, omega-3 fatty acids, and antioxidants. A sample breakfast might include a spinach omelet with smoked salmon, whole wheat toast, and a banana. [18] X Research source"
    },
    {
      "title": "Bring a snack.",
      "content": "Bring a snack. If your exam is a long one, bring a snack with you if you're permitted to do so. Something with some complex carbohydrates and protein, such as a whole-wheat peanut butter sandwich or even a granola bar, will help boost your concentration when it begins to flag. [19] X Research source"
    },
    {
      "title": "Get to the exam room with time to spare.",
      "content": "Get to the exam room with time to spare. Give yourself at least five or 10 minutes to gather your thoughts before starting the exam. This way, you can get settled in and have time to relax before the test starts. [20] X Research source"
    },
    {
      "title": "Do the questions you know first.",
      "content": "Do the questions you know first. If you don't know the answer to the question, do the next one and come back to it at the end. Struggling and concentrating on a question you don't know the answer to can be time consuming, which makes you lose valuable marks. [21] X Research source"
    },
    {
      "title": "Make flashcards.",
      "content": "Make flashcards. If you have a grammar test or English, its good to make flashcards to remember definitions of a word. You can take it to school and just flip through them before your exams start. [22] X Research source"
    }
  ]
}