{
  "url": "https://www.wikihow.com/Tone-Indicators-List",
  "title": "A Complete List of Tone Indicators: Meanings, Examples & How to Use Them",
  "steps": [
    {
      "title": "Tone indicators are tags that describe the tone of a text or online post.",
      "content": "Tone indicators are tags that describe the tone of a text or online post. They’re written with a backslash (/) followed by an acronym or shortened version of a word (like /nm for not mad or /j for joking). Many people use them online to provide a little bit of extra clarity to their posts and replies. [1] X Research source Although tone indicators are fairly new, the concept of tone tags definitely isn’t. In the late 1500s, British printer Henry Denham tried using the percontation symbol (⸮) to show whether a question was open-ended, or whether it could be answered with one word. [2] X Research source"
    },
    {
      "title": "Tone indicators help prevent miscommunication in digital spaces.",
      "content": "Tone indicators help prevent miscommunication in digital spaces. Body language plays a really big role in how we interpret what other people are saying, which makes online communication a bit difficult to navigate at times. Tone indicators provide an obvious, concrete way to understand someone else’s tone in the digital world, whether it’s over text or on social media. Tone indicators are especially helpful for members of the neurodivergent community, who appreciate the extra context that tone tags offer."
    },
    {
      "title": "/j and /hj: joking and half-joking",
      "content": "/j and /hj: joking and half-joking People use this tone indicator to show that their text/post is a joke and not meant to be taken seriously. The /hj tag is another common tone indicator used in situations where someone is partially serious as well as partially joking. [3] X Research source “Dude you look like you haven’t slept in a week /j” “That’s it. I’m logging out of Twitter for the rest of my life. /j” “Take that White Sox hat off right now!!!! /hj” You can also use /ij to reference an inside joke with a friend."
    },
    {
      "title": "/g or /gen: genuine",
      "content": "/g or /gen: genuine People add the /g or /gen tag to show they’re being completely sincere and genuine (rather than sarcastic or joking). [4] X Research source Some people use more specific tags like /genq or gens when they’re offering a sincere question or suggestion, respectively. [5] X Research source Person A: “It annoys me so much when people use a ton of exclamation points” Person B: “Why do you feel that way? /genq” “I love your Led Zeppelin shirt! /g” Person A: “I wish it wasn’t so hard to wake up in the morning.” Person B: “Have you tried setting multiple alarms? /gens”"
    },
    {
      "title": "/s: sarcasm",
      "content": "/s: sarcasm The /s tag shows that a post or message is completely sarcastic and shouldn’t be treated like a genuine statement. Some people might use /sar or /sarc instead of /s , often to avoid the tag being misinterpreted as meaning “serious”. [6] X Research source “You always meet the nicest people on Twitter /s” “Ah, yes… I completely understand what you’re trying to say now /sar” “Did you know that typing in caps makes your sentence louder? /sarc”"
    },
    {
      "title": "/lh: light-hearted",
      "content": "/lh: light-hearted The /lh tag is typically added to posts and comments that are meant to be playful and light-hearted (but could be interpreted in an offensive way). [7] X Research source Person A: “I pour the milk into my cereal bowl first” Person B: “We aren’t friends anymore /lh” Person A: “What if dogs only lick us because they know we have bones inside?” Person B: “What is wrong with you?? /lh”"
    },
    {
      "title": "/srs and /nsrs: serious and not serious",
      "content": "/srs and /nsrs: serious and not serious People use the /srs tone indicator to show that they’re completely serious about something (rather than sarcastic or joking). On the flip side, people use /nsrs for posts that aren’t meant to be serious but also aren’t meant to be jokes. [8] X Research source “I’ve never seen a single Star Wars movie in my life /srs” “I can’t deal with my sister anymore lmao /nsrs”"
    },
    {
      "title": "/nm: not mad",
      "content": "/nm: not mad The /nm tag often gets added to posts/messages that seem aggressive or angry on the surface. A person might add /nm after a message sent in all caps (or that could otherwise be viewed in an annoyed or angry light). [9] X Research source “NOOO I CAN’T BELIEVE YOU DID THIS!! /nm” “Please don’t DM me on Twitter if we aren’t mutuals /nm” “What was the point of sending that reply? /nm”"
    },
    {
      "title": "/rt or /rh: rhetorical",
      "content": "/rt or /rh: rhetorical People use the /rt or /rh tag when posting a rhetorical question or statement that they don’t want an answer/reply to. [10] X Research source “Why do people feel to hop onto all of these nasty Twitter trends? /rh” “When will people in the YouTube comments learn how to be decent human beings? /rh” “Why is my mom like this? /rt”"
    },
    {
      "title": "/pos: positive",
      "content": "/pos: positive The /pos tag lets people know that the original post should be viewed in a positive and friendly light, rather than a neutral or negative one. It’s often used with messages that could be taken in a negative way. [11] X Research source “I’m crying real tears rn /pos” “I can’t believe you’re doing this to me!!! /pos” “I’ve never felt this way before /pos”"
    },
    {
      "title": "/neg: negative",
      "content": "/neg: negative Similar to the /pos tag, the /neg lets readers/users know that a message is meant to be viewed in a negative light (rather than positive or neutral one). [12] X Research source “I have no idea what to do /neg” “Why would you say that?? /neg” “Apparently it’s supposed to thunder tonight? /neg”"
    },
    {
      "title": "/neu: neutral",
      "content": "/neu: neutral People add the /neu tag to posts that aren’t meant to be taken in either a positive or negative way. [13] X Research source “When did you hear about this? /neu” “I had no idea that he was both a singer and an actor /neu”"
    },
    {
      "title": "/c: copypasta",
      "content": "/c: copypasta Some people add the /c tag when they’re reposting a copypasta. The /c lets people know that the poster isn’t the original author (and that the post shouldn’t be taken seriously). [14] X Research source “I like to creep around my home and act like a goblin. I don’t know why but I just enjoy doing this. Maybe it’s my way of dealing with stress or something but I just do it about once every week. /c” “don’t care + didn’t ask + cry about it + who asked + stay mad + get real + L /c”"
    },
    {
      "title": "/p: platonic",
      "content": "/p: platonic The p tag adds a platonic touch to messages and comments that could potentially be taken in a romantic context, like commenting on someone’s cute selfie. “I love you so much!! /p” “You look AMAZING in that dress! /p” “Thank you so much dude… I could marry you rn /p” Some people might use the “not flirting” or /nfl to convey the same meaning. [15] X Research source"
    },
    {
      "title": "/r: romantic",
      "content": "/r: romantic The opposite of the /p tag, /r is used to add romantic context to a message or post. [16] X Research source People will likely use it when talking with (or about) their partners and significant others. “Blowing you a kiss!! /r” “Sending you many smooches /r”"
    },
    {
      "title": "/l, /ly, or /lyr: lyrics",
      "content": "/l, /ly, or /lyr: lyrics The /ly or /l tag lets readers know that their post is made of song lyrics rather than their original thoughts. [17] X Research source “I don’t wanna die, I sometimes wish I’d never been born at all /ly” “Well, is it hard understanding, I’m incomplete? /lyr” “And will I ever know what it’s like to be fine without pretending /l”"
    },
    {
      "title": "/nav or /av: not a vent or a vent",
      "content": "/nav or /av: not a vent or a vent The /nav tag lets other people know the original post or message isn’t meant to be a vent (a post where someone is “venting” their feelings). The /av tag, on the other hand, indicates that the post or message is a vent. [18] X Research source “LOL I went to Starbucks today and the barista spelled my name wrong /nav” “My mom is backseat driving on the roadtrip. Some things never change lol /nav” “I wish more places offered dahlia piercings. Why is so hard to schedule an appointment?? /av”"
    },
    {
      "title": "/t: teasing",
      "content": "/t: teasing People add the /t tag to messages, posts, and replies when they’re trying to seem light-hearted and playful. [19] X Research source It carries a similar energy to the /lh (light-hearted) tag. “You would know a lot about that, wouldn’t you… /t” “I thought you said you were giving up chocolate for the rest of the month! /t” “Wow, some Giants fan you are… /t”"
    },
    {
      "title": "/npa: not passive aggressive",
      "content": "/npa: not passive aggressive The /npa tag lets people know that the original message or post isn’t meant in a passive-aggressive way. It’s especially helpful for ambiguous posts that could potentially be interpreted the wrong way. [20] X Research source “If that’s what you want to do, that’s fine. /npa” “Sorry! I was just kidding /npa”"
    },
    {
      "title": "Add tone indicators after texts or posts to make the meaning extra clear.",
      "content": "Add tone indicators after texts or posts to make the meaning extra clear. Tone indicators are a a helpful way to make your digital conversations unambiguous, as well as prevent any unwanted miscommunication. Let’s say that you’re replying to a Twitter thread with a pretty sarcastic response, or you’re posting a joke that could potentially get lost in translation—adding a tone indicator of your choice to the end of your message can help make your intentions as clear as possible. “I’ve never heard that one before! /sar” “TIL that door hinge rhymes with orange /j”"
    },
    {
      "title": "Respect a person’s decision to use tone indicators even if you don’t use them.",
      "content": "Respect a person’s decision to use tone indicators even if you don’t use them. Not everyone is a fan of tone indicators, but many people find them to be an invaluable way to navigate online spaces (especially members of the neurodivergent community). Even if you choose not use tone indicators yourself, be courteous of other people’s decisions to use them in online conversations. If someone asks you to use tone tags in your future conversations/interactions, feel free to do so! Tone indicators can make a really big difference in a person’s online experience."
    },
    {
      "title": "Never use tone indicators as the punchline of a joke.",
      "content": "Never use tone indicators as the punchline of a joke. Tone tags may not be your cup of tea—and that’s totally okay! What isn’t okay is using tone tags as a joke, or to make fun of someone who relies on tone indicators in their digital communication. Everyone has the right to feel safe and understood online, regardless of whether or not they use tone tags."
    },
    {
      "title": "Stick to 1-2 tone indicators instead of using many at once.",
      "content": "Stick to 1-2 tone indicators instead of using many at once. Using a series of tone tags can seem patronizing, so it’s best to keep things simple. Choose 1 or 2 tone indicators that best capture the energy of what you’re trying to say rather than sticking 3 or 4 tags at the end of your message. [21] X Research source What not to do: “OMG you look gorgeous!! /gen /p /nfl” What to do: “OMG you look gorgeous!! /p”"
    }
  ]
}