{
  "url": "https://www.wikihow.com/Sort-Scrap-Metal",
  "title": "How to Sort Scrap Metal",
  "steps": [
    {
      "title": "Get containers to separate your metals in.",
      "content": "Get containers to separate your metals in. Use large plastic bins, cardboard boxes, or any other large containers you can find. Make sure you’re getting containers large enough to hold the amount of metal you plan on scrapping."
    },
    {
      "title": "Label the different containers.",
      "content": "Label the different containers. Write on them with a permanent marker or stick pieces of masking tape on them and write the label on the tape. Assign each container to a different kind of metal. For example, one container would be labeled “aluminum,” and another container would be labeled “iron.” Ideally you should have at least one container for each kind of metal you’ll encounter while scrapping, including copper, brass, stainless steel, aluminum, and iron."
    },
    {
      "title": "Set up the containers in your work area.",
      "content": "Set up the containers in your work area. Organize them so they’re easy to reach and access. Position the containers so the labels are facing where you’ll be sorting through the scrap metal. That way you can easily find the bin you need when you’re sorting."
    },
    {
      "title": "Accumulate scrap metal.",
      "content": "Accumulate scrap metal. Get scrap metal from old junk cars you have. Save old appliances like refrigerators and ovens. Look for old electronics around your home or on the side of the street and collect them. Save aluminum cans. Old laptops, computer towers, and cell phones can also have scrap metal inside them. [1] X Research source"
    },
    {
      "title": "Start sorting your scrap when you have enough to fill your bins.",
      "content": "Start sorting your scrap when you have enough to fill your bins. Save yourself time by waiting until you have a lot of scrap to sell instead of making several trips to the scrap yard with smaller loads. You can also sort your scrap into bins as you collect it and then take it to the scrap yard once your bins are full."
    },
    {
      "title": "Hold onto any car batteries you find.",
      "content": "Hold onto any car batteries you find. Car batteries contain lead, so scrap yards will buy them. If you're scrapping an old junk car, set the battery aside in its own pile. Take it with you to the scrap yard when you bring your other metals. [2] X Research source"
    },
    {
      "title": "Save car radiators.",
      "content": "Save car radiators. Car radiators can contain aluminum and brass. Separate radiators with brass from radiators with aluminum before you take them into the scrap yard. [3] X Research source"
    },
    {
      "title": "Store whole appliances to bring to the scrap yard.",
      "content": "Store whole appliances to bring to the scrap yard. Many scrap yards will buy appliances, like refrigerators, from you and take them apart for the scrap inside. Don't worry about extracting the scrap metal from appliances yourself. [4] X Research source"
    },
    {
      "title": "Bring whole air conditioning units to the scrap yard.",
      "content": "Bring whole air conditioning units to the scrap yard. Don't worry about taking the units apart yourself. Stockpile any AC units you find and bring them to the scrap yard along with all your sorted metals. [5] X Research source"
    },
    {
      "title": "Collect whole computer towers.",
      "content": "Collect whole computer towers. Taking apart computer towers for the scrap metal inside is time consuming, and it won't get you more money than selling the tower as a whole unit. Set aside any computer towers you find and bring the whole units with you to the scrap yard. [6] X Research source"
    },
    {
      "title": "Get a scrap magnet online.",
      "content": "Get a scrap magnet online. A scrap magnet is a powerful magnet you can use to sort ferrous and non-ferrous metals. A regular household magnet won’t work. You’ll need to get a scrap magnet to properly sort your metals. [7] X Research source"
    },
    {
      "title": "Test each piece of scrap metal with the magnet.",
      "content": "Test each piece of scrap metal with the magnet. Place the magnet against the surface of the scrap metal. Pull the magnet away. If the scrap metal sticks to the magnet, it’s a ferrous metal. If it doesn’t stick, it’s non-ferrous. [8] X Research source"
    },
    {
      "title": "Separate ferrous and non-ferrous metals into two piles.",
      "content": "Separate ferrous and non-ferrous metals into two piles. This will make it easier to sort through the metals later. Ferrous metals always contain iron. You’ll know that your pile of ferrous metal is mostly all iron. Then you’ll just need to sort through the non-ferrous pile of metals. [9] X Research source The metals in the non-ferrous pile will likely be more valuable. They could include metals like aluminum, lead, copper, and brass."
    },
    {
      "title": "Check pipes and wires for copper.",
      "content": "Check pipes and wires for copper. Copper has a reddish brown color. If you come across any copper, place it in the container labeled “copper.” [10] X Research source"
    },
    {
      "title": "Sort yellow metals into the “brass” bin.",
      "content": "Sort yellow metals into the “brass” bin. Most of the yellow metals you encounter are likely brass. Don’t confuse brass with gold. Gold has more of a brown color to it than brass, and it's rarer to come by. Brass is commonly found in pipe fittings, valves, bullet casings, faucets, and doorknobs. [11] X Research source"
    },
    {
      "title": "Look for aluminum in cars, boats, and building materials.",
      "content": "Look for aluminum in cars, boats, and building materials. Aluminum is a lightweight and silver metal. Check over aluminum with your scrap magnet to make sure there’s no iron attached. If there is, remove it before you take it to the scrap yard or you won’t get full price for your aluminum. [12] X Research source Other places you might find aluminum are window frames, airplanes, bikes, and wheelchairs."
    },
    {
      "title": "Check heavy items for dark gray lead.",
      "content": "Check heavy items for dark gray lead. Piping is commonly made out of lead. You can also find lead in the wheel weights on cars, in wiring, and in lead batteries. [13] X Research source"
    },
    {
      "title": "Look for stainless steel in your scrap.",
      "content": "Look for stainless steel in your scrap. Stainless steel is silver and usually very reflective. Check for stainless steel in household appliances and cooking supplies like pots and pans. [14] X Research source"
    },
    {
      "title": "Store the containers of metal in a safe place until you sell them.",
      "content": "Store the containers of metal in a safe place until you sell them. Don't leave the containers outdoors where someone could steal them. Keep them locked in your home or garage. You can also keep your scrap metal in a storage container until you're ready to visit the scrap yard."
    }
  ]
}