{
  "url": "https://www.wikihow.com/Tackle-in-Football",
  "title": "How to Tackle in Football",
  "steps": [
    {
      "title": "Keep your feet shoulder-width apart.",
      "content": "Keep your feet shoulder-width apart. To tackle properly and safely, you always need to maintain good tackling form, staying low and striking with a wide base. To learn the correct form, start by keeping your feet shoulder width apart, your knees flexed slightly. [1] X Research source"
    },
    {
      "title": "Keep your shoulders back.",
      "content": "Keep your shoulders back. To give yourself the most power and the most control in your tackles, work on keeping your shoulders back and down. It might feel kind of silly, like you're jutting your chest out and standing like a duck, but practice standing with a wide, strong base and keeping your shoulders back."
    },
    {
      "title": "Get low.",
      "content": "Get low. [2] X Research source Proper tackling form involves getting low and keeping a roughly 45 degree angle with your back, which should be straight because your shoulders are back. Squat with your feet still shoulder width apart and bring your hands up into what is sometimes called the \"Breakdown\" position, your basic tackling form."
    },
    {
      "title": "Buzz your feet.",
      "content": "Buzz your feet. As you move, you'll want to take many small quick steps when you're getting ready to tackle. Some coaches call this \"buzzing\" the feet, taking small, quick steps in forward progress. Practice shuffling sideways, forward and back in this basic position, keeping your feet moving and bouncing at all times. You need to be able to spring in any direction at any moment, especially when you're defending the run. The first fundamental of tackling is getting mobile in this position."
    },
    {
      "title": "Keep your head up at all times.",
      "content": "Keep your head up at all times. When you're moving, when you're tackling, when you're on the other side of the field from the ball, you need to have your head back and your eyes up at all times on the football field. [3] X Research source You need to maintain what is called the \"laconic position,\" in which your neck is flexed back slightly, not perfectly straight so your eyes are pointed down. Doing this will keep your eyes up, giving you a good sight of the field, and will keep your neck safe during play. Dropping your head during a tackle or leading with your helmet can result in injury, paralysis, or death. This is a crucial part of proper tackling form."
    },
    {
      "title": "Accelerate to the ball.",
      "content": "Accelerate to the ball. On the field, run as you normally would and then drop into your breakdown position, feet buzzing, any time a player you need to tackle gets close. Usually, you'll want to do this when you're in a bubble of 3 or 4 steps from your opponent. [4] X Research source Dropping into breakdown will decelerate you, making you more accurate in your tackle, setting you up for a well-timed and on-point hit."
    },
    {
      "title": "Shoot from your breakdown position.",
      "content": "Shoot from your breakdown position. Most of the power that comes from your tackle will come from springing forward into the ball carrier with your hips. Because you're low with a wide center of gravity, you've got the ability to spring from your core and stop their forward progress, as long as you're tackling correctly. As you prepare to tackle, take one plant step and ensure that your head and eyes are up before spring into the next step in the tackle. Have a coach or other player check your hit prep step to make sure your back is straight, your butt is out, and your eyes are up. Tackling has much less to do with arm strength or speed and much more to do with proper form. A very strong player with poor fundamentals won't be as good a tackler as a player who maintains good form and strikes correctly."
    },
    {
      "title": "Shoot 'n rip.",
      "content": "Shoot 'n rip. From your plant step, you'll explode up and into the player you're tackling, bringing both of your arms up and under his arms, and both of your hands up behind his back. Bringing your arms up will help take the player off the ground, forcing them to lose their momentum, balance, and footing. When executing a proper rip, your hands should end up somewhat higher than your eyes. Both of your arms should move up and pull back after you've ripped. Hugging the player back into you. Always keep your head up and eyes on the ball carrier. As you make impact with your shoulder your arms keep your face-mask up and your eyes to the sky."
    },
    {
      "title": "Drive into the tackle.",
      "content": "Drive into the tackle. After you've accelerated into a well-timed rip, let your legs do the rest of the work. Pump your legs hard to push him backwards and up, taking him off his feet and to the ground. [5] X Research source"
    },
    {
      "title": "Watch the other player's hips.",
      "content": "Watch the other player's hips. Most jukes or other fake-outs that'll leave you tackling nothing but air are done with feet and the upper-body movements. The hips don't lie. Watch the player's belt-bucklet to see which direction he's progressing and anticipate his movement. Maintain good breakdown position and keep your feet buzzing to be able to shift direction and catch up with his movements. [6] X Research source"
    },
    {
      "title": "Stay wrapped.",
      "content": "Stay wrapped. If you execute a good rip and your player doesn't go down or get taken off his feet, stay with him for as long as possible, wrapping up and holding on. If you slip down, that's ok, just keep holding on to his waist, legs, or feet to slow him down as much as possible and wait for the cavalry to arrive. Don't try to do anything fancy, just stay wrapped up and deadweight the other player to make it as difficult as possible to move."
    },
    {
      "title": "Keep your hands free of the face mask.",
      "content": "Keep your hands free of the face mask. When tackling from the side or behind, it's a possibility that'll you'll unintentionally get your hand wrapped up in the other player's face mask, which is a serious penalty at all levels. Do your best to stay clear of the face mask by keeping your hands in fists as you tackle. Your fingers won't do much for you during a well-executed tackle, so you might as well keep them safe by tucking them in and avoiding a risky penalty or injury."
    },
    {
      "title": "Don't leave your feet.",
      "content": "Don't leave your feet. Whether you're a linebacker or a safety, it's important to stay on your feet and maintain good breakdown position to make accurate and powerful tackles. Don't jump unless you're defending a pass, and only tackle up and back, executing accurate rips. Watching games on Sunday, you might see players in the backfield flying around, parallel to the ground, making highlight reel helmet shots that are both spectacular and inaccurate, as well as extremely dangerous and illegal. These players are taking lazy shortcuts and getting lucky."
    },
    {
      "title": "Worry about stripping the ball last.",
      "content": "Worry about stripping the ball last. Many players get excited about causing a fumble and start immediately pounding at the ball, trying to tear it loose as soon as they make contact, allowing the offensive player to gain extra yardage. Worry less about the highlight reel and worry more about taking the player to the ground. Shoot and rip. [7] X Research source"
    }
  ]
}