{
  "url": "https://www.wikihow.com/Survive-Being-a-Single-Mother",
  "title": "How to Survive Being a Single Mother",
  "steps": [
    {
      "title": "Take steps to ensure that you are taking care of yourself.",
      "content": "Take steps to ensure that you are taking care of yourself. [1] X Research source If you are struggling and feeling depressed, don't be afraid to seek help from friends, family or a health care professional."
    },
    {
      "title": "Make time for yourself to create and clarify your values.",
      "content": "Make time for yourself to create and clarify your values."
    },
    {
      "title": "Remember that society is filled with many good, kind, loving people.",
      "content": "Remember that society is filled with many good, kind, loving people. [2] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Make sure to have only friends who are of sound mind and can make healthy decisions care for your child in your absence."
    },
    {
      "title": "Consider the skills that you already possess.",
      "content": "Consider the skills that you already possess. Are you a good reader? Are you a good communicator?, Do you know more than one language?"
    },
    {
      "title": "Look to close family, universities, and social agencies for assistance.",
      "content": "Look to close family, universities, and social agencies for assistance. They may be able to help you with food, clothing, medical needs, shelter, and future education for yourself. [3] X Research source"
    },
    {
      "title": "Don't let anyone take advantage of you and force you into a decision.",
      "content": "Don't let anyone take advantage of you and force you into a decision. Remember, you are the mother. As long as you have a love for your child, you have strong morals, and you behave in a legally responsible manner, all should work out for the best."
    },
    {
      "title": "Look for hospitals that can refer you to child crisis centers.",
      "content": "Look for hospitals that can refer you to child crisis centers. See if these hospitals can also refer you to social workers, or other social agencies."
    },
    {
      "title": "Your safety and the safety of your children is the top priority.",
      "content": "Your safety and the safety of your children is the top priority. [4] X Research source"
    },
    {
      "title": "Remind yourself that you will succeed.",
      "content": "Remind yourself that you will succeed. Know that while it might take a great deal of time to finish college while being a single parent, you can accomplish your goals."
    },
    {
      "title": "Use these grants for food, housing, and school if necessary.",
      "content": "Use these grants for food, housing, and school if necessary. [5] X Research source"
    },
    {
      "title": "The opinions of critical people don't matter.",
      "content": "The opinions of critical people don't matter. [6] X Research source"
    },
    {
      "title": "Cleanliness means health.",
      "content": "Cleanliness means health."
    },
    {
      "title": "Take infant and child CPR classes from the local Red Cross or hospital.",
      "content": "Take infant and child CPR classes from the local Red Cross or hospital. You can also learn CPR from a volunteer firefighter or EMT. [7] X Research source"
    },
    {
      "title": "Many times, these classes will cost nothing if you speak to the receptionist.",
      "content": "Many times, these classes will cost nothing if you speak to the receptionist. The Red Cross can not deny anyone classes for lack of ability to pay. The classes can be a life saver. Remember, parenting is a learned skill."
    },
    {
      "title": "You are the architect of your life.",
      "content": "You are the architect of your life."
    },
    {
      "title": "Respecting yourself helps you create a character-building environment for your child.",
      "content": "Respecting yourself helps you create a character-building environment for your child."
    },
    {
      "title": "When you get lonely, paint, draw, read, sing, or mend something.",
      "content": "When you get lonely, paint, draw, read, sing, or mend something. You can also call a friend or family member. [8] X Research source"
    },
    {
      "title": "That is a continuum that is ever-evolving.",
      "content": "That is a continuum that is ever-evolving."
    }
  ]
}