{
  "url": "https://www.wikihow.com/Treat-a-Rattlesnake-Bite",
  "title": "How to Treat a Rattlesnake Bite",
  "steps": [
    {
      "title": "Move away from the rattlesnake.",
      "content": "Move away from the rattlesnake. If the snake feels threatened, it can strike again. Therefore, the person who was bitten should move out of range of the snake. [1] X Research source Get at least 20 feet (6.1 m) away from the snake."
    },
    {
      "title": "Get medical attention.",
      "content": "Get medical attention. It's important to seek medical attention as quickly as possible. Most hospitals will have an appropriate antivenom, and most treatments attempted by people before the hospital do not help much. If you're in an area where you can call an ambulance, that is your best option. If not, try to find help to take you or the injured person to the nearest hospital. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Even if you're not sure if you were bitten by a rattlesnake, it's important to go to the hospital immediately. It's better to be at the hospital if you start to exhibit symptoms of the venom entering your body."
    },
    {
      "title": "Keep the affected area below the heart.",
      "content": "Keep the affected area below the heart. If you place the area above the heart, the blood containing venom will spread more quickly. [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Keep the person immobile.",
      "content": "Keep the person immobile. If possible, keep the person from moving until help arrives. Movement increases blood flow, spreading the venom more readily. Therefore, you or the person bitten should try to minimize movement as much as possible. [4] X Research source Of course, if you are alone, it is more important to find help than to stay immobile."
    },
    {
      "title": "Remove clothing and jewelry.",
      "content": "Remove clothing and jewelry. The area around a snakebite can swell significantly, so cut away or take off any clothing near the bite. Also, remove jewelry from the area, as well. If it is not taken off before the area swells, it can constrict blood flow, and jewelry may need to be cut off. [5] X Research source"
    },
    {
      "title": "Let the wound bleed.",
      "content": "Let the wound bleed. Allow the bite to bleed freely for about half a minute. This process may allow some of the venom to flow out of the wound."
    },
    {
      "title": "Use a pump suction device.",
      "content": "Use a pump suction device. It is good to try to suck out the venom, but only if you have a device made for that purpose. The pump will come with instructions on how to use it, but basically, you place the pump over the bite to help suck out the venom."
    },
    {
      "title": "Place a clean bandage on the wound.",
      "content": "Place a clean bandage on the wound. Don't wash the wound, as that can remove the venom from your skin. The medical professionals may be able to use what's on your skin to assist in your treatment, by allowing them to figure out what kind of rattlesnake you were bitten by. [6] X Research source"
    },
    {
      "title": "Tie a splint or sling around the limb.",
      "content": "Tie a splint or sling around the limb. A sling or splint can help keep the wound immobile, helping to slow the blood flow to the area. In turn, that can keep the venom from spreading as much. [7] X Research source To make an arm sling, make a triangle out of fabric by folding it or cutting it. Wrap the triangle around the arm with the elbow at the middle point. Your arm or the person's arm should be bent at the elbow to fit into the sling. Tie the other two ends together around the shoulder. Let the hand stick out at the base of the triangle. Find items to support the limb, such as sticks, rolled-up newspapers, or even rolled-up fabric. Lay the supports alongside the limb, trying to incorporate a joint above and below the wound. Secure the supports to the limb with whatever you have on hand, from belts to tape to bandages. Don't wrap around the wound; wrap on either side of it. If the wound swells too much, you may need to decrease the pressure of the splint."
    },
    {
      "title": "Soothe the person.",
      "content": "Soothe the person. Talk to them. Ask them questions to help keep their mind off the bite. Anxiety and panic can increase the heartbeat and make it easier for the venom to spread. [8] X Research source If you're the one who's been bitten, try to remain calm. Take a few slow, deep breaths to help soothe your nerves. You can also call Poison Control services while you wait."
    },
    {
      "title": "Watch for swelling and discoloration.",
      "content": "Watch for swelling and discoloration. One of the easiest ways to tell the bite was most likely venomous is to watch for the area to swell. It may also change colors. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Another indication of a venomous snakebite is one to two puncture wounds rather than a row of small punctures, indicating smaller teeth. Dizziness, pain at the site, blurred vision, and prickling in other parts of the body are also signs of a venomous bite, as well as heavy sweating."
    },
    {
      "title": "Look for signs of shock.",
      "content": "Look for signs of shock. One symptom is paleness. Other signs of shock include rapid heartbeat, fast breathing, nausea, and dizziness. Also, look for a person's pupils getting larger. [10] X Research source If the person starts to go into shock, lay them down on their back, raising their feet up at least a foot. Also, keep the person warm by wrapping them in a blanket or an extra layer of clothing. Start CPR if the person does not show signs of life, such as breathing, coughing or movement."
    },
    {
      "title": "Avoid alcohol or caffeine.",
      "content": "Avoid alcohol or caffeine. These substances make your body take in the venom more quickly. Therefore, do not drink these beverages immediately after having been bitten by a rattlesnake. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Don't cut the wound.",
      "content": "Don't cut the wound. Popular belief suggests cutting the bites can help release the venom. However, tests have proven that this method doesn't help, and you can infect the wound if you use a dirty knife. [12] X Research source"
    },
    {
      "title": "Don't suck the wound with your mouth.",
      "content": "Don't suck the wound with your mouth. By sucking, you introduce the venom to your mouth. Also, your mouth is bacteria-ridden, so you could also infect the bite with germs from your mouth. [13] X Research source In fact, within 15 minutes, the venom has already entered the lymphatic system, so sucking after this point is useless."
    },
    {
      "title": "Don't apply a tourniquet.",
      "content": "Don't apply a tourniquet. A tourniquet cuts off blood flow to the limb. This advice was given in the past, as it was thought to stop the venom from traveling to the rest of the body. However, it often does more harm than good."
    },
    {
      "title": "Don't apply ice or immerse the wound in water.",
      "content": "Don't apply ice or immerse the wound in water. It's important to keep preserve the viable tissue for as long as possible. Using ice or water would not help the preservation because it would slow blood circulation."
    },
    {
      "title": "Don't pee on the bite.",
      "content": "Don't pee on the bite. A common myth is to urinate on the bite to help neutralize toxins. Urine will not help the bite. Instead, spend that time getting to the hospital. [14] X Research source"
    },
    {
      "title": "Don't give the person anything to eat or drink while waiting for care.",
      "content": "Don't give the person anything to eat or drink while waiting for care. This includes medication and alcohol. You want to keep the metabolism low."
    }
  ]
}