{
  "url": "https://www.wikihow.com/Store-Coconut-Oil",
  "title": "How to Store Coconut Oil",
  "steps": [
    {
      "title": "Store the coconut oil in a dark container.",
      "content": "Store the coconut oil in a dark container. If you purchased coconut oil that came in a clear jar or bottle, transfer it to a dark container to protect it from light. You should also place the coconut oil in a dark place in your kitchen or pantry so it's not exposed to sunlight. [1] X Research source Avoid storing the coconut oil in reactive metal containers since these may add an undesirable flavor to the coconut oil."
    },
    {
      "title": "Store the coconut oil in a cool, dry place.",
      "content": "Store the coconut oil in a cool, dry place. Place the coconut oil in your pantry, cupboard, or any dry, cool space in your kitchen. Try to find a storage space that's below 75 °F (24 °C) to prevent the oil from melting. It's common for coconut oil to melt since it has such a low melting point. Don't worry; this won't damage the oil. For example, avoid storing the oil in the bathroom even if you'll be using the coconut oil for beauty products. Bathroom temperature can fluctuate and introduce moisture into the oil. You should also avoid storing the oil in the attic or garage."
    },
    {
      "title": "Refrigerate the oil to firm it up.",
      "content": "Refrigerate the oil to firm it up. If your coconut oil melts and you want to return it to a solid state, place the container in the refrigerator for several hours. Chill the coconut oil until it's the texture you want. [2] X Research source You can store the coconut oil in the refrigerator all the time, but it will become completely solid."
    },
    {
      "title": "Store the coconut oil at a constant temperature.",
      "content": "Store the coconut oil at a constant temperature. Heating and chilling the coconut oil frequently can cause it to go bad faster. Instead, choose one storage space or temperature for the coconut oil and keep it there. [3] X Research source Don't worry if you got home from the store to find that the jar of coconut oil melted on the way. You could stick it in the fridge until it firms up a little and then store it in the pantry."
    },
    {
      "title": "Secure the lid on the jar or container.",
      "content": "Secure the lid on the jar or container. Even if you don't transfer the coconut oil to a dark jar or bottle, you'll need to keep it in a container with a tight fitting lid. Ensure that the lid is pressed down or screwed on tight to prevent oxygen from spoiling the oil. If it takes you a long time to finish a bottle or tub of coconut oil, consider transferring the oil to a smaller container once you've used about half of it. This will reduce the amount of oxygen that comes into contact with the oil."
    },
    {
      "title": "Use clean, dry utensils to scoop into the oil.",
      "content": "Use clean, dry utensils to scoop into the oil. When you go to use the coconut oil, ensure that the spoon, measuring cup, or knife that you use is completely dry. Utensils that are wet or dirty can introduce bacteria into the coconut oil which will cause it to spoil faster."
    },
    {
      "title": "Check the coconut oil every few months.",
      "content": "Check the coconut oil every few months. Since coconut oil can be stored for several years, it's important to look it over for mold or signs that it's become rancid. Look at the coconut oil every month or two and discard the coconut oil if you see or smell: [4] X Research source An unpleasant odor. Yellowish color. Brown or green flecks of mold. Chunky or curdled consistency."
    },
    {
      "title": "Cook and sauté with coconut oil.",
      "content": "Cook and sauté with coconut oil. Use a few spoonfuls of coconut oil in place of cooking or vegetable oil. Melt a little of the coconut oil in a skillet and sauté your favorite vegetables or meats. You can also stir melted coconut oil into mashed potatoes or sweet potatoes. [5] X Research source Avoid leaving the coconut oil out next to the stove while you cook. The heat from the stove could melt the oil. The coconut oil will give a mild, tropical flavor to your meals."
    },
    {
      "title": "Bake with coconut oil.",
      "content": "Bake with coconut oil. Replace butter or cooking oil with coconut oil in your favorite baking recipes. For example, substitute coconut oil in recipes for biscuits, cakes, cookies, or muffins. [6] X Research source You may be able to buy coconut oil in stick form which makes it easy to cut and measure. Look for this in the refrigerator section of the grocery store. Set the sticks out at room temperature to soften a little before you bake with them."
    },
    {
      "title": "Use coconut oil in homemade beauty products.",
      "content": "Use coconut oil in homemade beauty products. For simple beauty treatments, warm coconut oil between your palms and run the oil through your hair. Rinse it out for shiny, healthy-looking hair. You can also use coconut oil instead of lotion to moisturize dry skin. [7] X Research source If you use coconut oil every day for beauty products, you may want to transfer some oil into a small container. You can store the smaller container in the bathroom if you know you'll be using the oil quickly (within a week). Consider mixing coconut oil in with essential oils to create lip balms or salves."
    },
    {
      "title": "Fry foods with coconut oil.",
      "content": "Fry foods with coconut oil. Heat a large pot of coconut oil instead of peanut, canola, or vegetable oil. Use the hot oil to fry a variety of foods. For example, you can fry chicken strips, french fries, or fish. [8] X Research source You can cool and reuse the coconut oil for frying. Discard the oil after using it a few times. Remember to move the coconut oil container away from the skillet of hot oil or it may melt the rest of your coconut oil."
    }
  ]
}