{
  "url": "https://www.wikihow.com/Write-a-Letter-to-Your-Teacher",
  "title": "How to Write a Letter to Your Teacher",
  "steps": [
    {
      "title": "Choose a card or paper that you think your teacher will like.",
      "content": "Choose a card or paper that you think your teacher will like. You can write your letter on a premade card or on a white sheet of paper. If you’re using a card, pick one that makes you think of your teacher. Ask your parents or guardian if they have any cards you can use. They may also be willing to take you shopping for a new card. You could also make a card for your teacher using either plain printer paper or construction paper. Your teacher will appreciate the effort you put into the card."
    },
    {
      "title": "Write your name and the date in the upper right corner.",
      "content": "Write your name and the date in the upper right corner. Include your first and last name. The date will help your teacher know when you wrote the letter. [1] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Your teacher may cherish the letter for years to come. Including your name and the date will help them remember who wrote the letter."
    },
    {
      "title": "Start your letter with “Dear” followed by your teacher’s name.",
      "content": "Start your letter with “Dear” followed by your teacher’s name. This is a polite form of greeting known as a salutation. Include the title you use for your teacher, such as Mr., Mrs., Miss, Ms., or Coach. [2] X Research source Use the name your teacher prefers. If your teacher has asked you to call them by their first name, then it’s fine to use their first name in your letter. For example, if you call your teacher Coach Sue, then you can say, “Dear Coach Sue.” Don’t start your letter with “hi” or “hey.” It’s too informal."
    },
    {
      "title": "Write a comma after your teacher’s name, then skip a line.",
      "content": "Write a comma after your teacher’s name, then skip a line. This is the traditional way of opening a letter, and skipping a line makes it easier for your teacher to read what you write. Now that your opening is complete, you are ready to write your message to your teacher."
    },
    {
      "title": "Start with 1 to 2 sentences telling your teacher what the letter is about.",
      "content": "Start with 1 to 2 sentences telling your teacher what the letter is about. This will tell your teacher what to expect from the letter. For example, you may be writing your teacher a letter of appreciation . [3] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source Say, “I am writing this letter to tell you how happy I am to be in your class because you are the best teacher. This year has been hard, but you helped me do my best.”"
    },
    {
      "title": "Give your teacher a few examples of what you appreciate about them.",
      "content": "Give your teacher a few examples of what you appreciate about them. Consider why you are writing the letter, then choose the best examples to show your teacher what it is that you appreciate about them. To make your letter more personal, be specific and tell them how their actions made you feel. [4] X Research source You could write, “I appreciate the time you spent tutoring me after school. I felt like I would never understand multiplication, but you never let me give up. I’m so happy you’re my teacher!” If you’re having trouble deciding what to say, grab a sheet of scratch paper and do some brainstorming . Write down reasons why you like your teacher, times that they’ve helped you, or what you’ve learned from them. Then pick a few of your favorite reasons and use those in your letter."
    },
    {
      "title": "Finish the body of your letter by thanking them again.",
      "content": "Finish the body of your letter by thanking them again. Write 1 to 3 sentences that sum up what you’ve said. Remind your teacher that you are appreciative of what they’ve done for you. [5] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source You could say, “Thank you for being a great teacher this year. I’m so happy I got to be in your class. I hope you have an incredible summer!”"
    },
    {
      "title": "Close and sign your letter.",
      "content": "Close and sign your letter. Pick a polite closing, like “sincerely,” “best,” “thank you,” or “yours truly.” Then, skip 1 or 2 lines and sign your name. [6] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Your closing should look something like this: “Sincerely, Brian.”"
    },
    {
      "title": "Proofread your letter.",
      "content": "Proofread your letter. Read over your letter once or twice to catch any spelling or grammar mistakes. Then, ask a trusted adult to do the same. You may be able to fix some small mistakes. However, if you find yourself crossing out whole sentences, it’s probably a good idea to start fresh so your letter looks nice and neat. White-out can be helpful in correcting mistakes."
    },
    {
      "title": "Put your letter in an envelope.",
      "content": "Put your letter in an envelope . Ask your parents or guardian for an envelope and slip your letter inside. If you’re giving your letter to your teacher in person, just write their name on the front and hand it to them before or after class."
    },
    {
      "title": "Address your envelope",
      "content": "Address your envelope if you want to mail your letter. Ask your parents or guardian to help you address the envelope using the correct address and formatting specific to your country. The envelope should include your teacher’s address in the center and your own address in the top left corner. If your handwriting is a little messy, it might be a good idea to ask an adult to write your teacher’s address for you so your letter doesn’t get lost in the mail. Don’t forget to ask your parents or guardian for a stamp."
    }
  ]
}