{
  "url": "https://www.wikihow.com/Treat-Your-Sick-Hamster",
  "title": "How to Treat Your Sick Hamster",
  "steps": [
    {
      "title": "Look for signs that your hamster is ill.",
      "content": "Look for signs that your hamster is ill. If you spot behavior that is different from the norm, monitor the hamster even more closely. This could be your first hint that he is about to become sick. Look for signs of the following: Is your hamster sleeping longer than usual? Keep in mind that old hamsters naturally sleep longer. Has your hamster lost his appetite? Does he no longer groom himself? Is he irritable? When awake, is he slow moving, or does he have a hard time getting around? Has your hamster lost any of his fur, or have bald spots? Keep in mind that this is normal for older hamsters. Does he have a wet chin or throat? This can be a sign of dental problems. Does he have difficulty eating, such as dropping food out of his mouth? Does he have a runny nose, teary eyes, or wet bottom? Do his droppings look different? Hamster droppings should be rod-shaped. Watery droppings indicate too much fresh fruits and vegetables. Hard, dry droppings indicate not enough."
    },
    {
      "title": "Keep him warm.",
      "content": "Keep him warm. There may be situations where you hamster just feels unwell. There are some general things you can do to help nurse your hamster back to health. Make sure to keep him warm. Sick hamsters often lose body heat and feel cool to the touch. You can try standing the cage on a hot water bottle so that he gets under floor heating. Also try wrapping a small hot water bottle in a towel and rest the hamster on it. Be careful to do this in an escape proof box so the hamster doesn't run off."
    },
    {
      "title": "Check for dehydration.",
      "content": "Check for dehydration. If he is not eating or drinking, or if he has wet tail, he will quickly become dehydrated. You will get a clue this has happened if you gently pinch his scruff and let go. If the scruff stays in a peak, then he is dehydrated. You can give him ordinary water, or purchase a fluid-replacement powder designed as a supplement for people with diarrhea, such as Pedialyte or Dioralyte. Make this up as advised on the instructions."
    },
    {
      "title": "Drip fluids to him.",
      "content": "Drip fluids to him. If your hamster won’t drink this on his own, obtain a 1 mL syringe. Hang a drop of the fluid on the end of the syringe and hold it to the hamster's lips. Hopefully he will lick it off. If he doesn't, then wet the fur around his mouth so that he grooms himself and takes in the fluid. Be extremely cautious about syringing fluid into his mouth. His small size makes it likely you will flood his mouth and he may inhale the fluid, taking it down into his lungs, which can cause serious pneumonia."
    },
    {
      "title": "Respond to respiratory problems.",
      "content": "Respond to respiratory problems. If the hamster has a discharge from his eyes or nose, if he sneezes, or if he is hunched up and breathing using his stomach muscles, then he may have respiratory disease. There are certain things you can do to help with this. Make sure his bedding is clean at all times. Bedding soiled with urine gives off ammonia, which is extremely irritating to the respiratory system. Use a spoon or a scoop to spot clean any wet bedding, and make sure the cage smells clean. If you can smell urine or ammonia, then the effect is a thousand times worse for the hamster. Spot clean every day, but try to do this in such a way that it does not disturb your hamster too much and add to his stress. Check that the room temperature is within the recommended range and make adjustments accordingly. If the hamster has a sticky nose, try and wipe it clean with a damp cotton ball. This helps to keep the airway clear, which makes it more comfortable for the hamster to breath."
    },
    {
      "title": "Help with dental problems.",
      "content": "Help with dental problems. Teeth problems can make your hamster feel unwell. A clear or milky discharge from the eyes can be a sign of overgrown teeth roots. Check to see if your hamster is eating properly. If he isn't, then a vet check is advisable to make sure there isn't a problem with overgrown teeth. If there is a problem with this, the vet can trim them back. If this is the case and the teeth are not trimmed, the hamster may progressively starve because he is unable to eat. Another sign of dental problems is a wet chin or neck. This happens when spurs of teeth dig into the cheek or tongue, making it painful to swallow. Prevention is easier than a cure. This means you should give your hamster suitable items to chew on in order to keep his teeth short. Avoid giving too many soft foods, such as strawberries or bananas, to your hamster because they don't need much chewing. Instead, give him dry pelleted food and a block of wood for him to gnaw on. Also give him cardboard tubes or boxes, which will keep his teeth healthy. Plus, he will love to demolish them. [1] X Research source"
    },
    {
      "title": "Treat digestive disorders.",
      "content": "Treat digestive disorders. If your hamster has a wet tail, he will have a wet bottom and will be slower and crankier. Act immediately because this can be deadly. Wet tails come from dirty cages, so you should keep his cage very clean. To treat this issue, get a broad spectrum antibiotic immediately from your vet. If your hamster has diarrhea, stop feeding him fruits and vegetables until he is better. This condition is usually caused by intestinal or stomach blockage. The best way to avoid this is to provide some alfalfa as part of his diet. Constipation is caused by lack of water in his diet. Make sure fresh water is available for him at all times. If your hamster does become constipated, give him some carrots or other fresh fruits or vegetables as well as more water. [2] X Research source"
    },
    {
      "title": "Take care of broken bones.",
      "content": "Take care of broken bones. There are levels of breakage that can either be deadly or be healed. If your hamster breaks a leg where you can see bones sticking out, he must visit the vet. If it isn’t too bad, the vet may dress it and bandage the wound. If it is a really bad fracture with broken skin, he may need to be humanely euthanized. If the leg is at an odd angle but the bones are not exposed and he is eating and otherwise looks healthy, restrict him to one part of the cage for 4 weeks and take away his wheel. This forces him to rest so he doesn't use the leg. This gives the bones the best chance of knitting together. You may also take him to the vet and let him bandage his leg, though he will likely also recommend limiting your hamster’s movements in his cage. Never give pain relief to your hamster unless prescribed for the hamster by the vet. His small size makes overdose extremely likely. [3] X Research source"
    },
    {
      "title": "Keep a close eye on your hamster at all times.",
      "content": "Keep a close eye on your hamster at all times. This will help you get to know what is normal for your hamster. Check him at least twice a day and get used to how much he eats every day, how much he drinks, how active he is and when he most likes to play. By knowing this, it helps you spot when things aren't right, such as his appetite has dropped off or he's drinking more than he did. Knowing these small details will help you spot any possible sickness early in your hamster if it manifests in his daily routine."
    },
    {
      "title": "Stress your hamster as little as possible.",
      "content": "Stress your hamster as little as possible. Stress puts a strain on the immune system, which makes your hamster less able to fight off infection and get himself well again. Stress to a hamster includes feeling threatened or unsafe, so make sure the family cat or dog can't sit staring at him for hours on end. Consider covering half of the cage with a towel so the hamster has privacy and can retreat to a safe area if he needs to. Avoid loud noises, which can also frighten your hamster. Avoid anything in the air that could put a stress on its respiratory system, such as tobacco smoke or spray air fresheners."
    },
    {
      "title": "Limit extremes of temperature.",
      "content": "Limit extremes of temperature. The ideal room temperature for a hamster is between 68 to 72 degrees. If it is very hot, the hamster can suffer from heat stress, so make sure there is a fan blowing near the cage in order to circulate air and cool him off. Very low temperatures below 50 degrees, especially for more than 24 hours, can trigger the hamster to go into hibernation. This makes them go to sleep and they are not able to wake up when you stimulate them, so it can appear the hamster is dead. If you suspect this is the case, put the hamster in a hamster safe box, such as his carry case, and pop him in the airing cupboard for a few days. Hamster that went into a state of hibernation will wake with this method."
    }
  ]
}