{
  "url": "https://www.wikihow.com/Stop-Bed-Bug-Bites-Immediately",
  "title": "How to Stop Bed Bug Bites Immediately",
  "steps": [
    {
      "title": "Try a steamer.",
      "content": "Try a steamer. One of the immediate ways to kill bed bugs is to steam them out. They cannot survive the steam, so any that you can see, you can steam. Use a handheld steamer to blow steam at the bugs. However, be warned. This solution will only kill the ones you can see, not ones buried down in crevices. Bed bugs like to hide. [1] X Research source"
    },
    {
      "title": "Vacuum your mattress.",
      "content": "Vacuum your mattress. Strip your bed of its bedding, and store it in a double trash bag. Vacuum your mattress and box springs as best you can, including underneath both. [2] X Research source Dealing with your mattress first is the most immediate thing you can do. Since bed bugs bite at night, you need to clear your sleeping area of bed bugs if possible by vacuuming and encasing the mattress, then isolate the bed from more bed bugs."
    },
    {
      "title": "Pick an encasement for your mattress.",
      "content": "Pick an encasement for your mattress. The encasement should be one that is meant to keep out bed bugs. It should also be strong enough to not rip. [3] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Cover your mattress and box springs.",
      "content": "Cover your mattress and box springs. Cover both your mattress and box springs with individual encasements. Bed bugs cannot move in and out of these casings, stopping the ones inside from biting you. The ones inside will eventually die, and the ones outside will have lost a place to hide. You should keep it on for a year. [4] X Research source"
    },
    {
      "title": "Throw out the cover if it rips.",
      "content": "Throw out the cover if it rips. If your cover becomes torn, throw it out, and replace it. Bed bugs can move through small openings. [5] X Research source"
    },
    {
      "title": "Wash your bedding.",
      "content": "Wash your bedding. Wash your bedding in very hot water, rinse it in hot water, as well. Then dry it on a hot setting. The hot water should kill any bed bugs in the bedding. [6] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Be sure to discard the bags the bedding was in outside, so the bed bugs aren't in your house."
    },
    {
      "title": "Place clothes in black trash bags.",
      "content": "Place clothes in black trash bags. Set the bags in the sun on a hot afternoon. The heat should kill any bed bugs inside. [7] X Research source"
    },
    {
      "title": "Clean up.",
      "content": "Clean up. If your room is cluttered, make sure you clean up. Clutter provides places for bed bugs to hide, so by removing the items, you reduce their chances of surviving. [8] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Vacuum your room.",
      "content": "Vacuum your room. You can suck up a good number of bed bugs just by vacuuming thoroughly. Make sure to take the vacuum bag or contents outside once you are done vacuuming. [9] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Use bed bug interceptors.",
      "content": "Use bed bug interceptors. Interceptors go under the feet of your bed. They're designed to keep bed bugs from crawling up into your bed. Commercial ones create a little moat that traps bed bugs before they can reach the bed post. [10] X Research source"
    },
    {
      "title": "Move your bed away from the wall and furniture.",
      "content": "Move your bed away from the wall and furniture. If your bed touches the wall or furniture, bed bugs can still crawl in. [11] X Research source"
    },
    {
      "title": "Don't immediately reach for the pesticide.",
      "content": "Don't immediately reach for the pesticide. Pesticides are not that effective against bed bugs, so dousing your bed and room in one is not going to be that helpful. [12] X Research source"
    },
    {
      "title": "Call an exterminator.",
      "content": "Call an exterminator. If you think you have bed bugs, the first step is to call a professional exterminator. You simply don't have the skills and tools you need to take care of the problem completely. [13] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Know what to expect.",
      "content": "Know what to expect. The professional is going to need to get in and around most of your room, including headboards, baseboards, carpets, and your mattress and bedsprings. [14] X Research source"
    },
    {
      "title": "Ensure the person is systematic.",
      "content": "Ensure the person is systematic. Watch carefully to make sure the professional is getting into every nook and cranny. He or she should be able to spot where bed bugs could be hiding, but you may need to point out hidden areas. [15] X Research source"
    },
    {
      "title": "Try a heat treatment.",
      "content": "Try a heat treatment. Exterminators can heat up your rooms to very hot temperature to kill the bed bugs, which you can't do on your own. Ask the professional about performing a heat treatment. [16] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Alert any management.",
      "content": "Alert any management. If you live in an apartment complex, you need to talk to management, as bed bugs may be spreading from apartment to apartment. When one apartment is treated, the apartments directly above, below and on either side should be treated at the same time. [17] X Research source"
    },
    {
      "title": "Wash thrift store clothes immediately.",
      "content": "Wash thrift store clothes immediately. If you bring home clothes from a thrift store, wash them immediately in very hot water. You can also run them through a hot dryer. The process should kill off any bed bugs in the clothes. [18] X Research source"
    },
    {
      "title": "Avoid picking up furniture.",
      "content": "Avoid picking up furniture. It may be tempting to take home what seems to be a perfectly good couch on the curb. However, furniture can harbor bed bugs, and you could be bringing them into your home. [19] X Research source"
    },
    {
      "title": "Buy new mattresses.",
      "content": "Buy new mattresses. If you buy a used mattress, make sure it has been professionally cleaned first. To be on the safe side, you can encase the mattress and box springs in dust-mite covers to keep the bed bugs from biting at night. [20] X Research source"
    },
    {
      "title": "Inspect the room at a hotel.",
      "content": "Inspect the room at a hotel. Before settling in, check your hotel room for bed bugs by inspecting the mattress and the area around the bed. Keep your luggage as far away from the bed as possible. [21] X Research source You can use the luggage rack for your suitcase, especially if it is away from the bed. Try not to leave your luggage on the floor."
    },
    {
      "title": "Wash clothes after a trip.",
      "content": "Wash clothes after a trip. When you return from travelling, immediately wash all the clothes you took on the trip on a hot temperature. Also, leave your suitcase in the garage if possible. [22] X Research source"
    },
    {
      "title": "Be considerate to others.",
      "content": "Be considerate to others. If you have bed bugs, you may need to throw out furniture in bedding. Before doing so, you should slash up the pieces, so that other people will not take them. You should also consider leaving a note with the items for the same reason. [23] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Look for them in crevices.",
      "content": "Look for them in crevices. Bed bugs are experts at hiding, and they can hid in cracks, in mattresses, or even behind items on your bedside table. Take a flashlight to look for them in those areas. [24] X Research source"
    },
    {
      "title": "Look for the signs.",
      "content": "Look for the signs. Bed bugs leave behind small black flecks of feces. You might also notice small drops of blood on your bed in the morning. [25] X Research source"
    },
    {
      "title": "Check for bites.",
      "content": "Check for bites. Not everyone is affected by a bed bug bite. In fact, only about 1/3 of people develop a spot on their skin after they are bitten. The bites usually result in a small pink bump that itches.Most often, they occur in groups of three. [26] X Research source"
    },
    {
      "title": "Compare to other bugs.",
      "content": "Compare to other bugs. That is, if you find a bug, compare it to pictures online to determine it really is a bed bug, as opposed to a flea or tick. [27] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Check other rooms.",
      "content": "Check other rooms. While your bedroom is the most likely to be infected, check out other rooms, as well. For instance, you could bring bed bugs in on a couch, so your living room could be infected. [28] X Research source"
    }
  ]
}