{
  "url": "https://www.wikihow.com/Trex-Fruit",
  "title": "Blox Fruits: T-Rex Fruit Overview, Moves, and More",
  "steps": [
    {
      "title": "T-Rex Fruit is a Mythical Beast-type Blox Fruit.",
      "content": "T-Rex Fruit is a Mythical Beast-type Blox Fruit. It can be purchased from the Blox Fruit Dealer for $2,700,000 or 2,350 Robux. The fruit is a greenish blue color, and it has an ivory skull on it with red eyes. It was released in 2023."
    },
    {
      "title": "T-Rex is good for farming and PvP.",
      "content": "T-Rex is good for farming and PvP. It's not recommended for users in the First or Second Seas, however, since it has high mastery requirements. This fruit also has a high trade value, so you can always trade it instead of using it if you prefer."
    },
    {
      "title": "Tail Swipe (Z)",
      "content": "Tail Swipe ( Z ) Mastery cost: 1 Mastery Cooldown: 8 seconds Description: You shoot a green projectile forward with a large close-range hitbox. It cuts through any objects or enemies ahead of you. [1] X Research source This move only breaks instinct when you're transformed and if the enemy is close. Transformed: The amount of projectiles that you shoot increases to five."
    },
    {
      "title": "Predatory Screech (X)",
      "content": "Predatory Screech ( X ) Mastery cost: 50 Mastery Cooldown: 11 seconds Description: You pull all enemies in a cone in front of you towards you, then push them back with a mighty roar. This move will break instinct. Transformed: The longer you hold down X , you will continue to suck in air and pull enemies towards you. Enemies caught in this whirlwind will take tick damage until they are pushed away from you when you release the key."
    },
    {
      "title": "Hunter's Rage (C)",
      "content": "Hunter's Rage ( C ) Mastery cost: 100 Mastery Cooldown: 15 seconds Description: You rush forward, surrounded by a dark green aura, and attack the enemy in front of you with your claws. This move will break instinct. Transformed: Instead of attacking the enemy with claws, you grab the enemy in your mouth, swing them around, and then slam them on the ground."
    },
    {
      "title": "Reptilian Scales (V)",
      "content": "Reptilian Scales ( V ) Mastery cost: 300 Mastery Cooldown: 8 seconds Description: You roar and turn into a large green T-Rex. Meteorites will fall around you, and the screen will have an orange tint while you are transforming. The roar and meteorites can break instinct. Transformed: You transform back into your normal form."
    },
    {
      "title": "Gigantic Leap (F)",
      "content": "Gigantic Leap ( F ) Mastery cost: 200 Mastery Cooldown: 7 seconds Description: You leap forward, high into the air, and land on an enemy in front of you with a smash. This move will break instinct. Transformed: When landing, there is a magma explosion that does AoE damage."
    },
    {
      "title": "Fury Meter",
      "content": "Fury Meter To transform, the Fury Meter must be full. The meter will gradually refill itself over time, and dealing damage when transformed will additionally fill the meter. Using moves or taking damage when transformed drains the Fury Meter. [2] X Research source"
    },
    {
      "title": "Prey Mark",
      "content": "Prey Mark When transformed, doing attacks will add a prey mark to enemies that get hit. This mark will do tick damage, and the amount of damage increases based on how far away the enemy was from you when they got the prey mark."
    },
    {
      "title": "Pros",
      "content": "Pros Has good combo potential Most moves can break instinct Does high damage when transformed Fury Meter only drains when using moves or taking damage Moves are fast"
    },
    {
      "title": "Cons",
      "content": "Cons Expensive High mastery requirements Moves don't have much range Can't use fighting styles, swords, or guns when transformed Weak at aerial fighting"
    }
  ]
}