{
  "url": "https://www.wikihow.com/Type-Fractions",
  "title": "How to Type Fractions",
  "steps": [
    {
      "title": "Use the division symbol to type a fraction.",
      "content": "Use the division symbol to type a fraction. This may be done by first typing the numerator (the top number of the fraction), the forward slash key ( / ), and the denominator (the bottom number of a fraction). An example would look like 5/32. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you want to type a whole number with a fraction, simply type the whole number followed by a space, and then include the fraction following the instruction above. For example 1 1/2."
    },
    {
      "title": "Use the auto-formatting feature in Word programs.",
      "content": "Use the auto-formatting feature in Word programs. There is a feature that will convert a fraction typed using the forward slash (as in the step above), and convert to a fraction symbol, which features the numerator and denominator separated by a horizontal bar. This function is usually on by default. However, you can check to make sure it is on by going to \"Word Options\", in the dialog box that appears click, \"Proofing\", and then click \"AutoCorrect Options\". There, you can turn AutoCorrect on or off, and you can also edit when and how it corrects certain things. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Be aware that this function may not work for all fractions."
    },
    {
      "title": "Use keyboard shortcuts for common fractions.",
      "content": "Use keyboard shortcuts for common fractions. A few common fractions have keyboard shortcuts that you can use by holding down the Alt key and typing the code numbers. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source 1/2 = Alt + 0 1 8 9 1/4 = Alt + 0 1 8 8 3/4 = Alt + 0 1 9 0"
    },
    {
      "title": "Use an equation field in Word programs to type a fraction.",
      "content": "Use an equation field in Word programs to type a fraction. You can also create a fraction in Word by using the equation function. [4] X Research source Place the cursor where you would like the fraction to be. Press Ctrl + F9 at the same time to insert a pair of field brackets. Place the cursor inside the field brackets, and type EQ \\F(n, d). The \"n\" is the numerator and the \"d\" is the denominator. You must use all capital letters, and follow the EQ with a space. Press the ⇧ Shift + F9 at the same time to create the fraction."
    },
    {
      "title": "Use the superscript and subscript formatting to type fractions in Word programs.",
      "content": "Use the superscript and subscript formatting to type fractions in Word programs. In Word, you can format the font so that it appears as superscript text or subscript text. This will allow you to manipulate the font so that it appears as a fraction. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Type the numerator, and highlight it. Select Format from the menu, click Font, then select Superscript. Press Ctrl and the space bar to clear the formatting for the next step. Type a forward slash ( / ). Type the denominator and highlight it. Select Format, then Font, then Subscript. Press Ctrl + Space to clear the formatting again and move on with your typing."
    },
    {
      "title": "Go to “System Preferences” in your menu bar.",
      "content": "Go to “System Preferences” in your menu bar. Here you will find all of the settings for your mac. [6] X Research source Select “Language and Region”. Click on “Keyboard Preferences”. Click on the tab entitled “Input Sources”. Make sure the “Show Input menu in menu bar” box is checked. Exit system preferences. Now that you have done this, the flag of your country should appear in your menu bar at the top right of your screen."
    },
    {
      "title": "Click on the Input menu in your menu bar.",
      "content": "Click on the Input menu in your menu bar. This will allow you to access all of the special symbols on your Mac. Click “Show Emoji and Symbols”. In the search box, type out the fraction you are looking for (e.g. 1/2=half, 1/8=eighth, 1/4=quarter). In the search results you will see the fraction you wish to insert into your document. Double click the fraction in the results box, and it should be inserted into whatever document you are working in."
    },
    {
      "title": "Save the fractions you use often to your “Favorites”.",
      "content": "Save the fractions you use often to your “Favorites”. This will allow you to use the fractions you use often quickly and without searching for them."
    },
    {
      "title": "Turn on the auto-correct feature in Pages.",
      "content": "Turn on the auto-correct feature in Pages. In most of Mac’s standard apps (e.g. Mail, Safari, Text Edit, etc.) this feature is already turned on, but if you are using Pages, you must turn the feature on yourself. [7] X Research source While in Pages, go to “Preferences”. Select “Auto-Corrections” A box with several options will pop up. Here you should check the box next to “Symbol and Text Substitutions”. Next, check the symbols and substitutions you are interested in using. In this case, make sure you check the “Fractions” box."
    },
    {
      "title": "Type a fraction in your Pages document.",
      "content": "Type a fraction in your Pages document. Now you're ready. Begin by typing the numerator (number on top), a forward slash ( / ), and then the denominator (the number on the bottom). Pages should now automatically change this to look like a fraction. [8] X Research source"
    },
    {
      "title": "Copy and Paste your Fraction.",
      "content": "Copy and Paste your Fraction. If you are having trouble using one of the methods above, you can always copy and paste your fraction from another document or from the internet. [9] X Research source"
    },
    {
      "title": "Find the fraction.",
      "content": "Find the fraction. If the fraction you want to use appears somewhere else in the document, or perhaps in a different document, then you can quickly copy and paste it. Highlight the fraction you want to use with your cursor. Right click on the highlighted text and click \"copy\". Click back to the document and place the cursor where you want the text to appear. Right click again, and click \"paste\". If the text doesn't match the format of the document you are working in, highlight the newly pasted fraction, and change the font and font size to that of the text in the document."
    },
    {
      "title": "Search the internet.",
      "content": "Search the internet. If you do not have the fraction handy in a different document, you can find it on a web page by searching for the fraction + the word \"fraction\". For example, if you want to include 1/10, search for \"1/10 fraction\". Click through the results until you find the fraction you are looking for. Then, as above, highlight the fraction, and copy and paste it into your document. If you need to change the formatting, highlight the fraction again and then change it to the correct font and font size. You may also need to make it bold (or regular) when necessary."
    }
  ]
}