{
  "url": "https://www.wikihow.com/Throw-a-Golf-Disc",
  "title": "Tips & Tricks for Throwing a Disc Golf Disc",
  "steps": [
    {
      "title": "Stand sideways to the target and place your weight on your back foot.",
      "content": "Stand sideways to the target and place your weight on your back foot. Point your dominant shoulder at the target, in the same way as if you were hitting a baseball. This helps the golf disc to fly in a straight line. Point your feet straight in front of your body so that they form a 90-degree angle with the target. A backhand throw is the most basic throw in disc golf and is used 90% of the time. Avoid facing the front of your body toward the target, as this will cause the golf disc to veer off on an angle."
    },
    {
      "title": "Grip the disc with your thumb on top and your fingers underneath.",
      "content": "Grip the disc with your thumb on top and your fingers underneath. Hold the golf disc in your dominant hand and then place your thumb on top of the disc to secure it in your hand. Move your fingers around until they are in a comfortable position and the disc feels secure in your hand. [1] X Research source Avoid placing any of your fingers along the side of the golf disc, as this can shorten the distance that the disc flies. Continue to experiment with the positioning of your fingers until you find a position that works well for you."
    },
    {
      "title": "Hold your arm straight and pull it behind you.",
      "content": "Hold your arm straight and pull it behind you. Position the golf disc behind the shoulder of your throwing arm. Outstretch your arm so that you have the maximum amount of leverage from which to throw the golf disc. Keep experimenting with this position until you find a stature that feels comfortable for you. Aim to hold the disc at about waist height. Practice this position in the mirror so that you can easily see how your body is positioned."
    },
    {
      "title": "Hold the golf disc flat.",
      "content": "Hold the golf disc flat. This is the easiest way to increase the distance of your throw. If your golf disc is angled upward, it will quickly lose momentum and fly down toward the ground. If the disc is angled downward, it will hit the ground before using all its potential momentum. Hold your wrist flat and then line up your golf disc with your wrist. Try to maintain this flat position throughout your throw."
    },
    {
      "title": "Swing your arm forward and release the golf disc.",
      "content": "Swing your arm forward and release the golf disc. Quickly bring your elbow toward the target and let your hand naturally follow behind it. When your elbow reaches your belly button, outstretch your arm. Release the golf disc when your wrist is pointing toward the target. Keep the golf disc at waist height as you make the throw. The faster you bring your arm toward the target, the faster and further the golf disc will fly. Keep your eye on the target, rather than on your golf disc. This will help to improve the accuracy of your throw. Practice the throwing movement slowly to help you master each aspect of the throw. Increase the speed and power of your throw as you get more confident."
    },
    {
      "title": "Transfer your weight to your front foot as you make the throw.",
      "content": "Transfer your weight to your front foot as you make the throw. Once your elbow reaches the middle of your body, place your weight onto your front foot. This will help to increase the momentum of your throw. If you find that you are getting a little off balance, bend your front leg slightly."
    },
    {
      "title": "Allow your arm to continue swinging after you release the disc.",
      "content": "Allow your arm to continue swinging after you release the disc. Following through will help to increase the distance of your throw and helps to prevent injuries. Allow your arm to keep swinging toward the target. The faster that you throw the golf disc; the further your arm will naturally follow through. [2] X Research source"
    },
    {
      "title": "Grip the disc between your thumb and middle finger.",
      "content": "Grip the disc between your thumb and middle finger. Place your middle finger flat against the inside rim of the disc with your palm facing the disc. Put your thumb on top of the disc above your middle finger to secure the disc in your hand. Let the web between your thumb and index finger rest on the outside rim. Place your index finger on top of your middle finger to give the throw extra strength. [3] X Research source This position tends to be uncomfortable for beginners but becomes easier over time. Keep practicing! Hold the disc firmly to give you good control of the throw. The top of the golf disc may bend a little from the pressure of your thumb, which is normal."
    },
    {
      "title": "Stand sideways to the target with your feet shoulder-width apart.",
      "content": "Stand sideways to the target with your feet shoulder-width apart. Point your non-throwing shoulder toward the target. This gives you a good solid base from which to throw the disc. Bend your knees slightly to give you extra stability. [4] X Research source If your throws aren’t very accurate, check that your non-throwing shoulder is pointing toward the target. This helps to guide the throw in the right direction."
    },
    {
      "title": "Hold the disc flat and pull your arm back away from the target.",
      "content": "Hold the disc flat and pull your arm back away from the target. Hold your forearm horizontally and then pull it back behind you to a comfortable position. Experiment with different starting positions until you find one that feels natural. [5] X Research source Keep your wrist in a horizontal position, as this helps the disc to fly straight. Try to maintain this horizontal position throughout the throw."
    },
    {
      "title": "Flick your wrist and forearm forward and release the golf disc.",
      "content": "Flick your wrist and forearm forward and release the golf disc. Keep your forearm in a horizontal position as you quickly bring it forward. Release the disc when your wrist is pointing toward the target. The momentum of the flick will propel the disc into the air. The faster that you flick your wrist; the further the disc will fly. [6] X Research source You may notice that your hips turn slightly as you flick your forearm. This is natural and helps to make the movement nice and smooth."
    }
  ]
}