{
  "url": "https://www.wikihow.com/Tame-a-Rat",
  "title": "How to Tame a Rat",
  "steps": [
    {
      "title": "Give the rat some time alone.",
      "content": "Give the rat some time alone. You should leave a new rat alone in its cage for the first few days you have it. This will help it become comfortable with its new surroundings without the added stress of interacting with you. [1] X Research source If you get a rat that was handled since birth, bonding with it can happen in the first couple weeks or days. It should take treats straight from your hand after the first couple days and will be very easy to handle. Pet store rats are usually in this category. Unsocialized rats are typically absolutely terrified of people and are usually very difficult to hold or even touch. They might scream in fear as you try to touch them. These rats are not for beginners and take a ton of patience and experience to socialize. Feeder bin rats are frequently unsocialized like this."
    },
    {
      "title": "Keep the cage in a medium-traffic area of the house.",
      "content": "Keep the cage in a medium-traffic area of the house. Even though you should let the rat acclimate to its cage alone, it shouldn't be totally isolated. The rat should be exposed to some activity, but it should be away from noisy appliances or other loud noises. Typically a quiet corner of a living room is a good place to keep it. [2] X Research source In fact, having a long phone conversation while in the same room as your rat is a great way to get it comfortable with your voice. However, speak normally and do not yell or shout, as this will scare your new rat. Most rats are very easily frightened by rustling noises, shredding noises, and electronic humming, so try to keep them away from these noises during taming."
    },
    {
      "title": "Be patient with the rat.",
      "content": "Be patient with the rat. Give your rat the time it needs to learn to trust you and to come to you willingly. [3] X Expert Source Brian Starr Rat Specialist & Breeder Expert Interview. 18 March 2021. Remember, the taming period and methods that work will differ between individual rats, so don't get frustrated. [4] X Research source Don't go and pick up a rat quickly before it gets used to its new home. They may turn and bite out of fear and begin to distrust you."
    },
    {
      "title": "Start with brief interactions without opening the cage.",
      "content": "Start with brief interactions without opening the cage. Brief encounters are better than long ones when you start interacting with your rat. Try to be happy, calm, and speak to the rat through the cage in a soft voice before even touching it. [5] X Research source You can give the rat a treat through the cage, but don't expect it to take the treat out of your fingers. Simply make sure the rat can see you drop the treat into the cage."
    },
    {
      "title": "Teach the rat to take a treat.",
      "content": "Teach the rat to take a treat. A semi-socialized rat will usually not take a treat from your hand right away, but offer it a piece of fruit or vegetable once a day. Put the treats in the cage for several days so your rat can become addicted to them. When the rat starts eating them readily, stop putting the treats in its cage and start only offering them by hand. [6] X Research source From then on, they can only have a treat if they will take it from your hand. This is a big step in the bonding process."
    },
    {
      "title": "Give your rat 1 treat every time you open their cage.",
      "content": "Give your rat 1 treat every time you open their cage. Open their cage door, announce that you are there, and make sure the rat is aware of you so that you don't startle it. Shake the treat container so that it associates that noise with getting a treat, and then give your rat the treat. Doing this will teach your rat to look forward to your visits, because it means getting treats! [7] X Research source Teaching it to take a treat by hand will create a bond between you and the rat."
    },
    {
      "title": "Allow the rat to sniff your hand.",
      "content": "Allow the rat to sniff your hand. Frequently offer up your empty hand for it to sniff and explore. This will help the rat get used to your smell and will help the animal to not assume you have a treat every time you put your hand in the cage. If your rat begins to assume this, it might start biting at your hand assuming it's food. [8] X Research source This will help your rat move to a stage in the taming process when it is skittish yet exploring you freely and willing to eat out of your hand."
    },
    {
      "title": "Start briefly petting the rat.",
      "content": "Start briefly petting the rat. At first, your rat probably won't like being petted. This is natural, as they are not used to it. You will need to gently force this physical affection on your rat in short, frequent intervals. With repeated short episodes of petting that are accompanied by treats, the rat will figure out that this can be a safe and wonderful experience. The first time you pet your rat, just try to pet it once. After a week or 2 of short, single strokes, try giving your rat several strokes in a row. Start forcing your rat to endure being petted for longer and longer intervals as time goes by. The rat will not like it, but you have to put it through the experience so it can get used to it. Some struggling is okay and expected. If the rat is just freaking out and crying, however, move back a step to shorter interactions. Petting is a good thing. You should try to do it often, even if the rat isn't interested. Most rats come to love petting with enough exposure to it."
    },
    {
      "title": "Give a negative verbal response to bad interactions.",
      "content": "Give a negative verbal response to bad interactions. If your rat does nip you, let out a small squeak or yelp. You are not trying to seriously frighten your rat with yelling, just let the rat know it hurt you and it needs to be careful. [9] X Research source Never physically punish a rat for bad behavior. Punishment only teaches it that you are unpredictable and untrustworthy."
    },
    {
      "title": "Visit your rat throughout the day.",
      "content": "Visit your rat throughout the day. Talk to the rat in a soft and pleasant voice. Open the door and put your hand in the cage for it to sniff, maybe even giving it a quick pat on the head. You want your rat to be exposed to you as much as possible. [10] X Research source Make sure the rat is awake and knows you are there before touching it."
    },
    {
      "title": "Clicker train your rat, if it is very nervous.",
      "content": "Clicker train your rat, if it is very nervous. Clicker training is a great way to help a shy rat develop positive associations with your interactions. This type of training teaches your rat to associate a noise (the click) with a positive reinforcer (like a treat or a toy). If you see the rat doing something you like—even something as simple as taking a step toward you or letting you touch its head—click the clicker and immediately offer a treat. [11] X Research source Try to click at the same time that the rat does the desired behavior. You can buy training clickers online or at pet supply stores. If you’re not sure how to get started, do a search for clicker training tutorials online. Look for videos and written instructions specifically for training rats."
    },
    {
      "title": "Make your rat come to the door in order to get the treat.",
      "content": "Make your rat come to the door in order to get the treat. This will teach your rat to come to the door when you want it to. This will make it so you don't have to chase it down in the cage. Shake the treat container to encourage the rat to come to the door. [12] X Research source If the rat doesn’t come to the door, hold the treat in front of the its nose and tempt it to the door with it. Instead of shaking the treat can as a signal, you could say the rat’s name to get it to come to you. Saying your rat's name each time before you give it a treat will teach the rat to know its name. Whatever signal you choose, be consistent."
    },
    {
      "title": "Lure the rat into your hand with treats.",
      "content": "Lure the rat into your hand with treats. Place some treats in your hand, open the cage door, and place your open hand inside. Once your rat will steal treats from your hand and eat them, make it so that it has to take a step outside the cage for a treat. For the first several days the rat might be too scared to eat the treats. Give it time. Keep doing this, moving the treat further and further out of the cage until you can get your rat to come from the cage onto your lap to eat the treat."
    },
    {
      "title": "Let the rat explore outside its cage.",
      "content": "Let the rat explore outside its cage. If at any time the rat just decides to come out and explore the room, let it do so freely. Do not make movements towards it, or try to stop it. Just sit there calmly and let it explore. If it comes to you and eats the treat, let it. If it starts crawling on you, let it do so freely without making any motions towards it. You want to make yourself completely non-threatening. [13] X Research source Eventually your rat will become brave enough to come and explore just what and who you are. Don't interfere, even if it crawls all over you. Just stay still and let it get used to your smell. Let your rat return to its cage as often as it likes. Remember that the cage is its safety zone. You want your rat to feel safe and in control."
    },
    {
      "title": "Start picking up the rat once it is comfortable with you.",
      "content": "Start picking up the rat once it is comfortable with you. You will have to pick your moment and corner it to do so. Corner it as calmly and as gently as you can, however. You don't want to show the rat that being picked up is a scary experience. Once you have it in your hand, offer it a quick treat and put it right back down again. [14] X Research source Never pick up a rat by the tail. This can cause the tail to become injured and in extreme cases it may need to be amputated. If a rat shrieks when you attempt to lift it, let it get away and recover. Never force a shrieking rat to be held. A quiet squeak is okay, however."
    },
    {
      "title": "Don't set down the rat while it's struggling.",
      "content": "Don't set down the rat while it's struggling. This can be hard to do depending on the rat, but you shouldn't put down a rat that is struggling to get away because it will show the animal that struggling pays off. Instead, try to wait until your rat is calm, if only for a second, and put it down then. [15] X Research source Timing is critical. Be sure to do it right as it is calm. As you bond more with your rat and as time goes by, you can require it to be calm for longer and longer periods of time before you will put it down."
    },
    {
      "title": "Hold the rat on a regular schedule.",
      "content": "Hold the rat on a regular schedule. Pick a time each day and take your rat out. The best time to take it out is during the middle of the day when it is most tired and won't fight you as much. Take your rat out and hold it for 20 minutes. Be sure to time it, because it's important that you do it for a set amount of time. [16] X Research source While holding the rat feel free to let it run through your hands or even go up to your shoulder. The only rule is that the rat must stay on you and be touched and handled by you for 20 minutes. In the beginning, your rat will probably squeak and struggle to get away from you. Don't let it. If you're afraid that your rat might bite you, you could use a towel to pick it up."
    },
    {
      "title": "Play and bond with the rat.",
      "content": "Play and bond with the rat. When the rat comes to the door, scoop it up and take it to a designated, rat-proof play area where it can run around and explore new things. Spending this time with your rat will ensure that you create a lasting bond with it. [17] X Research source"
    }
  ]
}