{
  "url": "https://www.wikihow.com/Wear-a-Scarf-with-a-Jacket",
  "title": "How to Wear a Scarf with a Jacket",
  "steps": [
    {
      "title": "Opt for a cross-over knot for a timeless look.",
      "content": "Opt for a cross-over knot for a timeless look. Cross the ends of your scarf over and then tuck 1 end up through the gap. Pull both the ends tight to secure the knot in place. Then, leave the ends of the scarf to hang down over your jacket. This helps to make the scarf stand out and creates a great casual outfit. This option works best for long scarves, as there is more fabric to hang down over the jacket. Tie your scarf in a cross-over knot and wear it over a leather jacket for an on-trend look."
    },
    {
      "title": "Leave your scarf untied over your jacket for a cool, casual look.",
      "content": "Leave your scarf untied over your jacket for a cool, casual look. Hang your scarf over the back of your neck and allow the ends of the scarf to hang down in front of you. This makes your scarf look a little bit like a shawl and adds another layer to your outfit. You can pull off this look with any length of scarf."
    },
    {
      "title": "Wrap a big scarf around your neck with a puffy jacket for a comfy look.",
      "content": "Wrap a big scarf around your neck with a puffy jacket for a comfy look. Large, wide, and thick scarves all look with great with jackets. Pair your favourite sturdy, thick, or fluffy jacket with an oversized scarf for a fashionable streetwear look. To achieve this look, simply wrap the entire scarf around your neck. [1] X Research source A sheepskin jacket and a red scarf would make a great outfit for going out to a cafe with your friends."
    },
    {
      "title": "Opt for an infinity scarf if you want an easy scarf to wear.",
      "content": "Opt for an infinity scarf if you want an easy scarf to wear. Infinity scarves are incredibly easy to wear, as they are already in a loop. Simply pull it over your head and wear it over your favourite jacket. These scarves are perfect for informal occasions, such as catching up with friends and going to the movies. [2] X Research source These scarves tend to be warm and are great for cold days."
    },
    {
      "title": "Opt for a scarf knot for formal occasions.",
      "content": "Opt for a scarf knot for formal occasions. This technique is perfect for formal occasions that require a refined look. Fold the scarf in half and wrap it around your neck. Then, pull the ends through the loop created by the folded end and pull them tight to secure the knot. Leave the ends to hang over your jacket. [3] X Research source This technique works with any type of scarf."
    },
    {
      "title": "Use the crossover technique to add colour to a formal jacket.",
      "content": "Use the crossover technique to add colour to a formal jacket. Wrap the scarf around your neck and loosely cross it over at the end. Then, button up your jacket over the scarf to hold it in place. This looks great with suit jackets, as the scarf adds colour to the top of the suit jacket. [4] X Research source This technique works best with long scarves."
    },
    {
      "title": "Tie your scarf in a cross-over knot and tuck it in for a tidy look.",
      "content": "Tie your scarf in a cross-over knot and tuck it in for a tidy look. This is a great option if you want to add warmth or pizazz to a formal outfit. Wrap your scarf around your neck and cross the ends over. Loop 1 end through the gap and then pull both the ends to secure the knot. Tuck the ends into your blazer, suit jacket, or formal jacket. [5] X Expert Source Chloée Ohayon-Crosby Fashion Stylist Expert Interview. 24 July 2020. This works best with thin scarves, such as those made from silk or cotton. [6] X Research source If you take your jacket off during the night, take off your scarf as well to ensure that your outfit looks tidy."
    },
    {
      "title": "Opt for a light scarf in summer.",
      "content": "Opt for a light scarf in summer. Whilst scarves are traditionally worn in winter, there are plenty of great lighter options. Light scarves are incredibly versatile and are perfect for all occasions. Choose a scarf made from silk, cotton, or linen for a breathable, lightweight option. [7] X Expert Source Chloée Ohayon-Crosby Fashion Stylist Expert Interview. 24 July 2020. [8] X Research source These scarves help to make your outfit look classy and stylish. A silk scarf over a light blazer would be a great outfit for a business lunch."
    },
    {
      "title": "Pick a heavier scarf in winter.",
      "content": "Pick a heavier scarf in winter. Scarves are a great way to keep warm in the cool winter months. Opt for warm fibres, such as merino, cashmere, and cable-knit wool. [9] X Expert Source Chloée Ohayon-Crosby Fashion Stylist Expert Interview. 24 July 2020. If the weather is particularly cool, opt for a long scarf so that you can wrap it around your neck multiple times. [10] X Research source Consider purchasing matching gloves to create a cohesive outfit."
    },
    {
      "title": "Choose a small, tidy scarf for formal occasions.",
      "content": "Choose a small, tidy scarf for formal occasions. Lightweight scarves tend to be more appropriate for formal occasions. If it is a cold day, opt for lightweight wool, such as cashmere. If it is a hot day, pick a breathable fabric, such as silk or linen. This is a great way to add colour to a formal outfit. [11] X Research source Purchase a formal scarf from the business section of a department store."
    },
    {
      "title": "Pick a scarf in a contrasting colour to your jacket to make it stand out.",
      "content": "Pick a scarf in a contrasting colour to your jacket to make it stand out. This is a great way to add extra colour to your outfit. This works best with a plain scarf and blazer, as patterned items can make your outfit look too busy. Be bold and choose colours that express your personal style! [12] X Research source For example, pair a red silk scarf with a navy suit jacket for a business event. Alternatively, wear a yellow scarf with a pink suede jacket if you are going out for a coffee date with friends."
    },
    {
      "title": "Opt for a scarf that’s the same colour as your jacket for a tidy look.",
      "content": "Opt for a scarf that’s the same colour as your jacket for a tidy look. This is a great option if you are attending a formal event or if you are wanting to achieve a simple, classy look. For example, pair a navy blue scarf with a navy blue suit jacket to complete your look. [13] X Research source To add extra interest to your outfit, consider wearing a scarf with a slight pattern. For example, combine a plain black jacket with an embroidered black scarf."
    },
    {
      "title": "Combine a printed scarf with a plain jacket for a balanced look.",
      "content": "Combine a printed scarf with a plain jacket for a balanced look. A printed or patterned scarf is a great way to add personality to a plain jacket. Consider wearing a scarf with stripes, polka dots, floral print, or geometric shapes. Each of these prints will work well with a plain jacket. If you prefer, combine a plain scarf with a patterned jacket for a similar look."
    }
  ]
}