{
  "url": "https://www.wikihow.com/Tone-the-Back-of-Your-Thighs",
  "title": "How to Tone the Back of Your Thighs",
  "steps": [
    {
      "title": "Incorporate deadlifts to target your hamstrings.",
      "content": "Incorporate deadlifts to target your hamstrings. To do a deadlift, place an unweighted or weighted barbell in front of you. Stand with your feet shoulder-width apart and position your feet so that they are under the bar. Then, bed over without rounding your back or shoulders, grasp the barbell with both hands and push through your hamstrings and buttocks to stand up straight with the barbell in front of you. Hold for a few seconds, and then place the barbell back on the ground. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Repeat the exercise 10 to 15 times."
    },
    {
      "title": "Do bodyweight squats to work your glutes and hamstrings.",
      "content": "Do bodyweight squats to work your glutes and hamstrings. Place your feet shoulder width apart, put your arms to your sides, and keep your shoulder blades and back straight. Dip downward until your knees are at 90 degree angles, and extend your arms straight ahead, palms down, at the same time. [2] X Expert Source Monica Morris Certified Personal Trainer Expert Interview. 18 November 2019. You have 2 options once you’ve squatted down. You can hold the squat for 30-60 seconds, raise back up, and repeat the process 10 times total. Or, you can hold the squat for 1-2 seconds, raise back up, and do 2 sets of 15-25 repetitions (reps). Do your sets of squats 3 or more times per week."
    },
    {
      "title": "Upgrade your squats by trying squat jumps.",
      "content": "Upgrade your squats by trying squat jumps. Do your standard bodyweight squat, keeping your back straight and your eyes straight ahead. When you raise back up, jump straight up in the air, keeping your legs, core, and upper body in alignment. After landing on your feet, return to the starting position for another squat. [3] X Research source You can do squat jumps after holding each squat for 30-60 seconds (and do 10 reps total), or after holding the squat for 1-2 seconds (and do 2 sets of 15-25 reps). Do sets of squat jumps 3 or more times per week. Explosive exercises are especially effective at toning the leg muscles for some people, so you might also include box jumps, sumo squat jumps, jumping lunges , jumping rope , and sprinting to help tone the back of your thighs."
    },
    {
      "title": "Work your glutes with curtsy lunges.",
      "content": "Work your glutes with curtsy lunges. Stand with your feet shoulder width apart and your arms at your sides. Step diagonally backward with one leg, across your backside, so that your foot on that leg is outside the foot on the other leg. Dip down so that your front leg is at a 90 degree angle, and keep as much of your weight as possible on this front leg. Hold the lunge for 1-2 seconds, then return to the starting position. [4] X Expert Source Monica Morris Certified Personal Trainer Expert Interview. 18 November 2019. Do 2 sets of 10-15 reps with each leg, 3 or more times per week. Curtsy lunges work all of your glutes, and are great at toning your inner thighs and the gluteus medius (or hip abductors), which are adjacent to your buttocks."
    },
    {
      "title": "Use dumbbells to enhance standard or curtsy lunges.",
      "content": "Use dumbbells to enhance standard or curtsy lunges. Stand with your feet shoulder width apart and your arms at your side, holding a dumbbell in each hand. Step forward with one leg and dip down until your front thigh is parallel with the ground. Keep your back straight and your arms (and the dumbbells) to your sides. Hold the dip for 1-2 seconds, then raise back up. Alternatively, cross one leg behind you and do curtsy lunges with the dumbbells. In either case, do 2 sets of 10-15 reps per leg, at least 3 times per week. Start with 5–10 lb (2.3–4.5 kg) weights, and work your way up to heavier dumbbells over time."
    },
    {
      "title": "Work your hamstrings and glutes on your gym’s leg press machine.",
      "content": "Work your hamstrings and glutes on your gym’s leg press machine. Choose a comfortable weight (half your body weight is a good starting point), sit in the chair, and place your feet flat on the platform. Your knees should be at 90 degrees and lined up with your ankles. Extend your legs fully (but don’t lock your knees), hold the extension for 1-2 seconds, and return slowly to the starting position. [5] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source Keep your back flat on the seat, and grasp the handles loosely with your hands. Use your legs alone to do the presses. Aim to do 2-3 sets of 10-15 reps, 3 times per week."
    },
    {
      "title": "Do 2 lower body resistance exercises for every 1 upper body exercise.",
      "content": "Do 2 lower body resistance exercises for every 1 upper body exercise. In other words, if you include 5 different upper body exercises during your resistance workout, do 10 lower body exercises. This way, you’re still getting the full-body workout that benefits your overall health and fitness, but also maximizing the focus on your thighs and surrounding muscle groups. [6] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source Also include exercises that focus on your core/abdominal muscles—do about the same number of these as upper body exercises. For instance, do 5 upper body, 5 core, and 10 lower body exercises per resistance workout. Work with your doctor, physical therapist, and/or trainer to develop the right resistance exercise routine for you. Typically, it’s best to do resistance training sessions 3-4 times per week."
    },
    {
      "title": "Include frequent aerobic exercise in your thigh-toning regimen.",
      "content": "Include frequent aerobic exercise in your thigh-toning regimen. Toning the back of your thighs means building muscle, but it also usually means reducing your body fat. Aim for at least 150 minutes per week of medium-intensity aerobic exercise (meaning your heart rate is elevated and you’re breathing too hard to speak easily) for fat-burning benefits. Try options like: [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Running . Running is great cardio and can help you achieve firmer and more muscular thighs. Zumba or kickboxing. These are forms of cardio that will help burn fat and tone your thighs. Swimming. Swimming works out your thighs and gives you a great cardio workout at the same time. Working out on an elliptical machine. The elliptical specifically targets your thighs because of the motion of the machine."
    },
    {
      "title": "Reduce your daily calorie intake.",
      "content": "Reduce your daily calorie intake . If you need to shed some excess weight in order to help tone your thighs, burn more calories through exercise while also consuming fewer calories in your diet. Use a calorie tracking app or food journal to record what you eat each day, and use this information to reduce your average daily intake to a lower (but healthy) level. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Consult your doctor, and possibly a nutritionist or dietitian, to figure out what your ideal calorie target should be. Reducing your calorie intake too drastically can have negative health consequences."
    },
    {
      "title": "Spend your daily calories on healthy food choices.",
      "content": "Spend your daily calories on healthy food choices . Cut back on foods that are high in calories, fat, and sugar, like sweets, processed foods, fast food, and sugary drinks. Instead, eat more fruits and vegetables, whole grains, lean proteins, and healthy fats. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source In addition to lots of fruits and veggies, opt for foods like beans, nuts, seeds, brown rice, quinoa, oats, grilled chicken, and fish. You’ll probably find it easier to eat healthy if you prepare your own meals at home as much as possible, instead of eating out or grabbing food on the run. Get healthy eating advice from experts like your doctor or a dietitian."
    },
    {
      "title": "Make lifestyle changes like quitting smoking, reducing stress, and getting enough sleep.",
      "content": "Make lifestyle changes like quitting smoking, reducing stress, and getting enough sleep. Every measure you take to improve your overall health will make it easier to tone the back of your thighs. Instead of wishing that you could magically sculpt your thighs without making broader changes to your way of life, prioritize your overall health and well-being while adding some extra emphasis to thigh-toning exercises and choices. [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you are a smoker, work on quitting as soon as possible. Aim to get roughly 8 hours of uninterrupted sleep per night. Look for healthy ways to reduce your stress levels, like yoga or deep breathing. Reader Poll: We asked 188 wikiHow readers and 57% of them said that the fitness class they’d be most interesting in trying is yoga or Pilates . [Take Poll]"
    },
    {
      "title": "Talk to a licensed professional about cosmetic treatments for your thighs.",
      "content": "Talk to a licensed professional about cosmetic treatments for your thighs. It’s not hard to find spas, massage parlors, and similar operations that offer a range of supposed thigh-toning treatments. Your best bet, though, is to stick to treatments offered by licensed, accredited, and experienced medical professionals in a clinical setting. [11] X Research source Get a referral from your doctor for cosmetic surgeons in your area, and meet with several before deciding on the best fit for you."
    },
    {
      "title": "Discuss common cosmetic treatment options.",
      "content": "Discuss common cosmetic treatment options. The best treatment options for your circumstances will vary based on numerous factors—for instance, if cellulite is an issue for you, some treatments may be recommended more highly than others. Your chosen cosmetic surgeon may present options such as: [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Cellulite creams. Many cellulite creams have no medical basis and should be avoided, but those containing retinol may help reduce the appearance of cellulite. Discuss the best available options with your cosmetic surgeon. Laser treatment, which involves inserting a small laser probe under the skin to break up fatty tissue. Acoustic wave therapy, which uses a handheld device to transmit sound waves into fatty tissue. Subcision, in which a needle is used to break up connective tissue bands (particularly in the case of cellulite). Carboxytherapy, which involves inserting carbon dioxide gas under the skin to reduce the appearance of cellulite."
    },
    {
      "title": "Combine any cosmetic treatments with exercise, diet, and lifestyle changes.",
      "content": "Combine any cosmetic treatments with exercise, diet, and lifestyle changes. Don’t expect any type of cosmetic treatment to magically give you the sculpted thighs you’ve been dreaming of. Instead, treat cosmetic procedures as a way to boost the benefits of the other efforts you’re making to tone the back of your thighs. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Do resistance workouts 3-4 times per week, with special targeting of your thighs. Do at least 150 minutes of aerobic exercise per week. Eat a healthy diet and reduce your calorie intake. Make healthy lifestyle choices."
    }
  ]
}