{
  "url": "https://www.wikihow.com/Words-That-Have-Multiple-Meanings",
  "title": "Words That Have Multiple Meanings: 50+ Examples",
  "steps": [
    {
      "title": "Homonyms have the same spelling and pronunciation, but different meanings.",
      "content": "Homonyms have the same spelling and pronunciation, but different meanings. These words sound the same when spoken aloud and look the same when written down, but they mean entirely different things. [1] X Research source When you come across one in a sentence, you’ll usually need to use context clues to figure out which meaning makes the most sense. Here are some examples: Address Definition 1: The location of a business or where someone lives. “What’s your new address? I want to send you a letter.” Definition 2: To communicate directly. “The CEO will address the company about the policy changes at the meeting on Monday.” Arm Definition 1: An upper limb on the human body; the space between the wrist and shoulder. “I lifted weights yesterday, and now my arm is sore.” Definition 2: To equip with weapons; to strengthen or protect. “I arm myself with pepper spray when I go running at night.” Bank Definition 1: A financial institution where you can withdraw and deposit money. “I’m going to the bank to deposit the check my mom sent me.” Definition 2: The edge of a river or lake. “He has a beautiful house right on the bank of the lake.” Bark Definition 1: The sound a dog makes. “My dog always barks when someone knocks on the door.” Definition 2: The outer covering of a tree. “Birch trees have light-colored bark that peels off in papery strips.” Bat Definition 1: A nocturnal winged animal. “I saw a bat flying the other night, and it was very spooky.” Definition 2: A long wooden stick used to hit the ball when playing baseball. “He asked for a new baseball bat for Christmas.” Clip Definition 1: To fasten or secure something. “Can you clip the leash onto the dog’s collar for me?” Definition 2: To cut something with scissors or shears. “I’m going to the hair salon so they can clip my bangs a bit shorter.” Definition 3: A short video. “This video clip is so funny—I’ve watched it 100 times!” Crane Definition 1: A large bird with long legs and a long neck. “Cranes look similar to other birds, such as herons and egrets.” Definition 2: A machine with a long arm used to lift heavy objects. “There are a ton of huge cranes on that construction site.” Definition 3: To stretch one’s neck to see something better. “The concert was so crowded that she needed to crane her neck to see the stage.” Current Definition 1: Happening right now or occurring at the present time. “Who is your current best friend?” Definition 2: Water that’s moving in a specific direction. “Be careful in the ocean today; the current is really strong.” Date Definition 1: The day of the month or year. “What’s the date today?” Definition 2: A romantic meeting with someone. “He asked me on a date for Valentine’s Day.” Definition 3: A sweet brown fruit from the date palm tree. “Chopped dates are a delicious addition to baked goods.” Dough Definition 1: A mixture of flour and liquid that can be baked into bread or pastries. “I always have a spoonful of cookie dough before putting it into the oven.” Definition 2: Informal slang for money. “After I get my paycheck on Friday, I’ll have a lot of dough to spend.” Drop Definition 1: To let something fall down. “Can you carry one of these drinks for me? I don’t want to drop them.” Definition 2: A small amount of liquid that falls in a pear shape. “I’m going to add a few drops of lemon juice to the salad dressing.” Engage Definition 1: To involve someone in something or capture their attention. “She was deeply engaged in conversation with her date.” Definition 2: To become betrothed; to agree to marry someone. “We got engaged a few months ago, but we aren’t in a rush to plan the wedding.” Fall Definition 1: To descend or drop. “I don’t want to go roller skating because I’m afraid to fall down.” Definition 2: The season between summer and winter. “I love fall! Halloween and Thanksgiving are my favorite holidays.” Feet Definition 1: The lower human extremity below the ankle. “Those shoes hurt my feet.” Definition 2: A unit of measurement equal to 12 inches. “He is 6 feet tall.” Leaves Definition 1: The growth at the end of branches or stems on plants. “The leaves are changing color and falling off the trees.” Definition 2: To depart or go away. “She wants to finish a few more things before she leaves work for the day.” Left Definition 1: To leave something, someone, or somewhere. “I left the party early because I felt sick.” Definition 2: On, toward, or related to the left side of the human body (as opposed to the right side). “Can you hand me the book that’s sitting on that table to your left?”\\ Match Definition 1: A short piece of wood that creates a spark when it’s stricken against a rough surface. “Can you hand me a match? I want to light this candle.” Definition 2: To fit or pair two things together. “I made a match between two of my close friends, and now they’re getting married.” Definition 3: A sports game. “The soccer match starts at 3:00 p.m.” Mean Definition 1: The purpose or intention behind something. “What did you mean when you said that?” Definition 2: Unkind or unpleasant. “You’ve been so mean to me all day, and it’s not fair.” Park Definition 1: To bring a car to a stop and leave it somewhere temporarily. “I’m going to park my car in the driveway. Definition 2: A public area outdoors meant for recreation. “I took my dog to the park to play fetch yesterday.” Point Definition 1: A sharp tip at the end of an object. “I need to sharpen this pencil. The point is all dull.” Definition 2: To extend one’s finger toward something to show it to someone. “I can’t see him in this crowd! Can you point toward him?” Definition 3: The main idea or opinion someone’s expressing. “The whole point of the book is to treat people with kindness.” Right Definition 1: To be correct or accurate. “I got all the questions right on the quiz.” Definition 2: On, toward, or related to the right side of the human body (as opposed to the left side). “Make a right turn up at the stoplight.” Peer Definition 1: A person who has equal standing to another person. “She has a lot of respect for her peers at school.” Definition 2: To look closely at something. “He tried to peer through the rain, but he couldn’t see anything in front of him.” Ring Definition 1: A circular piece of jewelry worn on a finger. Definition 2: A clear, resonant, reverberating sound. “I heard the doorbell ring.” Rock Definition 1: The solid, hard part of the earth’s surface, or an individual stone. “I found this pretty rock at the beach.” Definition 2: To move back and forth. “I’m going to go rock the baby to sleep.” Rose Definition 1: A flower of the genus Rosa . “He bought me a dozen roses for our anniversary.” Definition 2: To ascend. “She rose through the ranks at her company due to her hard work.” Sink Definition 1: A basin with a waterspout and drain. “Go to the sink and wash your hands before dinner.” Definition 2: To descend or drop. “If you drop a rock in the pool, it will sink to the bottom.” Spring Definition 1: To leap, jump up, or come out suddenly. “Embers are starting to spring from the campfire, so we should be careful.” Definition 2: The season before summer. “I love when the flowers start to bloom in spring.” Tie Definition 1: To attach, fasten, or knot something. “Hold on, I need to tie my shoelaces.” Definition 2: To get an equal score in a contest. “The race ended in a tie, so they both got the gold medal.” Definition 3: A thin piece of material worn around the neck under the collar. “I got him a new striped tie to wear with his suits.” Train Definition 1: To practice or prepare for something. “I want to train for my first marathon this year.” Definition 2: A connected line of railroad cars. “She’s taking the train to her hometown for the holiday.” Watch Definition 1: To look at or observe something. “We’re going to watch a movie at the theater this weekend.” Definition 2: A small timepiece usually worn on the wrist. “Can you look at your watch and tell me what time it is?” Wave Definition 1: A motion made with the hands to greet someone. “I couldn’t get close to him in the crowd, but I did wave at him to say hello.” Definition 2: The swell or movement in a body of water (like the ocean). “A huge wave knocked me down when I was at the beach yesterday.”"
    },
    {
      "title": "Homographs have the same spelling, but different meanings and pronunciations.",
      "content": "Homographs have the same spelling, but different meanings and pronunciations. These words look the same when written down on paper, but they sound different when spoken out loud. [2] X Research source If you hear one in conversation, you’ll usually be able to tell what the speaker means because of the difference in pronunciation, but if you’re reading, you’ll need to use context clues. Here are some examples: Bass Pronounced “bas”: An edible fish. “I ordered sea bass for dinner at the restaurant.” Pronounced “bays”: The lowest range of musical notes; an instrument with four strings that plays low notes. “She plays bass in a rock band.” Bow Pronounced “boh”: A decorative knot with two curved loops and two loose ends. “I put a pretty bow on her birthday present.” Pronounced “bou”: To bend your body at the waist or incline your head in respect or reverence. “You’re supposed to bow if you meet the queen.” Close Pronounced “klohz”: To shut something, such as a box or an entrance. “Close the door on your way out, please.” Pronounced “klohs”: Near or in close proximity to. “I live really close to the store. The walk only takes a few minutes.” Content With emphasis on the first syllable: The material included in something. “What content do you have in that backpack?” With emphasis on the last syllable: Happy or satisfied. “I’m content with where I’m at in my life right now.” Desert With emphasis on the first syllable: A dry, barren piece of land. “Arizona and California have a lot of deserts.” With emphasis on the last syllable: To leave or abandon someone. “I can’t believe you would desert me on such an important day.” Does Pronounced “duz”: To perform an action. “She does her homework every night.” Pronounced “dohs”: A female deer. “We saw some beautiful does on our camping trip.” Lead Pronounced “leed”: To be in charge or guide a group of people. “She’s ready to lead her team to a state championship this year.” Pronounced “led”: A type of metal. “Lead is used to make things like batteries, electronics, and pipes.” Minute Pronounced “min-ut”: A unit of time equaling 60 seconds. “The cookies need one more minute in the oven.” Pronounced “mi-noot”: Small, unimportant, or trivial. “She’s too focused on the minute details, not the big picture.” Object: With emphasis on the first syllable: A thing or item. “There’s a strange object floating in the pool. Can you figure out what it is?” With emphasis on the last syllable: To oppose or disagree with something. “I object to that opinion—you’re totally wrong.” Present: Pronounced “preh-zent”: A gift. “She gave me a present for my birthday.” Pronounced “pree-zent”: To show or display. “Tomorrow I will present my big idea to my boss.” Sewer Pronounced “soo-er”: Underground pipes for carrying off waste and drainage water. “I dropped my ring down the drain, so now it’s probably in the sewer.” Pronounced “soh-er”: Someone who sews fabric or garments. “I asked her to fix my torn dress because she’s a great sewer.” Subject With the emphasis on the first syllable: A topic, idea, or branch of study. “My favorite subject in school is history.” With the emphasis on the last syllable: To exercise control over someone or force them to do something. “I didn’t want to subject him to my family drama, so I didn’t bring him to Thanksgiving dinner.” Tear Pronounced “teer”: A drop of liquid from your eye when you cry. “The movie was so sad. I had to wipe a few tears from my eyes.” Pronounced “tare:” To rip something. “Can you tear open that envelope for me?” Wind Pronounced “wihnd”: The movement of air; the breeze. “There’s a nice warm wind outside today.” Pronounced “wined”: To move in a spiral or twisted path. “I had to wind through all the people in the crowd to get to the front.” Wound Pronounced “woond”: An injury or cut on your body. “I need a bandaid for this wound. It’s still bleeding.” Pronounced “wownd”: To wrap something around something else, or to twist in a spiral. “I wound the leash around my hand a few times to make sure I had a good grip on it.”"
    },
    {
      "title": "Homophones have the same pronunciation but different meanings and (usually) different spellings.",
      "content": "Homophones have the same pronunciation but different meanings and (usually) different spellings. These words sound the same when spoken out loud in conversation, but they look different written down on paper. Think of the words “sew” and “so,” for example. [3] X Research source This means you’ll often need to rely on context clues to figure out which word someone means if they’re speaking out loud. Here are some examples: Alter/Altar Alter: To change. “I had to alter my plan because it wasn’t working.” Alar: A table or display used for religious or ritualistic purposes. “The ancient Greeks had altars to various gods.” Ate/eight Ate: To consume food. “I ate a sandwich for lunch today.” Eight: The number between seven and nine. “I invited eight of my friends to the party tonight.” Blew/blue Blew: To forcibly exhale. “She blew out the candles on her birthday cake.” Blue: The color of the sky and ocean. “That dress is such a pretty shade of blue.” Buy/bye/by Buy: To purchase. “I went to the grocery store to buy bananas.” Bye: Short for goodbye. “I have to hang up because class is starting. Bye!” By: A preposition identifying the person who did an action. “She was hired by the CEO himself.” Fair/Fare Fair: Just or equitable. “We played a fair game, and that’s what matters.” Fare: The money one pays for transportation. “I didn’t have enough for the bus fare, so I had to walk home.” Genes/Jeans Genes: Hereditary traits passed from parent to offspring. “I’m thankful to my parents for giving me some good genes.” Jeans: Pants made out of denim fabric. “I think I’ll wear jeans to dinner tonight, since it’s a casual restaurant.” Hour/Our Hour: A unit of time equaling 60 minutes. “I had to wait an hour to see the doctor.” Our: A pronoun designating that something belongs to “us,” the possessive form of “we.” “We’d love to invite you over to our house this weekend.” No/Know No: To deny or refuse something. “He asked me on a date, but I said no.” Know: To be aware of something. “I know how to get there without a map.” Nose/Knows Nose: The part of the face that projects above the mouth, used for smelling and breathing. “I’m sick, so my nose is all stuffed up.” Knows: To be aware of something. “She knows a lot about history.” Red/Read Red The color of rubies or blood. “I’m going to wear red lipstick tonight.” Read The past tense of read (a book, a sign, a letter etc). “I had to read that book for a class last year.” Role/Roll Role: An actor’s part in a play or movie, or a person’s job in a workplace. “She played the role of Juliet in her school’s production of Romeo and Juliet. ” Roll: To move something by turning it over and over on its axis. “He kicked the ball so it would roll down the hill.” There/Their/They’re There: At a certain place or position. “My car is parked over there under that tree.” Their: Belonging to certain people. “Their new house is beautiful.” They’re: Contraction for “they are.” “They’re going to the beach this weekend.”"
    }
  ]
}