{
  "url": "https://www.wikihow.com/Triangle-Method",
  "title": "What Is the Triangle Flirting Technique and Does It Work?",
  "steps": [
    {
      "title": "The Triangle Method involves looking at the other person's eyes and mouth.",
      "content": "The Triangle Method involves looking at the other person's eyes and mouth. On TikTok, this flirting technique is said to be a “foolproof way” to make your date fall in love . Not only can it show that you’re interested in the convo, but that you’re interested in kissing the other person, too. [1] X Research source Although the Triangle Method isn’t scientifically proven, there have been studies that show that maintaining eye contact with someone you like may increase their feelings of affection towards you. [2] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Look at one of the person’s eyes for 1 to 2 seconds.",
      "content": "Look at one of the person’s eyes for 1 to 2 seconds. While in a conversation with a person you’re interested in, focus on one of their eyes. Some people recommend starting with the person’s left eye, while others recommend looking at their right. It doesn’t matter what eye you start out with—either way, try to limit your gaze to a second or two. [3] X Research source If you’re feeling nervous about trying it out for the first time, practice doing it with someone you don’t know or a close friend who can practice it with you. Try to keep it natural—do it while you’re one-on-one, and try to slip the technique in while the person you’re interested in is talking about something else."
    },
    {
      "title": "Glance down at their mouth.",
      "content": "Glance down at their mouth. Glancing down at your date’s mouth can break down body language borders during dates. Try to keep it subtle and natural by looking down at their mouth for no longer than a second or two before coming up to the other eye. [4] X Research source The mouth is often associated with kissing, which might be why it’s said that looking at someone’s mouth might make them blush."
    },
    {
      "title": "Look back up at the person’s opposite eye.",
      "content": "Look back up at the person’s opposite eye. Look into their other eye for about a second. [5] X Research source Try repeating this method a couple of times throughout your date. Try to maintain eye contact for no longer than a little over 3 seconds—one study says that this is the maximum amount of time for prolonged eye contact. [6] X Research source"
    },
    {
      "title": "The Triangle Method may create intimacy, but it won’t make you fall in love.",
      "content": "The Triangle Method may create intimacy, but it won’t make you fall in love. This method might be a good flirting technique —it may encourage vulnerability that can contribute to falling in love. However, true love requires showing up for the other person constantly, communicating openly, and choosing to be with each other throughout the bad and the good. [7] X Research source If someone uses the Triangle Method on you, it can also let you know that they’re attracted to you and thinking about kissing you. [8] X Research source"
    }
  ]
}