{
  "url": "https://www.wikihow.com/Steepling",
  "title": "How to Steeple Your Fingers (and Why)",
  "steps": [
    {
      "title": "Steepling is a hand gesture in which you press your fingertips together.",
      "content": "Steepling is a hand gesture in which you press your fingertips together. Place your fingertips together and spread them out so your fingers look like a church steeple. Keep your hands arched in front of your chest or face. [1] X Research source Steepling may also be known as “finger tenting.”"
    },
    {
      "title": "Steepling conveys confidence in the subject you’re talking about.",
      "content": "Steepling conveys confidence in the subject you’re talking about. When you steeple your fingers during a conversation, it makes you appear more powerful and tells others that you’re an expert on the topic. Many people in leadership positions steeple their fingers when they give instructions or advice. [2] X Research source Steepling your hands higher up makes you appear more confident and doing it lower makes you appear less confident."
    },
    {
      "title": "Steeple your fingers when you want to convey confidence in your opinion.",
      "content": "Steeple your fingers when you want to convey confidence in your opinion. When you’re expressing thoughts you feel strongly about, steeple your fingers in front of your chin or chest to sound more reputable. The higher you hold your hands, the more confident you’ll appear. [3] X Research source Use steepled hand gestures sparingly because overusing them could come off as having an arrogant or know-it-all attitude, especially if you tilt your head back at the same time. Avoid doing a “handgun steeple” by only sticking out your index finger and thumb, which may be seen as a more aggressive gesture. [4] X Research source"
    },
    {
      "title": "Point your fingers down while you’re listening.",
      "content": "Point your fingers down while you’re listening. If you want to convey a confident and cooperative attitude when someone is speaking to you, steeple your fingers in front of your stomach or your lap. Keep your fingers pointed down to show that you’re more open and receptive. [5] X Research source"
    },
    {
      "title": "Look for positive body language to see if the person is being receptive.",
      "content": "Look for positive body language to see if the person is being receptive. If the person has positive body language before they steeple their fingers, such as open palms, leaning forward, or nodding, it’s a good sign they’re receptive to what you’re saying. [6] X Research source If someone crosses their arms, breaks eye contact, or crosses their legs before steepling their fingers, it may signal that they’re about to disagree and feel strongly about their opinion."
    },
    {
      "title": "Try asking an open-ended question to encourage someone to stop steepling.",
      "content": "Try asking an open-ended question to encourage someone to stop steepling. If someone in a more powerful position steeples their fingers while you’re talking, try asking them a question that requires them to answer verbally. They may stop steepling so they aren’t speaking into their hands. Example: If you’re asking your boss for a promotion and they steeple your fingers, you could ask something like, “What areas of my work have you noticed I could improve on to give myself the chances of moving up in the company?”"
    },
    {
      "title": "Let someone speak if they’re tapping their fingertips while steepling.",
      "content": "Let someone speak if they’re tapping their fingertips while steepling. If someone is quickly tapping their steepled fingers together, it may be a signal that they’re getting impatient. [7] X Research source Wrap up what you were saying and give the person a chance to share their thoughts."
    }
  ]
}