{
  "url": "https://www.wikihow.com/Why-My-Husband-Looks-at-Other-Females-Online",
  "title": "Why Your Husband Looks at Other Women Online",
  "steps": [
    {
      "title": "It’s likely a physical attraction and nothing more.",
      "content": "It’s likely a physical attraction and nothing more. If you’ve ever looked at a photo of a hot guy and just admired him, that could be exactly what your husband is doing. He could have zero emotional connection to the person he’s looking at—even if you find that especially unlikely. For some guys, a cute girl is just a cute girl and that’s it. [1] X Research source If your husband tells you he was just looking at an attractive woman and that’s it and he doesn’t have a history of lying or going behind your back, you’re probably safe to believe him."
    },
    {
      "title": "He may be curious about how an ex or old friend looks these days.",
      "content": "He may be curious about how an ex or old friend looks these days. Did you catch him scrolling through social media photos of an old girlfriend or someone he used to know? This could be his way of acting out a relationship with the “one who got away,” but the odds are much higher this is just benign curiosity. Social media is an awesome way to check up on old friends, so he might just be checking in. [2] X Research source With that said, it’s probably a cause for concern if he seems uniquely infatuated with a woman he knows or dated in the past. It isn’t reasonable for your husband to keep “checking in” on someone multiple times a week, for example."
    },
    {
      "title": "He may not think there’s anything wrong with what he’s doing.",
      "content": "He may not think there’s anything wrong with what he’s doing. It’s possible that he just simply doesn’t understand why this would be upsetting. He may be so secure in your relationship that he’s confident that looking at women online couldn’t possibly impact his marriage with you. [3] X Research source This is especially likely to be the case if he isn’t really hiding what he’s doing."
    },
    {
      "title": "He could be struggling with a porn addiction.",
      "content": "He could be struggling with a porn addiction. If this has been an ongoing concern of yours and he just seems like he can’t stop looking at naked women online, he may be struggling with a compulsion. Pornography addiction is a serious issue for a lot of men and he may need help dealing with it . Luckily, by seeking treatment in the form of therapy and confronting the problem head-on, he may be able to change. [4] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source It can be just as difficult to deal with a pornography addiction as it can be to deal with any other kind of addiction . It will take time, effort, and a whole lot of self-work."
    },
    {
      "title": "He may be emotionally cheating on you.",
      "content": "He may be emotionally cheating on you. Emotional cheating refers to a sustained, secretive closeness and intimacy with someone outside of your relationship. If he is fantasizing about being with the woman he’s looking at online and his thoughts and emotions are falling outside the scope of empty fantasy, he may be seriously straying from the tenets of your marriage. [5] X Research source He could be physically cheating on you with this person too, but it’s relatively unlikely if he’s looking at photos. Still, it could be worth looking into if he exhibits other signs he’s cheating . Reader Poll: We asked 177 wikiHow readers which type of cheating they’d be most hurt by, and 52% of them agreed that—besides classic cheating—they’d be most hurt by emotional infidelity . [Take Poll]"
    },
    {
      "title": "Ask your husband to discuss this if you’re bothered by his behavior.",
      "content": "Ask your husband to discuss this if you’re bothered by his behavior. Ask your husband if you two can talk and approach the conversation in a calm, productive way . Tell him how you feel and ask him to honestly explain why he’s looking at other women online. If you aren’t comfortable with it, ask him to stop. [6] X Research source"
    },
    {
      "title": "Use “I” language to voice your concerns.",
      "content": "Use “I” language to voice your concerns. Using “I” language will keep the conversation from feeling like a confrontation or an attack, and it prioritizes the way you personally feel, which is important. By framing the convo around your experience (as opposed to his action), you’ll have an easier time getting him to empathize with you. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source As an example, instead of, “You aren’t even interested in me anymore,” you could say, “I feel unattractive and unwanted when I don’t get the same attention these photos do.” Instead of saying something like, “You are cheating on me with these women online” say, “I feel unloved when you look at these women online.”"
    },
    {
      "title": "Explore why you’re upset with him to get to the crux of the problem.",
      "content": "Explore why you’re upset with him to get to the crux of the problem. For a lot of people, it’s really not about the photos—it’s about what the photos signal. You might feel like he’s not giving you the attention you need, or like this means something is “off” in your relationship. Address these feelings together and don’t leave anything out. For example, maybe you wouldn’t be so upset by the photos if you didn’t already feel like you two were drifting apart. You might say, “You know, it just feels like another signal that we aren’t clicking the way we used to.”"
    },
    {
      "title": "Ask him to stop (or limit) his viewing for you.",
      "content": "Ask him to stop (or limit) his viewing for you. If you don’t feel comfortable straight up asking him to stop, you can always request that he keeps his viewing private and uncommon. Your husband should have no problem agreeing to this line. [8] X Research source Whether or not it’s reasonable to ask him to stop entirely depends on the terms of your relationship. If you two generally allow one another a ton of autonomy and space, this may be an unreasonable ask. On the other hand, if you two often set clear boundaries for one another, it’s a reasonable request."
    },
    {
      "title": "Give him an ultimatum if he won’t get help for a problem.",
      "content": "Give him an ultimatum if he won’t get help for a problem. If he has a serious problem looking at pornography or photos/videos of other women, it’s okay to set a hardline expectation that he gets help. If he refuses to change willingly and this is dramatically impacting your relationship, it may be time to consider a separation . This may be the wakeup call he needs to finally change. [9] X Research source This is a nuclear option, but it’s okay to take this step if you can no longer feel safe and secure in your relationship."
    },
    {
      "title": "Ignore it if you’re not particularly upset about it.",
      "content": "Ignore it if you’re not particularly upset about it. If, after some reflection, you don’t actually think this is a big deal, it’s totally okay to just leave your husband to his own devices. This may also be the ideal option if you ask your husband what’s going on and he gives you an open, convincing answer that indicates he’s not that invested in the photos he peruses. [10] X Research source"
    },
    {
      "title": "It’s relatively common for men to look at other women online.",
      "content": "It’s relatively common for men to look at other women online. Basically everybody will come across photos of attractive people online at some point—even if they aren’t seeking it out on purpose. When it comes to lewd photographs or porn, that’s pretty common as well. Roughly 70% of men will look at this stuff when they’re in a relationship, so this is very ubiquitous behavior. [11] X Research source There’s a difference between just looking at someone, and ogling them in front of you in a way that’s disrespectful. The fact that this is relatively normal does not mean you’re wrong for being suspicious or upset. Every relationship has different rules, norms, and boundaries; if he has violated one of them, this is not okay."
    },
    {
      "title": "It may not be a big deal if he’s just appreciating someone’s beauty.",
      "content": "It may not be a big deal if he’s just appreciating someone’s beauty. You two are married, and the strength and depth of your bond is more powerful than some random photo on the internet. But that doesn’t mean your husband can’t possibly find someone else attractive, and that’s totally okay! It’s the same for you, right? Think about it. Do you get a little flushed watching a Ryan Gosling film or an Usher video? That doesn’t mean you don’t love your husband or find him attractive! [12] X Research source With that said, it’s not a free pass to just look at whatever he wants. If he’s watching some really intense pornography, it’s harming your relationship, or he’s looking at photos he shouldn’t be looking at (like of children, or nudes of other women he knows IRL), that’s not okay."
    },
    {
      "title": "It is a major concern if your husband does something you find upsetting.",
      "content": "It is a major concern if your husband does something you find upsetting. Even if looking at photos on their own isn’t necessarily harmful, it is a problem if he continues to do something that hurts you. It doesn’t really matter what other men do or what’s “natural”—your husband shouldn’t do things that make you suffer and that’s it. [13] X Research source Try to not read too much into this if it’s the first time something like this has ever come up in your relationship. He may not have known he was doing anything problematic or upsetting."
    }
  ]
}