{
  "url": "https://www.wikihow.com/Stop-Talking-About-Yourself",
  "title": "How to Stop Talking About Yourself",
  "steps": [
    {
      "title": "Watch your vocabulary.",
      "content": "Watch your vocabulary. If you're using the words I, me, and my in your conversation, then you may not be having a conversation. You may only be talking about yourself. Actively concentrate on this when you're speaking to others. [1] X Expert Source Lynda Jean Certified Image Consultant Expert Interview. 17 November 2020. After all, the only way to stop a behavior is to recognize it. An exception would be statements such as \"I agree,\" or \"I hear what you're saying,\" or \"I would suggest approaching the issue this way.\" Using appropriate \"I\" statements show you're engaged and interested and recognize conversations are a two-way street. A great way to remember this is to keep a rubber band around your wrist. Every time you catch yourself using any of these words, snap the rubber band. It may hurt a little, but it's a proven psychological method. [2] X Research source Start practicing these steps when conversing with friends. Ask them to tell you if you've missed a step, as friends will always be the most supportive."
    },
    {
      "title": "Pay attention to whose story it is.",
      "content": "Pay attention to whose story it is. If a person is telling you a story about something that happened to him, remember that it's their story, not yours. Remember, he's sharing something that's important to him."
    },
    {
      "title": "Resist shifting the focus to you.",
      "content": "Resist shifting the focus to you. This transition to the next phase is natural. After learning not to use \"I,\" \"me,\" and \"mine,\" and instead replace them with \"you\" and \"yours,\" it's only natural to work on conversational transitions. It's easy to fall into the trap of shifting focus to yourself. If your friend's telling you about her new SUV and how it makes her feel safe, don't immediately begin talking about how you prefer a more elegant vehicle and then go off about your Mercedes. Instead, try saying something like, \"That's interesting. I prefer the safety, style, and elegance of a sedan. Do you think SUV's are safer than sedans?\" This shows you're engaged and curious about your friend's opinion."
    },
    {
      "title": "Keep references to yourself brief.",
      "content": "Keep references to yourself brief. Sometimes within the course of the conversation, it's impossible not to talk about yourself. That's natural, however, you shouldn't be talking about yourself 100% of the time, yet you should be listening 100% of the time. When this happens, try redirecting the conversation away from yourself and putting the subject back on your conversation partner. For instance, if your friend asks what kind of car you drive, you may say something like: \"I drive a hybrid. It really saves on gas and there are other perks like rebates and no parking meter fees. Have you ever thought about owning one?\" This response keeps your position brief and throws the question back to your friend. In doing so, you've made your friend the conversation's gatekeeper."
    },
    {
      "title": "Find constructive ways to get your thoughts and opinions heard.",
      "content": "Find constructive ways to get your thoughts and opinions heard. It's important to be a good and active listener, but you need to express your own thoughts and opinions, too. If you are trying to lessen talking about yourself, try things like journaling, open mic events, and submitting essays or reports, which may provide the opportunity. This also encourages you to focus thoughtfully on what you want to say, rather than talking just for the sake of it. [3] X Research source"
    },
    {
      "title": "Practice cooperation instead of competition.",
      "content": "Practice cooperation instead of competition. A conversation shouldn't be a struggle to see who gets to talk about themselves, or does the most talking. Think of it this way: when you were a kid, you took turns on toys or games. A conversation is the same thing. If it's your friend's turn, let him talk. You'll have your turn, since a conversation is a two-way-street, but allow your friend equal time to talk about himself, giving him your full attention. [4] X Research source Don't approach it as if trying to convince the person that your idea or way of seeing/doing things is right. Instead, try to learn and grow from what he's saying. Don't manipulate the conversation to serve your own agenda and steamroll your counterpart. Consider this approach: you're on the same team, trying to find an answer. Conversations like sports are more fun when you're interacting with each other, rather than against each other. [5] X Research source"
    },
    {
      "title": "Look for what you can learn.",
      "content": "Look for what you can learn. There's an old saying, \"you can't learn anything new if you're talking.\" You already know your perspective. To broaden, change, or confirm that point of view, you must let others state theirs. For example, when discussing dinner, you might say: \"I prefer ordering tapas to entrees, because I get to taste a variety of the chef's offerings. Which do you prefer?\" (Then, let them respond.) \"That's interesting; why do you think that is?\" Obviously your responses would depend on what the person says, but you can continue to probe her reasoning, so that you get a thorough understanding of why she thinks, feels, or believes what she does."
    },
    {
      "title": "Ask probing questions.",
      "content": "Ask probing questions. [6] X Expert Source Lynda Jean Certified Image Consultant Expert Interview. 17 November 2020. You can't talk about yourself if you're asking well-thought-out questions. It requires the other person to be the focal point. This takes “look for what you can learn, not say,” to an entirely new level. [7] X Research source Not only does this keep your conversation partner as the focal point, it allows him to delve more deeply into his knowledge/feelings/beliefs which, in turn, strengthen the connection. Be in the moment, listening, when he answers your question. Invariably, this will lead to a mindset allowing further questions, resulting in a very positive experience for all involved."
    },
    {
      "title": "Show how the world looks through your eyes.",
      "content": "Show how the world looks through your eyes. This may sound like the exact opposite of what you're trying to learn, but there's a difference between talking about yourself and your world view. Try stating your opinion, such as \"I see the two-party system as limiting our choices and narrowing the potential for alternative voices and points of view in our political system.\" Then follow this with something like: \"How do you see this working in our government?\" Once you've put your unique point of view out there, use what you've learned in your conversation thus far to get your conversation partner to expound on his viewpoint. Then probe his point of view with questions geared to learn more. This is how to converse about ideas on a higher level."
    },
    {
      "title": "Offer credit.",
      "content": "Offer credit. Think of it like a credit card. How happy would the person you're talking to be if you gave them money for their guidance or opinion? They'd probably feel pretty good about themselves. They'd feel just as good if you gave them the credit. Thank the person for their recommendation or advice. If your friend recommends a restaurant, tell the people you're with, \"X suggested we come here. Isn't it great?\" Always give credit for success when it's warranted. If you did well on a project at work, you might say something like: \"I have a great team working with me; they make it all happen.\""
    },
    {
      "title": "Compliment other people.",
      "content": "Compliment other people. It takes selflessness and an ability to recognize the strengths of others to do this. Doing so makes your conversation partner more engaged and feel good about speaking with you, because she knows you'll also be saying good things about her. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Some examples of compliments include: \"Doesn't Gina look stunning in that dress? Just incredible. And, it actually pales in comparison to her wit!\" \"I think Evelyn's thoughts on the global warming issue are incredibly insightful and full of potential solutions. Why don't we go join her? I think you'll find her fascinating.\""
    },
    {
      "title": "Engage in the art of listening.",
      "content": "Engage in the art of listening. [9] X Expert Source Lynda Jean Certified Image Consultant Expert Interview. 17 November 2020. Listening, really listening, is an art. It requires you to let go of yourself and your thoughts, and focus solely on what the other person is saying. This effort allows you to truly melt away. Your need to talk about yourself dissipates, then disappears. Make a pact with yourself that you won't speak unless your conversation partner puts the ball in your court. Then make another pact: you'll put the ball right back to her and go back to listening."
    },
    {
      "title": "Try active listening techniques.",
      "content": "Try active listening techniques. This means fully concentrating on what the other person is saying and requires you respond to the speaker by paraphrasing or restating his main point(s). [10] X Research source You can also add a little something when you finish paraphrasing by using different phrases: which means that; so then; that would require; you would then; etc., and then add your thoughts on what happens next. Non-verbal cues like nodding your head, smiling, and other facial/physical expressions let the other person know you're engaged and have feelings about everything he's saying.. [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Ask questions.",
      "content": "Ask questions. [12] X Expert Source Lynda Jean Certified Image Consultant Expert Interview. 17 November 2020. Additional questions that give your conversation partner more time to talk about her subject are also key, and there are several different types, including: [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Closed questions. These are often “yes or no” questions. They're answered in one way or the other, and the line of questioning stops there. Open-ended questions. These give your conversation partner ample room to expand on what she's already been talking about and gives you a more well-rounded knowledge of her subject. These questions often start with phrases like: \"How do you see...\" or \"What/why do you think...\""
    },
    {
      "title": "Validate what your conversation partner says.",
      "content": "Validate what your conversation partner says. It depends on the situation and topic you've been talking about. Think of it as either a personal or general validation. [14] X Research source You (Personal): \"Wow, it takes a lot of courage to look at yourself so openly and admit things like that.\" You (General): \"That is one of the most insightful analyses of the issue I've ever come across.\""
    }
  ]
}