{
  "url": "https://www.wikihow.com/Understand-Yourself",
  "title": "How to Understand Yourself",
  "steps": [
    {
      "title": "Take a personality test.",
      "content": "Take a personality test. The first thing you can do to gain a greater understanding of yourself is to get some objective assessment. You can also ask people you know, but their experience of you could lead them to the same biases that you have. Getting some objective opinions will give you a more accurate picture and lead you to consider some things you might not even have thought of. There are a number of established tests that you can take to learn about the different aspects of yourself (and more than a few less-reputable ones): The Myers-Briggs Personality type theory says that all people have 1 of 16 different basic personalities. These personalities can predict how you interact with people, the kinds of interpersonal problems and strengths that you have, and what kind of environment you live and work in best. [1] X Research source If you're struggling to understand what makes you happy and what you should do with your life, consider taking a career test. These types of tests can help you decide what you might find the most satisfying, usually based on your personality and what you do for fun."
    },
    {
      "title": "Understand your learning style.",
      "content": "Understand your learning style. There is a theory that every person learns and processes their experience of the world in one of a number of different ways. Knowing what learning style you have will help you even once you're out of school and can help you to understand why you struggle with some activities and excel at others. As with the others, there are a number of free tests that you can take online. Just be aware that this is a disputed science, with many theories about how many learning styles exist, and you may get different results depending on which test you take."
    },
    {
      "title": "Do character writing exercises.",
      "content": "Do character writing exercises. When writers go to write a book, they will often do writing exercises which help them to better understand the characters that they're writing about. You can do these same exercises to get a better understanding of yourself and many can be found online for free. These exercises may not have anything official to say about you, often relying on you to draw your own conclusions about what your answers say about you, but they may lead you to think about things you never thought about before. Try answering the following questions to get an idea of what this is like: How would you describe yourself in one sentence? What is your purpose in your life's story? What is the most important thing that has ever happened to you? How did it change you? How are you different than the people around you?"
    },
    {
      "title": "Evaluate your strengths and weaknesses.",
      "content": "Evaluate your strengths and weaknesses. You can come to a better understanding of who you are and what is most important to you by thinking about your strengths and weaknesses. Importantly, you’ll want to compare your perception of your strengths and weaknesses to the strengths and weaknesses identified by your friends, family, and coworkers. The things that they see that you don’t can tell you a lot about yourself and how you see yourself. [2] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020. Examples of strengths include determination, devotion, self-discipline, thoughtfulness, decisiveness, patience, diplomacy, communication skills, and imagination or creativity. Examples of weaknesses include close-mindedness, self-centeredness, difficulty perceiving reality, judgement of others, and issues with control."
    },
    {
      "title": "Examine your priorities.",
      "content": "Examine your priorities. What you think is most important in life and in your day-to-day interactions can tell you a lot about yourself. Think about your priorities, compare them to the priorities of other people you respect, and think what your conclusions say about you. Of course, you need to be open to the idea that you might not have your priorities in the best order (many people don’t), which can also teach you a lot about yourself. [3] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020. If your house were burning down, what would you do? What would you save? It’s amazing how fire exposes our priorities. Even if you’d save something practical, like your tax records, that still says something about you (probably that you prefer to be prepared and not meet resistance in life). Another way to tell what your priorities are is to imagine that someone you love was being openly criticized for something that you don’t support (let’s say, they’re gay but you don’t agree with the lifestyle). Do you support them? Protect them? How? What would you say? Our actions in the face of peer criticism and possible ostracization can reveal our priorities. Some examples of priorities that people often have include: money, family, sex, respect, security, stability, material possessions, and comfort."
    },
    {
      "title": "Look at how you've changed.",
      "content": "Look at how you've changed. Look at your past and think about how what has happened to you over your lifetime has affected how you act and think today. Looking at how you’ve changed as a person can reveal a lot about why you act the way that you do, because our current behaviors are built on our past experiences. For example, maybe you tend to get really defensive around shoplifters and are very harsh to people you perceive as stealing. When you think about it, you might remember stealing a candy from a store as a child and your parents punishing you very harshly, which would explain your stronger than normal reaction to that behavior now."
    },
    {
      "title": "Check yourself when you experience strong emotions.",
      "content": "Check yourself when you experience strong emotions. Sometimes, you’ll find yourself getting really, strongly angry, sad, happy, or excited. Understanding what sets off these stronger-than-normal reactions, what their root cause is, can help you understand yourself better. For example, maybe you get really violently angry about people talking during a movie. Are you really angry about the talking or are you angry because you felt like it was a personal sign of disrespect towards you? Since this anger doesn’t help the situation, you might be better off trying to find ways that you can be less concerned about people respecting you, just to keep your own blood pressure down."
    },
    {
      "title": "Watch out for repression and transference.",
      "content": "Watch out for repression and transference. Repression is when you don’t want to think about something, so you help yourself to forget it even happened. Transference is when you emotionally react to one thing, but what you’re really reacting to is something else. Both of these behaviors, which are very common, are unhealthy and finding out why you do them and finding ways to handle those emotions in a healthier way will make you a much happier person. [4] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020. For example, you might think that you’re not sad about your grandma dying, but when your family decides to get rid of her favorite old chair you get really angry and upset. You’re not really upset about the chair being gone. It was stained, smelled funny, and probably contained radioactive foam for all you know. You’re upset that your grandma is gone."
    },
    {
      "title": "Notice how and when you talk about yourself.",
      "content": "Notice how and when you talk about yourself. Do you turn every conversation you have into a conversation about yourself? Do you make jokes at your own expense whenever you talk about yourself? How and when you talk about yourself can reveal a lot about how you think and how you perceive yourself. It’s healthy to talk about yourself sometimes and it’s good to realize that you can’t do everything, but you should pay attention to extremes and think about why you go to those extremes. For example, your friend might have just finished her PhD, but when you’re all talking about it, you turn the conversation to be about when you were working on your master's. This might be because you feel embarrassed that you only got a master's and they finished a PhD, so you want to make yourself feel more important or accomplished by making the conversation about you."
    },
    {
      "title": "Look at how and why you interact with others.",
      "content": "Look at how and why you interact with others. When you interact with people, do you tend to put them down? Maybe you’ve noticed that you only choose to spend time with people that have more money than you. Behaviors like this can also teach you things about yourself and what is really important to you. For example, if you’re choosing to only spend time with friends that have more money than you, it may show that you want to feel more wealthy by letting yourself pretend you’re equal to your friends in that way. Think about what you \"hear\" vs what was said. This is another thing you can look out for when examining your interactions with your friends and family. You might find that what you hear is something like “I need your help” when what they actually said was “I want your company”, revealing that you have a strong need to feel useful to others."
    },
    {
      "title": "Write your biography.",
      "content": "Write your biography. Write your biography in 500 words in 20 minutes. This will require you to type very fast and think less about what you will include, helping you to identify what your brain thinks is most important when defining who you are. For many people, 20 minutes won’t even be enough time to type 500 words. Thinking about what you are upset you weren’t able to get out vs what you did say can also tell you things about yourself."
    },
    {
      "title": "See how long you can wait for gratification.",
      "content": "See how long you can wait for gratification. Studies have shown that people who can delay satisfaction have a generally better time getting through life, getting better grades, more education, and maintaining a healthier body. Think about situations where you could have delayed gratification. What did you do? If you have trouble delaying gratification, this is something to look out for a work on, since it often plays a role in success. Stanford did a famous experiment with this called the Marshmallow Experiment [5] X Research source , where they watched how some kids reacted when presented with marshmallow treats and then followed their progress through life, over the course of many decades. The children who put off their treat in favor of a bigger reward did better in school, work, and health-related areas."
    },
    {
      "title": "Analyze whether you need to tell or be told.",
      "content": "Analyze whether you need to tell or be told. When you’re doing something, like work, think about whether you seek out your next task without having to be asked, whether you need someone else to tell you what to do before you act, or whether you’d rather skip all of that in favor of just telling someone else what to do. Each of these things can say different things about you, depending on the situation. Remember that there’s nothing wrong with needing someone to give you instructions and guidance before doing a task. It’s just something to be aware of so that you can better understand and control your own behavior when important things come up. For example, if you know you’re bad at taking control in a situation but you know you need to, you can think about how your reluctance is just “a habit” that you can break and not a necessity."
    },
    {
      "title": "Look at the way you react in tough or new situations.",
      "content": "Look at the way you react in tough or new situations. When things get really tough, such as when you lose your job, a loved one dies, or someone is threatening you, the more hidden or restrained parts of your character tend to come out. [6] X Research source Think about how you’ve reacted in the past when the tension has gotten high. Why did you react the way that you did? How do you wish that you’d reacted? Would you be more likely to react that way now? You can also imagine these scenarios, but be aware that your hypothetical responses may be clouded by your bias and not accurate to how you’d really react. For example, imagine you were moving to a new town where no one knows you. Where would you go to make friends? What kind of people would you try to make friends with? Is there anything you’d change in terms of what you tell people about yourself vs what all your current friends know about you? This can reveal your priorities and what you’re looking for in your social interactions."
    },
    {
      "title": "Think about how having power influences your behavior.",
      "content": "Think about how having power influences your behavior. If you’re in any kind of position of power, you might want to think about the effect it has on your behavior. Many people, when put in a position of power, will become harsher, less open-minded, more controlling, and more suspicious. [7] X Research source When you find yourself making decisions that affect others, think about why you’re really making that choice: is it because it’s the right thing to do or is it because you need to feel in control of the situation? For example, when you’re babysitting your little brother, do you put him in timeout just for a small problem? Does this really help him learn or are you just trying to find reasons to put him in timeout?"
    },
    {
      "title": "Examine your influences.",
      "content": "Examine your influences. The things that have an influence on how you think and how you see the world can say a lot about you, whether you actually conform to what they teach or not. In seeing where your influences have shaped your behavior, you can better understand the root of the behaviors you do have. In seeing where you deviate from those taught behaviors, you can also identify your uniqueness and your own personal thinking. Thinks that influence you include: Your media intake, such as TV shows, movies, books, and even what porn you watch. Your parents, who might teach you things varying from tolerance vs racism to material wealth vs spiritual wealth. Your friends, who will pressure you into enjoying certain things or introduce you to new and wonderful experiences."
    },
    {
      "title": "Let go of your defensiveness.",
      "content": "Let go of your defensiveness. If you want to really reflect and understand yourself better, you're going to need to think about parts of yourself that you really don't like and admit to some things you might not want to admit to. You'll be naturally defensive about admitting these kinds of things to yourself, but if you're really going to understand how you work, then you're going to need to let go of that defensiveness. Even if you don't let those barriers down for other people, you at least have to let them down for yourself. Becoming less defensive about your weaknesses can also mean opening yourself up to getting help from other people and making amends for past mistakes. If you're more open to discussion, criticism, and change, then other people can really help you understand and improve yourself."
    },
    {
      "title": "Be honest with yourself.",
      "content": "Be honest with yourself. We lie to ourselves a lot more than we'd like to think about sometimes. [8] X Research source We'll help ourselves to think that we made some questionable choices for noble or logical reasons, even when we were really just being vindictive or lazy. But hiding from the real reason behind our motives doesn't help us change and develop into better people. Remember: there's no point in lying to yourself. Even if you discover truths about yourself that you really don't like, this only gives you the opportunity to take those problems head on instead of just pretending like they don't exist. [9] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020."
    },
    {
      "title": "Listen to what others say to and about you.",
      "content": "Listen to what others say to and about you. Sometimes, especially when we do bad things, others will try to warn us against those behaviors. We also have a tendency not to listen. Sometimes this is good, because lots of people will say things about you just because they want to hurt you and their comment will have no basis in fact. But sometimes what they say is a good, outsider’s analysis of how you behave. Think about what people have said in the past and ask for some new opinions about your behavior. For example, your sister might notice that you tend to exaggerate. But this is unintentional on your part, which can serve to show you that your perception of reality is a bit off. There’s a big difference between evaluating what they say about you and letting that opinion control your life and actions. You shouldn't tailor your behavior to suit other people unless it is having a significantly negative impact on your life (and even then, you might want to consider that your environment might be the problem, not your behavior). Make changes because you want to change, not because someone else tells you that you should."
    },
    {
      "title": "Give advice.",
      "content": "Give advice. Giving advice will often give you a great opportunity to think through your own problems and reevaluate them from the outside. When looking at someone else’s situation, you will be more likely to think about situations and circumstances that you never thought of before. You don’t even have to do this activity for real, although helping your friends, family, and even strangers is a nice thing to do. You can give advice to your older and younger selves, in the form of a letter. This will help you think through your past experiences and what you took away from them, as well as what is really important to you for the future."
    },
    {
      "title": "Take time and experience life.",
      "content": "Take time and experience life. The best way to really get to know yourself, however, is to just experience life. Just like getting to know another person, understanding yourself takes time and you’ll learn far more through experiencing life than by interviewing yourself and taking tests. You can try: Traveling. Traveling will put you in lots of different situations and test your ability to handle stress and adapt to change. You’ll come to a greater understanding of your happiness, priorities, and dreams than you ever could just sitting in your same old boring life. Getting more education. Education, real education, challenges us to think in new ways. Getting an education will open your mind and lead you to think about things you’d never even considered. Your interests and how you feel about these new things you learn can reveal things about you. Letting go of expectations. Let go of other people’s expectations for you. Let go of your expectations for yourself. Let go of your expectations for what life should be like. When you do this, you’ll be more open to seeing what new experiences might make you happy and fulfilled. Life is a crazy roller-coaster and you're going to encounter a lot of things that scare you because they're new or different but don't close yourself to those experiences. They might make you happier than you've ever been."
    }
  ]
}