{
  "url": "https://www.wikihow.com/Store-Meringues",
  "title": "How to Store Meringues",
  "steps": [
    {
      "title": "Cool your meringues before storing them.",
      "content": "Cool your meringues before storing them. Remove your meringues from the oven and place them in a shallow, uncovered wide container. In the summer, cool them in the refrigerator immediately before storing them in the open. Cooling your meringues prior to storing them is especially important when the weather is humid or rainy. Always make sure your meringues are completely dry before you remove them from the oven. If they can be lifted off of parchment paper and the bottoms are dry, with little to no residue left behind, they're ready to be removed. [1] X Research source"
    },
    {
      "title": "Stack your meringues gently in airtight containers.",
      "content": "Stack your meringues gently in airtight containers. Always leave enough space between the top of the meringues and the lid to avoid squeezing them together. These are delicate desserts—if you find yourself pushing them together to fit them all in the jar, start another jar. [2] X Research source Always use airtight containers, which prevent moisture from destroying the meringues' soft texture. Mason jars are a great storage option. Ceramic containers aren't ideal, as their porous design lets air inside, which can destroy the texture of your meringues."
    },
    {
      "title": "Line parchment paper between each layer of meringues.",
      "content": "Line parchment paper between each layer of meringues. Using parchment paper to protect your meringues as you stack will minimize contact between the vertical layers. This is the best way to keep them from crushing each other. [3] X Research source Place a final piece of parchment paper underneath your lids to prevent the top area of the cookies from getting crushed by the lid."
    },
    {
      "title": "Store your meringues at room temperature (73 °F (23 °C)) for up to 3 weeks.",
      "content": "Store your meringues at room temperature (73 °F (23 °C)) for up to 3 weeks. After closing the lid of your containers, store them in the region of your kitchen with the coolest temperature. Regularly test their temperature using your food thermometer to ensure that they never rise above room temperature. Avoid placing your meringue jars in direct sunlight. Don't store your meringues for more than 3 weeks. [4] X Research source"
    },
    {
      "title": "Refrigerate your meringues in a wide and shallow container.",
      "content": "Refrigerate your meringues in a wide and shallow container. Place all of your meringues into a wide, shallow container immediately after removing them from the oven. Afterwards, put the container (uncovered) into the fridge for cooling. Placing warm meringues in the freezer right after cooking can reduce the temperature of surrounding items and cause them to thaw and refreeze, which can ruin the texture and taste of some foods. Freezer-safe bags are an option, although they leave your meringues open to damage when they come into contact with other foods. [5] X Research source"
    },
    {
      "title": "Use your food thermometer to determine when your meringues are 73 °F (23 °C).",
      "content": "Use your food thermometer to determine when your meringues are 73 °F (23 °C). If you freeze your meringues before letting them cool, they can raise the temperature of your freezer. This can cause other items in the freezer to thaw and refreeze, which can sometimes change the foods' texture and taste."
    },
    {
      "title": "Layer your meringues in a freezer-safe container.",
      "content": "Layer your meringues in a freezer-safe container. Start off by creating your first row of meringues at the bottom of the container. Afterwards, place a layer of parchment paper on top of the first layer and continue repeating this still until the container is full. Avoid pressing down as you stack your meringues—they are easily crushed."
    },
    {
      "title": "Seal your container and place it in the freezer for up to 1 month.",
      "content": "Seal your container and place it in the freezer for up to 1 month. Always make sure that when you seal your container, you're not crushing the meringues underneath the lid. Leave about 0.5 inches (1.3 cm) of head space between the top of your meringues and the lid. Once the container is sealed, place it in the freezer. If your freezer is a bit crowded, use some adhesive labels to stick to your container. You can store your meringues in the freezer for about 1 month. [6] X Research source"
    },
    {
      "title": "Defrost your meringues for 2 to 3 hours before eating.",
      "content": "Defrost your meringues for 2 to 3 hours before eating. Remove your meringues from the freezer and defrost them on a wire rack at room temperature (73 °F (23 °C)) prior to eating. You can serve them at room temperature or reheat them in the oven until they are heated through. [7] X Research source Try not to defrost your meringues in a humid environment, as they will easily absorb the surrounding moisture. This will soften them on the outside. If you're going to reheat your meringues, preheat your oven to 250 °F (121 °C) and then heat your meringues for 15 to 20 minutes."
    }
  ]
}