{
  "url": "https://www.wikihow.com/Spiritually-Release-an-Ex",
  "title": "How to Spiritually Release an Ex",
  "steps": [
    {
      "title": "Go no-contact and get rid of your ex’s old stuff to remove their presence.",
      "content": "Go no-contact and get rid of your ex’s old stuff to remove their presence. Cut all ties by blocking them on social media and in your phone so that you two can’t contact one another. Go around your home and remove any photos of you and your ex. Fill a box with any gifts they gave you, or trinkets that remind you of them. Put all of it in storage or throw it out. [1] X Research source This will cut any physical and emotional connections you two may still have. Now all that’s left is their energy."
    },
    {
      "title": "Take a shower or bath to clean your body and wash away any bad vibes.",
      "content": "Take a shower or bath to clean your body and wash away any bad vibes. You can listen to some uplifting music or light some candles while you do this if you want to cultivate a positive environment for this. Take a long, comfortable shower or bath and wash your body head to toe. [2] X Research source As you do this, picture yourself literally scrubbing away any bad energy your ex has left you with. [3] X Research source Once you dry off and change, you can move forward with whatever cleansing ritual or process makes the most sense to you given the energy you’re exposed to."
    },
    {
      "title": "Use breathing exercises to meditate and ask a higher power for help.",
      "content": "Use breathing exercises to meditate and ask a higher power for help. Sit comfortably in a quiet part of your home and close your eyes. Slow your breathing and breathe in through your nose. Feel the air filling your stomach and breath out slowly through your mouth. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source As you fall into a trance-like meditative state, ask whatever higher power you believe in to intervene and cut the spiritual connection to your ex. [5] X Research source You might ask in your mind, “Whatever angels looks over me, please cut the ties that connect me to my ex so that I may grow and move on.”"
    },
    {
      "title": "Recite a mantra to ward off your ex’s energy.",
      "content": "Recite a mantra to ward off your ex’s energy. If you feel your ex’s spirit periodically wandering back into your home or headspace, repeat a mantra to protect you from the incursion and keep their spirit from settling in. This is a simple way to reorient yourself and keep your energy safe from the disruption. [6] X Research source For example, you might say, “I am protected from your spirit and you cannot disturb me,” or, “Away, away, away with you.” Alternatively, you could try something like, “I am safe. I am loved. I am free,” or, “I cannot be controlled or ruled by you anymore.”"
    },
    {
      "title": "Visualize your ex’s energy leaving you and your home.",
      "content": "Visualize your ex’s energy leaving you and your home. This is known as quantum healing. The idea is that your body’s energy is tied directly to your ability to visualize it. In your mind’s eye, imagine the energy surrounding you. Picture your ex’s energy flowing away from you, while your home and body fill with nothing but positivity and love. [7] X Research source Doing this whenever you feel your ex’s spirit in your home can dramatically improve your headspace and help you maintain a positive environment."
    },
    {
      "title": "Prepare your space by opening the windows and burning sage.",
      "content": "Prepare your space by opening the windows and burning sage. This will create a sacred space for you to cut your ex’s energy cord. An energy cord refers to a spiritual connection between two beings. Even if you and your ex have broken up, that cord may still be there. To prepare to cut it, open the windows in your home to allow fresh air in. Light a sage stick and walk around your home with it. Picture the smoke clearing out your ex’s spirit and cleansing your home. [8] X Research source The burning of sage to cleanse a space goes back to prehistoric times. The idea is that sage can promote healing, wisdom, and cleanliness. You can buy sage online or from a local esoteric or occult store. Some candle shops may sell sage as well. You can allow the sage to continue burning in an incense holder, abalone shell, or flame-resistant dish, or put it out. If you can’t burn sage in your home because you don’t have enough ventilation, walk around your home spritzing the area with sage spray ."
    },
    {
      "title": "Light a symbolic, black candle and set your intentions.",
      "content": "Light a symbolic, black candle and set your intentions. You can use any candle for this, although a black candle is ideal. Black candles represent rebirth and the cleansing of negative energy in a time of darkness. [9] X Research source Set the candle in a candle holder and place it in the middle of your room. Light the candle and pause for a moment to calm your mind. Think about what you want from this experience and set your intentions . [10] X Research source To set your intention, you might say, “I want to be free from my ex’s energy so that I can move on and grow.” You can also set a more general intention, like, “I want to be free.” Don’t worry if you don’t have a black candle. It’s the intention that matters, not the candle itself."
    },
    {
      "title": "Bind your ankles together with some loose thread.",
      "content": "Bind your ankles together with some loose thread. This thread represents the cord connecting you to your ex. In a relationship, you’re committed to stand with your significant other, so this will help you free yourself. Grab some cheap thread or shoelaces and wrap them around your ankles. Tie them like a shoelace, and sit in front of the candle. Say, “This is what blocks me from moving forward.” [11] X Research source Take a minute to think about the symbolism here. You are moving on from your ex, and walking your own path. But when you were in your relationship, you were tied to your partner."
    },
    {
      "title": "Tie your wrists loosely together with the same thread.",
      "content": "Tie your wrists loosely together with the same thread. This represents the power your ex’s energy used to have over you. Sit with your legs crossed in front of the candle and use the thread to loosely wrap your wrists. Tie the thread like a shoelace and say, “This is what keeps me from receiving what I want.” [12] X Research source If it’s too awkward to tie your own wrists, just loop the thread around your wrists without tying it off. The gesture here is what’s important. Again, note the symbolism. You keep your hands to yourself in a relationship and your ex still holds some influence over your decisions. That’s what this thread symbolizes."
    },
    {
      "title": "Take a deep breath and meditate on your relationship.",
      "content": "Take a deep breath and meditate on your relationship. Breath in through your nose and out slowly through your mouth. Close your eyes and feel the totality of your relationship with your ex washing over you. Remember the good times. Remember the bad times. Allow feelings to come and go as they please and monitor your thoughts. Do not rush this; sit with your feelings and be mindful of your breathing. [13] X Research source It’s okay if you feel a little pain, or even cry. There’s no shame in it, and the catharsis is all a part of this process. If you’re done meditating after 5 minutes, that’s fine. If it takes 10-20 minutes or more, that’s okay, too."
    },
    {
      "title": "Feel the threads absorbing your emotional pain and negative vibes.",
      "content": "Feel the threads absorbing your emotional pain and negative vibes. Picture all of those memories, traumas, and feelings surrounding your ex to travel down your arms and legs and into the threads that bind you. These are the spiritual cords that tie you to your ex’s energy. [14] X Research source Open your eyes when you’re done and take a deep, free breath. You should feel a lightness and newfound energy."
    },
    {
      "title": "Cut the threads to sever the emotional cords to your ex.",
      "content": "Cut the threads to sever the emotional cords to your ex. When you’re emotionally ready, grab some scissors and cut the threads binding your wrists. Then, cut the thread binding your ankles. While you do this, say, “I release the ties that bind me to you. I am now free and move forward in light and freedom.” Extinguish the candle to symbolize the spiritual end of your relationship with your ex. [15] X Research source You can recite something similar if you feel other words in your heart. You might say, “I now cut the cords that connect me to my ex. I am a new person and I can move forward in my life.” You may also picture yourself manifesting a new future with a new partner."
    },
    {
      "title": "Burn and bury the threads outside to keep the negative energy away.",
      "content": "Burn and bury the threads outside to keep the negative energy away. Go to a fire pit outside or take a fireproof container outdoors and burn the threads. Bury the ashes outdoors in your yard or in an untraveled area of wilderness. This represents you burying your past and completely exorcising your ex’s energy from your life. [16] X Research source Keep a fire extinguisher or large pitcher of water with you when you do this. Do not do this outside on a windy day or in an unsafe area where you might start a wildfire. If you have to, you can do this at home. Remember, it’s the symbolism that matters."
    },
    {
      "title": "Cleanse your home again with incense or sage for a fresh start.",
      "content": "Cleanse your home again with incense or sage for a fresh start. Open your windows. Then, light a smudging stick or incense and take it around your home. Feel the energy in your home returning to its purest form. You are now ready to go out into the world free from your ex’s negative energy! [17] X Research source Focus on the new awareness and wisdom you have gained from the past relationship. [18] X Research source Think how you can use it to support your personal growth. [19] X Research source It will put you in a mindset where you focus on the takeaways that empower you in your love life in the future. [20] X Research source"
    }
  ]
}