{
  "url": "https://www.wikihow.com/Use-Salicylic-Acid-on-Your-Face",
  "title": "How to Use Salicylic Acid on Your Face",
  "steps": [
    {
      "title": "Apply the salicylic acid only to spots on your face with acne.",
      "content": "Apply the salicylic acid only to spots on your face with acne. Instead of spreading salicylic acid all over your face, target the areas that have breakouts or acne marks. This is much more helpful and will prevent your face from a severe breakout or irritation if the salicylic acid has a negative effect. [1] X Expert Source Joanna Kula Licensed Esthetician Expert Interview. 9 July 2019. Use the acid as a spot treatment, applying it to the areas of your face that are breaking out and avoiding the areas that are already clear. Only applying salicylic acid to breakout areas will also make the product last longer."
    },
    {
      "title": "Start out using it once or twice a week to see how your skin responds.",
      "content": "Start out using it once or twice a week to see how your skin responds. If you’re using salicylic acid for the first time, it’s best to use small amounts. Only apply the acid to your face once a week, wait a week or two to see how your face reacts to the product, and then you can increase it. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Avoid overusing salicylic acid on your face to keep your skin from drying out. If your skin becomes irritated after using salicylic acid, consider trying a different product or not using it at all. After a week or two, start using the acid twice a week for a week, then three times a week for a week, cutting back on it if your skin starts to dry out or show irritation."
    },
    {
      "title": "Follow the instructions for how long to wait before rinsing it off, if applicable.",
      "content": "Follow the instructions for how long to wait before rinsing it off, if applicable. Some salicylic acid treatments are designed to only stay on your face for a certain amount of time before being rinsed off with water. Read the directions on your salicylic acid product to be sure you’re using it properly. [3] X Research source Avoid leaving the acid on your face for longer than instructed. Some products that often require rinsing off are cleansers or exfoliants."
    },
    {
      "title": "Adjust your skin care routine by using gentle additional products.",
      "content": "Adjust your skin care routine by using gentle additional products. Because salicylic acid can have strong effects on your skin, it’s best if you don’t use it with abrasive soaps or cleansers, as well as products that contain alcohol, benzoyl peroxide, or retinoids. Use gentle soaps and moisturizers on your face while using your salicylic acid treatment for the best results. [4] X Expert Source Joanna Kula Licensed Esthetician Expert Interview. 9 July 2019. It’s important to use moisturizers on your face regularly when using salicylic acid because it’s known for drying out your skin. Avoid starting other new facial products when you start using salicylic acid to make sure your skin isn't overwhelmed. Don't use salicylic acid with other topical acne medications or medicated cosmetics."
    },
    {
      "title": "Skip areas of your face that are inflamed or severely irritated.",
      "content": "Skip areas of your face that are inflamed or severely irritated. If there are sections of your face that are super dry, swollen, infected, or contain broken skin, avoid using salicylic acid on these areas. Adding the acid to irritated parts of your face will likely only cause your skin to become more red and irritated. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source While it's okay to put salicylic acid on parts of your face that are red due to acne bumps, if your skin is red and inflamed due to other issues, it's best not to use the acid on it."
    },
    {
      "title": "Be consistent with your application for the best results.",
      "content": "Be consistent with your application for the best results. To see clearer skin, smaller pores, or whichever other result you’re looking for, you’ll need to use the salicylic acid on your face consistently. This doesn’t mean you need to use the acid several times a day every day, but if you’re using it two or three times a week, keep doing this for at least 3-4 weeks to begin seeing improvements. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Look for a salicylic acid product with a concentration of 0.5-2%.",
      "content": "Look for a salicylic acid product with a concentration of 0.5-2%. This is the concentration range that’s often found in over-the-counter salicylic acid products that you might find at your local drugstore or big box store. When you’re picking out a product for your face, look to see what percentage of salicylic acid it contains. Choose one with at least 0.5% to make sure it’s an active ingredient. [7] X Research source A product that contains less than 0.5% salicylic acid likely won’t have as big of an effect on your skin as you’d like. While there are products that contain more than 2% salicylic acid, these are usually prescribed by a dermatologist or doctor because of their strength."
    },
    {
      "title": "Use salicylic acid in a gel form for the perfect spot-treatment option.",
      "content": "Use salicylic acid in a gel form for the perfect spot-treatment option. Since the gel form is a little bit thicker than the other options, it’s best used as a spot treatment instead of all over your face. Apply a dab of the gel to any acne spots to help minimize them. [8] X Research source Some of the gels are also exfoliators, ridding your skin of dead skin cells while they treat your breakouts."
    },
    {
      "title": "Apply a serum containing salicylic acid for a concentrated solution.",
      "content": "Apply a serum containing salicylic acid for a concentrated solution. These serums or liquid solutions often offer salicylic acid in higher doses, such as 2%. As a liquid that doesn't need to be washed off, they spread over your skin easily in a light formula. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Choose a salicylic acid option that only contains this ingredient, or opt for a serum that contains other acne-fighting ingredients as well like tea tree oil. A drop or two of serums are all you need for the salicylic acid to work properly."
    },
    {
      "title": "Choose a salicylic acid face wash or scrub for a deep clean.",
      "content": "Choose a salicylic acid face wash or scrub for a deep clean. There are many different types of salicylic acid acne face washes on the market for you to choose from. These can be used up to twice a day, but it’s most recommended that you use them to wash your face before going to bed. Create a lather with the soap, rub it gently into your skin, and rinse it off with clean water. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Let the cleanser sit on your skin for 30-60 seconds before rinsing it off."
    },
    {
      "title": "Pick out a lotion with salicylic acid to minimize your pores.",
      "content": "Pick out a lotion with salicylic acid to minimize your pores. Salicylic lotions are a bit stronger than regular lotions you would put on your face, so do a spot test on your skin before applying it to larger sections. The lotion does a great job of smoothing and moisturizing your skin while also fighting breakouts and making your pores look smaller. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you’re picking out a lotion with salicylic acid in it, read the bottle to make sure it’s safe to use on your face."
    },
    {
      "title": "Opt for an oil-based salicylic acid to combat breakouts.",
      "content": "Opt for an oil-based salicylic acid to combat breakouts. Facial oils often have more concentrated ingredients, and they don’t need to be lathered over your entire face. Choose a facial oil with salicylic acid in it, as well as natural ingredients like chamomile and cucumber seed to help nourish your skin. [12] X Research source Use the oil as a spot treatment, spreading a thin layer over acne."
    },
    {
      "title": "Select salicylic acid pads for a quick and efficient treatment.",
      "content": "Select salicylic acid pads for a quick and efficient treatment. Cleansing pads are a popular option because they’re quick and easy to use. Pick out facial pads containing salicylic acid and gently wipe the pad across areas on your face containing breakouts. Dispose of the pad in the trash once you’re finished. [13] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source These pads also often contain ingredients that act as a toner to help even out your skin."
    }
  ]
}