{
  "url": "https://www.wikihow.com/Write-Songs-in-Sims-4",
  "title": "Songs in The Sims 4: How to Write Them, Make Money, and Get Famous",
  "steps": [
    {
      "title": "Buy an instrument.",
      "content": "Buy an instrument. The first thing you'll need is an instrument to write songs. The base game comes with three instruments: guitar, piano, and violin. However, there are some more instruments available if you have certain expansions [1] X Research source : City Living - Singing Vampires - Pipe Organ Get Together - DJ Booth Get Famous - Media Production"
    },
    {
      "title": "Level up your instrument skill to 8.",
      "content": "Level up your instrument skill to 8. The ability to write songs doesn't appear until you've nearly mastered your instrument. Keep practicing and performing with your instrument to raise your instrument skill. If your sim has the Muser trait from the creativity aspiration, becoming Inspired will give them a 40% boost to skill gains. [2] X Research source Media production only has five levels, as it is a minor skill. As soon as you have one skill point in media production, you should be able to mix music at the Mixmaster Music Station."
    },
    {
      "title": "Click on your instrument and select Write Song.",
      "content": "Click on your instrument and select Write Song . A few genres will pop up, and more will become available as you raise your skill level. If you're using the microphone, the option will be called Write Lyrics . On the DJ booth, it'll be called Write Mixtape . For media production, you can select Produce Music when you click on the mixing table."
    },
    {
      "title": "Select a genre.",
      "content": "Select a genre. Your Sim will immediately begin composing a song. It takes about 12 in-game hours to write a song, so make sure your Sim's needs are well taken care of before you begin writing. If you have to stop in the middle of writing a song, you can resume by selecting the sheet music in your inventory and clicking the Resume menu option."
    },
    {
      "title": "Finish composing the song.",
      "content": "Finish composing the song. Once you have composed a song, you can play it at any time by clicking on the instrument and selecting the Play option."
    },
    {
      "title": "Reach level 9 of your instrument skill.",
      "content": "Reach level 9 of your instrument skill. You can write songs at level 8, but to start licensing your music, you need to be level 9."
    },
    {
      "title": "Click on your Sim's mailbox.",
      "content": "Click on your Sim's mailbox. Several options should show up."
    },
    {
      "title": "Select License Song.",
      "content": "Select License Song . The instruments you've used to write songs will show up."
    },
    {
      "title": "Click on an instrument in the menu and select a song to license.",
      "content": "Click on an instrument in the menu and select a song to license. You will get royalty payments for one week, starting at 10 a.m. the day after you mail the song. You can only have one licensed song per instrument at a time. To maximize your payout, you can release songs for multiple instruments every week as long as you've got them to skill level 9. Royalty payments will be between $200 and $800."
    },
    {
      "title": "Level up your media production skill to 5.",
      "content": "Level up your media production skill to 5. You'll need the Get Famous expansion to have the Fame system, and to get famous with your songs you'll need to level up your media production skill. [3] X Research source You can start making music at the mixing table once you have a single skill point in media production, but maxing the skill out gives you access to all of the genres and effects. [4] X Research source"
    },
    {
      "title": "Produce a song at the mixing table.",
      "content": "Produce a song at the mixing table."
    },
    {
      "title": "Click on the mixing table and select Release Track.",
      "content": "Click on the mixing table and select Release Track . Releasing a track gives you an instant fame boost and provides you with a daily income. You can only release songs once per day."
    },
    {
      "title": "Keep releasing music until a label contacts you.",
      "content": "Keep releasing music until a label contacts you. If a label likes your music enough, they will offer to sign you. If you accept the offer, you will get a boost in fame and income, but you must release a track every three to four days or your label will drop you."
    },
    {
      "title": "Open up the cheat console.",
      "content": "Open up the cheat console. You can use [[Open-the-Cheat-Window-on-the-Sims|cheats}} to instantly increase your skill level so you don't have to spend time doing it yourself. How you do this varies by platform: PC: Ctrl + ⇧ Shift + C Mac: ⌘ Cmd + ⇧ Shift + C Console: Press R1+R2+L1+L2 at the same time"
    },
    {
      "title": "Type in testingcheats true and hit enter.",
      "content": "Type in testingcheats true and hit enter."
    },
    {
      "title": "Open the console again and type stats.set_skill_level Major_(skill) (skill level).",
      "content": "Open the console again and type stats.set_skill_level Major_(skill) (skill level) . Replace (skill) with the skill name and (skill level) with the desired skill level. For example, to reach level 10 of the guitar skill, you'd write stats.set_skill_level Major_Guitar 10 . There are no cheats for writing songs faster. If you want to decrease the amount of time it takes to write a song, you'll have to install a mod to do so. Only download mods from websites and people you trust."
    }
  ]
}