{
  "url": "https://www.wikihow.com/The-Yellow-Wallpaper-Summary",
  "title": "“The Yellow Wallpaper” Full Plot Summary & Analysis",
  "steps": [
    {
      "title": "“The Yellow Wallpaper” is an 1800s woman suffering from postpartum depression.",
      "content": "“The Yellow Wallpaper” is an 1800s woman suffering from postpartum depression. The story is told through diary entries by an unnamed narrator, who, along with her husband John, has rented an old, isolated country estate for the summer. Her husband—who is also her doctor—dismisses her depression as simple “hysteria” and insists the country air will help her overcome it. However, the narrator feels uneasy at the estate, imagining it is haunted. John prescribes a “rest cure” (that is, bed rest) and forbids her from pursuing any intellectual or artistic work. He insists any activity besides domestic duties will make her condition worse: “I…am absolutely forbidden to ‘work’ until I am well again…. Personally, I believe that congenial work, with excitement and change, would do me good.” [1] X Research source “I sometimes fancy that in my condition if I had less opposition and more society and stimulus—but John says the very worst thing I can do is to think about my condition.” [2] X Research source The narrator feels doubtful that she can take proper care of her new baby and fully adapt to the role of wife and mother: “Nobody would believe what an effort it is to do what little I am able—to dress and entertain, and order things. It is fortunate Mary is so good with the baby. Such a dear baby! And yet I cannot be with him, it makes me so nervous.” [3] X Research source"
    },
    {
      "title": "The narrator’s husband infantilizes her and dismisses her concerns.",
      "content": "The narrator’s husband infantilizes her and dismisses her concerns. The narrator complains in her diary that her husband belittles her and doesn’t take her condition seriously. She believes society and intellectual activity will help her condition, but her husband insists she rest, and so she hides her diary from her husband. “John laughs at me, of course, but one expects that in marriage.” [4] X Research source “If a physician of high standing, and one’s own husband, assures friends and relatives that there is really nothing the matter with one but temporary nervous depression—a slight hysterical tendency—what is one to do?” [5] X Research source “There comes John, and I must put this [diary] away,—he hates to have me write a word.” [6] X Research source The narrator repeatedly convinces herself her husband knows best and downplays her own needs and feelings: “I meant to be such a help to John, such a real rest and comfort, and here I am a comparative burden already!” [7] X Research source"
    },
    {
      "title": "The narrator is mostly confined to an old nursery with hideous yellow wallpaper.",
      "content": "The narrator is mostly confined to an old nursery with hideous yellow wallpaper. The narrator’s husband insists they sleep in an old nursery on the top floor of the house. Its windows are barred, the bed is bolted to the floor, there are rings attached to the walls, and there is a gate at the top of the stairs. The yellow wallpaper is peeling and covered in a sprawling pattern that the narrator finds repulsive. She wants to repaper the walls, but John won’t let her, insisting that giving in to her wishes would make her nervous condition worse. “It is stripped off—the paper—in great patches…. It is dull enough to confuse the eye in following, pronounced enough to constantly irritate, and provoke study, and when you follow the lame, uncertain curves for a little distance they suddenly commit suicide—plunge off at outrageous angles, destroy themselves in unheard-of contradictions.” “The color is repellant, almost revolting; a smouldering, unclean yellow, strangely faded by the slow-turning sunlight.” [8] X Research source “At first [John] meant to repaper the room, but afterwards he said that I was letting it get the better of me, and that nothing was worse for a nervous patient than to give way to such fancies.” [9] X Research source She writes at length about how much she hates the wallpaper before Jennie, the housekeeper (and John’s sister), interrupts, and the narrator must hide her diary again. Jennie is “a dear girl” and an “enthusiastic housekeeper,” but she, like her brother, believes “it is the writing which made [the narrator] sick.” [10] X Research source"
    },
    {
      "title": "The narrator’s family visits for Independence Day, which leaves her more exhausted.",
      "content": "The narrator’s family visits for Independence Day, which leaves her more exhausted. The narrator’s mother and her children visit for a week for the Fourth of July, after which she is even more tired. John says that if she doesn’t improve soon he will send her to Weir Mitchell, a doctor who is “just like John…only more so!” The narrator tries to conceal her condition from John so that he won’t send her away. “I cry at nothing, and cry most of the time. Of course I don’t when John is here, or anybody else, but when I am alone. And I am alone a good deal just now.” [11] X Research source Dr. Silas Weir Mitchell was a real-life doctor whom Gilman herself saw when suffering from postpartum depression."
    },
    {
      "title": "The narrator begins to believe there is a woman trapped in the wallpaper.",
      "content": "The narrator begins to believe there is a woman trapped in the wallpaper. With no intellectual stimulus besides the wallpaper, the narrator gradually spends more and more time in bed studying the wallpaper and becomes obsessed with it. She believes she sees a woman trapped behind the yellow wallpaper’s design, as if it’s a cage. “It is like a woman stooping down and creeping about behind that pattern. I don’t like it a bit. I wonder—I begin to think—I wish John would take me away from here!” [12] X Research source She eventually confesses to her husband that she feels her mental health is declining, but he belittles her, saying, “I beg of you, for my sake and for our child’s sake, as well as for your own, that you will never for one instant let that idea enter your mind! There is nothing so dangerous, so fascinating, to a temperament like yours. It is a false and foolish fancy. Can you not trust me as a physician when I tell you so?”"
    },
    {
      "title": "She begins to suspect that John and Jennie know about the woman in the wallpaper.",
      "content": "She begins to suspect that John and Jennie know about the woman in the wallpaper. The narrator grows increasingly mistrustful of her husband and her sister-in-law, suspecting them of knowing about the secret woman in the wallpaper. The narrator grows so paranoid that she begins concealing secrets from her diary. She determines to free the woman from the wallpaper without John or Jennie knowing. “I have watched John when he did not know I was looking, and come into the room suddenly on the most innocent excuses, and I’ve caught him several times looking at the paper! And Jennie too. I caught Jennie with her hand on it once…. I know she was studying that pattern, and I am determined that nobody shall find it out but myself!” [13] X Research source “Life is very much more exciting now than it used to be. You see I have something more to expect, to look forward to, to watch. I really do eat better, and am more quiet than I was…. [John] said I seemed to be flourishing in spite of my wallpaper…. I had no intention of telling him it was because of the wallpaper.” [14] X Research source"
    },
    {
      "title": "On the eve before their departure, the narrator tears all the wallpaper down.",
      "content": "On the eve before their departure, the narrator tears all the wallpaper down. At the end of the story, the narrator locks herself in the nursery and tears the wallpaper off the wall. She has become convinced that not only are there many women creeping around the house from inside the wallpaper, but that she, herself, is trapped behind the yellow wallpaper, with its complicated pattern serving as a sort of cage to confine her. When John finally breaks into the locked room and sees what she has done, he faints in horror at how animalistic and wild she has become. “I suppose I shall have to get back behind the pattern when it comes night, and that is hard! It is so pleasant to be out in this great room and creep around as I please!” [15] X Research source It is only when she has entered psychosis that the narrator is finally able to feel free and tell her husband how she really feels: \"And I've pulled off most of the paper, so you can't put me back!\""
    },
    {
      "title": "The narrator",
      "content": "The narrator The unnamed narrator of “The Yellow Wallpaper” is a young, newly married, upper-middle-class woman who has recently given birth to her first baby and is suffering from postpartum depression. She is very imaginative and drawn to writing. When she is forbidden to engage in any intellectual activity, she keeps a hidden diary. It is through the narrator’s diary entries that we gain a more intimate understanding of her thoughts and feelings about her husband, her mental health, and her growing obsession with the yellow wallpaper."
    },
    {
      "title": "John",
      "content": "John John is the narrator’s husband and physician. He’s described in his wife’s diaries as very practical and not prone to “fancy” in the least. He dismisses his wife’s poor mental health as “temporary nervous depression—a slight hysterical tendency.” He seems to want her to be well, but he doesn’t listen to her concerns or feelings. He assumes he knows best about how to treat his wife’s condition, not realizing his treatment is actually making her condition worse. [16] X Research source"
    },
    {
      "title": "Jennie",
      "content": "Jennie Jennie is John’s sister and the couple’s housekeeper. She’s described as being very content with her position as a housekeeper, a traditional domestic role for a woman. This augments the narrator’s feelings of shame and guilt at her own inability and reluctance to behave as a traditional mother and wife."
    },
    {
      "title": "Mary",
      "content": "Mary Mary is the nurse who takes care of the narrator’s new baby while she and John are away for the summer. Though she is only mentioned in the story and doesn’t directly appear, Mary is an important figure in “The Yellow Wallpaper”—like Jennie, Mary excels at and takes pride in her domestic role. The narrator is grateful for her help and feels guilt at not being able to take care of her baby herself; Mary serves as a reminder that the narrator cannot fulfill the traditional role that Victorian women were expected to fill."
    },
    {
      "title": "The role of women in marriage",
      "content": "The role of women in marriage Charlotte Perkins Gilman wrote “The Yellow Wallpaper” as a critique of the expected role of married women in Victorian society. Women were treated as second-class citizens, expected to be passive and domestic, compared to their “active” husbands. These gender roles ultimately keep women in childlike ignorance while convincing men that they are naturally wiser and more mature than their wives. John likely thinks he is doing right by his wife in assuming he knows better than his wife how to treat her poor mental health, but his patronizing, dismissive, and controlling behavior ultimately contributes to her slip into madness. [17] X Research source"
    },
    {
      "title": "Identity and self-expression",
      "content": "Identity and self-expression The narrator is driven insane by the intellectual, creative, and social constraints forced upon her by her husband-doctor. She is expected to control and hide her negative emotions behind the facade of a successful marriage, when self-expression and creativity would greatly improve her mental well-being. While her husband believes repressing her fears and anxieties will help them go away, it is by repressing them that her mental health deteriorates."
    },
    {
      "title": "The evils of the rest cure",
      "content": "The evils of the rest cure Victorian patriarchal medical institutions largely silenced women, who were expected to be passive and powerless, even with regard to their own health. Women who suffered from depression were often dismissed by male medical professionals as “hysterical.” Gilman’s story exposes the evils of medical misogyny, especially the “rest cure,” which she considered entirely ineffective and even cruel. [18] X Research source Gilman’s story illustrates how forced inactivity is likely to cause an anxious and depressed mind to deteriorate even further. She herself had been prescribed the rest cure by the doctor Silas Weir Mitchell to treat her depression, and she mentions him by name in the story: John threatens to send the narrator to Weir Mitchell if she doesn’t get better soon. According to Gilman, Weir Mitchell took her story seriously and abandoned the rest cure as a treatment."
    },
    {
      "title": "The wallpaper",
      "content": "The wallpaper The narrator becomes obsessed with the titular yellow wallpaper as the story goes on—particularly the complicated and seemingly random pattern, behind which the narrator begins to believe she sees a ghostly woman trapped. As the story progresses, the woman becomes more and more real to the narrator: she sees the woman creeping and stooping and searching for an escape from the pattern, which serves as a sort of cage. [19] X Research source The narrator sees the heads of different women in this “cage,” as if many women were strangled as they attempted to escape the pattern. Wallpaper, generally, may be considered unassuming, harmless, and domestic, but in this story, it is viewed as a cage, just as the narrator views the role of a Victorian wife and mother as a sort of cage. [20] X Research source Thus, the yellow wallpaper represents the strict and often misogynistic Victorian structure of medicine, family, and tradition that the narrator attempts to navigate."
    },
    {
      "title": "The color yellow",
      "content": "The color yellow The color yellow is typically associated with joy and innocence, but the yellow hue of the wallpaper is described by the narrator as “repellent,” “revolting,” and “unclean.” Her unconventional opinion of the color yellow and the negative feelings it inspires in her emphasize how she feels at odds with the traditional domestic role she is expected to play in Victorian society. [21] X Research source While Jennie and Mary seem to take on their traditional female roles happily and excel at them, the narrator feels anxious at the idea of taking care of her new baby. While the narrator tries to defer to her husband and doctor’s judgment early in the story, she is unable to do so for long: by the end of the story, her “true” self has made itself known. Her “unnatural” feelings towards motherhood and wifehood—roles other women in the narrative seem to view contentedly as their fate in life—are thus reflected in her view of the color yellow not as a symbol of joy, rest, and innocence, but as something hateful and repellent."
    },
    {
      "title": "The narrator’s journal",
      "content": "The narrator’s journal It is through reading the narrator’s diary that we are able to understand her thoughts and feelings regarding her husband, her marriage, her role as a wife and mother, and her mental health. By telling the story through journal entries, Gilman effectively and intimately shows us the narrator’s descent into insanity."
    },
    {
      "title": "“The Yellow Wallpaper” uses verbal, dramatic, and situational irony.",
      "content": "“The Yellow Wallpaper” uses verbal, dramatic, and situational irony. Irony is a literary device that involves using language to express something besides the literal meaning of the words, usually the opposite. Irony is often used in literature to add humor or emphasize an important idea. Verbal irony is when words are used to convey the opposite of their literal meaning. (For instance, sarcasm is a type of verbal irony.) Examples: “John laughs at me, of course, but one expects that in marriage.” Do we expect this in a successful, loving marriage? Of course not! [22] X Research source As the narrator’s condition worsens, she writes in her diary, “I am glad my case is not serious.” We, the readers, know her case has gotten very serious by now. Dramatic irony is when what the characters know contrasts with what the reader knows. Example: The narrator observes the barred windows, torn wallpaper, rings attached to the walls, and nailed-down bed in her room and attributes them to the fact that it must have been a nursery, when it’s just as likely that the room was used to house someone insane. [23] X Research source Situational irony is when a character’s actions result in the opposite of their intended effect. Examples: John’s treatment is intended to help his wife get better, but it only drives her to insanity. As the narrator loses her mind, she develops more certainty and confidence in her view of reality. She also begins to mistrust her husband more and more—which we can’t fault her for, but it’s ironic that this only happens once she loses her sense of reason."
    },
    {
      "title": "“The Yellow Wallpaper” highlights the impact of oppression on women’s mental heatlh.",
      "content": "“The Yellow Wallpaper” highlights the impact of oppression on women’s mental heatlh. Specifically, the short story showcases how women were societally oppressed during the Victorian era and how they were unable to have any sort of autonomy or independence. As a result, many women suffered emotionally and psychologically, just like the protagonist in the story. Overall, “The Yellow Wallpaper” warns against the dangers of patriarchal authority and the expectation that women are only supposed to be passive and submissive. It also promotes the importance of self-expression as a form of resistance against oppression. [24] X Research source"
    },
    {
      "title": "When was “The Yellow Wallpaper” written?",
      "content": "When was “The Yellow Wallpaper” written? Charlotte Perkins Gilman’s “The Yellow Wallpaper” was first published in The New England Magazine in January 1892. The story wasn’t widely celebrated when it initially appeared, but it resurfaced and gained traction as a feminist literary masterpiece in the late twentieth century. In 1973, the Feminist Press published a chapbook version of “The Yellow Wallpaper” with an afterword by Elaine Ryan Hedges, scholar and founding member of the National Women’s Studies Association, in which she called the story a “small literary masterpiece” and Gilman “one of the most commanding feminists of her time” (though Gilman herself, interestingly, said she “abominate[d] being called a feminist”). [25] X Research source"
    },
    {
      "title": "What does the woman in the yellow wallpaper represent?",
      "content": "What does the woman in the yellow wallpaper represent? The woman creeping around behind the wallpaper pattern represents the narrator herself—as well as Victorian women in general. When the narrator first sees the woman, the woman is unclear and ghostly, but as the narrator’s mental health deteriorates, the woman becomes more real and less blurry. The boundary between the narrator and the woman in the wallpaper deteriorates as well as the story goes on, until finally the narrator fully identifies with the woman and is determined to free her—thus freeing herself. The fact that the narrator sees “so many…creeping women” in the wallpaper suggests her own fate as a woman suffering in a patriarchal society is not unique, but is shared by many women in the Victorian era. [26] X Research source"
    },
    {
      "title": "Is the narrator reliable?",
      "content": "Is the narrator reliable? You can argue that any first-person narrator is unreliable to some extent, as they can only bear witness to their own perception of reality. But the narrator of “The Yellow Wallpaper” is particularly unreliable, as her mental state is very obviously deteriorating as the story progresses. Readers see the evidence of this in her gradually intensifying hallucinations of women in the wallpaper. It should be noted that though the narrator is clearly unwell and is probably not actually seeing women in the wallpaper, what she writes in her diary is symbolically and emotionally “true.”"
    },
    {
      "title": "What condition does the narrator suffer from?",
      "content": "What condition does the narrator suffer from? The narrator is never explicitly diagnosed in the story, but many contemporary critics believe she is suffering from postpartum depression. [27] X Research source There is evidence to support this in the narrator’s doubts about her ability to properly care for her new baby, as well as her mentions of her “nervous depression.” It’s possible Gilman would have diagnosed her protagonist with postpartum depression if it had been a formal medical diagnosis at the time. In the late 19th century, when the story was written and published, most doctors (who were men) dismissed postpartum depression—and female depression generally—as “hysteria.” [28] X Research source"
    },
    {
      "title": "Why does John faint at the end of the story?",
      "content": "Why does John faint at the end of the story? In a clever reversal of male and female roles, John becomes weak and faints upon witnessing his wife’s chaotic and destructive actions. Up until now, the narrator had behaved as a “proper” Victorian wife and mother, but here, finally, she has broken free of society’s expectations and succumbed to her most uninhibited and animalistic instincts. [29] X Research source"
    },
    {
      "title": "Who is “Jane”?",
      "content": "Who is “Jane”? At the end of the story, as John faints with horror at seeing his wife tearing the wallpaper off the walls, the narrator writes, “‘I’ve got out at last,’ said I, ‘in spite of you and Jane! And I’ve pulled off most of the paper, so you can’t put me back!’” So who is Jane? Nobody really knows, but there are a few theories: [30] X Research source It could be a misprint for “Jennie,” John’s sister. It could be the narrator’s name, and by proclaiming that she has gotten free “in spite of…Jane,” the narrator may mean she has gained victory over her own fears and inhibitions. It has also been theorized that “Jane” is a connection to Charlotte Bronte’s 1847 novel Jane Eyre , as there are many parallels between that novel and “The Yellow Wallpaper,” including the madwoman in the attic and exploration of the role of women in marriage."
    }
  ]
}