{
  "url": "https://www.wikihow.com/Stay-Safe-on-Snapchat",
  "title": "How to Keep You and Your Family Safe on Snapchat",
  "steps": [
    {
      "title": "Don't add people you don't know to your friends list.",
      "content": "Don't add people you don't know to your friends list. Sometimes Snapchat will recommend other users to you based on mutual friendships between your friends and their friends. Since Snapchat can be a very personal experience, stick to adding the people you know you can trust."
    },
    {
      "title": "Block strangers who try to contact you more than once.",
      "content": "Block strangers who try to contact you more than once. Repeated attempts to contact you from people you've ignored can count as harassment. It's best to simply block them."
    },
    {
      "title": "Block and report people who send inappropriate or unwanted snaps.",
      "content": "Block and report people who send inappropriate or unwanted snaps. If users are sending you images or videos you don't want to see, don't be afraid to block them . If the material they are sending you is illegal or against community guidelines, report them. Snapchat has a zero-tolerance policy when it comes to users sending unwanted or unsolicited material. [1] X Research source"
    },
    {
      "title": "Don't send inappropriate snaps.",
      "content": "Don't send inappropriate snaps. Even though you trust the friend or friends who you're snapping, you have to assume that anyone can see the snap as soon as it has been opened. Even though Snapchat notifies you when someone tries to screenshot your snap, this doesn't prevent people from taking a screenshot with another device."
    },
    {
      "title": "Keep your location private.",
      "content": "Keep your location private. While it can be tempting to add a snap with a geofilter of your neighborhood to a public story, it's safer to use filters that don't reveal your location. You can also enable Ghost Mode to hide your location on the map. The same notion goes for snaps of addresses, license plates, or commonly recognized buildings and landmarks. For example, if you take a picture of a pretty house, try using the \"pen\" option and censor out the address, cars, et cetera with the colored pen. Color doesn't matter."
    },
    {
      "title": "Don't give out personal information over Snapchat.",
      "content": "Don't give out personal information over Snapchat. Again, you clearly trust the friend to whom you're sending the information if it's personal. However, your snaps stop being private and become public as soon as you hit the send button, so anything you wouldn't feel comfortable sharing with people outside of your contact list is best left for in-person conversation. Personal information can include your age, your address, where you go to school, where you work, activities you attend, your family members, your passwords, etc."
    },
    {
      "title": "Don't meet people you meet on Snapchat in person by yourself.",
      "content": "Don't meet people you meet on Snapchat in person by yourself. Especially if you are underage. People may not be who they say they are. If you do decide to meet someone you met on Snapchat in person, make sure you do so in a public place with lots of people around who can see you. Do not go to that person's place or anywhere else where you might be alone with them. If you are a minor, make sure you bring an adult or trusted family member along with you."
    },
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. Snapchat resembles a white ghost on a yellow background. If you aren't logged into Snapchat , tap Log In and enter your username (or email address) and password."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's the icon that resembles your Bitmoji , profile pic, or ghost icon in the upper-right corner. Tapping this option displays your profile page."
    },
    {
      "title": "Tap the gear/Settings icon .",
      "content": "Tap the gear/Settings icon . It's in the top right corner of the screen."
    },
    {
      "title": "Scroll down and tap Contact Me.",
      "content": "Scroll down and tap Contact Me . This is in the \"Privacy Control\" section of options on this page."
    },
    {
      "title": "Select Friends.",
      "content": "Select Friends . This ensures that only people who have both added you on Snapchat and been approved by you will be able to send you snaps."
    },
    {
      "title": "Tap the Back button .",
      "content": "Tap the Back button . It's in the top left corner of the screen."
    },
    {
      "title": "Tap View My Story.",
      "content": "Tap View My Story . This is directly below the Contact Me option."
    },
    {
      "title": "Select Friends Only.",
      "content": "Select Friends Only . Only friends will be able to see the content you post to your story. Alternatively, for added security, you can select Custom and then select which friends you want to be allowed to view your story."
    },
    {
      "title": "Tap the Back button .",
      "content": "Tap the Back button . It's in the top left corner of the screen."
    },
    {
      "title": "Tap Show me in Quick Add.",
      "content": "Tap Show me in Quick Add . This is below View My Story ."
    },
    {
      "title": "Uncheck \"Show me in Quick Add.\"",
      "content": "Uncheck \"Show me in Quick Add.\" \"Quick Add\" places your name in a suggested friends list for other users, so disabling it means that other Snapchat users will have to look you up by your name or username to add you."
    },
    {
      "title": "Tap the Back button .",
      "content": "Tap the Back button . It's in the top left corner of the screen."
    },
    {
      "title": "Tap Activity Indicator.",
      "content": "Tap Activity Indicator . It's below \"Show Me in Quick Add\" in the privacy menu."
    },
    {
      "title": "Tap the toggle switch to turn off Activity Indicator.",
      "content": "Tap the toggle switch to turn off Activity Indicator. When Activity Indicator is disabled, people will not be able to see when you are active on Snapchat."
    },
    {
      "title": "Tap the Back button .",
      "content": "Tap the Back button . It's in the top left corner of the screen."
    },
    {
      "title": "Tap See My Location.",
      "content": "Tap See My Location . It's below \"Activity Indicator\" in the Privacy menu."
    },
    {
      "title": "Tap the toggle switch to enable Ghost Mode.",
      "content": "Tap the toggle switch to enable Ghost Mode. It's at the top of the page. When Ghost Mode is enabled, people will not be able to see your location on the map or on your profile."
    },
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. Snapchat resembles a white ghost on a yellow background. If you aren't logged into Snapchat , tap Log In and enter your username (or email address) and password."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's the icon that resembles your Bitmoji , profile pic, or ghost icon in the upper-right corner. Tapping this option displays your profile page."
    },
    {
      "title": "Tap My Friends.",
      "content": "Tap My Friends . It's close to the bottom of the screen."
    },
    {
      "title": "Tap a friend whom you wish to block.",
      "content": "Tap a friend whom you wish to block. You may have to scroll down to find them. This will open a chat with that person. Alternatively, you can open up a chat with this person in the Chats screen."
    },
    {
      "title": "Tap their profile picture.",
      "content": "Tap their profile picture. This may be their bitmoji, profile picture, or ghost face. This displays their profile page."
    },
    {
      "title": "Tap ⋯.",
      "content": "Tap ⋯ . It's the icon with three dots in the upper-right corner. This displays the More Options menu"
    },
    {
      "title": "Tap Manage Friendship.",
      "content": "Tap Manage Friendship . It's at the top of the More Options menu."
    },
    {
      "title": "Tap Remove Friend.",
      "content": "Tap Remove Friend . If you just want to remove this person as a friend without blocking them, tap this option."
    },
    {
      "title": "Tap Block.",
      "content": "Tap Block . This option will block the person so that they can't see your activity, chat with you, or try to add you as a friend."
    },
    {
      "title": "Tap Report.",
      "content": "Tap Report . Tap this option if the person has engaged in harassment, bullying, or illegal snaps. This will report the person to Snapchat."
    },
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. Snapchat resembles a white ghost on a yellow background. If you aren't logged into Snapchat, tap Log In and enter your username (or email address) and password."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's the icon that resembles your Bitmoji , profile pic, or ghost icon in the upper-right corner. Tapping this option displays your profile page."
    },
    {
      "title": "Tap the gear/Settings icon .",
      "content": "Tap the gear/Settings icon . It's in the top right corner of the screen."
    },
    {
      "title": "Tap Two-Factor Authentication.",
      "content": "Tap Two-Factor Authentication . It's in the settings menu. Two-Factor Authentication is a way to provide additional protection to your account. When Two-Factor Authentication (2FA) is enabled, you will need to enter your account password as well as a 6-digit code sent to your phone via text message, or an authenticator app, when you log into Snapchat."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . It's the green button at the bottom of the page."
    },
    {
      "title": "Tap SMS Verification or Authentication App.",
      "content": "Tap SMS Verification or Authentication App . If you use SMS Verification, an authentication code will be sent to your phone via text message when you try to log in to Snapchat. If you want to use an Authentication app, you will need to install an Authenticator app, like Google Authenticator which will generate a random code every minute. You will use that code to log into Snapchat."
    },
    {
      "title": "Finish setting up Two-Factor Authentication.",
      "content": "Finish setting up Two-Factor Authentication. Use one of the following steps to finish setting up Two-Factor Authentication: SMS Verification: To finish setting up SMS Verification, enter your phone number in the line and tap Verify . A 6-digit code will be sent to you via text message. Retrieve the code and enter it in Snapchat. Then tap Continue . Authenticator app: Make sure you have an authenticator app installed. Tap Set up Manually . Copy the code in Snapchat and open the authenticator app. Tap the option to add a new login. Enter the code from Snapchat, and then tap Continue ."
    },
    {
      "title": "Generate a recovery code.",
      "content": "Generate a recovery code. A recovery code can be used to help you log in if you are unable to access your text messages or authenticator app. Be sure to keep this code in a safe place and do not let anybody have access to it. Use the following steps to generate a recovery code: Tap Generate at the bottom of the screen. Enter your Snapchat password. Write down the recovery code."
    },
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. Snapchat resembles a white ghost on a yellow background. Parents can use Family Center to monitor who their teens are friends with and see who they've been talking to (though they can't view the actual conversations). They can also confidentially report suspicious accounts that are interacting with their teens. [2] X Research source If you aren't logged into Snapchat, tap Log In and enter your username (or email address) and password. You do need to have an active Snapchat account to use Family Center. If you don't have an active account, go ahead and create one ."
    },
    {
      "title": "Add your teen as a friend.",
      "content": "Add your teen as a friend. Ask your teenager their Snapchat username in order to add them as a friend . They will need to accept your friend request, so remind them in person to do so. Use the following steps to add them as a friend. Open Snapchat. Tap the icon that resembles a person next to a plus (+) sign in the upper-right corner. Enter your teen's username in the search bar. Tap Add + next to their username and profile picture."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's the icon that resembles your Bitmoji , profile pic, or ghost icon in the upper-right corner. Tapping this option displays your profile page."
    },
    {
      "title": "Tap the gear/Settings icon .",
      "content": "Tap the gear/Settings icon . It's in the top right corner of the screen."
    },
    {
      "title": "Scroll down and tap Family Center.",
      "content": "Scroll down and tap Family Center . It's at the bottom of the Privacy Control menu."
    },
    {
      "title": "Invite your teen to Family Center.",
      "content": "Invite your teen to Family Center. This will send an invitation for your teen to join. They will need to accept the invitation within 24 hours, so remind them in person. To invite them to Family Center, tap your teen's username and then tap Send Invitation ."
    },
    {
      "title": "Open Family Center.",
      "content": "Open Family Center. After your teen accepts the invitation, you can access Family Center by searching for it using the magnifying glass icon on the Camera screen, or in the Settings menu as outlined above."
    },
    {
      "title": "Restrict Sensitive Content.",
      "content": "Restrict Sensitive Content. If you want to restrict sensitive content from being sent to your teen's account, tap the toggle switch next to \"Restrict Sensitive content."
    },
    {
      "title": "View your teen's profile.",
      "content": "View your teen's profile. To do so, you can use the magnifying glass icon on the Camera screen to search for your teen or find them under \"My Friends\" on your profile page. Tap your teen's profile image."
    },
    {
      "title": "View who your teen has been talking with.",
      "content": "View who your teen has been talking with. Your teen's profile will display who they've been chatting with in the last 7 days. However, you cannot view the contents of those chats. [3] X Research source"
    },
    {
      "title": "Tap View friends.",
      "content": "Tap View friends . It's the blue button below your teen's profile picture. This will display who your teen is friends with on Snapchat."
    },
    {
      "title": "Report suspicious accounts.",
      "content": "Report suspicious accounts. If you are suspicious of any of your teen's friends or the accounts they have been chatting with, use the following steps to report them : Tap the profile image of the suspicious account. Tap ⋯ in the upper-right corner. Tap Report ."
    }
  ]
}