{
  "url": "https://www.wikihow.com/Treat-Chicken-Pox-Scars",
  "title": "How to Treat Chicken Pox Scars",
  "steps": [
    {
      "title": "Get a punch excision.",
      "content": "Get a punch excision. If you want to get rid of chickenpox scars, see your dermatologist and ask about a punch excision. This is a method where scars are removed by a doctor cutting into the skin surrounding a scar and removing it. [1] X Research source The doctor will use a round, sharp-edged tool to remove the skin surrounding the scar. Then, she will close up the skin surrounding the wound. [2] X Research source The main downside to a punch excision is that it also leaves behind scars; however, the scars are much lighter and smaller than the original. [3] X Research source"
    },
    {
      "title": "Try the punch elevation method.",
      "content": "Try the punch elevation method. The punch elevation method is usually used to treat deeper, more set in scars. This is a surgical method and will involve the use of local anesthetics but may be effective if your scars are particularly deep. [4] X Research source Similar tools used in the punch excision method are used for punch elevation, but the cuts made are slightly deeper and you will be put under for the procedure. [5] X Research source Punch elevation is usually effective in reducing the appearance of scars. The downside is, as with punch excision, it does also leave scars behind; however, these scars tend to be less noticeable as they're less elevated and lighter. [6] X Research source"
    },
    {
      "title": "Try a chemical peel.",
      "content": "Try a chemical peel. A chemical peel is a procedure in which the top layer of your skin is removed. This can reduce the appearance of chickenpox scars. [7] X Research source Chemical peels come in a variety of forms depending on the intensity of your condition and the desired outcome. Talk to your dermatologist about what type of peel would be right for you given your scarring. [8] X Research source Chemical peels may take up to two weeks to heal. While they are not extremely painful, the procedure can sting. Side effects may include temporary redness of the skin, scarring, and the appearance of cold sores. [9] X Research source"
    },
    {
      "title": "Ask about laser therapy.",
      "content": "Ask about laser therapy. Laser therapy can be used to treat chickenpox scars. Ask your dermatologist if laser therapy is right for you. Laser therapy is sometimes preferable to other methods as it's a non-invasive procedure with a fairly low risk of causing scars. It will not completely remove chickenpox scars but will lessen their appearance. [10] X Research source"
    },
    {
      "title": "Use a silicone-based cream that contains zinc.",
      "content": "Use a silicone-based cream that contains zinc. If you're treating chickenpox scars in young children, procedures like punch excisions and chemical peels are not the best option. Try using a silicone-based cream that contains zinc. This can result in a reduction of chickenpox scars. Follow the directions on the bottle to know what dosage to use and how often to apply the cream. [11] X Research source"
    },
    {
      "title": "Apply vitamin E oil.",
      "content": "Apply vitamin E oil. Vitamin E oil is considered a natural antioxidant. As such, it may help to speed up the healing process of the skin. This could potentially help your chickenpox scars fade. [12] X Research source Rich sources of the vitamin include spinach, vegetable oils, seeds like sunflowers, raw nuts like almonds, fruits as papaya and avocado. Vitamin E supplements are available at the pharmacies that you can take once or twice daily. Apply the oils directly to your skin every day. You can also apply a slice of avocado to the area. Keep in mind this method is not as well researched as medical solutions, and results are inconclusive. It may not work for you personally. Be careful when taking new supplements and always talk to your doctor before incorporating them into your diet."
    },
    {
      "title": "Try lemon juice.",
      "content": "Try lemon juice. Lemon juice has been known to clear up dark spots on skin for some. This may be because it contains vitamin C and citric acid, which both act like exfoliating agents and remove the outer layer of the skin. Try using lemon juice and see if it has an effect. Apply the juice on the affected spots for about ten minutes then wash gently. Pat dry with a clean towel. Avoid using lemon to children who have scars as children’s skin are known to be more sensitive than adults. Like many home remedies, the use of lemon juice to remove scars has not been medically tested. If it makes scars worse or causes skin irritation, cease use and talk to your doctor."
    },
    {
      "title": "Experiment with raw honey.",
      "content": "Experiment with raw honey. Honey is one of the best natural antioxidants. In some cases, it's been shown to improve the look of skin. It may be helpful for removing chickenpox scars. [13] X Research source Apply a dab of honey over the scar, leave in for 5 minutes, and then remove. Repeat as needed. This may result in scars lessening in appearance. Unlike lemon, honey is safe to use on children."
    },
    {
      "title": "Get medication during the duration of the virus.",
      "content": "Get medication during the duration of the virus. As chickenpox scars can be difficult to remove, it's best to work on preventing their occurrence to begin with. Using the correct medications for the duration of your symptoms can greatly reduce the risk of scarring. Your general practitioner will likely prescribe anti-itch creams as well as a round of antibiotics. Take all medication as directed. Finish antibiotics even after symptoms lesson. [14] X Research source"
    },
    {
      "title": "Take oatmeal baths.",
      "content": "Take oatmeal baths. An oatmeal bath can soothe your skin. This can result in less scratching and, therefore, less scaring. To take an oatmeal bath, place a mugful of uncooked oatmeal into a muslin bag and tie it with a string. Fill a tub with lukewarm water and drop the bag in the bath. Squeeze the bag until a cloudy white substances fill the water. Soak for about 20 minutes. [15] X Research source"
    },
    {
      "title": "Use scratch mitts for young children.",
      "content": "Use scratch mitts for young children. Scratching is a major contributor to the development of chickenpox scars. Young children may have to wear scratch mitts to prevent the temptation to scratch. This means wrapping their hands in oven mitts or other protective coverage to discourage scratching. This is particularly effective if you have a toddler with chickenpox. [16] X Research source"
    }
  ]
}