{
  "url": "https://www.wikihow.com/Use-Sandpaper",
  "title": "How to Use Sandpaper",
  "steps": [
    {
      "title": "Buy the abrasive that’s best for your project.",
      "content": "Buy the abrasive that’s best for your project. Sandpaper comes in different materials. Each material works best with particular types of sanding. Your options are: [1] X Research source Garnet . Garnet is a natural abrasive used for sanding any kind of bare wood. Garnet is versatile, but it dulls faster than other sandpapers. [2] X Research source Silicon carbide . Silicon carbide is best used for sanding down joint compound (the thick mix used to plaster over seams in drywall) and getting out specks of dust that get trapped under your wood finish. [3] X Research source Aluminum oxide . Aluminum oxide can be used to sand down wood, metal, and paint. It’s duller than silicon carbide, but it lasts longer. [4] X Research source Ceramic . Mostly used for power sanding, ceramic is one of the most durable and expensive abrasives. [5] X Research source Alumina zirconia . A hard and durable abrasive. Use alumina zirconia if you're using a machine with a disc or belt. [6] X Research source"
    },
    {
      "title": "Get your sandpaper in three different grades.",
      "content": "Get your sandpaper in three different grades. Sandpaper comes in three grades: coarse, medium, and fine. Sandpaper grades are measured in “grit.” The higher the grit of a sandpaper, the smoother it will make the surface it’s used on. Check the packaging the sandpaper comes in to see what its grit is. Buy some sheets in each grade for your project. [7] X Research source Coarse-grade sandpaper has a grit of 40 to 80. An 80-grit sandpaper should be coarse enough unless you have significant defects in the surface you’ll be sanding. [8] X Research source Medium-grade sandpaper has a grit of 100 to 150. [9] X Research source Fine-grade sandpaper has a grit of 180 to 220. A 220-grit sandpaper should be fine enough for your project, but there are higher grits if you want a smoother finish. [10] X Research source"
    },
    {
      "title": "Use open-coat for durability or closed-coat for strength.",
      "content": "Use open-coat for durability or closed-coat for strength. Closed-coat sandpaper is completely covered in grain, meaning it's a stronger abrasive. Open-coat sandpaper has less grain on it, so it's not as effective, but the extra space on the sheet prevents buildup, which makes it last longer. Use closed-coat sandpaper for harder surfaces and open-coat sandpaper for softer surfaces."
    },
    {
      "title": "Use a sanding block for better and faster results.",
      "content": "Use a sanding block for better and faster results. A sanding block is a block you wrap your sandpaper around. A sanding block can be anything -- a piece of cut-out foam, a wooden block, or a block of cork. Fold your sandpaper around your sanding block, with the abrasive side facing outward, and staple or glue it into place. You can also buy a sanding block at your local hardware store if you don’t want to make your own. [11] X Research source"
    },
    {
      "title": "Start with your lowest grit sandpaper to remove obvious imperfections.",
      "content": "Start with your lowest grit sandpaper to remove obvious imperfections. This will be the coarse-grade sandpaper you purchased. Don’t use a really low grit sandpaper on your surface unless it’s necessary. [12] X Research source For example, you wouldn’t need a sandpaper with 40-grit (very coarse) to sand a surface with minimal defects. In this case, you’d be fine using a sandpaper with 80-grit to start. Save the coarsest sandpaper for surfaces with large gouges and bumps."
    },
    {
      "title": "Hold your sandpaper on the surface you want to sand.",
      "content": "Hold your sandpaper on the surface you want to sand. Apply pressure to the sheet of sandpaper or the sanding block with your hand. If you’re standing up, lean your weight into your hand holding the sandpaper. Use both hands for more pressure. [13] X Research source"
    },
    {
      "title": "Run the sandpaper across the surface.",
      "content": "Run the sandpaper across the surface. If you’re sanding wood, make sure you’re sanding with, and not against, the grain. The grain of a wood is the lines and patterns that run through it. [14] X Research source For example, if you’re sanding the surface of a wooden desk and the grain runs from the front-facing side of the desk to the back-facing side, you’ll want to move the sandpaper from the front of the desk to the back and vice versa. Sanding against the grain or sanding in circular motions will create unnecessary scratches in your wood. [15] X Research source"
    },
    {
      "title": "Move the sandpaper back and forth in a straight motion.",
      "content": "Move the sandpaper back and forth in a straight motion. Continue to apply pressure to the sandpaper with your hands and don’t lift the sandpaper up unless you need a break. Gradually make your way across the entire surface you’re sanding. You should start to see piles of dust accumulating. [16] X Research source Don’t forget to sand the edges. When you get to the edges of the surface you’re sanding, stop and take a moment to sand the edges and corners."
    },
    {
      "title": "Vacuum the accumulated dust when you’re finished.",
      "content": "Vacuum the accumulated dust when you’re finished. Don’t worry if you still see scratches or defects in the surface you’re sanding. You’ll smooth them out with your finer-grade sandpapers later. [17] X Research source"
    },
    {
      "title": "Move on to your medium-grade sandpaper.",
      "content": "Move on to your medium-grade sandpaper. Attach it to your sanding block if you’re using one. Repeat steps 4 through 6. Make sure you sand down all of the surfaces you’re working on, including the edges. [18] X Research source"
    },
    {
      "title": "Finish sanding with your finest-grade sandpaper.",
      "content": "Finish sanding with your finest-grade sandpaper. Your surface should be perfectly smooth, with no scratches and dings. Start the process over, beginning with a coarse-grade sandpaper, if you still see scratches or you’re not satisfied with the smoothness."
    },
    {
      "title": "Use a random orbit sander for speedier, less tiresome sanding.",
      "content": "Use a random orbit sander for speedier, less tiresome sanding. A random orbit spinner is an electric sanding tool that spins a sheet of sandpaper in random directions on a flat surface. Just attach the sandpaper, hold the tool by the handle, and move it across the surface you want to sand. They also suck up accumulating dust as you sand. Buy a random orbital spinner online or at your local hardware store. [19] X Research source Random orbital spinners use circular sandpaper sheets that come with holes used to attach them to the device. Get these sheets wherever you get your device. Get a package of sheets in each grade: coarse, medium, and fine."
    },
    {
      "title": "Use a belt sander for larger projects.",
      "content": "Use a belt sander for larger projects. Belt sanders use a fast moving belt made of sandpaper to sand down surfaces. Belt sanders are useful if you have a lot of excess material to remove from a piece and you want to do it quickly. Attach a sandpaper belt made of your selected grade to the tool and, while holding it by the handle, run it across a surface. Buy a belt sander online or at your local hardware store. [20] X Research source You’ll need to buy sandpaper sheets designed specifically for a belt sander. Belt sanders are powerful and they sand down surfaces fast. Avoid using a belt sander for smaller projects or you could ruin your piece."
    },
    {
      "title": "Use a bench top sander to quickly sand curved edges.",
      "content": "Use a bench top sander to quickly sand curved edges. Bench top sanders are large electric tools with a spinning sandpaper blade that sits perpendicular to the workbench it’s on. Next to the blade is a small shelf where you hold the piece you want to sand and guide it into the sandpaper. You can easily sand detailed or curved edges using a bench top sander. Buy one online or at your local hardware store."
    }
  ]
}