{
  "url": "https://www.wikihow.com/Tell-Your-Family-You-Want-to-Join-the-Military",
  "title": "How to Tell Your Family You Want to Join the Military",
  "steps": [
    {
      "title": "Prepare for the discussion.",
      "content": "Prepare for the discussion. Your family is going to have a lot of questions, and they're going to want to know how and why you’ve reached this decision. To prepare for the discussion, think about a few questions they might have and write down your answers in advance. Your family will want to know: What branch of the military you want to join If there's a specific job you're aiming for How long of a commitment it will be What kind of training and education you'll get Why you want to join How long you'll be away from home What it means for your future How often you'll be able to see them"
    },
    {
      "title": "Tell a trusted family member first.",
      "content": "Tell a trusted family member first. If you're worried that your family might not be happy about your decision, it can help to have the support of one or two close family members before you tell everyone else. Choose a family member or close relative that you think will be sympathetic and understanding of your decision. Your confidant can help you brainstorm questions you should prepare for, and get you ready for reactions that you might expect. You may even want to have a practice conversation with this family member in advance to help prepare you for the real talk with everyone else. [1] X Research source However, don’t try to determine what the conversation will actually be like, otherwise you might be thrown off guard if your family reacts in a way you didn’t expect."
    },
    {
      "title": "Schedule a family meeting with your immediate family.",
      "content": "Schedule a family meeting with your immediate family. A family meeting is a good way to get your family together so you can talk to them all at the same time about your decision. You don’t have to include extended family, but you should discuss your decision with parents, siblings, and children. Talk to your family in advance and let them know you want to get everyone together. Schedule a time when everyone is free. Ideally, make the meeting on a weekend, or at a time when everyone has had a couple hours to relax after work or school. If there are immediate family members who live out of town or far away, consider including them through a conference call or video chat. [2] X Research source"
    },
    {
      "title": "Tell them the choice you’ve made.",
      "content": "Tell them the choice you’ve made. When the time comes for your meeting and you're ready to tell everyone that you want to join the military, it’s best to come right out and say it. They will surely continue the dialogue afterward by asking questions. To start, say something clear and understandable, [3] X Research source such as: “I want to join the military” “I have been doing a lot of soul-searching lately, and have come to the conclusion that I'm joining the military” “After thinking long and hard, I’ve realized my calling is the military”"
    },
    {
      "title": "Tell your family what you need from them.",
      "content": "Tell your family what you need from them. Part of this discussion involves getting help from your family as well. You can facilitate this process by telling them how they can support you. This may include: [4] X Research source Telling them how they can keep in touch, such as by letters, phone calls, or emails Deciding how often you want to talk to them when you're away Having them be available for you to talk to and share news with Having them be excited for you, even if they don’t agree with your decision"
    },
    {
      "title": "Describe your reasons.",
      "content": "Describe your reasons. Unless you can explain your decision, your family may think that you aren't serious, that you haven't thought this through, or that you aren't ready. Use the research you’ve done to explain to them: [5] X Research source What kind of job you're aiming for The pay scale and career path The opportunities this choice will create for you What you expect to gain from the experience That you understand the risks involved"
    },
    {
      "title": "Answer questions openly and honestly.",
      "content": "Answer questions openly and honestly. The more candid you are, the more likely your family is to accept your decision. If you're secretive or unwilling to answer questions, they may assume the worst, and will think that you're not making the right choice. For example, if you don’t explain your decision, your family may think you're just trying to run away from something and don’t want to involve them. Have answers prepared for the why-type questions you'll be asked, such as why you want to join the military. Don’t make up answers. Instead, if someone asks a question you can’t yet answer, tell them you'll figure it out and respond later."
    },
    {
      "title": "Be ready if your family tries to prohibit you from joining.",
      "content": "Be ready if your family tries to prohibit you from joining. As long as you meet the requirements, your family can’t actually stop you from joining the military. Although they may, try, ultimately the decision is yours, and only you can decide what's right for your life. However, it’s still important to listen to your family’s concerns. Some of the criteria for enlisting may include: [6] X Research source You must be 18 years old, or 17 and have parental consent. Height and weight restrictions Academic qualifications"
    },
    {
      "title": "React to guilt accordingly.",
      "content": "React to guilt accordingly. Some people try to get their way by inducing feelings of guilt in others. If your family tries to make you feel guilty about joining the military in an attempt to change your mind, there are ways you can manage this tactic. [7] X Research source Restate how important this is to you. Let them know that you see what they're trying to do and don’t appreciate it. Ask them to reframe their concerns in a way that doesn’t involve making you feel guilty Reframe guilt as gratitude. Interpret this guilt trip as a sign that your family cares for you and wants the best for you."
    },
    {
      "title": "Understand your family may be concerned about violence.",
      "content": "Understand your family may be concerned about violence. When you join the military, there is a chance that you may have to kill someone else, destroy someone’s home, or that you yourself will be killed in the line of duty. Your family knows this, and they may become preoccupied with the violence associated with a life in the military. Let them know that according to three decades worth of statistical tracking, only about 0.082 percent of enlisted service members die in the military. [8] X Research source You can also remind them that it’s possible that you may also never be deployed and may never see war, depending on what happens in the world during your time in the military and your duties there."
    },
    {
      "title": "Realize your family may panic.",
      "content": "Realize your family may panic. Your family loves you and cares about you, and that’s why they're perhaps scared, angry, and panicking about your decision. It’s important that you remain calm, otherwise emotions will run higher and the discussion could escalate. Understand that panic is a common reaction to a family member joining the military, especially if there's a good chance you'll be deployed. [9] X Research source Reassure your family that you love them, but that you need to do this. But don’t become angry or heated yourself, as this will only increase tension. Use active listening techniques to hear your family out. While a member of your family is speaking, look them in the eyes, nod at what they're saying, and focus on what they're saying (not what you're going to say to respond). [10] X Research source Help your family calm down by using a soft, love voice. Show them that you understand their panic and concern. [11] X Research source For example, you could say, \"I understand that you're worried about my safety, but this life decision is really important to me.\""
    },
    {
      "title": "Talk to a recruiter.",
      "content": "Talk to a recruiter. The job of a recruiter is to advertise the army, talk to applicants and potential enlistees, convince people to enlist, conduct interviews, and assess applicants. [12] X Research source A recruiter will be able to answer questions, explain the process, and can take your information to get the ball rolling. To find a recruiter near you, visit the U.S. Army website. If you're having trouble talking to your family about your decision, you can also request that a recruiter come to your home to talk and answer questions. [13] X Research source"
    },
    {
      "title": "Talk to other people who have served.",
      "content": "Talk to other people who have served. While recruiters will be able to answer your questions, they are biased because it’s their job to convince you to join the military. To get a well-rounded perspective on what life in the military will really be like, talk to people who have served and who aren't being paid to recruit you. Recently discharged veterans are good candidates, friends or family members, or a civilian counselor. Ask about what it’s like, whether they enjoyed their time in the military, and whether they would recommend it for someone else."
    },
    {
      "title": "Understand reasons why people wouldn’t want you to join the military.",
      "content": "Understand reasons why people wouldn’t want you to join the military. Your family might have a lot of reasons for their concerns, and knowing the pros and cons of joining the military will help you make the most informed decision. Understand that joining the military: [14] X Research source Won’t alleviate problems in your life, and will only put them on hold Isn't necessarily the only way to obtain an affordable education Means you might have to go to war Demands that your actions are controlled by your superiors"
    },
    {
      "title": "Find out how your skills will apply to civilian life.",
      "content": "Find out how your skills will apply to civilian life. People often join the military for the job training that they’ll receive, but this won’t necessarily be applicable training once you leave the military and rejoin civilian life. When you're looking at joining, examine the job descriptions you're considering and ask yourself how those skills would translate to a civilian workplace. [15] X Research source Also, be warned that many employers are hesitant to hire veterans, and this may make it difficult for you to get a job when you leave the military. [16] X Research source"
    },
    {
      "title": "Determine how much money you can get for education.",
      "content": "Determine how much money you can get for education. The amount you'll get is based on the amount of time you spend on active duty, [17] X Research source so you may have to extend an initial four-year contract beyond that to ensure your education is paid for. Talk to a counselor or recruiter about what tuition assistance is available from that branch of the military, and how long you'd have to serve to have your education paid for."
    },
    {
      "title": "Figure out if you're prepared for the worst.",
      "content": "Figure out if you're prepared for the worst. When you join the military, you sign a contract that dictates the number of years you have to serve. Many first-term contracts are six years long, [18] X Research source and during this time you might: Be deployed to a foreign country Have to fight and kill Have to risk your life Suffer psychologically, including from things like post-traumatic stress disorder"
    }
  ]
}