{
  "url": "https://www.wikihow.com/Treat-Scalp-Ringworm",
  "title": "How to Treat Scalp Ringworm",
  "steps": [
    {
      "title": "Check for the tell-tale symptoms.",
      "content": "Check for the tell-tale symptoms. If you have the following symptoms, see a doctor to get the diagnosis confirmed: [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Circular areas of the scalp that are bald or have hair that has broken off near the hair follicle. If your hair is dark, the broken off hairs may look like dark dots on your scalp. These spots may gradually get larger over time. The infected areas may be red or gray and shed flakes. These areas may hurt, particularly when touched. Your hair may fall out easily. On some people, the scalp may become inflamed, seep pus, and form yellow crusts. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source People with this complication may also have a fever or enlarged lymph nodes. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Wash your hair with an antifungal shampoo.",
      "content": "Wash your hair with an antifungal shampoo. It is important to realize that the antifungal shampoo alone is unlikely to cure you. You still need to get anti-fungal medications from the doctor. But the shampoo can reduce the spread of the fungus, helping you to heal faster. Depending on the type and strength of the shampoo, it maybe available over-the-counter or by prescription only. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Commonly used shampoos contain selenium sulphide or ketoconazole. Use the shampoo twice a week during the first few weeks of treatment, unless instructed otherwise by your doctor or the manufacturer’s instructions on the packaging. Consult your doctor before applying these shampoos to a child or using them yourself if you are pregnant. Do not shave your head. Because the fungus is also on your scalp, it will not get rid of the infection. Also, it may lead to embarrassment if it makes the marks more visible."
    },
    {
      "title": "Take antifungal medications.",
      "content": "Take antifungal medications. You can get these with a prescription from your doctor. Do not use them on a child or if you are pregnant without discussing it first with your doctor. These prescription medications will kill the fungus, but have side effects that need to be considered: [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Terbafine (Lamisil) — This medication is generally taken as a daily pill for about four weeks and usually works. Side effects are usually short, but may include nausea, diarrhea, upset stomach, a rash, or an altered sense of taste. Contact your doctor if you experience side effects. If you have liver disease or lupus, you will probably not be able to take this medication. Griseofulvin (Grifulvin V, Gris-Peg) — This is a spray that is taken each day for up to 10 weeks. The spray is not available in the U.S. but can easily be obtained in the U.K. It can cause side effects of nausea, vomiting, diarrhea, headaches, and an upset stomach. Both women and men need to be aware that it can cause birth defects in unborn children if the mother takes it while pregnant, if the mother takes it shortly before conceiving, or if the father has taken it within six months of fathering the child. Griseofulvin may reduce the effectiveness of progestogen-only and combined contraceptive pills. People on it should use a barrier method of contraception like a condom. Women who are breastfeeding and people with liver disease or lupus also should not take this medication. Do not drive and be aware that you will be more sensitive to alcohol while taking it. Itraconazole — This medication is taken as pill for approximately one to two weeks. It may cause nausea, vomiting, diarrhea, headaches, and an upset stomach. Children, elderly people, and people with liver disease should not take this medication."
    },
    {
      "title": "Get your pets and farm animals checked by the vet.",
      "content": "Get your pets and farm animals checked by the vet. If you have animals with patchy fur, they may be the source of your infection. You can get it from them by petting, handling, or grooming them, so always wash your hands afterwards. Common sources of animal-to-human transmission are: [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Dogs Cats Horses Cows Goats Pigs"
    },
    {
      "title": "Do not touch infected areas.",
      "content": "Do not touch infected areas. The fungus can be spread through skin-to-skin contact. People at a particularly high risk include: [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source People who have a ringworm infection elsewhere on their body, such as athlete’s foot or jock itch. If you scratch the infection and then scratch your head, you can transfer the fungus to your scalp. Hairdressers, barbers, and hair stylists, because they come in contact with the hair of lots of people School nurses and daycare workers who are in contact with lots of children People who have a family member or a sexual partner who is infected"
    },
    {
      "title": "Disinfect contaminated objects.",
      "content": "Disinfect contaminated objects. Objects that may be carrying the fungus should be disinfected or replaced. The following objects can easily transfer the fungus: [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [11] X Research source Hairbrushes, combs, or hair implements. Soak them for an hour in a solution of 1 part bleach to 3 parts water. Towels, bed sheets, gym or wrestling mats, and clothing. Add a disinfectant or bleach to the wash when you wash them."
    }
  ]
}