{
  "url": "https://www.wikihow.com/Write-a-Good-Lab-Conclusion-in-Science",
  "title": "How to Write an Effective Conclusion for a Science Lab Report",
  "steps": [
    {
      "title": "Go over your assignment.",
      "content": "Go over your assignment. Verify that you’ve accomplished all the parts of your assignment so that you can properly address them in the conclusion. Take a few moments to make a list of what you’re supposed to demonstrate or learn in the experiment."
    },
    {
      "title": "Revisit your introduction.",
      "content": "Revisit your introduction. To make sure your conclusion is consistent with the rest of your report, revisit your lab report’s introduction. [1] X Research source This is a good tactic to help you brainstorm exactly what you’d like to say in your conclusion."
    },
    {
      "title": "Use the RERUN method.",
      "content": "Use the RERUN method. Start mapping out the different elements of your conclusion by using the RERUN method. The RERUN method can be a useful structure overall for a short lab report, but it is especially useful for providing a conclusion to your report that reviews the experiment’s important components. [2] X Research source RERUN stands for: Restate : Restate the lab experiment by describing the assignment. Explain : Explain the purpose of the lab experiment. What were you trying to figure out or discover? Talk briefly about the procedure you followed to complete the lab. Results : Explain your results. Confirm whether or not your hypothesis was supported by the results. Uncertainties : Account for uncertainties and errors. Explain, for example, if there were other circumstances beyond your control that might have impacted the experiment’s results. New : Discuss new questions or discoveries that emerged from the experiment."
    },
    {
      "title": "Plan other sections to add.",
      "content": "Plan other sections to add. The RERUN method is a good start, but there may be other components that you should include. It’s a good idea to talk about what you’ve learned in the experiment. You might also want to situate your reports within the overall research field, or how you can relate the findings to concepts you’re learning in class. [3] X Research source Your assignment may also have specific questions that need to be answered. Make sure you answer these fully and coherently in your conclusion."
    },
    {
      "title": "Introduce the experiment in your conclusion.",
      "content": "Introduce the experiment in your conclusion. Start out the conclusion by providing a brief overview of the experiment. Describe the experiment in 1-2 sentences and discuss the objective of the experiment. Also, make sure to include your manipulated (independent), controlled and responding (dependent) variables."
    },
    {
      "title": "Restate your procedures.",
      "content": "Restate your procedures. Give a brief summary of the process that you went through with your experiment. Give an overview of the experiment, which will help the reader visualize what you did. [4] X Research source If you tried the experiment more than once, describe the reasons for doing so. Discuss changes that you made in your procedures. Brainstorm ways to explain your results in more depth. Go back through your lab notes, paying particular attention to the results you observed. [5] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Describe what you discovered briefly.",
      "content": "Describe what you discovered briefly. In a few sentences, summarize the results that you arrived at in your experiment. Summarize the data here; don’t include all of the results. [6] X Research source Start this section with wording such as, “The results showed that…” You don’t need to give the raw data here. Just summarize the main points, calculate averages, or give a range of data to give an overall picture to the reader. Make sure to explain whether or not any statistical analyses were significant, and to what degree, such as 1%, 5%, or 10%."
    },
    {
      "title": "Comment on whether or not your hypothesis is supported.",
      "content": "Comment on whether or not your hypothesis is supported. Your hypothesis is a statement that describes what the expected outcome will be. The hypothesis forms the basis of your experiment and drives the parts of your process. Restate your hypothesis and then state clearly and concisely whether or not your hypothesis has been supported by the experiment. Was the experiment a success? [7] X Research source Use simple language such as, “The results supported the hypothesis,” or “The results did not support the hypothesis.”"
    },
    {
      "title": "Link your results to your hypothesis.",
      "content": "Link your results to your hypothesis. The results of your experiment have determined whether or not the hypothesis is supported. After noting this in your report, comment further by describing the meaning of your experiment’s results. Clarify why the results indicate a supported hypothesis or not. [8] X Research source"
    },
    {
      "title": "Describe what you learned in the lab.",
      "content": "Describe what you learned in the lab. You may be asked to demonstrate a particular scientific principle or theory. If this is the case, your conclusion should reflect that. [9] X Research source If it’s not clear in your conclusion what you learned from the lab, start off by writing, “In this lab, I learned…” This will give the reader a heads up that you will be describing exactly what you learned. Add details about what you learned and how you learned it. Adding dimension to your learning outcomes will convince your reader that you did, in fact, learn from the lab. Give specifics about how you learned that molecules will act in a particular environment, for example. Describe how what you learned in the lab could be applied to a future experiment."
    },
    {
      "title": "Answer specific questions given in the assignment.",
      "content": "Answer specific questions given in the assignment. Your teacher may have listed certain questions in the assignment that need to be answered. [10] X Research source On a new line, write the question in italics. On the next line, write the answer to the question in regular text."
    },
    {
      "title": "Explain whether you achieved the experiment’s objectives.",
      "content": "Explain whether you achieved the experiment’s objectives. The introduction to your lab report should have stated certain objectives that you hoped to achieve with this experiment. Revisit these objectives in the conclusion to make sure that you are addressing them sufficiently. [11] X Research source If your experiment did not achieve the objectives, explain or speculate why not."
    },
    {
      "title": "Describe possible errors that may have occurred.",
      "content": "Describe possible errors that may have occurred. To provide an accurate depiction of the lab experiment, describe errors that may have happened in the course of the experiment. This will add transparency to your experiment and results, so people can more easily see how you arrived at your conclusions. [12] X Research source"
    },
    {
      "title": "Talk about uncertainties.",
      "content": "Talk about uncertainties. There may be uncontrollable circumstances that impact your experiment, such as weather changes or unavailability of a certain supply. Discuss these uncertainties and their potential impact on the overall experiment. If your experiment raised questions that your collected data can’t answer, discuss this here."
    },
    {
      "title": "Propose future experiments.",
      "content": "Propose future experiments. In light of what you learned in your experiment, give recommendations on the design of future experiments. What could be changed to elicit more reliable or valid results?"
    },
    {
      "title": "Propose additional questions that arise.",
      "content": "Propose additional questions that arise. Sometimes, scientific research trials will generate more questions than answers. If this is the case in your research, you can discuss these in the conclusion in the context for future research."
    },
    {
      "title": "Relate your research to other research.",
      "content": "Relate your research to other research. Particularly for more advanced lab reports, you may choose to discuss how your research adds to the research in the field. Visualize all research on your topic as a brick wall, and your own research is one brick in that wall. How does your research fit within the overall scheme of things? [13] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Describe what is new or innovative about your research. This can often set you apart from your classmates, many of whom will just write up the barest of discussion and conclusion."
    },
    {
      "title": "Add a final statement.",
      "content": "Add a final statement. Wrap up the entire conclusion – and the entire report – with a statement that summarizes the scope of the lab report and the most important conclusions. Alternately, speculate on future uses for the research. Here is your chance to make an insightful comment that will set your lab report apart from others. [14] X Research source"
    },
    {
      "title": "Write in the third person.",
      "content": "Write in the third person. Avoid using “I,” “we” or “me” in your lab report. Instead, use language such as, “The hypothesis was supported…” [15] X Research source"
    },
    {
      "title": "Read through the full report.",
      "content": "Read through the full report. Once you’ve finalized your conclusion, read through the entire report to make sure it is logical. Watch for any places where you might contradict yourself, and correct these instances. Your conclusion should reiterate what you learned from the experiment and how you came to understand these learning outcomes."
    },
    {
      "title": "Proofread your report.",
      "content": "Proofread your report. Check for spelling and grammatical errors in your report. A report that contains errors can inadvertently decrease the report’s reliability. Take the time to ensure your report is error-free. [16] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    }
  ]
}