{
  "url": "https://www.wikihow.com/Stop-Taking-Jokes-Seriously",
  "title": "How to Stop Taking Jokes Seriously",
  "steps": [
    {
      "title": "Understand where your sensitivity to jokes comes from.",
      "content": "Understand where your sensitivity to jokes comes from. Often, your reaction to a joke is based on your thoughts associated with the joke. You may be interpreting the joke in a more serious way than was intended or are not understanding the joke correctly. As you process the joke, you may want to consider why you are reacting so seriously to the joke and why you are sensitive to the joke. This will help you to build more self awareness around the root of your sensitivity to certain jokes and tackle it head on. [2] X Research source In some cases, you'll find some things to work through. In other cases, all you'll need is a renewed sense of humor. That can be developed by changing your attitude. Clinical Psychologist Susan Pazak explains, \"When we take life and situations so seriously we do not allow ourselves to find humor in much of anything.\" Consider if your interpretation of the joke is realistic and accurate. Are you basing your understanding of the joke on assumptions or first hand experience? Is your sensitivity based on previous experiences or a false sense of the intent of the joke teller? You may also consider if there is evidence to show that you should not take the joke seriously and can process your sensitivity in a way that is not angry or negative. Taking these questions into consideration may help you to realize that your sensitivity to the joke may not be warranted and your sensitivity may be based on other feelings or emotions that do not have anything to do with the joke."
    },
    {
      "title": "Consider if you are struggling with other emotions like stress and anxiety.",
      "content": "Consider if you are struggling with other emotions like stress and anxiety. Sometimes, other emotions can take over and it can be hard to laugh or smile at someone’s jokes. You may be feeling stress and anxiety due to a deadline, a commitment, or a recent setback, and not in the mood to listen to a funny story or a witty one liner. You may end up taking someone’s jokes seriously because you are caught in a negative headspace or too wrapped up in your issues to see the lighter side of things. [3] X Research source In other cases, it may be that the joke is ill-timed—meaning that the jokester could use some feedback from you on how it was received. Don't be afraid to be assertive—Clinical Psychologist Susan Pazak explains that \"being assertive is an effective way to engage with people and state your needs, wants, likes and dislikes without being passive or aggressive.\" Keep in mind laughter and joking around can be very effective stress relief, especially if you are struggling to maintain a positive outlook and are in a troubled or dark place. Though you may be in a mindset where everything is serious and dire, it’s important to allow yourself to lighten up and laugh, even if it’s at a silly joke."
    },
    {
      "title": "Notice if you are sensitive due to discomfort.",
      "content": "Notice if you are sensitive due to discomfort. You may be in a situation where you are taking a joke seriously because you are uncomfortable with the joke’s subject matter or you are confused about why the joke is funny. If you think the joke may be offensive, you should consider why you consider the joke offensive and if your reaction is based on fact (such as historical fact in the case of a racist joke) or personal experience (such as your experience as a woman in the case of a sexist joke). You do not need to necessarily have first-hand experience with a certain perspective to find a joke offensive and inappropriate. Often, if you are feeling uncomfortable because the joke seems crude or inaccurate, you may be justified in taking the joke seriously and not laughing at it."
    },
    {
      "title": "Ask for clarification if you are confused by a joke.",
      "content": "Ask for clarification if you are confused by a joke. If you are taking the joke seriously because you are confused by the intentions of the joke teller, you may want to ask the joke teller what he meant by his joke or ask him to clarify why he made the joke. You may hear a joke from a scientist, for example, that only makes sense to another scientist. Most jokes lose their punchline if they are overstated, but asking the joke teller questions can be a useful way for you to get more information about the joke and better understand certain types of jokes in the future."
    },
    {
      "title": "Put yourself in the shoes of the joke teller.",
      "content": "Put yourself in the shoes of the joke teller. You should think about who the joke teller is and why he may be telling a certain joke. A father may tell a joke about fathers to a group of people, for example, that may only make sense to other fathers. This may be because he wants to appeal to the other fathers in the group, and you may not get the joke because you are not a father. This can be applied to other professions and groups, as you may need to try to identify with the joke teller’s perspective to fully understand the joke. [4] X Research source It can be useful to consider the joke as representative of the humor of the joke teller as well. A person who has a goofy sense of humor may tell a different joke than a person who is more dry and witty. Aligning yourself with the joke teller can allow you to take the joke as it is meant to be taken, which is often not seriously."
    },
    {
      "title": "Notice how other people around you react to the joke.",
      "content": "Notice how other people around you react to the joke. If you can’t quite determine the intent behind the joke, you can look to the others around you to determine how you should react to the joke. Often, laughter can be infectious and you can end up laughing with everyone else just by paying attention to their reactions. Gauging the reactions of others can also allow you to take the joke less seriously, especially if the others around you are enjoying the joke. [5] X Research source According to studies, we do not choose to laugh. Often, laughter is an automatic response that we do unconsciously. This is why it’s difficult to laugh on command or fake a laugh. Paying attention to how others are responding around may cause you to inadvertently laugh at a joke, rather than remain serious and standoffish."
    },
    {
      "title": "Respond with a witty one liner.",
      "content": "Respond with a witty one liner. To break through your serious approach, you may want to challenge yourself to respond to the joke with a witty comeback or one liner. You can do this by picking up on a theme or idea in the joke and countering with a line you think is funnier or more interesting. [6] X Research source For example, a coworker may tell a joke about his toddler always being sad when he leaves the house. You may then respond with a one liner about how your dog is always sad when you leave for the day. This is a funny response because it builds off of the original joke and presents a funny counter-image: your dog, sad at the door, as you head off to work. This will show you are not taking your coworker’s joke seriously and can be part of the fun."
    },
    {
      "title": "Brush off the joke by being self-deprecating.",
      "content": "Brush off the joke by being self-deprecating. Self-deprecation is when you make fun of yourself as a way to elicit laughs. It can be useful when you are not sure how to respond to a joke or you realize you responded too seriously to a joke. Self-deprecating humor can be a good way to brush off an awkward moment and show you can poke fun at yourself. [7] X Research source Use self-deprecating humor whenever you feel awkward, on the spot, or unsure of what to say. For example, your friend may make a joke about how awful he is at a certain sport or game. You may respond with self-deprecation, like how awful you are at most things in general. This will likely cause your friend to laugh and allow you to respond to the original joke in a funny way."
    },
    {
      "title": "Tell your own jokes",
      "content": "Tell your own jokes . Gain more practice with joking around and laughing by forcing yourself to tell jokes to others. This can help you to take yourself less seriously and show you are willing to be funny. Clinical Psychologist Susan Pazak also recommends that you practice by \"watch[ing] funny shows and cartoons or read[ing] comics to allow yourself to laugh.\" You may want to look up some good jokes online and perform them in a mirror before you try them on others. You may also try out jokes on sympathetic friends before you tell them to a larger audience. It may also be fun to try an amateur comedy night at a local bar or pub and showcase your sense of humor to a room of sympathetic strangers. A good joke consists of a setup and punchline. The setup is the first half of the joke and usually contains the location and the key individuals. The punchline is usually one line and produces the laugh. For example, you may have the following set up: “A priest, a minister, and a rabbi walk into a bar.” You may then have this punchline: “The bartender says: ‘What is this, some kind of joke?’”"
    },
    {
      "title": "Practice telling funny stories to others",
      "content": "Practice telling funny stories to others . A funny story or anecdote can also help to lighten the mood and show you are willing to laugh with others. Telling a funny story is similar to telling a joke. You should combine timing and physical gestures and create a setup and a punchline for the story. You should also maintain eye contact with your audience as you tell the story and try to end the story on the line that will get the biggest laugh. When you are telling a joke or a story, you should try to be brief and to the point. Your audience has a limited attention span and you do not want them to lose interest in the story before you get to the punchline."
    },
    {
      "title": "Watch funny shows and films.",
      "content": "Watch funny shows and films. Get a better sense of what is considered funny by watching television shows and films that are considered comedic. Professional comedy actors are often very good at using timing and physical gestures, as well as well placed jokes, to get the viewer to laugh. Note if you prefer certain styles of comedy over others, such as dark humor, dry humor, or slapstick humor. You may then be able to determine which jokes you may find funny in real life around your coworkers, friends, or family. If you respond to slapstick humor in film or television, you may respond well to it in your own life."
    }
  ]
}