{
  "url": "https://www.wikihow.com/Work-out-With-Dumbbells",
  "title": "How to Work out With Dumbbells",
  "steps": [
    {
      "title": "Select dumbbells of the appropriate weight.",
      "content": "Select dumbbells of the appropriate weight . If you have not previously done weight training, you will need to select a set of dumbbells that will meet your needs at the beginner level. You can buy a set that has a wide range of dumbbell weights, so you can start light and work up. Alternatively, you can buy adjustable dumbbells which you can increase the weight of as you go. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you're trying to tone your muscles and build endurance, rather than significantly increase muscle size, select weights that allow you to do about 12 to 20 repetitions of a given exercise before feeling overly tired. If your goal is specifically strength training and building muscle mass, opt for a weight that you can only use for about 8 repetitions before being too tired to continue. Scale to heavier weights once the repetitions lose their challenge by the end of the set. [2] X Research source"
    },
    {
      "title": "Concentrate on form not repetitions when you start.",
      "content": "Concentrate on form not repetitions when you start. Concentrate on using the best possible form and technique, rather than trying to rush through repetitions, to keep your workout safe and focus on your muscles. Because weights strain your muscles and require stabilization and muscle resistance, slow and deliberate movements can help you maintain control and focus on the muscle you are trying to work. Slow movements also help build muscle and give your body a better workout, because it forces your muscles to stabilize and support the weight in every phase of the motion for longer. Take particular care not to overcompensate with another part of your body. For example, if you are doing a bicep curl, make sure you keep upright and maintain good posture. Don't transfer the work to your back. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Observe your form.",
      "content": "Observe your form. When you are working out with dumbbells it's important to pay attention to your form and body position, to get the most out of each repetition, but also to avoid the chance of an injury. Holding your wrists, elbows, arms, and legs in the proper position can prevent injury and improve the workout you receive from your efforts. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Performing exercises in front of a mirror may help you to ensure that your form is appropriate for dumbbell routines. Check videos online, magazine articles, and speak to gym staff if you need some guidance on proper form. A trainer can help teach proper posture and body mechanics for dumbbell workouts."
    },
    {
      "title": "Perform bicep curls.",
      "content": "Perform bicep curls. Your upper body consists of your arms, shoulders, upper back and chest. There are dozens of potential dumbbell variations that you can try which will work these muscles. For your biceps, the classic dumbbell move is the bicep curl. To do this, start with arms relaxed at your sides and pull up the dumbbells to shoulder height individually or together in two to three sets of eight to 20 repetitions. As you raise the dumbbell keep good posture and try not to jerk your body. Aim for a smooth and controlled motion. Variations include a sitting bicep curl, and a hammer curl, where you turn your palms in towards your body. Reader Poll: We asked 590 wikiHow readers what type of exercise they enjoy most for arm workouts, and 72% of them said weightlifting. [Take Poll]"
    },
    {
      "title": "Work your triceps.",
      "content": "Work your triceps. Tricep extensions are a good dumbbell exercise that you can do to work out your triceps. To do a tricep extension hold the dumbbells up over your head, one in each hand. Then, bending your arm at the elbow, lower one hand down and back to the rear of your shoulder. Raise your arm back up so it is above your head. Repeat this on the other side. Keep your arm still, and your posture upright. For a variation you can do a two-handed extension. Hold a dumbbell in both hands and perform the same movement as before. An alternative tricep exercise is a kickback. To do this, put your knee and hand on a bench, and hold a dumbbell in the opposite hand as you lean over. Push the dumbbell back so your hand goes up towards your hip as you extend your elbow. For each of these exercises try to perform between two to three sets of eight to 20 repetitions."
    },
    {
      "title": "Strengthen your shoulders.",
      "content": "Strengthen your shoulders. There are a large variety of dumbbell exercises you can do to work your shoulders. Many of these are variations on the shoulder press. To perform a shoulder press, begin by holding the dumbbells at shoulder level and then push your arms up, raising the weights straight above your head. Keep them elevated for a moment, before carefully lowering them down to your shoulders. This is one repetition. Don't lock you elbows out when you have the weights at the highest point, and take care not to jerk your back as you try to lift them. Keep your back straight and engage your core to support you. Presses can be done while standing or while seated."
    },
    {
      "title": "Use dumbbells to strengthen your chest.",
      "content": "Use dumbbells to strengthen your chest. You can use dumbbells for bench presses, the most commonly used exercise for strengthening the chest. Bench presses with dumbbells, just as with barbells, are useful for working out the chest muscles and require extra stabilizing muscles to help you lift. This move can be varied by performing a bench press on an incline, decline, or with a neutral grip. Laying down on a bench, with your hands in front of your shoulders, press both dumbbells toward the ceiling, hold for a moment, and lower again slowly. For variation try fly exercises for the chest. Seated on an incline, decline, or regular bench or chair, hold dumbbells out to the sides at shoulder height with arms slightly bowed. Perform a hugging motion to bring the weights in front of your body and slowly return them out to the sides."
    },
    {
      "title": "Practice exercises that target your back.",
      "content": "Practice exercises that target your back . You can use dumbbells to work out your back in a number of ways. Rows, bends, and dead lifts are useful and simple dumbbell exercises for strengthening the back, but they require extra attention to safety. If you suffer from back pain or injury, do not perform these routines except under the guidance of a trained fitness professional. Because of the danger of back injury, always use a weight you are comfortable with. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To perform a row, stand with your knees bent and lean forward, holding the dumbbells in each hand. Take care to keep your back straight. One at a time or both together, lift you hands up towards your core. As you lift the dumbbells breathe out. Breathe in again as you lower them back down. You can also do this in a squat position, or with the arm and leg of one side of your body resting on a bench. Do two to three sets of eight to 20 reps."
    },
    {
      "title": "Build your trapezius muscles.",
      "content": "Build your trapezius muscles. To target your traps, the muscle between your neck and your shoulder, you can do a very simple dumbbell exercise. The shoulder shrug simply involves holding dumbbells in each hand by your sides. Then make an exaggerated shrugging motion, lifting the shoulders, and slowly returning them back down to normal posture. You will soon begin to feel fatigue in your traps. Perform two to three sets of eight to 20 reps."
    },
    {
      "title": "Use dumbbells for extra resistance with crunches.",
      "content": "Use dumbbells for extra resistance with crunches. Multiple moves can be performed with dumbbells to work out your entire core. One example of adding weight to a normal core exercise is weighted crunches. To do these, simply hold a dumbbell in front of your chest when you complete your crunches. The extra weight will make each repetition harder and increase the workout your abdominals get. [6] X Research source Holding the dumbbell above your head will increase the difficulty significantly. The more weight you add, the more your abs will have to work to complete each set. Do two sets of twenty crunches."
    },
    {
      "title": "Perform weighted side bends.",
      "content": "Perform weighted side bends. These are good exercises for working the oblique muscles that run either side your abs. Holding a dumbbell in one hand, lean to the opposite side. Focus on lifting the dumbbell slightly, without resting it entirely on your hip. Switch arms and sides after two to three sets of eight to 20 reps."
    },
    {
      "title": "Try some woodchops.",
      "content": "Try some woodchops. Woodchops are a great exercise for working your core with a dumbbell. Start by holding the dumbbell up above your left shoulder with your arms extended. Then, with a chopping motion, pull the dumbbell down as you rotate your core and squat down. Bring the dumbbell down so it is on the outside of the shin of your right leg. Keep your core engaged as you swing the dumbbell back to the starting position above your left shoulder. Complete all your reps for that side, before switching and repeating on the other side. Try not to allow your back to bend and concentrate on your core. Do two to three sets of eight to 20 reps."
    },
    {
      "title": "Perform toe raises with dumbbells.",
      "content": "Perform toe raises with dumbbells. Dumbbells can also be used to exercise leg muscles. This works by adding weight to resistance moves that force your muscles to work harder. To perform weighted toe raises, hold dumbbells in each hand, slowly raise yourself to tiptoe, and then lower yourself slowly to the normal standing position. This will focus in on your calf muscles. For variations, you can do this one leg at a time or both together. You can also do this exercise while standing on a step. This modification will increase the range of motion by enabling your heel to drop below the level of the rest of your foot. Do two to three sets of eight to 20 reps."
    },
    {
      "title": "Practice lunge variations with dumbbells.",
      "content": "Practice lunge variations with dumbbells. Lunges can be performed by stepping a single foot forward or backward and keeping body weight evenly distributed between each foot. Add dumbbells to each hand to add resistance. As you bend your knees and drop down, you will feel the burn in your thighs. You can perform a side lunge just by stepping out one leg to the side and lowering your backside towards the ground. When performing lunges keep your back straight, don't let it round. Engage your core and concentrate on working your legs. Do front, back, and side lunges around two to three times for each leg."
    },
    {
      "title": "Use dumbbells with leg squats.",
      "content": "Use dumbbells with leg squats . Adding dumbbells to regular squats can make a big difference and will really test your leg muscles. Hold dumbbells in each hand and slowly lower your body by bending the knees at a 90-degree angle into sitting position. Hold the pose for a moment before slowly standing up straight again. Keep your upper body steady on the way up and down. One-legged squats will increase the difficulty significantly."
    }
  ]
}