{
  "url": "https://www.wikihow.com/Treat-Lawn-Fungus-Naturally",
  "title": "How to Treat Lawn Fungus & Rust Naturally",
  "steps": [
    {
      "title": "Baking soda, oil, and water could clear up brown patches.",
      "content": "Baking soda, oil, and water could clear up brown patches. Combine 1 tablespoon (14 g) of baking soda, 1 teaspoon (4.9 ml) of vegetable oil, and 1 gallon (3.8 L) of water, and thoroughly mix them together. Load the solution into a garden sprayer and apply it directly to the patch in your lawn. [1] X Research source Reapply the baking soda every 3 days until the fungus disappears completely. [2] X Research source Avoid using too much baking soda since it could increase the pH of your lawn."
    },
    {
      "title": "Neem oil treats fungus and kills damaging pests.",
      "content": "Neem oil treats fungus and kills damaging pests. Visit your local garden center and buy a neem oil concentrate. Neem oil comes in different concentrations, so read the instructions on the bottle to see how much water you need to mix in. [3] X Research source Put the neem oil into a garden sprayer and mist the affected patch of your lawn in the morning. Spray the patches once every week until the fungus clears up. [4] X Research source Mix the solution frequently while you’re using it since oil and water separate over time."
    },
    {
      "title": "Cornmeal has antifungal properties that eliminate spots in your yard.",
      "content": "Cornmeal has antifungal properties that eliminate spots in your yard. Buy a bag of horticultural cornmeal at your local gardening store or online. Use about 1–2 pounds (0.45–0.91 kg) of the cornmeal for every 100 square feet (9.3 m 2 ) of the lawn you’re treating. Either sprinkle the cornmeal by hand onto the fungal patches or load it into a lawn spreader to distribute it through your entire yard. [5] X Research source You can also make a “cornmeal tea” by loading 1 cup (140 g) of cornmeal into a garden sprayer with 5 gallons (19 L) of water. Let it sit for 30 minutes before spraying it on your lawn. [6] X Research source"
    },
    {
      "title": "Cutting your grass too short makes it weak and prone to fungus.",
      "content": "Cutting your grass too short makes it weak and prone to fungus. Set your mower’s blade height to 3 inches (7.6 cm) to help keep your grass healthy and encourage root growth. Only remove a third of the height each time you mow, which is about the same as 1 week’s growth. Avoid cutting your grass any closer to the ground since you’ll damage your lawn and prevent it from developing strong, deep roots. [7] X Research source For example, if your grass is 4 1 ⁄ 2 inches (11 cm) tall, only cut it down to 3 inches (7.6 cm) when you mow. Sharpen your mower’s blades 2 or 3 times every year to make clean cuts through the grass. Dull blades leave ragged edges on your grass and could lead to fungus."
    },
    {
      "title": "Watering early allows your lawn to dry out throughout the day.",
      "content": "Watering early allows your lawn to dry out throughout the day. Fungus grows in cold, damp environments so avoid watering in the evening or at night since the excess water won’t have a chance to evaporate. Once a week, set up a sprinkler in the early morning and give your lawn a deep soak. Your lawn needs about 1 inch (2.5 cm) of water every week to stay healthy, so turn off the sprinkler when it has enough and let your grass dry during the hottest parts of the day. [8] X Research source Set up a rain gauge or moisture meter in your lawn so you can measure how much water it gets."
    },
    {
      "title": "Fungus thrives in dark, moist areas of your lawn.",
      "content": "Fungus thrives in dark, moist areas of your lawn. Trim back shrubs and trees in your yard that keep parts of your lawn in the shade throughout the entire day. Get rid of any leaves or debris that are on your grass since they’ll hold moisture and prevent parts of your lawn from getting sunlight. The sun and heat can naturally kill the fungus in your yard and prevent it from coming back. [9] X Research source"
    },
    {
      "title": "Too much nitrogen can spread brown patches throughout your lawn.",
      "content": "Too much nitrogen can spread brown patches throughout your lawn. Nitrogen-rich fertilizers cause your grass to develop lush growth, but that makes it more prone to fungus. [10] X Research source If you need to fertilize your lawn, do it in the fall with 1 pound (0.45 kg) of slow-release nitrogen fertilizer for every 1,000 square feet (93 m 2 ) of lawn. That way, it will balance nutrients in the soil without getting overloaded with nitrogen. [11] X Research source Avoid using any fertilizer in the spring since it will prevent your grass from developing strong roots."
    },
    {
      "title": "Rake all of the dead grass out to decrease the risk of fungus.",
      "content": "Rake all of the dead grass out to decrease the risk of fungus. Dead grass builds up on your lawn and prevents new grass from growing in, which makes it more susceptible to fungus. [12] X Research source To do it by hand, buy a dethatching rake and pull it through your lawn. Since doing it by hand can be tiring if you have a larger lawn, you can instead rent a dethatching machine. Start the machine and push it back and forth across your entire lawn. [13] X Research source Clean up all of the dead thatch you removed so it doesn’t go back into your lawn. You may be able to find dethatching attachments for riding mowers to help speed up the process."
    },
    {
      "title": "Compacted soil retains moisture and could lead to fungal growth.",
      "content": "Compacted soil retains moisture and could lead to fungal growth. Rent a manual or power aerator from a landscaping center to use. Push the aerator back and forth in rows across your lawn to make small holes in the soil. The aerator removes small cylinders of soil so the ground is looser and helps with circulation and drainage around the grass roots. [14] X Research source Aerate your lawn every 2–4 years if you have normal soil or once every year if you have clay soil."
    },
    {
      "title": "Soil that’s lower than 7.0 pH puts your lawn at risk.",
      "content": "Soil that’s lower than 7.0 pH puts your lawn at risk. Get a home soil test at a gardening center and take a sample from your yard to test the pH. If the soil has 7.0 or higher, then it’s healthy and you don’t have to make any changes to it. However, if it has somewhere around 6.2–6.7 pH, it’s too acidic and could lead to fungal growth. To raise the pH, load lime into a garden spreader and distribute it evenly across your yard. [15] X Research source You can buy lime from your local gardening center or online."
    },
    {
      "title": "Grasses that are natural to your region are more resistant to diseases.",
      "content": "Grasses that are natural to your region are more resistant to diseases. Even though exotic grasses may look more appealing, they haven’t adapted to the fungi in your area. Talk to a landscaping specialist or someone at a gardening center and ask what types of grass grow the best and are most resilient where you live. If fungus has completely taken over your yard, completely reseed your lawn with the new grass for a healthier yard. [16] X Research source Always seed grass in the late summer or early fall to help it establish better. [17] X Research source"
    }
  ]
}