{
  "url": "https://www.wikihow.com/Use-a-Pressure-Cooker",
  "title": "How to Cook with a Pressure Cooker (With Sample Recipes)",
  "steps": [
    {
      "title": "Check that your pressure cooker is in good condition.",
      "content": "Check that your pressure cooker is in good condition. Examine your pressure cooker thoroughly to ensure there are no cracks or dents. Make sure all components (including the seal, valve, gauge, and condensation cup) are clean and functional with no signs of leftover food. [1] X Research source Also check that the rubber gasket ring that fits inside the rim of the lid has no tears and fits snugly into the lid. Pressure cookers that are cracked can be dangerous as they could release hot steam and burn you."
    },
    {
      "title": "Add your food and liquid.",
      "content": "Add your food and liquid. Prepare your food and add it to the pot, along with a liquid like water or broth, according to your recipe. The amount of liquid needed varies depending on your pressure cooker and your recipe, but the cooker should never be more than 2/3 full, as there needs to be room for the steam to accumulate. [2] X Research source There must always be some sort of liquid in your pressure cooker before you cook anything in it, as the steam from the liquid creates the pressure that cooks your food. If you have an old-style jiggle top cooker, always use at least one cup of water. For a newer-style valve cooker, the minimum amount of liquid is ½ cup. If you’re using the trivet, place it in the bottom of the pressure cooker before adding your food. The trivet is the stand for the steamer basket, which is frequently used to cook vegetables, fruit, and seafood."
    },
    {
      "title": "Close and lock the lid.",
      "content": "Close and lock the lid. Place the lid on top of the pressure cooker and slide it into place so that it locks and the valve is in the correct position. In most cases, you’ll hear a click when the lid is properly closed. The lid must be locked so that the steam is sealed in and the pot can successfully produce pressure. Make sure the rubber gasket ring is firmly in place inside the lid before closing the pressure cooker."
    },
    {
      "title": "Turn the cooker on to build pressure.",
      "content": "Turn the cooker on to build pressure. If you’re using an electric pressure cooker (or Instant Pot) , plug it in and set the cooking time and pressure according to your recipe. If you’re using a stove-top cooker , turn on a burner and allow the cooker to rise to pressure. The pressure indicator pin will begin to rise as the pressure inside the cooker increases. On some newer models, marks on the valve stem will appear as the pressure rises. In old jiggle top valves, this will be when steam comes out of the vent and the weighted pressure regulator will begin to jiggle. Place the safety valve on the nozzle when you see steam coming out of the nozzle. If using a stove-top cooker, maintain the pressure throughout cooking time by reducing the heat so that the cooker continues to simmer and does not whistle. If the heat supply isn’t reduced, the pressure may continue to rise and release steam, which will prevent the food from cooking properly."
    },
    {
      "title": "Release the pressure when your food is done.",
      "content": "Release the pressure when your food is done. Turn off the heat when your food has cooked for the appropriate amount of time. Do not attempt to lift the lid right away, as the pressure must be released before it is safe to do so. Your recipe should specify which of the 3 ways to release the pressure : [3] X Research source Natural release: Remove the cooker from heat and let it sit until the pressure releases on its own, typically within 10-30 minutes depending on the cooker. This method is often used for long cooking foods like roasts so they continue to cook while the pressure reduces. Quick release: Most old pressure cookers, and all new pressure cookers, have a quick release button on the lid. When this button is released, the pressure is slowly released from within the cooker. Cold water release: If using a stove-top cooker, place it under the sink faucet and run cold water on the lid until the pressure stops, being careful not to run the water directly on the pressure regulator or vent. This is the fastest way to release pressure, but do not use it if you have an electric cooker."
    },
    {
      "title": "Remove the lid and your food.",
      "content": "Remove the lid and your food. Make sure all of the pressure has been released before removing the lid. On jiggle tops, move the pressure regulator, and on newer models, move the valve stem. If there’s no sound of escaping steam, go ahead and unlock and remove the lid. Tilt it away from you to avoid getting hit with hot steam, then remove your food."
    },
    {
      "title": "Pressure cookers cook food quickly.",
      "content": "Pressure cookers cook food quickly. Pressure cookers typically cook food much faster than if you used another method (for example, what would normally take 2 hours will only take about 20 minutes). The pressure produced from the liquid’s steam raises the boiling point and forces liquid into the food, causing it to cook relatively quickly. [4] X Research source Note that cook times may vary depending on the altitude of where you live, with higher altitudes requiring longer cook times."
    },
    {
      "title": "They preserve nutrients in your food.",
      "content": "They preserve nutrients in your food. Because cooking times are reduced, heat-sensitive nutrients, like beta-carotene and ascorbic acid, are better preserved. Pressure cooking also reduces anti-nutrients like phytic acid better than boiling, so you’re left with a healthier meal. [5] X Research source"
    },
    {
      "title": "They tenderize meat.",
      "content": "They tenderize meat. Pressure cookers can cook all kinds of food, but they’re particularly good at cooking tough cuts of meat, like beef and pork. While not all pasteurized meats need to be softened, this is especially helpful if you cook wild meat. [6] X Research source"
    },
    {
      "title": "Meat and poultry",
      "content": "Meat and poultry Season and brown meat first for maximum flavor. To do so, heat a small amount of oil, such as canola oil, in the pressure cooker on medium high. Do not put the lid on during this process. Or, brown the meat in a pan before putting it in the pressure cooker. [7] X Research source Beef should be cooked to at least 160°F (71°C) while poultry should be cooked to 165°F (74°C). [8] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source The box that your pressure cooker came in may have a guide for preparing different kinds of food. Try making pressure cooker fried chicken for a yummy recipe."
    },
    {
      "title": "Seafood",
      "content": "Seafood Wash your seafood, then place it on a pressure cooker steamer basket on the support trivet. Use at least 3/4 cup (177 ml) of liquid, and add some vegetable oil to the basket to make sure the fish doesn’t stick. Fish and shellfish should reach a temperature of at least 145°F (63°C) [9] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source"
    },
    {
      "title": "Dry beans and chickpeas",
      "content": "Dry beans and chickpeas Soak beans in unsalted water for 4-6 hours, then drain them and place them in the pressure cooker with the amount of water required by your recipe. If you’re using an old jiggle top cooker, add 1-2 tbsp (15-30 ml) of vegetable oil to the water. [10] X Research source"
    },
    {
      "title": "Rice and grains",
      "content": "Rice and grains Soak wheat grain berries and pearl barley in lukewarm water for 4 hours before adding them to the pressure cooker. Do not soak rice and oats. Follow the instructions provided by your recipe to know how much water to add and how long to cook the grains."
    },
    {
      "title": "Fresh and frozen vegetables",
      "content": "Fresh and frozen vegetables Defrost frozen vegetables or wash fresh vegetables, then place them in the steamer basket. When cooked for 5 minutes, most veggies require a 1/2 cup (118 ml) of water in the bottom of the pressure cooker. Use 1 cup (236 ml) if the cooking time is 5-10 minutes, or 2 cups (473 ml) if the cooking time is 10-20 minutes. [11] X Research source Pressure cookers can make a lot of yummy vegetable dishes, like green bean casserole or roasted butternut squash soup. They also cook all kinds of potatoes well."
    },
    {
      "title": "Fruit",
      "content": "Fruit Wash all fruit, then place it in the steamer basket. In general, use 1/2 cup (118 ml) of water for fresh fruit and 1 cup (236 ml) for dried fruit. The amount of water needed, however, may vary depending on the recipe you use. [12] X Research source Try using your pressure cooker to make things like blueberry jam or cranberry sauce."
    },
    {
      "title": "Pressure cookers cook food using steam pressure.",
      "content": "Pressure cookers cook food using steam pressure. When the pressure cooker is turned on, the liquid inside boils and produces steam, which builds up to create pressure inside the pot. This causes food to cook faster by raising the boiling point of the liquid and forcing the hot liquid into the food. [13] X Research source There are two types of pressure cookers. The first is the old style pressure cooker with a “jiggle top,” or weighted pressure regulator that sits on top of the vent pipe on the lid. The second type is the newer style that uses spring valves and a closed system."
    },
    {
      "title": "Pick a pressure cooker that meets your needs.",
      "content": "Pick a pressure cooker that meets your needs. These days, you don’t have to worry about dangerous pressure cookers, as all modern models have built-in safety features. However, that doesn’t mean all pressure cookers are created equal. [14] X Research source Choose a cooker based on your individual needs, like how many people you regularly cook for and what foods you tend to make. Here are some general guidelines to consider: Stainless steel: Pressure cookers don’t have a barrier between your food and the pot, so you want a relatively unreactive metal. Look for high-quality stainless steel; 18/10 grade with an aluminum core is a popular choice. Pot dimensions: You can only fill a pressure cooker up to 2/3 full, so choose one large enough to prepare large meals. Most recommend choosing a cooker that’s at least 6-7 quarts in volume. Pay attention to the height and diameter as well to make sure accessories like a steamer basket will fit. Gauge style: If you want a stove-top cooker, the gauge is important, as it monitors the pressure inside. There are many different lid and gauge styles, so choose one that’s easy for you to read. For example, some have two bright red lines that indicate pressure. Other features and accessories: Think about what you want to cook in your pressure cooker. For example, if you plan on making rice or to slow cook your food, an electric pressure cooker is a good idea. Do your research to see what features and accessories your favorite recipes require and choose a cooker that will work well."
    },
    {
      "title": "Is it safe to use a pressure cooker?",
      "content": "Is it safe to use a pressure cooker? Yes, modern pressure cookers are perfectly safe to use. In the past, people were afraid to use pressure cookers due to manufacturer errors that caused many exploding accidents. However, modern cookers have many safety precautions in place to prevent this from happening. Just be sure to use the cooker according to its instructions, ensure the lid is locked and secure, and that the cooker isn’t damaged in any way. [15] X Research source"
    },
    {
      "title": "Do you need liquid in a pressure cooker?",
      "content": "Do you need liquid in a pressure cooker? Yes, you always need liquid to cook with a pressure cooker. The steam from the liquid is what creates the pressure required to properly cook your food. Check your recipe to find out which liquid you need and how much to add. [16] X Research source Attempting to use a pressure cooker without liquid is dangerous, as the pressure will build too much, which could cause the cooker to throw hot food all over the kitchen."
    },
    {
      "title": "What cooking methods can you use with a pressure cooker?",
      "content": "What cooking methods can you use with a pressure cooker? Pressure cookers can be used to cook food in various ways, including steam roasting, stewing, boiling, poaching, and more. Some modern models even allow you to bake cakes ! The possibilities are endless. [17] X Research source"
    },
    {
      "title": "What are the disadvantages of using a pressure cooker?",
      "content": "What are the disadvantages of using a pressure cooker? Pressure cookers have many advantages, like a fast-cook time and preserving nutrients in your food, but the main disadvantage is that you can’t check on or adjust your food while it’s cooking. This is why it’s important to follow recipes with accurate timings. [18] X Research source"
    }
  ]
}