{
  "url": "https://www.wikihow.com/Use-an-Italian-Bathroom",
  "title": "How to Use an Italian Bathroom",
  "steps": [
    {
      "title": "Find the bathroom and make sure it is open for business.",
      "content": "Find the bathroom and make sure it is open for business. This is more difficult than you might think. Some public bathrooms in small towns in Italy, for reasons stubbornly unclear, are closed during the lunch hour and on Wednesdays. If you can't find a public bathroom, try the train station. If the train station is anywhere close by, beeline right over there in full confidence that you will most likely find free restrooms which are somewhat functional."
    },
    {
      "title": "Keep searching.",
      "content": "Keep searching. If there is no open bathroom in the public square, and the train station is just too far and you know you can't make it, then your best bet might be to find a restaurant or a café. And yes, you will be expected to sit down, have a drink, and then use the facilities. You are thinking that drinking more fluids, just so that you can use the bathroom, kind of defeats the purpose. True enough. You have run up against one of the great conundrums of traveling in lovely rustic, old lands."
    },
    {
      "title": "Hand off your stuff.",
      "content": "Hand off your stuff. Give your bag, your sweater, that cute little sunhat, and any other handheld belongings to your friend. Or give it to your husband, your boyfriend, or to anyone who has the skill to be able to stand outside waiting for you for quite awhile, holding all that precious stuff you always drag around with you. Hopefully it's not raining. Once inside, the last thing you want, is to have to put any of your treasures on the floor of this bathroom. There is not likely to be a hook in the bathroom, nor a nice clean surface of any kind, at any height. Nor is the bathroom all that likely to have a spotless and dry floor."
    },
    {
      "title": "Get all supplies.",
      "content": "Get all supplies. As you make your handoff, be absolutely sure to take your toilet paper, and tampons, or sanitary pads, and your hand sanitizer with you. [1] X Research source Don't leave them in your backpack. Those necessary supplies won't do you a whit of good if you can't reach them, for heaven's sake."
    },
    {
      "title": "Bring a flashlight.",
      "content": "Bring a flashlight. While some bathrooms in Italy are equipped with lightbulbs and functioning electricity, some are not! Some of the doors in bathrooms run all the way from the floor to the ceiling. If the light inside that little stall is out, when you close that door, you might as well be shut up deep in the darkest Kentucky cave. This is not ideal. You need to be able to see for these delicate maneuvers. Bring that flashlight."
    },
    {
      "title": "Enter the bathroom.",
      "content": "Enter the bathroom. Wait in line and when it's your turn, get down. If the floor is dirty, squat as close to the \"toilet hole\" as possible. [2] X Research source This is going to be easier for you if you are in good shape. Just another reason to be glad you are doing those regular gym workouts. You are doing those, right?"
    },
    {
      "title": "Flush.",
      "content": "Flush. If you hear a strange noise and water is rinsing the entire toilet area floor, don't worry. It's how it \"flushes.\""
    },
    {
      "title": "Grab that toilet paper you brought in, and wipe and stand up.",
      "content": "Grab that toilet paper you brought in, and wipe and stand up. Do not wipe back to front, as it can cause UTI. [3] X Research source"
    },
    {
      "title": "Clean up.",
      "content": "Clean up. If you have an accident with aiming, clean off the fixture with some toilet paper you have brought from home. Leave things nice for the next person. You are all in the same boat together. They too, have been wandering the town looking for a place to go! You are like soul sisters."
    },
    {
      "title": "Wash your hands if there is any water available.",
      "content": "Wash your hands if there is any water available. Not guaranteed. Try to have hand sanitizer in your purse or knapsack just in case. And use it! [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Dry hands and head back outside.",
      "content": "Dry hands and head back outside. Get your stuff. Say thank you to the nice person who held all that crazy junk for you while you were in that stinky place for so long. Then go on your way and get a nice pizza or go tour another church or something."
    },
    {
      "title": "Aim for the small hole.",
      "content": "Aim for the small hole. Stand extra close for easier aim. If failing, don't worry. Flushing will rinse it."
    },
    {
      "title": "Flush.",
      "content": "Flush. If you hear a strange noise and water is rinsing the entire toilet area floor, don't worry. It's how it \"flushes\"."
    },
    {
      "title": "Clean up.",
      "content": "Clean up. If you have an accident with aiming, clean it off with some toilet paper you should bring from home. Wash and dry hands and leave. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}