{
  "url": "https://www.wikihow.com/Use-a-Basket-Steamer",
  "title": "How to Use a Metal, Silicone, or Bamboo Basket Steamer",
  "steps": [
    {
      "title": "Bring 1 to 2 in (2.5 to 5.1 cm) of water to a boil in a small saucepan.",
      "content": "Bring 1 to 2 in (2.5 to 5.1 cm) of water to a boil in a small saucepan. Pour water into the bottom of a saucepan that your steamer will fit inside. Place the pan on the stove and bring it to a boil over medium-high heat. [1] X Research source Wait until the water is vigorously bubbling, which means it’s boiling. On a 9-setting stove, for instance, medium-high heat is 5 to 7."
    },
    {
      "title": "Set the steamer basket into the saucepan and place the food inside.",
      "content": "Set the steamer basket into the saucepan and place the food inside. Once the water is boiling, rest the metal steamer basket in the saucepan, making sure that the water stays below the basket. Add the food that you want to steam to the bottom of the basket. [2] X Research source If the water comes up into the basket, pour some of it out before adding your food. For faster cooking times, cut your ingredients into small, even pieces. For example, cubed chicken will steam faster than a whole chicken breast. This method of cooking and preparation can also be used when working with a silicone steamer basket ."
    },
    {
      "title": "Cover the saucepan with a lid and reduce the heat to medium.",
      "content": "Cover the saucepan with a lid and reduce the heat to medium. Place a lid on top that completely covers the pan with the steamer inside. Then, turn the heat down on the stove to medium, which is 4 to 6 on a stove with 9 settings. [4] X Research source Use a lid that fits snugly over the pan so that no steam or moisture escapes; otherwise, the food may not cook properly."
    },
    {
      "title": "Let the food steam until cooked thoroughly.",
      "content": "Let the food steam until cooked thoroughly. Steam the food until it’s cooked to your liking. For example, most vegetables will steam in 5 to 7 minutes, whereas fish takes 10 to 15 minutes, and meat will take 25 to 30 minutes on average. [5] X Research source To check if vegetables are done cooking, poke them with a fork or knife to see if they’re tender and soft."
    },
    {
      "title": "Choose a basket steamer based on how much food you want to cook at once.",
      "content": "Choose a basket steamer based on how much food you want to cook at once. Bamboo basket steamers come in all different sizes and number of tiers. Pick one according to the quantity of food you usually cook and whether you want to steam multiple types of food at once. For example, the more tiers your steamer has, the more variety of food you can cook at one time. [6] X Research source If you’re a home cook, opt for the standard 10 to 12 in (25 to 30 cm) basket steamer. If you’re buying a steamer for a restaurant or commercial use, go with a larger one, like one that’s 30 in (76 cm)."
    },
    {
      "title": "Line the bottom of each tray with a lettuce or cabbage leaf.",
      "content": "Line the bottom of each tray with a lettuce or cabbage leaf. Take a large, clean lettuce leaf and lay it over the bottom of each tier that you’re going to use. This prevents the food from sticking to the basket steamer. [7] X Research source"
    },
    {
      "title": "Place the food you want to steam on top of the lettuce.",
      "content": "Place the food you want to steam on top of the lettuce. Spread out the food in a single layer over the lettuce leaf. To avoid overcrowding the steamer and to help the food cook evenly, leave a little space between the food instead of packing it tightly together. [8] X Research source If you’re steaming meat and veggies, put the meat on a separate tier since it takes longer to cook."
    },
    {
      "title": "Add 1 to 2 in (2.5 to 5.1 cm) water to a shallow pan big enough to hold the basket.",
      "content": "Add 1 to 2 in (2.5 to 5.1 cm) water to a shallow pan big enough to hold the basket. Choose a pan that your steamer basket fits snugly inside and is around 2 to 3 in (5.1 to 7.6 cm) deep. Check that the basket won't tip over or move around too much. Then, pour about 1 to 2 in (2.5 to 5.1 cm) of water into the bottom. [9] X Research source To prevent the bottom of your basket from burning, pick a pan that has sloped sides. This keeps the basket slightly raised off the bottom of the pan. You can also use a wok , which is the traditional pan of choice in Asian cooking."
    },
    {
      "title": "Bring the water to a simmer.",
      "content": "Bring the water to a simmer. Place the pan on the stove and turn it to medium heat. Wait until the water is gently bubbling or just before it starts to boil. [10] X Research source On a 9-setting stove, for instance, medium heat is any setting between 4 and 6."
    },
    {
      "title": "Place the steamer in the pan and put the lid on top of the basket.",
      "content": "Place the steamer in the pan and put the lid on top of the basket. Once the water reaches a simmer, set the steamer basket into the pan, ensuring the basket's bottom layer isn’t completely submerged. Cover the top of the steamer basket with the lid. If the bottom layer of food is underwater, pour out some of the water before placing the basket into the pan."
    },
    {
      "title": "Let your food steam until it's cooked to your liking.",
      "content": "Let your food steam until it's cooked to your liking. How long you steam the food depends on the type that you’re cooking. [11] X Research source Let vegetables cook for about 5 to 7 minutes, fish or dumplings cook for 10 to 15 minutes, and meat, like chicken, cook for closer to 25 to 30 minutes. Choose your steaming time based on the texture and temperature you prefer your food as well. For example, if you like softer veggies, steam them longer than if you like crunchier ones. Use a meat thermometer to measure when meat is done cooking. For instance, cook chicken until it's at least 165 °F (74 °C). Check the water level every so often as the food cooks. If you notice it’s getting low, add a little more. The water is what creates the steam."
    },
    {
      "title": "Steam your food until it's tender and cooked through.",
      "content": "Steam your food until it's tender and cooked through. The most common items to cook in a steamer are vegetables (broccoli, potatoes, green beans, etc.) and dumplings, but seafood (shrimp, clams, salmon, etc.) and meat (chicken, pork, etc.) can also be steamed to perfection. [12] X Research source But how long do you steam each item? Take a look at the list below to learn how long each ingredient typically takes to cook: Asparagus: 3 to 5 minutes [13] X Research source Beets: 10 to 15 minutes Broccoli: 8 to 10 minutes Carrots: 10 to 15 minutes Cauliflower: 8 to 10 minutes Chicken: 10 to 20 minutes Collard greens: 5 to 7 minutes Dumplings: 10 minutes Eggs: 15 to 16 minutes [14] X Research source Green beans: 3 to 5 minutes Kale: 5 to 7 minutes Pork belly: 2 hours [15] X Research source Potatoes: 10 to 15 minutes Seafood: 10 minutes per 1 in (2.5 cm) of thickness [16] X Research source Spinach: 3 minutes Tofu: 6 minutes When in doubt, follow a recipe! Steamer basket or steaming recipes typically include how long to steam each ingredient for."
    },
    {
      "title": "A bamboo steamer should sit in water.",
      "content": "A bamboo steamer should sit in water. If you’re cooking with a bamboo steamer, the bottom rim of the basket should always be submerged in water, but the bottom floor of the basket should stay dry. This allows the basket to heat up and produce steam without getting the food soggy. [17] X Research source Replenish water as you cook if needed. If the water looks too low, add some more boiling water to not upset the cooking process."
    },
    {
      "title": "Metal or silicone steamer baskets should sit just above the water.",
      "content": "Metal or silicone steamer baskets should sit just above the water. Whether you’re using a metal, silicone, or bamboo basket steamer, as a general rule, the water in the pot should always touch the bottom of the basket. There should be enough water to graze the bottom but not seep through the basket’s holes."
    },
    {
      "title": "Place the steamer basket in the dishwasher if it’s made of metal or silicone.",
      "content": "Place the steamer basket in the dishwasher if it’s made of metal or silicone. Most stainless steel and silicone steamer baskets are dishwasher safe. Check the packaging of your basket steamer. If it’s dishwasher safe, give it a good rinse after cooking and pop it in the dishwasher for easy cleanup. [18] X Research source"
    },
    {
      "title": "Clean bamboo steamer baskets by hand.",
      "content": "Clean bamboo steamer baskets by hand. Unlike metal and silicone baskets, bamboo steamer baskets must be cleaned by hand, as the dishwasher can damage them. Use warm water, soap, and a sponge to scrub the basket clean. Then, let it air dry completely before putting it away. [19] X Research source Always check the cleaning instructions on your steamer basket’s packaging or instruction packet, as some products give special steps for the best cleaning method."
    }
  ]
}