{
  "url": "https://www.wikihow.com/Style-Warrior-Cut",
  "title": "The Warrior Cut: How to Get & Style TikTok’s Latest Hair Trend",
  "steps": [
    {
      "title": "Towel dry your hair and tousle it with your fingers.",
      "content": "Towel dry your hair and tousle it with your fingers. The warrior cut is a pretty laid-back look, so the messier, the better! After washing your hair in the shower, squeeze excess water out with a towel. Run your fingers through your hair to mess up the strands and set the shape how you like it best. Wait until your locks are about 60% dry before moving on to add any products. [1] X Research source Check your hair product’s package directions—certain products may recommend that your hair be completely dry before use."
    },
    {
      "title": "Apply a strong-hold matte hair pomade or paste.",
      "content": "Apply a strong-hold matte hair pomade or paste. Choose a strong-hold medium-matte paste , clay, balm, or pomade to bring out the textures of your warrior cut. Check the package directions to see how much product you should use. Then, apply that product to your roots while avoiding your scalp. Work the product from root to ends, scrunching your hair to give it your desired look. [2] X Research source Along with staying away from your scalp, don’t worry about applying product to the back and sides of your hair (where the taper is!). Avoid hair gels, which will make your warrior cut look over-styled and won’t help to texturize your hair, giving it that natural bedhead look. Remember that the warrior haircut is an effortless, messy, just-rolled-out-of-bed look. Don’t worry too much about the pomade looking perfectly sleek or manicured. Instead, use the product to give your hair a natural, lived-in appearance. Styling product recommendations: Baxter Of California Hard Cream Pomade (4.5 stars on Amazon), Kevin Murphy Night Rider Firm Hold Texture Paste (4.5 stars on Amazon), and Paul Mitchell Mitch Clean Cut Styling Hair Cream (4.6 stars on Amazon). [3] X Research source"
    },
    {
      "title": "Finish off your look with a texturizing spray or sea salt spray.",
      "content": "Finish off your look with a texturizing spray or sea salt spray. Spritz a sea salt spray (or other texturizing spray ) over your locks and give them a final tousle with your fingers. Texturizing sprays can bring out the natural wave in your hair, giving the top of your warrior cut a pleasing, lived-in look. [4] X Research source If you choose, you can carry a travel-sized sea salt spray around with you to freshen up throughout the day. Styling product recommendations: Davines This is a Sea Salt Spray (4.6 stars on Amazon), Slick Gorilla Sea Salt Spray (4.2 stars on Amazon), and Bumble And Bumble Surf Spray (4.4 stars on Amazon)."
    },
    {
      "title": "Ask for a low taper fade with textured layers on top.",
      "content": "Ask for a low taper fade with textured layers on top. When you’re heading into the salon with a warrior cut in mind, describe the trendy hairstyle as a low taper fade with longer, piecey layers on top. The layers on top should typically be about 3–4 inches (76–102 mm) long and cut with the ‘point-cutting’ technique to create seamless strands of varying lengths. [5] X Research source Make sure to ask for a soft taper that’s not too fade-like. Tell your barber or hairstylist that you want the sides and back to connect evenly to the textured layers on top. To simplify things, look for a picture of your desired warrior cut online and bring some hair inspo along to your appointment with you! Then, your stylist will know exactly what vibe and cut you’re looking for. [6] X Research source"
    },
    {
      "title": "Get your hair trimmed about every 3-5 weeks.",
      "content": "Get your hair trimmed about every 3-5 weeks. To keep your warrior cut looking its best, go for a trim every three to five weeks. Regular trims will help the layers at the top of your cut from blending out and changing the look of your hairstyle. If trimming your hair every 3-5 weeks isn’t feasible for you, you can probably go up to two weeks longer between trims. The warrior cut has both shorter and longer layers, so you should be able to get away with a slightly grown-out look for a short period of time."
    },
    {
      "title": "Use a professional shampoo, conditioner, and biweekly hair mask.",
      "content": "Use a professional shampoo, conditioner, and biweekly hair mask. Avoid damage and split ends creeping into your warrior cut by investing in a professional shampoo and conditioner. [7] X Research source Some recommended professional shampoos include Baxter of California Daily Complete Care Shampoo (4.9 stars on Amazon) and Oribe Gold Lust Repair & Restore Shampoo (4.5 stars on Amazon), while professional conditioners like VERB Ghost Conditioner (4.5 stars on Amazon) and Monday Haircare Moisture Conditioner (4.5 stars on Amazon) are highly-rated by stylists and consumers. [8] X Research source Go the extra mile by using a professional hair mask treatment every 1-2 weeks to give your warrior cut hairstyle some extra nourishment. [9] X Research source Try Olaplex No. 3 Hair Perfector Repairing Hair Treatment (4.6 stars on Amazon). [10] X Research source As a bonus, if you follow these maintenance steps, you’ll be able to slightly extend your time between required trims!"
    },
    {
      "title": "A warrior cut is a low taper fade with a shorter back and a long textured top.",
      "content": "A warrior cut is a low taper fade with a shorter back and a long textured top. The warrior cut is a men’s hairstyle with a short, messy look. The cut features a soft, subtle fade around the sides and back with longer layers on top. These strands on the top of the head are textured via ‘point cutting,’ resulting in piecey-looking locks—think “peaks and valleys.” [11] X Research source The front of the cut is often over-directed or combed back to create a longer look compared to the rest of the cut. The warrior cut is often compared to the similarly trendy “broccoli cut,” which also features shorter sides and longer lengths on top. However, the broccoli cut features a curly top rather than the bedhead-esque, textured top on the warrior cut. The warrior cut is also more subtly blended from sides to top than the broccoli cut. [12] X Research source"
    },
    {
      "title": "The warrior cut has been around for a while but became a trend in 2019.",
      "content": "The warrior cut has been around for a while but became a trend in 2019. The look of the warrior cut has been around for decades—with celebs like Leonardo DiCaprio and Brad Pitt wearing it back in the ‘90s. However, the so-called “warrior cut” received its name and its initial revival around 2019 on TikTok. [13] X Research source In March 2024, TikTok user @europilled posted a video showing his transformation with the warrior cut—this post is largely credited with kicking off the warrior cut’s 2024 heyday. Since @europilled , many influencers have shared similar videos showing off their warrior cuts and giving tips on styling and maintenance. The warrior cut is particularly popular with cisgender men between the ages of 20 and 40—although the style can work on any gender and any age group. While it's unclear exactly how the “warrior cut” got its name, it's possible that it draws inspiration from historic military and Viking cuts. The warrior cut is a low-maintenance style, similar to military haircuts , although its styling is more relaxed. The name of the style may also be inspired by ancient warriors or Vikings, who were believed to wear more effortless styles and tie their long hair into a knot on the top of their heads—leaving the sides bare. [14] X Research source"
    },
    {
      "title": "The warrior cut can be tailored to suit any face shape.",
      "content": "The warrior cut can be tailored to suit any face shape. This trendy hairstyle is pretty classic and versatile, so it can be worn easily on a number of different face shapes. Chiseled face shapes (e.g., diamond, rectangle, square) tend to suit the warrior cut best because their sharp edges provide a nice contrast to the warrior cut’s wild and messy locks. However, the look can also work with rounder face shapes if the top of the hair is cut slightly shorter and styled to be slightly neater. Warrior cuts also work well for any hair type or texture, but they’re particularly effective for people who want some added thickness and volume. Ultimately, anyone can rock a warrior cut! If you feel good and confident about the hairstyle and think it looks cool, then go for it!"
    },
    {
      "title": "The warrior cut has been worn by Leonardo DiCaprio, Austin Butler, and more.",
      "content": "The warrior cut has been worn by Leonardo DiCaprio, Austin Butler, and more. If you need hair inspiration for your warrior cut, look no further than some of the most iconic leading men of the ‘90s and onward! Jensen Ackles, Nicholas Galitzine, and many more Hollywood stars have rocked the warrior cut. Review their looks to get a better idea of what the warrior cut looks like IRL, and you can even bring in your favorite style to inspire your hairdresser! Brad Pitt wore the warrior as his Fight Club character Tyler Durden. [15] X Research source Leonardo DiCaprio appeared with the warrior cut throughout the ‘90s. Jensen Ackles rocked a warrior cut in a 2024 photoshoot for The Boys . Nicholas Galitzine styled a softer version of the cut in The Idea Of You . Austin Butler regularly sports a hairstyle that draws inspiration from the warrior cut. [16] X Research source"
    },
    {
      "title": "",
      "content": "If you like the warrior cut but aren’t sure that it’s the perfect cut for you, you’re in luck! TikTok has popularized many other men’s hairstyles and haircuts that you can explore and try out for yourself. Start with this list of trendy TikTok haircuts for men to find the perfect fit for you: Broccoli Haircut : Tapered sides with short, unevenly layered curls on top. Low Taper Fade : Gradually thinned-out hair on the sides of the head, fading to skin level at the neck. Wolf Cut : Short choppy layers on top with longer layers at the back. Mullet : Short on the sides and top of the head with long hair at the back. French Crop : Short back and sides with a longer top that’s combed forward into bangs."
    }
  ]
}