{
  "url": "https://www.wikihow.com/Suggest-Friends-on-Facebook",
  "title": "How to Suggest Friends on Facebook",
  "steps": [
    {
      "title": "Open Facebook on your phone or tablet.",
      "content": "Open Facebook on your phone or tablet. It's the blue icon with a white \"f\" inside. You'll usually find it on the home screen. If you're using an Android, you may have to open it from the app drawer."
    },
    {
      "title": "Open one of the two friends' profiles.",
      "content": "Open one of the two friends' profiles. You can search for your friend by tapping the magnifying glass icon near the top-right corner of the screen."
    },
    {
      "title": "Tap the blue-and-white Friend icon.",
      "content": "Tap the blue-and-white Friend icon. The icon displays the silhouette of a person's head and shoulders and appears to the right of the \"Message\" button."
    },
    {
      "title": "Tap Copy Link.",
      "content": "Tap Copy Link . It's under the \"(name)'s Profile Link\" header near the center of the menu. This copies the profile link to your clipboard. You may have to tap OK to continue."
    },
    {
      "title": "Go to the other person's profile.",
      "content": "Go to the other person's profile. Now that you have the link copied, you can send it to the other party in a new Facebook message. If you want to send the profile link in an email or another messaging app, you can paste the copied URL into that message by long-tapping the typing area and selecting Paste ."
    },
    {
      "title": "Tap the blue Message button.",
      "content": "Tap the blue Message button. It's below the person's name at the top of their profile. This opens a new message in the Messenger app. If you don't have the Messenger app installed, follow the on-screen instructions to install it now. You'll need it to send Facebook messages on your phone or tablet."
    },
    {
      "title": "Tap and hold the typing area at the bottom of the message.",
      "content": "Tap and hold the typing area at the bottom of the message. A menu will appear."
    },
    {
      "title": "Tap Paste on the menu.",
      "content": "Tap Paste on the menu. This pastes the person's profile link into the message."
    },
    {
      "title": "Tap the Send button.",
      "content": "Tap the Send button. The Send button may appear as a paper airplane icon or an arrow, depending on the platform and version. Once the message is sent, it will appear as a tappable link in the conversation. Your friend can then tap the link to open the profile and then tap Add Friend to send a friend request."
    },
    {
      "title": "Open https://www.facebook.com in a web browser.",
      "content": "Open https://www.facebook.com in a web browser. One of the easiest ways to help one Facebook friend connect to another is to send a link to the other's profile. Once you copy the profile link, you can paste it into a new message (on Facebook or in your preferred messaging or email app). If you aren't already logged in to Facebook, you should do so now."
    },
    {
      "title": "Open one of the two friends' profiles.",
      "content": "Open one of the two friends' profiles. You can use the Search bar at the top of the screen to search."
    },
    {
      "title": "Highlight the web address.",
      "content": "Highlight the web address. The full address to the open profile appears at the top of your browser. It should look something like facebook.com/wikiHow . You can usually highlight the whole address at once by clicking the address bar. If that doesn't work, click the address bar once and press Ctrl + A (PC) or ⌘ Cmd + A ."
    },
    {
      "title": "Press Ctrl+C (PC) or ⌘ Cmd+C (Mac).",
      "content": "Press Ctrl + C (PC) or ⌘ Cmd + C (Mac). This copies the profile link to your clipboard."
    },
    {
      "title": "Go to the other person's profile.",
      "content": "Go to the other person's profile. Now that you have the link copied, you can send it to the other party in a new Facebook message. If you want to send the profile link in an email or another messaging app, you can paste the copied URL into that message by right-clicking the typing area and selecting Paste."
    },
    {
      "title": "Click the Message button.",
      "content": "Click the Message button. It's in the row of buttons to the right of the person's name, which appears in the cover image. This opens a new message to your friend at the bottom-right corner of the page."
    },
    {
      "title": "Right-click the typing area and select Paste.",
      "content": "Right-click the typing area and select Paste . The typing area is the field that says \"Type a message\" at the bottom of the message. The copied URL will appear in the typing area."
    },
    {
      "title": "Press ↵ Enter or ⏎ Return to send.",
      "content": "Press ↵ Enter or ⏎ Return to send. This sends a clickable link to the recipient. The recipient can now click that link and view the person's profile. If the recipient wants to add the person after viewing their profile, they can do so by clicking Add Friend to the right of the person's name."
    },
    {
      "title": "Open Facebook Messenger on your phone or tablet.",
      "content": "Open Facebook Messenger on your phone or tablet. The Facebook Messenger app has a blue and white chat bubble icon with a lightning bolt inside. You'll find it either on the home screen or in the app drawer. If you don't have Facebook Messenger, you'll need to install it from the App Store (iPhone/iPad) or Play Store (Android)."
    },
    {
      "title": "Tap the New Message icon.",
      "content": "Tap the New Message icon. It looks like a pencil (and a sheet of paper, if using an iPhone or iPad) and it appears at the top-right corner of Messenger. [2] X Research source"
    },
    {
      "title": "Select the two friends you want to connect.",
      "content": "Select the two friends you want to connect. You can scroll down and tap both friends in the list, or search for your friends using the \"Search\" bar at the top of the screen. Just make sure you've selected only the two friends you wish to connect. This adds both friends to the \"To\" field at the top of the message."
    },
    {
      "title": "Type a message to introduce them.",
      "content": "Type a message to introduce them. To start typing, tap the blank typing area at the bottom of the message. You could say something like, \"Just sending a message to connect you two!\" if you wish."
    },
    {
      "title": "Tap the Send button.",
      "content": "Tap the Send button. The Send button may appear as a paper airplane icon or an arrow, depending on the platform and version. This creates a group message. Any messages you (or your two friends) type in response will be delivered to all members of the group."
    },
    {
      "title": "Leave the conversation (optional).",
      "content": "Leave the conversation (optional). If you don't want to be a part of the conversation between your two friends, you have the option to remove yourself. Just tap the names of the people you're communicating with at the top of the chat and select Leave Chat (iPhone/iPad) or Leave Group (Android). [3] X Research source"
    },
    {
      "title": "Open https://www.facebook.com in a web browser.",
      "content": "Open https://www.facebook.com in a web browser. One of the easiest ways to help one Facebook friend connect to another is to send a link to the other's profile. Once you copy the profile link, you can paste it into a new message (on Facebook or in your preferred messaging or email app). If you aren't already logged in to Facebook, you should do so now."
    },
    {
      "title": "Click the Messenger icon.",
      "content": "Click the Messenger icon. It's the chat bubble containing a lightning bolt at the top of the page (in the blue bar). A menu will expand."
    },
    {
      "title": "Click New Message.",
      "content": "Click New Message . It's at the top-right corner of the menu."
    },
    {
      "title": "Add both friends to the \"To\" field.",
      "content": "Add both friends to the \"To\" field. To do this, start typing the name of one of your friends. As you type, a list of search results will appear. Click the correct friend once you see them in the results, and then do the same for the other friend."
    },
    {
      "title": "Type a message to introduce them.",
      "content": "Type a message to introduce them. To start typing, tap the blank typing area at the bottom of the message. You could say something like, \"Just sending a message to connect you two!\" if you wish."
    },
    {
      "title": "Press ↵ Enter or ⏎ Return to send the message.",
      "content": "Press ↵ Enter or ⏎ Return to send the message. This creates a group message. Any messages you (or your two friends) type in response will be delivered to all members of the group."
    },
    {
      "title": "Leave the conversation (optional).",
      "content": "Leave the conversation (optional). If you don't want to be a part of the conversation between your two friends, you have the option to remove yourself. Just click the gear icon at the top-right corner of the message, select Leave Group , and then choose Leave Conversation [4] X Research source ."
    }
  ]
}