{
  "url": "https://www.wikihow.com/Wash-Curly-Hair",
  "title": "How to Wash Curly Hair",
  "steps": [
    {
      "title": "Pick SLS-free shampoo.",
      "content": "Pick SLS-free shampoo. SLS stands for sodium lauryl sulfate which is too harsh for curly hair and can cause frizz. It is the key ingredient in most shampoos and detergents. Choose shampoos that use natural oils as alternatives. If you do not use the right conditioner with an SLS shampoo, it may lift your hair from its cuticle. Natural oils can help strengthen your hair and keep it shiny. Shampoo without SLS may not produce a rich lather but may add both bounce and gloss to your curls as well as help maintain your hair color. [1] X Research source"
    },
    {
      "title": "Read the labels to ensure you limit the use of alcohol.",
      "content": "Read the labels to ensure you limit the use of alcohol. Products with high Alcohol content tend to create crunchy curls as they suck the moisture out of your hair and can even lead to breakage. Use water-soluble gels as an alternative. They should not feel sticky to the touch. You may also use aerated mousses or foams. Aerated foams and mousses will resemble beaten white foam once dispensed. Any product that provides lift and hold usually contain alcohol. While gels and mousses tend to contain a significant amount of alcohol, hairspray usually contains the most."
    },
    {
      "title": "Use the right conditioner.",
      "content": "Use the right conditioner. Pair a conditioner with a shampoo designed for dry or damaged hair. Curly hair is prone to damage and getting dried out. There is a greater tendency for damage if your hair is dyed. Use products with natural oils like coconut, jojoba, or other natural oils. [2] X Research source Even if the label does not state that the product is for curly hair but states that it is for damaged hair, their formulas may be quite similar. The right product for curly hair may not necessarily be labeled as such."
    },
    {
      "title": "Make your own deep conditioner.",
      "content": "Make your own deep conditioner. Create your own natural conditioner using a cup of homemade mayonnaise at room temperature. Stir ingredients together and apply through your hair, applying liberally through the tips. There should be enough for 2 treatments depending on your hair length. Apply the treatment immediately after making it to allow the fats and oil to penetrate down through the hair follicles. Wash it out with cold water to more easily remove it. [3] X Research source You may make your own mayonnaise using ½ cup olive oil + 3 egg yolks. Do not refrigerate as the formula works best at room temperature. However, do not let the conditioner sit for more than a few hours."
    },
    {
      "title": "Shampoo less often with less product.",
      "content": "Shampoo less often with less product. Shampooing frequently may be damaging to your hair regardless of the type as it can dry it out. [4] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. When you do use shampoo, concentrate on your scalp to avoid dryness. Only lather your hair once unless you're using heavy styling products. Once your scalp is clean, gently wash the shampoo through the ends of your hair. [5] X Research source An average person may wash her hair about every 2 or 3 days. Watch for signs that you should wash your hair such as an itchy scalp, flaking, or if your hair is visibly oily. [6] X Research source Sebaceous glands secrete an oily substance to help moisturize your scalp and hair and are most likely responsible for making your hair feel dirty. Wash your hair when it feels dirty or follow these tips [7] X Research source : If you have thick hair, tight curls, or kinks, you just need to wash your hair about once a week or until it feels dirty. Daily washing will make your hair feel dry. You may use a dry shampoo or conditioner between washes to help refresh your hair. [8] X Research source If you have medium curls, kinks, or waves, you may shampoo every few days as your curls will look fine with a small amount of the natural oils from the sebaceous glands. Use low-foaming shampoos or a shampoo bar. You may also need to use conditioner in between shampoos if you are active and workout a lot. You may also just use water to massage your scalp in between your shampoos as well. [9] X Research source If you have fine curls or waves, you probably use styling products everyday that makes your hair feel oily. You may shampoo every day to keep your hair looking clean and use a good conditioner to keep it moisturized. [10] X Research source The quality of the water of your city will affect your hair. Generally, hard water is the worst for hair because it counteracts the shampoos ability to cleanse the hair. [11] X Research source"
    },
    {
      "title": "Wash and handle your hair gently.",
      "content": "Wash and handle your hair gently. Do not apply shampoo onto a dry head of hair. Ensure that your hair is soaked in water then completely rinse off any shampoo after correctly applying it. Prevent tangles and knots by not piling strands of your hair at the top of your head. Gently use your fingertips to massage your scalp and wash your hair gently. [12] X Research source"
    },
    {
      "title": "Remember to always condition.",
      "content": "Remember to always condition. Due to the shape and texture, conditioning is essential because natural scalp oils are not spread throughout your hair as much as straight or wavy hair. Usually, brushing hair helps to spread scalp oils, however, brushing is not recommended for curly hair. [13] X Research source"
    },
    {
      "title": "Apply conditioner correctly.",
      "content": "Apply conditioner correctly. Apply conditioner to the length of your hair and avoid applying near your scalp. Conditioner at the scalp can weigh down your hair making it look flat while the rest of your hair stays puffy. Try to keep conditioner for as long as you can because it will moisturize as long as it is applied. [14] X Research source Apply a liberal amount of deep conditioner to wet hair after it has been washed and cleaned. Focus on the ends of your hair as they can be dry and fragile. Leave the conditioner for 5 minutes as you shower as the steam aids the conditioner in penetrating your hair. [15] X Research source Leave the conditioner longer if your hair is more damaged. You may place your hair in a plastic shower cap and cover with a towel to keep the heat from escaping your head. After 10 to 20 minutes, rinse the conditioner out but do not shampoo because you want any oils to remain in your hair. Conditioner will continue to work until the next time you use shampoo to wash your hair. [16] X Research source You might also try sitting under a heated dryer while the conditioner is on, with a plastic cap."
    },
    {
      "title": "Towel dry your hair using plopping or microfiber towels as gloves.",
      "content": "Towel dry your hair using plopping or microfiber towels as gloves. Plopping is a technique that uses an old t-shirt instead of a towel to dry your hair. [17] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. Using microfiber towels as gloves is a technique that is exactly as it sounds. Towel drying can easily cause frizz but these techniques can eliminate that as well as reduce tangles and prevent your hair from breaking. [18] X Research source Plopping requires you to place an old t-shirt on a flat surface positioning the end with the sleeves facing you. Bend over and lay your head at the center of the t-shirt making sure that there's material in front of and behind your hair. Try to position yourself so that your hair scrunches hair straight down. Cover the back of your neck with the bottom of your t-shirt. Then, gather the front material of your t-shirt and keep it tight against the sides of your head as you take the sleeves and wrap them from the front to the back of your head. You may twist the sleeves and side material to help keep it tight against your head. Tie the sleeves at the front of your forehead to keep the plop tight. Tuck in any loose material and leave to dry. [19] X Research source Once the conditioner has been rinsed off, turn your head upside down and scrunch your curls with microfiber towels. You may be able to purchase actual microfiber towel gloves online or your local beauty supply store. Scrunching your hair removes excess water while still adding volume. It also reduces frizz and keeps the definition of your curls. [20] X Research source"
    },
    {
      "title": "Add a diffuser to your hairdryer.",
      "content": "Add a diffuser to your hairdryer. The sheer force of a hair dryer can ruin your curls and create a lot of unwanted frizz. Diffusers evenly disperse the air produced by your hair dryer. They may also be used to add volume to your hair and help set curls. [21] X Research source Make sure your diffuser fits firmly onto your hair dryer. While your hair dryer may have come with an attachment, you can also buy a universal diffuser online or your local beauty supply store. [22] X Research source Apply your styling products before drying your hair with the diffuser. Your hair should be about 75% dry before using the diffuser to finish drying. [23] X Research source Use the medium setting of your hair dryer if you do not have time to use the cool setting. The cool setting prevents heat from damaging your hair. [24] X Research source Using the bowl of the diffuser, move your head upside down or tilt to the side to place sections of your hair directly into the bowl to dry. [25] X Research source Dry straight to the roots of your hair by moving the diffuser closer to your head. Be mindful not to ruin clumping or the formation of your curls. Work the sections of your hair until it's only 10% wet then adjust your curls. Use a small amount of product, like pomade or curl cream, and dry the remainder of your hair to lock in the moisture of the product. [26] X Research source For more volume, shake your roots with your fingers. [27] X Research source"
    },
    {
      "title": "Pick the right products to control your frizz.",
      "content": "Pick the right products to control your frizz. Avoid your hair from looking greasy and protect your curls from heat and frizz by choosing the right products. For fine curls, use an anti-frizz milk or lotion that's lightweight. For coarse or heavier curls, use a thick treatment oil to allow moisture to penetrate your frizz-prone locks."
    },
    {
      "title": "Use your dry hair with wet fingers and don't use a brush.",
      "content": "Use your dry hair with wet fingers and don't use a brush. Avoid brushing dry curls as it can lead to breakage by stretching your hair and disrupting your hair's cuticle. Breakage can also occur from combing dry curls, depending on how tight the curls are and the width of your comb's teeth. While your hair is still wet after a wash, you may use a combination of towel drying and brushing, combing, or finger-combing your hair. Then, add either a conditioner or anti-frizz product and style with your fingers. [28] X Research source If you must comb dry hair use wet fingers. Even on a humid or windy day, water is enough to tame any frizz because frizz is the result of dryness. [29] X Research source"
    }
  ]
}