{
  "url": "https://www.wikihow.com/Use-TweetDeck",
  "title": "How to Use TweetDeck",
  "steps": [
    {
      "title": "Go to https://tweetdeck.twitter.com in your web browser.",
      "content": "Go to https://tweetdeck.twitter.com in your web browser."
    },
    {
      "title": "Click Log in.",
      "content": "Click Log in . It's on the right side of the page. If you’re already signed in to Twitter on your web browser, skip to step 4."
    },
    {
      "title": "Log in with your X username and password.",
      "content": "Log in with your X username and password. You can use X Pro to manage an unlimited number X accounts, but X recommends signing in with an account that you don’t share with others. [1] X Research source"
    },
    {
      "title": "Browse the four columns.",
      "content": "Browse the four columns. X Pro creates 4 columns the first time you log in: Home : This is the normal tweet stream that you see on Twitter.com or the X app. This stream shows tweets from everyone you follow. Notifications : Here’s where you’ll find all interactions, such as people tweeting at or following you. This is the same as clicking Notifications on X. Messages : All your Direct Messages appear in this column. Double-click a message to view its contents and send a reply. Activity : This is the stream of actions being performed by users you follow, such as when they follow someone, favorite a tweet, or add someone to a list."
    },
    {
      "title": "Click the Accounts icon in X Pro.",
      "content": "Click the Accounts icon in X Pro. It’s the icon that looks like two peoples’ heads near the bottom-left area of the page."
    },
    {
      "title": "Click Link another account you own.",
      "content": "Click Link another account you own . It's in the new Accounts column on the left side of the page."
    },
    {
      "title": "Review the pop-up message and click Continue.",
      "content": "Review the pop-up message and click Continue . This message explains that linking another account will allow your main account (the one currently logged in) to take actions on behalf of other accounts you link. This includes tweeting, sending Direct Messages, and making administrative changes."
    },
    {
      "title": "Log in with the new account's login credentials.",
      "content": "Log in with the new account's login credentials. Enter the username and password for the account you want to add, and then click Authorize to confirm. This adds the other account to X Pro. You'll see a list of all accounts your primary account can manage at the bottom of the Accounts column. You can keep adding more accounts in the same manner. When you compose a new tweet, you’ll be able to select which user account you want to tweet as."
    },
    {
      "title": "Click + to add a column.",
      "content": "Click + to add a column. It's the plus symbol on the icon bar that runs along the left side of X Pro."
    },
    {
      "title": "Select a column type to add.",
      "content": "Select a column type to add. You’ll see several options for additional columns that can be added to your X Pro view. In addition to the default column types you’ve already learned about, you'll find: User : This creates a column that displays the tweets of any user you manage. List : You’ll be able to choose any existing Twitter list you’ve set up with the app or on Twitter.com. Collection : Here you’ll have the option to curate a list of tweets for the world to see. Likes : A running list of everything an account liked on Twitter. Mentions : It’s like the Notifications column, but only displays tweets that contain your X @username. Followers : A running list of people who start following your account. Scheduled : Any scheduled tweets that have yet to be sent will appear here. The tweet will disappear from the column when the scheduled time arrives. Messages (all accounts) : Displays direct message to any logged-in account in a single column. Mentions (all accounts) : The same principal as Messages, but with tweets that contain the handles of any logged-in account. Trending : Shows a list of popular hashtags."
    },
    {
      "title": "Select a user.",
      "content": "Select a user. If you have multiple accounts logged in, you’ll have to choose the user whose information will appear in the new column. For example, if you're adding a User column, you'll choose which user's tweets you want to see in the column (e.g., your primary account or one of your linked accounts). If you selected Mentions (all accounts) or Messages (all accounts) , you won’t have to choose a user."
    },
    {
      "title": "Click the settings icon at the top of any column.",
      "content": "Click the settings icon at the top of any column. It looks like two horizontal lines with hollow circles over each. This is where you can modify or delete the contents of the column. You'll see some different options depending on the types of columns you have. Click Notification types at the top of the settings menu to adjust which notifications appear in the column. This option appears in the Notifications and Activity columns. Click Tweet authors at the top of the menu to filter what appears in the column based on a certain X user. You can also use the \"Mentioning\" menu to see certain types of tweets or exclude them based on criteria of your choice. Click Preferences in the menu to adjust other settings, such as toggling notification sounds on and off and adjusting media sizes in tweets."
    },
    {
      "title": "Drag your columns to rearrange them.",
      "content": "Drag your columns to rearrange them. There's a thin gray bar at the top-left corner of each column. If you'd like to move a column to a different location in your X Pro view, hover the mouse cursor over that bar for a moment, and then drag the bar left or right. Lift your finger to drop the column into its new place. To delete a column entirely, click the settings icon above the column, click Preferences on the menu, and then click X Remove ."
    },
    {
      "title": "Click the feather icon to create a new tweet.",
      "content": "Click the feather icon to create a new tweet. It's the blue-and-white icon at the top-left corner of the X Pro page. The New Tweet column will slide out to the right of the feather icon. To reply to a tweet you see in one of your columns, click the chat bubble icon just beneath the contents of the tweet—this adds the recipient's account info to the New Tweet column. To retweet, click the double-arrow retweet button beneath a tweet instead."
    },
    {
      "title": "Select an account to tweet from.",
      "content": "Select an account to tweet from. Each linked account's profile icon appears at the top of the New Tweet column. Click the photo of the account you'd like to tweet from."
    },
    {
      "title": "Compose your tweet.",
      "content": "Compose your tweet. Like using the X app or website, there’s a 280-character limit on tweets. To add an image or video clip to your tweet, click Add Images or videos below the typing area, select the file you want to attach, and then click Open . If you'd rather schedule the tweet for a different time and/or date, click the Schedule Tweet button, enter the desired time, and then select the date."
    },
    {
      "title": "Click Tweet to send the tweet.",
      "content": "Click Tweet to send the tweet. If you scheduled your tweet for a different time, you don't have to click this button—your tweet will be sent automatically at the scheduled time."
    },
    {
      "title": "Click a Direct Message to send a reply.",
      "content": "Click a Direct Message to send a reply. You can skip this step if you want to create a brand new message. If you want to respond to an existing message in the Messages column for any linked account, click the message to open the typing area, enter your message (and attach a photo or video clip if desired), and then click Reply to send it. If you don't see the Messages column for the account you want to use, click the + , select New Column , and select the Messages column type. Click the user's profile icon and select Add column to view that inbox."
    },
    {
      "title": "Click the feather icon to create a new message.",
      "content": "Click the feather icon to create a new message. If you want to create a brand new Direct Message, you'll click this blue-and-white icon at the top-left corner of the X Pro page. The New Tweet column will slide out to the right of the feather icon."
    },
    {
      "title": "Click the Direct Message button.",
      "content": "Click the Direct Message button. It's the last button on the New Tweet column. This changes the column from \"New Tweet\" to \"New Message.\""
    },
    {
      "title": "Select an account to use.",
      "content": "Select an account to use. Each linked account's profile icon appears at the top of the New Message column. Click the photo of the account you'd like the message to come from."
    },
    {
      "title": "Enter the recipient's username into the \"To\" field.",
      "content": "Enter the recipient's username into the \"To\" field. Start typing a name or username into the field and X Pro will display matching results. Click the recipient's account when you see it. You can add additional recipients if you'd like. Just click the white space next to the recipient and start typing another name."
    },
    {
      "title": "Type your message.",
      "content": "Type your message. This goes into the \"Message\" box and can be up to 280 characters. If you'd like to attach a photo, click Add image below the typing area, select a file, and then click Open ."
    },
    {
      "title": "Click the Send message button.",
      "content": "Click the Send message button. It's below the typing area. The message will be sent to the selected recipient(s)."
    },
    {
      "title": "Click the magnifying glass icon to open the search bar.",
      "content": "Click the magnifying glass icon to open the search bar. It's at the top-left corner of X Pro."
    },
    {
      "title": "Type your search criteria.",
      "content": "Type your search criteria. You can search for any text, including usernames and hashtags. [2] X Research source You can use an asterisk (*) in place of a word. For example, type “The best restaurant in Portland is *” (including the quote marks) to see results like “The best restaurant in Portland is Pizza World.”"
    },
    {
      "title": "Press ⏎ Return or ↵ Enter.",
      "content": "Press ⏎ Return or ↵ Enter . The results of your search will appear in a column all the way at the end of your existing columns. If you have a lot of columns, you'll need to use the horizontal scrollbar at the bottom of the page to scroll all the way to the right."
    },
    {
      "title": "Filter the results.",
      "content": "Filter the results. By default, the results will appear as a list of tweets. You can refine the results based on several criteria. Click the settings icon at the top-right corner of the search column (the two horizontal lines with circles) and then choose one or more of the following filtering options: Click Tweet Content to filter by information in the tweet, such as certain words, date ranges, and whether or not to include retweets. Click Location to choose a region to display tweets from. Click Tweet authors to show only tweets by a certain user. Click Engagements to filter by amount of replies, likes, or retweets."
    }
  ]
}