{
  "url": "https://www.wikihow.com/Stream-Switch-on-Twitch",
  "title": "How to Stream Nintendo Switch on Twitch: Beginner's Guide",
  "steps": [
    {
      "title": "Buy a capture card.",
      "content": "Buy a capture card. Since the Nintendo Switch doesn't have built-in streaming capabilities, you will need a capture card to stream a Nintendo Switch to Twitch. The Nintendo Switch resolution only goes up to 1080p, so you don't need a high-end 4K capture card. Any capture card that supports 1080p will do. The following are some capture cards you can purchase: [1] X Research source Elgato HD60 S+: This is one of the most recommended capture cards for streaming Nintendo Switch. It is small, portable, and capable of streaming 1080p video at 60 frames-per-second, which is more than enough to stream Nintendo Switch. Elgato Game Capture HD60 Pro: This is similar to the HD60 S+ capture card, except this is an internal card that needs to be inserted into a computer PCI slot . This is not recommended if you are using a laptop or a Mac. Elgato 4K60 S+: This is the high-end version of the Elgato capture card. This one can stream 4K video at 60 frames per second. While that may be overkill for a Nintendo Switch, this is a good option if you plan on streaming other devices besides the Nintendo Switch. AVerMedia Live Gamer Portable 2 Plus: This is another portable capture card. This one is capable of recording 4K video without a PC. However, it can only stream video at 1080p with a PC, which is perfectly suitable for streaming a Nintendo Switch. AVerMedia Live Gamer Duo: This is the PCI card version of the Portable 2 Plus. It is not recommended if you are using a laptop or a Mac. AVerMedia Live Gamer Mini: This is the budget version of the AVerMedia Live Gamer Portable 2 Plus device. This one can record and stream 1080p video, which is enough to stream a Nintendo Switch. EVGA XR1 Lite: This is an inexpensive and portable capture card capable of recording and streaming 1080p video at 60 frames per second. It also has a 4K video pass-through mode. Razer Ripsaw HD: This is another portable plug-and-play device that is capable of streaming 1080p video at 60 frames-per-second. It also has its own hardware-based audio, hardwired mic, and headphone jack for monitoring. However, it does not come with its software. Mirabox USB3.0 4K HDMI Video: This is another portable plug-and-play device that is capable of recording and streaming video at 1080p with a 4K option."
    },
    {
      "title": "Download and install OBS.",
      "content": "Download and install OBS. OBS is one of the most popular broadcast apps for streaming to Twitch, YouTube, Facebook Live, and more. It is open-source and free to download and use for PC, Mac, or Linux. Alternatively, you can use Streamlabs. [2] X Research source Use the following steps to download and install OBS: Go to https://obsproject.com/download in a web browser. Click the icon for your operating system. Click Download installer . Open the Installer file in your web browser or Downloads folder. Follow the instructions to complete the installation."
    },
    {
      "title": "Sign up for a Twitch account.",
      "content": "Sign up for a Twitch account. If you haven't already done so, go to https://www.twitch.tv/ and sign up for a Twitch account. [3] X Research source"
    },
    {
      "title": "Link OBS to your Twitch account.",
      "content": "Link OBS to your Twitch account. To start streaming, you must link OBS to your Twitch account. Use the following steps to do so: [4] X Research source Open OBS Click File in the menu bar at the top. Click Settings . Click Stream in the menu to the left. Select \" Twitch \" using the drop-down menu next to \"Service.\" Click Connect account (recommended) . Enter your Twitch username and password. Click Log In ."
    },
    {
      "title": "Connect your capture card to your computer.",
      "content": "Connect your capture card to your computer. This differs depending on what kind of capture card you have. If you have an external capture card, you will likely need to connect it to your computer using a USB 3.0 cable. If it is an internal capture card, you will need to open your computer tower and install the card in an available PCI slot ."
    },
    {
      "title": "Connect the Nintendo Switch to the capture card and a monitor.",
      "content": "Connect the Nintendo Switch to the capture card and a monitor. To do this, you must play your Nintendo Switch in docked mode. Connect an HDMI cable from the HDMI port inside the Nintendo Switch dock to the HDMI In port on the capture card. Then, use a separate HDMI cable to connect from the HDMI Out port on the capture card to an HDMI In port on your monitor or television."
    },
    {
      "title": "Add your capture card as a source in OBS.",
      "content": "Add your capture card as a source in OBS. Additionally, you can add any additional sources, such as a webcam or a mic. Use the following steps to add your capture card in OBS: Click the plus ( + ) icon at the bottom of the Sources panel in OBS. Click Video Capture Device in the drop-down menu Type a name for this source (i.e., \"Capture Card\") and click Ok . Use the drop-down menu next to \"Device\" to select your video capture card. Click Ok ."
    },
    {
      "title": "Adjust the windows and sources for your stream.",
      "content": "Adjust the windows and sources for your stream. Power on your Nintendo Switch and verify that you can see the capture from the Switch in the OBS preview window. Then, you can adjust the position of each source in the window by clicking and dragging them. You can also click and drag the edges of each source in the preview window to adjust the size."
    },
    {
      "title": "Enter your stream information.",
      "content": "Enter your stream information. Use the Stream Information window in OBS to enter your stream information. Enter the title of your stream at the top and a custom live notification. Then, you can select a category and any tags you want to use. Then click Done at the bottom. If you don't see the Stream Information window, click Docks in the menu bar at the top. Then click Stream Information ."
    },
    {
      "title": "Click Start Streaming.",
      "content": "Click Start Streaming . When everything is set up and you are ready to start streaming, click Start Streaming in the Controls panel. By default, it is in the lower-right corner. You can monitor your stream as well as the chat from within OBS. [5] X Research source"
    }
  ]
}