{
  "url": "https://www.wikihow.com/What-Is-the-Most-Expensive-Item-in-the-World",
  "title": "19 of the Most Expensive Things on Earth (& How Much They Cost)",
  "steps": [
    {
      "title": "History Supreme Yacht",
      "content": "History Supreme Yacht Allegedly purchased by mysterious Malaysian billionaire, Robert Kuok, the History Supreme Yacht is the most expensive yacht– and item– ever sold. Built from precious metals over the course of 3 years, every part of the vessel is plated in gold and platinum. Even more outrageous, the main bedroom has a wall made out of meteorite rock, embedded with an authentic T-rex bone. [1] X Research source Price: $4.8 billion"
    },
    {
      "title": "Antilia building",
      "content": "Antilia building Designed by famed Chicago architects Perkins and Will, this 27-story Mumbai mansion boasts 400,000 square feet and stands 570 feet tall. It’s owned by Indian business tycoon Mukesh Ambani and is believed to be the world’s priciest and most luxurious private home. The structure was built to withstand an earthquake of 8.0 magnitude and has 6 floors devoted to Ambani’s collection of high-end cars. [2] X Research source Price: $4.3 billion"
    },
    {
      "title": "Villa La Léopolda",
      "content": "Villa La Léopolda Originally a part of a much larger estate built during the reign of King Leopold II of Belgium, it was erected as a gift to his mistress, Blanche Zélia Joséphine Delacroix. It was later passed down to King Albert I and ultimately remodeled from 1929 to 1931. The villa stretches over 18 acres across the French Riviera, and has been featured in several iconic Hollywood films, like Alfred Hitchcock’s 1955 ‘‘To Catch a Thief.’’ [3] X Research source Price: $750 million"
    },
    {
      "title": "\"Salvator Mundi\" by Leonardo da Vinci",
      "content": "\"Salvator Mundi\" by Leonardo da Vinci The 2011 unveiling of this da Vinci original is considered among the most remarkable artistic spectacles of the 21st century. Italian for “Savior of the World,” the painting depicts Jesus doing the sign of the cross with his right hand while holding a translucent orb in the left. It was lost from 1763 until about 1900 when it was obtained by Sir Charles Robinson. [4] X Research source The painting disappeared again until 1958, when it was sold at auction for about $50, and resurfaced one final time in 2005, officially named an authentic da Vinci. Price: $450.3 million"
    },
    {
      "title": "The Dream Jet, BBJ 787",
      "content": "The Dream Jet, BBJ 787 Designed and built by Deer Jet, the Boeing 787 BBJ Dream Jet was later displayed at an airshow in Dubai in 2016. Based on the Boeing 787 Dreamliner, this luxury jet has 2,400 square foot cabin, primed for a comfortable and high-end travel experience. Since it costs $70,000 an hour to charter, it should have everything from a bedroom, to a dining room, to a spa— and it does! [5] X Research source Price: $300 million"
    },
    {
      "title": "\"The Card Players\" by Paul Cézanne",
      "content": "\"The Card Players\" by Paul Cézanne Part of a 5-painting series, renowned French post-impressionist painter, Paul Cézanne, was inspired by local farmhands. He studied them at length and created the five paintings, all of them featuring 2-5 characters playing cards at a table. The characters and scope of the painting narrows as the series progresses, ending with two men playing cards in a tight focus. [6] X Research source The final version in the series was sold to the Royal Family of Qatar in 2011. Price: $250 million"
    },
    {
      "title": "Jeff Bezos’ Beverly Hills House",
      "content": "Jeff Bezos’ Beverly Hills House Jeff Bezos is the third richest man on Earth, with an estimated net worth of over $190 billion, and the mansion to match. Originally bought from fellow billionaire, David Geffen, in 2020, Bezos has made many modifications since, adding tennis courts, pools, a gym, and a spa to the 30,000-square foot property. [7] X Research source The main house is 3 stories and heavily guarded by security, who— of course— have their own security building. Price: $175 million"
    },
    {
      "title": "1955 Mercedes-Benz 300 SLR Uhlenhaut Coupé",
      "content": "1955 Mercedes-Benz 300 SLR Uhlenhaut Coupé One of two in existence, this outrageous vehicle was built by the Mercedes-Benz racing department in 1955. This car was designed as part of a series of prototypes for the Mercedes-Benz 300 SLR W 196 S, an unparalleled racing model that tragically crashed and burned during the 1955 World Sportscar Championship. In 2022, the car was sold to an anonymous collector at the Mercedes-Benz Museum. [8] X Research source Price: $142 million"
    },
    {
      "title": "\"The Man with the Finger\" by Alberto Giacometti",
      "content": "\"The Man with the Finger\" by Alberto Giacometti “L’Homme au doigt”, also called, “Pointing Man” or \"The Man with the Finger,” is a bronze sculpture by Alberto Giacometti. Erected in 1947, the pointing man stands at five-foot-ten, the final installation in the sculptor’s series of life-sized figures. A highly valued part of collections at both the Museum of Modern Art and the Tate Modern, this sculpture was the first to sell for over $100 million when it was purchased at auction in 2015. [9] X Research source Price: $141 million"
    },
    {
      "title": "The Koh-i-Noor Diamond",
      "content": "The Koh-i-Noor Diamond This diamond, totaling 105.6 carats, is part of the Crown Jewels, kept safe at the Tower of London since the 17th century. The Crown Jewels include over 100 objects used for royal and political purposes, like coronations. The Koh-i-Noor Diamond was mined in southern India, and passed through the hands of conquerors, emperors, and shahs before being granted to the English monarchy. [10] X Research source The Koh-i-Noor Diamond currently sits as the centerpiece of the Crown of Queen Elizabeth, the Queen Mother. Price: $140-$400 million"
    },
    {
      "title": "“Portrait of Adele Bloch-Bauer I” by Gustav Klimt",
      "content": "“Portrait of Adele Bloch-Bauer I” by Gustav Klimt Gustav Klimt was a prolific Austrian painter. However, he never used the same subject twice— except in the case of Adele Bloch-Bauer. The portrait was commissioned by Adele’s husband, Ferdinand Bloch-Bauer, in 1907. Accented with beautiful gold leaf, the painting was stolen by the Nazis in 1941 and only returned to descendants of Bloch-Bauer family in 2006. [11] X Research source It was sold that same year, superseding Picasso's “Boy With a Pipe,” which sold for $104 million in 2005. Price: $135 million"
    },
    {
      "title": "The Graff Hallucination Watch",
      "content": "The Graff Hallucination Watch This wristwatch is truly a work of art, amounting to 110 carats of brilliant cut colored diamonds, ranging from Fancy Intense Pink to Fancy Vivid Yellow to Fancy Grey Blue. Different diamond cuts are also used to create the mosaic that leads to the “hallucination” effect, including heart-shaped, marquise, and radiant diamonds. [12] X Research source The watch was designed with the goal of merging extravagant luxury with exceptional technical craftsmanship. Price: $55 million"
    },
    {
      "title": "Carinsurance.com Domain Name",
      "content": "Carinsurance.com Domain Name Although not a tangible item, this domain name is the most expensive domain sold to be publicly reported. The website was designed to help users compare car insurance prices, which was a huge financial draw for QuinStreet, the digital marketing company that purchased it. QuinStreet had previously purchased other domain names, like insure.com and insurance.com. [13] X Research source Price: $49.7 Million"
    },
    {
      "title": "1962 Ferrari GTO",
      "content": "1962 Ferrari GTO The Ferrari 250 GTO is a type of luxury sports car made by Ferrari. Only 36 of these cars were produced between 1962 and 1964, making it a rare collector’s item. The \"250\" in the car’s name describes a specific measurement of each of its cylinders, while the \"GTO\" stands for “Gran Turismo Omologato,” which translates into \"Grand Touring Homologated.\" The car cost $18,000 when it was first unveiled, and has certainly increased in value since! [14] X Research source Price: $48.4 Million"
    },
    {
      "title": "Giant Clock",
      "content": "Giant Clock Although this project is not yet complete, a giant clock with room-sized chambers is in the works, commissioned by Jeff Bezos. Made with nearly indestructible materials, like marine-grade stainless steel and high-tech ceramics, the clock will be able to tell time for the next 10,000 years. [15] X Research source The giant clock will be nestled in the Sierra Mountains of Texas, requiring visitors to make a kind of pilgrimage there with the intention of self-reflection. Price: $42 Million"
    },
    {
      "title": "Chopard 201-Carat Gemstone Watch",
      "content": "Chopard 201-Carat Gemstone Watch Second only to the Graff Hallucination Watch, this timepiece is one of the most expensive watches ever made. Handmade in 2000, the watch features nearly 900 colorful diamonds, including a 15 carat pink diamond and a 12 carat blue diamond, totaling 201carats. [16] X Research source If there wasn’t enough glitz and glamour, the three heart-shaped diamonds open up to reveal the watch face, encrusted with even more diamonds. Price: $25 million"
    },
    {
      "title": "Perfect pink diamond",
      "content": "Perfect pink diamond This 14.23 carat diamond was one of only 18 pink diamonds of its kind in the world when it was sold at auctioned in 2010. The white gold band features a rectangular, emerald cult Fancy Intense Pink diamond, held in place by rose gold prongs. Sold at Christie’s in Hong Kong, the hefty price tag reflected how in demand colorful diamonds are in Asia. [17] X Research source Price: $23.2 million"
    },
    {
      "title": "Mariah Carey’s engagement ring",
      "content": "Mariah Carey’s engagement ring James Packer gave Mariah Carey this ring when they got engaged in 2016. Although the couple didn’t end up tying the knot, the ring sure made a splash! The ring features a 35 carat emerald cut diamond in the center of a platinum setting, surrounded by two baguette diamonds. [18] X Research source After the relationship between Carey and Packer ended in 2017, she sold her lavish ring to an anonymous jeweler in Los Angeles for $2.1 million. Price: $10 million"
    },
    {
      "title": "“The Physical Impossibility of Death in the Mind of Someone Living, aka The Shark” by Damien Hirst",
      "content": "“The Physical Impossibility of Death in the Mind of Someone Living, aka The Shark” by Damien Hirst This art installation was created by conceptual artist Damien Hirst in 1991. Also known as “Dead Shark,” the artwork consists of a dead tiger shark, preserved and floating in a tank of formaldehyde. It was first put on display in 1992 in London and later loaned to the Metropolitan Museum of Art from 2007 to 2010. [19] X Research source The original shark began decomposing and they had to replace it with a new tiger shark in 2006, fueling discussions about the ethics and intention of the work. Price: $8 million"
    },
    {
      "title": "The British Guiana One-Cent Black on Magenta postage stamp",
      "content": "The British Guiana One-Cent Black on Magenta postage stamp Weighing in a whopping 40 milligrams (0.04 ml), this stamp is literally one of a kind. Only a single version is known to exist, making it about as rare as it gets, and it's the only major postage stamp ever issued in the UK or British Commonwealth that's not represented in Britain's Royal Philatelic Collection. Price: $8.5 million"
    },
    {
      "title": "Marilyn Monroe’s William Travilla dress",
      "content": "Marilyn Monroe’s William Travilla dress This dress had a leading role in one of the most iconic scenes in cinema— if not the most iconic. The movie was The Seven Year Itch and the scene? Marilyn Monroe standing over the subway gate in this classic white dress, designed by William Travilla. Technically ivory, not white, the dress has a halter-style bodice and a low neckline. [20] X Research source The dress that Monroe wore to sing President John F. Kennedy “Happy Birthday” in 1962 is also of great value, sold for $4.8 million. Price: $5.6 million"
    },
    {
      "title": "Almas caviar",
      "content": "Almas caviar Almas caviar is largely considered the most expensive food in the world, selling for about $40,000 a kilogram. There’s criteria that must be met for caviar to be stamped with Almas seal of approval. The roe must come from an albino beluga sturgeon female from the South Caspian Sea. Additionally, the beluga sturgeon must be between 60 and 100 years old. [21] X Research source The flavor profile of Almas caviar can be described as creamy and nutty, with zero fishy flavor. Price: $40,000/ kg"
    },
    {
      "title": "Antimatter",
      "content": "Antimatter The substance we know as antimatter was discovered by British physicist Paul Dirac in 1928. In essence, Dirac theorized that for every particle of matter, or material, there is a particle of antimatter, or anti-material. For example, for every electron, there is an anti-electron with an opposing charge. This theory extended to the cosmos, creating the possibility of entire galaxies made of antimatter. [22] X Research source Among the many proposed uses for antimatter, fuel for interstellar travel is a popular one. Price: $62.5 trillion/ gram"
    },
    {
      "title": "Francium",
      "content": "Francium Discovered by Marguerite Perey in 1939, Francium is the second rarest naturally occurring element after astatine, and it’s incredibly radioactive. The half-life of the chemical is only 22 minutes, making it very unstable and nearly impossible to use in any way. The largest amount of Francium ever created by a lab totaled about 300,000 atoms— which all turned to vapor in an instant. The fleeting quality of this element is part of what makes it so fascinating...and expensive! [23] X Research source Price: $1 billion/gram"
    },
    {
      "title": "The International Space Station",
      "content": "The International Space Station This space station is the largest and most expensive ever built, forged under the alliance of several International space programs, including NASA in the United States, Roscosmos in Russia, JAXA in Japan. Using up about 1/3 of NASA’s entire budget, the International Space Station’s yearly maintenance fee is about $4 billion. [24] X Research source Astronauts from all over the world have worked and lived on the space station since 1998, and it’s scheduled to remain open for business until the end of 2030. Price: $150 billion"
    }
  ]
}