{
  "url": "https://www.wikihow.com/Tell-if-a-Smoke-Detector-Detects-Carbon-Monoxide",
  "title": "3 Ways to Tell the Difference Between a Smoke and Carbon Monoxide Detector",
  "steps": [
    {
      "title": "Check for CO approval labels or markings.",
      "content": "Check for CO approval labels or markings. Remove the alarm from its mount and check the back for text that reads, “Single Station Carbon Monoxide Alarm,” plus an emblem that reads either “UL,” “IAS,” or “CSA.” The first will tell you if the detector detects carbon monoxide, and the second is a mark that indicates a testing company has confirmed that the detector operates to government safety standards. [1] X Trustworthy Source Consumer Products Safety Commission Independent U.S. government agency responsible for protecting consumers by developing safety standards and conducting product research Go to source Remove a ceiling alarm by twisting it counter-clockwise. Remove a wall-mounted alarm by unplugging it from its socket. If the alarm has only one or neither marking, it is either not a carbon monoxide alarm or is not up to safety standards. Purchase a new, UL, IAS, or CSA-listed carbon monoxide detector."
    },
    {
      "title": "Check the detector’s brand and model number.",
      "content": "Check the detector’s brand and model number. If you’re still unsure, you can check for a model number on the front or back of the detector (usually a few letters followed by a series of numbers). Conduct an internet search of the model number and the name of the manufacturer. The detector’s product page or digital manual will indicate if it detects carbon monoxide. [2] X Trustworthy Source Consumer Products Safety Commission Independent U.S. government agency responsible for protecting consumers by developing safety standards and conducting product research Go to source Some detectors detect both smoke and carbon monoxide, and this will be clearly indicated on the manufacturer’s product page. Sometimes, detectors like these will feature two separate lights, one for a smoke alarm, and one for a carbon monoxide alarm."
    },
    {
      "title": "Test for different beeping patterns.",
      "content": "Test for different beeping patterns. Smoke alarms typically sound with 3 beeps in a row, while carbon monoxide detectors usually sound with 4 beeps. Press and hold the button on the front of the detector to test the alarm , and make note of how many beeps it produces. [3] X Research source Press the button again, or press and hold it again, to turn off the alarm ."
    },
    {
      "title": "Replace alarms every 5-10 years.",
      "content": "Replace alarms every 5-10 years. Carbon monoxide alarms need replacing every 5-7 years depending on the model (consult your alarm’s manual for replacement frequency, or replace it every 5 years, to be safe). Replace smoke alarms every 10 years. [4] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source If you’re moving into a new home and don’t know how old the alarms are, replace them anyway."
    },
    {
      "title": "Replace alarm batteries once a year.",
      "content": "Replace alarm batteries once a year. Both carbon monoxide and smoke detectors should have their batteries replaced once a year to keep them operational. Even wire-mounted alarms have backup batteries in case of a power outage, and these also need to be replaced once a year. [5] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Some newer models of detectors have 10-year batteries out of the box that don’t need yearly replacement. If you’re not sure if this applies to your device, replace the batteries anyway, just to be safe."
    },
    {
      "title": "Test your alarms once a month.",
      "content": "Test your alarms once a month. Both carbon monoxide and smoke detectors need to be tested monthly To do this, press and hold the button on the front of the alarm until it begins to sound. Then press or press and hold the button again to turn the alarm off. [6] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source If the alarm doesn’t sound, it’s faulty and needs to be replaced."
    }
  ]
}