{
  "url": "https://www.wikihow.com/Take-Cornell-Notes",
  "title": "How to Take Cornell Notes",
  "steps": [
    {
      "title": "Draw a vertical line down the left section of your paper.",
      "content": "Draw a vertical line down the left section of your paper. This line should be approximately two and a half inches from the left edge of the page. This will be used as the section for reviewing your notes. [1] X Research source"
    },
    {
      "title": "Leave the largest section of the page as the area for taking notes from the lecture or reading.",
      "content": "Leave the largest section of the page as the area for taking notes from the lecture or reading. This section on the right of the page should leave you plenty of space to record important points. [2] X Research source"
    },
    {
      "title": "Use the internet to search for templates for Cornell notes if you need a shortcut.",
      "content": "Use the internet to search for templates for Cornell notes if you need a shortcut. If you will be taking a lot of notes and/or want to save time, you can find blank templates for making Cornell style notes. Print blank sheets and follow the same steps for use."
    },
    {
      "title": "Write the course name, the date, and the lecture or reading topic at the top of your page.",
      "content": "Write the course name, the date, and the lecture or reading topic at the top of your page. Do this consistently, and it will help you keep your notes organized and make reviewing course material much easier. [3] X Research source"
    },
    {
      "title": "Take notes in the largest section of the page.",
      "content": "Take notes in the largest section of the page. While listening to a lecture, or reading a text, take notes only in the right-hand section of the page. [4] X Research source Include any information that the professor writes on a board or shows in a slideshow."
    },
    {
      "title": "Use notes to listen or read actively.",
      "content": "Use notes to listen or read actively. Whenever you come across an important point, make a note of it. [5] X Research source Look for signals marking important information. If an instructor says something like \"the three most important implications of X are…\" or \"there are two basic reasons why X happened,\" then this is likely information that you will want to record in your notes. If you are taking notes from a lecture, listen out for points that are emphasized or repeated, as these are likely important. These tips hold true if you are reading a text and come across statements like these examples. Textbooks will often put key terms in bold type, for example, or restate important information in graphs or charts."
    },
    {
      "title": "Keep it simple.",
      "content": "Keep it simple. Think of your notes as an outline of the lecture or reading. Focus on getting just the key words and points down so that you can keep up with the lecture or reading—you will have time later to review and fill in the gaps. [6] X Research source Rather than writing out complete sentences, use bullet points, shortcuts (like “&” instead of “and”), abbreviations, and any personal note-taking symbols you have. [7] X Research source For example, instead of writing out a full sentence, such as “In 1703, Peter the Great founded St. Petersburg and ordered its first building, the Peter and Paul Fortress,” you could write simply “1703—Peter founds St. Pete & builds Peter & Paul Fort.” The shorter version will make it easier to keep up while still recording the essential information."
    },
    {
      "title": "Record general ideas, not illustrative examples.",
      "content": "Record general ideas, not illustrative examples. Go for the big ideas in the lecture, rather than trying to record all the examples the instructor may give to illustrate these ideas. Paraphrasing not only saves time and space, it forces you to make connections between the ideas presented and your own expression of them, which will help you remember material later. [8] X Research source For example, if your instructor says in lecture (or a book states) that: \"In constructing St. Petersburg, Peter hired engineers, architects, shipbuilders, and other workers from many European countries. The immigration of these intellectuals and skilled workers gave St. Petersburg a cosmopolitan atmosphere, accomplishing part of Peter's goal to make the Russian city a 'window on the West',\" don't try to copy that word-for-word! Paraphrase the information, for example: \"Peter hired engineers, architects, shipbuilders, etc. from all over Europe -- his plan: St. Pete = 'window on the West.'\""
    },
    {
      "title": "Leave a space, draw a line, or start a new page when you come to a new topic.",
      "content": "Leave a space, draw a line, or start a new page when you come to a new topic. This will help you to mentally organize the material. It will also help you to focus on studying different parts whenever you need to. [9] X Research source"
    },
    {
      "title": "Make a note of any questions that arise while you are listening or reading.",
      "content": "Make a note of any questions that arise while you are listening or reading. If there is something you do not understand, or want to know more about, jot this down in your notes. These questions help clarify what you are absorbing, and will be useful for studying later. [10] X Research source For example, if you were taking notes on the history of St. Petersburg, as in the examples above, you might make a note \"Why couldn't Peter the Great hire Russian engineers?\""
    },
    {
      "title": "Edit your notes as soon as possible.",
      "content": "Edit your notes as soon as possible. If there are any parts of your notes that are hard to read or don't seem to make sense, fix them while the material is still fresh in your mind."
    },
    {
      "title": "Summarize key points.",
      "content": "Summarize key points. As soon as possible after the lecture or reading, pull out the main ideas or key facts from the right-hand section. Write very condensed versions in the left-hand column -- go for key words or short phrases that communicate the most important information or concepts. Reviewing course material within a day or so of the lecture or reading greatly improves retention. [11] X Research source Underlining main ideas in the right-hand column may help you identify them. You can also try highlighting or color-coding if you're a very visual learner. Cross out unimportant information. Part of the beauty of this system is that it will teach you how to identify the crucial information and discard what is unnecessary. Practice identifying information that you are less likely to need."
    },
    {
      "title": "Write potential questions in the left column.",
      "content": "Write potential questions in the left column. Working from your notes on the right, think about questions that might appear on an exam, and write these on the left. Later on, these can be used as a study tool. [12] X Research source For example, if in the right hand section, you have written the note \"1703--Peter founds St. Pete & builds Peter & Paul Fort,\" then in the left hand section, you could write the question \"Why was Peter & Paul fortress 1st building in St. Pete?\" You can write higher level questions that are not answered in the notes, like \"Why did...?\" or \"Predict what would happen if...?\" or \"What were the implications of...?\" (e.g., \"What impact did the change in capital from Moscow to St. Petersburg have on the Russian Empire?). These can deepen your learning of the material."
    },
    {
      "title": "Summarize the main ideas in the bottom section of the page.",
      "content": "Summarize the main ideas in the bottom section of the page. This helps to clarify all of the information you have recorded. Putting the gist of the material in your own words is a good way to check your comprehension. If you can summarize the page of notes, it means you are well on your way to understanding the material. You might ask yourself, \"How would I explain this information to someone else?\" [13] X Research source Often, an instructor will begin a class session by giving an overview of that day's material, e.g.: \"Today, we will discuss A, B, and C\" Similarly, textbook sections often include introductions that summarize the main points. You can use such overviews as a guide for taking notes, and think of them as a version of the summary that you will write at the bottom of your page of notes. Include any additional details that seem important to you or that you think you need to pay special attention to when studying. Just a few sentences are usually fine for the summary of a page. Include any important formulas, equations, diagrams, etc. in the summary section, if appropriate. If you have trouble summarizing any part of the material, use your notes to identify where you should take a further look or ask your instructor for more information."
    },
    {
      "title": "Read your notes.",
      "content": "Read your notes. Concentrate on the left-hand column and summary at the bottom. These contain the most important points you will need for your assignment or exam. [14] X Research source You can underline or highlight the most important parts as you review, if you prefer."
    },
    {
      "title": "Use your notes to test your knowledge.",
      "content": "Use your notes to test your knowledge. Cover the right side of the page (the note-taking column) with your hand or another sheet of paper. Quiz yourself by giving answers to the potential questions that you included in the left column. Then uncover the right side and check your comprehension. [15] X Research source You can also ask a friend to quiz you on your notes using the left column, and you can do the same for them."
    },
    {
      "title": "Review your notes as often as possible.",
      "content": "Review your notes as often as possible. Reviewing frequently over a longer period of time, rather than cramming before a test, will greatly increase your retention and deepen your understanding of course material. With your effective notes made using the Cornell system, you will be able to study efficiently and with minimal stress. [16] X Research source"
    }
  ]
}