{
  "url": "https://www.wikihow.com/Unfriend-Someone-Without-Them-Knowing",
  "title": "How to Block or Remove a Friend Without Them Knowing (on Instagram and Snapchat)",
  "steps": [
    {
      "title": "Open the Facebook mobile app.",
      "content": "Open the Facebook mobile app. It's a dark-blue app with a white \"f\" on it. This will open your Facebook News Feed if you're already logged into Facebook on your phone or tablet. If you aren't logged into Facebook, enter your email address (or phone number) and password to continue. You can also use the website from your computer if you'd prefer, and many of the steps are similar."
    },
    {
      "title": "Go to your friend's profile page.",
      "content": "Go to your friend's profile page. Type the friend's name into the search bar at the top of the screen, then tap their name when it appears in the drop-down menu to go to their profile page. You can also go to their profile page from your News Feed or from your section of friends on your profile page."
    },
    {
      "title": "Tap the Friends icon.",
      "content": "Tap the Friends icon. It's the person-shaped icon with a checkmark that's below and to the left of their profile picture. Doing so brings up a pop-up menu. If you're using the website, clicking this will drop down a menu."
    },
    {
      "title": "Tap Unfriend.",
      "content": "Tap Unfriend . It's at the top of the pop-up menu if you're using the mobile app; it's at the bottom of the drop-down menu on the website."
    },
    {
      "title": "Tap OK when prompted.",
      "content": "Tap OK when prompted. Doing so will remove the person from your friend's list and you will not see their posts anymore."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. This app icon looks like a camera lens on a purple, pink, orange, and yellow background. You can find it on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Search for the person you want to unfollow.",
      "content": "Search for the person you want to unfollow. Tap the magnifying glass at the bottom of your screen to open a search tab. Alternatively, you can browse through your feed until you find them, then tap on their profile picture to go to their profile."
    },
    {
      "title": "Tap ⋮ (Android) or … (iPhone).",
      "content": "Tap ⋮ (Android) or … (iPhone). This vertical or horizontal three-dot menu icon is in the top right corner of your screen. [1] X Research source"
    },
    {
      "title": "Tap Block}.",
      "content": "Tap Block }. When you block someone, they are removed from your following list, and you are removed from their followers. You may get a pop-up dialog window that you'll need to tap Block and Dismiss to confirm your action. Don't be nervous that the other person will get notified that you've blocked them. Instagram doesn't send those notifications! The only way the person you blocked might notice is if they pay for services that track their account activity, but most people don't do that. [2] X Research source"
    },
    {
      "title": "Open Snapchat.",
      "content": "Open Snapchat. This app icon looks like a white ghost icon on a yellow background. You can find it on one of your Home screens, in the app drawer, or by searching. When you remove someone from your Friends list, they will no longer be able to see your Private Charms or Stories. However, they can see everything that you've set to public privacy."
    },
    {
      "title": "Tap your profile picture.",
      "content": "Tap your profile picture. It's in the top left corner of your screen."
    },
    {
      "title": "Tap My Friends.",
      "content": "Tap My Friends . It's under the header, \"Friends,\" under the \"Stories\" header."
    },
    {
      "title": "Tap and hold the person's name that you want to remove.",
      "content": "Tap and hold the person's name that you want to remove. A menu will slide up from the bottom of your screen."
    },
    {
      "title": "Tap More.",
      "content": "Tap More . It's usually the last option on the menu."
    },
    {
      "title": "Tap Remove Friend and Remove.",
      "content": "Tap Remove Friend and Remove . This option is near the top of the menu in red text. Once you confirm your action, that person is no longer part of your Friends list. Alternatively, you can access their profile from a chat, then tap the three-dot menu on their profile and tap Remove Friend . [3] X Research source Don't be nervous that the other person will get notified that you've blocked them. Snapchat doesn't send those notifications!"
    },
    {
      "title": "Open TikTok.",
      "content": "Open TikTok. The app icon looks like a white music note on a black background. You can find it on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Tap Profile.",
      "content": "Tap Profile . It's in the lower-left corner of your screen with a default account icon. [4] X Research source"
    },
    {
      "title": "Tap Followers.",
      "content": "Tap Followers . This will show you everyone who is following you. If you are following a person, and they are following you back, then they are labeled as a \"Friend.\""
    },
    {
      "title": "Tap ⋮ next to the person you want to remove.",
      "content": "Tap ⋮ next to the person you want to remove. It's the three vertical dots next to their name. The person will not get a notification that you've removed them from your followers."
    },
    {
      "title": "Tap Remove this follower and select Remove in the pop-up.",
      "content": "Tap Remove this follower and select Remove in the pop-up. When you tap to remove a follower, you'll get a pop-up dialog menu in which you need to confirm your action to continue. If that is not enough, you can block them from their profile. If you have a public or private account, they will no longer be able to follow you, comment on your videos, or contact you. If you have a public account, they can follow you again; however, if you have a private account, they will need to send you a request to follow you again. [5] X Research source To block someone, tap the three-dot menu icon on their profile page then select Block . If you're nervous about removing a follower or blocking them, don't worry! TikTok doesn't send out notifications for these actions, and they will only be able to figure it out if they try to send you a message."
    }
  ]
}