{
  "url": "https://www.wikihow.com/Stop-Mid-Afternoon-Food-Cravings",
  "title": "How to Stop Mid Afternoon Food Cravings",
  "steps": [
    {
      "title": "Start every day with breakfast.",
      "content": "Start every day with breakfast. The best way to get your eating habits in line for the day is to start with a hearty breakfast after you've had a chance to go to the bathroom and walk around for a few minutes — it promotes better digestion. Eating a healthy breakfast quells your hunger, gives you energy and stabilizes your hormones (insulin and others), which will help to combat cravings later in the day. Choose slow-digesting fibrous foods that will keep you feeling fuller for longer, such as whole-grain bread, oatmeal, bran flakes, apples and berries. Add some healthy fats and protein from nuts, such as almonds, walnuts and cashews — they'll also satiate your appetite for longer. People need some saturated fat (with cholesterol) for health, plus it makes you feel full and stops cravings, so add some eggs, butter and yogurt to your breakfasts a few times a week. A combination of these food groups packs health benefits and provide a complex carbohydrates, protein, fibre and small amounts of fat which makes you feel full for hours."
    },
    {
      "title": "Cut back on sugary beverages.",
      "content": "Cut back on sugary beverages. After you've eaten a nutritious breakfast and gotten off to a good start physiologically, don't cause spikes in your blood glucose levels and insulin levels by drinking sodas, energy drinks or coffee loaded with sugar and cream. [1] X Research source These beverages may give you a quick \"sugar rush\" and boost of energy, but they'll trigger a hormonal roller coaster ride that will last the rest of the day and increase the likelihood of cravings. Sugar rush has a negative impact on emotions as well. Blood sugar levels can rise quickly due to consumption of foods rich in refined sugars, leading to problems with concentration. If you must drink coffee in the mornings and afternoons, drink it with a splash of unsweetened alternative milk, like oat or almond milk, and switch to decaf. Caffeine can make your mind race and lose focus on your dietary routine. Drink purified water or herbal tea after breakfast and throughout the day, as they won't impact your blood glucose or hormone levels."
    },
    {
      "title": "Eat lunch closer to 1pm each day.",
      "content": "Eat lunch closer to 1pm each day. If you've eaten a hearty breakfast that contains fiber, fats and protein, you'll likely be able to push lunch off until between 12:30 – 1:00pm, which is likely about five hours post-breakfast. Foods that take longer to digest and have a low glycemic index (don't cause insulin spikes) provide you with energy and delay hunger pains for longer. [2] X Research source If you've done a good job with preparing your breakfast, you should be able to last 5 hours until lunch. The idea is to choose the right foods so that you'll last about five hours between main meals — for example, 7:30am for breakfast, 12:30pm or so for lunch, and around 6pm for dinner. Keep this routine for lunch so your body gets trained to digest fibrous whole foods and then go without calories for about five hours. Eating lunch closer to 1:00pm (assuming you make healthy choices) should eliminate any hunger pains and cravings by mid-afternoon around 3:00pm or so."
    },
    {
      "title": "Choose whole grains instead of refined carbohydrates.",
      "content": "Choose whole grains instead of refined carbohydrates. Once you break for lunch at around 12:30 – 1:00pm, the choices you make are critical to your blood sugar levels, insulin spikes, feeling of fullness, amount of energy and likelihood of having cravings a few hours later. As such, choose more complex carbohydrates such as whole grain breads and pastas instead of white bread and pasta made from refined flour, brown rice instead of white rice, and beans instead of French fries or baked potatoes. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Kidney beans, black beans and lentils are not only complex carbohydrates with low glycemic indexes, but they are good sources of fiber, amino acids and minerals. Natural food fibre in unrefined carbohydrates is responsible for maintaining healthy blood sugar levels and controlling appetite. Other types of refined carbs to avoid for lunch include most muffins, bagels, cookies, hamburger/hotdog buns, tortillas and noodles."
    },
    {
      "title": "Include healthy fats in your lunch.",
      "content": "Include healthy fats in your lunch. Healthy fats are another important part of a nutritious lunch because they take even longer to digest and impact blood sugar levels than complex carbohydrates. [4] X Research source Healthy plant-based fats are found in avocados, olives, seeds (flax and sesame) and nuts (almonds, peanuts and walnuts). Throw some of these ingredients into a salad with a healthy protein source (see below) and you'll likely feel no cravings or hunger pains until closer to dinner time. Some saturated fat is also needed in the human diet and it can be found in meats, poultry, eggs and dairy products, such as milk, cheese and yogurt. The fats to really avoid for health reasons include hydrogenated trans fats, which tend to clog arteries and spike blood cholesterol levels. Remember that these items are also high in calories, so don't go overboard. A medium avocado, for instance, has about 250 calories."
    },
    {
      "title": "Make sure to get some protein for lunch also.",
      "content": "Make sure to get some protein for lunch also. Much like fat, protein also takes longer to digest, release its energy and impact blood sugar levels. As such, eating protein makes you feel fuller for longer and reduces the mid-afternoon cravings that plague many people. Remember also that proteins (as well as fat) are a dense source of calories, so a little can go a long way. In fact, all sources of animal protein invariably contain saturated fat, which is good at curbing appetite and eliminating cravings. Although some saturated fat is essential, you don't want to overdo it with the cholesterol, so choose lean meats for lunch, such as chicken breast, salmon filet without the skin and roast beef with the fat trimmed off. Good vegetable sources of protein include soy products (tofu, edamame); flaxseed products; quinoa; and virtually all nuts and seeds."
    },
    {
      "title": "Drink water if you feel hungry mid-afternoon.",
      "content": "Drink water if you feel hungry mid-afternoon. Even if you've started the day with breakfast and eaten a hearty lunch closer to 1:00pm, if you stomach is starting to rumble and you feel a junk food craving starting to grow, drink an 8-ounce (237 ml) glass of chilled water. Your stomach will be fooled by the volume of liquid and tell your brain you've eaten — this trick may buy you up to an hour before the hunger pangs and cravings return. Gulping the water down will get more air into your stomach and make it feel fuller, but it may also make you feel bloated and uncomfortable, so sip the water instead. Chewing on ice cubes and swallowing the water can also be effective for fooling your stomach/brain and getting you through the afternoon without snacking."
    },
    {
      "title": "Chew some sugarless gum.",
      "content": "Chew some sugarless gum. On the topic of fooling your body about food and fullness, chewing gum can also work pretty well for short periods of time too. Chewing gum causes lots of saliva to be released into your mouth, which makes its way to the stomach and fools it into \"thinking\" that food is coming down also. Gum will probably buy you less time than drinking water because they'll be less fluid in your stomach. Be cautious with this strategy because for some people chewing gum can actually increase hunger pains and cravings. Don't chose peppermint or spearmint flavored chewing gum because it can stimulate digestion and make you feel a little hungrier."
    },
    {
      "title": "Combat your stress",
      "content": "Combat your stress while at work. Food cravings also tend to have a strong psychological component. In other words, you're not necessarily eating because you feel hungry or need more food, but rather because you are \"rewarding\" yourself for going through a stressful situation. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Plus, your body is programmed to get quick energy from sugar when stressed as it prepares for \"flight or fight.\" Find ways to alleviate stress at work, whether it's personality conflicts, long hours, physical discomfort or a lack of money. Change your mindset so that you reward yourself with healthy snacks and more nutritious meals, instead of sugary treats. Try stress-relieving practices such as meditation, deep breathing exercises, yoga, and positive imagery exercises."
    },
    {
      "title": "Stop thinking or obsessing about food.",
      "content": "Stop thinking or obsessing about food. Another helpful tip for dealing with the psychological component of cravings and binge eating is to spend less time thinking (or obsessing) about food. Focus more on work tasks while at your job and train your mind not to wonder and daydream of food. Take down any photos of food around your desk and don't surf the internet for recipes, etc. Some people obsess about food because it provides them their only pleasure in life, so working on your social life and family relationships may help too. Obsession with processed junk foods is much like a drug addiction and involves the same brain neurotransmitters, such as dopamine. Food addiction is not often about a lack of willpower, but rather a chemical dependency that's developed over months / years. You may need professional counseling to break your food addiction."
    },
    {
      "title": "Distract yourself with some light exercise.",
      "content": "Distract yourself with some light exercise. In addition to dealing with any sort of chemical dependency, try distracting yourself from your hunger and/or cravings with light exercise and a change of scenery. Take a walk around the office, to the bathroom or get some fresh air outside for 15 minutes or so. The light exercise will also help to combat stress and get your mind off \"rewarding\" yourself with a snack. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source In the privacy of a bathroom at work or in the stairwell, do some light calisthenics, such as jumping jacks, for a few minutes. Don't exercise too hard or else you'll probably make yourself more hungry for mid-afternoon snacks."
    },
    {
      "title": "Pin up positive messages at work.",
      "content": "Pin up positive messages at work. Along with reducing stress, combating your food obsessions and distracting your mind from cravings, post positive messages and images around your work area or at home. If your goal is weight loss, write your ideal weight down on a post-it to remind yourself to keep focused on eating healthy. Pin up a photo of someone who is fit that you admire — that can be good motivation to override the urges to snack mid-afternoon and wait until dinnertime. If you count calories, write down your caloric intake for the day or week and keep the number within view at your work station or at home in your kitchen. Another motivating factor is money and snacks can be expensive, so write down how much money you're saving by not caving into mid-afternoon food cravings. Watch the number grow week by week and plan a holiday with the savings."
    }
  ]
}