{
  "url": "https://www.wikihow.com/Write-Movie-Scripts",
  "title": "How to Write Movie Scripts",
  "steps": [
    {
      "title": "Understand what a script is.",
      "content": "Understand what a script is. The script, or screenplay, outlines all of the elements (audio, visual, behavior, and dialogue) that are required to tell a story through movies or TV. [1] X Research source A script is almost never the work of a single person. Instead, it will go through revisions and rewrites, and ultimately will be interpreted by the producers, directors, and actors."
    },
    {
      "title": "Read the scripts of some of your favorite movies.",
      "content": "Read the scripts of some of your favorite movies. Find movie scripts online and decide what you like (and don’t like) about them. Get a feel for how the action is portrayed, dialogue is written, and characters are developed."
    },
    {
      "title": "Flesh out your concept.",
      "content": "Flesh out your concept. Assuming you already have an idea you want to write about, sketch out all the necessary plot details, relationships, and personality traits that will guide your story. Which elements are the most integral to your concept? How do your characters interact and why? What’s your larger point? Are there any plot holes? Write notes addressing these points in any format you see fit. [2] X Research source"
    },
    {
      "title": "Outline your story.",
      "content": "Outline your story. Begin with a basic flow of your narrative. Focus on the conflict of the story; conflict drives drama. [3] X Research source Keep length in mind. When in script format, each page is roughly one minute of screen time. The average length of a two-hour script is 120 pages. Dramas should be around the 2-hour mark, comedies should be shorter, around one and a half hours."
    },
    {
      "title": "Write your story in three acts.",
      "content": "Write your story in three acts. The pillars of a screenplay are the Three Acts. Each act can operate independently, and when taken together provide the full arc of a story. [4] X Research source Act One: This is the set-up for the story. Introduce the world and the characters. Set the tone of the story (comedy, action, romance, etc.). Introduce your protagonist, and begin exploring the conflict that will drive the story. Once the protagonist is set towards the objective, then Act Two begins. For dramas, Act One is typically 30 pages. For comedies, 24 pages. Act Two: This act is the main portion of the story. The protagonist will encounter obstacles on the path to the resolution of the conflict. Subplots are typically introduced in the second act. Throughout the second act, the protagonist should be showing signs of change. For dramas, Act Two is typically 60 pages. For comedies, 48 pages. Act Three: In the third act, the story reaches its resolution. The third act contains the twist of the story and ends with the final confrontation of the objective. Because the story has already been established in the second act, the third act is much faster-paced and condensed. For dramas, Act Three is typically 30 pages. For comedies, 24 pages."
    },
    {
      "title": "Add sequences.",
      "content": "Add sequences. Sequences are parts of the story that operate somewhat independently from the main conflict. They have a beginning, middle, and end. A typical sequence will be about 10 to 15 pages in length. A sequence tends to focus on a specific character. [5] X Research source"
    },
    {
      "title": "Start writing scenes.",
      "content": "Start writing scenes. Scenes are the events of your movie. They take place in specific locations and always serve to drive the story forward. If a scene does not do this, then it should be cut from the script. Scenes that serve no purpose will stick out in the audience’s mind as flaws, and will drag the story down. [6] X Research source"
    },
    {
      "title": "Begin writing dialogue.",
      "content": "Begin writing dialogue. Once you have scenes, you will have characters interacting. Dialogue can be one of the hardest things to write. Each character needs to have its own distinct, believable voice. Realistic dialogue is not necessarily good dialogue. Dialogue should be focused on moving the story forward and developing characters. You should not worry about trying to capture reality with dialogue, because in reality, conversations are often dull and lifeless. Read your dialogue aloud. Does it sound halting, stereotyped, or over-the-top? Do all of your characters talk the same way?"
    },
    {
      "title": "Cut away the dead weight.",
      "content": "Cut away the dead weight. Now that all your ideas are on paper, look for weak links, distractions, or anything that drags. Does the story ever get sidetracked? Are there unnecessary details or repetitions? Do you give your audience enough credit? If it over-explains or doesn’t move your story forward, cut it."
    },
    {
      "title": "Show your finished work to a few friends.",
      "content": "Show your finished work to a few friends. Choose people with different tastes and backgrounds to get a variety of opinions. Be sure to ask for the cold, hard truth; you want constructive criticism, not flattery or lies."
    },
    {
      "title": "Revise your work as many times as necessary.",
      "content": "Revise your work as many times as necessary. This may be painful at first, but when all is said and done, you’ll be glad you took the time to properly convey your vision."
    },
    {
      "title": "Set your page size.",
      "content": "Set your page size. Screenplays are written on 8 ½” x 11” paper, typically 3-hole punched. Top and bottom margins are set between .5” and 1”. The left margin is set to 1.2”-1.6” and the right margin is set between .5” and 1”. [7] X Research source"
    },
    {
      "title": "Set your font.",
      "content": "Set your font. Screenplays are written in Courier 12 point font. This is mainly because of timing. One script page in Courier 12 is roughly one minute of screen time."
    },
    {
      "title": "Format your script elements.",
      "content": "Format your script elements. There are several different parts of the script that require specific formatting so that they conform to industry standards: [8] X Research source Scene Heading : This is also called a “slug line.” It sets the stage for the reader by describing the location. The scene heading is written in all caps. First, denote whether it is an interior or exterior scene by writing “INT.” or “EXT.” Then, follow that with the location, then the time of day. Never end a page with a scene heading, push it down to the next page. Action : This is the descriptive text of the screenplay. Write in the present tense and an active voice. Keep the paragraphs short to hold the reader’s attention. A good paragraph size is 3-5 lines. Character Name : Before dialogue starts, the character speaking is typed out in all caps and indented 3.5” from the left margin. The name can either be the character’s actual name, a description if the character is not named in the movie, or by occupation. If the character is speaking off screen, then “(O.S.)” is written next to the character name. If the character is narrating, “(V.O.)” for voice-over is written next to the name. Dialogue : When a character is speaking, the dialogue is indented 2.5” from the left margin, and between 2-2.5” from the right. The dialogue goes directly beneath the character’s name."
    }
  ]
}