{
  "url": "https://www.wikihow.com/Social-Norms-Examples",
  "title": "What are Social Norms? Examples in Everyday Life",
  "steps": [
    {
      "title": "Social norms are unwritten rules that shape how people interact in society.",
      "content": "Social norms are unwritten rules that shape how people interact in society. They are essentially the standards and expectations that members of a social group share about what is considered acceptable or appropriate behavior. [1] X Research source Social norms help people know what to expect and how to behave when interacting with others, which is why most people conform to them. [2] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Small social groups (like friend groups or cliques) may have social norms, as can large social groups (like all adult members of a country or society). [3] X Research source Social norms can also vary across different settings, geographical locations, and cultures. [4] X Research source"
    },
    {
      "title": "Greeting people when you see them.",
      "content": "Greeting people when you see them. Acknowledging others with a greeting when you see them in public is a common social norm. This greeting may involve saying “hello,” or simply nodding or smiling at someone. It can also vary across cultures. For example, in the U.S. it is common to shake someone’s hand when greeting them, and in Japan, it is customary to slightly bow one’s head. [5] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source"
    },
    {
      "title": "Making eye contact while conversing with someone.",
      "content": "Making eye contact while conversing with someone. Another common social norm is making eye contact with others while they’re speaking. This shows the person that you’re interested and paying attention to them, and it’s an important part of being a good listener . [6] X Research source"
    },
    {
      "title": "Saying please and thank you.",
      "content": "Saying please and thank you. One of the most recognizable social norms is saying “please” when asking for something and saying “thank you” when you receive something. For example, it is customary to say please when asking someone for a favor, and saying thank you if that person agrees to complete the favor."
    },
    {
      "title": "Saying “I’m sorry” if you’ve made a mistake.",
      "content": "Saying “I’m sorry” if you’ve made a mistake. Apologizing when you make a mistake is another common social norm. For example, it would be customary to say sorry if you accidentally bump into someone, or if you arrive at a scheduled gathering a few minutes late."
    },
    {
      "title": "Covering your mouth when you cough or sneeze.",
      "content": "Covering your mouth when you cough or sneeze. If you need to cough or sneeze in a public setting, covering your mouth with your elbow or a tissue is a common social norm. [7] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source This helps keep your hands clean from germs, which can prevent the spread of colds and viruses. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Holding the door.",
      "content": "Holding the door. Another common social norm is holding the door open if someone is entering a room or building behind you, especially if their hands are full or they’re holding something heavy."
    },
    {
      "title": "Waiting for your turn.",
      "content": "Waiting for your turn. In public spaces such as grocery stores, clothing shops, or takeout restaurants, it is customary to get in line behind any customers who are already waiting to check out, and then to wait for your turn. [9] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source"
    },
    {
      "title": "Respecting others’ personal space.",
      "content": "Respecting others’ personal space. Another common social norm is maintaining a bit of distance between yourself and other people in busy or crowded public places. [10] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source"
    },
    {
      "title": "Lowering your volume or keeping quiet in certain public places.",
      "content": "Lowering your volume or keeping quiet in certain public places. For example, it’s customary to whisper or lower your voice in libraries to avoid disturbing anyone who is studying. It’s also a common social norm to keep quiet while seeing a movie, play, or musical performance at a theater to avoid disturbing other audience members. [11] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source"
    },
    {
      "title": "Examples of Social Norms at School",
      "content": "Examples of Social Norms at School Arriving to class on time. Completing the assigned reading before class. Turning in homework on time. Raising your hand when you have a question or comment. Avoiding talking while the teacher or professor is speaking. Taking notes on the lesson. Silencing and putting away your cell phone during class. Keeping your eyes on your own paper during exams. Not plagiarizing or cheating on assignments or assessments. Participating in group activities. Asking permission to leave the classroom. Being respectful of your teacher and classmates. Addressing your teacher as Mrs., Ms., Mr., Mx., or professor and their last name (rather than addressing them by their first name). Taking turns when doing an activity. Competing fairly when playing games. Asking permission to borrow a classmate’s school supplies. Keeping your desk tidy. Cleaning up after yourself. Speaking quietly in the school library. Avoiding teasing or bullying and standing up to bullies. Avoiding spreading rumors. Avoiding offensive language or curse words in the classroom. Following all school rules."
    },
    {
      "title": "Examples of Social Norms in the Workplace",
      "content": "Examples of Social Norms in the Workplace Arriving at your shift on time. Following any dress code your workplace has implemented. Treating coworkers and supervisors with respect. Remembering your coworkers’ names and addressing them by name. Responding to coworker’s texts, calls, and emails in a timely manner. Actively participating in meetings. Respecting others when they have different opinions. Avoiding taking credit for coworker’s work. Avoiding interrupting or talking over coworkers in meetings. Avoiding workplace gossip. Refraining from eating food your coworkers have brought to the office kitchen for themselves without asking first. Refraining from using any of your coworkers’ office supplies without asking them first. Informing supervisors if you are sick or unable to make it to work. Informing supervisors if you need to leave work early. Remaining professional at all times. Providing two weeks' notice if you’re planning to leave your position. Declining a job offer you don’t want, instead of simply ignoring it."
    },
    {
      "title": "Examples of Social Norms at Restaurants",
      "content": "Examples of Social Norms at Restaurants Making a reservation if you plan to eat at a busy restaurant. Arriving on time for reservations. Dressing appropriately for the restaurant (wearing a nice outfit at a fancy restaurant or a casual outfit at a more laid-back restaurant). Waiting to be seated (unless a sign is present instructing you to seat yourself). Waiting in line if you’re ordering at a counter. Laying your napkin across your lap. Saying “please” and “thank you” to your server. Chewing with your mouth closed. Avoiding talking while you’re chewing your food. Avoiding taking a phone call or texting at the table. Refraining from reaching across other members of your table to retrieve items. Refraining from eating off of someone else’s plate without asking. Avoiding double-dipping (dipping food you’ve already bitten into a communal sauce or condiment). Refraining from spitting out your food if you don't like it. Waiting until everyone’s finished eating to excuse yourself. Avoiding leaving a mess at your table for your server to clean up. Disposing of trash properly at a casual restaurant. Avoiding loud or vulgar behavior, which can disturb other diners. Leaving a tip for your server at the end of your meal. Refraining from bringing food from home or from other restaurants into the restaurant."
    },
    {
      "title": "Examples of Social Norms with Phones & Technology",
      "content": "Examples of Social Norms with Phones & Technology Saying “hello” when answering a phone call. Saying “goodbye,” “bye,” or “talk to you later” when hanging up the phone. Avoiding hanging up on someone when you’re on a phone call. Leaving someone a voicemail if they miss your call. Listening to the voicemails others have left you in a timely manner. Avoiding looking at your phone when someone is speaking to you. Putting your phone on silent when you’re at a movie or watching a live theater performance. Refraining from looking at someone else’s phone while they’re using it. Refraining from using someone else’s phone without asking first. Responding to others’ texts or instant messages to let them know you received them. Responding to emails within 48 hours of receiving them. Choosing a clear subject line when sending an email, such as \"Update for Today's Meeting,\" or \"Question About New Project.\" Starting emails with a greeting, such as \"Dear [recipient's name],\" followed by a comma. Ending emails with a sign-off and you're name, such as \"Best regards, [your name].\" Choosing an appropriate email address (no curse words or vulgar phrases)."
    }
  ]
}