{
  "url": "https://www.wikihow.com/Use-a-Downrigger-Setup",
  "title": "How to Use a Downrigger Setup",
  "steps": [
    {
      "title": "Pick the area that you want to fish.",
      "content": "Pick the area that you want to fish. Around 80 feet (24.4 m) deep is a good place to start. It is a smart idea to fish an area with a fairly flat bottom with no obstructions (such as trees, rocks). [1] X Research source"
    },
    {
      "title": "Slow to a trolling speed.",
      "content": "Slow to a trolling speed. Switch your reel to “free-spin” (allows to reel to spin freely, releasing line) by releasing the drag clicker. Put your lure into the water and allow it to feed out about twenty feet. Lock the drag clicker to stop your line and put your rod in the holder. [2] X Research source"
    },
    {
      "title": "Grab the line (beyond the tip) in one hand, and grab the line release clip in the other.",
      "content": "Grab the line (beyond the tip) in one hand, and grab the line release clip in the other. Clip the line release clip onto the line (there should be a mark on the clip to show where to clip it on) then lower the cannonball into the water. [3] X Research source"
    },
    {
      "title": "Do the following:",
      "content": "Do the following: [4] X Research source Release the brake while firmly gripping the handle on the reel. Lower the cannonball to the desired depth by using the depth counter attached to the spool. Lock the brake on the spool to keep the cannonball at that depth."
    },
    {
      "title": "Do the following:",
      "content": "Do the following: [5] X Research source Flip the switch that lowers the cannonball Watch the counter, and stop the cannonball at the desired depth by flicking the switch back. Reel up the slack on your line so that there is a bow in your rod. When a fish strikes or your wish to bring up your line, take your rod from the holder. Give it a swift jerk upwards to free the line from the release clip. With a manual system, you will have to crank the cannonball up with one hand while you fight the fish with the other (unless you are with someone else). With a motorized system, you just flip the switch. You can fight the fish with both hands while you wait for the cannonball to reach the surface."
    }
  ]
}