{
  "url": "https://www.wikihow.com/Turn-Your-Computer-Screen-Upside-Down",
  "title": "Rotating Your Screen on Windows, Chromebook, iOS, & More",
  "steps": [
    {
      "title": "Open up Settings.",
      "content": "Open up Settings . Press the Windows key on your keyboard and type the word settings . Click Settings to pull up your PC’s settings. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Shortcut: Right-click on a blank section of your desktop screen and left-click Display Settings from the sub-menu. This works for both Windows 10 and Windows 11."
    },
    {
      "title": "Click System.",
      "content": "Click System . If you're using Windows 10, you'll see this icon in the main panel. In Windows 11, the System option is in the left panel."
    },
    {
      "title": "Click Display.",
      "content": "Click Display . If you're using Windows 10, this option is at the top of the menu on the left-hand side of the screen. On Windows 11, you'll see this at the top of the right panel. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select an option from the Orientation menu to rotate your screen.",
      "content": "Select an option from the Orientation menu to rotate your screen . Click on the setting you’d prefer—once you make your selection, click either Keep Changes or Revert to switch your screen back to normal. Your options are: [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Landscape: Right-side-up; what most computer screens are Portrait: Rotated 90 degrees to the left Landscape (flipped): Rotated 180 degrees to the left Portrait (flipped): Rotated 90 degrees to the right"
    },
    {
      "title": "Try the Ctrl+Alt shortcuts if you have an older version of Windows.",
      "content": "Try the Ctrl + Alt shortcuts if you have an older version of Windows. Older PC screens (including PCs with an older version of Windows 10) can be rotated with a combination of Ctrl , Alt , and one of the 4 arrow keys: [4] X Research source Ctrl + Alt + ↓ - Flip the screen upside down (Landscape flipped) Ctrl + Alt + → - Rotate the screen 90° to the right (Portrait flipped) Ctrl + Alt + ← - Rotate the screen 90° to the left (Portrait) Ctrl + Alt + ↑ - Return the screen to its standard orientation (Landscape) Troubleshooting tip: If you have an Intel-powered PC, right-click your desktop and select Graphics Options . From there, turn on screen rotation in the Hot Keys section."
    },
    {
      "title": "Pull open the System Settings page.",
      "content": "Pull open the System Settings page. Click on the menu and select System Settings . [5] X Research source If you're using macOS Monterey or earlier, click the Apple menu and select System Preferences instead."
    },
    {
      "title": "Select Displays.",
      "content": "Select Displays . You'll see this option in the System Settings or System Preferences menu, depending on your version of macOS. [6] X Research source"
    },
    {
      "title": "Choose how much you’d like to rotate your screen.",
      "content": "Choose how much you’d like to rotate your screen. Using the Rotation menu, select the number of degrees you’d like your screen to rotate. Once you’ve settled on an adjustment, hit the Confirm button to apply the changes. [7] X Research source Want to reset your screen ? Just go back to the Rotation menu and pick the Standard option."
    },
    {
      "title": "Go to your Settings page.",
      "content": "Go to your Settings page. On the bottom-right corner of your screen , left-click on the clock. Then, select the gear icon to pull open your Chromebook’s Settings. [8] X Research source"
    },
    {
      "title": "Select the Device and Displays options.",
      "content": "Select the Device and Displays options. Find the menu the on the left side of the Settings page; from here, click on the Device option. From the new Device menu that pops up, select the Displays button. [9] X Research source"
    },
    {
      "title": "Rotate your screen using the Orientation drop-down menu.",
      "content": "Rotate your screen using the Orientation drop-down menu. Select the number of degrees you’d like to rotate your screen: 0°: The default, upright orientation 90°: Rotate 90 degrees to the right 180°: Rotate 180 degrees to the right 270°: Rotate 270 degrees to the right [10] X Research source Quick alternative: Press the Ctrl , ⇧ Shift , and keys all at the same time—this generates a pop-up confirming that you want to rotate your screen 90 degrees. Hit Continue to set your new orientation. Continue pressing this key combo if you’d like to keep rotating your Chromebook screen. [11] X Research source"
    },
    {
      "title": "Find the display settings.",
      "content": "Find the display settings. The location of this may vary according to your Linux distribution."
    },
    {
      "title": "Change the Rotation setting to \"Inverted\".",
      "content": "Change the Rotation setting to \"Inverted\". Click on Apply to save this."
    },
    {
      "title": "Confirm your changes by clicking on Keep this configuration.",
      "content": "Confirm your changes by clicking on Keep this configuration . This will rotate your screen indefinitely until you re-adjust the display settings. The dialog box contains a countdown timer; if you don't choose an option by the end of the timer, the display will automatically revert back to its previous configuration. You can also cancel your changes altogether by clicking Restore the previous configuration ."
    },
    {
      "title": "iPad & iPhone.",
      "content": "iPad & iPhone. You can easily rotate your screen using the Control Center . Here's how: If your iPad or iPhone has Face ID, swipe down from the top right corner of your screen to pull up the Control Center. If your device has Touch ID, swipe up from the bottom of the Home screen instead. [12] X Research source Look for an icon that features a lock symbol surrounded by a circular arrow—if the icon is red, tap it once to unlock your screen. Then, tilt your iPad or iPhone manually to rotate the screen automatically. [13] X Research source"
    },
    {
      "title": "Android.",
      "content": "Android. Tap the icon in your app list to pull up your phone or tablet's settings. From there, tap Accessibility , and then Auto-rotate screen . Now, your screen automatically rotates as you manually turn your device. [14] X Research source"
    }
  ]
}