{
  "url": "https://www.wikihow.com/Solve-a-Cryptogram",
  "title": "How to Solve Cryptograms: Easy Tips & Tricks",
  "steps": [
    {
      "title": "Fill in WHO, WHAT, WHERE, WHEN, WHY, and HOW if you see question marks.",
      "content": "Fill in WHO, WHAT, WHERE, WHEN, WHY, and HOW if you see question marks. If you notice a question mark at the end of an encoded message, you can always assume one of these words appears somewhere in the sentence. Check within the first few words of the sentence and look at the pattern of letters to determine which word fits best. If you already filled in some other letters, you may be able to solve the entire word right away. [1] X Research source For example, if the message reads something like DFTVT XVT PLG?, then you can make an educated guess that the first word is probably WHERE."
    },
    {
      "title": "Look for 2-character words to test letters throughout your puzzle.",
      "content": "Look for 2-character words to test letters throughout your puzzle. Even though there are a lot of 2-letter words, there are only a few that commonly show up in cryptograms. Look for any words that are only 2 letters long where you already placed an A or I so you only have to solve one other letter. You can also assume that the unsolved 2-letter words will either contain an A, O, or Y as their vowels. Try plugging the letters into your puzzle to see if the solved letters fit well in other words. [2] X Research source Some common 2-letter words you might come across in a cryptogram include OF, OR, TO, IT, IS, AT, AS, IN, HE, BE, BY, and MY. If you find two 2-letter words where the characters are reversed, such as FD and DF, then the words are typically ON and NO. You just have to figure out which one is which using the context of the cryptogram."
    },
    {
      "title": "Expand your search to 3-letter words that repeat throughout the puzzle.",
      "content": "Expand your search to 3-letter words that repeat throughout the puzzle. As you start finding more letters, 3-letter words become a lot easier to decipher. If the word comes at the start of the sentence and has 3 different characters, try substituting in the word THE since it’s usually the most common. Other frequent 3-letter words you might find in your puzzle include YOU, ARE, AND, ANY, BUT, NOT, and CAN. [3] X Research source If a 3-letter word has a double letter, such as DXX, then you can usually assume the word is ALL, TOO, or SEE."
    },
    {
      "title": "Check for words linking a compound sentence after commas.",
      "content": "Check for words linking a compound sentence after commas. Words like AND, BUT, OR, SO, BECAUSE, AFTER, or HOWEVER usually connect 2 parts of a sentence and frequently appear right after a comma. While it might not always be the case, check what letters you have in the word immediately following the comma to see if any of these words fit. Try placing the correct letters throughout your puzzle to see if it causes any issues. [4] X Research source"
    },
    {
      "title": "Scan for comparative or superlative phrases.",
      "content": "Scan for comparative or superlative phrases. Comparative and superlative words are adjectives that describe or compare other words, such as ALWAYS or NEVER, BEST or WORST, MORE or LESS, and OFTEN or RARELY. Since cryptograms are usually quotes or jokes, you’ll usually find at least one instance of a comparative or superlative word. Keep your eyes out for words that follow these letter patterns in the puzzle, and try plugging the letters in to see how they fit in other words. [5] X Research source Other common phrases you might see include MOST, LEAST, EVERYTHING, and NOTHING."
    },
    {
      "title": "Search for 1-character phrases to place the letters A and I.",
      "content": "Search for 1-character phrases to place the letters A and I. Since the only 1-letter words in English are A or I, they’ll be the easiest to find in your puzzle. Scan through the cryptogram and make note of any characters that appear by themselves. While you won’t be able to figure out exactly which letter goes where without some other clues, you’ll at least narrow down your options. [6] X Research source For example, if you see “SXO PV W” in the puzzle, you can assume the W is an A or I. If the cryptogram is a poetic or archaic quote, then it might be possible that the character is an O. However, this is pretty rare and you won’t encounter it often. If you notice a single character also appears in a 2-letter contraction, you can usually assume the letter is an I. For example, if you see “W’X” in the cryptogram, the word is typically I’M or I’D."
    },
    {
      "title": "Substitute E, T, A, O, I, N, or S for the most frequent characters in the puzzle.",
      "content": "Substitute E, T, A, O, I, N, or S for the most frequent characters in the puzzle. These letters appear the most in English, so you can typically assume a common character is one of them. Look through your cryptogram and count how many times each character appears in the puzzle. You can try plugging a letter into a word right away, but it might be hard to decipher if you haven’t worked on filling in other patterns. [7] X Research source For example, if a character appears more than 10 times in the cryptogram, there’s a good chance it’s one of the letters listed. Conversely, letters like Z, Q, J, and K are uncommon so they typically won’t be in your puzzle more than once or twice. [8] X Research source"
    },
    {
      "title": "Solve for common contraction endings after an apostrophe.",
      "content": "Solve for common contraction endings after an apostrophe. Contractions and possessives are extremely helpful in solving cryptograms because you can only end them with specific letters. Check if your puzzle has any words that contain apostrophes and count the number of characters in the word. You can usually deduce 1 or 2 letters from the words based on the characters after the apostrophe. [9] X Research source If the word only has 1 character after the apostrophe, then it’s typically an S or T. If it only has 1 character before the apostrophe as well, then the word is I’M or I’D. Other letters after an apostrophe could be RE or VE. If the same character is repeated after an apostrophe, such as “DD”, then the correct letters are LL. If a word ends with an apostrophe, then the last letter is typically an S to mark it’s a possessive. However, it could also mark a dropped G, such as the word SINGIN’."
    },
    {
      "title": "Test a solved letter by writing it above each instance of the encoded character.",
      "content": "Test a solved letter by writing it above each instance of the encoded character. If you’re sure about a letter or just want to make a guess, substitute the correct letter in for the character in the cryptogram. Find every time the character appears in your puzzle and put the correct letter above it. As you fill in the letters, check that its location makes sense in each word. [10] X Research source For example, if you fill in the letter I and it’s the last character in a word, it might be incorrect since not many common words end with I. Cryptograms are all about trial and error, so expect to make a few mistakes when you’re starting them. Work in pencil so you can easily erase and try new letters. Some websites will automatically fill each instance of a letter for you. If you’re having trouble figuring out a letter on an online cryptogram, see if there’s a Hint button that will reveal a letter for you."
    },
    {
      "title": "Cross off each letter once you use it.",
      "content": "Cross off each letter once you use it. Each character in a cryptogram only represents 1 letter, so you won’t reuse any letter that you’ve already decoded. Write down each letter of the alphabet on a piece of paper nearby and strike out each letter you’ve placed in the puzzle. That way, you can see what letters you still need to figure out. [11] X Research source If you’re solving cryptograms online, then it might keep track of what letters you’ve already used on screen."
    },
    {
      "title": "See if there are repeated phrases throughout the puzzle.",
      "content": "See if there are repeated phrases throughout the puzzle. Famous quotes that are turned into cryptograms usually have repeated or similar words, so search for strings of common characters throughout the puzzle. Once you solve one of the words, substitute as many of the letters as you can in the other word to get a better idea of what it might be. [12] X Research source For example, the puzzle “D MXO WADOJ LI OLWADOV NPRR KNPXRYZXHNP WAXO X NDIP UPQLWP U WL KNPXRYSP,” repeats the pattern “KNPXRY” in 2 different words so you know they use the same letters. You might also see modified versions of a word, such as “pleasure” and “pleasurable,” in the same cryptogram."
    },
    {
      "title": "Solve for pairs of repeated letters in a single word.",
      "content": "Solve for pairs of repeated letters in a single word. Only a few letters repeat in words, such as RR, LL, NN, MM, EE, or OO. Check for words that have 2 of the same character right next to each other, and see if you’ve decoded any other letters in it. That way, you can get a better idea of which words might fit in the puzzle. [13] X Research source For example, some words you might find this way include WELL, WILL, BEEN, SOON, or BETWEEN."
    },
    {
      "title": "Keep your eye out for letters that normally pair up in words.",
      "content": "Keep your eye out for letters that normally pair up in words. Digraphs frequently appear in English as pairs of letters with a common and less-common character, such as TH, PH, QU, or EX. Check the puzzle to find pairs of letters that appear together frequently throughout the encoded message. While it usually helps if you have one of the letters solved already, you might be able to recognize some of these patterns. [14] X Research source Digraphs with the letter H include CH, SH, TH, PH, and WH, and they can be at the beginning or end of words. You’ll usually see the letter K in digraphs like CK, SK, LK, or KE at the end of a word. The letter Q will almost always be followed by a U. You can typically assume X is preceded by an A or E. [15] X Research source"
    },
    {
      "title": "Check for common prefixes and suffixes on words longer than 5 letters.",
      "content": "Check for common prefixes and suffixes on words longer than 5 letters. Not every long word will have a prefix or a suffix, but it never hurts to check if it helps you solve more letters. See if any of the words in your cryptogram start with DE-, DIS-, EN-, PRE-, or UN- by plugging in the letters for those characters. You can also check for suffixes like -ABLE, -ED, -OUS, -ION, -ING, and -LY to see if they work with your words. [16] X Research source"
    }
  ]
}