{
  "url": "https://www.wikihow.com/Treat-Neck-Rashes-for-Your-Baby",
  "title": "How to Treat Neck Rashes for Your Baby",
  "steps": [
    {
      "title": "Use a mild unscented baby wash during bathtime.",
      "content": "Use a mild unscented baby wash during bathtime. Specific directions for use vary depending on the product you use, but generally, you can apply a bit of the baby wash to a soft, damp washcloth, then rub it into a light lather. Use the washcloth to gently wash your baby’s rash. [1] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Unscented baby washes are gentle and designed specifically for sensitive baby skin. After washing your baby’s neck, rinse it with cool water and pat gently. Allow some of the water to evaporate from your baby’s neck naturally to relieve inflammation."
    },
    {
      "title": "Use an unscented moisturizer on your baby’s neck after washing it.",
      "content": "Use an unscented moisturizer on your baby’s neck after washing it. Moisturizers can help your baby recover from a neck rash. While the specific directions for use vary depending on the product you use, you can generally rub a thin layer of your moisturizer onto your baby’s neck after bathing them. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Apply a skin protecting ointment to your baby’s neck in a thin layer.",
      "content": "Apply a skin protecting ointment to your baby’s neck in a thin layer. A & D ointment, Aquaphor, or a similar product can heal chafed, dry skin. Apply a bit of either product to your fingertip and rub it across your baby’s rash. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Calamine lotion (typically used for treating minor rashes and skin irritations) can be used on your baby’s neck in the same way. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use hydrocortisone cream if other treatments don’t work.",
      "content": "Use hydrocortisone cream if other treatments don’t work. Hydrocortisone is a strong medication used to restore skin to a healthy state. Place a small amount (about the size of a pea) on your fingertip, then spread it in a thin layer across your child’s rash. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Don’t use hydrocortisone cream on your baby’s face. Doing so could lead to adverse reactions. Hydrocortisone cream is only meant for short-term use. If you find yourself needing it more than a few days, see your doctor for a long-term solution. Babies under the age of 2 should not use over-the-counter hydrocortisone 1%, unless it's prescribed by the doctor."
    },
    {
      "title": "Apply yeast infection cream to your baby’s neck for a yeast, Candida, or fungal infection.",
      "content": "Apply yeast infection cream to your baby’s neck for a yeast, Candida, or fungal infection. If your baby has been diagnosed by a doctor with a neck rash associated with a yeast infection, you could treat it with a yeast cream. The application method for yeast infection creams varies somewhat based on the specific product you use. Generally, however, you can simply apply a dollop of the cream to your fingertip and massage it gently into the skin your child’s neck. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Anti-fungal creams like Lotrimin might also be useful if your baby has a yeast-related rash. Your doctor will recommend the best over-the-counter cream after they diagnose your baby’s yeast-related neck rash. Be sure to wash your hands thoroughly after applying the cream because these infections spread easily. Don't touch anywhere else on your baby or yourself before cleaning your hands."
    },
    {
      "title": "Call your doctor if the rash lingers.",
      "content": "Call your doctor if the rash lingers. If heat rash is not improving noticeably after several hours, consult your pediatrician. The rash could be the product of another condition. [7] X Research source Other common causes of rashes are dermatitis, eczema, contagious skin conditions, impetigo, communicable diseases, and other inflammatory disorders."
    },
    {
      "title": "Contact your doctor if the rash is getting worse.",
      "content": "Contact your doctor if the rash is getting worse. If the rash on your baby’s neck has gotten redder or appears cracked or weepy, contact your doctor. You should also seek medical attention if your baby is crying due to apparent irritation caused by the rash. [8] X Research source Keep in mind that conditions like impetigo can spread quickly and become serious. In the case of impetigo, the rash will become a weeping sore after a few days."
    },
    {
      "title": "Take note of important information that your pediatrician might be interested in.",
      "content": "Take note of important information that your pediatrician might be interested in. Keep track of when the rash first appeared and how the affected area has spread or shrunk. Other questions your doctor might want to know include: Has the rash gotten worse or better? Has the rash ever felt hot? Has your baby been more irritable and fussy since the rash has appeared? Have you begun giving your baby any new foods, medications, or formulas?"
    },
    {
      "title": "Use a medication to control medical conditions that may have caused the rash.",
      "content": "Use a medication to control medical conditions that may have caused the rash. If your baby’s doctor determines that the rash is caused by an underlying medical condition (eczema or psoriasis, for instance), they will probably recommend a corticosteroid cream or ointment. [9] X Trustworthy Source National Eczema Association Nonprofit organization dedicated to improving the lives of those with eczema through research and education Go to source Use directions for corticosteroids and ointments vary depending on the product you’re using, but you can usually just rub a thin layer of the ointment over the affected area. For more information on preventing neck rashes , skip to the next section."
    },
    {
      "title": "Don’t worry too much about redness on your newborn’s neck.",
      "content": "Don’t worry too much about redness on your newborn’s neck. It is common for newborns to have some redness in the creases of their necks. The redness is caused by a condition known as seborrheic dermatitis and should disappear on their own. If they remain 1 or 2 weeks after your child’s birth, contact your pediatrician. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Keep your baby's neck clean and dry.",
      "content": "Keep your baby's neck clean and dry. The skin is less likely to develop a rash if it's clean and dry. Newborns only need a bath 3 times a week until they are able to crawl, but you should still wipe them down. [11] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source If you want to bath your baby more often, that's okay as long as your baby's skin doesn't become dry."
    },
    {
      "title": "Pat dry excess drool as often as possible.",
      "content": "Pat dry excess drool as often as possible. Don’t allow your baby’s drool to pool on its neck, where it might cause a rash. Use a soft cloth to wipe your baby’s mouth, chin, and neck to prevent the accumulation of drool. [12] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Reduce the heat and humidity for your baby.",
      "content": "Reduce the heat and humidity for your baby. If your baby’s neck rash is heat-related, turn on the air conditioning or a fan. This will help soothe the rash on your baby’s neck. [13] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source If reducing the heat is impossible, take your baby to a cooler location like a shopping center."
    },
    {
      "title": "Cool your baby’s skin directly.",
      "content": "Cool your baby’s skin directly. There are several ways to cool your baby’s skin. You could, for instance, give them a tepid bath or lay a cool, damp towel across their neck. These cooling actions will relieve the itchiness and irritation of the rash and prevent it from spreading. [14] X Research source"
    },
    {
      "title": "Remove excess clothing.",
      "content": "Remove excess clothing. If your baby is swaddled in thick blankets or heavy clothing, remove them to allow more air to cool your baby’s neck. Improving the airflow should reduce the severity of the rash. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Dress your baby in breathable, cotton clothing.",
      "content": "Dress your baby in breathable, cotton clothing. Cotton absorbs body moisture, which means that the rash will be able to heal without being continually exacerbated by sweat. Cotton is also hypoallergenic, which means it will not cause your baby to develop a rash like some other materials will. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Don’t expose your baby to allergens.",
      "content": "Don’t expose your baby to allergens. If your doctor determines that your baby has a food allergy that is causing the neck rash, for instance, keep that food away from your baby and check food labels carefully to ensure that your baby doesn’t accidentally come in contact with it. [17] X Research source"
    }
  ]
}