{
  "url": "https://www.wikihow.com/Wear-a-Shoulder-Holster",
  "title": "How to Wear a Shoulder Holster",
  "steps": [
    {
      "title": "Put the empty holster rig on.",
      "content": "Put the empty holster rig on. Leave the cargo out of the rig until you get it tightened properly. Slip each of your arms through the arm loops like you would a backpack. Make sure the crossed straps go in the back, and that the gun and magazine holsters are below your arms. [1] X Research source Put one arm into its loop and slide the strap all the way to the top. Then grab the harness behind you and slip the second arm in. Alternatively, put each arm partially into its loop, lift the cross section over your head, and slide your arms through the rest of the way at the same time."
    },
    {
      "title": "Ensure that the straps cross high in the middle of your shoulders.",
      "content": "Ensure that the straps cross high in the middle of your shoulders. If you need to, shift the whole rig upward so that the straps cross just below your neck. This is the best position to keep the holster rig balanced and the weight distributed evenly across your shoulders. [2] X Research source Make sure the straps aren't twisted and that they lay flat against your shoulders and upper back. If your holster rig has shoulder pads, make sure they are centered front-to-back, high up on your shoulders near your neck."
    },
    {
      "title": "Adjust the holster rig straps so they are tight against your body.",
      "content": "Adjust the holster rig straps so they are tight against your body. The harness must stay close to your body. Tighten the straps so they don’t shift around much when you move your torso. Find the middle spot between the straps being uncomfortably tight and moving too much. [3] X Research source You may not find the perfect fit the first time you put the holster on, so pay attention to how it feels over time and adjust it. One way to test this is to stand in front of a full-length mirror and perform a series of movements. Watch if the holster rig moves around a lot or stays tight. Also take notice of whether or not the harness feels comfortable when you move around."
    },
    {
      "title": "Move the holster so it is near your armpit.",
      "content": "Move the holster so it is near your armpit. Every shoulder holster is a little different, especially when it comes to the holster placement. If the holster itself can move along the strap, move it up to just under your armpit. Make sure it is slightly forward of your arm. [4] X Research source With some holster rigs, you won’t be able to move the holster at all, so you’ll have to deal with wherever it sits. Most holster rigs have a holster for the gun and one for the magazine. Move the magazine holster up near your armpit, as well. Some holsters detach from the harness, which allows you to put it on either side of you. Put it under your left arm if you’re a right handed shooter and under your right arm if you’re a left handed shooter."
    },
    {
      "title": "Adjust the angle of the holster.",
      "content": "Adjust the angle of the holster. Holsters are positioned either horizontally or with the butt of the gun angled up or down. If your holster moves, angle it to the position that feels most comfortable for you. The horizontal position is generally the easiest to draw a gun from. [5] X Research source You may not know what position you want the holster in until later, when you practice drawing the gun."
    },
    {
      "title": "Put the gun and the magazine into their holsters.",
      "content": "Put the gun and the magazine into their holsters. With everything adjusted properly, it’s time to fill your holster. Make sure your gun holster is on the opposite side of your shooting hand. Put the gun into its holster and one or two magazines in the other holster. Most shoulder holsters hold a magazine opposite the gun to balance the weight across your shoulders."
    },
    {
      "title": "Wear a loose jacket.",
      "content": "Wear a loose jacket. Shoulder holsters are usually worn under a jacket of some kind to conceal them. Otherwise, they would be clearly visible. Make sure the jacket is loose enough that it doesn’t press tightly against the holstered gun."
    },
    {
      "title": "Keep your jacket open most of the time.",
      "content": "Keep your jacket open most of the time. Since a shoulder holster is meant to allow quick access to your gun, don’t wear your jacket fully zipped or buttoned up. Make sure that if the front of your jacket is closed, it is open at least at the level of the gun."
    },
    {
      "title": "Practice drawing your gun.",
      "content": "Practice drawing your gun. If you are wearing a shoulder holster for the first time, it will feel a little strange at first. While you’re at home, practice pulling your gun out of the holster. Make sure you practice with all of the jackets you’d usually wear."
    },
    {
      "title": "Avoid concealed carry if you don’t have a permit.",
      "content": "Avoid concealed carry if you don’t have a permit. Make sure you have your carry permit any time you wear your shoulder holster with a gun in it. If you are going to wear a jacket over the holster, make sure that you also have a concealed carry permit."
    }
  ]
}