{
  "url": "https://www.wikihow.com/Use-Bubble-Hair-Dye",
  "title": "How to Use Bubble Hair Dye",
  "steps": [
    {
      "title": "Wear old clothes while you use bubble hair dye.",
      "content": "Wear old clothes while you use bubble hair dye. Although bubble hair dye rarely drips like traditional dyes, it can cause fabric stains. Pick a shirt that you don't mind getting stained to wear while you dye your hair. If you don't have an old shirt, wear a plastic cape over your clothes instead. [1] X Research source"
    },
    {
      "title": "Cover the skin around your hairline with an oil-based skin care product.",
      "content": "Cover the skin around your hairline with an oil-based skin care product. Getting a small amount of dye on your skin is inevitable when you dye your own hair. Pick an oil-based skin care product such as a moisturizer or petroleum jelly and apply it generously around your hairline, including your forehead, neck, and ears. Don't rub the product in fully, as it's easier to remove any dye if there is a thin layer of the product remaining on your skin. [2] X Research source If you get dye on your skin, simply wipe it away using an old cloth or a towel. It will wipe away easily due to the protective layer. Apply the skin care product to your forearms too if you aren't wearing long sleeves."
    },
    {
      "title": "Wear the gloves that come with the bubble hair dye to protect your skin.",
      "content": "Wear the gloves that come with the bubble hair dye to protect your skin. Every package of bubble hair dye comes with a pair of gloves to help prevent the dye from staining and irritating your skin. Put the gloves on before you begin working with the bubble hair dye and keep them on throughout the entire process. If gloves haven’t been provided in your kit, wear regular plastic gloves instead. [3] X Research source"
    },
    {
      "title": "Comb your hair to remove any tangles.",
      "content": "Comb your hair to remove any tangles. Get your regular comb and work it through your hair, from the roots to the tips. Make sure that there are no knots or tangles in your hair so that the dye is applied evenly. Alternatively, use a brush to remove any tangles in your hair. [4] X Research source"
    },
    {
      "title": "Part your hair into multiple smaller sections.",
      "content": "Part your hair into multiple smaller sections. Having your hair in smaller sections makes applying the dye evenly much easier. Get your comb and divide your hair into a center parting. Then divide each side of your parting into 2-4 smaller sections where you would wear a headband, depending on how thick your hair is. Use plastic clips or hair ties to hold each section in place. [5] X Research source For example, you could divide the hair on each side of your head into 4 equal horizontal sections from the top of your head to the nape of your neck."
    },
    {
      "title": "Pour solution 1 into the bottle of solution 2.",
      "content": "Pour solution 1 into the bottle of solution 2. It’s time to combine the 2 different solutions to prepare the bubble hair dye! Read the label of each bottle closely to determine which solution is which. Then remove the cap on solution 2 and carefully pour solution 1 into the bottle. Twist the cap tightly back on solution 2 when you’re done to make sure that the bottle is fully sealed. Solution 1 is in the smaller bottle and solution 2 is in the bigger bottle."
    },
    {
      "title": "Invert the solution 2 bottle 5 times.",
      "content": "Invert the solution 2 bottle 5 times. Inverting the bottle gently combines the solutions to form the dye. Grasp the bottle firmly and gently tilt it upside down and then the right way around. Repeat this motion 5 times and try to work relatively slowly, taking 2-3 seconds for each inversion. Avoid shaking the bottle when you mix the dye, as this can cause bubbles to form. This means that the foam may not dispense properly when you use it. [6] X Research source"
    },
    {
      "title": "Place the foam cap on the bottle.",
      "content": "Place the foam cap on the bottle. Turn the original cap anticlockwise to remove it from the bottle. Then replace the original cap with the foam cap by simply twisting the foam cap clockwise onto the bottle. Check that the foam cap feels secure before you use the dye. The foam cap is usually pink while the original cap is normally white."
    },
    {
      "title": "Squeeze the center of the bottle gently to begin dispensing the foam.",
      "content": "Squeeze the center of the bottle gently to begin dispensing the foam. Hold the bottle of bubble hair dye in 1 hand and position your other hand just below the foam cap. Gently squeeze the center of the bottle until foam begins to dispense from the foam cap. Catch the foam in your palm and continue dispensing until you have a tennis ball-sized dollop of foam. Hold the bottle upright while you dispense the foam."
    },
    {
      "title": "Apply the foam to 1 section of your hair, beginning at the roots.",
      "content": "Apply the foam to 1 section of your hair, beginning at the roots. Gently pat your hands together so that you get an even amount of foam in each palm. Then run your palms down your hair, starting at the roots. Make sure to get an even covering of the foam in your hair and to work your way around your head. You’ll notice the foam quickly disappears into your hair. This is normal and you don’t need to apply more. You may need to create smaller partings within each section so that you ensure the foam covers all of the strands. Always start at the bottom of the section and move up to ensure coverage of all of the hair."
    },
    {
      "title": "Cover each section of your hair with the foam using the same process.",
      "content": "Cover each section of your hair with the foam using the same process. Dispense large dollops of foam into your palm and run it through your hair, right down to the tips. Work your fingers through your hair as you apply the foam and aim to get your hair evenly covered. Make sure to apply the foam to the sections at the back of your head too. Don’t be afraid to use plenty of foam! If you have hair that’s longer than your shoulders, it’s recommended that you use the entire bottle. [7] X Research source Lift up each section of your hair as you work the foam in with your fingers to make sure that you cover all of the strands. [8] X Research source Remove the clips or hair ties as you apply the foam to each section."
    },
    {
      "title": "Massage the foam through your hair.",
      "content": "Massage the foam through your hair. Work the foam through your hair in the same way that you apply shampoo. Gather all of your hair on the top of your head and use your fingers to massage the foam thoroughly into your scalp and hair. This ensures that the foam is evenly distributed throughout your hair. You can combine all of the sections you made in your hair at this point. Run your fingers through your hair as you massage the foam in to make sure that all of the strands are covered."
    },
    {
      "title": "Leave the foam in your hair for 20 - 30 minutes before you rinse it out.",
      "content": "Leave the foam in your hair for 20 - 30 minutes before you rinse it out. Set a timer for approximately 25 minutes so that the foam has plenty of time to dye your hair. If the foam drips slightly during this time, massage your hair again to make the foam lather. After the set amount of time, rinse your hair thoroughly to remove all of the bubble hair dye. Don’t worry if you notice the foam disappearing, as this is normal and it will still work to dye your hair."
    },
    {
      "title": "Apply the rinse-off treatment to your hair.",
      "content": "Apply the rinse-off treatment to your hair. Tear open the sachet of the rinse-off treatment. Pour the rinse-off treatment into your palm and then massage it through your hair from the roots to the tips. Aim to get all of your hair covered with the rinse-off treatment. The rinse-off treatment helps to condition your hair, keeping it shiny and sleek."
    },
    {
      "title": "Wash the treatment out of your hair and then let it dry.",
      "content": "Wash the treatment out of your hair and then let it dry. Once you have applied the rinse-off treatment to your hair, you can wash it out straight away. Hold your hair under warm, running water to remove the rinse-out treatment. Then apply shampoo and conditioner to your hair as you normally would. Lightly pat your hair dry with a towel and then let it dry naturally. [9] X Research source If you want the dye to last longer, use a color-protectant shampoo and conditioner."
    }
  ]
}