{
  "url": "https://www.wikihow.com/Start-a-Bartending-Service-Business",
  "title": "How to Start a Bartending Service Business",
  "steps": [
    {
      "title": "Learn as much as you can.",
      "content": "Learn as much as you can. There are several ways in which you can educate yourself in preparation for a successful bartending business venture. [1] X Research source Schooling. Enroll in a bartending school, if you haven't already. You don't need to go to bartending school to become a bartender, but it can help you learn the basics much faster. On the job training. Get a bartending job. Additionally, any hand-on experience you can accrue in the fields of customer service or hospitality is helpful. Business. You will need to understand the basics of running a small business, including accounting, bookkeeping, marketing and customer service. Take a couple of business classes at the local community college or business resource center, or check out some library books on the subject. Others' experiences. You can learn a lot by speaking with other people who operate similar traveling bartender businesses. Use a phone book and make some calls. Double-check your local, county, city, and state laws regarding alcohol before you get started."
    },
    {
      "title": "Formulate a business plan.",
      "content": "Formulate a business plan. Put it down on paper. It should cover everything about your business, including start-up capital, business expenses and projected income, personnel needs and marketing plan."
    },
    {
      "title": "Decide on a business name.",
      "content": "Decide on a business name. [2] X Research source"
    },
    {
      "title": "Register your mobile bartending business name with your government's business regulatory agency.",
      "content": "Register your mobile bartending business name with your government's business regulatory agency."
    },
    {
      "title": "Obtain a business license, also through your government's business regulatory agency.",
      "content": "Obtain a business license, also through your government's business regulatory agency. Bartending licenses are not required but are available through most bartending schools. [3] X Research source"
    },
    {
      "title": "Invest in bartending business supplies.",
      "content": "Invest in bartending business supplies. You do not have to get anything fancy, but you will need the following basics for starters: [4] X Research source Portable bar. These come in a variety of sizes and styles, and at a wide range of price points. Business cards. You can purchase expensive cards from a print shop or make your own. The point is to get your name out there. Bartending tools. Speed pours, bottle openers, wine keys, coolers and garnish trays. A uniform. This is not a necessity, but is a good way to present a professional appearance to customers."
    },
    {
      "title": "Create marketing materials.",
      "content": "Create marketing materials. Business cards, flyers and postcards are good start-up basics."
    },
    {
      "title": "Market your traveling bartender service.",
      "content": "Market your traveling bartender service. Be creative, and implement each and every avenue of marketing you possibly can. [5] X Research source Place free ads on online classifieds sites. Purchase advertising blocks in local newspapers. Approach the people in charge of booking events at local venues and leave business cards with them. Call party planners, disc jockeys, caterers and other event professionals. Explain your bartending service business and ask for referrals. Search classifieds for people seeking a traveling bartender for their parties. Sign up on websites like Thumbtack, where people can search for gig-based vendors. Some of these sites have membership fees, but they're a great way to get your name out there."
    }
  ]
}