{
  "url": "https://www.wikihow.com/Take-a-Break-in-a-Relationship-when-You-Live-Together",
  "title": "9 Ways to Take a Relationship Break When You Live Together",
  "steps": [
    {
      "title": "Taking a break is probably easiest if someone moves out.",
      "content": "Taking a break is probably easiest if someone moves out. [1] X Expert Source Allen Wagner, MFT, MA Marriage & Family Therapist Expert Interview. 24 September 2021. If one of you has close friends or family in the area, see if you can stay with them for a while. You can still stay in contact with your partner via texts or phone calls, but you don’t have to see them in person every day. [2] X Research source If you don’t want to move out for your entire break, consider splitting the time with your partner. For instance, if your break lasts 1 month, you could move out for 2 weeks and your partner could move out for the other 2."
    },
    {
      "title": "Moving out for a while might not be an option.",
      "content": "Moving out for a while might not be an option. If both of you have to stay in your current spot, set up a schedule and figure out who’s going to take the couch and who’s going to take the bed. To make it fair, try to switch every week so you both get a good night’s rest. [3] X Research source If you have a guest bedroom, one of you could also stay in there."
    },
    {
      "title": "Try not to behave like a typical couple.",
      "content": "Try not to behave like a typical couple. If you’re still living together, try to make plans with friends outside of the house often. When you’re home, hang out in separate rooms to give each other space. [4] X Research source If one of you is able to move out temporarily, set up a schedule for how often you two talk on the phone every week. Most couples taking a break like to stay in contact at least once a week."
    },
    {
      "title": "Put an end date on when you’ll reconnect with each other.",
      "content": "Put an end date on when you’ll reconnect with each other. Most breaks last around 3 months, but yours can be as long or as short as you’d like it to be. However, try not to go past 6 months, as that can start to feel like an actual breakup. [5] X Research source"
    },
    {
      "title": "Different couples set different boundaries within a break.",
      "content": "Different couples set different boundaries within a break. Some couples say that it’s okay to see other people, while other couples want to remain monogamous. Make sure you talk with your partner about what’s okay and what isn’t beforehand. [6] X Research source Set clear rules before your break to avoid heartache later on."
    },
    {
      "title": "You might need to check in about logistics, too.",
      "content": "You might need to check in about logistics, too. If you live together, you might share a streaming account, a utilities account, or even a bank account. Talk with your partner about setting up automatic payment plans so you don’t have to reach out during the break to talk about bills. [7] X Research source Keep in mind that if both of your names are on the lease, you’ll still have to pay rent even if you aren’t living there."
    },
    {
      "title": "Breaks are all about taking time for yourself.",
      "content": "Breaks are all about taking time for yourself. As you spend some time away from your partner, think about who you are now and who you’d like to be in the future. If you want to get serious about working on yourself, you could even talk to a mental health professional. [8] X Expert Source Allen Wagner, MFT, MA Marriage & Family Therapist Expert Interview. 24 September 2021. Now’s the time to think about your own identity and how it meshes with your partner’s. [9] X Research source"
    },
    {
      "title": "Think about what you like and what you don’t like.",
      "content": "Think about what you like and what you don’t like. As you take your break, could you see yourself living without your partner? Or did you both just need some time and space apart? Try to keep those questions in the back of your mind as you go about your life. [10] X Research source A lot of times, breaks can make couples feel closer together. Taking time for yourself and reflecting on your relationship might make you realize that you still want to be together, you just have some work to do. On the flip side, you might actually find that you enjoy the single life more than being in a relationship. If that’s the case, plan and move out within 30 to 60 days. [11] X Expert Source Allen Wagner, MFT, MA Marriage & Family Therapist Expert Interview. 24 September 2021."
    },
    {
      "title": "When the break is over, sit down and talk to each other.",
      "content": "When the break is over, sit down and talk to each other. Communicate about how you’re feeling now, how the break was for you, and what you want to do moving forward. It’s up to both of you to decide what your next steps are and how you can either make it work or break up for good. [12] X Research source If you do want to break up with your partner, don’t drag it out any longer. Let them know that you’d like to actually break up, not just go on another break. Reader Poll: We asked 1129 wikiHow readers what the most important thing to keep in mind when breaking up with someone is, and 58% of them said being honest, but not unnecessarily harsh. [Take Poll]"
    }
  ]
}