{
  "url": "https://www.wikihow.com/Start-an-Advertising-Agency",
  "title": "A Step-by-Step Guide to Starting an Advertising Agency",
  "steps": [
    {
      "title": "Determine your goal for this business.",
      "content": "Determine your goal for this business. Before starting your business, you need to define what your final goals are. Is this a part-time commitment that you will do in your spare time from home, or do you want to be the next big agency and open an office in Midtown Manhattan? Your goals will determine how you run your agency, who you hire, how you budget, and almost everything about your business."
    },
    {
      "title": "Consider taking courses that will help you run this business.",
      "content": "Consider taking courses that will help you run this business. While formal education isn't required to start your own advertising firm, there are college classes that could be an asset to you. Of course advertising classes are an obvious choice, but getting educated in a few additional areas can help you properly manage your business and expand your profits. [1] X Expert Source Imran Alavi Marketing Expert Expert Interview. 31 March 2021 Management classes will help teach you the specifics of running a business. Accounting or finance classes will help you make sense of your financial records and manage your books. It may also allow you to forgo hiring an accountant to manage your finances, which will be a big savings for you. Graphic design classes can help you create visual advertisements. Otherwise, you'll have to hire a designer if you want to do picture ads, which will be a significant expense."
    },
    {
      "title": "Keep up with the advertising field.",
      "content": "Keep up with the advertising field. Advertising is a dynamic industry, so you'll need to keep in touch with all developments in the industry if you plan on becoming successful. If you haven't already, subscribe to all the relevant periodicals in the industry and read every issue. You can also attend talks and conferences to further educate yourself on the field and see what your competition is planning."
    },
    {
      "title": "Draw up a business plan.",
      "content": "Draw up a business plan. When starting any business, you will need to draw up your short and long-term plans at some point. This is essential if you intend to get loans or investments, but also useful for yourself so you can gather your thoughts and decide your intentions for growing your business. For your advertising agency, your business plan should include at least the following. [2] X Research source A description of your business. Investors and banks will want to know what exactly your business does and what kind of service it offers. Be specific when explaining your methods for advertising. There are a lot of advertising agencies, so people may be cautious to invest unless you convince them that your business will offer a service that other firms don't. A projection for the profitability of your firm. Investors will want to know that they will profit from your business. You may want to consider using an accountant to help you come up with a short and long-term outlook for your earnings to ensure it is as accurate as possible. A full breakdown of your costs. Investors and banks will want to see what you'll be putting their money towards. Include all of the costs you have incurred, as well as the costs you anticipate incurring as you build the firm. Remember to include an estimate of your day-to-day operating expenses as well- it may take a few months to turn a profit from your business, so make sure you'll have the necessary capital to stay open."
    },
    {
      "title": "Acquire start up capital.",
      "content": "Acquire start up capital. Even though advertising agencies are generally considered low-cost start ups because they can be run from home, you'll still probably need loans or investments to get started. [3] X Research source Generally you'll have two choices when looking for start up capital, and will probably end up using both. Banks. You can get a loan from a bank for a few months to a few years, depending on the type of loan. This can cover your opening costs and your first few months of operating expenses. Private investors. These can be friends, family, or other business owners interested in making an investment. Make sure you define whether these people are just providing a loan that you will pay back with interest, or if they're actually buying into your company. It would be helpful to draw up a contract defining the terms of your agreement and having it notarized to prevent problems in the future."
    },
    {
      "title": "Put together a portfolio.",
      "content": "Put together a portfolio. Your selling point to potential clients will be your portfolio. This is a collection of past work you've done in advertising. Many people who start advertising firms have worked in the industry as employees and now want to be business owners. If this is the case, you'll have plenty of work to put in your portfolio. If you haven't worked in the field, building a portfolio should be a top priority. Take any small jobs you can get to add to your portfolio. If you're entirely new to advertising, you might want to consider working as an employee for a while first. This will give you crucial experience and credentials that you can put into your portfolio when you start your business."
    },
    {
      "title": "Build a website.",
      "content": "Build a website. If a business doesn't have an online presence, it is almost entirely invisible to a large section of its potential market. To avoid this, make sure to make a great website that details your firm and its work. [4] X Research source Include your contact information and anything your potential clients will need to know about setting up a meeting. Also include links to any articles or ad campaigns you've worked on. Think of it as a digital portfolio. Keep your website updated. An outdated site looks unprofessional and will make your business look unreliable. While it's expensive, you may want to hire a professional to build your site. A cheaply-designed website is easy to spot and could turn off potential clients. It is well worth the investment to get a professionally-designed website if it attracts clients."
    },
    {
      "title": "Hire employees.",
      "content": "Hire employees. The intended size of your firm will indicate how many employees you'll need. If your business is very small and you're good at multitasking, you might be able to operate alone or with a small team. If you want to offer a multitude of services, you'll need more employees. While looking for employees, consider the following positions. A copy editor. This is essential if you will be releasing text ads or articles. You want all the writing your firm produces to be top-quality, so a great copy editor is an asset to your company. A graphic designer. If you want to offer picture or design ads, you'll need a graphic designer on your team. They can create colorful, eye-catching ads that your clients will look for. An IT specialist. A lot of your work will probably be done on computers, so consider hiring an IT expert to set up your computers and maintain them properly."
    },
    {
      "title": "Decide who you will market to.",
      "content": "Decide who you will market to. You will probably take on a variety of clients from different fields, but you may want to develop a specialty for your firm. If you or someone on your team has background with hotels, for instance, you could market towards hotel advertising. Figuring out your specific niche will help guide you to where you should concentrate your efforts for clients. Small businesses rarely attract attention from agencies because they usually don't spend a lot on ads. This means there is also a potential market for advertising with small businesses, so don't neglect them when looking for clients. You'll have to keep your rates fairly low to do this, however. [5] X Research source"
    },
    {
      "title": "Consult your own contacts for referrals.",
      "content": "Consult your own contacts for referrals. Most companies find advertising agencies through personal referrals, so cold-calling and random meetings probably won't go very far. To take advantage of this fact, let all of your contacts know that you've started an agency and are looking for clients. Especially focus on contacts who work with businesses, like lawyers or accountants. If you've worked in advertising before, you probably have a long list of contacts you could tap into. If you're new to the industry, you'll have to take advantage of any and all contacts you might have. [6] X Research source When meeting with your contacts, perhaps treat them to lunch or coffee. Bring your portfolio and be prepared to talk about why your agency will do a good job. Remember, even if these are your friends, you're relying on them to refer your agency to clients. Making a good impression is your number one priority."
    },
    {
      "title": "Attend conferences.",
      "content": "Attend conferences. There are usually several conferences in advertising and related fields every year. Advertisers as well as clients looking for agencies attend these conferences. Keep an eye out for these meetings in advertising journals and websites, and attend all that you can. Of course, bring your portfolio and do your best to meet everyone you can. You never know who can go from a casual acquaintance to an important client. [7] X Research source Sometimes conferences look for speakers or presenters. You should try to present at conferences as well, instead of just attending. This will give you more publicity and ensure that more potential clients will see you and hear you speak."
    },
    {
      "title": "Offer first-time deals.",
      "content": "Offer first-time deals. Many clients are interested in using an advertising firm, but resist because they're unwilling to spend a lot of money for a first-time consultation. A good tactic for gaining clients is to offer either a free or low-cost introductory session. In this meeting, you can talk with your client about what services you offer, what you'll charge, and show him samples of your work. The small financial cost of offering a free consult will be a worthwhile investment if you gain a client out of it. [8] X Research source"
    },
    {
      "title": "Try specialized websites.",
      "content": "Try specialized websites. Some websites, like Agencyspotter.com, are designed for agencies and clients to come together. Look for these kinds of sites and make a good profile on them to find more clients."
    },
    {
      "title": "Consider doing a charity campaign.",
      "content": "Consider doing a charity campaign. Often charitable organizations use ad agencies to design public service announcements or campaigns. These often don't pay much or at all, but they are great exposure for your agency. Consider these opportunities heavily if they come your way. [9] X Research source"
    }
  ]
}