{
  "url": "https://www.wikihow.com/Types-of-Drunks",
  "title": "What Types of Drunks Are There?",
  "steps": [
    {
      "title": "The Affectionate Drunk",
      "content": "The Affectionate Drunk Alcohol affects your brain’s cerebral cortex, which lowers the sense of restraint and inhibition you’d have when sober. [1] X Research source With this in mind, you might find yourself getting more touchy-feely and affectionate with the people around you when you’re drunk, even if it’s not something you would typically do. An affectionate drunk might confess their feelings to their crush, or give their friends hugs when they aren’t typically a huggy person."
    },
    {
      "title": "The Angry Drunk",
      "content": "The Angry Drunk Alcohol has a variety of impacts on your brain and how you observe and interact with the world around you. For one, alcohol makes it more difficult to analyze all the different social cues of a situation. It also makes it easy to misunderstand someone else’s behavior and even lowers the inhibitions you’d normally have in place. [2] X Research source Because of this, some people tend to be labeled as “angry” or “aggressive” drunks. An angry drunk might initiate a yelling match after someone bumps into them, or may even resort to physical violence."
    },
    {
      "title": "The Happy Drunk",
      "content": "The Happy Drunk Alcohol is a funny substance—while it’s technically a depressant, it can boost a person’s feel-good hormones like serotonin and dopamine . [3] X Research source Because of this, some people tend to be really free-spirited and cheerful when they start drinking. A happy drunk might be super giggly, as well as cheerful and friendly with everyone they meet."
    },
    {
      "title": "The Irresponsible Drunk",
      "content": "The Irresponsible Drunk Alcohol affects your ability to make sound judgments, which can lead to some pretty questionable and reckless decisions. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Irresponsible drunks might consistently use drinking as an opportunity to make poor decisions. An irresponsible drunk might try to get a tattoo or piercing or make a financially ill-advised decision with their credit card."
    },
    {
      "title": "The Sad Drunk",
      "content": "The Sad Drunk Alcohol throws your brain chemistry off-balance. In fact, research shows that frequently drinking a lot can be connected with depression. [5] X Research source Sad drunks might use alcohol as a way to cope with their current state of mind, and/or they may tend to feel blue whenever they drink. A sad drunk might keep to themselves while drinking, or may even start crying."
    },
    {
      "title": "The Sloppy Drunk",
      "content": "The Sloppy Drunk Since alcohol directly impacts the brain, your sense of balance and coordination are often thrown off if you’ve had a lot to drink. This can lead to “sloppy” behavior, like tripping, having trouble with simple tasks, and spilling drinks. [6] X Research source A sloppy drunk might have a hard time sitting up on their own, or they may stagger on their way to bathroom."
    },
    {
      "title": "The Wistful Drunk",
      "content": "The Wistful Drunk Alcohol can have all sorts of impacts on your emotional state—it all depends on the person. Some people, for instance, may feel especially nostalgic and wistful after having a drink. In fact, men reported in one poll that whiskey specifically inspired nostalgic feelings in them. [7] X Research source A nostalgic drunk might spend most of their time focusing on “the good old days” or fun, carefree memories from the past."
    },
    {
      "title": "One study used a personality test to develop 4 drunk personality types.",
      "content": "One study used a personality test to develop 4 drunk personality types. In the psychological community, the 5-Factor Model of Personality is a well-known theory used to measure a person’s personality using 5 core traits: Openness, Conscientiousness, Extraversion, Agreeableness, and Neuroticism. [8] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Researchers used this theory to identify 4 different types of “drunk” personalities: Hemingway, Mary Poppins, Mr. Hyde, and The Nutty Professor. [9] X Research source Agreeableness refers to the way a person interacts with others. Conscientiousness relates more to a person’s sense of impulse control. [10] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Extraversion is all about how much social interaction a person needs. [11] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Note: For the sake of the study, researchers measured “Emotional Stability” in lieu of Neuroticism and “Intellect” instead of Openness. [12] X Research source"
    },
    {
      "title": "Hemingway",
      "content": "Hemingway The “Hemingway” type of drunk behaves similarly to how they are when sober. Over 40% of the studied college students fell into this category, showing lower levels of Conscientiousness and Intellect thanks to their intoxication. [13] X Research source This personality type is named for famed American author Ernest Hemingway, the author of well-known novels like The Old Man and the Sea and For Whom the Bell Tolls . [14] X Research source"
    },
    {
      "title": "Mary Poppins",
      "content": "Mary Poppins “Mary Poppins” types of drunks are pleasant to be around when they’re both drunk and sober, though only about 15% of college students fell into this category. Mary Poppins-type individuals are high in Agreeableness when they’re sober, but have below-average levels of Agreeableness, Intellect, and Conscientiousness while they’re drinking. In the Disney movie Mary Poppins , the titular nanny is known for her bubbly and upbeat attitude as she cares for two young children."
    },
    {
      "title": "Mr. Hyde",
      "content": "Mr. Hyde Named for the fictional Dr. Jekyll who had an evil alter ego known as “Mr. Hyde,” “Mr. Hyde” drunks experience a strong personality shift after they start drinking. Mr. Hyde's typically experience big drops in their Agreeableness, Conscientiousness, and Intellect levels while they were intoxicated. Just a little over 20% of the studied students had a Mr. Hyde-type drunk personality. [15] X Research source The name “Mr. Hyde” comes from Robert Louis Stevenson’s novella Strange Case of Dr Jekyll and Mr Hyde . Dr. Jekyll is a good-natured doctor who ends up giving himself a sinister alter ego after an experiment gone wrong. [16] X Research source"
    },
    {
      "title": "The Nutty Professor",
      "content": "The Nutty Professor These drunks are introverted when they’re sober, only to become much more extraverted and social after a few drinks. People in this category tend to be much more Extraverted drunk than when they’re sober and have lower Conscientiousness levels when drunk. In the study, 20% of the researched students appeared to have The Nutty Professor drunk personality type. [17] X Research source This category comes the 1996 Disney film The Nutty Professor , a movie about a shy, overweight professor who slims down temporarily with them help of a special formula. While he’s skinny, he takes on the persona of a rude and outgoing individual known as “Buddy Love.” [18] X Research source"
    },
    {
      "title": "Alcohol makes it difficult for your brain to communicate with your body.",
      "content": "Alcohol makes it difficult for your brain to communicate with your body. The medical community classifies alcohol as a neurotoxin—a major reason for this is that it gets in the way of your brain’s communications. Because of this, drunk individuals are often unbalanced and uncoordinated, and have trouble being steady on their feet. [19] X Research source Biologically speaking, alcohol only takes about 5 minutes to get to your brain after you first start drinking. You may notice its effects in as little as 10 minutes. [20] X Research source This disconnect in the brain is why it’s so dangerous for drunk people to drive. [21] X Trustworthy Source National Highway Traffic Safety Administration U.S. government agency responsible for writing and enforcing Federal Motor Vehicle Safety Standards Go to source"
    },
    {
      "title": "Alcohol affects the brain’s ability to store memories.",
      "content": "Alcohol affects the brain’s ability to store memories. When someone drinks an excessive amount of alcohol, it can hinder the brain’s ability to move short-term memories to the hippocampus (the storage area for long-term memories). Because of this, some drunk individuals “blackout,” or don’t remember what happened when they were intoxicated. [22] X Research source"
    },
    {
      "title": "Your speech is slurred or intelligible.",
      "content": "Your speech is slurred or intelligible. Drinking a lot of alcohol can impact your ability to communicate properly—you might find yourself losing focus while speaking, or end up rambling on about something confusing. If you’re unable to hold a regular conversation, it’s likely time to cut yourself off. [23] X Research source The next time you purchase or order alcohol, start off with 1 serving of alcohol and see how you feel. Here’s a handy guide to reference when you’re shopping or speaking with a bartender: Beer (5%): 12 fl oz (0.35 L) Malt liquor (7%): 8 to 10 fl oz (0.24 to 0.30 L) Wine (12%): 5 fl oz (0.15 L) Fortified wine (17%): 3 to 4 fl oz (0.089 to 0.118 L) Liqueur or cordial (24%): 2 to 3 fl oz (0.059 to 0.089 L) Hard liquor (40%): 1.5 fl oz (44 mL)"
    },
    {
      "title": "You’re feeling unbalanced.",
      "content": "You’re feeling unbalanced. When you’re really drunk, you might find yourself stumbling into the objects around you (like furniture) or having difficulty walking in a straight line. Signs of intoxication also include swaying in place, feeling unbalanced on your feet, and falling to the ground. If you’re having trouble moving properly or staying coordinated, it’s probably time to pause your drinking. [24] X Research source When you’re really drunk, you might also have trouble completing simple tasks like getting money out of your wallet or opening a door."
    },
    {
      "title": "Your behavior is noticeably over-the-top and/or out of character.",
      "content": "Your behavior is noticeably over-the-top and/or out of character. Maybe you’re a little more aggressive or argumentative than you usually are, or you’re especially grumpy, loud, or disorderly. Behaving poorly is a key sign that you’ve had too much to drink, and that it’s time to cool off. [25] X Research source Drowsiness, a lack of focus, confusion, rudeness, and extra friendliness are all possible behavioral cues that you could be drunk."
    },
    {
      "title": "You’re showing signs of alcohol poisoning.",
      "content": "You’re showing signs of alcohol poisoning . This occurs when you drink too much alcohol in a short period of time. If you’re experiencing alcohol poisoning, you may feel confused and may have difficulty staying awake. You might also experience physical symptoms like vomiting, seizing, breathing extremely slowly (less than 8 times in a minute), pale or blue-tinted skin, and hypothermia. Call emergency services if you suspect that you (or someone you’re with) has alcohol poisoning. [26] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Alcohol poisoning can be life-threatening, so it’s important to get medical assistance right away."
    }
  ]
}