{
  "url": "https://www.wikihow.com/Start-a-Fight",
  "title": "How to Start a Fight",
  "steps": [
    {
      "title": "Decide where your line is and draw it.",
      "content": "Decide where your line is and draw it. Some things aren't fight-worthy, but everyone's line is different. Your brother stole your toy? Your date forgot what time you were supposed to meet? The guy next to you at the bar keeps saying crude things about a woman? Certain things are grounds for speaking up, but certain things are better to let slide. Where is your line? What must someone do to cross it? Decide if you're \"fighting the good fight,\" or if you're just being petty. If you feel like someone else's behavior is going to seriously affect your emotional or physical well-being, or is uncalled for and seriously unnecessary, speak up. Any time you're threatened with emotional or physical abuse is over the line. You need to get out of the situation and seek help immediately, if you feel endangered by someone. The offending behavior must stop, either by leaving or your putting an end to it."
    },
    {
      "title": "Remain calm when people cross your line.",
      "content": "Remain calm when people cross your line. Stupid fights happen when you allow yourself to be baited into an emotional reaction, which usually results in an overreaction. Anytime someone starts pushing your buttons and crossing your lines, take a step back. Take a deep breath. Calm down, before you do anything else, so you'll be able to react smartly. This is what bullies want to get from you: a reaction. If you don't allow yourself to be goaded into throwing a dumb punch, or acting irrationally, you won't be involved in fights that don't need to happen."
    },
    {
      "title": "Evaluate the situation.",
      "content": "Evaluate the situation. Who is provoking you and what is their intention? Can they tell that they're causing offense? Are they trying to get a rise out of you? It's important to try to figure out what's going on, so you don't act stupidly and cause an argument that doesn't need to be caused. If you're provoked by a stranger, bully, or even an acquaintance who's just being mean, it's especially important to remain calm, but to speak up for yourself. Don't launch into a screaming match, or it's likely to escalate beyond your control. If you're provoked by a family member, coworker, partner, or loved one, you might feel your inhibitions lowered slightly and be more inclined to yell, or to react emotionally. It's even more important in these cases to take a step back. Calm down and figure out what's making you angry before you respond."
    },
    {
      "title": "Use your words first.",
      "content": "Use your words first. The first thing you should do in any situation is speak. \"Starting a fight\" shouldn't be your goal. \"Solving a problem\" should be. Whether or not that escalates to a physical confrontation will depend upon the severity of the situation, the people involved, and what is said next. But, it has to start with talking, whatever the situation, and whoever is involved."
    },
    {
      "title": "Get back up, if necessary.",
      "content": "Get back up, if necessary. If you're outnumbered, or in an extremely hostile environment, don't try to enter into a fight by yourself. In some situations, you can't win. In others, it's important to have witnesses present, so nobody will be able to accuse either party of lying later, if things turn ugly. Witnesses are very important for serious fights. If you're in the workplace, or at school, or even at home, it's important to have someone else around so everyone will be able to agree on what happened later. It's good to have someone who's able to break things up, if the fight should escalate beyond what you had anticipated, or who'll be able to contact the authorities for you."
    },
    {
      "title": "Avoid all fights, if possible.",
      "content": "Avoid all fights, if possible. Usually, you can defuse a situation with your smarts, before you have to worry about \"winning\" an argument or defending yourself in a physical fight. If you can remain calm, and keep a cool head in a heated situation, you'll be far better off than the other person. Never under any circumstances should you be the one who picks and who instigates fights without proper cause. That's what a bully does and it's physical assault, and prosecutable."
    },
    {
      "title": "Say what you need to say, calmly.",
      "content": "Say what you need to say, calmly. Confront the person who is bothering you as calmly, and as concisely as possible, and say what you need to say. If someone is bothering you, tell them to stop, in as few words as possible. Stand up, make eye contact, and say, \"I need you to stop that now. Ok?\" If you bring up something that you think might turn into a local vocal argument, and you want to learn to do it calmly and safely, it's important to establish the grounds of the argument, \"I'm a little upset, but I'm not angry. I think we need to talk about this, and it might take a while.\" Read this article for more information about having safe arguments in a relationship."
    },
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. It's important to establish yourself in any kind of confrontation, to let the other person know that you're serious and not messing around. Avoiding eye contact will make aggressors think they'll be able to bully you further, but making eye contact shows confidence and seriousness. If people think they'll be able to intimidate you Lots of fights can be ended with a good stare down and a few words. Lock eyes and say, \"You can stop that now,\" or, even more simply, \"Stop.\""
    },
    {
      "title": "Keep it focused on yourself.",
      "content": "Keep it focused on yourself. Use \"I\" statements, if you have more to say in your argument. It's important to keep things focused on your own feelings, or the other person will feel attacked, and things are likely to escalate in an ugly way. You should try to avoid this if at all possible. [1] X Research source Instead of saying, \"You are such a nagger\" or \"You're being a huge jerk to that woman\" or \"You stole my toy,\" focus on yourself. Say, \"I'm feeling really unappreciated and picked on unfairly. Can we talk about it?\" or say, \"I don't think she needs to be talked to like that, and I don't want to listen to it\" or say, \"That's my toy. I'd like it back.\" Don't just to criticizing or to whining. It's important to stay as calm as possible, and you'll give yourself much more credibility and seem more intimidating as well. If people see you're not reacting because you're upset, it'll mean more. [2] X Research source"
    },
    {
      "title": "Put the ball in the other person's court.",
      "content": "Put the ball in the other person's court. A good way to end a fight at the argument stage is to give the other person a choice. If your friend won't stop making fun of you for something, or your partner keeps prodding at you with the same annoying tic, make yourself clear and then give them a choice. Say, \"I need you to know that if you don't stop doing that, this is over. You have this chance. If you do that one more time, I'm gone.\" Follow through with action if you have to. If you threaten to do something if they don't stop, and they don't stop, you need to do it."
    },
    {
      "title": "Be the adult in the room.",
      "content": "Be the adult in the room. When confronted, lots of aggressors and instigators and bullies will rely on tried-and-true juvenile tactics. They'll laugh at you for being serious. They'll shout. They'll mock you. They'll try to do anything to get you to over-react. It's extremely important to remain calm. Imagine you've got an impenetrable bubble around yourself, and expect they'll say something offensive. Don't let yourself get baited. Someone might bring up something that has nothing to do with what you're talking about, digging up dirt from the past, or brag about themselves, or say ridiculous things like, \"Who do you think you are?\" Don't respond to any of this. Stick to your original statement, repeating \"I need you to stop. Now.\" If someone flies off the handle at work and acts irrationally, give them a few minutes to rethink. If your boss freaks out about something small, stand up and say, \"I'm going to go outside and wait in the hallway. When you're calm, we can talk. I'd like to be spoken to like an adult.\" [3] X Research source"
    },
    {
      "title": "Stop talking.",
      "content": "Stop talking. Most arguments get to a point where there's little point in continuing to say the same things over and over and over again. If you've said what you needed to say, leave it alone, and consider talking about it when both parties have a chance to cool down. It's especially important to walk away if you feel yourself getting angry to the point of boiling over. Know when to walk away and leave the argument."
    },
    {
      "title": "Never start a physical fight if you can help it.",
      "content": "Never start a physical fight if you can help it. Picking a physical fight is never recommended, and physical fighting should only happen if you have no other choice. If you are physically threatened, getting out of the situation and escaping is the best thing you can do. If you absolutely have to defend yourself physically, you can learn to do so with strength and intelligence, to end it as quickly as possible, but never, under any circumstances, should you pick a fight. Picking a fight with someone is technically assault. If you want to fight for sport, or just to get out some aggression, take a boxing class , or train at an MMA gym . If you're confronted by an aggressor, however, and need to defend yourself, it is sometimes better to throw the first punch and attempt to end it quickly. Action is usually quicker than reaction, so have an offensive mindset and be ready to hit first instead of blocking. If you have the element of surprise on your hands, it's more likely you'll be able to end the fight on your terms."
    },
    {
      "title": "Maintain a defensive posture.",
      "content": "Maintain a defensive posture. If it comes to fighting, defend yourself with the right posture. It's important to keep your knees bent and your weight forward, to keep yourself balanced and movable. If you stand flat-footed and flush with your opponent, you're going to get knocked down. Flex your knees and turn sideways very slightly with your hips, turning your non-dominant or non-punching side toward your opponent. Step forward with your non-dominant foot. Raise your hands, fists balled loosely but not so tightly you cut off blood flow. Put your non-dominant hand forward slightly, up near your eye, and your punching hand next to the side of your face. Keep moving, hopping around, and bouncing on the balls of your feet. Don't allow yourself to become a target by just standing there. If you stand flat-footed, you're going to get punched in the face, and lose."
    },
    {
      "title": "Learn to throw a punch properly.",
      "content": "Learn to throw a punch properly. First, ball your fist properly by wrapping your thumb around the bottom of your fingers, like you had a bug inside your hand you wanted to keep. Keep your elbows tucked in and think about your punches as straight lines, not as wild curves. You want your fist to shoot straight out from your body, which will be more powerful than a wild haymaker. [4] X Research source When you strike, shoot your fist straight out from your body, using short, compact strikes that will be full of power. Take a step forward when you punch with your dominant hand, to put more power into it. Aim for the nose, the stomach, the kidneys, just under the floating ribs, and just under the jaw. Don't punch someone in the side of the head or you're going to break your knuckles. Punching at the eye or throat can damage your opponent seriously. Aim at these parts only if you are really fighting to save your life. Use other limbs, as well. Kicks, elbows, head-butts, and knees are all effective strikes that you should use if you must to end the fight as quickly as possible."
    },
    {
      "title": "Move into punches",
      "content": "Move into punches . If you get into a fight, your instinct will usually be to move backwards, but you need to learn to resist this urge and move into punches. If you think you're about to get hit in the head or the face, tense your jaw and neck muscles, and keep yourself moving forward as much as possible. If you're moving backward, you're more likely to get knocked down, and for the punch to hit you at the apex of its power, rather than just before."
    },
    {
      "title": "End it as quickly as possible",
      "content": "End it as quickly as possible . A stiff punch to the underside of the jaw, or knocking someone's wind out with a stiff shot to the gut should end most fights. Most people don't want to brawl. Try to end a fight as quickly as possible and move on, before it gets too ugly. If someone gets knocked down, the fight should be over. End the fight by being the one to walk away, and be the one to call the cops if necessary. Tell the truth."
    },
    {
      "title": "Stay off the ground",
      "content": "Stay off the ground . Getting into a physical altercation isn't MMA. Your goal isn't to \"ground and pound.\" It's important to keep these fights as short and as safe as possible, relatively speaking, and you don't want to allow yourself to be taken down, under any circumstances. If you keep fighting someone once they've fallen, that's assault. [5] X Research source If somebody tries to take you down, spread your legs and keep your base as wide as possible. Shift out of the way, if possible. If you fall down, you need to protect your face and try to get up as soon as possible. Fighting on the ground makes you vulnerable to all kinds of chokes and punches."
    }
  ]
}