{
  "url": "https://www.wikihow.com/Treat-Eyebrow-and-Eyelash-Lice",
  "title": "How to Treat Eyebrow and Eyelash Lice",
  "steps": [
    {
      "title": "Visit your doctor for ophthalmic-grade petrolatum to treat the lice.",
      "content": "Visit your doctor for ophthalmic-grade petrolatum to treat the lice. One of the easiest ways to treat body lice in your eyebrows and eyelashes is with petroleum jelly. However, since over-the-counter brands can irritate your eyes, it's important to visit your doctor to get a prescription for petrolatum that's safe to use in the eye area. [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Your doctor will probably advise you to apply the ointment to the margins of your eyelids (near the lashline) twice a day for 10 days. The ointment commonly used for this purpose is called Lacri-Lube. It contains a combination of petrolatum and mineral oil. Since body lice are frequently spread through sexual contact, your doctor may also want to run tests for other STIs that you may have contracted."
    },
    {
      "title": "Apply the petrolatum with a cotton swab each night before bed.",
      "content": "Apply the petrolatum with a cotton swab each night before bed. Dip the end of a cotton swab in the petrolatum, then spread it generously over your eyebrows and eyelashes. This will suffocate the lice and their nits as you sleep. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try to sleep on your back so the petrolatum doesn't come off on your pillow. For severe infestations, your doctor may recommend that you do the treatment up to 2 times a day for 10 days."
    },
    {
      "title": "Wash off the petrolatum each morning.",
      "content": "Wash off the petrolatum each morning. When you first wake up, use your usual facial cleanser or a mild, tear-free baby shampoo to wash the area around your eyes and eyebrows. Remove the petrolatum completely, then pat your face dry with a soft cloth. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Be sure to wash the cloth thoroughly in hot water after you use it."
    },
    {
      "title": "Repeat this for 10 days or as long as needed.",
      "content": "Repeat this for 10 days or as long as needed. Because the petrolatum won't affect the lice eggs, you'll need to continue the treatment long enough to kill any new nits that hatch, or else the infestation will return. Ask your doctor how long you should continue treatment. Generally, they'll advise you to repeat the petrolatum regimen for about 10-14 days. [4] X Research source If you notice any lice, eggs, or nits after this, continue the treatment for an additional week, or more if you need to."
    },
    {
      "title": "Maintain good personal hygiene.",
      "content": "Maintain good personal hygiene . Good hygiene is one of the best ways to combat body lice. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Shower or bathe daily and wash your face and body with warm water and a gentle soap or cleanser. Change into clean clothes daily if possible, and wash your dirty laundry, bedding, and towels at least once a week. Wash these items in hot water (at least 130 °F (54 °C) and dry them on a high heat setting."
    },
    {
      "title": "Remove any visible lice with your fingernails.",
      "content": "Remove any visible lice with your fingernails. You may be able to spot adult lice just by looking in a mirror. If you can, pluck them out with your fingernails, a pair of tweezers, or a nit comb. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you only have a few body lice, removing them by hand may be all it takes to get rid of them. However, if the lice laid eggs, the infestation will continue. Wash your hands and sterilize your tweezers or nit comb by wiping them down with rubbing alcohol before you do this. A nit comb is a small plastic comb that will pull nits and eggs from your hair. You can find these at any pharmacy."
    },
    {
      "title": "Ask your doctor about using fluorescein dye strips for an eyelash infestation.",
      "content": "Ask your doctor about using fluorescein dye strips for an eyelash infestation. Apply a drop of saline to the end of the strip, then drag the end of the strip across your eyelashes to spread the dye. Then, dip a cotton swab in petrolatum and cover the dye and your eyelashes with a generous layer. In the morning, wash away the petrolatum and dye with mild baby shampoo. [7] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Fluorescein dye strips are used to diagnose abrasions on the cornea. However, they can also be used along with a petrolatum treatment to get rid of body lice on your eyelashes. [8] X Research source This treatment is typically repeated for 3 days."
    },
    {
      "title": "Try 1% mercuric oxide ointment for really severe cases.",
      "content": "Try 1% mercuric oxide ointment for really severe cases. If your doctor recommends that you use a 1% solution of yellow oxide of mercury ointment, they'll give you specific directions on how to use it. However, a typical regimen might be to use your fingers or a cotton swab to apply a thin layer of the ointment to your eyelashes and eyebrows 4 times a day for 14 days. [9] X Research source Your doctor will prescribe this ointment to you if they think it's necessary. It's very important to follow your doctor's orders precisely if you use this ointment. Otherwise, there's a risk that you could suffer adverse effects as a result of mercury toxicity. [10] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Take Ivermectin (Stromectol) if your doctor recommends treatment in pill form.",
      "content": "Take Ivermectin (Stromectol) if your doctor recommends treatment in pill form. Ivermectin is a pill that's used to treat body lice. While it's not often prescribed for cases of eyebrow or eyelash infestations, in some cases, your doctor may advise you to try it, especially if other approaches haven't worked. [11] X Research source A typical dose of Ivermectin would be 2 200 ug/kg doses, administered a week apart."
    },
    {
      "title": "Wash all of your bedding, clothing, and towels in hot water.",
      "content": "Wash all of your bedding, clothing, and towels in hot water. When you first notice that you have a body lice infestation, act quickly and wash any clothing or bedding that you've come into contact with in at least the previous 2 days. Wash the items in hot, soapy water that's at least 130 °F (54 °C). [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Dry the items in the dryer on high heat for at least 20 minutes."
    },
    {
      "title": "Seal any unwashable items in a bag for 2 weeks.",
      "content": "Seal any unwashable items in a bag for 2 weeks. If you have any clothing or items that might be infected that can't be placed in the washing machine, place them in a resealable plastic bag and squeeze out as much of the air as you can. Leave the item in the bag for 2 weeks to ensure all the lice and nits are killed, including any new ones that hatch during that time. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source After all the lice and eggs are dead, shake out the item thoroughly to remove them. You can also send the items for dry-cleaning, but as a courtesy, it's a good idea to let the staff know that the objects are contaminated with body lice. That way, they can take steps to ensure other items in their shop aren't exposed to the lice."
    },
    {
      "title": "Avoid sharing clothes or bedding with other people.",
      "content": "Avoid sharing clothes or bedding with other people. Although most body lice infestations are spread by sexual contact, it may be possible to spread them by sharing towels, clothes, or other items. To ensure the lice don't come back, be very mindful of not sharing these items with others. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Vacuum your furniture and floors frequently.",
      "content": "Vacuum your furniture and floors frequently. Someone infected with body lice can shed the lice or eggs on furniture or floors, allowing the infestation to spread or to return after treatment. If someone in your home has a body lice infestation, thoroughly vacuum any areas they might have come into contact with. In addition to vacuuming floors, carpets, and furniture, it’s also a good idea to vacuum pillows or cushions the infected person has used."
    },
    {
      "title": "Avoid close physical contact with anyone who might have body lice.",
      "content": "Avoid close physical contact with anyone who might have body lice. The main way to spread body lice is through close physical contact, especially sexual contact. Because of this, avoid having sexual contact with the person you believe transmitted the lice to you until you know they have been treated as well. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source In general, it's best to avoid having sex with a partner who also has other partners. They'll be at an increased risk of STIs, including body lice."
    }
  ]
}