{
  "url": "https://www.wikihow.com/Wrap-an-Ankle",
  "title": "How to Wrap an Ankle",
  "steps": [
    {
      "title": "Start at the ball of the foot.",
      "content": "Start at the ball of the foot. Hold one end of the ace bandage against the ball of the foot, with the tail of the bandage extending past the outside of the foot, rather than the inside. Keep the tail rolled so that you can unroll it as you go, rather than dealing with an unwieldy long piece as you're trying to wrap. For extra support, you can place a gauze pad on either side of the ankle before wrapping. Horseshoe-shaped padding cut from foam or felt is also used for extra stability in compression wraps."
    },
    {
      "title": "Wrap the top of the foot.",
      "content": "Wrap the top of the foot. Use one hand to hold the end of the bandage against the ball of the foot. Bring the bandage over the foot, from outside to inside, then under the foot for a second wrap. Wrap the foot a total of three times, overlapping each wrap by half. [1] X Research source Board-certified podiatrist Catherine Cheung recommends \"not wrapping your ankle too tightly. You don't want to cut off any circulation or cause any more pain than what you're dealing with already.\" Your body needs to swell in order to send nutrients and healing properties down to your ankle to stabilize it. [2] X Research source Catherine Cheung, DPM. Podiatrist. Personal interview. 12 May 2020. Each loop of the wrap should be lined up evenly, rather than going in different directions. Start over if you need to do the job more neatly."
    },
    {
      "title": "Wrap the ankle.",
      "content": "Wrap the ankle. After the third wrap, bring the bandage over the top of the foot, around the inside of the ankle, behind the ankle to the other side, and back over the instep and under the foot. The bandage should be woven over the foot and ankle in a figure 8, with the heel exposed. [3] X Research source"
    },
    {
      "title": "Repeat the figure 8.",
      "content": "Repeat the figure 8. Make two more figure 8s, each time overlapping the bandage by half. When you're finished, the bandage should cover the entire foot and extend up past the ankle. [4] X Research source Smaller feet and legs may not require three full figure 8s with a full-sized ace bandage. Use your judgement to decide whether the wrap looks stable after 2 figure 8s. Ask the person how the wrap feels after you're finished winding the bandage. If he or she complains that it's too tight, start over."
    },
    {
      "title": "Fasten the bandage.",
      "content": "Fasten the bandage. Stretch the last segment of the bandage a bit and use the small metal prongs or velcro adhesive to secure the end of the bandage in place. Make sure the wrapping job is free of unnecessary lumps or bulges; it should be comfortable and neat. Remove the bandage if the toes on the foot turn white or feel numb or tingly. The bandage may be worn for a number of hours and during physical activities, or as recommended by the doctor. It should be removed twice a day to allow the blood in the foot to circulate freely."
    },
    {
      "title": "Wrap the foot and ankle with underwrap.",
      "content": "Wrap the foot and ankle with underwrap. Start at the ball of the foot and wind the underwrap around the foot and up to and around the ankle, stopping a few inches above it. The heel may be left exposed."
    },
    {
      "title": "Create an anchor.",
      "content": "Create an anchor. Wind the athletic tape around the top of the underwrap, a few inches above the ankle. Use a scissors to cut the tape and overlap the end with the starting point to make sure the tape stays in place. This is called the anchor because it forms the foundation for the rest of the tape wrap. [5] X Research source Don't wind the tape too tightly. It should be secure, but comfortable. You may want to use more than one piece of tape for the anchor to make sure it stays in place."
    },
    {
      "title": "Form the stirrup.",
      "content": "Form the stirrup. Align the tape with the outside of the ankle. Place the end of the tape on the stirrup, then wind it under the foot and up to the other side of the ankle. Secure it on the other side of the anchor. Repeat with two more pieces of tape that slightly overlap each other. This forms a stirrup, which helps keep the ankle stable during movement. [6] X Research source"
    },
    {
      "title": "Stabilize the foot and ankle with an \"x.\"",
      "content": "Stabilize the foot and ankle with an \"x.\" Place the end of the tape at the ankle bone and extend it diagonally over the top of the foot, then wind it under the arch of the foot and toward the inside of the heel. Bring it around the heel and run it diagonally over the top of the foot to complete the \"x.\""
    },
    {
      "title": "Finish the tape wrap with three figure 8s.",
      "content": "Finish the tape wrap with three figure 8s. Place the end of the tape on the outside of the ankle. Wind it over the top of the foot, bring it under the arch, back over the other side of the foot, and around the ankle. Repeat this figure 8 shape a total of 3 times, overlapping the tape a bit each time. [7] X Research source Make sure the tape wrapping is comfortable for the person wearing it. If it pulls at the skin or hair, you may need to start over. The tape wrap may be worn all day and during physical activity. It should be changed when it becomes dirty. Remove the wrap if the toes turn white or a numb or tingly sensation is felt."
    },
    {
      "title": "Decide which way to wrap it.",
      "content": "Decide which way to wrap it. Both wrapping techniques have pros and cons, and the one you choose should be informed by your reason for wrapping the ankle. In general, board-certified podiatrist Catherine Cheung suggests \"using a soft, pliable wrap or strap. That way if your body needs to swell, your ankle wrap won't be too constricting.\" Here are some other factors to take into consideration when making your choice: Ace bandages are used to make compression wraps. They are made from stretchy fabric that many find to be comfortable against the skin. They are secured with metal fasteners, or you can buy adhesive wraps that use velcro or glue to keep the wrap in place. Ace bandages are conveniently reusable, so they're a good choice for people who need to wrap frequently. Athletes may find ace bandages to be cumbersome when worn during physical activity. They create a bulky padding around the ankle that can make it more difficult to run and jump. A wrap constructed from tape includes a bottom layer of underwrap, which protects the skin from getting pulled too much by the tape, and a layer of tape that is adhered to the underwrap in a pattern that supports the ankle. Tape is not reusable, so it can get expensive for people who need to wrap every time they perform a physical activity. The underwrap protects the skin somewhat, but a little pulling usually takes place. Tape feels lighter on the body, so many athletes prefer it to using an ace bandage when the wrap is intended to support the ankle during physical activity."
    },
    {
      "title": "Prepare the ankle for the wrap.",
      "content": "Prepare the ankle for the wrap. Make sure the ankle and foot are clean and dry. Extend the leg and rest the ankle on a chair or bench to make the wrapping procedure easier. If tape will be used, it's advised to shave the hair from the bottom section of the leg and ankle."
    }
  ]
}