{
  "url": "https://www.wikihow.com/Unwarp-a-Pan",
  "title": "How to Unwarp a Pan",
  "steps": [
    {
      "title": "Check the warranty.",
      "content": "Check the warranty. Many pans (especially higher end cookware) will come with a warranty that may cover warping. If your pans came with a warranty, double check the conditions. You may be able to receive a replacement, and save yourself the trouble of flattening. [1] X Research source"
    },
    {
      "title": "Cut a piece of wood to match the diameter of your pan.",
      "content": "Cut a piece of wood to match the diameter of your pan. In order to repair the warping of your pan, you are going to need a piece of wood. Purchase a 2 X 4 (45 X 90 mm) from your local hardware store, and cut to it to fit the diameter of your pan. [2] X Research source You can use either a circular saw or regular handsaw to cut your 2 X 4 to length. Many hardware stores will cut 2 X 4's to length for you. Inquire about this at the store. Always wear safety goggles when cutting wood. If your pan has bowed outwardly, the piece of wood can be a bit longer than the pan. If your pan had bowed inwardly, the piece of wood must sit inside the pan."
    },
    {
      "title": "Heat up your pan.",
      "content": "Heat up your pan. Place your pan on the stove on medium to medium-high heat. Wait 15-20 minutes, allowing the pan to get very hot. Taking care not to burn yourself, use a pot holder to remove the pan from the stove. [3] X Research source"
    },
    {
      "title": "Place the pan on a durable surface.",
      "content": "Place the pan on a durable surface. Set the hot pan down someplace sturdy and durable, with the bowed side facing up. If the pan is bowed outwardly, you have to rest the lip of the pan on a flat surface without allowing the handle touch the surface. A stair or the bench of a picnic table can work. [4] X Research source"
    },
    {
      "title": "Place the wood on the bowed side of the pan and beat the wood.",
      "content": "Place the wood on the bowed side of the pan and beat the wood. Position your piece of wood across the center of the pan’s crown (the place where it is most bowed). Use a mallet to bang on the piece of wood repeatedly. When the pan has cooled, it is time to stop. [5] X Research source"
    },
    {
      "title": "Repeat this until the pan is flat.",
      "content": "Repeat this until the pan is flat. Return your pan to the stove top and reheat it. Then move it to a sturdy location, position the wood, and continue banging on it. It may take 3 to 4 rounds of this for you to see improvement in your pan. [6] X Research source Straightened pans will warp more easily than those which were never warped. Your pans will wear out from repeated warping and straightening, and will eventually need to be replaced."
    },
    {
      "title": "Purchase high quality cookware.",
      "content": "Purchase high quality cookware. Unfortunately, cheap pans are the most likely to warp. Look into higher quality cookware, and select pans that have a warranty. If you want to prevent your pans from warping, you need to choose cookware that has good heat conductivity. You’ll also want something durable. [7] X Research source Copper pans are known to have the best heat conductivity. Cast iron pans take longer to heat up, but are very durable and unlikely to warp. Stainless steel pans can be stylish and durable, but these pans are the most likely to warp."
    },
    {
      "title": "Heat up your pans gradually.",
      "content": "Heat up your pans gradually. Warping comes as the result of rapid temperature changes. You can protect your pans and help them to last longer by heating them up gradually. If you need to cook something on high (or even medium) heat, start by heating your stove to low. Allow the pan to heat up a little, then increase the temperature setting on your stove a couple of notches every few minutes."
    },
    {
      "title": "Avoid running hot pans under cold water.",
      "content": "Avoid running hot pans under cold water. Rapidly dropping temperatures can also cause pans to warp. Most commonly, pan warping occurs when you run a hot pan under cold water. Never do this to your pans! Allow your pans to cool off completely before adding them to water. If you have been cooking at a very high heat, you may want to bring it down to medium, and then low, before allowing to pan to cool naturally to room temperature."
    }
  ]
}