{
  "url": "https://www.wikihow.com/Use-Henna-on-Gray-Hair",
  "title": "How to Use Henna on Gray Hair",
  "steps": [
    {
      "title": "Choose red henna.",
      "content": "Choose red henna. Henna comes in many different colors. Red henna may work best on gray hair, as it provides heavy coverage. When applied to gray hair, henna will give your hair a natural reddish shade with a few hints of orange. Make sure that the henna powder you are buying is natural, not artificial. It usually has a greenish color."
    },
    {
      "title": "Mix a paste with henna.",
      "content": "Mix a paste with henna. You'll need to mix henna into a paste to use. The paste is made with henna and warm water. Henna comes in packs and the number of packs you'll need to use depends on your hair type. Shoulder length hair only requires a single pack. If your hair goes down to your mid-back, go for two packs. If your hair goes down to your waist, go for 3 packs. Use a quart size bowl and pour in your pack or packs of henna. Henna stains surfaces easily, so make sure to wear old clothing and cover the surface you're working on. [2] X Research source Add hot tap water of approximately 120 °F (48.9 °C). Add water in small amounts while mixing the henna. There is no precise amount of water to use. Just use enough that the henna mixture forms a paste."
    },
    {
      "title": "Wash your hair.",
      "content": "Wash your hair. You'll want to make sure your hair is clean before adding henna. This assures that no dirt or debris will get trapped in the mixture. Plus, henna works better if the hair is not grimy or oily. Wash your hair as normal before applying henna."
    },
    {
      "title": "Towel dry your hair.",
      "content": "Towel dry your hair. After you've washed your hair, towel dry it. There is no need to dry your hair completely with a blow dryer before applying henna. In fact, as henna dries out hair itself, it's a good idea to apply henna to damp hair."
    },
    {
      "title": "Section your hair.",
      "content": "Section your hair. You'll need to section your hair, which means dividing it into roughly equal sections and securing them with clips. You'll apply the paste to one section at a time. How many sections you need depends on your hair length. With shorter hair, you may be able to get by with only two sections. Longer hair may need four or five sections. Remember, henna can stain. It's a good idea to use cheap clips you're not attached to when sectioning your hair. You could also use plastic hair clips, which can easily be washed later. [3] X Research source"
    },
    {
      "title": "Apply henna directly with gloved hands.",
      "content": "Apply henna directly with gloved hands. Unclip one section and begin to work. You will apply the henna directly to your scalp one section at a time. For best results, put on a pair of plastic gloves and use these to apply henna. Scoop up some paste and work it into each section of hair. Go from root to tip. Make sure each section is saturated in the henna mixture. When you're done with one section, re-clip that hair. Touch up around the roots with a bit of henna. Then, move on to the next section and repeat the process."
    },
    {
      "title": "Leave in for one to two hours.",
      "content": "Leave in for one to two hours. You should leave the mixture in for one to two hours. One hour is usually sufficient, but color may deepen slightly if you leave the mixture in for two hours. Hair is unlikely to deepen further after two hours, so do not leave the henna in longer than this."
    },
    {
      "title": "Rinse and blow dry your hair.",
      "content": "Rinse and blow dry your hair. After letting the henna set, rinse your hair. Do not use shampoo. Make sure you get all the mixture out of your hair, which may take awhile. Once done, blow dry your hair for 10 to 15 minutes. You should see a noticeable difference in color."
    },
    {
      "title": "Do not shampoo for 24 hours.",
      "content": "Do not shampoo for 24 hours. You need to let the color set. If you shampoo prematurely, your color may fade. Do not shampoo your hair for at least 24 hours after applying the henna."
    },
    {
      "title": "Make a paste with a quarter pack of henna.",
      "content": "Make a paste with a quarter pack of henna. Henna fades with time and eventually gray roots will develop. You'll need to color the roots and touch up the rest of your head. You'll need to make more henna paste. You should be able to get by with a quarter of a pack of henna. As with the first mixture, use hot tap water that's roughly 120 degrees. There is no exact amount. Simply add tap water until you form a thick paste with the henna powder."
    },
    {
      "title": "Apply directly to your roots.",
      "content": "Apply directly to your roots. First, use gloved hands to apply a layer of henna directly to your roots. Work from the root of the grayed hair to the end of the gray section. Make sure to saturate the gray hair. You should have a bit of paste left over after touching up your roots."
    },
    {
      "title": "Wait one hour and rinse with water.",
      "content": "Wait one hour and rinse with water. Let the mixture sit for an hour to let the color set. Then, rinse out your hair with water. Do not use shampoo. Make sure to get all the henna out of your head"
    },
    {
      "title": "Apply the remaining paste to the rest of your hair.",
      "content": "Apply the remaining paste to the rest of your hair. From here, add a light covering of the henna powder to the rest of your hair. Once again, use gloves to work in the paste. You will not have as thick coverage, as you're using less paste. You're not changing your hair color completely, but just darkening the existing color to match the roots."
    },
    {
      "title": "Rinse.",
      "content": "Rinse. Once you're done, rinse out your scalp. Do not use shampoo. Your hair should now be a reddish shade again. It's a good idea to wait to shampoo for 24 hours again."
    },
    {
      "title": "Test a small strand first.",
      "content": "Test a small strand first. It's a good idea to test the henna paste on a small strand of hair before dyeing all your hair. This way, you'll get a chance to see if you like the color. Some hair may also react poorly to henna dye, so you want to make sure your hair does not dry out too much. Choose a stand from the back of your head, which you can easily cover up with other hair, and dye this with the henna paste. As you would when dyeing your whole scalp, leave the paste in for one to two hours. Then, rinse out your hair."
    },
    {
      "title": "Make sure you don't have a skin allergy.",
      "content": "Make sure you don't have a skin allergy. Henna can cause skin allergies for some, so you want to make sure your skin can tolerate henna before use. Pour some paste on a small patch of skin and rinse off. Wait a day. If you notice any adverse reactions, like redness or swelling, it's probably a bad idea to dye your hair using henna."
    },
    {
      "title": "Wait a month to use henna if you've recently used commercial hair dyes.",
      "content": "Wait a month to use henna if you've recently used commercial hair dyes. Henna can react poorly with commercial dyes. If you've recently dyed your hair with a chemical product, wait at least a month before using henna paste in your hair."
    },
    {
      "title": "Be careful not to get henna in your eyes and mouth.",
      "content": "Be careful not to get henna in your eyes and mouth. Henna should not be ingested and it should not get in your eyes. Make sure you keep henna away from your eyes and mouth when dyeing your hair. In the event henna gets into your eyes, flush with cool water. If irritation continues after flushing your eye, make an appointment with a physician."
    }
  ]
}