{
  "url": "https://www.wikihow.com/Wallpaper-a-Room",
  "title": "How to Wallpaper a Room",
  "steps": [
    {
      "title": "Turn off the electricity and remove wall plates with a screwdriver.",
      "content": "Turn off the electricity and remove wall plates with a screwdriver. To protect the outlets and yourself, it's best to remove the panels to ensure for a clean-looking paper installation, and to tape over the outlets to protect them. Put small pieces of tape over the outlets and switches, enough to cover them. Since you'll use water to activate the wallpaper glue, it's necessary to turn off the electricity in the room or you risk dangerous electrocution, or ruining the outlets. Make sure to turn off the electricity."
    },
    {
      "title": "Remove old wallpaper, if necessary",
      "content": "Remove old wallpaper, if necessary . Begin stripping sections of the paper off to get a sense of what variety of wallpaper you're dealing with (self-adhesive is much easier to remove) and use a putty knife if necessary to get it started. Peel all the paper off carefully, getting as much of it off the wall as possible, and scraping away any remaining adhesive underneath. [1] X Research source Save a substantial amount of time to remove the wallpaper. This can take a much longer time than putting up new wallpaper, so don't save it all for one day or you'll end up frustrated. If the wallpaper is older, it may be more tenacious and require that you use a belt sander to help remove the wallpaper and adhesive, depending on the wall underneath."
    },
    {
      "title": "Clean the walls thoroughly.",
      "content": "Clean the walls thoroughly. Start by cleaning the walls with a regular household cleaner and letting it dry thoroughly before inspecting the walls for mildew. It's very important to eradicate any mildew before hanging wallpaper, since wallpapering over existing mildew will cause it to spread. Remove any mildew you find with a mixture of 2 cups (.473 l) bleach per 1 gallon (3.785 l) of water."
    },
    {
      "title": "Smooth any cracks in the wall.",
      "content": "Smooth any cracks in the wall. While you've got the chance, it's best to smooth up the wall before you paper over it. Apply wall putty to any cracks or holes in the wall with a putty knife, then wait for it to dry. Afterward, sand it smooth with fine-grit sandpaper."
    },
    {
      "title": "Prime the walls with a stain killer/primer",
      "content": "Prime the walls with a stain killer/primer . Paint the primer on evenly with a brush before you install wallpaper. The primer will help the paper adhere to the walls more effectively and will provide a solid foundation for your wallpaper. [2] X Research source"
    },
    {
      "title": "Draw guidelines on the wall.",
      "content": "Draw guidelines on the wall. Measure a distance that's 2 inches (5.08 cm) shorter than the width of the paper on the wall next to the doorway. Mark this spot lightly with a pencil. Use a carpenter's level and pencil to draw a vertical line from the ceiling to the floor bisecting your mark. You will use this line as a starting point when hanging wallpaper. [3] X Research source"
    },
    {
      "title": "Cut a length of the wallpaper 4 inches (10.16 cm) longer than the wall.",
      "content": "Cut a length of the wallpaper 4 inches (10.16 cm) longer than the wall. Apply wallpaper paste to the back of the paper, or if using pre-pasted wallpaper, follow the manufacturer's directions to hang appropriately. Scissors are perfectly appropriate for cutting wallpaper."
    },
    {
      "title": "Line up the paper with the line you drew on the wall.",
      "content": "Line up the paper with the line you drew on the wall. Begin at the ceiling, leaving about 2 inches (5.08 cm) hanging over the top and below the floor. Carefully line up the wallpaper and press firmly into the wall to secure it."
    },
    {
      "title": "Flatten the paper with a wallpaper brush.",
      "content": "Flatten the paper with a wallpaper brush. To wallpaper a room properly, you need to eliminate wrinkles as thoroughly as possible, or the wallpaper will look uneven and bubbly. Smooth the paper from the middle out, using enough pressure to force the bubbles out through the edges. If you do create some wrinkles inadvertently, carefully pull a piece of the paper away from the wall until you reach the wrinkle, and press it out slowly."
    },
    {
      "title": "Continuing hanging around the room, matching the pattern appropriately.",
      "content": "Continuing hanging around the room, matching the pattern appropriately. Align the next piece to the first piece. When hanging wallpaper, it's important to match the patterns together as closely as possible, if you're using patterned wallpaper. To line them up, start at a middle point to get them as close as possible and trim off the excess at the top and bottom. Trim the top and bottom of each piece of paper. When you install wallpaper, be careful not to tear it. Use a putty knife to press the paper tight against the wall, and cut the extra off with a razor blade."
    },
    {
      "title": "Use a seam roller on each wallpaper seam.",
      "content": "Use a seam roller on each wallpaper seam. When you wallpaper a room, you want to ensure you have enough adhesive on the seams to prevent the paper from peeling, so be very careful not to push too hard and squeeze out the glue or adhesive underneath. [4] X Research source"
    },
    {
      "title": "Clean up the seams.",
      "content": "Clean up the seams. Wipe off the excess glue with a wet sponge after letting the wallpaper set for at least 15 minutes, then make sure the seam points are clean and without unsightly excess glue."
    },
    {
      "title": "Determine how much wallpaper you'll need to wallpaper a room.",
      "content": "Determine how much wallpaper you'll need to wallpaper a room. Measure the height of each wall from the floor to the ceiling and the length of each wall with a measuring tape. If the walls are square, you can add the lengths of the wall together, then multiply this number by the height of the walls to calculate the total area. [5] X Research source At the store, read the total area each roll of wallpaper covers and divide the area of your room by this number to estimate how many rolls to purchase. When hanging wallpaper, you will use more than the actual area of the room because you need to match the patterns on the wall, so buy extra. If you wallpaper just one wall, it can bring in a lot of character to the room and act as a focal point for the entire area. [6] X Expert Source Kanika Khurana Interior Designer Expert Interview. 9 October 2020."
    },
    {
      "title": "Choose the right kind of texture for the room.",
      "content": "Choose the right kind of texture for the room. Wallpaper comes in many different materials, featuring lots of different features to consider, depending on the job and the room. Some are more difficult to hang, while some are easy for the first-time user. [7] X Research source Vinyl wallpaper is the most common variety, and is easy to hang and remove. Canvas-backed vinyl paper is moisture-resistent and versatile, making it very appropriate for hanging in bathrooms and basements. It's generally prepped with adhesive, which means it's easy to hang and handle. Embossed wallpaper is textured and patterned, making it ideal for covering the imperfections in walls. It's also easy to paint over and lined with adhesive, which means it'll be versatile for years to come. Textile-based wallpaper is more difficult to hang, because you'll have to hang with clear adhesive paste, which is more time-consuming but also gives you more control over the final product. Flocked textile wallpaper features raised patterns for a professional effect, but are difficult to clean. [8] X Research source"
    },
    {
      "title": "Choose an appropriate pattern for the room.",
      "content": "Choose an appropriate pattern for the room. While it'll take some extra time to hang, patterned wallpaper can add a unique theme to any room. If you want to buy a wallpaper with a distinctive pattern, make sure you take care to match-up the pattern and avoid clashing. You can also make the room seem larger using patterned wallpaper. [9] X Research source Use horizontal patterns to make the room seem wider. If you've got a tall and skinny room, you can make it seem cozier using horizontal patterns. Imperfectly squared rooms, however, can be affected slightly by using horizontally-patterend wallpaper, making it seem worse. Use vertical patterns to make the ceiling seem higher. If you've got low ceilings, vertical-patterning can help trick the eye. Remember that you don't have to wallpaper the entire room. If you want to try a really bold pattern, you can use it on just one accent wall. [10] X Expert Source Kanika Khurana Interior Designer Expert Interview. 9 October 2020."
    },
    {
      "title": "Choose pasted or pre-pasted wallpaper.",
      "content": "Choose pasted or pre-pasted wallpaper. In general, if you can, you'll want to get self-adhesive wallpaper, which is the easiest to install. To do so, you'll simply peel the adhesive strip off the back of the paper and press it firmly and evenly onto the wall, making it super-easy to use. Other varieties are often more involved. Pre-pasted wallpaper is similar to self-adhesive, except you need to activate the paste on the back of the paper, usually with water or another activator provided by the manufacturer. Dryback wallpaper requires that you also purchase wallpaper adhesive to use in the hanging of the paper. These types of wallpaper are often more intricate and expensive, but also more difficult to hang, especially alone."
    }
  ]
}