{
  "url": "https://www.wikihow.com/Treat-Internal-Hemorrhoids",
  "title": "A Guide to Internal Hemorrhoid Treatment",
  "steps": [
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. Water is essential to prevent constipation, which is a major cause of hemorrhoids. Make sure that you are drinking an 8 fl oz (0.24 L) glass of water about 8 times a day. If you are active or if you still feel thirsty, then drink some more. [1] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source You can also drink other types of beverages to get more fluids, such as juice, herbal tea, and sparkling water. Just try to avoid caffeinated beverages and alcohol. Beverages that contain caffeine or alcohol may dehydrate you and cause constipation."
    },
    {
      "title": "Get more fiber",
      "content": "Get more fiber . Getting enough fiber can help to make bowel movements easier and help to treat and prevent hemorrhoids. Aim for about 25 grams of fiber per day. Include more fruits, vegetables, and whole grains in your diet to increase your daily fiber intake. [2] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Beetroot is an excellent source of fiber, and is also good for your overall digestive health. Its anti-inflammatory properties may help reduce inflammation and discomfort from hemorrhoids. [3] X Research source If you do not meet your daily goal for fiber intake, then you may want to include a fiber supplement to help you reach your goal. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Exercise every day.",
      "content": "Exercise every day. Exercise can help to stimulate your digestive system, which can prevent constipation and hemorrhoids. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try taking a daily walk or riding your bike to get around town. Even little things such as parking further away from the entrance at the mall or taking the stairs instead of the elevator can help you to get more exercise throughout the day."
    },
    {
      "title": "Go to the bathroom right away.",
      "content": "Go to the bathroom right away. One way to prevent hemorrhoids from becoming worse is to use the bathroom as soon as you have the urge to defecate. Holding onto waste can lead to constipation, and straining due to constipation is a major cause of hemorrhoids. Pay attention to your body’s signals and go to the bathroom right away if you have the urge to make a bowel movement. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try not to strain on the toilet.",
      "content": "Try not to strain on the toilet. Straining can also make hemorrhoids worse, so make sure that you do not try to force a bowel movement. If you cannot have a bowel movement and find that you are starting to strain, then get up from the toilet and try again later. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Do not stay on the toilet and keep trying to go. Long periods of sitting on the toilet can also make hemorrhoids worse. [8] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Instead of sitting, try squatting. This may make it easier to pass a bowel movement without straining. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can purchase a stool or other device that makes it possible to hold a squatting position over the toilet."
    },
    {
      "title": "Use soothing wet wipes instead of toilet paper.",
      "content": "Use soothing wet wipes instead of toilet paper. If any part of your hemorrhoids is external, wiping with regular toilet tissue can be irritating. Look for medicated hemorrhoid wet wipes instead, since these are gentler and contain soothing ingredients, such as aloe and witch hazel. [10] X Research source Some options include Preparation H Medicated Wipes, Cottonelle flushable wipes, and Tucks pads. In a pinch, you can also use a damp paper towel or piece of toilet paper. Cool water will soften the paper and soothe inflammation. Avoid using baby wipes, since they can clog your toilet. Even wipes that are advertised as flushable can often cause clogs, so use caution when flushing them or just throw them in the garbage."
    },
    {
      "title": "Talk to your doctor if you have pain with an internal hemorrhoid.",
      "content": "Talk to your doctor if you have pain with an internal hemorrhoid. It is rare that internal hemorrhoids cause pain, because there are very few pain receptors in the lower rectum. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Pain usually only occurs if the hemorrhoid has prolapsed, meaning it comes out of your anus. This may resolve on its own, or you may be able to push it in yourself; however, severe prolapses, which are often very painful, need to be treated by a doctor. [12] X Research source You may also experience severe itching and irritation. If you develop a blood clot in this area, this will increase the pressure on the hemorrhoid and likely lead to constant and possibly severe pain."
    },
    {
      "title": "Soak in a warm Sitz bath.",
      "content": "Soak in a warm Sitz bath. A warm Sitz bath can also help to soothe hemorrhoids. Try taking a Sitz bath after you have a bowel movement to help soothe and cleanse your hemorrhoids. [13] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source To prepare a Sitz bath, fill a tub with 3–4 inches (7.6–10.2 cm) of warm water and add about a cup (400g) of Epsom salts. Then, sit in the tub for about 15 to 20 minutes."
    },
    {
      "title": "Take over-the counter pain relievers.",
      "content": "Take over-the counter pain relievers. Over-the-counter pain relievers may also provide some relief for painful hemorrhoids. Try taking acetaminophen (Tylenol), ibuprofen (Motrin, Advil), or aspirin for hemorrhoid pain. Read and follow the manufacturer’s instructions before use. [14] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Ask your doctor for a recommendation if you are not sure what type of over-the-counter pain reliever you should take."
    },
    {
      "title": "Apply a cooling witch hazel compress.",
      "content": "Apply a cooling witch hazel compress. Witch hazel is soothing, and may reduce inflammation and pain from your hemorrhoids. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Apply a cooling pad that contains witch hazel, such as a Tucks Md Cool Hemorrhoid Pad, to relieve pain and itching. For an extra cooling effect, refrigerate the pads before using them. You can also make a plain cold compress by soaking a cloth in cold water or wrapping an ice pack in cloth and holding it against your anal area. [16] X Research source Don’t use a product containing witch hazel for more than a week, since prolonged use can cause irritation."
    },
    {
      "title": "Insert a suppository for localized relief.",
      "content": "Insert a suppository for localized relief. If you are experiencing pain, a suppository might help. Suppository treatments for hemorrhoids may reduce the size of internal hemorrhoids by delivering medicine to the base of your hemorrhoids within your rectum. Reducing the size of your hemorrhoids can also reduce pain and discomfort. You can buy over-the-counter suppositories that contain witch hazel and other ingredients meant to treat hemorrhoids. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Keep in mind that suppositories need to be inserted into your anus."
    },
    {
      "title": "Sit on a cushion.",
      "content": "Sit on a cushion. Sitting on a hard surface for a long period of time can cause hemorrhoid pain to feel more intense. Instead, try using a cushion or a doughnut pillow. Using a cushion or doughnut pillow can make hemorrhoids feel less painful. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Try a magnesium supplement to make bowel movements easier.",
      "content": "Try a magnesium supplement to make bowel movements easier. Magnesium relaxes the bowels and softens your stools, making it easier to go to the bathroom. Your doctor can give you specific dosing advice, but you may find that a dose of 200-500mg in the morning and evening eases constipation and reduces your hemorrhoid pain. Don’t take magnesium supplements if you have kidney disease or are taking any other type of medication that contains magnesium. Let your doctor know first if you’re taking other supplements or medicines so they can help you determine if it’s safe. Avoid magnesium supplements that also contain calcium, since they can make constipation worse."
    },
    {
      "title": "Ask your doctor about using a triphala supplement.",
      "content": "Ask your doctor about using a triphala supplement. Triphala is an herb frequently used in traditional or alternative medicine to treat constipation and other digestive issues. It may help prevent constipation and soften your stools, which can make bowel movements easier and gentler on your hemorrhoids. It may also reduce painful inflammation. Talk to your doctor before trying triphala or any other supplement, especially if you have any serious medical conditions or are taking other medications. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Side effects with triphala are rare, but in some cases it can cause gastrointestinal side effects, such as an upset stomach. [20] X Research source"
    },
    {
      "title": "See your doctor for treatment.",
      "content": "See your doctor for treatment. One of the main symptoms of hemorrhoids is bleeding from the rectum, but this is also a symptom of colorectal cancer. For this reason, you should visit your doctor as soon as possible if you are experiencing internal hemorrhoid symptoms. Your doctor will perform a physical exam and may also order some imaging tests to rule out cancer. Some of the tests that your doctor may order include: [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Colonoscopy — For this procedure, a long, flexible tube with a camera and light on the end is inserted into the anus and moved into the rectum and intestine to capture images. Sigmoidoscopy — This procedure uses a camera and light at the end of a short tube. In a sigmoidoscopy, the camera captures images of the lower rectum and the sigmoid colon (the lowest part of the colon). Barium enema x-ray — This procedure requires an enema with barium to coat the inside of the colon, followed by x-rays to capture images of the colon. [22] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Ask about rubber band ligation.",
      "content": "Ask about rubber band ligation. If internal hemorrhoids move outside of the rectum, then you may be eligible for rubber band ligation. In this procedure, your doctor will place 1 or 2 small rubber bands around the base of the hemorrhoid, which will eventually cause it to drop off. [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The rubber band cuts off circulation to the hemorrhoid, which may cause some discomfort. There might also be some bleeding. But after a couple of days, the hemorrhoid will fall off."
    },
    {
      "title": "Discuss the possibility of having sclerotherapy.",
      "content": "Discuss the possibility of having sclerotherapy. For this procedure, your doctor will inject a solution into your hemorrhoid that will cause it to shrink. This treatment is effective, but not as effective as rubber band therapy. You might have some pain with the initial injection, but otherwise this procedure is pain-free. [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Look into coagulation.",
      "content": "Look into coagulation. Coagulation uses infrared light, heat, or a laser to treat hemorrhoids. After exposure, the hemorrhoids will harden and shrink. This procedure can treat hemorrhoids, but they are more likely to come back than when treated with rubber band ligation. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Consider hemorrhoid removal surgery.",
      "content": "Consider hemorrhoid removal surgery. For large hemorrhoids or for hemorrhoids that have not responded to other treatments, surgery may be the best option. There are 2 main types of hemorrhoid surgery that are used to treat hemorrhoids: Hemorrhoidectomy — In this procedure, the surgeon removes the hemorrhoid by making an incision around its base. [26] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Keep in mind that you will be anesthetized during the procedure so that you will not feel anything; however, recovery can be painful and you may need prescription pain medicine to deal with pain after the surgery. [27] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Stapled hemorrhoidectomy — In this procedure, the surgeon uses staples to block blood flow to hemorrhoids. This procedure is less painful and includes a faster recovery time than a standard hemorrhoidectomy, but it also carries the a higher risk of hemorrhoid recurrence and rectal prolapse (where part of the rectum falls out of the anus). [28] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}