{
  "url": "https://www.wikihow.com/Suck-in-a-Helium-Balloon",
  "title": "How to Suck in a Helium Balloon",
  "steps": [
    {
      "title": "Get a balloon filled with helium.",
      "content": "Get a balloon filled with helium. It doesn’t matter if it’s an aluminum or rubber balloon. They’re sold at party centers or you could rent a helium tank to fill up your own balloons for a special event. [1] X Research source You’ll know a balloon is filled with helium if it floats. Helium is lighter than air, so it naturally rises. If a balloon stays down near the ground, it doesn’t have helium in it."
    },
    {
      "title": "Poke a small hole near the balloon’s knot with a safety pin.",
      "content": "Poke a small hole near the balloon’s knot with a safety pin. If you don’t have a safety pin, a pushpin or sewing needle will work just the same. Use the pin to prick the balloon and create a really small hole, and then squeeze the hole shut with your fingers to keep the helium from escaping until you’re ready to inhale. If the balloon is inflated but not knotted, you don’t need to poke a hole in it. You can simply suck the air directly from the opening."
    },
    {
      "title": "Put your mouth over the hole and inhale while squeezing the balloon.",
      "content": "Put your mouth over the hole and inhale while squeezing the balloon. Don’t just hold the helium in your mouth—breathe it in like you would a normal breath of air. Just 3-4 seconds should be enough to fill your lungs with helium. It helps to exhale fully before inhaling so that you can get as much helium into your lungs at once as possible. Helium doesn’t have an odor, taste, or smell, so you really won’t be able to tell that you’re breathing in an element different from oxygen until you try to speak."
    },
    {
      "title": "Say something funny to hear how the helium affected your voice.",
      "content": "Say something funny to hear how the helium affected your voice. As soon as you’ve finished inhaling, start talking! The helium-effect will only last for 5 seconds or so, so don’t wait too long. [2] X Research source What you say is totally up to you! Have fun and come up with unique phrases or just repeat your name over and over again to hear how you sound."
    },
    {
      "title": "Wait 2-3 minutes between each helium-inhale to rebalance your oxygen.",
      "content": "Wait 2-3 minutes between each helium-inhale to rebalance your oxygen. If you suck too much helium at once or for too long of a period of time, you can hurt yourself. So between each inhalation of helium, take a few minutes to breathe normally. [3] X Research source"
    },
    {
      "title": "Write down a few funny lines to say beforehand so you don’t forget.",
      "content": "Write down a few funny lines to say beforehand so you don’t forget. Knowing what you want to say ahead of time can make your experience that much more enjoyable! Try out a few of these fun tongue-twisters : [4] X Research source “Peter Piper picked a peck of pickled peppers.” “How much wood would a woodchuck chuck if a woodchuck could chuck wood?” “Betty bought a bit of butter, but the butter Betty bought was bitter.” “Round the rough and rugged rock the ragged rascal rudely ran.”"
    },
    {
      "title": "Sing a short song to entertain your friends.",
      "content": "Sing a short song to entertain your friends. The changes in pitch can make your helium-effected voice sound that much funnier. Pick a favorite song or make something up. [5] X Research source See how far into a song you can get before the helium wears off. You could even make this into a challenge with your friends!"
    },
    {
      "title": "Record yourself to post online and share with your friends.",
      "content": "Record yourself to post online and share with your friends. Use the video function on your phone or have a friend do it for you. Put the video on your social media pages so your friends can make comments. Try coordinating with your friends to make a video of you all talking or singing at the same time right after having sucked helium."
    },
    {
      "title": "Order food in the drive-through with your helium voice to crack people up.",
      "content": "Order food in the drive-through with your helium voice to crack people up. Get a helium balloon and hop in the car with some friends to go through a local drive-through. When it’s time to place your order, inhale some helium and talk as fast as you can. Have someone else drive the car; otherwise, you might be too distracted by driving, sucking helium, and talking to be a safe driver."
    }
  ]
}