{
  "url": "https://www.wikihow.com/Treat-a-Dog-Naturally-for-Valley-Fever",
  "title": "How to Treat a Dog Naturally for Valley Fever",
  "steps": [
    {
      "title": "Give your dog a canine multivitamin to boost its immune system.",
      "content": "Give your dog a canine multivitamin to boost its immune system. Nutritional support, especially a vitamin that contains vitamin C, will help your dog fight off the infection naturally. Choose a multivitamin formulated for dogs, and follow the directions for administering it to your pet. It won't cure the infection, but it can help your dog's immune system fight it off. [1] X Research source Always talk to your vet before giving your dog a multivitamin. Although vitamin C is helpful for your dog, it can also cause gastrointestinal issues in high doses, so your vet needs to approve any vitamins you give your dog."
    },
    {
      "title": "Make sure your dog is eating.",
      "content": "Make sure your dog is eating. You may need to hand-feed your dog to get it to eat. Choose a highly palatable food to encourage your dog to eat. If necessary, include tasty ingredients like broth or coconut oil to entice your dog. [2] X Research source Your dog needs to eat a nutritious diet to help it recover. However, your dog might refuse to eat due to a low appetite. Ask your vet for food recommendations."
    },
    {
      "title": "Tell your vet about your dog's exposure to Valley Fever.",
      "content": "Tell your vet about your dog's exposure to Valley Fever. Let the vet know that your dog has been outdoors in an area that is known to harbor Valley Fever. They'll consider this information in making a diagnostic decision for your dog. [3] X Research source [4] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021. Valley Fever is most prevalent in the southwestern United States and Mexico."
    },
    {
      "title": "Let the vet draw blood to test your dog's antibodies.",
      "content": "Let the vet draw blood to test your dog's antibodies. The vet will test your dog's blood to determine if your dog has antibodies against the Coccidiodes immitis fungus, which causes Valley Fever. This test is called a titer, and the vet will do it in their office. If the initial test is positive, the vet will then determine how many antibodies are present, which will help them figure out how severe the infection is. [5] X Research source [6] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021. Higher levels of antibodies usually mean the infection is worse. Test costs will depend on the pricing scale at your vet's office. However, you can expect to spend about $150 for the visit and blood test."
    },
    {
      "title": "Allow the vet to x-ray your dog to look for the infection.",
      "content": "Allow the vet to x-ray your dog to look for the infection. The vet may X-ray your dog's chest to help determine the severity of the infection. They'll look for cloudiness in your dog's lungs, which may indicate an infection in the lungs. Since Valley Fever starts in the lungs, the X-ray will help the vet make a diagnosis. [7] X Research source You vet may decide not to X-ray your dog if their blood test clearly shows antibodies for Valley Fever. Costs of a dog X-ray will vary depending on your vet's pricing scale, as well as the size of your dog and if it needs to be sedated. An X-ray of a dog typically costs between $40 for a small dog that doesn't need sedation and $200 for a large dog that needs sedation."
    },
    {
      "title": "Ask your vet about an antifungal medication to treat Valley Fever.",
      "content": "Ask your vet about an antifungal medication to treat Valley Fever. The most effective treatment for Valley Fever is an oral antifungal medication. [8] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021. The most commonly prescribed antifungal for dogs is fluconazole, but your vet may instead prescribe itraconazole or ketoconazole. You can administer these medications orally by putting them in a treat for your dog. [9] X Research source Antifungal medications can cause side effects, such as loss of appetite, vomiting, elevated liver enzymes, and birth defects in puppies. They may also cause coat and skin issues, increased thirst and urination, and possibly infertility in male dogs. [10] X Research source Depending on the medication your vet prescribes, the prescription may cost between $20 to $200. That's because the most effective medication against Valley Fever, called fluconazole, is only made by a few manufacturers. Ask your vet about cost saving options to lower treatment costs for your pet."
    },
    {
      "title": "Ask about NSAIDs to reduce your dog's inflammation and pain.",
      "content": "Ask about NSAIDs to reduce your dog's inflammation and pain. Your vet can prescribe a non-steroidal anti-inflammatory drug that's formulated for dogs. This will make your dog more comfortable and help it recover more quickly. Always administer your dog's medication as prescribed by the vet. Don't give your dog medications made for humans, as they might harm your dog."
    },
    {
      "title": "Treat your dog for at least 6 months to a year, as directed.",
      "content": "Treat your dog for at least 6 months to a year, as directed. Unfortunately, Valley Fever is a persistent illness. Your dog will need to take the antifungal medications for at least 6 months, but it's normal to treat your dog for a full year. Give your dog its medication as directed, and take it to your vet for regular checkups. If your dog has a severe case, it may need lifetime treatment for the condition. [11] X Research source"
    },
    {
      "title": "Monitor your dog when it's outside so it doesn't get in the dirt.",
      "content": "Monitor your dog when it's outside so it doesn't get in the dirt. Don't let your dog go outside unattended. Watch the dog so you can stop it from digging or playing in the dirt, which is where it might encounter the fungal spores that cause Valley Fever. Keep your dog inside as much as you can so that it won't encounter the spores."
    },
    {
      "title": "Walk your dog on paved sidewalks or streets to avoid the spores.",
      "content": "Walk your dog on paved sidewalks or streets to avoid the spores. Since the fungal spores are present in soil, staying on the pavement can protect your pet. Use your leash to keep your dog away from dirt and soil. [12] X Research source If your pet needs to relieve itself, let it briefly walk on the ground. However, do your best to keep it from spending too much time on the soil."
    },
    {
      "title": "Prevent your dog from digging in soil or sand.",
      "content": "Prevent your dog from digging in soil or sand. Dogs love to dig, but it can be hazardous to their health if you live in an area with Valley Fever. Keep your dog on a leash to keep it from digging. For off-leash play, take your dog to a dog park or install a turf patch in your yard so that there isn't any soil for digging. [13] X Research source Train your dog to not dig in the soil. Give your dog lots of praise and treats when it doesn't dig."
    },
    {
      "title": "Support your dog's immune system to protect it against infection.",
      "content": "Support your dog's immune system to protect it against infection. A strong immune system may be able to fight off a Valley Fever infection. To keep your dog healthy, give it nutritious food. Additionally, consider giving your dog a multivitamin or supplement to boost its immune system. [14] X Research source Ask your vet to recommend the best food for your dog. Always talk to your vet before using any vitamins or supplements on your pet."
    },
    {
      "title": "Notice if your dog is coughing.",
      "content": "Notice if your dog is coughing. This is often the first symptom of Valley Fever, as the spores infect your dog's lungs. Your dog will develop a respiratory infection because of the fungal spores in its lungs, making the dog cough. [15] X Research source You may also notice that the dog isn't breathing well or is wheezing."
    },
    {
      "title": "Watch for lethargy in your dog.",
      "content": "Watch for lethargy in your dog. Your dog will lay around and not engage in play. It will also show little interest in the people, toys, and activities that usually make it excited. Additionally, your dog won't want to take walks. [16] X Research source"
    },
    {
      "title": "Check your dog for a fever.",
      "content": "Check your dog for a fever. Valley Fever commonly causes a fever in dogs, as the dog's immune system will try to fight it off. [17] X Research source You can take your dog's temperature yourself using a rectal thermometer made for dogs, or you can take your dog to the vet to have them take its temperature. A dog's temperature is naturally higher than a human's. A dog is considered to have a fever when its temperature reaches 103 °F (39 °C) or more. Don't try to determine if your dog has a fever by feeling its nose or ears. These techniques aren't reliable. [18] X Research source"
    },
    {
      "title": "Notice if your dog has a poor appetite and is losing weight.",
      "content": "Notice if your dog has a poor appetite and is losing weight. Valley Fever causes your dog to have a low appetite, so it likely won't want to eat. You'll notice food sitting in your dog's food bowl, and the dog will look thinner. [19] X Research source If you try to give your dog a favorite treat and it refuses to eat it, this is a sign it has a poor appetite."
    },
    {
      "title": "Watch for open sores that don't heal if the infection is severe.",
      "content": "Watch for open sores that don't heal if the infection is severe. Most dogs who have Valley Fever won't have open sores. However, this may happen after the infection becomes severe. If you notice sores on your dog's body, take it to the vet immediately. [20] X Research source Don't try to treat the dog's sores yourself. You need to take your dog to the vet for proper treatment."
    }
  ]
}