{
  "url": "https://www.wikihow.com/Start-a-Drop-Shipping-Business",
  "title": "How to Start a Drop Shipping Business",
  "steps": [
    {
      "title": "Choose a niche.",
      "content": "Choose a niche. There are hundreds or more drop shipping businesses and it can be difficult to compete on price alone. Accordingly, you need to find a niche and decide what sets you apart from the competition. Find a niche where you can add value. For example, you can sell electronics equipment and run a blog that shows people how to put the equipment together. [1] X Research source Or you could sell pet supplies and accessories on a website where you blog about the topic. Plan on selling products that are hard to purchase locally but instead are bought online. [2] X Research source Your products shouldn’t be too cheap. Ideally, a good niche is one where the products cost $100-200. This price point allows you to make a solid profit from each sale without having to provide a lot of customer support. When you charge more, customers usually want to talk to a person before buying."
    },
    {
      "title": "Identify suppliers.",
      "content": "Identify suppliers. After choosing your niche, find suppliers who are willing to drop ship. There is no one place to look to find suppliers. Instead, try the following: Search online for “wholesaler” and then the product you want to sell. Because wholesalers don’t invest much in online advertisement, you might have to dig through 20 or more pages to find results. If you can’t find anything, then swap out “wholesaler” for other terms like “distributor,” “bulk,” “reseller,” and “supplier.” [3] X Research source You can also look through your Yellow Pages under Suppliers or Wholesalers to see if there are any in your area. [4] X Research source If you know the manufacturer of the product, then you can contact the manufacturer directly and ask for a list of distributors."
    },
    {
      "title": "Check which suppliers your competitors use.",
      "content": "Check which suppliers your competitors use. One good way to find a reliable supplier is to locate your competitors and then find out who they use. You can find other drop shipping sellers by searching the Internet. If the business has only one location listed on its “Contact Us” page, then it is probably a drop shipping business. [5] X Research source They may even highlight their bestselling brands. Chances are these are reliable suppliers you also can contact. If they don’t highlight any brands, then scroll through the products that they offer. Write down the names of any brands that offer products you want to sell."
    },
    {
      "title": "Ask suppliers questions.",
      "content": "Ask suppliers questions. After identifying possible suppliers, reach out to them and ask if they handle drop shipping. Not every supplier is willing. Suppliers might be hard to reach, so plan on sending emails and making regular phone calls until you reach the right person. [6] X Research source When you do, ask the following questions: [7] X Research source How long does it take them to ship after you’ve placed an order with them? What shipping methods do they offer? For example, ask if they ship overnight or internationally. Do they offer warranties on their products? If a product is defective, then you want them to replace it. What quality control systems do they use? Do they set minimum advertised prices? Ideally, they will. If not, then other drop shipping businesses could lower the prices too low for you to compete. Do they charge a monthly or annual fee? If so, then you might want to avoid them. Can you put their product photo on your website? Preferably, they will allow you to use their picture."
    },
    {
      "title": "Choose the best-selling products.",
      "content": "Choose the best-selling products. Once you’ve found a supplier, you should go through their product pages and see what items you want to sell. Ideally, you will want to sell products that are in high demand. You can use a couple of different techniques to gauge a product’s popularity: Perform market research. You can find out the demand for the product by using Google’s Keyword Tool. This tool provides data on the number of people who have searched for a term. [8] X Research source For example, if you want to sell cat sweaters, then check how many people have searched for that term. Look at the completed listings on eBay. Go to “advanced search” and check the “completed listings” box. Then enter keywords and category. As you scroll through the pages of listings, check items that sell 60% or more. These items are usually popular. [9] X Research source"
    },
    {
      "title": "Create an account with the supplier.",
      "content": "Create an account with the supplier. You should call or go online to set up your account. Some suppliers will require that you complete an application. They may also request a copy of your reseller’s certificate, business license, or other document. [10] X Research source In that situation, you should form your business first. Also discuss payment methods. You can pay upfront or pay on terms. When you pay upfront, you pay at the same time as you place your order. With pay on terms, you pay all of your orders at a later date, such as at the end of the month. Because you are just starting out, suppliers might only agree to work with you if you pay upfront. After you establish your reliability, they might be willing to change their billing."
    },
    {
      "title": "Select a business structure.",
      "content": "Select a business structure. Every business has a certain legal structure, and you must get your government’s permission to create some of them. In the United States, you will register with the state where you are located. Each structure has advantages and disadvantages, which you should discuss with a lawyer or accountant: Sole proprietorship . This business is run by one person and is easy to set up. Most drop shipping business are probably sole proprietorships. You don’t need to file paperwork with your state to form a sole proprietorship. Instead, you can use your Social Security Number as your business ID and report business income on your 1040 form. You are personally liable for all of your business’s debts. [11] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source This means that if your business is sued, you might lose personal assets like your car or home. Limited liability company . You can form an LLC by filing Articles of Organization with your state’s Secretary of State. An LLC is a separate legal entity and shields its owners from personal liability for business debts. [12] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source Corporation . You form a corporation by filing Articles of Incorporation with your state. Like an LLC, a corporation shields its owners (called shareholders) from personal liability for business debts. Corporations pay their own taxes. [13] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source However, if you form an S corporation, then the business’s profits and losses pass through to the shareholders."
    },
    {
      "title": "Obtain necessary licenses and permits.",
      "content": "Obtain necessary licenses and permits. To find what you need, visit the Small Business Administration website at https://www.sba.gov/starting-business/business-licenses-permits/state-licenses-permits and click on your state. Don’t forget to get a reseller’s certificate. Suppliers will usually want to see that you have either a state sales tax ID or a resale certificate. [14] X Research source This certificate exempts you from paying sales tax when you buy items from your supplier. Not every state requires a reseller’s certificate, but most do. [15] X Research source It can go by different names, such as certificate of resale, reseller’s permit or license, or resale license. If your state doesn’t require the certificate, then tell the wholesaler. They could have paperwork you need to fill out."
    },
    {
      "title": "Apply for a federal tax ID.",
      "content": "Apply for a federal tax ID. You need to pay taxes to the federal government, so you need a tax identification number (also called an employer identification number). You can apply for one here: https://www.irs.gov/businesses/small-businesses-self-employed/apply-for-an-employer-identification-number-ein-online . If you run a sole proprietorship, then you can use your Social Security Number instead."
    },
    {
      "title": "Select your selling platform.",
      "content": "Select your selling platform. You have two options. You can create your own eCommerce site, or you can sell on an existing online marketplace, such as eBay , Amazon.com, or Bonanza.com. [16] X Research source Selling on an existing marketplace will require less work, but you might get lost in the crowd of sellers. You can create your own eCommerce store using websites such as SaleHoo. Alternately, you could purchase a domain name and create your own website. If you choose to sell on an online marketplace, then diversify and list on several. Not everyone buys on eBay."
    },
    {
      "title": "Set up your website to accept credit card payments.",
      "content": "Set up your website to accept credit card payments. Marketplaces like eBay and Amazon will process payments for you. However, if you create your own eCommerce site, then you will need a merchant account and a payment gateway account so that your clients can pay with credit cards. [17] X Research source Several companies offer both as a bundle. Contact CyberSource, Verisign, or Authorize.net. PayPal might be the easiest way to process payments. Go with PayPal and avoid getting merchant and payment gateway accounts altogether. Instead, you can add their Shopping Cart feature to your website for free. Your clients can then pay with credit cards or their PayPal account."
    },
    {
      "title": "Obtain a toll-free number.",
      "content": "Obtain a toll-free number. You’ll look more legitimate as a business if you have a toll-free number customers can call to lodge complaints or ask questions. You can buy an 800 number from many different providers. Look online. Some providers even allow you to link the number to your cell phone. [18] X Research source If you don’t want to use your home address as your business address, then get a mailbox at a post office or at a UPS store."
    },
    {
      "title": "List your products for sale.",
      "content": "List your products for sale. Pricing right is important. You don’t want to price too high and lose customers to competitors. However, if you price too low, then you won’t make much of a profit. Always factor in how much you must pay your supplier when setting your sale price. Remember that your supplier also charges for shipping. [19] X Research source Also remember to clearly tell your customers about your shipping and return policies in your listing. [20] X Research source Customers need to know that information upfront. Online platforms, such as eBay, will require you to identify where the product is located. For example, if your supplier is in Mexico, then include this information in your listing. [21] X Research source"
    },
    {
      "title": "Purchase from the supplier when you get a sale.",
      "content": "Purchase from the supplier when you get a sale. As a drop shipper, you wait for a customer to order from you. Then you turn around and order from your supplier. Make sure not to delay, since your delay will only cause a delay for your customer. Pay the supplier using a rewards credit card. In this way, you will reap all of the points for the purchase. [22] X Research source If you receive a tracking number, then hold onto it and track the product so that you know when it has arrived."
    },
    {
      "title": "Notify your customer when their product ships.",
      "content": "Notify your customer when their product ships. You should stay in contact with the customer after they purchase a product. Send a follow-up email telling them when the product has shipped. Also provide your contact information so that they can contact you if a problem arises. [23] X Research source"
    },
    {
      "title": "Troubleshoot problems.",
      "content": "Troubleshoot problems. All kinds of problems can arise in the drop shipping business. For example, a supplier might not be trustworthy and will mail something too late. Or the supplier doesn’t package the product securely and it breaks on the way to your customer. You can protect yourself by having multiple suppliers for most of your products. This way, you’ll have a fallback option if your primary supplier can’t deliver. When a product is sold out, you can give the customer an upgraded product for free instead of cancelling the order outright. [24] X Research source Remember to stay in contact with your suppliers. You want a good working relationship with them so they will help remedy problems."
    },
    {
      "title": "Market your business",
      "content": "Market your business . There are many ways you can reach potential customers, even if you are selling on an auction site like eBay. You should try several marketing techniques and find out what works best. You can create a mailing list customers can sign up for. Put a link in your email confirmation after the sale, and tell them to sign up to receive special email offers. You can use Mailchimp to build and keep track of your mailing list. [25] X Research source You can also run Google or Facebook ads, though these can be expensive. Another way to increase your visibility is to run a blog or to guest blog. Look for blogs in your niche, and include a link to your website or your email address."
    }
  ]
}