{
  "url": "https://www.wikihow.com/Take-Care-of-a-Weak-Newborn-Puppy",
  "title": "How to Take Care of a Weak Newborn Puppy",
  "steps": [
    {
      "title": "Warm the weak, newborn puppy.",
      "content": "Warm the weak, newborn puppy. If you’ve determined a puppy in the litter needs special care, the first move is to make sure it is warm enough. [1] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021. A cold puppy is not able to nurse and can become dangerously dehydrated and hypoglycemic, which means having life-threatening low blood sugar. [2] X Research source Management of Pregnant and Neonatal Dogs, Cats, and Exotic Pets. Cheryl Lopate. John Wiley &amp; Sons. 2012 Warming can be accomplished by using a hot water bottle filled with very warm water, 'not' boiling water, placed in the bottom of a small cardboard box or shoe box and covering it with a towel. The puppy can then be placed on the towel, covered with a light cloth or towel and the top of the box can be lightly closed. Alternatively, you can place the puppy on your chest under your clothing until it warms up. You may want to wrap the rear end in a clean piece of cloth so you're not urinated or pooped on! Puppy's tiny claws will be sharp as well, so be prepared for a few scratches. Using a heating pad is dangerous, as they can overheat a puppy. Even on the lowest setting, a heating pad can become dangerously hot. You want to gradually warm the puppy over a course of one to three hours. Warming any more rapidly can cause overheating. [3] X Research source Lawler, D.F. (2008) Neonatal and pediatric care of the puppy and kitten. Theriogenology, 70: 384-392 There are heating pads made specifically for animals, and these usually don't get as hot. The puppy must not be placed directly on this pad — you must use a towel or fleecy cover between the pad and the puppy in order to avoid thermal burns. If the puppy is open-mouth panting, she is too hot."
    },
    {
      "title": "Take the puppy's temperature.",
      "content": "Take the puppy's temperature. After you think the puppy is warmed you should use a pediatric digital thermometer to take the puppy’s temperature rectally. Place a small amount of lubricant on the tip and gently insert the very tip into the pup’s rectum. If the body temperature is below 94 °F (34.4 °C) the gastrointestinal tract will not work properly. However, don’t let the rectal temperature get over 99 °F (37.2 °C) in a puppy less than seven days or overheating can occur. Write the temperature in the same notebook or spreadsheet in which you are recording the weight."
    },
    {
      "title": "Help the puppy nurse.",
      "content": "Help the puppy nurse. Once the puppy is warmed and active, it is time to feed it. Try to see if the mother dog will let the puppy latch onto her teat. Puppies need the first milk from their mom, as it has valuable immune factors in it (antibodies) that a pup needs to build his immune system. You may need to give the weak puppy a little one on one time with his mom. Keep any other puppies in the same room as the mom but keep them away from her body while the weak puppy attempts to nurse."
    },
    {
      "title": "Increase the weak puppy's blood sugar.",
      "content": "Increase the weak puppy's blood sugar. If the puppy is warm, yet weak and unable to nurse, it may have a low blood sugar. Place two or three small drops of corn syrup on its tongue to correct this problem. Specific signs of hypoglycemia in a newborn puppy are: [4] X Research source www.brightwoodanimalhospital.com/raising_orphan_puppies Weakness and lethargy. Tremors and twitches. (Normal newborn puppies will twitch, so combine this with other signs of hypoglycemia to differentiate between normal twitches and abnormal twitches.) Convulsions. Unresponsive or comatose."
    },
    {
      "title": "Supplement the puppy's milk supply.",
      "content": "Supplement the puppy's milk supply. If the pup is warmed sufficiently and wants to suckle, you may need to feed it suitable milk formula if the mother won’t let it nurse or it is unable to latch on to a teat. Purchase puppy replacement formula from a veterinary office or a reputable pet store. [5] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021. It can be fed via nursing bottles or by using a syringe. Mix the formula according to directions and make sure it is warm but not too hot, much like you’d prepare formula for a human baby. Talk to a veterinarian if you're not sure which puppy milk replacement formula is best for your puppy. [6] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021."
    },
    {
      "title": "Feed the puppy on a regular basis.",
      "content": "Feed the puppy on a regular basis. A weak new born puppy should be fed every three to four hours, including nights. Divide the total daily feeding (found on the formula container label) by the number of daily feedings. For example, feeding every three hours will be eight feedings total, and feeding every four hours will be six feedings. Make sure to feed fresh, warm formula each feeding."
    },
    {
      "title": "Stimulate the puppy's need to go to the bathroom.",
      "content": "Stimulate the puppy's need to go to the bathroom. Newborn puppies need stimulation of the genital region in order to urinate and defecate appropriately. Usually the mom dog does this but you will need to do this for a neglected puppy. Take a clean cotton ball and wet it with warm water. Gently rub it on the genital region of the puppy. The puppy will urinate and/or defecate as need be from this stimulation. Wipe the genital area with a clean tissue to clean up any mess and dispose of the cotton ball and tissue in the garbage. Wash your hands well afterwards."
    },
    {
      "title": "Take the puppy to a veterinarian.",
      "content": "Take the puppy to a veterinarian. If the puppy is not responding to your attempts to warm her or won’t eat, you need to take her to the veterinarian for treatment. Dehydration is dangerous and puppies can quickly die from it if they are unable to nurse and adequate amount. Also see your veterinarian if your puppy has diarrhea, has fluid coming from the nose, or if you have any other concerns regarding her health. Timely treatment is very important in the newborn puppy. If you wait too long the puppy may die."
    },
    {
      "title": "Make sure the mother dog is taking care of all of her puppies.",
      "content": "Make sure the mother dog is taking care of all of her puppies. If the mother dog is pushing one particular puppy away, instead of drawing him near her, you should be concerned. A puppy not huddled up with littermates and his mother will not get the food or warmth that he needs to thrive. [7] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021."
    },
    {
      "title": "Look for signs of trouble.",
      "content": "Look for signs of trouble. A newborn puppy can become a weak puppy within a matter of hours. There are certain signs to check for to see if your puppy is having serious problems such as: [8] X Research source Puppy Intensive Care: A Breeder's Guide to Care of Newborn Puppies. Myra Savant-Harris. Dogwise Publishing. 2005 Cold to the touch or cold mouth Weak suckle reflex when the fingertip is gently placed in mouth Limp or poor muscle tone: head hangs down and legs don’t pull back when lightly tugged Inability to nurse Feces on the rear: can indicate diarrhea (a serious issue) Discharge from the umbilical stump Non-stop crying"
    },
    {
      "title": "Check puppies regularly.",
      "content": "Check puppies regularly. You should check all your puppies’ weights on a suitable scale twice a day. Kitchen scales will do, as long as you clean them well afterwards or even use them just for puppy weigh-ins. The weight can be taken in grams or ounces, just be consistent. They should never lose weight, instead they should gain about 10% of their birth weight each day after the first day of life. [9] X Research source Lawler, D.F. (2008) Neonatal and pediatric care of the puppy and kitten. Theriogenology, 70: 384-392 This indicates they are getting enough milk. Weights should be recorded in a notebook or spreadsheet so you can track their progress for the first two weeks of life."
    }
  ]
}