{
  "url": "https://www.wikihow.com/Stop-Watching-YouTube",
  "title": "How to Stop Watching YouTube",
  "steps": [
    {
      "title": "Delete all apps and bookmarks.",
      "content": "Delete all apps and bookmarks. Get rid of temptation by deleting any one-click links and icons that you have on your computer and mobile devices. Force yourself to start typing each letter in the web address whenever temptation strikes. Give yourself more time to reconsider visiting the site before you get there. Since YouTube is a pretty popular site, the autofill feature in browsers will likely suggest it after the first couple of letters. Make a point of filling in the whole address on your own. Always give yourself more time to back out."
    },
    {
      "title": "Deactivate",
      "content": "Deactivate your account. True, you can still watch YouTube without being logged into a personal account, but delete your account anyway. Rid yourself of all the channels that you’ve curated over time. Force yourself to spend more time searching for videos if temptation leads you back there. This way you have more time to reconsider what you’re doing. To deactivate your account: [1] X Research source Open the Account link in the YouTube menu. Select “Delete Account.” Type in why you’re closing the account when prompted. Type in your password. Click “Delete My Account.”"
    },
    {
      "title": "Block the site.",
      "content": "Block the site. If you find yourself succumbing to temptation again and again, prevent yourself from being able to visit the site at all. Open the settings to your Internet browser, search for its blocking features, and add YouTube to the list. If needed, download the appropriate add-on for your browser if it doesn’t allow blocking as part of its original features. [2] X Research source Internet Explorer and Opera should allow you to block sites without needing to download any add-ons. Firefox may require you to download the add-on LeechBlock. Chrome may require you to do the same with StayFocused."
    },
    {
      "title": "Hide apps and bookmarks.",
      "content": "Hide apps and bookmarks. Of course, as addictive as YouTube might be, you may still have valid reasons for watching certain videos. If you’re looking to spend less time on casual viewing only, bury apps and bookmarks in new folders. Hide them so the icons and links aren’t there to greet and tempt you first thing. With phones or tablets, you can also take the added step of creating additional pages to your home screen. Banish the YouTube app to the last one, well away from those you use the most, so you have to swipe a ridiculous number of times to reach it."
    },
    {
      "title": "Block the site selectively.",
      "content": "Block the site selectively. Maybe your problem is that YouTube distracts you when you’re supposed to be concentrating on something else, like work or studies. If that’s the case, go to the site-blocking settings in your browser or its add-on. Then, instead of having it block the site all the time, enter a start- and end-time to block it during those hours that are supposed to be devoted to other activities. [3] X Research source There are also numerous apps available for download to accomplish this."
    },
    {
      "title": "Designate device(s) for YouTube viewing.",
      "content": "Designate device(s) for YouTube viewing. Part of what makes YouTube so addictive is that it’s available on so many devices. Pretend that isn’t the case. Choose just one or two to use for YouTube while eliminating it from all the others. Which to choose will depend on your situation. For instance: If your job or studies require you to watch or post videos, designate your computer as your sole YouTube device. Then refrain from watching it on your TV, phone, or tablet. If you need it for, say, video tutorials on DIY projects around the house, designate a single mobile device as your tool instead."
    },
    {
      "title": "Write down what you intend to do online before starting.",
      "content": "Write down what you intend to do online before starting. Whenever you need to use the Internet, jot down what you plan to do on a piece of notepaper first. Keep this with you when you sit down at the computer (or even hold it in your other hand if you’re using a phone). Give yourself an itemized to-do list so you have a plan to stick to. This will make it harder to stray into temptation. [4] X Research source This is also a good idea whenever you’re working on a device connected to the Internet, even if you don’t intend to go online."
    },
    {
      "title": "Plan other activities.",
      "content": "Plan other activities. If you tend to watch YouTube at a certain time of day, fill that time slot with a new activity. Busy yourself with new habits to avoid lapsing back into the old ones. Ensure success by choosing something that doesn’t require a device. For instance, you could: Create or adjust your exercise schedule to fill that time slot. Dedicate that time to reading a book, newspaper, or magazine. Cook meals in advance for the days or week ahead. Enroll in a class or group activity that meets at that time."
    },
    {
      "title": "Divert your attention to something else.",
      "content": "Divert your attention to something else. Keep a to-do list of stuff that needs to be taken care of around. Then, whenever you find yourself a click away from wasting the next half hour on YouTube, refer to that list to find something else to occupy yourself immediately. Failing that, come up with some fallback activities that you can do instead of succumbing to temptation, like: Calling, texting, messaging, or emailing friends or family that you haven’t reached out to in a while. Stepping away from your device for some impromptu exercise, like pushups, situps, or even just taking a walk. Engaging in some other interest or hobby of yours, like writing, painting, or playing an instrument."
    },
    {
      "title": "Keep track of your relapses.",
      "content": "Keep track of your relapses. If you do find yourself back on YouTube, grab a piece of notepaper, write down the date and time, and make a tick for each video that you watch. Save this and add to it every time you stray back to the site. Create a visual record of your relapse to keep track of your progress, as well as identify any patterns to your success and/or failures. For instance: [5] X Research source Say you find yourself back on YouTube at roughly the same time each Saturday. Now you know to block the site during those hours and/or make a point of planning another activity. Now say you find that you do pretty well in staying off YouTube all day long on Sunday. Now you can model other days of the week with a similar schedule to mirror that success."
    }
  ]
}