{
  "url": "https://www.wikihow.com/Which-Planets-Are-Friends-in-Astrology",
  "title": "Which Planets Are Friends & Enemies in Astrology?",
  "steps": [
    {
      "title": "The Sun is friendly with the Moon, Mars, and Jupiter.",
      "content": "The Sun is friendly with the Moon, Mars, and Jupiter. In Vedic Astrology, the Sun represents your soul. With qualities of authority, power, ego, self-esteem, and pride, this planet governs your ability to grow as a person. A powerful Sun in your birth chart could mean high position and power are in your future. [1] X Research source Enemies: Venus, Saturn, and Rahu Neutral: Mercury and Ketu Rules over 11th House (House of Profit, Wealth, and Honor)"
    },
    {
      "title": "The Moon has a beneficial relationship with Sun and Mercury.",
      "content": "The Moon has a beneficial relationship with Sun and Mercury. Representing the mind and emotions, this planet shows your passions and interests. The phases of the Moon reflect the phases or stages in your life, each bringing a new focus. For example, a New Moon symbolizes a new beginning, and a Full Moon is a time of clarity and creation. Enemies: None Neutral: Mars, Jupiter, Venus, Saturn, Rahu, and Ketu Rules over 4th House (House of Home and Family)"
    },
    {
      "title": "Mars",
      "content": "Mars gets along with the Sun, Moon, and Jupiter. The red planet is tempered but strong in Vedic Astrology. In mythology, it’s known as the god of war, bringing out a person’s animalistic nature. This planet governs anger and hatred as well as courage, confidence, and leadership. [2] X Research source Enemies: Mercury Neutral: Venus, Saturn, Rahu, and Ketu Rules over 1st House (House of the Body) and 8th House (House of Sex and Death)"
    },
    {
      "title": "Mercury calls the Sun and Venus its friends.",
      "content": "Mercury calls the Sun and Venus its friends. This planet represents communication and intellect in Vedic Astrology. Also known as the prince, Mercury is a messenger. Communication is knowledge, and that knowledge must be passed around. Enemies: Moon and Ketu Neutral: Mars, Jupiter, Saturn, and Rahu Rules over 6th House (House of Sickness)"
    },
    {
      "title": "Jupiter is friends with the Sun, Moon, and Mars.",
      "content": "Jupiter is friends with the Sun, Moon, and Mars. Being the largest planet, Jupiter is commanding, wise, and rich with culture. In Vedic Astrology, this planet symbolizes devotion, prayer, and worship. You’re most likely very spiritual if Jupiter is your ruling planet. [3] X Research source Enemies: Mercury, Venus, and Rahu Neutral: Saturn and Ketu Rules over 2nd House (House of Wealth), 5th House (House of Pleasure), and 9th House (House of Luck)"
    },
    {
      "title": "Venus is a benefic planet to Mercury, Saturn, and Rahu.",
      "content": "Venus is a benefic planet to Mercury, Saturn, and Rahu. Also known as the minister, Venus represents the harmony and beauty of life in Vedic Astrology. This planet symbolizes reproduction and the creation of life. In other words, Venus governs the pleasures you feel in a romantic relationship. As benefic planets, Mercury, Saturn, and Rahu positively impact Venus and the qualities brought into your life. Enemies: Sun and Moon Neutral: Mars, Jupiter, and Ketu Rules over 7th House (House of Partnerships)"
    },
    {
      "title": "Saturn",
      "content": "Saturn gets along with Mercury, Venus, and Rahu. This planet is all about serving others, as it’s also called the servant. Saturn, in Vedic Astrology, represents the ability to serve others and work hard. If this is your ruling planet, you’re most likely responsible and organized. [4] X Research source Enemies: Sun, Moon, Mars, and Rahu Neutral: Mercury and Jupiter Rules over 3rd House (House of Communication), 10th House (House of Social Status), and 12th House (House of Loss)"
    },
    {
      "title": "Rahu has a good time with Venus and Saturn.",
      "content": "Rahu has a good time with Venus and Saturn. This imaginary planet is notorious for stirring up mischief. In Vedic Astrology and mythology, Rahu is known for causing laziness, delays, and obstacles. Rahu’s place on your birth chart can tell you if you’ll feel negatively towards a certain experience. [5] X Research source Enemies: Sun, Moon, and Mars Neutral: Mercury, Jupiter, and Ketu"
    },
    {
      "title": "Ketu enjoys the company of the Sun and Mars.",
      "content": "Ketu enjoys the company of the Sun and Mars. Also known as the Dragon’s Tail in Western Astrology, Ketu is the south node of the Moon. In Vedic Astrology, Ketu is said to be even more powerful than the Sun, having the power to cause eclipses. This symbolizes the strength of negation and karma. [6] X Research source Enemies: Venus and Saturn Neutral: Mercury, Jupiter, Moon, and Rahu"
    }
  ]
}