{
  "url": "https://www.wikihow.com/Tune-a-Dulcimer",
  "title": "How to Tune a Dulcimer",
  "steps": [
    {
      "title": "Note the number of strings.",
      "content": "Note the number of strings. Dulcimers can have anywhere from 3 to 12 strings, but the vast majority have three, four, or five strings. The tuning process is fairly similar for these common dulcimers, but there are a few differences worth noting. A three-string dulcimer has one bass string, one middle string, and one melody string. A four-string dulcimer has one bass string, one middle string, and two melody strings. A five-string dulcimer has two bass strings, one middle string, and two melody strings. When there is a set of strings (two bass strings or two melody strings), all strings in that set should be tuned in the same manner. If you have a dulcimer with more than five strings, you should take it to a professional to have it tuned since there are too many variations in string placement and sound."
    },
    {
      "title": "Examine the position of the strings.",
      "content": "Examine the position of the strings. Before you can tune a string, you need to know which knob adjusts which string and where each string lies. When the front of the dulcimer faces you, the knob or knobs on the left are usually your middle strings. The lower knob on the right is usually the bass, and the upper knob on the right is usually your melody. If in doubt, adjust the knobs carefully and observe which string is tightened or loosened as you make the adjustment. If you are still unable to determine which knob adjusts which string, ask an expert to help you. Note that the bass string is usually referred to as the \"third\" string even though you will tune it first. Similarly, the melody string is usually referred to as the \"first\" string even though you work on it last. This is because the bass string is the furthest from you and the melody string is the closest to you."
    },
    {
      "title": "Tune the bass string to the D below Middle C.",
      "content": "Tune the bass string to the D below Middle C. Pluck the open string and listen to the sound it produces. Play the correct D note on a guitar, piano, or pitch pipe, then adjust the bass knob until the sound the plucked string produces matches the D note you played. On a guitar, the D below Middle C is the same note as the open fourth string. If you do not have an instrument to tune the bass string to, hum a note with your voice that feels as natural and comfortable as possible. This may not be a D note, but it will come close enough for most purposes. Note that the Ionian Mode is the most standard and can also be called the \"natural major\" mode. Most traditional American songs are considered \"natural major\" songs."
    },
    {
      "title": "Adjust the middle string.",
      "content": "Adjust the middle string. Press down on the bass string just left of the fourth fret on your dulcimer. Pluck on the string to produce an A note, then use the middle tuning knob to adjust the middle string until the sound it produces matches the same pitch when the middle string is open plucked. This step and the step prior to it are the essentially same no matter which tuning method you use."
    },
    {
      "title": "Tune the melody string to the same note as the middle string.",
      "content": "Tune the melody string to the same note as the middle string. Pluck the melody string. Use its tuning knob to adjust it until the melody string produces the same sound as the open middle string. This sound is the A note, and it is also the same sound produced when you pluck the bass string after pressing the bass string down to the left of the fourth fret. The Ionian Mode scale begins on the third fret and runs through the tenth fret. You can play additional notes both below and above this scale on your dulcimer."
    },
    {
      "title": "Tune the bass string to the D below Middle C.",
      "content": "Tune the bass string to the D below Middle C. Without pressing down on it, pluck the bass string and listen to its sound. Immediately after, play the correct D note using a pitch pipe, guitar, or piano. Use the bass knob to adjust the string until plucking it produces the same note. If using a guitar, pluck the open fourth string to hear the correct note. When you do not have a pitch pipe or other instrument to tune this bass string to, you can informally tune the dulcimer by humming a note that feels natural and comfortable. Match the string to the note you hum. The Mixolydian Mode can also be called the \"slightly minor\" mode. Typically, this mode is heard most often in Neo-Celtic music and songs written for the Irish fiddle."
    },
    {
      "title": "Work on the middle string.",
      "content": "Work on the middle string. Press down on the bass string, positioning your finger a little to the left of the fourth fret. Pluck on the string. The note you produce should be an A note. Use the appropriate tuning knob to adjust the middle string until an open pluck on the middle string matches that A note. Note that this step and the one before it are identical in each tuning method, so if you master these two steps, you can use just about any tuning method."
    },
    {
      "title": "Adjust the melody string based on your middle string.",
      "content": "Adjust the melody string based on your middle string. Press the middle string down at the third fret and pluck it to produce a high D. Adjust the melody string using its tuning knob until plucking the open melody string produces the same high D sound. This high D is one octave above the open bass string. Note that tuning to D-A-D or Mixolydian Mode puts more tension on the melody string. The Mixolydian Mode scale begins on open melody string (also called the \"zero fret\") and runs through the seventh fret. There are no notes below the octave on your dulcimer, but there are notes above it."
    },
    {
      "title": "Tune the bass string to the D below Middle C.",
      "content": "Tune the bass string to the D below Middle C. Pluck the bass string without pressing it and listen to the sound it makes, then play the correct D note on a piano, guitar, or pitch pipe. Adjust the bass knob to adjust the bass string until the sound it produces matches that D note. [1] X Research source The open fourth string on a guitar will produce the correct D note. If you do not have a pitch pipe, guitar, or piano, you can tune this bass string using your voice. Hum a note that feels as natural and comfortable as possible and tune the string to that sound. This method of tuning is not as exact, but it will usually produce passable results. The Dorian mode is more minor than the Mixolydian Mode but less so than the Aeolian Mode. It has been used for a variety of tunes, including Scarborough Fair and Greensleeves ."
    },
    {
      "title": "Adjust the middle string based on the bass string.",
      "content": "Adjust the middle string based on the bass string. Produce an A note with the bass string by pressing it just to the left of the fourth fret. Pluck on the middle string without pressing it, then just the appropriate tuning knob to adjust the middle string until it produces that same A note. This step and the one immediately before it are the same for each different tuning method described here, so mastering these two steps is a crucial effort."
    },
    {
      "title": "Work on the melody string by using the bass string.",
      "content": "Work on the melody string by using the bass string. Press on the bass string at the third fret and pluck it to produce a G note. Adjust the melody string using its tuning knob until plucking the open melody string produces this same note. You will need to loosen the tension of the melody string to lower the pitch. The Dorian Mode scale begins on the fourth fret and runs through the eleventh fret. There are additional notes on the dulcimer below the octave and a few above it."
    },
    {
      "title": "Tune the bass string to the D below Middle C.",
      "content": "Tune the bass string to the D below Middle C. Leave the bass string open and pluck it to hear the sound it produces. Play the correct D note using a pitch pipe, piano, or guitar, then use the bass tuning knob on your dulcimer to adjust the bass string. Continue tuning the bass string until the sound it makes matches the D note played by your other instrument. [2] X Research source When using a guitar, play the D below middle C by plucking the open fourth string. If you do not have an instrument that you can use when tuning this bass string, use your voice. Hum a natural, comfortable note and tune the string to that sound. The results may not be quite as precise, though. Note that the Aeolian Mode is also called the \"natural minor\" mode. It has a tendency to \"weep\" and \"wail,\" and it works well with many traditional Scottish and Irish songs."
    },
    {
      "title": "Tune the middle string accordingly.",
      "content": "Tune the middle string accordingly. Produce an A note using the bass string by pressing it down a little to the left of the fourth fret and giving it a pluck. Pluck the open middle string, then adjust it using its tuning knob until you can produce that same A note. Note that this step and the bass tuning step are essentially the same for each method described in this article."
    },
    {
      "title": "Use the bass string to tune the melody string.",
      "content": "Use the bass string to tune the melody string. Press the bass string at the sixth fret and pluck it to produce a C note. Tune the melody string using the appropriate tuning knob until it produces a sound that matches this C note. You will usually have to loosen the melody string a little when making this adjustment. The Aeolian Mode scale begins at the first fret and runs through the eighth fret. There is one additional note on the dulcimer below this octave and many additional notes above it."
    }
  ]
}