{
  "url": "https://www.wikihow.com/Stop-Being-Clumsy",
  "title": "How to Stop Being Clumsy",
  "steps": [
    {
      "title": "Understand how your body’s coordination works.",
      "content": "Understand how your body’s coordination works. The human body is a very complex system, and the operations that control physical coordination have plenty of room for mix-ups. There are four major body parts responsible for coordination, and dysfunction in any one of the areas (or multiple areas) can cause clumsiness. [1] X Research source Eyes. The eyes take in outside information about the body’s physical position in space. Brain and nervous system. The brain and nervous system relay messages throughout the body on how to respond to information about its physical environment. Cerebellum. The cerebellum is an area of the brain that handles physical coordination and balance. Muscles and bones. Your muscles and bones respond to commands from your brain and move you around."
    },
    {
      "title": "Understand what can cause clumsiness.",
      "content": "Understand what can cause clumsiness. There are a whole host of issues that can cause clumsiness, whether it’s temporary or a chronic problem. Some of these are serious medical issues, while others can be addressed at home. [2] X Research source Some common causes of clumsiness include: Head injuries Joint hypermobility Vision issues Arthritis Certain medications Alcohol consumption or drug use Stress and fatigue Muscle weakness or disuse"
    },
    {
      "title": "Measure how accident-prone you are.",
      "content": "Measure how accident-prone you are. There isn’t a lot of research about why people are chronic klutzes, but some research suggests that people who are particularly accident-prone may experience “cognitive failures,” or lapses in attentiveness. [3] X Research source A \"Cognitive Failures Questionnaire\" developed by experimental psychologist Donald Broadbent may help you quantify your clumsiness. [4] X Research source www.yorku.ca/rokada/psyctest/cogfail.doc Below are some sample items from his questionnaire; the more you answer \"yes\" to, the greater your probable level of proneness to these \"cognitive failures.\" “Do you fail to notice signposts on the road?” “Do you find you confuse right and left when giving directions?” “Do you bump into people?” “Do you find you forget which way to turn on a road you know well but rarely use?” “Do you forget where you put something like a newspaper or book?” “Do you fail to see what you want in a supermarket (although it’s there)?” “Do you drop things?” “Do you find you accidentally throw away the thing you want and keep what you meant to throw away -- as in the example of throwing away the matchbox and putting the used match in your pocket?”"
    },
    {
      "title": "Increase your core strength.",
      "content": "Increase your core strength. Your core muscles, such as your abdominals, back, and pelvis muscles, help your body move with smoothness, stability, and coordination. Developing strength in these muscles will give you better control over how your body moves, which will help reduce clumsiness. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Exercises such as ab crunches, single- and double-leg abdominal presses, the “Superman”, and planks all build functional core strength and can done at home or at the gym. Exercise tools such as balance balls and wobble boards can help you build stability while increasing core strength."
    },
    {
      "title": "Develop your flexibility and agility.",
      "content": "Develop your flexibility and agility. In addition to improving your core strength, you should also work on developing your flexibility to battle clumsiness. Studies show that athletes who focus only on strength training and don’t incorporate agility and flexibility exercises have a 70% chance of re-injury, as opposed to 8% for athletes who use both. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In addition to the obvious exercises such as yoga and pilates, exercises such as dance and martial arts can also enhance your flexibility. [7] X Research source Daily stretching is also useful for enhancing flexibility. It increases blood flow to your muscles and allows your joints to move more freely. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you are not very flexible, don't try to perform any complicated yoga positions right away. Start out slowly, and stretch each muscle for 10 to 30 seconds."
    },
    {
      "title": "Work on your balance.",
      "content": "Work on your balance. Building core strength and increasing your flexibility are necessary components of training your body to avoid accidents, but so is enhancing your balance. There are several simple exercises you can do daily to improve your sense of balance. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Shifting your weight from side to side, standing on one leg, and the Crane pose can all help improve your balance."
    },
    {
      "title": "Try vestibular ocular reflex (VOR) exercises.",
      "content": "Try vestibular ocular reflex (VOR) exercises. “Vestibular Ocular Reflex exercises” is a fancy way of talking about exercises that improve hand-eye coordination. These exercises achieve this improvement by getting your brain, your inner ear and vestibular system (which are partly responsible for balance), your eyes, and your body to all work in sync with each other. Try this simple exercise to start: While sitting, bend your head down until you’re facing the floor, then look toward the ceiling with your eyes. Gradually move your head to follow the direction of your eyes. Repeat 10 times. You can also try this gaze stabilization exercise: While sitting, fix your gaze on a stationary target between 3–10 feet (0.91–3.0 m) away from you. It should be at eye level. Move your head from side to side while maintaining your focus on the target. Repeat 3 times. Do this 3 times a day. These exercises can cause dizziness, so take it slow. If you feel nauseated or dizzy, stop and take a break."
    },
    {
      "title": "Pay attention to what you're doing.",
      "content": "Pay attention to what you're doing. Most people who are clumsy are not too aware of their surroundings. When you get up and start walking, look around and see if there is anything that you will step on, walk into, or run into."
    },
    {
      "title": "Remove clutter.",
      "content": "Remove clutter. It’s easy to trip over things if you have stuff all over the floor. Decluttering your house and office will help eliminate opportunities for clumsiness. If your home doesn’t have clear, open walkways throughout the house, you may also want to arrange your furniture differently. This can help keep you from bumping into things or tripping over them. Using double-sided tape to secure the edges of throw rugs can help keep you from tripping over them. [10] X Research source"
    },
    {
      "title": "Change your footwear.",
      "content": "Change your footwear. If you have balance issues, wearing shoes with high heels or narrow soles can disrupt your center of gravity and make you more likely to have an accident. Look for shoes with wide, firm soles that give you a solid foundation on the floor. If you must wear heels, look for chunky heels that will provide more stability."
    },
    {
      "title": "Reduce anxiety.",
      "content": "Reduce anxiety. You are more distracted when you’re stressed or anxious, and this can lead to accidents and clumsiness. Take what steps you can to reduce stress in your daily life, and you may see your clumsiness improve too. [11] X Research source Mindfulness training , which helps you learn to focus your attention on your actions in the moment, can not only reduce stress, it can also help with the “cognitive failures” that can cause clumsiness. Try to get enough sleep. Research shows that sleep deficiency can cause a host of physical symptoms, including clumsiness and proneness to accidents."
    },
    {
      "title": "Avoid judging yourself.",
      "content": "Avoid judging yourself. Clumsiness can cause a spiral of embarrassment and self-judgment, which in turn can increase anxiety and cause more clumsiness. Understand that everyone has the occasional klutz moment, and that even chronic clumsiness doesn’t mean anything is wrong with you. [12] X Research source If you find yourself feeling embarrassed after a trip or a slip, try taking a few deep breaths. Deep, controlled breaths can enhance your sense of calm and self-collectedness, and can stop the cycle of self-blame in its tracks."
    },
    {
      "title": "Understand some warning signs.",
      "content": "Understand some warning signs. While some people are naturally clumsy, and many of us have occasional bouts of clumsiness, conditions such as diabetes, stroke, Parkinson’s disease, and dyspraxia (a syndrome that affects mostly children) can also cause consistent problems with coordination and clumsiness. [13] X Research source If you experience consistent dizziness or nausea, this could be a sign of blood sugar issues such as diabetes. Seek medical help if these symptoms are a frequent problem Sudden numbness or weakness, difficulty seeing, and loss of balance or coordination can be signs of a stroke. Call for emergency assistance immediately if you experience these symptoms. If your muscles sprain or strain easily, you experience frequent joint stiffness or muscle aches, or your joints dislocate easily, you may be suffering from a condition known as joint hypermobility. While this condition is usually not life-threatening, you should talk with a physician if you frequently experience these symptoms."
    },
    {
      "title": "Understand the side-effects of your medication.",
      "content": "Understand the side-effects of your medication. Many medications, including psychiatric medications, migraine medications, and even allergy medications, can cause dizziness, balance issues, and a loss of coordination as side effects. These symptoms may be exacerbated by consuming alcohol. If you take medications that cause any of these side-effects, pay extra attention to your surroundings to reduce your chance of accidents. If you feel as though the side-effects of your medication have become unmanageable, talk with your doctor. He or she may able to suggest an alternative medication."
    },
    {
      "title": "Visit your doctor.",
      "content": "Visit your doctor. If despite your increased attentiveness and physical training you’re still having coordination issues, your clumsiness may be a symptom of a more serious medical issue. Visit your doctor and explain the issues you’re having to see if any treatments are available."
    }
  ]
}