{
  "url": "https://www.wikihow.com/Take-Notes-from-a-Textbook",
  "title": "How to Take Notes from a Textbook",
  "steps": [
    {
      "title": "Be selective but thorough.",
      "content": "Be selective but thorough. You should not write down every piece of information in the book. Nor should you write down one fact per page, or you might end up wasting precious time, since you will need to read through your notes to find valuable information. Finding the right balance of writing enough but not too much can be a challenge, but it is the key to taking effective notes. Using the strategy of reading a paragraph and then summarizing it can help you target the right amount of information. Depending on the subject and the level of the textbook, writing 1-2 sentences of summary per paragraph may be the right ratio of information to note-taking."
    },
    {
      "title": "Paraphrase information from the text.",
      "content": "Paraphrase information from the text. You should write your notes in your own words. Paraphrasing information usually shows that you genuinely understood what you read (it’s difficult to put something into your own words if you don’t know what it means). It will likely be more meaningful to you later when you are reviewing your notes if you have written them in your own words. [1] X Research source"
    },
    {
      "title": "Use a format that works for you.",
      "content": "Use a format that works for you. Your notes may take on the form of a bulleted list of information. You might draw yourself a timeline of events so that you can see the order that things happened and not just a list of events. You may draw a kind of flow chart to emphasize a sequence. Or you might do a more traditional outline with big ideas at one level and then supporting ideas indented underneath. Ultimately, the notes are your study aid, so it’s best to write them in a way that makes sense to you. Developing a system that works for you is extremely important. Do your best to become self aware and to figure out what system works best for your learning style."
    },
    {
      "title": "Add visual elements if it helps you.",
      "content": "Add visual elements if it helps you. Visual learners are often helped by visual representations in their own notes. You might want to jot down a brief copy of a graph instead of writing information about it. You may want to draw a simple comic strip to show a specific event or interaction between people. Don’t let adding visual elements distract you from the task at hand—understanding and taking notes on the text—but add visuals if it will help you synthesize or remember the material more effectively. [2] X Research source"
    },
    {
      "title": "Organize your notes in a meaningful way.",
      "content": "Organize your notes in a meaningful way. Depending on the subject, you may want to organize your notes in a particular way. History notes may be most logically taken in chronological order (or even in the format of a timeline). Science notes, however, may need to be taken in a particular sequence that shows mastery of one concept before moving on to the next. [3] X Research source If in doubt about how to organize your notes, go with the textbook’s organization. If information is written in a certain order in the textbook, and there is usually a reason for it. It's also a good idea to separate your notes in different folders for each class, so they don't get mixed up and you don't confuse subjects."
    },
    {
      "title": "Know your assigned reading.",
      "content": "Know your assigned reading. Check any syllabus, calendar, or notes from class that direct you to read a section or sections from your textbook. Ideally, you should give yourself at least 5 minutes per page of assigned textbook reading. [4] X Research source If you are a slower reader, you may need to give yourself additional time to read."
    },
    {
      "title": "Read over chapter headings and subheadings.",
      "content": "Read over chapter headings and subheadings. Before you begin reading or taking notes, preview the chapter. Most textbooks are broken into more easily-digestible sections that are often topped with headings. Previewing the chapter and looking at the headings and subheadings from beginning to end can give you a sense of the length and trajectory of the chapter. You may also cue into keywords as you are reading if you have seen them in bolded subheadings later in the chapter. [5] X Research source Also look for any words that are presented in bold. These are often key concepts or vocabulary words that are defined within the chapter or in the glossary. If there are not headings or subheadings in your textbook, read the first sentence of each paragraph."
    },
    {
      "title": "Look over supplemental charts, graphs, or informational charts.",
      "content": "Look over supplemental charts, graphs, or informational charts. Many students ignore or skip over information in boxes or charts within the chapter. This is a bad plan, however; that information is often key to understanding or reviewing the chapter’s main concepts. Looking at the supplemental material (and reading the captions below pictures or charts) can help you focus on key information while you read. [6] X Research source"
    },
    {
      "title": "Read “review questions” at the end of the chapter or section.",
      "content": "Read “review questions” at the end of the chapter or section. Review questions are given to ensure that students have taken away “big picture” or essential concepts from a selection of text. Reading these review questions ahead of time can help focus your attention to the most important aspects of a chapter."
    },
    {
      "title": "Avoid distractions.",
      "content": "Avoid distractions. Reading actively without any background noise or diversions can make it easier to focus and retain the information you learn. It is especially important to be free of distractions if you are learning new material or reading about complex ideas. Find an area that is quiet and comfortable, and settle in to read and learn."
    },
    {
      "title": "Divide your assigned text into manageable sections.",
      "content": "Divide your assigned text into manageable sections. If you have to read a 30-page chapter, you should try to break that chapter up into smaller focus sections. The length of the sections may depend on your attention span. Some people recommend breaking reading into 10-page chunks, but if you have difficulty focusing on and digesting large portions of text, you might want to limit your sections to 5-pages. The chapter itself may also be divided into more manageable sections. [7] X Research source"
    },
    {
      "title": "Read actively.",
      "content": "Read actively. It can be easy to passively read something that you find complex or uninteresting. Passive reading occurs when your eyes are looking at each word, but you don’t retain any information or think about what you read. To read actively, try to think while you’re reading. This means that you should be trying to summarize ideas, connect ideas to other concepts that you’re familiar with, or ask questions to yourself or the text while you read. [8] X Research source To read actively, do not try to take notes or highlight anything the first time you read through a section of text; instead, just focus on reading to understand."
    },
    {
      "title": "Use tools to aid your understanding.",
      "content": "Use tools to aid your understanding. Be sure that you understand the text as you are reading it. You may need to use a dictionary or the textbook’s glossary or index to define unfamiliar words. When you get to the note-taking stage, write down new key words that are important to the chapter along with the page number where you found that term and definition. That way you can refer back to the textbook easily if you need to."
    },
    {
      "title": "Summarize main points as you go.",
      "content": "Summarize main points as you go. After reading through each section of text (whether it is a section you divided yourself or a division made by the textbook), think about the main points. Try to summarize the section and identify the one to three most important details of the section. [9] X Research source"
    },
    {
      "title": "Do not skim over supplemental material.",
      "content": "Do not skim over supplemental material. Hopefully you looked at supplemental materials such as pictures, charts, and graphs when you previewed the chapter. If you did not, be sure that you read them as you progress through reading the section. Viewing these details in context will help you synthesize the information. These types of supplements may be of particular benefit to students who tend to be visual learners. When trying to recall information, you may be able to conjure the way a graph or chart looked more easily than a piece of factual information."
    },
    {
      "title": "Pay attention to class lectures.",
      "content": "Pay attention to class lectures. Teachers will often specify which chapters or sections of a textbook will be most relevant for an upcoming test. Knowing this information before you read the textbook can save you time and energy, and allow you to focus on what’s most important to know. [10] X Trustworthy Source Darmouth University Academic Skills Center Center within Dartmouth University dedicated to assisting students achieve academic goals by providing pedagogical resources Go to source Write down whatever your instructor writes on the board. These pieces of information are most likely to be relevant for future discussions and upcoming assignments or tests. Ask your instructor if he or she would allow you to use a personal recording device to record the lecture and listen to it at home. Anything that you missed while taking notes in class will be heard on the recording, and you can add that information to your notes after class."
    },
    {
      "title": "Learn to shorthand.",
      "content": "Learn to shorthand . It may be difficult to write notes as quickly as the instructor is speaking. Learning to write shorthand is a great way to ensure that the notes you take in class cover everything the instructor expects you to know. Write down major names, places, dates, events, and concepts. If you cover these topics in your notes, it will likely be much easier to remember the specifics surrounding those people or places when you go back to the textbook. Follow major topics with brief context clues. These can be a few words or even a short sentence, but having some type of brief notes will help you make sense of the names or dates you’ve written down during the lecture."
    },
    {
      "title": "Review your notes from class.",
      "content": "Review your notes from class. Now that you have notes from the in-class lecture, you’ll want to review those notes to begin learning the important topics covered in class. Try to read over your notes shortly after class has ended. Reviewing your notes immediately after class is over will most likely help you retain that information for a longer period of time."
    },
    {
      "title": "Combine class notes with textbook notes.",
      "content": "Combine class notes with textbook notes. If you have notes from class and from your textbook, combine and compare them. You should identify anything that was emphasized by both the textbook and your instructor; this is likely to be a very important concept."
    },
    {
      "title": "Study your notes.",
      "content": "Study your notes. Think of your notes as a study guide for your course exams. The act of writing might help you remember certain things, but you probably won’t remember everything in the textbook if you’re not studying the notes you’ve taken. Going back to review the notes can help you remember key concepts and specific terms, even months after you covered the information. [11] X Research source"
    },
    {
      "title": "Share your notes.",
      "content": "Share your notes. If you work with other students in your class, you may want to exchange and share notes. This can be a helpful strategy, as different students may focus or emphasize different concepts. Additionally, if you have a friend or classmate who missed class or didn’t understand a concept, you can share your notes to help her."
    },
    {
      "title": "Make flash cards.",
      "content": "Make flash cards. If you have an impending exam, you can convert your notes into flashcards. These can make it easier to learn and memorize names, dates, and definitions. Additionally, you can use these flashcards to collaborate and study with another student or in a study group, which improves test performance. [12] X Research source"
    }
  ]
}