{
  "url": "https://www.wikihow.com/Take-Care-of-Swords",
  "title": "How to Take Care of Swords",
  "steps": [
    {
      "title": "Use a lint-free cloth to remove factory grease.",
      "content": "Use a lint-free cloth to remove factory grease. When you purchase your sword from a factory producer or even a collector, it will likely be shipped with a thick coating of oil or grease. Once you receive your sword, immediately remove this grease with a lint-free, cotton cloth. Always wipe your blade in straight, one-directional strokes to prevent injury. Move from the bottom of the sword toward the tip, putting less pressure on the tip. When cleaning Japanese swords, use rice paper instead of lint-free cotton cloths. Coffee filters will also work as a cheap alternative. [1] X Research source"
    },
    {
      "title": "Apply lacquer thinner to swords for stubborn gunk.",
      "content": "Apply lacquer thinner to swords for stubborn gunk. Your lint-free cloth may not be enough to remove some dirt, dust, or gunk. This could include the factory grease. Pour a very small amount of lacquer thinner onto a different cloth and rub the gunk off, using the same straight, one-directional motions. Use another lint-free cloth to remove any remaining lacquer thinner."
    },
    {
      "title": "Use lacquer thinner with benzene to wipe gunk off Japanese swords.",
      "content": "Use lacquer thinner with benzene to wipe gunk off Japanese swords. Japanese swords sometimes require slightly different cleaning materials than steel swords. Ensure that your lacquer thinner contains benzene when cleaning these items."
    },
    {
      "title": "Wipe the blade dry to prevent moisture damage.",
      "content": "Wipe the blade dry to prevent moisture damage. Using a fresh cloth, piece of rice paper, or coffee filter, completely dry your blade. This will remove any remaining dust and cleaning solution. Having a dry, clean blade before you oil the metal is essential for preventing moisture damage. [2] X Research source"
    },
    {
      "title": "Choose sewing machine oil for a basic and cheap oiling material.",
      "content": "Choose sewing machine oil for a basic and cheap oiling material. All swords are highly prone to rusting. In order to protect the metal, these items need routine application of a protective coat of oil. Sewing machine oil, which is a type of mineral oil, is an easy-to-find and cheap option for preserving your swords. [3] X Research source"
    },
    {
      "title": "Pick choji oil for traditional oiling of Japanese swords.",
      "content": "Pick choji oil for traditional oiling of Japanese swords. When oiling Japanese swords, you may choose to use more traditional cleaning and preservation materials. Choji oil is a type of mineral oil that also contains clove oil. This solution might be difficult to find and more expensive. Sewing machine oil will also work for these items. [4] X Research source"
    },
    {
      "title": "Put a small amount of oil on a lint-free cloth.",
      "content": "Put a small amount of oil on a lint-free cloth. For both Japanese and steel swords, use a lint-free cotton cloth for oiling. Pour or spray a very small amount of oil on the cloth. Apply just enough oil to make a small circle on the cloth. [5] X Research source To avoid over-oiling, you can also apply the oil directly onto the sword with an eye dropper. [6] X Research source"
    },
    {
      "title": "Wipe the oil onto the entire length of the blade.",
      "content": "Wipe the oil onto the entire length of the blade. Use the same one-directional, straight motions as during cleaning when applying oil. Make sure the entire metal portion of the sword is covered in oil. Work slowly and carefully to avoid injury. [7] X Research source"
    },
    {
      "title": "Avoid over-oiling the blade by wiping away excess oil.",
      "content": "Avoid over-oiling the blade by wiping away excess oil. Aim for a light coat of oil that just barely gleams when exposed to light. Oil should not be dripping off the sword. Ensure that your coat is thin and even by using a fresh cloth to cover any remaining bare spots and remove any excess oil. [8] X Research source"
    },
    {
      "title": "Repeat oiling every ten days with new swords.",
      "content": "Repeat oiling every ten days with new swords. It’s important to constantly check and see how new swords react to your climate. Continue this process for about six months to protect the sword and allow it to adjust to your area. If it appears that your oil is wearing off, re-apply the layer immediately."
    },
    {
      "title": "Continue oiling each week in humid climates.",
      "content": "Continue oiling each week in humid climates. If you live in an area that receives constant rain or high-humidity weather, take extra care with your metal. These regions put your swords at higher risk for developing rust. Rust can form quickly, so you may want to check the metal every couple of days, especially after you first make your purchase. [9] X Research source"
    },
    {
      "title": "Repeat oiling monthly in dry, temperate climates.",
      "content": "Repeat oiling monthly in dry, temperate climates. Rust is a slightly less scary enemy in regions that don’t receive too much moisture. Still, water is everywhere! Don’t get too relaxed in these regions, and continue oiling your sword about once a month. [10] X Research source"
    },
    {
      "title": "Coat wooden sword handles lightly with lemon oil every six months.",
      "content": "Coat wooden sword handles lightly with lemon oil every six months. While these pieces of your sword don’t require quite as much care as the metal, they may crack if they’re not properly maintained. To keep the wood protected and supple, apply a very light layer or lemon oil to the wood using a soft cotton cloth. You should only need to do this every six months or so. Increase the frequency if you notice any small cracks in the material. [11] X Research source"
    },
    {
      "title": "Use leather wax paste on leather hilts to prevent cracking.",
      "content": "Use leather wax paste on leather hilts to prevent cracking. Just like wooden handles, leather handles may crack if they don’t receive a bit of routine care. Maintain this part of your sword by rubbing a small amount of leather wax paste onto the material with a soft cloth. As with wooden handles, you shouldn’t need to do this more than once or twice a year. [12] X Research source Ensure that the oils you use to protect the metal on your sword don’t touch the leather handle. This can cause the leather to rot. You may want to protect the leather with plastic wrap whenever you oil the blade."
    },
    {
      "title": "Coat your sword in petroleum jelly and wrap in rags to store.",
      "content": "Coat your sword in petroleum jelly and wrap in rags to store. If you’re not displaying your sword by hanging it on the wall, you may want to put it away in storage. To safely store swords for long periods of time, keep them out of their scabbards. Instead, apply a think coat of petroleum jelly, wrap the sword in several layers of rags, and tie the rags to secure them. [13] X Research source"
    },
    {
      "title": "Choose Renaissance wax for professional-grade storage.",
      "content": "Choose Renaissance wax for professional-grade storage. If you’re worried about petroleum jelly damaging your sword, you may want to try Renaissance wax. This material is used by museums when they store their sword collections. It’s more expensive, but you don’t need to use as much when coating the metal. Wrap the sword in rags and tie once you’ve applied the wax. [14] X Research source Renaissance wax can also provide long-term protection for swords on display."
    },
    {
      "title": "Keep the sword in a cool, dry place when storing.",
      "content": "Keep the sword in a cool, dry place when storing. Extreme temperatures may damage your sword. Your sword will store best in an air-conditioned, dry space. These conditions will help avoid any rust from forming on the metal, and they should also prevent your handles from cracking. [15] X Research source Do not store your swords in leather scabbards. This will quickly cause the blade to rust. While wooden scabbards are a better option than leather, they, too, will not protect the blade as well as well-secured rags and ties."
    },
    {
      "title": "Prevent scratches by gently handling your sword.",
      "content": "Prevent scratches by gently handling your sword. While you may want to test your sword out by cutting trees or banging it against hard objects, this will damage the material. If you want to prevent scratches, do not engage in these practices. You may cause damage that even a professional sword polisher can’t fix. Some people choose to purposefully buy sturdier swords so they can handle them with less fear of damaging the metal. Even if you buy one of these swords, exercise caution and be prepared for damage."
    },
    {
      "title": "Avoid overhandling to minimize damage from your skin’s natural oils.",
      "content": "Avoid overhandling to minimize damage from your skin’s natural oils. Any time you touch your sword, you’re exposing it to any natural oils or foreign material on your skin. While you should always clean and dry your hands before handling your sword, this will provide only minimal protection. If you’re worried about damaging the metal, you can wear cotton gloves when handling the sword. Don’t wear these gloves when cleaning, oiling, or polishing the sword, as they won’t provide you with the mobility you need to safely complete these processes."
    },
    {
      "title": "Remove rust and scratches with metal abrasive pads.",
      "content": "Remove rust and scratches with metal abrasive pads. These pads come in coarse, medium, and fine grit. Attack small scratches or rust spots with the medium and fine pads, and use the coarse pads on deeper damage. You’ll want to slowly move through this process: [16] X Research source Lay the sword down on a flat, secure surface. The tip of the blade should be facing away from you. Rub the sandpaper over the damaged area in one-directional, straight motions. Focus on small areas, moving through them one at a time. Finish with the fine abrasive pad to provide a satiny, scratchless metal surface. Clean any rust dust off the metal with a soft cloth, and oil the blade as you normally would. If rust develops on more expensive swords, call a professional. You don’t want to cause further damage to valuable items by trying to fix them yourself."
    },
    {
      "title": "Polish steel blades with Scotch-brite pads and metal polish.",
      "content": "Polish steel blades with Scotch-brite pads and metal polish. If you want to create a mirror-like finish on your blade, put a small amount of metal polish on a Scotch-brite pad. Rub this solution onto the blade, moving only in straight motions. You’ll be tempted to buff the metal in circles, but resist this urge! Apply high pressure to the pad to receive the proper polish. Finish by cleaning and oiling the blade as you normally would. [17] X Research source"
    },
    {
      "title": "Polish Japanese blades with an Uchiko ball.",
      "content": "Polish Japanese blades with an Uchiko ball. Japanese blades require a unique polishing process. When you purchase your blade, it may include an Uchiko ball, or a silk ball on a stick that contains stone powder. Gently tap the Uchiko ball against the blade every 1-2 inches (2-4 cm) to release a light film of stone powder along the entire length of both sides of the blade. Then wipe the powder off the blade with a clean cotton cloth, moving from hilt to tip in straight, one-directional swipes. [18] X Research source"
    },
    {
      "title": "Use flour for a cheap alternative to the Uchiko ball.",
      "content": "Use flour for a cheap alternative to the Uchiko ball. If you don’t have access to this traditional Japanese tool, flour from your kitchen cabinet works as well. Simply sprinkle flour over the blade using your pinched fingers. As with the Uchiko ball, wipe the powder off the blade with a clean cotton cloth, moving from hilt to tip in straight, one-directional swipes. [19] X Research source"
    },
    {
      "title": "Use a professional for deep nicks or extensive rust damage.",
      "content": "Use a professional for deep nicks or extensive rust damage. Any time that your blade becomes extensively damaged, get in touch with a professional. If you attempt to fix this damage yourself, you may end up ruining the item. Professional polishers can be found online, although they may require you to ship your sword to them. You may also be able to rely on local knife shops for repair, which may ease any shipping woes."
    }
  ]
}