{
  "url": "https://www.wikihow.com/Types-of-Ear-Piercings",
  "title": "The Ultimate Guide to Every Type of Ear Piercing",
  "steps": [
    {
      "title": "Lobe",
      "content": "Lobe Lobe piercings are the most traditional type of ear piercing. They go through the fleshy part at the bottom of the ear, and since there isn’t any cartilage there, it tends to be one of the least painful ear piercings. Go with a single lobe piercing for a subtle, classic look, or change things up with a side-by-side double lobe piercing. Pain level: Minimal Healing time: 3–6 months [1] X Research source Recommended jewelry: Anything goes for lobe piercings—from simple studs and classic hoops to chunky chandelier earrings and dangly charms !"
    },
    {
      "title": "Upper Lobe/High Lobe",
      "content": "Upper Lobe/High Lobe Upper lobe piercings are higher than those on the traditional lobe, sitting just below or right at the bottom of the cartilage. This is a good option for accentuating lobe piercings or for balancing out the bottom part of your ear if you have a lot of cartilage piercings. [2] X Research source Pain level: Minimal if not pierced through cartilage, otherwise moderate Healing time: 3–6 months Recommended jewelry: Daintier jewelry usually looks best here, like studs , mini hoops and huggies , or dangling earrings ."
    },
    {
      "title": "Stacked Lobe",
      "content": "Stacked Lobe Sometimes called constellation piercings, stacked lobe piercings cluster a small group of piercings on top of each other instead of lining each piercing up neatly. This is a fun way to change up your look, and if you have the space, can be added to your existing lobe piercings. [3] X Research source Pain level: Minimal, but may be more painful if you get multiple piercings at once Healing time: 3–6 months Recommended jewelry: Tiny studs work best for stacked lobe piercings to allow room for each piece."
    },
    {
      "title": "Transverse Lobe",
      "content": "Transverse Lobe If regular lobe piercings are way too basic for you, try a transverse piercing. For this, a barbell sits horizontally in the bottom of your earlobe. The balls on either side of the barbell look like two small studs suspended on the very bottom of your earlobe. [4] X Research source Pain level: Minimal Healing time: 3–6 months Recommended jewelry: Barbell or curved barbell"
    },
    {
      "title": "Helix",
      "content": "Helix Helix piercings are located in the cartilage along the top, outside edge of your ear. These are probably the most common after lobe piercings. It’s a great option if you want to branch out but aren’t sure edgier piercings are right for you—but they’re also a good starting point if you want all the piercings , so really, you can’t go wrong. [5] X Research source Pain level: Moderate Healing time: 6–12 months Recommended jewelry: Mini hoops and huggies or studs with a flat back"
    },
    {
      "title": "Forward Helix",
      "content": "Forward Helix The forward helix is the top front edge of the ear, where the helix curves down close to the face. It’s edgy but not overly so—a good choice if you want something untraditional but subtle. Or, stack 2 or 3 piercings here for an even bolder look. [6] X Research source Pain level: Moderate-high Healing time: 4–6 months Recommended jewelry: Dainty studs or very tiny hoops"
    },
    {
      "title": "Hidden Helix",
      "content": "Hidden Helix A hidden helix piercing is placed under the fold of the helix. It’s located just inside the upper helix. Because the bar of the jewelry is hidden, after this piercing heals, you can wear a cartilage earring or a special hidden helix earring that makes it look like a tiny chain is dangling inside the top of your ear. [7] X Research source Pain level: Moderate Healing time: 4–6 months Recommended jewelry: Wear a curved barbell while it heals, then downsize to a cartilage earring or a hidden helix earring ."
    },
    {
      "title": "Flat",
      "content": "Flat Flat piercings go through the flat part of your ear just inside your helix, or outer ear. This is a pretty rare piercing, so it’s a good choice if you’re looking to change things up with something a little different. [8] X Research source Pain level: Moderate Healing time: 6–12 months Recommended jewelry: Tiny studs or cartilage earrings"
    },
    {
      "title": "Auricle/Mid-Helix",
      "content": "Auricle/Mid-Helix Auricle piercings, also called mid-helix piercings, are placed about halfway up the outside of your ear. This can be a great way to tie your top and bottom piercings together without going into the center part of your ear. [9] X Research source Pain level: Moderate-high Healing time: 3–9 months Recommended jewelry: Small studs and tiny hoops look great in the auricle."
    },
    {
      "title": "Outer Conch/Contraconch",
      "content": "Outer Conch/Contraconch Conch piercings are named for the conch-shaped part of your ear that’s outside of your ear canal but inside of the helix. The outer conch, or contraconch, is the more visible upper part of this section—the cartilage tends to be thinner here, so some people find that the outer conch is a little less painful than other cartilage piercings. [10] X Research source Pain level: Moderate Healing time: 6–12 months Recommended jewelry: Small stud or a hoop that goes around the outside of your ear"
    },
    {
      "title": "Inner Conch",
      "content": "Inner Conch The inner conch is located on the inside edge of the conch, closer to the ear canal. Because the cartilage is usually thicker here, this tends to be a more painful piercing than the outer conch. [11] X Research source Pain level: Moderate-high Healing time: 6–12 months Recommended jewelry: Small stud"
    },
    {
      "title": "Daith",
      "content": "Daith Daith piercings go through the thick piece of cartilage at the bottom of your helix, just above your ear canal. They tend to be fairly painful, but they’re cute and a great option if you want something uncommon. [12] X Research source And, some people believe that daith piercings can help relieve migraine pain. [13] X Research source Pain level: Moderate-high Healing time: 6–18 months Recommended jewelry: Thin clicker hoops are the most comfortable in a daith."
    },
    {
      "title": "Rook",
      "content": "Rook The rook is the fold at the top of the inner ear, just inside the forward helix. It’s a cute way to change things up if you’re really feeling experimental, and it looks especially good paired with multiple piercings in the lobe and helix. [14] X Research source Pain level: Moderate-high Healing time: 6–18 months Recommended jewelry: Wear a small curved barbell or a tiny hoop"
    },
    {
      "title": "Hidden rook",
      "content": "Hidden rook Similar to a hidden helix, a hidden rook is placed behind a traditional rook piercing. This hides the solid piece of the jewelry, so after it heals, you can wear a hidden rook earring with a tiny dangling chain on the inside center of your ear. [15] X Research source Pain level: Moderate-high Healing time: 6–18 months Recommended jewelry: Wear a curved barbell while the piercing heals, then switch to a hidden rook earring ."
    },
    {
      "title": "Tragus",
      "content": "Tragus The tragus is the small piece of your ear that covers your ear canal—the area where your ear meets your face. This is a great piercing for anyone who wants an edgy look, but it takes a long time to heal. [16] X Research source Pain level: Moderate Healing time: 12–18 months Recommended jewelry: Studs or small hoops"
    },
    {
      "title": "Anti-tragus",
      "content": "Anti-tragus The anti-tragus sits on the inside edge of your helix directly across from the tragus and just above the earlobe. It can be a fun way to add another piece to your lower ear—but be warned that this is considered a fairly painful piercing, and it can take a while to heal. An anti-tragus may also cost slightly more than other cartilage piercings. [17] X Research source Pain level: Moderate-high Healing time: 6–12 months Recommended jewelry: Tiny studs and micro-hoops"
    },
    {
      "title": "Snug(Anti-helix)",
      "content": "Snug(Anti-helix) Snug piercings are located just above the anti-tragus and just inside the mid-helix. But not everyone can get a piercing here—it depends on the width of the cartilage fold. So if your ear is shaped right for this piercing, show it off proudly! [18] X Research source Pain level: High Healing time: 4–6 months Recommended jewelry: Wear a curved barbell while it’s healing. Afterward, clip a small hoop around the fold of cartilage that leads into the conch."
    },
    {
      "title": "Industrial",
      "content": "Industrial Industrials are about as bold as it gets. An industrial features two piercings—typically at the front and back of the helix. A long barbell reaches across both piercings for a head-turning look. Note that because you have to be pierced twice, industrials may cost twice as much as a standard piercing. [19] X Research source Pain level: Moderate-high Healing time: 9–12 months Recommended jewelry: You’ll need a special industrial barbell for this piercing."
    },
    {
      "title": "Orbital",
      "content": "Orbital Orbital piercings are two piercings, but you wear one hoop that passes through both of them. They’re often confused with conch piercings (some people use the word “orbital” to mean a conch piercing with a hoop through it), but these can be placed anywhere, including the orbital or lobe. [20] X Research source Pain level: Moderate-high Healing time: 3–12 months Recommended jewelry: Orbitals are always worn with a hoop ."
    },
    {
      "title": "Spider Bite/Snakebite",
      "content": "Spider Bite/Snakebite Spider bites (sometimes called snakebites) are two piercings placed close together, like the marks left by a spider or a snake bite. They’re often placed in the mid helix, but they’re also popular in the lobe and the top of the helix. [21] X Research source Pain level: Moderate-high Healing time: 3–12 months Recommended jewelry: Most spider bites are worn with two small studs ."
    },
    {
      "title": "Avoid touching the piercing as much as possible.",
      "content": "Avoid touching the piercing as much as possible. When you’re caring for a new piercing , keep your hands off. Sanford says, “The most important part of taking care of any piercing is that you don’t touch or move it. Don’t pick at it or aggressively clean it with cotton swabs. To heal, the piercing really needs to be left alone.” Sanford adds, “If you wear glasses, try to keep them from bumping the piercing. “"
    },
    {
      "title": "Rinse your piercing each time you take a shower.",
      "content": "Rinse your piercing each time you take a shower. Sanford says, “The best way to clean any piercing is to rinse it in the shower. At the end of your shower, let the hot water run over it to rinse away any buildup, soap residue, shampoo, or anything else that’s accumulated.” Sanford adds, “You can also use a sterile saline wound wash to clean your piercing once or twice a day.”"
    },
    {
      "title": "Try not to sleep on the same side as the piercing.",
      "content": "Try not to sleep on the same side as the piercing. Professional body piercer Sasha Blue advises, “While your ear piercing is healing, try to avoid sleeping on that side.” That way, you’ll avoid irritation that could potentially make the piercing take longer to heal."
    },
    {
      "title": "Wait until your ear is fully healed before changing the jewelry.",
      "content": "Wait until your ear is fully healed before changing the jewelry. Body piercer David Wilkins says you’ll know a piercing is healed when you don’t see any more crusty discharge forming on the jewelry. “Also, the edges of the holes will have more of a rounded edge.”"
    },
    {
      "title": "Have your piercing done at a reputable location.",
      "content": "Have your piercing done at a reputable location. Piercing specialist Stephanie Anders says, “Do your research and go to a high-quality studio. It’s just as important as it is when you’re getting a tattoo, but it tends to be overlooked.” Be sure you choose a studio that’s licensed and clean. [22] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Sanford agrees, saying, “Go somewhere reputable, and don’t try to do a piercing at home. There are so many risks and potential contaminants in a home, and it’s just not going to be as sterile as a studio.”"
    },
    {
      "title": "Choose a studio that uses piercing needles rather than guns.",
      "content": "Choose a studio that uses piercing needles rather than guns. Most of us are familiar with the ear-piercing guns used at mall kiosks and jewelry shops, but most piercing professionals actually discourage their use. In fact, the Association of Professional Piercers disallows their use for members, citing difficulty sterilizing the tools and the potential for tissue damage. [23] X Research source"
    },
    {
      "title": "What is the 3/2 piercing rule?",
      "content": "What is the 3/2 piercing rule? The 3/2 piercing rule is a guideline that says for a balanced look, you should keep a 3:2 ratio of piercings on the top and bottom of your ear. For instance, you might have 6 piercings on top and 4 on bottom, or 3 on bottom and 2 on top."
    },
    {
      "title": "What is the prettiest ear piercing to get?",
      "content": "What is the prettiest ear piercing to get? The prettiest ear piercing is highly subjective. If you’re going for a simple look, the lobe piercing is a classic. Mid-helix and forward helix piercings are also very pretty."
    },
    {
      "title": "What ear piercing helps with headaches?",
      "content": "What ear piercing helps with headaches? The daith piercing is located near a pressure point in your ear. Some people believe that wearing an earring over this pressure point can help alleviate migraines. However, there isn’t currently any scientific research to support this. [24] X Research source"
    },
    {
      "title": "What is the rarest ear piercing?",
      "content": "What is the rarest ear piercing? Because the snug is considered very painful, it’s one of the rarer ear piercings. The rook is also fairly uncommon."
    },
    {
      "title": "Who shouldn’t get their ears pierced?",
      "content": "Who shouldn’t get their ears pierced? You shouldn’t get an ear piercing if you have an autoimmune disorder that could be triggered by trauma or infection, take blood thinners, or have a medical condition that could cause you to bleed uncontrollably. Also, avoid getting your ears pierced if you are prone to forming keloids, or scar tissue that forms knots. [25] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}