{
  "url": "https://www.wikihow.com/Socialize,-Be-Funny-and-Make-Friends",
  "title": "How to Socialize, Be Funny and Make Friends",
  "steps": [
    {
      "title": "Focus on the person you're with, not your phone.",
      "content": "Focus on the person you're with, not your phone. If people feel like you're ignoring them, they won't want to keep talking to you. However, keeping your focus on them will make them see you as a more interesting, caring person. Turn off the sound on your phone when you're out socializing, and don't check your notifications while you're in a conversation with someone. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you need to check your phone regularly, set aside time to do that. For instance, you might step away every hour to review your notifications. If you might receive a call that you need to take immediately, you can set your phone to \"Do Not Disturb\" and make that phone number an exception. For instance, you may need to allow calls from your babysitter."
    },
    {
      "title": "Identify your best qualities to improve your self esteem.",
      "content": "Identify your best qualities to improve your self esteem . Everyone is unique and interesting in their own way. To help you recognize your awesome qualities, make a list of your talents, skills, and interests. Additionally, pick out your best physical qualities so you can play them up. Over time, this will help you feel more confident . [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, you might write down that you play guitar, enjoy reading thrillers, like cats, and prefer staying home to going out. Your favorite physical qualities might be your eyes and your legs."
    },
    {
      "title": "Use open body language, like smiling and making eye contact.",
      "content": "Use open body language , like smiling and making eye contact. When you use open body language, people think you're more approachable. The easiest way to appear more open is to smile, make eye contact, and tilt your chin up. Additionally, avoid crossing your arms. Instead, keep them down at your sides. When you walk, use good posture by straightening your back and shoulders. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source When you're listening to someone, look at them and nod along to show them you understand. If you're talking, try to use hand gestures to involve people in the conversation. It's helpful to practice doing this while you're alone so that it feels natural when you do it with other people."
    },
    {
      "title": "Build your social skills slowly so you have time to adjust.",
      "content": "Build your social skills slowly so you have time to adjust. Learning to socialize may be hard for you, and that's okay. Start small by just smiling at people you pass in public. Then, try saying a simple “hello.” When you're ready, make small talk by asking people casual questions or making observations. After that, you can try introducing yourself to people and asking open-ended questions. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Don't worry about how long it takes you to get better at socializing. Give yourself the time you need. Keep things simple by sticking to short interactions at first. After you feel more comfortable, try to keep the conversation going."
    },
    {
      "title": "Banish the \"shoulds\" from your life and go after what you actually want.",
      "content": "Banish the \"shoulds\" from your life and go after what you actually want. You may feel like there is a list of things you \"should\" do, like going out more, attending parties, or making a bunch of friends. However, what's really important is what you enjoy doing. Think about where you're most comfortable and how you really enjoy spending your time. Then, replace your \"should\" statements with goals for making yourself happy. [5] X Research source For instance, let's say you're an introvert who tells yourself, \"I should go to parties more often.\" If you don't enjoy parties, don't try to force yourself to go. Perhaps you want to spend the evening in the bookstore or watching a movie instead. Similarly, you might be an extrovert who tells yourself, \"I should have a single best friend instead of a bunch of close friends.\" If your friends make you happy, that's all that matters."
    },
    {
      "title": "Be yourself",
      "content": "Be yourself so that people get to know the real you. It's hard to make real friends if you're pretending to be someone you're not. Even if you get people to like you, it will be hard to maintain the friendship. Instead, be honest about who you are so the right people will find you. Additionally, be respectful of others, and they'll likely respect you in return. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Speak your mind when you care about an issue. Try out new hobbies and interests, but be honest about what you enjoy doing. Wear clothes that make you feel your best, not what you think will impress other people. At the same time, don't be afraid to try out something new!"
    },
    {
      "title": "Attend local events so you're more involved in your community.",
      "content": "Attend local events so you're more involved in your community. You can find event postings online by checking Facebook events or local news sites. Additionally, you may find event postings on bulletin boards at your library, community center, or local coffee shops. Go to events that interest you so you can meet people who share your interests. [7] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. For instance, go to art openings, concerts, community movie nights, weekend markets, and festivals. It will likely take time for you to meet people who will make good friends. However, the more people you meet, the more likely you are to find someone who'll make a great friend. Just keep putting yourself out there."
    },
    {
      "title": "Join a club that's related to your interests.",
      "content": "Join a club that's related to your interests. Clubs are a fun way to meet people and start making friends. Look for a club that focuses on something you enjoy. Then, go to their meetings regularly. Talk to the people you meet there, and you'll likely make friends over time. [8] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. If you're still in school, look for an after-school or social club. Otherwise, look for clubs by searching online. Sites like Meetup.com and Facebook are also great for finding groups in your area."
    },
    {
      "title": "Take a class at a local community center, nonprofit, or college.",
      "content": "Take a class at a local community center, nonprofit, or college. Look for classes by contacting your local community organizations or colleges or by looking online. Pick a class on a subject you enjoy so that you'll meet people who share your interests. Then, attend all of the class sessions so you can get to know people. [9] X Research source You likely won't make friends on the first day of class. However, attending class regularly will help you get to know your classmates so you might become friends."
    },
    {
      "title": "Volunteer to help with an issue you care about.",
      "content": "Volunteer to help with an issue you care about. When you volunteer, you'll meet fellow volunteers and community members who need help. This can help you make new friends who already have things in common with you. Look for a nonprofit or activist group that works on an issue that interests you. Then, attend their events and meetings. [10] X Research source For instance, volunteer at a local animal shelter, distribute holiday gifts to families in need, or become a docent at a local museum."
    },
    {
      "title": "Join a recreational sports team.",
      "content": "Join a recreational sports team. Playing a team sport is a great way to make friends because it requires interaction between you and your teammates. Look for local sports teams by contacting your community center, checking the bulletin board at the library, or searching online. Then, sign up to play for a season. [11] X Research source Don't worry about being good at the sport. Recreational sports are good for people of all skill levels, and your teammates will help you get better. You may be able to find a team that's intended for your experience level or age. For instance, the recreational league in your area may have beginner and experienced teams. Similarly, they may separate teams based on your age group. Check with the organizers to learn your options."
    },
    {
      "title": "Attend a religious or spiritual service for fellowship.",
      "content": "Attend a religious or spiritual service for fellowship. If you have religious or spiritual beliefs, you can likely make friends by attending services. Similarly, many religious or spiritual organizations host social events for members, which will help you meet more people. Look for an organization in your area, then start attending their services or events. [12] X Research source If you aren't religious or spiritual, you may be able to find an organization in your area for people who have similar beliefs, like an atheist's group. If you don't have religious or spiritual beliefs, you can still attend community events hosted by local religious organizations. For instance, they may host charity events, festivals, holiday celebrations, and carnivals that are open to the community at-large."
    },
    {
      "title": "Introduce yourself to people you meet as a conversation starter.",
      "content": "Introduce yourself to people you meet as a conversation starter. Tell them your name and something about yourself. Try to tell them something you think will be relevant to the current situation. This will help you start conversations with people. [13] X Research source You might say, “Hi, I'm Jamie. This is my first time coming to one of these events,” or “Hey, my name is Lola. I was hoping there'd be snacks here.”"
    },
    {
      "title": "Give someone a compliment and try to keep the conversation going.",
      "content": "Give someone a compliment and try to keep the conversation going. People like hearing good things about themselves. Plus, giving people compliments will make them think you're nice. Look for reasons to offer someone a compliment. Then, keep the conversation going by asking a follow-up question. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Say, “That's a great dress! Where did you get it?” or “That story you told was so funny! Did you ever find out who pranked you?\" As a general rule, it's best to compliment things people can control, like their hair, clothes, skills, and talents. Try not to compliment their innate qualities, like their eye color or facial beauty, because this can make some people feel uncomfortable."
    },
    {
      "title": "Ask a question about the location or weather as an ice breaker.",
      "content": "Ask a question about the location or weather as an ice breaker. This is an easy way to make small talk with people you've just met. Don't worry about saying anything important. Pick out something in your environment and ask a simple question about it. When the person responds, try to keep the conversation going. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source It's okay if the conversation doesn't go anywhere. This is a lot like fishing; sometimes you'll get a bite, and other times the person just isn't interested. For instance, you might ask, “How are you coping with all this rain?” or “Have you been to this restaurant before?” Try to ask open-ended questions because they encourage the other person to keep talking. Open-ended questions require more than a “yes” or “no” answer, so they make it easier to keep a conversation going. Reader Poll: We asked 2266 wikiHow readers what strategy they prefer for changing topics, and only 10% of them agreed that the best way to do so is by using a conversation starter. [Take Poll] Instead, try to keep the conversation going organically based on what you’ve already been talking about."
    },
    {
      "title": "Show interest in people by asking them questions about themselves.",
      "content": "Show interest in people by asking them questions about themselves. People love talking about themselves, so showing interest in them is a great way to maintain a conversation. Even better, people will like you more because you listen to them. Ask the person you're talking to open-ended questions, then listen to their response with interest. [16] X Research source You might ask, “What do you like doing in your free time?” “How do you know Sam?” or “What's the last movie you saw?”"
    },
    {
      "title": "Make fun of yourself in a playful manner to make people laugh.",
      "content": "Make fun of yourself in a playful manner to make people laugh. Self-deprecating humor helps people relate to you and shows everyone that you don't take yourself too seriously. Tease yourself with jokes about your quirks, your mistakes, and the things you like. Then, laugh along with everyone else. For example, let's say you drop your drink. You might joke, “And the award for clumsiest person goes to…me.” As another example, you might say, “I would've been here sooner but I need an excavation team just to find my shoes because I'm so disorganized.” Sprinkle this type of humor throughout your conversations, but don't do it too much. People might get uncomfortable or perceive you as being negative if you make fun of yourself too often."
    },
    {
      "title": "Practice telling funny stories that you can use in conversations.",
      "content": "Practice telling funny stories that you can use in conversations. Telling amusing stories is a casual way to show people you're funny. Pick stories from your own life or things that happened to people you know. Then, practice telling them until your delivery sounds natural. For instance, practice them in the mirror or film yourself telling your stories. Keep in mind that you can repeat the same stories to different people, so don't feel like you need to constantly be finding new stories to tell."
    },
    {
      "title": "Learn jokes that you can repeat to others.",
      "content": "Learn jokes that you can repeat to others. Thinking up jokes on the spot is a rare talent, so it's helpful to have a go-to list of jokes. Read jokes online, watch stand-up comedy specials, or take a comedy writing class. Practice your delivery so you deliver the punchline with good timing. Here are some jokes to get you started: Why do you tell an actor to break a leg? Because every play has a cast. Did you hear about the new restaurant called Karma? There's no menu – you get what you deserve. I'm great at sleeping. I can do it with my eyes closed. Yesterday my friend asked me, “What rhymes with home?” Do you know what I said? No, it doesn't."
    }
  ]
}