{
  "url": "https://www.wikihow.com/TIG-Weld",
  "title": "How to TIG Weld",
  "steps": [
    {
      "title": "Put on safety gear.",
      "content": "Put on safety gear. Before operating any welding machine, make sure to put on protective eyewear, thick, fire-resistant clothing, and a welding helmet with an eye shield."
    },
    {
      "title": "Connect the TIG torch.",
      "content": "Connect the TIG torch. All TIG torches have a ceramic nozzle for directing argon, a copper sleeve for holding an electrode, and some way of cooling themselves. Use the adapter from your accessory package to plug the torch into the front of your machine."
    },
    {
      "title": "Plug your foot pedal into the machine.",
      "content": "Plug your foot pedal into the machine. The foot pedal is used to control the heat at which you are welding."
    },
    {
      "title": "Select the polarity.",
      "content": "Select the polarity. You will pick different settings based on the type of metal that you are welding. If you are using aluminum, place the welder on the alternating current (AC) setting. If you are using steel or other metals, place the welder on the DC Electrode Negative (DCEN) setting. If your welder has a high frequency setting, it will also need adjusting. For aluminum, the switch will need to be on continuous high frequency. For steel, it should be on high frequency start."
    },
    {
      "title": "Grind the tungsten.",
      "content": "Grind the tungsten. The thickness of the metal to be welded and the welding current used determine the size of the tungsten rod. Make sure to grind in a radial direction around the circumference of the tungsten, not straight toward the ends. Use the face of a fine stone to grind the tungsten electrode. Grind so that the electrode is pointing in the same direction as the rotation of the stone as a safety precaution. Grind the tungsten to a balled tip for AC welding and a pointed tip for DC welding. To make a butt weld or open corner weld ground the tungsten to a five to six millimeter stick. [1] X Research source"
    },
    {
      "title": "Set up the gas flow.",
      "content": "Set up the gas flow. You want to use a pure Argon gas or mixed Argon gas such as an Argon-Helium mixture. Remove the plastic protective cap. Shift the valve body by quickly opening and closing the valve to clean any debris out of the threaded valve body. Screw the regulator on, then screw the nut tight while simultaneously twisting the regulator until it is seated in the valve. Tighten the regulator using a spanner, making sure that the pressure knob is backed off counter-clockwise. Put on the gas hose and flowmeter, then turn on the cylinder valve. Make sure to turn on the cylinder valve gently and in small increments. Usually a quarter-turn revolution is enough. Finally, check for any leaks by listening for a wheezing sound or using an aerosol leak detector spray. Set the gas flow rate by adjusting the cylinder regulator. Though the rate may vary depending on your project, usually the rate stays between four and 12 liters (3.2 US gal) per minute."
    },
    {
      "title": "Set the amperage.",
      "content": "Set the amperage. The amperage allows you to regulate the control you have over the welding process. The thicker the metal, the higher the amperage. The more coordinated you get with the foot pedal, the higher you can leave the amperage. Some conventional current ratios are: 1.6mm, 30 to 120 amps; 2.4mm, 80 to 240 amps; 3.2mm, 200 to 380 amps. [2] X Research source"
    },
    {
      "title": "Clean your welding material.",
      "content": "Clean your welding material. Your surface must be clear of debris before you begin to weld. To prepare carbon steel, use a grinder or sander and polish it down to a bare, shiny metal. For aluminum, it is best to use a dedicated stainless steel wire brush. For stainless steel, just wipe down the weld area with some solvent on a rag. Make sure to store the rag and chemicals in a safe place before welding."
    },
    {
      "title": "Insert the tungsten electrode into its collet.",
      "content": "Insert the tungsten electrode into its collet. Unscrew the back of the electrode holder on the collet, insert the tungsten electrode, and screw the back on again. Generally, the electrode should hang about 1/4-inch away from the protective sheath on the collet."
    },
    {
      "title": "Clamp the parts together.",
      "content": "Clamp the parts together. Use an angle iron and/or a flat bar with c-clamps to secure the parts you want to weld together."
    },
    {
      "title": "Tack weld the parts together.",
      "content": "Tack weld the parts together. A tack weld is a very small weld that is intended to hold a part in place until the final weld can be completed. [3] X Research source Place tack welds every few inches where your two metals meet."
    },
    {
      "title": "Hold the TIG torch in your hand.",
      "content": "Hold the TIG torch in your hand. Be sure to hold it at about a 75 degree angle with the tungsten raised no more than 1/4-inch off the metal. Don't let the tungsten touch the work piece or it will contaminate your material."
    },
    {
      "title": "Practice using the foot pedals to control the heat.",
      "content": "Practice using the foot pedals to control the heat. Your weld puddle should be about 1/4-inch wide. It is important to keep your puddle size consistent throughout the weld to avoid a messy finish."
    },
    {
      "title": "Pick up the filler rod in your other hand.",
      "content": "Pick up the filler rod in your other hand. Hold it so it rests horizontally at a 15 degree angle from the work piece at the base where the torch will heat the piece."
    },
    {
      "title": "Use your torch to heat up the base metal.",
      "content": "Use your torch to heat up the base metal. The heat of the arc will create a puddle, a pool of molten metal that is used to fuse the two pieces of metal together. Once there is a puddle on both pieces of metal, tap the filler rod into the molten puddle in quick dabs to avoid clumping. The filler rod adds a reinforcement layer for your weld."
    },
    {
      "title": "Advance the puddle in the desired direction using your arc.",
      "content": "Advance the puddle in the desired direction using your arc. Unlike MIG welding, where you lead the puddle in the direction that the torch is leading, with TIG welding you push the puddle the opposite direction that the torch leans. Think of your hand motion as that of a left-handed person operating a pencil. While a right-handed person moves their pencil like a MIG weld, with the angles both tilted to the right, a left-handed person has their pencil tilted to the left, though they must push the pencil to the right. Continue to advance the puddle until you have welded the entire area desired and you've completed a TIG weld!"
    },
    {
      "title": "Fashion an easy fillet weld.",
      "content": "Fashion an easy fillet weld. Start off with a fillet weld to get the hang of TIG welding. A fillet weld is comprised of two metals joined at right angles. Run a weld puddle at a 45 degree angle to a 90 degree corner. A fillet weld should look like a triangle from the side. [4] X Research source"
    },
    {
      "title": "Weld a lap joint.",
      "content": "Weld a lap joint. Form the weld puddle between the edge of an overlapping piece of metal and the surface of the bottom piece of metal. When these pieces fuse together, dip the filler rod into the puddle."
    },
    {
      "title": "Make a T-joint to connect two pieces of metal at a right angle.",
      "content": "Make a T-joint to connect two pieces of metal at a right angle. Angle the torch so that there is direct heat on the flat surface of the metal. Hold a shorter arc by extending the electrode beyond the ceramic cone. Place the filler rod where the edge of the two metals meet."
    },
    {
      "title": "Melt a corner joint.",
      "content": "Melt a corner joint. Melt both edges of the metal where they meet in a point. Keep the weld puddle in the center of the joint where the two metals meet. You will need a significant amount of filler rod for a corner joint because the metals do not overlap."
    },
    {
      "title": "Create a butt weld.",
      "content": "Create a butt weld. Center the weld pool on the adjoining edges of two pieces of metal. This requires more skill that the other types of weld because the metals do not overlap. When finishing, decrease the amperage to fill in the crater that forms."
    }
  ]
}