{
  "url": "https://www.wikihow.com/Write-a-Thesis-Statement",
  "title": "How to Write a Thesis Statement",
  "steps": [
    {
      "title": "Start with a question -- then make the answer your thesis.",
      "content": "Start with a question -- then make the answer your thesis. Regardless of how complicated the subject is, almost any thesis can be constructed by answering a question. [1] X Research source Question: \"What are the benefits of using computers in a fourth-grade classroom?\" Thesis: \"Computers allow fourth graders an early advantage in technological and scientific education.\" Question: \"Why is the Mississippi River so important in Mark Twain's Huckleberry Finn ?\" Thesis: \"The river comes to symbolize both division and progress, as it separates our characters and country while still providing the best chance for Huck and Jim to get to know one another.\" Question: \"Why do people seem to get angry at vegans, feminists, and other \"morally righteous\" subgroups?\" Thesis: \"Through careful sociological study, we've found that people naturally assume that \"morally righteous\" people look down on them as \"inferior,\" causing anger and conflict where there generally is none.\""
    },
    {
      "title": "Tailor your thesis to the type of paper you're writing.",
      "content": "Tailor your thesis to the type of paper you're writing. Not all essays persuade, and not all essays teach. The goals of your paper will help you find the best thesis. [2] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Analytical: Breaks down something to better examine and understand it. Ex. \"This dynamic between different generations sparks much of the play’s tension, as age becomes a motive for the violence and unrest that rocks King Lear.\" Expository: Teaches or illuminates a point. Ex. \"The explosion of 1800s philosophies like Positivism, Marxism, and Darwinism undermined and refuted Christianity to instead focus on the real, tangible world.\" Argumentative: Makes a claim, or backs up an opinion, to change other peoples' minds. Ex. \"Without the steady hand and specific decisions of Barack Obama, America would never have recovered from the hole it entered in the early 2000s.\""
    },
    {
      "title": "Take a specific stance to make your thesis more powerful.",
      "content": "Take a specific stance to make your thesis more powerful. You should address a single issue in great detail so that your points can be fully supported in the body of the paper. [3] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Consider the following examples: \"While both sides fought the Civil War over the issue of slavery, the North fought for moral reasons while the South fought to preserve its own institutions.\" \"The primary problem of the American steel industry is the lack of funds to renovate outdated plants and equipment.\" \"Hemingway's stories helped create a new prose style by employing extensive dialogue, shorter sentences, and strong Anglo-Saxon words.\""
    },
    {
      "title": "Make the argument you've never seen before.",
      "content": "Make the argument you've never seen before. The best theses find a novel, exciting way to approach the topic. They're fresh and dynamic, which makes your essay fresh and dynamic. [4] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source \"After the third and fourth time you see him beat himself, one finally realizes that Huck Finn is literature's first full-blown sadomasochist.\" \"The advent of internet technology has rendered copyright laws irrelevant -- everyone can and should get writing, movies, art, and music for free.\" \"Though they have served admirably for the past two centuries, recent research shows that America needs to ditch the two-party system, and quickly.\""
    },
    {
      "title": "Ensure your thesis is provable.",
      "content": "Ensure your thesis is provable. Do not come up with your thesis and then look it up later. The thesis is the end point of your research, not the beginning. You need to use a thesis you can actually back up with evidence. [5] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Good Theses Examples: \"By owning up to the impossible contradictions, embracing them and questioning them, Blake forges his own faith, and is stronger for it. Ultimately, the only way for his poems to have faith is to temporarily lose it.\" \"According to its well-documented beliefs and philosophies, an existential society with no notion of either past or future cannot help but become stagnant.\" \"By reading “Ode to a Nightingale” through a modern deconstructionist lens, we can see how Keats viewed poetry as shifting and subjective, not some rigid form.\" Bad Theses Examples: \"The wrong people won the American Revolution.\" While striking and unique, who is \"right\" and who is \"wrong\" is exceptionally hard to prove, and very subjective. \"The theory of genetic inheritance is the binding theory of every human interaction.\" Too complicated and overzealous. The scope of \"every human interaction\" is just too big \"Paul Harding's novel Tinkers is ultimately a cry for help from a clearly depressed author.\" Unless you interviewed Harding extensively, or had a lot of real-life sources, you have no way of proving what is fact and what is fiction.\""
    },
    {
      "title": "State your thesis statement correctly.",
      "content": "State your thesis statement correctly. A thesis statement conveys to the reader the points and/or arguments you wish to make in a paper. It serves as a road map by telling the reader the direction of your argument or analysis and how you will interpret the importance of the subject. In the most simple of terms, a thesis statement answers the question, \"What is this paper about?\" Additionally, a thesis statement: [6] X Research source is an assertion, not a fact or observation. Facts are used within the paper to support your thesis. takes a stand, meaning it announces your position towards a particular topic. is the main idea and explains what you intend to discuss. answers a specific question and explains how you plan to support your argument. is debatable. Someone should be able to argue an alternate position, or conversely, support your claims."
    },
    {
      "title": "Get the sound right.",
      "content": "Get the sound right. You want your thesis statement to be identifiable as a thesis statement. You do this by taking a very particular tone and using specific kinds of phrasing and words. Use words like \"because\" and language which is firm and definitive. [7] X Research source Example thesis statements with good statement language include: \"Because of William the Conqueror's campaign into England, that nation developed the strength and culture it would need to eventually build the British Empire.\" \"Hemingway significantly changed literature by normalizing simplistic writing and frank tone.\""
    },
    {
      "title": "Know where to place a thesis statement.",
      "content": "Know where to place a thesis statement. Because of the role thesis statements play, they appear at the beginning of the paper, usually at the end of the first paragraph or somewhere in the introduction. [8] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Although most people look for the thesis at the end of the first paragraph, its location can depend on a number of factors such as how lengthy of an introduction you need before you can introduce your thesis or the length of your paper. [9] X Research source"
    },
    {
      "title": "Limit a thesis statement to one or two sentences in length.",
      "content": "Limit a thesis statement to one or two sentences in length. Thesis statements are clear and to-the-point, which helps the reader identify the topic and direction of the paper , as well as your position towards the subject. [10] X Research source"
    },
    {
      "title": "Pick a topic that interests you.",
      "content": "Pick a topic that interests you. This must be the first step in writing your paper and your thesis statement because all direction of the paper will depend on what topic you are writing about. Unfortunately, you must ignore this step if the topic is decided for you. [11] X Research source"
    },
    {
      "title": "Explore your topic.",
      "content": "Explore your topic. The goal of this step is to find a particular narrow subject in your topic which you can make an argument about. For example, take the topic of computers. There are many aspects of computers that can be expanded on such as hardware, software, and programming. However, vague topics like these do not make good theses. But something more narrow, such as the effects of Steve Jobs on the modern computer industry, allows for a much clearer focus."
    },
    {
      "title": "Know the type, purpose, and audience of the paper.",
      "content": "Know the type, purpose, and audience of the paper. These are usually assigned by the instructor, but even if you get to choose them, you must understand that these will affect your thesis statement considerably. If you are writing a persuasive paper, your purpose will be to prove something to a specific group. If you are writing a descriptive paper, your purpose will be to describe something to a specific group. Each of these must be expressed in your thesis somehow. [12] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source"
    },
    {
      "title": "Follow a rigid structure.",
      "content": "Follow a rigid structure. Knowing the basic formulas will not only keep your thesis within the acceptable length but it will also help you see how your entire argument should be organized. Your thesis should contain two parts: [13] X Research source A clear topic or subject matter A brief summary of what you will say Another way of looking at a thesis is as a formula, or a pattern, that comfortably holds your ideas: [Something] [does something] because [reason(s)]. Because [reason(s)], [something] [does something]. Although [opposing evidence], [reasons] show [Something] [does something]. The last example includes a counter-argument, which complicates the thesis but strengthens the argument. In fact, you should always be aware of all counter-arguments against your thesis. Doing so will refine your thesis, and also force you to consider arguments you have to refute in your paper."
    },
    {
      "title": "Write down your thesis.",
      "content": "Write down your thesis. Writing down a preliminary thesis will get you on the right track and force you to think about it, develop your ideas further, and clarify the content of the paper. You will be able to think about your thesis logically , clearly, and concisely. [14] X Research source There are two schools of thought on thesis timing. Some people say you should not write the paper without a thesis in mind and written down, even if you have to alter it slightly by the end. The other school of thought says that you probably won't know where you're going until you get there, so don't write the thesis until you know what it should be. Do whatever seems best to you."
    },
    {
      "title": "Analyze your thesis statement once you think you have a final, or working, version.",
      "content": "Analyze your thesis statement once you think you have a final, or working, version. The point is to make sure you avoid making any mistakes that can weaken your thesis. [15] X Research source To get a better idea of what to do and what to avoid, consider the following pointers: Never frame your thesis as a question . The job of a thesis is to answer a question, not ask one. A thesis is not a list. If you're trying to answer a specific question, too many variables will send your paper off-focus. Keep it concise and brief. Never mention a new topic that you do not intend to discuss in the paper. Do not write in the first person. Using sentences such as, \"I will show...,\" is generally frowned upon by scholars. Do not be combative. The point of your paper is to convince someone of your position, not turn them off, and the best way to achieve that is to make them want to listen to you. Express an open-minded tone, finding common ground between different views."
    },
    {
      "title": "Realize that your thesis does not have to be absolute.",
      "content": "Realize that your thesis does not have to be absolute. Consider it a \"working thesis\" that's subject to change. As you write your paper you may find that your opinion changes or that your direction has veered slightly. So make sure to continuously re-read your thesis, comparing it to your paper and making the appropriate changes so the two match. Once your paper is finished, go back to your thesis and determine if it needs another revision."
    }
  ]
}