{
  "url": "https://www.wikihow.com/Start-Dating-(for-LGBTQ-Teens-and-Tweens)",
  "title": "How to Start Dating (for LGBTQ Teens and Tweens)",
  "steps": [
    {
      "title": "Find out what dating means to you.",
      "content": "Find out what dating means to you. You have feelings for someone and want to get to know them better, and you're spending time with someone (or people) in the hopes of finding a long term relationship. Dating can also mean simply having fun and going on dates. You could also be experimenting with your sexual orientation with dating. Find out what dating means to you, whatever your reasons for dating are. [2] X Research source"
    },
    {
      "title": "Find out if you want to be out with your gender and orientation.",
      "content": "Find out if you want to be out with your gender and orientation. You'll need to understand yourself before you start dating. Things can get complicated if you are closeted with your gender and orientation. You may need to be a little more secretive about your relationship or you may choose not to answer any dating related questions from strangers or parents. [3] X Research source Here is a guide on how to date while in the closet. [4] X Research source If you're still in the closet, while you don't owe anyone an explanation for your choices, it may help your partner(s) understand your situation if you're open about why you're not out."
    },
    {
      "title": "Discuss dating with your guardians.",
      "content": "Discuss dating with your guardians. This is especially important if you are a minor. Talking with a parent or guardian about dating may help you determine if you're ready to date and provide you with useful advice on sex, dating, and relationships, as they are likely to know a thing or two about dating. Begin talking to your caregiver(s) as soon as you realize you're more interested in people you know as more than just friends. [5] X Research source If they say no, you can either accept the answer or try to convince your parents to let you date. However, if they don't want you dating, it's most likely for a good reason. Try to make the majority of the conversation questions rather than statements from you. Ask questions like \"When did you start dating\" or \"What is your best dating advice?\" [6] X Research source Conversations about dating can occur multiple times and will most likely change as you get older. You'll probably need your parents' permission to start dating because you're still expected to follow your parents' rules if you live with them. If you can't talk to your parents about dating for any reason you can find another adult or a support group online for LGBTQ dating resources for teenagers such as or start a GSA (gay straight alliance)."
    },
    {
      "title": "Understand healthy and unhealthy relationships.",
      "content": "Understand healthy and unhealthy relationships. Respect for oneself and others is an essential feature of healthy relationships. In contrast, in unhealthy relationships, one partner attempts to exert physical, sexual, and/or emotional control over the other. Unhealthy relationship: In unhealthy relationships, a partner tries to exert control and power over the other physically, sexually, and/or emotionally. Disrespect and control are characteristics of unhealthy relationships. Even if there is no physical abuse in your relationship does not mean it is healthy or that other forms of abuse are not occurring. It is critical for young people to be able to identify warning signs of unhealthy relationships before they escalate. It can be helpful to identify red flags in a relationship . [7] X Research source Healthy Relationship: Any healthy relationship (romantic or otherwise) is based on trust, open and honest communication, respect and equality–and everyone deserves that. [8] X Research source You should be able to be yourself around them. When you fight, you can have different opinions on something and know that it’s okay. You should trust each other, even when you aren't together, and trust should build over time. You should not be forced to do things you don't want to do—this could be sexual things like pressuring you to send nudes, but it could also be things like someone forcing you to go somewhere you don't want to go, or wear something you don't want to wear. [9] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source [10] X Research source Reader Poll: We asked 472 wikiHow readers how they addressed insecurities in a relationship, and 70% of them said that the most helpful approaches were open communication and honesty. [Take Poll] If you're worried about some aspect of your relationship, it's important to speak up about it."
    },
    {
      "title": "Be yourself.",
      "content": "Be yourself. It's natural to have interests in common with the person you're dating, but you also need to maintain your identity outside of that person. Continue to consider what you want and what you require. Have a purely personal interest--it will boost your self-esteem, and being confident in yourself increases your chances of being confident in your relationship."
    },
    {
      "title": "Look for someone you like.",
      "content": "Look for someone you like. You may already have a special someone in your life, or you and a crush have decided to date (with the permission of your parents/guardian.) Look for people who are around your age, or other students in your school."
    },
    {
      "title": "Ask the person you like if they are open to dating.",
      "content": "Ask the person you like if they are open to dating. Go talk to the person you're interested in and ask if they'd like to go on a date with you, or if they're interested in you. If they say no, remain calm and polite, end the conversation, and walk away. If they say yes, go on a date with them. [11] X Research source If they turn you down, don't beat yourself up about what happened; instead, use it as a learning experience to see how you can improve for the next time someone else catches your eye. At a younger age, some people want to experiment, while others want a long-term relationship. Relationships aren't usually as serious in high school and middle school. Although, many high school relationships can last for years."
    },
    {
      "title": "Talk about your boundaries face-to-face with your partner(s).",
      "content": "Talk about your boundaries face-to-face with your partner(s). Boundaries help you in defining what you are comfortable with and how you want to be treated by others, as well as in honoring your needs, goals, feelings, and values. Emotional, physical, and even digital boundaries can exist. In a healthy relationship, communication is essential, and boundaries are an important part of an ongoing conversation between you and your partner. Everyone has the right to change their mind about what their boundaries are at any time. Examples of personal boundaries could be: [12] X Research source Requesting that your partner(s) gives you some alone time every day. Following each other on social media, but not sharing phone passwords. Being comfortable with cuddling and some forms of touching, but not having sex."
    },
    {
      "title": "Spend time together and go on dates.",
      "content": "Spend time together and go on dates. Dating shouldn't be expensive for teenagers. Some first dates involve going out to dinner and getting dessert, while others involve staying at home to cook together, play games, watch the sunset, and watch a movie. Here are some simple date suggestions for teenagers and tweens: Watch the stars Bake cookies Go to a drive-in movie theater or cinema Go to an amusement park Get coffee, tea, or boba from a cafe Get ice cream together"
    },
    {
      "title": "Get to know your partner.",
      "content": "Get to know your partner. Don't shower them with questions, just let the flow of a conversation guide you and listen for cues from the other person. When there is a lull in the conversation, people frequently resort to quick, superficial questioning. However, this initial awkwardness is completely normal. If you keep talking to them, you'll almost certainly get answers to questions you didn't ask. Remember that you do not have to ask every question that comes to mind. Many people gradually reveal information about themselves. If you keep talking to them, you'll almost certainly get answers to questions you didn't ask. [13] X Research source"
    },
    {
      "title": "Don't forget about your friends.",
      "content": "Don't forget about your friends. Some people will abandon all of their friends once they begin dating someone. They may not intend for it to happen, but it does. Don't ditch your friends. No one wants a friend who will abandon them for someone else, and you still require a social life outside of your partner. [14] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "Know when/if you're ready to have sex.",
      "content": "Know when/if you're ready to have sex. You’re not ready to have sex if the reason you want to sounds anything like: \"I'm the only virgin in my group of friends,\" or \"I want to \"get it over with\". It is difficult to decide when to have sex. It is a critical decision that only you can make. However, talking it out with someone you trust or someone who cares about you can be extremely beneficial. Even if it appears that everyone your age is having sex, they most likely aren't. Only about half of high school students have ever had sex, and the average age for beginning sex is 18. Don't feel obligated to have sex. [15] X Research source"
    },
    {
      "title": "Be careful if you do decide to have sex.",
      "content": "Be careful if you do decide to have sex. Some people don't want to have sex at all, or you could be asexual. You could also be too young or unprepared for sexual activity. Maybe you're uncomfortable with your body, or avoid sex for religious reasons. It's perfectly acceptable not to have sex for any reason. However, if you do decide to have sex, be cautious and use protection, as well as educate yourself on communication and consent. If it makes you feel more at ease, you can discuss sex with a trusted adult and seek advice. Find appropriate sex-ed for teens and tweens. AMAZE.org is an excellent resource for this. Amaze is a website that uses short, fun, and age-appropriate videos to teach children about sexual education, changing bodies, and positive relationships. Check the consent laws for your state. In many US states, someone under 18 cannot have sex with (or legally consent) someone over the age of 18. Know how to have a have a healthy sex life as a teen if you decide to have sex."
    },
    {
      "title": "Communicate with your partner(s)",
      "content": "Communicate with your partner(s) . Express your sexual desires and interests so that your partner(s) will understand how to please you. Tell them what you like and dislike. Nonverbal communication is an essential component of any sexual experience. However, you should not rely solely on nonverbal communication during sex. Healthy sexual communication will make you and your partners more at ease pleasing each other. As a result, you may feel closer and more capable of connecting. When you feel safe and connected, you will have a better understanding of each other's desires and your relationships will be stronger. Talk to your partner before, during, and after sex. Tell them what you like and dislike, as well as when something makes you uncomfortable. [16] X Research source"
    },
    {
      "title": "Consent if you decide to have sex.",
      "content": "Consent if you decide to have sex. Consent is the agreement of people to engage in sexual activity. Consent should be communicated clearly and freely, and when any sexual activity is preformed, all parties need to give consent. A verbal and affirmative expression of consent can aid you and your partner in understanding and respecting each other's boundaries. Individuals who are underage, intoxicated or incapacitated by drugs or alcohol, or asleep or unconscious cannot give consent. If someone agrees to participate in an activity under threat or intimidation, that is not considered consent because it was not given freely and with enthusiasm. [17] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "Have safe sex.",
      "content": "Have safe sex. Use protection and get tested before having sex with a partner. STIs can have an impact on all types of sex, not just penetrative sex. That is why, even if you are not having penetrative sex, it is critical to use protection when interacting with others. Use a dental dam if you're performing/receiving female oral sex, and use condoms if one partner has a penis, and one partner has a vagina and you have P-I-V sex, the person with a vagina can get pregnant regardless of their gender identity--to prevent this, you can use a condom. Use a condom if you use sex toys."
    },
    {
      "title": "Find ways to be intimate without sex.",
      "content": "Find ways to be intimate without sex. If you're asexual, unready for sex, or you simply don't want to have sex, there are still ways to be intimate. A few ways include: [18] X Research source Cuddle . Cuddling with romantic partners is something that many people enjoy. Cuddling and getting cozy usually indicates that your partner is more at ease being intimate and close to you. Many people find comfort in their partner's assurance that they are safe and can relax their guard, and cuddling has lots of benefits. [19] X Research source Dance with your partner. Dancing is not only a great form of exercise, but it can also be very intimate when done with another person. Take a dance class or dance in the comfort of your own kitchen; either way, dancing can be one of the most natural ways to feel close to your partner(s). Massage each other's backs. You don't need to see a professional; instead, give each other massages. It can be relaxing to have that person rub all of your tension out of your neck and back. Cook with your partner. It can be very intimate to spend time in the kitchen with just you and your partner, wearing your most comfortable clothes and collaborating to prepare a delicious meal. Not to mention that it demonstrates your strengths and lays the groundwork for teamwork while making a delicious meal."
    }
  ]
}