{
  "url": "https://www.wikihow.com/Write-a-Personal-Bio",
  "title": "How to Write Engaging Personal & Professional Bios (with Examples)",
  "steps": [
    {
      "title": "Identify your purpose for writing the bio and your potential audience.",
      "content": "Identify your purpose for writing the bio and your potential audience. Before you start writing, get to know your audience. A bio is their first introduction to you, so it needs to tell them who you are and what you do. Ask yourself: are you introducing yourself to a particular audience or providing a general introduction to anyone? Start writing once you know your purpose and audience. [1] X Research source The difference between personal and professional bios is all in the tone you use. Both cover your job and skills, but the bio you write for a personal website might sound less formal than the one you write for a job application. As you write your bio, adjust your tone to make your bio appropriately formal, funny, professional, or personal. If you can’t figure out what to write, check out bios from other people in your field and get a sense of their writing strategy. You can use their bios as models and write yours based on their overall structure."
    },
    {
      "title": "Write in the third person unless you’re writing for social media.",
      "content": "Write in the third person unless you’re writing for social media. Writing in the third person will make your bio sound more objective, like it’s been written by someone else, which can be useful in a formal setting. However, social media sites are a bit less formal and benefit from the more relaxed tone that comes with a first-person POV. For example, begin a third-person bio with a sentence like, \"Joann Smith is a graphic designer in Boston,\" and a first-person bio with \"I am a graphic designer in Boston.\""
    },
    {
      "title": "Begin with a brief introduction citing your name and claim to fame.",
      "content": "Begin with a brief introduction citing your name and claim to fame. Your first and last name should be the first thing written on any bio; this is the cornerstone of your introduction. Then, tell readers what you’re known for and what you do for a living. State the information directly rather than making readers guess; assume they know nothing about you and go from there. [2] X Research source For example, a simple yet solid introduction sentence could be, “Dan Keller is a columnist for the Boulder Times.” Avoid writing a nickname in your bio. Even if your bio isn’t strictly for professional use, it’s best to treat it like a formal introduction to other people. Be sure to mention your company or brand within your introduction. You might work for a company or own your own business with a personal brand."
    },
    {
      "title": "Explain your professional role, skills, and attributes in more detail.",
      "content": "Explain your professional role, skills, and attributes in more detail. After your initial intro, dive into your job and the skills you have. Give your readers a clear idea of who you are, what you do, and how well you do it! If you’re writing a professional bio, elaborate on a couple of key job responsibilities after writing your job title, just like you’d do for a resume. [3] X Research source For example, “Dan Keller is a columnist for the Boulder Times. He specializes in writing public interest stories on the latest technology. Both personal and professional bios typically include job information; personal bios simply present that information a little more informally. If you’re writing about your job informally, you might write something like, “Joann Smith is a passionate knitter who also happens to own and run her paper supply company.”"
    },
    {
      "title": "Write about your greatest professional achievements to date.",
      "content": "Write about your greatest professional achievements to date. If you’ve earned any relevant achievements or awards, include them in your bio. Since this is a bio (not a resume), describe your accomplishments rather than listing them all one by one. Context is important because your audience may have no idea what your accomplishments are until you describe them. [4] X Research source “Dan Keller is a columnist for the Boulder Times. His 2011 series \"All that and More\" earned him Boulder’s prestigious “Up-and-Comer” award for innovation.” Don’t make up accomplishments if you don’t have anything notable to add and only include achievements that relate to the career information or skills discussed in the bio. Avoid buzzwords like \"innovative,\" \"experienced,\" \"creative,\" and so on, which are often so overused that they don’t mean anything to people. Show readers what you can do through specific details, not catchy phrases."
    },
    {
      "title": "Come up with a mission statement that sums up your personal values.",
      "content": "Come up with a mission statement that sums up your personal values. After telling readers what you do and how you’ve contributed to your field through your accomplishments, it’s important to explain why you’re so committed to your work. What drives you? What fuels your desire to grow and learn as a person and a professional? Create a mission statement to highlight those details. [5] X Research source For example, “Dan is committed to helping people understand and embrace the true power of technology.”"
    },
    {
      "title": "Include personal details, interests, and passions to intrigue readers.",
      "content": "Include personal details, interests, and passions to intrigue readers. Personal bios should also touch on who you are outside your job, making you seem more authentic. Consider bringing up your hometown, family, and hobbies. Where did you go to school? How did your early life shape your career path? Include details that could be conversation-starters if you ever met a reader in real life. [6] X Research source For example: “When he isn’t glued to a computer screen, Dan spends time working in the garden, learning French, and trying very hard not to be the worst pool player in the Rockies.” The details you share can vary by bio. For a strictly personal bio, include details like hobbies, personal beliefs, and mottos. For a bio that falls between \"professional\" and \"personal,\" try sharing details that give a sense of who you are but won’t alienate others. Avoid self-deprecating comments and details that are too intimate or potentially embarrassing for you or your audience."
    },
    {
      "title": "Summarize any projects you’re currently working on, if applicable.",
      "content": "Summarize any projects you’re currently working on, if applicable. Let readers know what you’re doing and what’s coming next for you—especially if you want them to learn more about your next project or keep tabs on your work. For example, if you're a writer, state the title of the new book you're working on so readers can keep that in mind for the future. [7] X Research source For example: “Dan is currently working on a memoir.” Keep this part of your bio short and sweet! A sentence is two is all you need."
    },
    {
      "title": "Leave your contact information at the end of your bio.",
      "content": "Leave your contact information at the end of your bio. Use the last sentence of your skillfully crafted bio to share contact details with your readers—especially if you’re doing this for a job or want to rope in new customers. Most bios include an email address at the very least, but if space permits, include a couple of ways of contacting you, like a Twitter or LinkedIn profile. [8] X Research source If you publish this bio online, format your email address carefully to avoid spam. Many people write email addresses online like: “Greg (at) fizzlemail (dot) com.” This clearly tells readers how to spell out your email without making it easy for spammers and bots to copy and use your information."
    },
    {
      "title": "Edit, revise, and get feedback on your bio before publishing it.",
      "content": "Edit, revise, and get feedback on your bio before publishing it. Writing is rarely perfect on the first draft! Reread your bio at least once before you pronounce finished; you may find errors or realize there’s information you forgot to include. Read your bio aloud to help detect grammatical errors and areas you can improve, and check the entire piece for spelling. [9] X Research source Ask your friends and family (especially anyone who is a strong writer) to proofread your bio and give you feedback. A fresh pair of eyes can catch mistakes that you may miss! Online editing software like Grammarly can grade your piece in terms of readability and suggest minor improvements. Every once in a while, go back and update your bio. By putting in a little work frequently to keep it up to date, you'll save yourself a lot of work when you need to use it again."
    },
    {
      "title": "Tell a story with your bio instead of listing facts about yourself.",
      "content": "Tell a story with your bio instead of listing facts about yourself. The whole point of a personal bio when applying to college (or other educational programs) is to stand out. The best way to do that is to make the structure of the piece your own and tell your readers a story , giving them something more interesting to sink their teeth into. [10] X Research source Try any of the following structures: Chronological. Start at the story's beginning and end at the end. It’s simple and works well if you’ve had an interesting life that has taken you from points A to B to C in unusual or impressive ways. Circular. Start at an important moment (D), then backtrack to the beginning (A), and explain all the events leading up to that moment (B, C), eventually bringing the reader full circle. This is good for building suspense! Zoomed In. Focus on one critical event (C) to symbolically tell a larger story. Use a few small surrounding details (A, B, D) to orient the reader, but give that one moment enough emphasis to stand on its own."
    },
    {
      "title": "Focus on yourself and explain why you’re a good fit for the college.",
      "content": "Focus on yourself and explain why you’re a good fit for the college. Colleges want to hear your life story so that they can figure out whether you’re a good fit for them. Try not to get sidetracked describing the school (or other insignificant details) as well. Write a focused personal bio that offers the school subtle praise without sounding like you’re trying to score brownie points. [11] X Research source Avoid statements like, \"UCSF has one of the top-ranked research-based med schools in the world, which would provide me with the foundation necessary to achieve my lifelong dream of becoming a doctor.\" Instead, write something like, “Watching a trauma surgeon save my brother’s life is a moment I’ll never forget. Since then, I’ve known undoubtedly that I would dedicate my life to medicine. My brother was lucky that his surgeon studied at one of the best programs in the country. By doing the same, I hope to one day mean to another family what Dr. Heller does to mine.\""
    },
    {
      "title": "Write in your own voice without trying to squeeze in fancy words.",
      "content": "Write in your own voice without trying to squeeze in fancy words. You don’t need to bend over backward trying to sound smart; that’s what your SATs were for. While you shouldn’t use slang or dumb your essay down, your content should speak for itself. Admissions boards prefer quality over quantity, so using big words where they don’t belong is sure to raise a red flag. [12] X Research source Avoid statements like, \"Having had a rather minimalistic upbringing, I find that I continue to assiduously value hard work and frugality above all else.\" Instead, try something like, \"Growing up very poor taught me that hard work and thrift are sometimes the only things a person can afford.\" Well-written ideas make you seem far more intelligent than big words do. Focus on expressing yourself clearly, and don’t worry about the syllable count!"
    },
    {
      "title": "Include concrete details to help readers get a sense of your abilities.",
      "content": "Include concrete details to help readers get a sense of your abilities. Many students will state things like \"I learned a valuable lesson from this experience\" or \"I developed a new perspective of X” when demonstrating through detail and examples are much more effective. In other words, don’t say you did something; explain what you did and what you learned from it. This will help your bio really stand out! [13] X Research source Avoid statements like, \"I learned a lot from my experience as a camp counselor.\" Instead, try something like, \"I came out of my time as a camp counselor with a better understanding of empathy than before. Now, when my younger sister acts up, I know how to help her without sounding bossy or controlling.\""
    },
    {
      "title": "Keep the bio concise and consider any word count restrictions.",
      "content": "Keep the bio concise and consider any word count restrictions. Have a word count goal in mind when you start writing, and do your best to adhere to it. This can help streamline your content overall, so don’t be afraid to be ruthless—even the most interesting anecdotes may not be necessary to help you get your point across. Don’t get so lost in the details that they make up the majority of your bio! [14] X Research source Different types of bio have different word count expectations. For instance, the average brief personal bio is around 250 words. For a resume or job search, it’s okay to have a personal bio of around 300 to 500 words. For longer personal bios (ones you might post on an “about me” page for a professional website, for example), aim for around 1,000 to 2,000 words. Include all the details you can, but keep them concise. Some social media sites, such as Twitter, restrict your bio to a certain number of words or characters. Ensure that you make the most of that space."
    },
    {
      "title": "Use humor to give your writing a personal touch.",
      "content": "Use humor to give your writing a personal touch. Your bio is a great place to connect with the audience using humor. This can help break the ice between you and your readers, letting them get to know you better. It’s especially effective if you own a business or created a personal website since it’ll help you stand out from the crowd while readers build a stronger connection with your brand. [15] X Research source For example, Tom Hank’s personal bio on Twitter reads, “I'm that actor in some of the movies you liked and some you didn't. Sometimes I'm in pretty good shape, other times I'm not. Hey, you gotta live, you know?”"
    },
    {
      "title": "Use active verbs, so your writing sounds more alive and interesting.",
      "content": "Use active verbs, so your writing sounds more alive and interesting. The \"passive voice\" occurs when you use forms of the verb to be, and it usually makes your sentences wordier and unclear. Using active, present-tense verbs make your writing feel lively and engaging and, therefore, more memorable for your readers. [16] X Research source Passive: \"The window was broken by the zombie.\" Active: \"The zombie broke the window.\" The difference between these sentences is stark: in the first, you have no idea whether the window just happened to be broken. The second is obvious: the zombie broke the window, and you need to hit the road."
    },
    {
      "title": "Be authentic and let your content speak for itself.",
      "content": "Be authentic and let your content speak for itself. In other words, don’t say what you think your readers want to hear—even if you’re writing for a job application or college admissions. Instead, talk about what’s real and what matters to you. Trying to force a story to be more dramatic might make it look silly, especially compared to the tales some of your co-applicants may have. [17] X Research source Avoid statements like, \"Reading The Great Gatsby was a pivotal moment in my life that made me totally rethink my preconceptions about what it means to live in modern America. Thanks to that assignment, I want to pursue American Studies.\" Instead, try something like, \"My family’s ties to this country aren’t glamorous. We didn’t arrive on the Mayflower or have our surname butchered at Ellis Island. We settled in four states across the Midwest, where we’ve lived happily for over 100 years. The magic of that simple act isn’t lost on me, which is why I’ve chosen to major in American Studies.\""
    },
    {
      "title": "Link to your social media profiles or professional website in the bio.",
      "content": "Link to your social media profiles or professional website in the bio. If you’re writing a bio for a specific platform but have others, like a website, a Twitter or Instagram page, or a YouTube channel, for example, include links that promote your work. Links, especially when they lead to examples of your hard work and expertise in your field, add to your bio’s credibility. [18] X Research source For example, if you’re writing an Instagram bio, include a link to your personal website too—especially if there’s a longer and more detailed bio for readers to check out there. Include a brief call-to-action, too! For example, if you have contact info, you might write “Contact me using the following” before you add the links."
    },
    {
      "title": "Use best SEO practices for your bio and optimize your online visibility.",
      "content": "Use best SEO practices for your bio and optimize your online visibility. SEO (or “search engine optimization”) is the practice of improving your site’s ranking on popular search engines like Google. The best way to make your bio more search engine-friendly is to use lots of keywords related to your industry, add both social media and internal links, and include a high-resolution photo. [19] X Research source On your website, longer bios (between 1,500 and 2,000 words) will have the best online optimization. If your bio needs to be shorter, be sure to at least use third-person POV, since your name is another keyword."
    },
    {
      "title": "Adapt your bio to ensure it’ll work on a variety of different platforms.",
      "content": "Adapt your bio to ensure it’ll work on a variety of different platforms. Once you write a single bio, you can edit and re-format it to fit any platform of your choosing. This ensures that the overall tone, style, and information in your bio are consistent throughout each platform. Start with a longer, detailed bio and shorten it as needed, preserving key details. [20] X Research source For example, your website’s “About” page could easily support a 1,500+ word bio. However, from there, you’d need to edit that bio down to a few sentences (a short paragraph) for your LinkedIn profile."
    }
  ]
}