{
  "url": "https://www.wikihow.com/Turn-Off-Automatic-Switch-to-Speaker-for-Calls-on-an-iPhone",
  "title": "5 Steps to Turn Off Automatic Speaker for Calls on an iPhone",
  "steps": [
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings. To do this, tap the grey gear icon on your Home screen. [1] X Research source By default, this is set to \"Automatic,\" meaning your phone will use the smaller speaker (the earpiece) normally, but will automatically connect to Bluetooth or headphones if you're using them. Unless you've changed this in \"Settings\" previously, you won't need to do this."
    },
    {
      "title": "Tap Accessibility.",
      "content": "Tap Accessibility . It's next to a blue icon in the third grouping of menu items under \"General\" and \"Control Center.\" [2] X Research source"
    },
    {
      "title": "Tap Touch.",
      "content": "Tap Touch . You'll find this under the \"Physical and Motor\" header next to a blue icon of a white pointing hand. [3] X Research source"
    },
    {
      "title": "Tap Call Audio Routing.",
      "content": "Tap Call Audio Routing . It's near the bottom of the window. If this already says \"Automatic,\" then the active speaker will be chosen automatically if you're receiving a phone call or a FaceTime call . [4] X Research source For iOS 12 or earlier, these steps will be slightly different. Go to Settings > General > Accessibility > Call Audio Routing instead."
    },
    {
      "title": "Select Automatic.",
      "content": "Select Automatic . Since \"Automatic\" is the default option, you'll want to select it here. If you select \"Bluetooth,\" your phone will always use your Bluetooth connection when making or answering calls. Changing this to \"Automatic\" will disable your speakerphone for calls by default, though you can enable the speakerphone manually . [5] X Research source If \"Speaker\" doesn't have a checkmark next to it, you may be encountering other problems with your phone. Try changing the setting to a different option (e.g., \"Bluetooth Headset\"), restarting your phone , and changing it back to \"Automatic\" for good measure. [6] X Research source"
    }
  ]
}