{
  "url": "https://www.wikihow.com/Use-and-Set-up-VisualBoy-Advance",
  "title": "How to Setup and Play VisualBoy Advance (Windows & Mac)",
  "steps": [
    {
      "title": "Download VBA-M from sourceforge.net/projects/vbam/.",
      "content": "Download VBA-M from sourceforge.net/projects/vbam/ . VisualBoyAdvance-M (VBA-M) is a new version of the original VBA, which has not been in active development. VBA-M includes additional features not present in the original VBA, including linking between virtual Game Boy systems. Click the green \"Download\" button on the SourceForge page and then wait for your download to start."
    },
    {
      "title": "Download and install 7-Zip from 7-zip.org.",
      "content": "Download and install 7-Zip from 7-zip.org . This is a free, open-source archive program that will allow you to open the 7z file that you downloaded for VBA-M. Click the Download link at the top of 7-zip.org for your version of Windows. If you aren't sure, pick the \"32-bit x86\" version. Run the installer after downloading it and follow the prompts to install 7-Zip."
    },
    {
      "title": "Extract the VBA-M files.",
      "content": "Extract the VBA-M files. Once 7-Zip is installed, double-click the 7z file you downloaded in Step 1. This will open it in 7-Zip. Click the \"Extract\" button at the top of the window, and then click \"OK.\""
    },
    {
      "title": "Create a directory for your emulator.",
      "content": "Create a directory for your emulator. By default, the emulator will extract to the same folder that you downloaded the file in. The program doesn't require any installation, so you may want to move it to a more permanent location on your hard drive (i.e. C:\\VBA-M , C:\\Emulators\\VBA-M , or whatever other location you'd like). Putting VBA-M in a dedicated folder will make it easier for you to store and find your ROM files. Right-click in any location on your computer and select \"New\" → \"Folder.\" Once you've created a new folder for VBA-M, simply drag the file from where you extracted it into its new folder. There is only one file for VBA-M."
    },
    {
      "title": "Obtain some ROM files.",
      "content": "Obtain some ROM files. ROM files are copies of Game Boy Advance games. It is illegal in most areas to download ROM files for games that you do not own. One of the most popular sites for GBA games is emuparadise.me : Visit emuparadise.me and click the \"GBA ROMs\" link in the \"Popular ROM Sections\" list. Use the letter links at the top of the page to browse for games, or enter a specific game into the search field. Click the \"Download Links\" link at the top of the ROM's details page, then click the download link that the page scrolls to. Click the \"Click here\" link next to \"Trouble with our captcha?\" beneath the captcha. This will let you bypass the captcha and go straight to the download. Click the game link in the \"Direct Download\" section. This will begin downloading the game."
    },
    {
      "title": "Place your ROM files in a sub-directory in your VBA-M folder.",
      "content": "Place your ROM files in a sub-directory in your VBA-M folder. This isn't strictly required, but things will be a lot easier if your keep all of your downloaded ROM files in one easy-to-find spot. Consider creating a folder called \"ROMs\" in your VBA-M folder (i.e. C:\\VBA-M\\ROMs . Then, place all of the downloaded ZIP files into this folder. Game Boy Advance ROMs typically download in ZIP format. They do not need to be extracted to load into VBA-M"
    },
    {
      "title": "Start VBA-M.",
      "content": "Start VBA-M. Double-click the VisualBoyAdvance-M-WX.exe file that you extracted and moved to its own folder. This is the entire VBA-M program, and it will start immediately without needing to be installed like most programs. You'll be greeted with a black screen with a menu at the top of the window."
    },
    {
      "title": "Point VBA-M to your ROM folder.",
      "content": "Point VBA-M to your ROM folder. Telling VBA-M where your ROM files are located will allow it to open to the correct directory when you go to load a ROM file: Click the \"Options\" menu in VBA-M and select \"Directories...\" Click \"Browse\" next to the \"Game Boy Advance ROMs\" field. Browse for the ROM folder your created in Step 6 and then click \"OK.\""
    },
    {
      "title": "Load a game to test out VBA-M.",
      "content": "Load a game to test out VBA-M. Once you've specified your ROM folder, you're ready to load your first game. Click the \"File\" menu and select \"Open.\" A list of all of the ROMs in your ROM folder will appear. Select the game that you want to launch."
    },
    {
      "title": "Try playing your game with the default controls.",
      "content": "Try playing your game with the default controls. Below are the keyboard controls you can use to start playing immediately: A - X B - Z L - A R - S Start - ↵ Enter Select - ← Backspace Directional Pad - ↑ ↓ ← → Speed Up - Space Screenshot - F11"
    },
    {
      "title": "Change your controls.",
      "content": "Change your controls. If you don't like the default controls, you can change them to whatever you'd like. Click the Options menu and select \"Input\" → \"Configure\" Click the field for the button you want to change, then press the new key or controller button."
    },
    {
      "title": "Download RetroArch.",
      "content": "Download RetroArch. There is no stable version of VBA for Mac or Linux, but the multi-emulator RetroArch includes the ability to load a stable VBA core (emulator) to play Game Boy Advance games. Mac - Visit buildbot.libretro.com/stable/1.3.6/apple/osx/x86_64/ and download the \"RetroArch.dmg\" file. Linux - Open the Terminal and type sudo add-apt-repository ppa:libretro/stable ."
    },
    {
      "title": "Download some ROM files.",
      "content": "Download some ROM files. In order to play GBA games in RetroArch, you'll need ROM files. ROMs are copies of GBA cartridges that the emulator reads to play the game. Downloading ROMs for games you don't own is illegal in many areas. You can download ROMs from many different locations online. One of the most popular is emuparadise.me Visit emuparadise.me and open the \"GBA ROMs\" section. You can find a link in the Quick Links section of the main page. Browse for the game you want to download. You can also search for specific games. Click the \"Download Links\" link on the game's page. This will scroll down the page. Click the link that is displayed. Click the \"Click here\" link underneath the captcha to bypass it. Click the link in the \"Direct Download\" section. This will begin downloading the ROM file in ZIP format."
    },
    {
      "title": "Put all of your GBA ROMs into their own folder (optional).",
      "content": "Put all of your GBA ROMs into their own folder (optional). Placing all of your ROM files into a single, dedicated folder will make it easier to load them all in RetroArch. When RetroArch loads ROMs from a single folder, you'll get an easy-to-navigate list specialized for your emulated system. You can create a \"GBA ROMs\" folder in your User directory or anywhere else you'd like. You don't need to unzip the ROM files to use them in RetroArch."
    },
    {
      "title": "Install the RetroArch application.",
      "content": "Install the RetroArch application. The process is different depending on whether you're using OS X or Linux: Mac - Double-click the downloaded DMG file to open the installer. Drag the RetroArch application to the Applications folder icon. Linux - Open the Terminal and type sudo apt-get update . After running that command, type sudo apt-get install retroarch retroarch-* libretro-* and run it. After confirming, this will download and install RetroArch, which may take a while to complete. [1] X Research source"
    },
    {
      "title": "Run RetroArch.",
      "content": "Run RetroArch. After adding RetroArch to your Applications folder, double-click it to start it up. The RetroArch Settings menu will load after a moment. You can search for RetroArch in the Linux dashboard to quickly find it."
    },
    {
      "title": "Change your default controls.",
      "content": "Change your default controls. Before launching a game, you might want to adjust the default controller settings. RetroArch will automatically support most USB gamepads, but you can set which button is assigned to which input. With the default control scheme, X will select and Z will go back. Return to the Settings menu and select \"Input.\" Choose \"User 1 Bind All.\" Follow the prompts to enter the keys or buttons you want to use for each input."
    },
    {
      "title": "Scroll to the \"+\" column.",
      "content": "Scroll to the \"+\" column. This will let you create a new column dedicated to your GBA games."
    },
    {
      "title": "Select \"Scan Directory\" and then navigate to your ROMs directory.",
      "content": "Select \"Scan Directory\" and then navigate to your ROMs directory. When you're in the ROMs directory, select \"<Scan This Directory>\". This will add all of your GBA ROMs from that directory to your list of games."
    },
    {
      "title": "Select your game from the new \"Game Boy Advance\" category.",
      "content": "Select your game from the new \"Game Boy Advance\" category. Once you've scanned your ROMs folder, you'll see a list of all of your games in the new \"Game Boy Advance\" category."
    },
    {
      "title": "Select \"Run\" and then \"Game Boy Advance (VBA-M).\"",
      "content": "Select \"Run\" and then \"Game Boy Advance (VBA-M).\" This will load the game using the VBA-M emulator. You can try the other emulators on the list, such as mGBA, if VBA-M isn't giving you good performance."
    }
  ]
}