{
  "url": "https://www.wikihow.com/Tell-Someone-They%27re-Moving-Too-Fast",
  "title": "How to Tell Someone They're Moving Too Fast",
  "steps": [
    {
      "title": "Arrange an appropriate time and place to talk.",
      "content": "Arrange an appropriate time and place to talk. You might feel nervous or apprehensive about having this conversation with your partner, so choose a time and place that will make you most comfortable. Consider meeting your partner for coffee or lunch at a place where you will have enough privacy to talk. Try and avoid having the conversation in a place that is very intimate, like your home or your favorite romantic spot. Choosing a place that is comfortable but not too intimate can help the conversation feel less awkward."
    },
    {
      "title": "Share your feelings.",
      "content": "Share your feelings. Being open with your partner is crucial in establishing a strong foundation in a relationship. Clearly communicate to your partner how you are feeling about the current pacing in your relationship. Besides, if you are woman, you might be doing yourself a favor; women tend to have a better view of their relationship quality the longer sex is delayed while dating. [1] X Research source You could tell a partner who seems unhappy about your decision, \"I really like you, but we're moving too fast for me.\" Say, \"Doing things like the things you're pressuring me to do is a big commitment for me, so I need more time.” Take the time to really understand how you feel before the conversation. That way, you'll be able to communicate your feelings transparently, but also very gently. [2] X Expert Source Erika Kaplan Matchmaker Expert Interview. 1 October 2020."
    },
    {
      "title": "Be prepared to respond.",
      "content": "Be prepared to respond. Your partner might not share your perspective and think the relationship is progressing just fine. On the other hand, he or she might accept and be respectful towards your feelings. Either way, you need to be prepared to respond appropriately. If your partner says things like, \"If you really care about me, you'd have sex with me,\" you could respond with, \"I do care about you. That's why I don't want either of us to get hurt by rushing things,\" or \"If you love and care about me, I need for you to show me that you do by being understanding and respectful of my feelings.” An empathetic partner might say, “I really messed up by trying to move things along faster than you are comfortable with.” You could offer a response such as, “I know that you care for me and naturally want to be intimate to express how you feel. I want the same thing. I just need more time.”"
    },
    {
      "title": "Vocalize when you need for previous intimate behavior to cease.",
      "content": "Vocalize when you need for previous intimate behavior to cease. You and your partner may have already engaged in significantly intimate behavior. However, you now no longer desire to continue intimate engagement at that level. Recognize that you have the right to have a change of heart; past intimacy does not give your partner the right to expect or demand that you continue doing so. If your partner tries to pressure you into continuing to be physically intimate because of his or her needs, remember the importance of not to putting someone else’s needs over your own. Doing so only benefits your partner and not you. [3] X Research source"
    },
    {
      "title": "Engage in a compassionate and honest conversation.",
      "content": "Engage in a compassionate and honest conversation. Your partner is likely to be disappointed to learn that the two of you won’t be physically intimate. Provide your partner the opportunity to share how they feel. Try to listen with compassion to demonstrate that their feelings are valid. However, be sure you are honest about your needs and the reasons of what led to your decision. For example, perhaps you’ve now decided that you want to hold off on having sex until you are engaged. You could say, “I’ve done some thinking about our relationship, and even though I’ve enjoyed having sex with you, I recognize that it no longer feels like the right thing for me to do until we’re in a more serious relationship.”"
    },
    {
      "title": "Discuss the appropriate level of intimacy.",
      "content": "Discuss the appropriate level of intimacy. Sexual intimacy has a broad definition and extends beyond just sexual intercourse. What you and someone else considers to be acceptable and unacceptable levels of sexual intimacy can be very different. Make sure you are clear with your partner on the type of intimacy you are currently comfortable with. Are you comfortable with just kissing and hugging, or are you willing to engage in even more intimate behavior without going all the way? Communicate this openly with your partner. For example, you might say, “I really enjoy cuddling with you when we are on the couch. I want us to continue doing that.”"
    },
    {
      "title": "Discuss your intimacy desires in other areas.",
      "content": "Discuss your intimacy desires in other areas. Intimacy in a relationship isn’t just sexual. Relationships are also made up of emotional, experiential, and intellectual intimacy. Be sure to communicate your intimacy desires in these areas as well. Let your partner know how important it is for the two of you to share your innermost thoughts and feelings. Tell him or her how often you would like to enjoy various dating experiences together like bike riding, going to the movies, etc. Assure your partner that you enjoy when the two of you discuss your ideas and values about life and other topics of interest."
    },
    {
      "title": "Define your relationship and dating status.",
      "content": "Define your relationship and dating status. Over the past three or four decades, the term “Defining the Relationship” or DTR has grown popular. [4] X Research source Oftentimes when someone slows down a relationship, it can create confusion about the relationship status. You can clear up any potential confusion for you and your partner by clearly defining your relationship. Ask your partner, “Are we just friends, or are we something more? Are we dating exclusively, or are we free to see others? How committed are we to each other?”"
    },
    {
      "title": "Avoid never-ending irritation and frustration.",
      "content": "Avoid never-ending irritation and frustration. Sometimes a partner can have a difficult time accepting that a relationship is slowing down. As a result, his or her dissatisfaction with your decision causes them to exhibit less than acceptable behavior, such as pressuring you to move things forward more quickly. When this behavior becomes more than you are comfortable dealing with, it might be best to end the relationship. If this happens, tell your partner, “I know my decision to slow things down has been hard for you. I was hoping that you would give me the time that I needed, but unfortunately you can’t. I think it’s best that we end things.”"
    },
    {
      "title": "Recognize when you’ve reached a dead end.",
      "content": "Recognize when you’ve reached a dead end. If your decision to slow things down in your relationship has left you feeling like the two of you can’t possibly move forward, then it’s time to end it. If the excitement and energy in your relationship is gone now, there’s a good chance that it won’t return. The sooner you can end a relationship that is head in the wrong direction, the quicker the two of you can move on."
    },
    {
      "title": "Don’t second-guess yourself.",
      "content": "Don’t second-guess yourself. You have to remain true to yourself. Accept that it’s okay to slow things down. Don’t allow the other person to prematurely convince you to speed things up before you’re ready. It is unhealthy to second-guess yourself when it goes against your sound reasoning and judgement. [5] X Research source"
    },
    {
      "title": "Pay attention to red flags.",
      "content": "Pay attention to red flags. People tend to show you the very best of themselves during the early stages of a relationship. Chances are that your new partner isn’t going exhibit behavior towards you that reveals his or her tendency to blame others, to have a sense of entitlement, or view themselves as superior. However, you’ll have a better chance of observing the individual exhibit or communicate this type of behavior with others. [6] X Research source Pay attention because if you don’t, you’ll probably be next."
    },
    {
      "title": "Recognize the potential blamer.",
      "content": "Recognize the potential blamer. The blaming partner makes it appear that others are at fault for the negative feelings and misfortune. You’ll find yourself thinking that you are awesome compared to the other folks they’ve dated in the past. [7] X Research source For example, your partner might say, “My last boyfriend was such a downer. We could never have an enjoyable outing. I’m so glad you’re not like them.”"
    },
    {
      "title": "Keep an eye out for feelings of entitlement.",
      "content": "Keep an eye out for feelings of entitlement. A partner with a sense of entitlement might make a statement such as, “With all that money I spent on my ex girlfriend on all those expensive dates, I deserved to have sex any time that I wanted it!” Be aware that you will likely suffer emotional abuse from an entitled individual because they view their needs and desires to be more important than yours."
    },
    {
      "title": "Avoid partner with inflated egos.",
      "content": "Avoid partner with inflated egos. A partner with a sense of superiority has the potential of being an emotionally abusive partner. They gain their feelings of superiority by making others appear to be inferior. [8] X Research source For example, to show their superiority over a coworker, they might say, “He doesn’t deserve that promotion. He only attended some little university that know one ever even heard of. I graduated from an ivy league college, for goodness sakes.”"
    },
    {
      "title": "Lessen the chances of becoming a victim of sexual assault.",
      "content": "Lessen the chances of becoming a victim of sexual assault. Date rape occurs when the assailant and victim are familiar with each other in some way. There’s a very small number of men who commit the majority of date rapes. Typically, these men target women when they are most vulnerable, such as under the influence of alcohol or drugs, or when they are alone. [9] X Research source When you are on a date, avoid drinking to the point of intoxication or being under the influence of drugs. It is best to never leave your drinks unattended to prevent your drink from being spiked with roofies, commonly referred to as date rape drugs. Trust your instincts. Your instincts are there to protect you, so don’t ignore them. If you are uncomfortable about the place your partner is taking you or the way your partner is acting or behaving, get out of the situation. If you are in a secluded area, try and move to a place with other people, or call someone who can come and pick you up."
    }
  ]
}