{
  "url": "https://www.wikihow.com/Twilight-Cleric-5e",
  "title": "How to Build A Powerful Twilight Cleric in D&D 5e: Features & Tips",
  "steps": [
    {
      "title": "The Twilight domain is a cleric subclass available at level 1.",
      "content": "The Twilight domain is a cleric subclass available at level 1. Clerics specializing in the Twilight domain typically worship gods who serve as guardians against the more insidious creatures of the night and strive to make nightfall a soothing transition (rather than frightening. Thus, Twilight clerics tend to have abilities centered around protection and using the darkness to their advantage. [1] X Research source Twilight clerics in a 5e campaign setting might worship gods such as Helm, Ilmater, or Selûne (Forgotten Realms), Boldrei or Dol Arrah (Eberron), Celestian (Greyhawk), or Mishakal (Dragonlance). Ultimately, however, you’re free to choose a god outside of those suggestions if you choose to play a Twilight cleric!"
    },
    {
      "title": "Domain Spells",
      "content": "Domain Spells Every cleric subclass has a set of pre-determined “domain spells” that are always prepared, regardless of any other spells you choose to give your cleric character. Although they still cost spell slots to cast, domain spells don’t count against the number of spells your cleric can prepare each day. Twilight domain spells include: [2] X Research source 1st level: Faerie Fire and Sleep 3rd level: Moonbeam and See Invisibility 5th level: Aura of Vitality and Leomund’s Tiny Hut 7th level: Aura of Life and Greater Invisibility 9th level: Circle of Power and Mislead"
    },
    {
      "title": "Bonus Proficiencies",
      "content": "Bonus Proficiencies At level 1, all Twilight clerics immediately become proficient with heavy armor and martial weapons. “Proficient” simply means you can add your player character’s (PC’s) proficiency bonus to weapon attacks—or, when it comes to armor, equip any type of armor your PC is proficient in. [3] X Research source Heavy armor includes ring mail, chain mail, splint, and plate. Martial weapons include battleaxes, flails, greatswords, glaives, greataxes, longswords, mauls, rapiers, scimitars, shortswords, tridents, and warhammers."
    },
    {
      "title": "Eyes of Night",
      "content": "Eyes of Night Eyes of Night is a feature available at 1st level. Your Twilight cleric gets darkvision out to a range of 300 feet, allowing them to see in darkness as if it were dim light (and dim light as if it were bright light). You can also choose to share this darkvision with willing creatures within 10 feet of your cleric. [4] X Research source You can target a minimum of 1 creature with Eyes of Night, up to a number of creatures equal to your Wisdom modifier. When you share darkvision with other creatures, the effect lasts for 1 hour and can’t be used again until after a long rest—unless you expend a spell slot to do so. Darkvision is a sense in D&D 5e that allows characters to see in nonmagical darkness—though not many creatures have 300 feet of it."
    },
    {
      "title": "Vigilant Blessing",
      "content": "Vigilant Blessing Vigilant Blessing is another 1st-level feature allowing you to give a single creature (including yourself) advantage on the next initiative roll. This feature takes an action to use, and its benefits end immediately after the initiative roll (or if you use the feature again). [5] X Research source Initiative rolls determine the order in which you can act in combat. The higher the initiative roll, the sooner you get to act. Rolling with advantage means rolling 2 d20s and taking the higher result, giving you a greater chance of success (or, in this case, getting a high initiative roll)."
    },
    {
      "title": "Channel Divinity: Twilight Sanctuary",
      "content": "Channel Divinity: Twilight Sanctuary Twilight Sanctuary is a 2nd-level feature allowing you to create a sphere of twilight centered on your cleric. The sphere has a 30-foot radius, and the area is dimly lit. When a creature ends its turn inside the sphere, you can grant it temporary hit points equal to 1d6 plus your character’s cleric level, or end one effect causing the creature to be charmed or frightened. [6] X Research source You can target your own character with the sphere’s buffing abilities as well as other creatures. The sphere moves with your cleric and lasts 1 minute (or until your cleric becomes incapacitated or dies). All clerics have the Channel Divinity feature, which essentially lets them channel energy directly from their deity. However, different cleric subclasses (like the Twilight domain) have their own unique varieties of Channel Divinity. For example, all clerics have the Channel Divinity: Turn Undead ability (which repels and destroys undead creatures), but only Twilight clerics have Twilight Sanctuary."
    },
    {
      "title": "Steps of Night",
      "content": "Steps of Night At the 6th level, your Twilight cleric gains the ability to fly! When they’re in dim light or darkness, your cleric can spend a bonus action to give themselves a flying speed equal to their walking speed. This effect lasts for 1 minute, and you can repeat this action daily for a number of times equal to your proficiency bonus. [7] X Research source For example, if your cleric’s proficiency bonus is a +3, that means you can use Steps of Night 3 times per day. Once you expend all uses of this ability, you regain them once your cleric finishes a long rest."
    },
    {
      "title": "Divine Strike",
      "content": "Divine Strike Once your Twilight cleric reaches the 8th level, you can cause one weapon attack per turn to deal an extra 1d8 radiant damage when you hit a creature. At the 14th level (and beyond), the damage from this feature increases to 2d8. [8] X Research source To use this ability, simply roll an extra 8-sided dice (d8) on one of your cleric’s successful weapon attacks each turn. This is a useful ability because radiant damage is one of the more reliable forms of damage. Not many creatures are resistant to it!"
    },
    {
      "title": "Twilight Shroud",
      "content": "Twilight Shroud This feature is actually an extension of the Twilight Sanctuary ability. At the 17th level, your cleric’s Twilight Sanctuary grows more powerful, granting half cover to all allies inside the sphere (including your PC). [9] X Research source Cover is a mechanic in 5e that determines how much protection creatures get by shielding themselves behind objects and obstacles. Half cover grants a +2 bonus to a creature’s armor class—so any allied creatures inside your Twilight Sanctuary would get that bonus as well."
    },
    {
      "title": "Ability scores",
      "content": "Ability scores Wisdom (WIS) is the main attribute of all cleric subclasses, so make it your Twilight cleric’s highest stat. [10] X Research source Then, make Strength (STR) and Constitution (CON) your next-highest scores (since both can help your PC deal damage and withstand it from enemies). Dexterity (DEX) isn’t as important when wearing heavy armor, and Charisma (CHA) and Intelligence (INT) are dump stats. Example (Standard Array): STR 13, DEX 8, CON 14, INT 10, WIS 15, CHA 12 Example (Manual Rolled): STR 14, DEX 10, CON 16, INT 8 WIS 18, CHA 10 Example (Point Buy): STR 15, DEX 8, CON 15, INT 8, WIS 15, CHA 8"
    },
    {
      "title": "Races",
      "content": "Races When choosing a racial bloodline for your Twilight domain PC, you don’t need to worry about Darkvision or flight (since you’ll automatically get both as part of the subclass’s features). Thus, if you want to build a cleric with as many different perks as possible, try focusing on races that offer other features aside from Darkvision or flight. For example: [11] X Research source Variant Humans come with an extra feat at level 1 and are probably the best choice (from a strategic standpoint) for a Twilight cleric. Shifters come with Survival proficiency and a Wisdom bonus, which can benefit a cleric. Centaurs have 40 feet of movement (which is more than the average), which can help you move your Twilight Sanctuary around the battlefield. Firbolgs can turn invisible as well as cast Disguise Self and Detect Magic. Goliaths have Stone’s Endurance and proficiency in Athletics, which makes them more effective tanks and frontline fighters. Satyrs get 35 feet of movement per round (giving them more mobility) and magic resistance, which is always useful."
    },
    {
      "title": "Feats",
      "content": "Feats Feats are optional abilities you can give your PC periodically when they level up. They offer a wide range of different powers and abilities for your PC—and some are situationally better for different classes (and subclasses) than others. Recommended Twilight cleric feats include: [12] X Research source War Caster , which allows PCs to cast spells while wielding weapons and a shield. Lucky , which enables you to reroll up to 3 ability checks, attacks, or saves each day. Magic Initiate , which grants PCs additional spells from other classes. Resilient (Constitution), which can help PCs concentrate on important spells . Metamagic Adept , which enables cleric PCs to be more flexible spellcasters. Tough , which can buff a Twilight cleric’s hit points and make them better tanks. Ritual Caster , which gives clerics more spellcasting options outside of combat."
    },
    {
      "title": "Weapons & armor",
      "content": "Weapons & armor In terms of weapons, it’s usually best to simply choose any weapon that Twilight clerics are automatically proficient with (which includes all martial weapons). When it comes to armor, Twilight clerics are proficient with heavy armor, so start with chain mail and work your way up to even better heavy armor (like plate armor) in the future. [13] X Research source Warhammers and longswords are both versatile, dealing 1d8 damage while being wielded with one hand and 1d10 while being wielded with two hands, making them great starter choices."
    },
    {
      "title": "Spells",
      "content": "Spells The spells provided by the Twilight domain’s pre-selected spell list are already fantastic. However, there are other cleric spells from the general spell list that are definitely worth picking up, too. In particular, Spiritual Weapon is a fantastic bonus action spell, Spirit Guardians deals hefty amounts of damage to all enemies within range, and Healing Word can heal allies from a distance. Recommended spells include: [14] X Research source Cantrips: Guidance, Sacred Flame, Toll the Dead 1st-level: Bless, Guiding Bolt, Inflict Wounds, Healing Word 2nd-level: Aid, Augury, Silence, Spiritual Weapon, Lesser Restoration 3rd-level: Dispel Magic, Revivify, Spirit Guardians 4th-level: Banishment, Death Ward 5th-level: Greater Restoration, Scrying, Summon Celestial 6th-level: Heal, Harm, Word of Recall 7th-level: Etherealness, Plane Shift, Resurrection 8th-level: Antimagic Field, Holy Aura, Sunburst 9th-level: Mass Heal, Power Word Heal, True Resurrection"
    },
    {
      "title": "Multiclassing",
      "content": "Multiclassing Multiclassing (which means taking levels in a second or even third class beyond cleric) isn’t really necessary for a Twilight cleric build—it’s already so powerful, and the high-level Twilight domain abilities are worth snagging. Still, if you want to multiclass because it suits your PC’s backstory or character arc, that’s totally your call. [15] X Research source If you decide to multiclass, remember that you might not get to use high-level Twilight domain features like Twilight Shroud. However, there’s nothing wrong with multiclassing if you feel enthusiastic about it. Make whatever type of character you want to play!"
    },
    {
      "title": "Yes, the Twilight domain is an incredibly strong cleric subclass.",
      "content": "Yes, the Twilight domain is an incredibly strong cleric subclass. It’s hard to go wrong with this subclass or build a Twilight cleric that isn’t very powerful—even if you give your PC stats, feats, or racial traits less optimal than the recommended ones above. The Twilight domain has a stellar selection of domain spells and versatile class features that do everything from healing and buffing allies to granting the power of flight! [16] X Research source Because the Twilight domain also offers tons of buffs for Twilight clerics (as well as their allies), a Twilight cleric PC could also function as a party tank in heavy armor, even though they’re primarily spellcasters."
    }
  ]
}