{
  "url": "https://www.wikihow.com/Use-a-Gym-Sauna",
  "title": "How to Use a Gym Sauna",
  "steps": [
    {
      "title": "Loosen your muscles in the sauna before a workout.",
      "content": "Loosen your muscles in the sauna before a workout. Some people feel that the sauna works best as a way to warm up for your time in the gym. This allows you to get your muscles feeling good before you even start stretching, which is still a necessity even when you use a sauna before a workout. [1] X Research source There probably won’t be room to stretch in the sauna, but stretching and warming up right afterwards is a good idea before even a light workout."
    },
    {
      "title": "Finish up in the sauna to relax your muscles.",
      "content": "Finish up in the sauna to relax your muscles. Finishing up a workout in the sauna feels good for many people. By increasing your blood’s circulation, it can help you loosen up, reduce swelling, and relieve pain on the infamous “day after.” [2] X Research source"
    },
    {
      "title": "Try both gym-sauna orders for yourself to find the right fit.",
      "content": "Try both gym-sauna orders for yourself to find the right fit. Some people have strong opinions one way or another about which sauna order is best, but ultimately it comes down to your personal preference. Give each strategy a chance and see which one is best for you. [3] X Research source So long as you hydrate well before and after each time in the sauna, you can even use it before and after a workout!"
    },
    {
      "title": "Test out a range of temperatures, if you have it to yourself.",
      "content": "Test out a range of temperatures, if you have it to yourself. Being on your own in a sauna gives you a great opportunity to try out different heat levels on the temperature dial and figure out which one feels best. Always start low and work your way up, and only stay in the sauna for 5 minutes at a time when trying a higher temperature than you’re used to. [4] X Research source The dial is usually intuitive with lower heat at one end and higher heat at the other."
    },
    {
      "title": "Choose your seating level, from cooler at the bottom to hotter at the top.",
      "content": "Choose your seating level, from cooler at the bottom to hotter at the top. To choose your most comfortable position in the sauna, keep in mind that most saunas have multiple seating levels, and that heat rises. Sit at the top if you want more of a swelter, and stay toward the lower end if you are a sauna novice. [5] X Research source The difference between the sauna levels at a standard heat level is from 90 °F (32 °C) at the bottom of the sauna to 185 °F (85 °C) at the top. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Shower before getting in the sauna.",
      "content": "Shower before getting in the sauna. Regardless of whether you sauna before or after a workout, clean yourself off before getting in. Just a quick rinse with a bit of soap, like you would do before a swim, will help make the sauna a much cleaner environment for everyone involved. [7] X Research source For your own benefit, it’s also a good idea to shower after using a sauna, too. Some people like to start with warm water and slowly turn the temperature down for a cool, refreshing feeling."
    },
    {
      "title": "Wear a towel over your body on the way in to the sauna.",
      "content": "Wear a towel over your body on the way in to the sauna. Regardless of what people are wearing inside, you will need a towel to sit or lay on in the sauna. In gym saunas, most people will probably be in a swimsuit or underwear under the towel so that they can lay it down beneath them. [8] X Research source Wearing flip flops in the locker room and in the sauna to protect yourself from infections is a good idea. If you are particularly concerned about your clothing choices, wear a bathing suit the first time you use a new sauna and see what others are wearing on the inside. This can be a good indicator of what’s expected of you. Never feel pressured to wear less than you are comfortable with. Even if everyone else is nude, you should stay as clothed as you need to feel safe and confident."
    },
    {
      "title": "Sit several feet apart from others if you don’t know them.",
      "content": "Sit several feet apart from others if you don’t know them. Unless there’s no no room elsewhere or you’re in the sauna with friends, you won’t need to sit less than a few feet from other people in the sauna. You may find it awkward to sit in a room so small with strangers, but everyone else is probably thinking the same thing. [9] X Research source Some people consider it proper etiquette to sit on a different level from others, but you shouldn’t feel obligated to get hotter than you are comfortable if doing so would require you to move up."
    },
    {
      "title": "Ask your fellow sauna-goers before changing the temperature.",
      "content": "Ask your fellow sauna-goers before changing the temperature. Some people prefer exhausting, blistering heat in a sauna, while others see it as a relaxation opportunity that calls for moderate heat. Traditionally, the temperature is controlled by whoever wants it coolest. If you want to turn the heat up or down, ask everyone in the sauna what their preference is. [10] X Research source Don’t be afraid to ask. If you are way too hot or cold, chances are good that at least some of the others in the sauna are too."
    },
    {
      "title": "Stay away from the sauna if you are sick.",
      "content": "Stay away from the sauna if you are sick. While it’s tempting to steam your sinuses in a sauna, the hot, moist rooms quickly become a breeding ground for bacteria and viruses if people use them while they are sick. Once your symptoms disappear, you can hop right back in. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Stay in the sauna for 15 to 20 minutes at a time, at maximum.",
      "content": "Stay in the sauna for 15 to 20 minutes at a time, at maximum. Using the sauna for extended periods of time can lead to heat exhaustion, extreme dehydration, and at its worst, cause you to pass out. If the sauna doesn’t have a clock or a timer, use your watch to keep track of time. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Without a watch or a timer, it can be tough to measure time. Play it safe and leave before you think 15 minutes has passed, since missing a few minutes of sauna time is better than heat exhaustion. Don’t bring electronics into the sauna, including your phone. Even just using a phone as a timer can damage the phone."
    },
    {
      "title": "Drink water before and after using the sauna.",
      "content": "Drink water before and after using the sauna. Your body loses lots of its hydration as you sweat in a sauna, so have a few glasses of water or a full water bottle in the hour or two after you finish up in the sauna. This is especially important if you had a strenuous workout before using the sauna. [13] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Starting to sauna without much water in your system can be as bad as not drinking any afterward."
    },
    {
      "title": "Exit the sauna if you start to feel at all lightheaded.",
      "content": "Exit the sauna if you start to feel at all lightheaded. Passing out from the heat or dehydration is one of the few ways to get injured in a sauna. As soon as you notice that you are feeling foggy or your head has a buzzing feeling, leave the sauna and drink some water. Try to get to a cool, dry place so your body can readjust. [14] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you feel like you might pass out, ask at the gym’s front desk for assistance. They are most likely trained in first aid, and could get you medical attention if your health seems at risk."
    }
  ]
}