{
  "url": "https://www.wikihow.com/Trim-Oak-Trees",
  "title": "How to Trim Oak Trees",
  "steps": [
    {
      "title": "Prune young oaks in mid to late winter, or January through March.",
      "content": "Prune young oaks in mid to late winter, or January through March. Trimming your tree during the winter months allows it to care for its wounds in spring when it will recover more quickly. [1] X Research source Limit trimming only to dead or broken branches on newly planted trees. Two to three years after planting you can begin developmental trimming to shape the tree. Learn the growth habits of your particular type of oak tree"
    },
    {
      "title": "Prepare your tools for trimming.",
      "content": "Prepare your tools for trimming. Before trimming, you’ll need to soak your clippers and saw blade with 9 parts water and 1 part bleach. Then rinse the tools off and let them air dry. [2] X Research source"
    },
    {
      "title": "Establish a dominant leader branch.",
      "content": "Establish a dominant leader branch. To create a healthy oak tree that create beautiful shade, you need to develop one dominant branch on the tree. Look at your tree and notice the largest branches. There maybe 2 or even 3 branches that are all large and a similar size to each other. As the tree grows, these will turn into multiple leaders and create a weaker tree. Decide which branch looks like it is the most vertical and centered on the trunk and choose that one to be the dominant leader. [3] X Research source Trim the other branches that may turn into other leaders by reducing their size to allow more sunlight to reach the dominant leader you chose. Keep the dominant leader long."
    },
    {
      "title": "Make cuts outside the branch collar.",
      "content": "Make cuts outside the branch collar. The branch collar is the swelling at the base of the branch where it begins to connect to the trunk. Trimming branches down to the branch collar will hurt the main trunk of the tree causing it damage to important tissues necessary for growth. Shorten large branches by cutting them back to a lateral branch or bud. Always make angled cuts to encourage growth"
    },
    {
      "title": "Keep the crown of the tree full.",
      "content": "Keep the crown of the tree full. Never remove more that one third of the tree’s canopy in a single season. The tree depends on a healthy crown to create food from the sunlight and grow healthy roots in the ground. This is especially important when the tree is young. [4] X Research source"
    },
    {
      "title": "Keep trimming each year to shape your tree.",
      "content": "Keep trimming each year to shape your tree. You need to prune young trees yearly to keep them growing healthily. Make sure the dominant leader is always the largest branch and trim back any large splits. Trim the branches that will prevent your tree from growing how you want it to, including dead, diseased, or broken branches, branches that cross over or rub other branches, and inward-growing branches. [5] X Research source Damage doesn't necessarily indicate a disease—it could be due to a lightning strike, lack of sun, or even just that the branch got too heavy. [6] X Expert Source Matt Bowman Gardener & Owner, Tradition Market & Garden Expert Interview. 21 April 2020. If you're not sure what may have caused damage to your oak tree, check the bark on the oak tree for white, flaky scaling that could indicate pests. [7] X Expert Source Matt Bowman Gardener & Owner, Tradition Market & Garden Expert Interview. 21 April 2020."
    },
    {
      "title": "Trim with a purpose.",
      "content": "Trim with a purpose. Pruning branches from mature trees takes a lot of weight off the tree and can change the shape drastically, so it is important to really think about which branches you are going to trim before you make the cut. Pruning branches from mature trees should only be done for specific purposes: [8] X Research source Removing dead, diseased or broken branches Remove branches to create more sunlight or air flow to the canopy of the tree. Be careful doing this as you don’t want to “thin out” the canopy."
    },
    {
      "title": "Cut the top and bottom of large branches.",
      "content": "Cut the top and bottom of large branches. Making a single cut to large branches may cause them to tear off the tree and rip off the bark as they fall. Proper trimming ensures healthy bark: [9] X Research source Make an undercut on the branch about 1 to 2 feet out from the branch collar, or the point where it connects to the trunk. Make a second cut on the top of the branch a few inches farther out that the undercut. This prevents the falling branch from tearing the bark off of the trunk. After the bulk of the branch falls, you can trim back the 1 to 2 feet the you left on the tree by cutting it at an angle 1 to 2 inches (2.5 to 5.1 cm) from the branch collar."
    },
    {
      "title": "Allow the tree to heal the cut.",
      "content": "Allow the tree to heal the cut. After pruning the branches from your oak tree, leave the wound alone to let the tree heal itself in the open air. [10] X Research source Prune carefully to not injure the tree excessively, and make sure the tree has plenty of water. Trees will naturally seal cuts; it is not necessary to apply an artificial sealant as this may trap microorganisms inside the tree and lead to disease."
    }
  ]
}