{
  "url": "https://www.wikihow.com/Treat-Mange-in-Cats",
  "title": "How to Treat Mange in Cats",
  "steps": [
    {
      "title": "Ear Mites (Otodectic Mange)",
      "content": "Ear Mites (Otodectic Mange) Ear mites are a common type of mange in cats. These mites burrow in a cat's ear, usually so deep that they aren't visible to humans. Ear mites feed on the oil, ear wax, and dead skin in a cat's ear and sometimes on their body as well. [1] X Research source This condition is very contagious among cats. [2] X Research source Signs & Symptoms: Your cat may scratch their ears or shake their head often. You may also notice inflamed skin near the ear, drooping ears, dark brown or black discharge from the ear, or pus draining from the ear."
    },
    {
      "title": "Demodectic Mange",
      "content": "Demodectic Mange Demodectic mange is caused by 2 different types of mites: Demodex cati and Demodex gatoi. Demodex cati are tiny mites that are found on even healthy animals' skin, but can cause mange in cats with weakened immune systems. Demodex gatoi are much more contagious and even smaller. These mites are often found in kittens. [3] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Signs & Symptoms: Your cat may experience extreme itching, skin redness, hair loss, and thickening skin. Their skin may also develop crusts or scabs over time."
    },
    {
      "title": "Walking Dandruff (Cheyletiellosis)",
      "content": "Walking Dandruff (Cheyletiellosis) Cheyletiellosis is often referred to as walking dandruff due to the presence of small, white mites that appear on the surface of a cat's skin and fur. These mites are very contagious among cats, dogs, and even humans. [4] X Research source Signs & Symptoms: You might notice tiny, white spots that look like dandruff (but are actually small mites). Your cat may experience itching or have red, inflamed, or crusty skin."
    },
    {
      "title": "Feline Scabies (Notoedric Mange or Sarcoptic Mange)",
      "content": "Feline Scabies (Notoedric Mange or Sarcoptic Mange) Feline scabies is caused by two different types of mites: Sarcoptes scabiei (the most common) and Notoedres cati (less common). [5] X Research source Both types of mites bury themselves in a cat's skin and lay eggs just below the surface. These mites are very contagious among cats, dogs, and humans. [6] X Research source Signs & Symptoms: Your cat may experience extremely itchy skin, hair loss, and skin crusting."
    },
    {
      "title": "Trombiculiasis",
      "content": "Trombiculiasis This type of mange is caused by mites known as Trombiculidae (often referred to as chiggers or harvest mites). During their larval stage, these mites lodge themselves onto your cat's skin and fur. They are most common in the summer and fall and are not contagious among cats, dogs, and humans. [7] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Signs & Symptoms: Your cat may experience itching, scaly skin, crusting skin, and hair loss."
    },
    {
      "title": "Take your cat to the vet as soon as you notice symptoms of mange.",
      "content": "Take your cat to the vet as soon as you notice symptoms of mange. If mange is left untreated, the symptoms will worsen over time. To give your cat the treatment they need, take them to the veterinarian. A vet can make a proper diagnosis and prescribe the right medication. If you have multiple cats, your vet may advise you to separate them to prevent spreading the condition. They may also prescribe treatment for all of your cats just to be safe. To diagnose mange and determine what type of mange your cat has, a vet will usually scrape a portion of their skin and examine it under a microscope. If your vet thinks a weakened immune system increased your cat's risk of getting mange, they may also run blood tests to check for any underlying conditions. [8] X Research source"
    },
    {
      "title": "Topical medication",
      "content": "Topical medication The most common treatment option is topical medication, which you apply to your cat's skin and fur. If your cat has a mild case of mange, your doctor will most likely prescribe this option. The exact dosage requirements vary depending on the instructions on the label and your vet's specific recommendation. [9] X Research source Usually, your vet will recommend 1-2 treatments given a few weeks to 30 days apart. [10] X Research source Popular topical medications include fluralaner (Bravecto), sarolaner (Revolution Plus), and selamectin (Revolution). Though these medications may be meant for flea treatments, they can also be very effective in treating mange."
    },
    {
      "title": "Oral medication",
      "content": "Oral medication If your cat has Demodectic mange, vets may prescribe Ivermectin to be taken orally. Though dosage instructions vary, your vet may advise that your cat take the medication until they receive two skin scrapings that come back negative for mange 4 to 6 weeks apart. After that, your vet may continue their treatment for another 4 weeks to be sure that they are cured. [11] X Research source Though Ivermectin toxicity is not common in cats, talk to your vet about the risks and symptoms before giving your cat the medication."
    },
    {
      "title": "Injectable medication",
      "content": "Injectable medication If your cat has Sarcoptic mange (a form of feline scabies), vets may prescribe an injectable form of Ivermectin. To administer the Ivermectin, your vet will inject your cat with the medication once a week for 6 weeks. [12] X Research source"
    },
    {
      "title": "Lime Sulfur dip",
      "content": "Lime Sulfur dip Your vet might prescribe a weekly lime sulfur dip treatment for 4 to 6 weeks. This is an anti-parasitic solution that can cure more severe cases of mange. During each treatment, your cat will need to wear an E-collar (a cone-shaped collar) to prevent them from ingesting the medication. Your vet may also prescribe a sedative to help calm your cat down while you administer the lime sulfur dip. [13] X Research source To protect yourself while applying the solution, wear gloves and avoid touching your face or eyes. Since the treatment has a strong odor, it's important to apply it in an area with good ventilation."
    },
    {
      "title": "Wash your and your cat's bedding with hot water and bleach.",
      "content": "Wash your and your cat's bedding with hot water and bleach. Once your cat goes through treatment, it's important to take preventative measures so that the mange doesn't return. Wash your cat's bedding, your bedding, and any blankets your cat may have come into contact with on your washing machine's hottest setting. Use bleach by pouring a capful into the bleach dispenser of your washing machine. [14] X Research source If you don't have a bleach dispenser, dilute the bleach in water before putting the bedding in the washing machine. No matter what, avoid using bleach on silk or wool bedding (in that case, use laundry detergent and cold water). If your cat had a type of mite that can be passed to humans, like the mites that cause Sarcoptic mange, this precaution can also help you avoid catching it yourself."
    },
    {
      "title": "Keep your cat indoors.",
      "content": "Keep your cat indoors. When your cat is outside, they may come into contact with cats outside of their household. This can increase their risk of catching mange from other cats. While outside, your cat may also come into contact with mites like Trombiculidae (harvest mites or chiggers), increasing their risk for Trombiculiasis. To protect your kitty, keep them safe inside. [15] X Research source"
    },
    {
      "title": "Take good care of your cat's health.",
      "content": "Take good care of your cat's health. Giving your cat a well-balanced diet and making sure they've got good hygiene will encourage a stronger immune system. Keep your cat healthy to prevent them from being susceptible to mange caused by Demodex cati (Demodectic mange). [16] X Research source Choose cat food with healthy ingredients and plenty of nutrients. If you aren't sure, talk to your vet and see what kind of food they recommend for your cat. Routinely wash your cat's bedding and toys to ensure that their environment is clean."
    }
  ]
}