{
  "url": "https://www.wikihow.com/Write-an-Agenda-for-a-Meeting",
  "title": "How to Make a Meeting Agenda",
  "steps": [
    {
      "title": "Request information from your colleagues.",
      "content": "Request information from your colleagues. People will be more engaged in the meeting if they have a say in the agenda. [1] X Expert Source Alyson Garrido, PCC Career Coach Expert Interview. 24 January 2020. Ask for suggestions about what to include, and try to add some of them to your agenda. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source You can send out an email ahead of time or visit with people individually. Make sure to do this at least 6-7 days ahead of time so that your team members have a chance to contribute. You want to have the agenda finalized 3-4 days before the meeting."
    },
    {
      "title": "Establish your main objective or objectives.",
      "content": "Establish your main objective or objectives. A meeting should have a defined purpose, such as to make a decision, share information, make plans for the future, or give progress reports. [3] X Expert Source Alyson Garrido, PCC Career Coach Expert Interview. 24 January 2020. Otherwise, you shouldn't be meeting in the first place. [4] X Research source A meeting can have more than one goal. For instance, you might want to share progress reports to help you make decisions about the future."
    },
    {
      "title": "Focus on issues that affect more than just a couple of people.",
      "content": "Focus on issues that affect more than just a couple of people. If an item on your agenda could be solved by a meeting between 2 people, leave it off. Instead, use your valuable meeting time to work on problems that everyone needs to weigh in on. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For instance, if you and another person need to get together about a new project, set up a separate meeting for that. If you use up valuable meeting time for an issue that's solvable by a few people, others will feel like you're wasting their time. Plus, it's hard to schedule meetings with a large number of people, so make use of the opportunity."
    },
    {
      "title": "Narrow your list of agenda items down to what you want to cover.",
      "content": "Narrow your list of agenda items down to what you want to cover. Prioritize what's most important to get done at this meeting. You may not be able to cover everything, so stick to the what's absolutely most important. [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For instance, maybe you have \"negotiating project deadlines,\" \"progress reports,\" \"new projects,\" and \"brainstorming session.\" You may decide you don't have time for a brainstorming session at this meeting. You may need to schedule smaller meetings to help get things done that fall off your main agenda for the big meeting."
    },
    {
      "title": "Schedule the most important topics first.",
      "content": "Schedule the most important topics first. When planning meetings, it's usually a good policy to front-load the schedule with the most important topics. This ensures that everyone will be able to discuss these important topics when they're at their sharpest and least fatigued at the very beginning of the meeting. For instance, you might want to put decision-making items ahead of progress reports (unless you need to hear the progress reports to make the decision). Plus, if the meeting needs to end early or certain attendees need to leave before it finishes, you'll already have discussed the most important topics."
    },
    {
      "title": "Map out how much time each item will take.",
      "content": "Map out how much time each item will take. While you cannot know for sure how long each item will take, you do need a general idea. Keep in mind how long the meeting is and how many topics you have to cover. Try to allocate more time to the most important topics. [7] X Research source For example, maybe you'll put in 30 minutes for progress reports, 10 minutes for discussion, and 10 minutes to vote on new deadlines. If you don't have any set times for topics, you won't get through your agenda. Think about timing ahead of the meeting because you may decide you can't cover everything you want to in the time allotted. Factor in the number of people attending your meeting when determining time increments. If you have 15 people and you give a topic 15 minutes, that means that each person can only speak for less than a minute. Even if not every person speaks, that may be a tight fit. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Start with a title for your agenda and meeting.",
      "content": "Start with a title for your agenda and meeting. Your title should tell the reader that they're reading an agenda. It should also introduce the topic of the meeting. When you've made a decision, place your title at the top of your blank document. Keep your title simple and to the point. For instance, your title could be \"July Meeting Agenda: Discussing New Project Ideas\" or \"August 2019 Meeting Agenda: Moving Project Deadlines Up.\" Stick to a plain, business font like Times New Roman or Calibri."
    },
    {
      "title": "Set aside time at the meeting for greetings and welcomes.",
      "content": "Set aside time at the meeting for greetings and welcomes. This part of the meeting gives people a chance to say hello. It's also a space for you or other meeting leaders to open the meeting and discuss the main items you'll cover. You could also use an ice breaker if the meeting includes many people who don't know each other. If you're writing an agenda for a large meeting, say at a conference, the time needed for this portion could be significant. At a small office meeting, this portion might only take a few minutes. You can also leave a space for agenda changes at the beginning."
    },
    {
      "title": "Phrase your agenda items as questions to intrigue your team members.",
      "content": "Phrase your agenda items as questions to intrigue your team members. When you just put a few words on the agenda, it can leave your colleagues confused. A question helps provide context, and it gives them a chance to think about it ahead of time. [9] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For instance, instead of writing, \"Project Deadlines,\" you could write, \"Can project deadlines be moved up to meet growing demand?\" If needed, add a brief description under the question."
    },
    {
      "title": "Write in estimated times beside each agenda topic.",
      "content": "Write in estimated times beside each agenda topic. While you don't necessarily need to include times, it can help people prepare. It will allow them to request more time if needed, for instance. [10] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source It also gives people a chance to shorten their remarks if the timing is short."
    },
    {
      "title": "Create a process for each item on the list.",
      "content": "Create a process for each item on the list. The process establishes how you will approach each agenda item. For instance, if you're talking about moving project deadlines, every person is going to come at the topic from a different point in the process. By establishing a process, you get everyone on the same page. [11] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For example, say the agenda item is, \"Can project deadlines be moved up to meet growing demand?\" Your process might be \"10 minutes to discuss current progress. 15 minutes to establish what it would take to increase productivity. 10 minutes to weigh pros and cons. 5 minutes to vote on whether deadlines should be moved up.\""
    },
    {
      "title": "Establish who will lead each section on the agenda.",
      "content": "Establish who will lead each section on the agenda. Note who is going to lead each part of the meeting. Don't let this come as a surprise to the person. You should work this out ahead of time, and then write it in the agenda. [12] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If you're leading the whole meeting, you can note that at the top of the agenda."
    },
    {
      "title": "Allocate time in the schedule for any special guests.",
      "content": "Allocate time in the schedule for any special guests. If any guests are coming to your meeting to discuss topics of importance, you'll want to devote a chunk of the meeting time to these people. Plan on assigning each guest a single entry on the agenda even if they have more than one topic of discussion.This way, they will be able to organize their topics as they see fit. It is best to contact the guests ahead of time to figure out how much time each one will need for their discussion topic. This helps to avoid embarrassing scheduling conflicts."
    },
    {
      "title": "Leave an opening for other business.",
      "content": "Leave an opening for other business. This part of the agenda should come at the end. It just gives you a chance to ask others if anything else needs to be addressed at the meeting. Plus, it gives members a chance to go back to something that may have gotten glossed over earlier. [13] X Research source When you include on the agenda, it lets members know they'll have a chance to contribute even if what they need to talk about isn't covered by your agenda. You can also include time for questions and answers in this section."
    },
    {
      "title": "Add the meeting details to the agenda.",
      "content": "Add the meeting details to the agenda. Include the time, date, and location of the meeting. Also, add the names of anyone who will be at the meeting. That way, people know ahead of time who they will be able to connect with while there. It's also a good idea to include people who would normally be there but can't come to this meeting. Make it clear they won't be able to attend. Include a map or directions if you have people who aren't familiar with your area attending the meeting."
    },
    {
      "title": "Note any pre-work that needs to be done for the meeting.",
      "content": "Note any pre-work that needs to be done for the meeting. Maybe there's something your colleagues need to read ahead of time, or maybe they need to research solutions. You might also want them to think about certain problems. Create a space at the bottom of the agenda. Make it stand out with bold font or highlighting so that participants see it."
    },
    {
      "title": "Check the agenda for errors before distributing it.",
      "content": "Check the agenda for errors before distributing it. Because some attendees may end up relying heavily on the meeting agenda, it's wise to proofread it for errors and completeness before giving it out. Doing so isn't just a courtesy to the attendees; it also reflects positively on your attention to detail and the respect you have for them."
    },
    {
      "title": "Send the agenda out 3-4 days ahead of the meeting.",
      "content": "Send the agenda out 3-4 days ahead of the meeting. Letting your colleagues see the agenda gives them a chance to prepare. You don't want to send it out too early, though, as it will get lost in the shuffle. [14] X Research source For larger meetings at conferences, you may need to get the agenda out months ahead of time."
    }
  ]
}