{
  "url": "https://www.wikihow.com/Why-Can%27t-I-See-Pictures-on-iMessage",
  "title": "Why Can't I See Pictures on iMessage? 11 Fixes for Missing Photos",
  "steps": [
    {
      "title": "Open the Settings app .",
      "content": "Open the Settings app . If you are not receiving pictures in iMessage, make sure you have MMS and RCS (if supported) enabled. [1] X Research source You should also make sure you have internet access, whether you're using cellular data or Wi-Fi, as it's required to send and receive photos in iMessage."
    },
    {
      "title": "Scroll down and tap Apps.",
      "content": "Scroll down and tap Apps . It's all the way at the bottom. You can skip this step if you're using an older version of iOS."
    },
    {
      "title": "Tap Messages.",
      "content": "Tap Messages . It's next to a green icon with a white speech bubble in the Settings menu."
    },
    {
      "title": "Ensure MMS Messaging is turned on .",
      "content": "Ensure MMS Messaging is turned on . This allows you to receive photos and videos over text."
    },
    {
      "title": "Enable RCS Messaging if available.",
      "content": "Enable RCS Messaging if available. If supported, tap RCS Messaging, then toggle on \"RCS Messaging.\" This feature will allow you to receive photo and video texts when you're not using MMS or iMessage. [2] X Research source"
    },
    {
      "title": "Open the Settings app and tap your name.",
      "content": "Open the Settings app and tap your name. You'll see it at the top of your settings. This opens your Apple Account settings."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It's in the second group of options."
    },
    {
      "title": "Make sure you're not hitting your storage limit.",
      "content": "Make sure you're not hitting your storage limit. At the top of this section, you will see how much space you are using on iCloud, plus how much space you have in total. If you go over your iCloud limit, the photos you send and receive won't be able to sync to your iCloud account– free up some space to fix the problem."
    },
    {
      "title": "Tap Messages under \"Saved to iCloud.",
      "content": "Tap Messages under \"Saved to iCloud. \" If you don't see it, you may need to tap See All first."
    },
    {
      "title": "Make sure \"Use on this iPhone\" is selected.",
      "content": "Make sure \"Use on this iPhone\" is selected. This option ensures the photos and videos you send via iMessage sync to iCloud."
    },
    {
      "title": "Check your settings for \"Keep Messages.",
      "content": "Check your settings for \"Keep Messages. \" If you see \"30 Days\" or \"1 Year\" next to \"Keep Messages,\" any photos you've sent or received via iMessage will be deleted from the conversation after that amount of time. If you want iMessage photos to exist in the cloud forever, change this setting to Forever . Keep in mind these photos and texts do take up space in your overall iCloud storage. If you start running low on space, you'll probably want to delete old ones."
    },
    {
      "title": "Open the Settings app .",
      "content": "Open the Settings app . You can often fix pictures not showing up in iMessage by signing out of your account and back in. This will clear the cache and hopefully fix issues with images not loading."
    },
    {
      "title": "Scroll down and tap Apps.",
      "content": "Scroll down and tap Apps . It's at the bottom of your settings. You can skip this step if you're using an older version of iOS."
    },
    {
      "title": "Tap Messages.",
      "content": "Tap Messages . It's next to a green icon with a white speech bubble in the Settings menu."
    },
    {
      "title": "Tap Send & Receive.",
      "content": "Tap Send & Receive . This displays details about the Apple ID you are logged into iMessage with."
    },
    {
      "title": "Tap your Apple account at the bottom.",
      "content": "Tap your Apple account at the bottom. This displays a menu prompt."
    },
    {
      "title": "Tap Sign Out.",
      "content": "Tap Sign Out . This signs you out of your Apple ID in iMessage."
    },
    {
      "title": "Sign back in to your Apple account.",
      "content": "Sign back in to your Apple account. Tap Use your Apple Account for iMessage , then follow the on-screen instructions to log in with your Apple ID. Hopefully, this will prompt your messages to start downloading."
    },
    {
      "title": "Open the Settings app .",
      "content": "Open the Settings app . If you are being prompted to download pictures by tapping a download icon instead of just seeing the photos in iMessage, you can usually fix the problem by disabling and reenabling iMessage in a particular way. [3] X Research source"
    },
    {
      "title": "Scroll down and tap Apps.",
      "content": "Scroll down and tap Apps . It's all the way at the bottom. You can skip this step if you're using an older version of iOS."
    },
    {
      "title": "Tap Messages.",
      "content": "Tap Messages . It's next to a green icon with a white speech bubble in the Settings menu."
    },
    {
      "title": "Toggle off iMessage and reboot your iPhone.",
      "content": "Toggle off iMessage and reboot your iPhone. It's important that you leave your phone turned off for about one full minute. After a minute passes, turn your iPhone back on."
    },
    {
      "title": "Enable iMessage.",
      "content": "Enable iMessage. Return to Settings > Apps > Messages , then toggle the \"iMessage\" switch back on. Wait a full minute before you continue to the next step."
    },
    {
      "title": "Open Messages and tap the photos to download them manually.",
      "content": "Open Messages and tap the photos to download them manually. Once you download the photos once, you should not have to do this again, and you (hopefully) will no longer have the problem of photos not downloading in iMessage."
    },
    {
      "title": "Open the Settings app .",
      "content": "Open the Settings app . If you cannot see the pictures you send or receive in the Messages app, whether they're showing up as their file names or not showing up at all, your iPhone's storage may be full. When it's full, pictures will not download from the cloud until you free up some space."
    },
    {
      "title": "Tap General.",
      "content": "Tap General . It's near the top of the Settings menu."
    },
    {
      "title": "Tap iPhone Storage.",
      "content": "Tap iPhone Storage . It's in the middle of the General Settings menu."
    },
    {
      "title": "Free up space if needed.",
      "content": "Free up space if needed. You will see a bar graph at the top of the page that shows how much storage is being used on your iPhone and what is taking up space (apps, media, photos, messages, etc.). If your iPhone storage is full, you can free up space by deleting apps, photos, and other data you no longer need. You will also see some recommendations for saving space, such as reviewing large attachments and emptying your Recently Deleted album. Alternatively, you can tap an app in the iPhone Storage menu and tap Offload app to delete the app without deleting the app data."
    },
    {
      "title": "Open the Settings app .",
      "content": "Open the Settings app . If you aren't seeing the older photos you expect to see in your iMessage conversation, you might need to reindex them. Use this method if, when you tap the name of the person or group chat at the top of the conversation, you don't see all the photos you expect to see. This process can take a long time , especially if you have a lot of photos. For many gigabytes of photos, it may even take a few days for the photos to come back. Be sure to keep your iPhone plugged in and connected to Wi-Fi as often as possible as to not interrupt the sync."
    },
    {
      "title": "Scroll down and tap Apps.",
      "content": "Scroll down and tap Apps . It's all the way at the bottom. You can skip this step if you're using an older version of iOS."
    },
    {
      "title": "Tap Messages.",
      "content": "Tap Messages . It's next to a green icon with a white speech bubble in the Settings menu."
    },
    {
      "title": "Tap Search.",
      "content": "Tap Search . It's in the first group of settings."
    },
    {
      "title": "Toggle off \"Show App in Search\" and \"Show Content in Search.",
      "content": "Toggle off \"Show App in Search\" and \"Show Content in Search. \" Once you do this, \"Show Content in Search\" will disappear, and the switch next to \"Show App in Search\" will be gray."
    },
    {
      "title": "Tap < Messages to return to your Messages settings.",
      "content": "Tap < Messages to return to your Messages settings. It's at the top-left corner."
    },
    {
      "title": "Return to Search and toggle the switches back on.",
      "content": "Return to Search and toggle the switches back on. Tap the toggle switch next to \"Show App in Search\" so it turns green, then toggle on \"Show Content in Search.\""
    },
    {
      "title": "Tap the person's name at the top of the conversation in Messages.",
      "content": "Tap the person's name at the top of the conversation in Messages. If you don't see the older pictures and videos you've sent or received in a conversation over iMessage, you may just need to force them to download to your iPhone or iPad."
    },
    {
      "title": "Open the conversation in Messages and tap the name at the top.",
      "content": "Open the conversation in Messages and tap the name at the top. If it's a one-on-one message, tap the name of the person you're chatting with. If it's a group convo, tap the group name."
    },
    {
      "title": "Tap See All next to \"Photos.\"",
      "content": "Tap See All next to \"Photos.\" You should now see a message at the bottom of this section that says \"More photos will be shown once Messages finishes indexing.\" This is good–it means your iPhone is now reindexing the pictures from your conversation (including those you couldn't see) so you can find them again in iMessage. Again, this process can take a long time if you have many gigabytes of photos. Check back in a few hours to see if the pictures are still indexing. If so, give it about a day before checking again."
    },
    {
      "title": "A strong internet connection is needed to download photos in iMessage.",
      "content": "A strong internet connection is needed to download photos in iMessage. Try opening a web page or using another app to see if you have a strong internet connection. If a website, social media app, or YouTube videos are running slowly or not loading, your internet connection may be the problem. [4] X Research source Connect to Wi-Fi instead of mobile data. If you are connected to 5G or 4G, connect to a wireless network instead ."
    },
    {
      "title": "Check for updates in Settings.",
      "content": "Check for updates in Settings. Many users reported being unable to see photos in iMessage after updating to iOS 18. If you haven't checked for a more recent update, you should do so now, as the bug may have been fixed. To check for updates, open Settings and go to General > Software Update . If an update is available, install it. If the bug was fixed in a recent update, it may still take anywhere from a few hours to a few days to recover the missing pictures from iMessage."
    },
    {
      "title": "Open the Settings app and tap your name.",
      "content": "Open the Settings app and tap your name. You'll see it at the top of your settings. This opens your Apple Account settings. If you cannot see older messages from a conversation or recently switched phones and your old iMessage photos aren't downloading, try this method. This method temporarily disables iMessage in iCloud and forces your iPhone to redownload the messages and attachments. This process can take a long time , especially if you have a lot of photos. For many gigabytes of pictures, it may even take a few days for the photos to come back. Be sure to keep your iPhone plugged in and connected to Wi-Fi as often as possible to avoid interrupting the sync."
    },
    {
      "title": "Tap Messages.",
      "content": "Tap Messages . This opens your settings for syncing messages to iCloud."
    },
    {
      "title": "Toggle off the \"Use on this iPhone\" switch.",
      "content": "Toggle off the \"Use on this iPhone\" switch. A pop-up will appear, warning you that not all messages have been fully downloaded to your iPhone."
    },
    {
      "title": "Tap Disable and Download Messages.",
      "content": "Tap Disable and Download Messages . The toggle switch will turn off."
    },
    {
      "title": "Turn \"Use on this iPhone\" back on.",
      "content": "Turn \"Use on this iPhone\" back on. The switch will turn green, and you will see \"Syncing with iCloud\" next to \"Status.\" Depending on the number of texts and attachments, this could take anywhere from a few hours to a few days. Check back to see if the status changes. If it does, return to the conversation, tap the name at the top, and then tap See all next to Photos–you will (hopefully) see the missing photos. If you return to this menu later and the syncing has paused, tap Sync Now at the bottom to start it again."
    },
    {
      "title": "Open the Settings app and tap General.",
      "content": "Open the Settings app and tap General . You may not be able to see or download pictures in iMessage if there is a problem with your network settings. Just keep in mind this will also erase any saved VPN and Wi-Fi network information, so you will need to reconnect to Wi-Fi manually after."
    },
    {
      "title": "Tap General.",
      "content": "Tap General . It's near the top of the Settings menu."
    },
    {
      "title": "Tap Transfer or Reset iPhone.",
      "content": "Tap Transfer or Reset iPhone . This expands another menu. [5] X Research source"
    },
    {
      "title": "Tap Reset.",
      "content": "Tap Reset . It's near the bottom of the menu."
    },
    {
      "title": "Tap Reset Network Settings.",
      "content": "Tap Reset Network Settings . You will be prompted to enter your passcode."
    },
    {
      "title": "Enter your passcode and tap Done.",
      "content": "Enter your passcode and tap Done . Your iPhone will reset your network settings."
    },
    {
      "title": "Plug your iPhone into power and leave it alone for 72 hours.",
      "content": "Plug your iPhone into power and leave it alone for 72 hours. If you've tried the other methods and still don't see your photos, you likely have a lot of photos to sync. The only way to ensure all your iMessage photos sync back to your iPhone after performing these methods is to make sure your iPhone stays connected to power and has a solid Wi-Fi connection for as long as possible. Anything that interferes with the download (including unplugging your iPhone, turning on Low Power Mode , and connecting to cellular data instead of Wi-Fi could make the process take longer. Some users on Reddit and other forums have said they've recovered their photos after leaving their iPhones plugged in and connected to Wi-Fi for 3 days, and that they were instructed to do this by Apple technicians."
    }
  ]
}