{
  "url": "https://www.wikihow.com/Stretch-Synthetic-Shoes",
  "title": "How to Stretch Faux Leather & Other Synthetic Shoes",
  "steps": [
    {
      "title": "Spray a leather-stretching product on the surface to loosen faux leather.",
      "content": "Spray a leather-stretching product on the surface to loosen faux leather. Read the label on a container of leather-stretching spray to ensure that your spray can be used on faux leather. Then, follow the label’s instructions to apply the spray and stretch the shoes. Typically, you mist the shoes with the spray and wear them or put them in a boot tree to stretch them out. [1] X Research source There are shoe-stretching sprays for other types of shoes, but they aren’t great for plastic shoes that are made out of more than one material."
    },
    {
      "title": "Slide a boot tree into a faux leather shoe to reshape it.",
      "content": "Slide a boot tree into a faux leather shoe to reshape it. A boot tree is a type of shoe stretcher with a bigger heel. Get a boot tree that is half a size bigger than your shoe. Untie the laces and lift the tongue out. Slide the boot tree into the shoe and tie the laces tight. Draper recommends leaving the boot tree in your shoes for at least 3 days or, to further maintain the stretch, keep the boot tree in your shoes whenever you aren’t wearing them. [2] X Expert Source Moe Draper Shoe Care & Repair Specialist Expert Interview. 5 April 2021."
    },
    {
      "title": "Apply leather conditioner to soften the faux leather.",
      "content": "Apply leather conditioner to soften the faux leather. Remove the laces from your shoes. Then, use a cotton pad or soft towel to scoop up a pea-sized chunk of conditioner. Work it into the leather using soft, circular motions, reloading the pad or towel as needed. Cover each section of the shoes and let the shoes air dry. [3] X Research source If you don’t have leather conditioner, coconut oil is a great alternative; however, it can make the leather darker. [4] X Research source Leather conditioner doesn’t technically stretch your shoes, but it does soften the leather up to make stretching easier."
    },
    {
      "title": "Wear them with thick socks for 15-30 minutes at a time to break them in.",
      "content": "Wear them with thick socks for 15-30 minutes at a time to break them in. If your shoes are new and you can fit them on your feet, throw on a thick pair of comfy socks. [5] X Research source Put your shoes on and tie the laces or strap them. Wear them around your home for 15-30 minutes at a time to begin breaking them in. Once your shoes get used to the shape of your feet, they’ll stretch out to comfortably fit your feet. Draper clarifies that plastic-based shoes can only stretch half a size, so take that into account before stretching synthetic plastic shoes. [6] X Expert Source Moe Draper Shoe Care & Repair Specialist Expert Interview. 5 April 2021. Avoid trying this technique on faux leather, which is a tougher material. Warning: If your shoes start to hurt your feet, take them off. It’s not worth damaging your toes or feet just to stretch your shoes out!"
    },
    {
      "title": "Heat the plastic with a blow dryer to shape the shoe to your foot.",
      "content": "Heat the plastic with a blow dryer to shape the shoe to your foot. Put on your shoes, plug in a hair dryer, and turn it to the highest setting. Hold the hair dryer 6–12 in (15–30 cm) away from the fabric of your shoe and turn it on. Move the dryer around your shoe, concentrating on particularly tight areas. Do this for 10-30 minutes at a time to help soften the plastic and stretch your shoes. [7] X Research source This can work on faux leather as well. Focus on the tips of your shoes where the toes rest, since this area is the easiest to stretch with heat. If your feet start to get too hot, stop. There are other solutions that you can try!"
    },
    {
      "title": "Put shoe stretchers in your shoes to relax the material.",
      "content": "Put shoe stretchers in your shoes to relax the material. Draper advises getting a set of shoe stretchers that are slightly larger than your shoes. [8] X Expert Source Moe Draper Shoe Care & Repair Specialist Expert Interview. 5 April 2021. Untie the shoe laces and pull the tongues up. Insert the stretchers and tie laces as tight as you can to stretch your footwear out while you aren’t wearing the shoes. You may need to apply some force to get the shoe stretchers in at first, but this should get easier over time as you leave the shoe stretchers in. Leave your shoe stretchers in your shoes whenever you aren’t wearing them to continue stretching them over time."
    },
    {
      "title": "Freeze your shoes overnight in a plastic bag to expand the material.",
      "content": "Freeze your shoes overnight in a plastic bag to expand the material. Dampen a few sheets of newspaper, crumple it up, and shove it into each of your shoes. Then, place your shoes inside of the bag and close the zipper ¾ of the way. Force the excess air out of the bag and seal it. Leave your shoes in the freezer overnight to soften them up and stretch them out. [9] X Research source Water expands when it freezes. As your shoes freeze, the moisture inside them expands, causing the fabric to expand with it. This method isn’t great for faux leather, which tends to crack and crease when it gets wet and cold."
    },
    {
      "title": "Will synthetic leather stretch?",
      "content": "Will synthetic leather stretch? While it may be difficult, synthetic leather can stretch. Draper explains that faux leather has “a little more elasticity to be able to be stretched, but again, you should be careful in stretching” the material too much. [10] X Expert Source Moe Draper Shoe Care & Repair Specialist Expert Interview. 5 April 2021. Stretching synthetic or fake leather too much can cause it to tear and crack."
    },
    {
      "title": "How stretchy is faux leather?",
      "content": "How stretchy is faux leather? Faux leather is less stretchy than real leather. Real leather doesn’t have much give, and fake leather isn’t much different. While the synthetic material is stretchier than the real stuff, the plastic in it and the chemical treatment it takes to form it prevents it from being super malleable. [11] X Research source"
    },
    {
      "title": "Should you size up in faux leather?",
      "content": "Should you size up in faux leather? Sizing up in faux leather garments and shoes may make the fit more comfortable. While it’s not necessary, sizing up when purchasing fake leather items may be a good idea if you’re not looking for a super tight fit. Faux leather has limited stretch and breathability, which can make garments and shoes smaller than their true size. [12] X Research source"
    },
    {
      "title": "How much do synthetic shoes stretch?",
      "content": "How much do synthetic shoes stretch? “[Stretching synthetic shoes] may cause the shoe size to increase by up to half a size,” says Draper.[v161760_b01]. 5 April 2021 While most synthetic shoes don’t have much give, if stretched properly and gradually, they can become slightly roomier."
    },
    {
      "title": "How do you find the material of your shoes?",
      "content": "How do you find the material of your shoes? Inspect the shoe and tags to identify the material. Loosen the laces and pull the tongue up. If there is a label under the tongue, it may list the materials used to make your shoe. If there is no tag or it doesn’t list the materials, look your brand up online to search for the material used to make it. Nylon, PVC, acrylic, polyurethane, and microfiber are all types of plastic that can be stretched using heat, cold, or shoe stretchers. Plastic-based materials are some of the most popular materials for shoe manufacturers. Even textile and leather shoes typically contain some plastic."
    }
  ]
}