{
  "url": "https://www.wikihow.com/Write-Negative-Infinity-(%E2%88%9E)-on-an-Android-Calculator",
  "title": "How Input Negative Infinity on an Android: Google, Desmos & More",
  "steps": [
    {
      "title": "You can calculate negative infinity using Google's calculator function.",
      "content": "You can calculate negative infinity using Google's calculator function. While the default calculator app on your Android may not be able to calculate infinity or negative infinity directly, you can write infinity in the calculator built into Google's search engine. Dividing any number by 0 will get you infinity (rather than an error message), and calculating \"log(0)\" will get you negative infinity. Open the Google app or go to https://www.google.com in a web browser. Search Google Calculator to display the calculator widget in Google. Divide any number by 0 to get infinity. Divide any negative number by 0 to get negative infinity. Use the minus (-) button to input a negative symbol. Use parentheses if infinity or negative infinity is part of a larger equation."
    },
    {
      "title": "Use Desmos Graphing Calculator to get infinity.",
      "content": "Use Desmos Graphing Calculator to get infinity. If you are doing calculus, algebra, or other advanced mathematics, you may want something a little more powerful than Google or the default calculator app. Desmos Graphing Calculator is a free graphing calculator app that supports advanced math functions and graphing and allows you to input infinity and negative infinity. [1] X Research source To enter infinity, simply type infinity into the equation bar. It will be instantly transformed into a \"∞\" symbol. To enter negative infinity, simply type -infinity using the minus (-) key to create a negative number. You can download Desmos Graphing Calculator from the Google Play Store . Alternatively, you can go to https://www.desmos.com/calculator in a web browser."
    },
    {
      "title": "Get infinity.",
      "content": "Get infinity. Calculate \"10 99 \" to get something close to infinity. Use the following steps to do so: Type 10 for infinity into your Android's default calculator app. Tap the button to show extended math functions. On Samsung Calculator, it's the button with various math symbols at the top. On Google Calculator, it's the bracket pointing down in the upper-right corner. Tap the e x button on Samsung Calculator or the ^ on Google Calculator. Enter 99 immediately after. Tap the = button."
    },
    {
      "title": "Get negative infinity.",
      "content": "Get negative infinity. Calculate \"-10 99 \" to get something close to negative infinity. The standard calculator app on your Android does not have a way to input negative infinity, but you can calculate a really large number by calculating negative 10 to the power of 99. Use the following steps to do so: Open your default calculator app (Samsung Calculator or Google Calculator). Type -10 . Use the minus button to get a negative number. You may want to enter parenthesis if this is part of a larger equation. Tap the button to show extended math functions. On Samsung Calculator, it's the button with various math symbols at the top. On Google Calculator, it's the bracket pointing down in the upper-right corner. Tap the e x button on Samsung Calculator or the ^ on Google Calculator. Enter 99 immediately after. Tap the = button."
    },
    {
      "title": "Infinity ∞ represents a quantity with no boundaries.",
      "content": "Infinity ∞ represents a quantity with no boundaries. Infinity is a concept rather than a number. It represents a quantity far greater than what the human mind (or any calculator) can comprehend. Negative infinity is any quantity with no boundaries below 0. It is important to understand what infinity is before attempting to calculate it on a calculator."
    }
  ]
}