{
  "url": "https://www.wikihow.com/Speed-up-a-Windows-XP-Computer",
  "title": "How to Speed up a Windows XP Computer",
  "steps": [
    {
      "title": "Remove Spyware and Viruses.",
      "content": "Remove Spyware and Viruses. Spyware and viruses are leading causes of slowdown because you may have several spyware cookies or trojans that are taking up your processor time for reading and storing and reporting your activity to several spy databases. Read How to Remove a Virus to learn how to remove them and speed up your system. Update and run your spyware and virus software every week. If you do not have tools installed to protect against malware and spyware then you can download Spyware Blaster, and for viruses, download a free copy of AVG - \" A nti- V ir G uard\" or this one Avira - \" A nti- Vira guard\" ( all three of those are free \"For Personal Use\"), all three are also available in Business or Pro versions. Also, Microsoft's Windows Defender is a widely-used anti-spyware tool that is currently distributed freely for users with a \"Genuine\" verified copy of Windows. \"Windows Defender\" is also included with other Microsoft services and products such as \"Live OneCare\" and \"Vista.\" Download and install Mozilla Firefox , Opera or Google Chrome. It will allow you to import all of your Internet Explorer settings, and is much less prone to malware than Microsoft Internet Explorer. It will prompt you with a \"Set as Default Browser\" message. Check \"Don't show this again\" and click \"Yes\". Firefox also has a cool feature to delete cookies, cache, and temporary internet files each time you close it. You are strongly recommended to use this option. It can speed up your internet experience. You should also check Google Chrome which is noticeably faster and less prone to virus attacks from internet Chrome . If you have a really complicated virus infection, try using the Quick Virus Remover. It is a free utility, though not a replacement for commercial products but can be helpful for removing some of the most common viruses infecting your system."
    },
    {
      "title": "Regularly use CCleaner to clean your computer.",
      "content": "Regularly use CCleaner to clean your computer. Over time, your computer may become cluttered with unnecessary files that can slow it down. CCleaner is a free program which can remove these files for free. CCleaner also comes with a free registry cleaner, although Microsoft recommends not to use registry cleaners ."
    },
    {
      "title": "Perform a disk clean up.",
      "content": "Perform a disk clean up. Clean up your disk quickly to remove unnecessary files. Click Start in the bottom left corner, then click Run. Type, \"cleanmgr.exe\" in the text field. Click OK to start Disk Cleanup."
    },
    {
      "title": "Remove unwanted/unneeded software which may be the reason for slowdown.",
      "content": "Remove unwanted/unneeded software which may be the reason for slowdown. Click Start, then click Control Panel. Click Add/Remove Programs. Right click any unnecessary software and click \"Remove\"."
    },
    {
      "title": "Defragment Your Computer",
      "content": "Defragment Your Computer . This will place similar files physically closer on the hard disk and will help improve load speeds. Click Start then click Run. Type, \"dfrg.msc\" in the text field. Click OK to open Windows Disk Defragmenter. Click Analyze to determine whether you need to defrag your disk and click Defrag to defrag the disk. Do not defrag solid state drives."
    },
    {
      "title": "Stop unnecessary start-up programs.",
      "content": "Stop unnecessary start-up programs. Limit the number of programs that automatically start when your computer turns on. Click the Start button then Run. Type \"msconfig\" and click OK to open System Configuration. In System Configuration, go to the Startup tab and uncheck any programs which are not required. If you are not sure what some of the programs listed are, you can search them up online to see if they are safe to disable. Click OK on the System Configuration window to save the changes. If you encounter problems after disabling some startup programs, re-open System Configuration and choose \"Normal Startup\" from the General tab. Programs can also schedule unnecessary tasks to launch automatically when Windows starts. To stop such tasks, use Windows Task Scheduler. To open Windows Task Scheduler, click Start, click All Programs, point to Accessories, point to System Tools, and then click Scheduled Tasks. Disable all Services you do not use or need. Open Control Panel, click Administrative Tools, and select Services. Right click the services you want to disable and select \"Properties\", then set the start-up type to manual to disable them. Disabling the wrong services may lead to serious problems that you may not notice right away. You should not disable services if you are not experienced in this area."
    },
    {
      "title": "Free up graphics resources.",
      "content": "Free up graphics resources. Turning off the fancy Windows XP graphics will noticeably increase the speed of your computer. Go to Start, right click Computer in the Start menu, and click Properties. Go to the Advanced tab. Click the Settings button under Performance. Select the \"Adjust for best performance\" option, then click OK."
    },
    {
      "title": "Set Page File size.",
      "content": "Set Page File size. Go to Start, right click Computer, and select Properties. Go to the Advanced tab. Click the Settings button under Performance. Now switch to the Advanced tab of the new dialog box that opens and click on '\"Change\" under Virtual Memory. You will see \"Initial Size (MB)\" and the \"Maximum Size (MB)\". Change 'Initial Size' to the same value as 'Maximum Size' then click set. NOTE: When your computer consumes your computer's hard drive and uses it as RAM, it is referred to as thrashing. Thrashing is bad for your computer and buying RAM (it's not that expensive) is much more worthwhile."
    },
    {
      "title": "Set Priorities.",
      "content": "Set Priorities. Press Control+Alt+Delete at the same time or right click your task-bar and select Task Manager. Once Task Manager opens, click the Processes tab. Now, find \"explorer.exe\", right click it, and set the priority to real-time. This makes your computer focus on explorer.exe, which is Windows Explorer (the program you view files on your computer in and your task-bar and Start menu). This method greatly increases speed of Windows Explorer and if other programs you use are slow, you can also set their priority. Upgrade your RAM. More RAM allows programs to start and run faster. Upgrade your CPU. Doing so increases program performance. Upgrade your graphics. Video editors, gaming, photo editors, etc will benefit from this. Upgrade your HDD/SSD. A larger HDD/SSD and a faster one will speed up your computer. If you're considering a new computer, do your research before deciding what to buy. A wrong choice may cost you more money or get you a worse computer."
    },
    {
      "title": "Physically upgrade your computer or get a new one.",
      "content": "Physically upgrade your computer or get a new one. Face it: if your computer is old and slow, tweaking Windows itself may only help to a certain extent. Sometimes, it may be better to upgrade your computer or get a completely new one. Upgrading your computer requires some experience in technology. You might need to hire a professional if you want to upgrade your PC but are not willing to do it yourself."
    }
  ]
}