{
  "url": "https://www.wikihow.com/Store-Papaya",
  "title": "How to Store Papaya",
  "steps": [
    {
      "title": "Select papayas",
      "content": "Select papayas that are yellow-green on the outside. Keep an eye out for the papaya’s skin color while you’re at the supermarket. Remember that papayas are only ripe once they start to look yellow on the outside. Unlike some fruits, you can find papayas in grocery store throughout the year. [2] X Research source There are 2 major kinds of papaya: Hawaiian and Mexican. Hawaiian is more commonly found at grocery stores, and only weighs around 1 pound (450 g). Mexican papayas are much longer and heavier, and can weigh almost 20 pounds (9,100 g). Although they shouldn’t be eaten with the rest of the fruit, the peppery taste of papaya seeds makes them great for cooking purposes, like tenderizing meat."
    },
    {
      "title": "Let the fruit sit at room temperature for about 3 days so it can ripen.",
      "content": "Let the fruit sit at room temperature for about 3 days so it can ripen. Keep the papayas on a flat surface where they can stay at room temperature. Although yellow-green papayas are on their way to being ripe, wait until the fruit is yellow to prepare and eat it. Keep in mind that you shouldn’t eat green papaya fruit raw, as the papaya plant naturally contains latex."
    },
    {
      "title": "Keep ripe papayas in the refrigerator to eat them later on.",
      "content": "Keep ripe papayas in the refrigerator to eat them later on. Place the chopped or uncut papaya into the fridge set to 45 °F (7 °C). Be sure to use cut and prepared papaya in about a week. [3] X Research source If you’d like to keep your fruit for a longer period of time, store any uncut and unpeeled papayas in the fridge for up to 3 weeks."
    },
    {
      "title": "Wash",
      "content": "Wash and peel the papayas that you want to freeze. Rinse and clean the papaya with running water before removing the skin with a produce peeler. Use long, even strokes to peel off the skin more efficiently. [4] X Research source Set the peels aside as you go so you can toss them away later."
    },
    {
      "title": "Slice the papaya into 1 in (2.5 cm) chunks.",
      "content": "Slice the papaya into 1 in (2.5 cm) chunks. Cut the papaya in half so that the center of the fruit is visible. Next, use a spoon to scoop out the seeds before you continue chopping the fruit. Slice the papaya in half again before cutting the fruit into 0.5 in (1.3 cm) chunks. [5] X Research source For simpler storage, consider using a melon baller to scoop the papaya into bags before freezing it. [6] X Research source"
    },
    {
      "title": "Place the fruit pieces into a container or bag and freeze them for up to a year.",
      "content": "Place the fruit pieces into a container or bag and freeze them for up to a year. Take a handful of papaya chunks or balls and place them in a freezer-safe bag or other airtight container. Try and bag them as compactly as you can, so the fruit pieces won’t take up as much space in your freezer. Once you’ve put away all of the chopped fruit, set it in the freezer and use the fruit within a year. [7] X Research source If you want to freeze the papaya chunks before bagging them, place them on a cookie sheet first. Leave the cookie sheet in the freezer for at least a day, or until the fruit pieces are frozen. [8] X Research source"
    },
    {
      "title": "Clean off the papaya and peel away the skin.",
      "content": "Clean off the papaya and peel away the skin. Rinse the papaya under cool running water and remove the skin with a produce peeler. Use long, even strokes, working left to right or right to left to get rid of the skin. Feel free to toss out the papaya peels as you go. [9] X Research source"
    },
    {
      "title": "Cut the papaya",
      "content": "Cut the papaya into 0.5 in (1.3 cm) long strips. Begin slicing the papaya with a sharp knife, creating strips that are about as thick as a slice of jerky. To maximize the space in your dehydrator, cut the fruit so that each piece is about 0.5 in (1.3 cm) long. If you’d prefer for your dried papaya to be more bite-sized, feel free to cut it into smaller slices. [10] X Research source As a general rule of thumb with dehydrators, remember that thicker pieces of fruit take longer to dry."
    },
    {
      "title": "Lay the papaya slices onto the racks of the dehydrator.",
      "content": "Lay the papaya slices onto the racks of the dehydrator. Set each piece of papaya next to one another so that they’re side by side. Make sure that none of the pieces overlap in the dehydrator, as this can slow down the drying process. If some pieces of papaya seem especially moist, consider placing them on the bottom shelf of the dehydrator instead. [11] X Research source For an easier drying process, avoid placing other fruits aside from papayas in the dehydrator."
    },
    {
      "title": "Set the dehydrator to 135 °F (57 °C) and let the strips dry for 12 hours.",
      "content": "Set the dehydrator to 135 °F (57 °C) and let the strips dry for 12 hours. Check again to make sure that none of the strips are overlapping before turning on the appliance. Keep the dehydrator set to 135 °F (57 °C) to allow the fruit slices to dry out without cooking in the process. Wait at least 12 hours before checking on your papaya strips. [12] X Research source Depending on the batch, it could take up to 24 hours for the papaya slices to dry completely. Wait until the fruit looks leathery before removing it."
    },
    {
      "title": "Put aside the papaya strips for short-term or long-term storage.",
      "content": "Put aside the papaya strips for short-term or long-term storage. Take the slices out of the dehydrator and let them cool for several minutes before putting them in different bags. For short-term storage, keep your fruit pieces in a sealed jar on your countertop for up to 1 month. If you’re looking to keep your fruit for a longer amount of time, try vacuum-sealing and freezing the bags of strips. [13] X Research source"
    }
  ]
}