{
  "url": "https://www.wikihow.com/Turn-On-the-Keyboard-Light-on-an-HP-Pavilion",
  "title": "Turn On the Keyboard Light on an HP Pavilion: Guide and Troubleshooting",
  "steps": [
    {
      "title": "Plug your computer into its charger.",
      "content": "Plug your computer into its charger. In some cases, your computer's keyboard backlight may not turn on if your computer isn't charged past a certain point while off the charger. You can solve this problem by plugging your computer into its charger."
    },
    {
      "title": "Find the \"Backlight\" key.",
      "content": "Find the \"Backlight\" key. The \"Backlight\" key is always one of the function keys (typically F5 ) at the top of your keyboard. It has a symbol resembling three dots on it. [1] X Research source"
    },
    {
      "title": "Press the \"Backlight\" key a few times.",
      "content": "Press the \"Backlight\" key a few times. If your computer's keyboard is set to use the function keys' hardware features when pressed, this will cycle through your keyboard's brightness settings. You should see the keyboard's backlight dim and brighten accordingly. [2] X Research source If nothing happens when you press the \"Backlight\" key, proceed to the next step."
    },
    {
      "title": "Try using the \"Backlight\" key while holding Fn.",
      "content": "Try using the \"Backlight\" key while holding Fn . You'll find the Fn key in the lower-left side of the keyboard. If you couldn't turn on the backlight in the last step, holding the Fn key while pressing the \"Backlight\" button will cause your computer to use the key to change the backlight's brightness. [3] X Research source You may have to press the \"Backlight\" key a few times while holding down Fn to cycle through all of the brightness options."
    },
    {
      "title": "Make sure that your HP Pavilion has a keyboard backlight.",
      "content": "Make sure that your HP Pavilion has a keyboard backlight. Not all HP Pavilion laptops have backlit keyboards. If you've been unable to find the option to turn on the backlight thus far, check your computer's manual or online documentation to determine whether or not your keyboard has a backlight."
    },
    {
      "title": "If you can’t find the backlight key in the usual laptop location, check the entire keyboard.",
      "content": "If you can’t find the backlight key in the usual laptop location, check the entire keyboard. There are a few different places it might be. [4] X Research source Start at the function row. The backlight key might be on F5, F4, or F11. If your function row is combined with other system buttons (e.g. backlight, volume, pause), you might need to turn off fn lock to access the backlight key. Press fn + the fn lock key to turn it off. The fn lock key usually looks like a lock with “fn” inside of it. Some laptops might place the backlight key in a column on the right side of the keyboard."
    },
    {
      "title": "If nothing happens when you press the backlight key, check your BIOS settings.",
      "content": "If nothing happens when you press the backlight key, check your BIOS settings. You may need to enable Action Keys Mode for the backlight to work: [5] X Research source Enter BIOS . Select BIOS Setup or BIOS Setup Utility in the menu options. Press the arrow keys to go to the “System Configuration” tab. Move the selection to Action Keys Mode. Use the right or left arrow key to change Action Keys Mode to Enabled ."
    },
    {
      "title": "If the backlight stays on briefly, try changing the timeout setting.",
      "content": "If the backlight stays on briefly, try changing the timeout setting. This can be found in BIOS. [6] X Research source Enter BIOS . Press the arrow keys to go to the Advanced tab. Move the selection to Built-in Device Options and press Enter to open the menu. Move the selection to Backlit keyboard timeout . Press Space to open the timeout settings. Select Never to stop the backlight from turning off."
    },
    {
      "title": "Make sure your HP Pavilion has a removable battery.",
      "content": "Make sure your HP Pavilion has a removable battery. You can \"hard reboot\" your HP computer to solve potential hardware issues with the backlight, but doing so requires you to remove the laptop's battery. While you can technically remove the battery on sealed versions of the HP Pavilion, doing so requires you to remove the keyboard and several sensitive components before you can remove the battery, and thus is not recommended."
    },
    {
      "title": "Remove any cables or USB items from your computer.",
      "content": "Remove any cables or USB items from your computer. This includes the charger cable, USB flash drives, speakers, and so on."
    },
    {
      "title": "Turn off the computer.",
      "content": "Turn off the computer. To do so: Click the Start icon. Click Power . Click Shut down in the pop-up window."
    },
    {
      "title": "Remove the computer's battery.",
      "content": "Remove the computer's battery. As long as your computer has a removable battery, you can do this by following these instructions: Flip the computer over so that its bottom is facing up. Push and hold inward the switches on the battery compartment. Pull the battery cover away from the laptop. Pull the battery out of the laptop, making sure to store the battery on a soft, dry surface (e.g., a towel)."
    },
    {
      "title": "Hold down the \"Power\" button for 20 seconds.",
      "content": "Hold down the \"Power\" button for 20 seconds. This will cause any residual power left in the computer to discharge."
    },
    {
      "title": "Put back the battery and close its compartment.",
      "content": "Put back the battery and close its compartment. At this point, you're ready to turn back on your computer. Plug your computer back into its charger if your computer was low on power before you performed the hard reboot."
    },
    {
      "title": "Turn back on your computer.",
      "content": "Turn back on your computer. Press the computer's \"Power\" button to do so. Your computer will boot up like usual."
    },
    {
      "title": "Try turning on the backlight",
      "content": "Try turning on the backlight . Now that you've performed a hard reboot on your computer, you should be able to cycle through the brightness settings for your keyboard."
    },
    {
      "title": "Use your backlit keyboard.",
      "content": "Use your backlit keyboard. Once you've set your keyboard brightness to your prefered level, you're ready to start typing!"
    }
  ]
}