{
  "url": "https://www.wikihow.com/Start-an-Online-Business-As-a-Kid",
  "title": "How to Start an Online Business As a Kid",
  "steps": [
    {
      "title": "Make a list of things you like to do and are good at.",
      "content": "Make a list of things you like to do and are good at. [1] X Research source Go over your list and write down any ideas you can come up with to turn your knowledge and talents into money. Think about the things you want to sell first. Is it a physical product? Is it a digital product that can be sent over the Internet, like a game or an image file?"
    },
    {
      "title": "Consider how you can make your product unique, high quality, and something people might want or need.",
      "content": "Consider how you can make your product unique, high quality, and something people might want or need. Make rough sketches showing you how you want your product to look if you think this might help you. Include inner parts and mechanisms if there are any. Make notes of the function and operation."
    },
    {
      "title": "Write down your ideas.",
      "content": "Write down your ideas. Writing down your ideas is a good practice even if your business has already developed. Write down the materials you will need to make your products."
    },
    {
      "title": "Name your business/brand and products.",
      "content": "Name your business/brand and products. Come up with catchy descriptive names that people will remember. You want repeat customers, so help them find you again. Make sure that your business name is easy to digest and understand. Create a logo.You can create a logo that describes and gives off the feel of your business. Write good product descriptions for everything you want to sell."
    },
    {
      "title": "Do some market research.",
      "content": "Do some market research. Search for similar products and note the design, materials, finished product, and price points. Set your prices. Consider the cost of materials, how much time it takes you to make it, and take into consideration what your competitors are charging. [2] X Research source Make sure your price is fair to your customer, and also fair to you. Don't just sell something cheap thinking you'll sell more. If it's too cheap people will think the quality is bad and won't buy from you. Of course, when you're selling to people in your school you can make cheap prices because they'll see exactly what they're getting, not just a picture."
    },
    {
      "title": "Determine shipping costs.",
      "content": "Determine shipping costs. Weigh your item, along with the packaging you'll use to ship it. Then look up postage on the post office website. Use a postal scale to get the right weight so you can estimate the cost of postage. If you don't have access to a postal scale, see if your parents can weigh it at work, or go to the post office... they'll be happy to weigh it for you, but sometimes they won't. Consider the cost of packaging. The post office has free boxes for priority mail, but if you're sending first class to save money you'll need to furnish your own boxes or padded envelopes. Add these costs to your shipping price. You don't want to spend all your profits on shipping."
    },
    {
      "title": "Send out your orders as fast as you can.",
      "content": "Send out your orders as fast as you can. People who shop on-line expect fast delivery. [3] X Research source Make sure you do this if you want repeat customers. Keep them happy."
    },
    {
      "title": "Take advantage of postal discounts.",
      "content": "Take advantage of postal discounts. If you're paid by PayPal, you should go into your account and click on \"Print Shipping Label\" next to your customer's name to buy your postage. [4] X Research source This saves you from needing to go to the post office, and you'll get free tracking, plus a postage discount of about $1. Plus, when you buy tracking at the post office it costs about $1, so by printing postage on-line you will save about $2 for each package... this is profit... more money in your pocket for each order. It adds up! (Or you can pass the savings along to your customers.) If you buy your postage labels from PayPal you also get $50 free insurance, just in case your package gets lost or damaged. Plus all you have to do is put your package in your mailbox and the postman does the rest, no more trips to the post office. Ask your friends and family to save boxes for you. When you reuse boxes to make sure you cover up any bar codes on the outside so they don't get scanned at the post office. Only use boxes that don't show pictures of food or other products. You won't want to use a cereal box or pizza box, it looks unclean and unprofessional... remember, this is a business and you want to make a good impression. Take care to protect your product from damage in transit. Ask family and friends to save bubble wrap and packing peanuts for you. Get tracking numbers and share them with your customers. This way you have proof of delivery if someone tries to scam you."
    },
    {
      "title": "Think about where on the Internet you will sell your product or service.",
      "content": "Think about where on the Internet you will sell your product or service. Look at the different options for selling venues."
    },
    {
      "title": "Plan on how you will accept payment.",
      "content": "Plan on how you will accept payment. PayPal is good but you'll need a parent to set up an account for you. Accounts need to be linked to a checking account, so if you don't have one, you'll need to either get one or use your parents."
    },
    {
      "title": "Discuss every detail of your plans with your parents.",
      "content": "Discuss every detail of your plans with your parents. This includes your product, how you will get your materials and pay for them, where you will sell your product, how you will brand it, your shipping plans, and of course how you will take payment. If you show your parents that you've thought out every aspect of your business and have planned for everything, they'll be more likely to support you in your venture. They will probably have some good ideas to help you too. If you're selling online, you will NEED your parent's support. They'll have to either set you up to take payments or allow you to take payment through their account. Think about it, how will you cash a check or take a credit card if you're too young? You need your parents for this. If your parents disagree, try to find a compromise. Maybe only work on your business after your homework and chores are done during the week. Use your weekends to do everything you weren't able to get done during the week for your business. Let your parents know that you understand that running your business will cut into your social life and playing video games and that you're willing to let that happen, within reason. Your parents will want you to do other fun things and enjoy being a kid, so be prepared to show them how you will balance out your activities. Maybe you can make a deal to earn the right to start your business by promising to show them you can act mature in every aspect of your life, and improve your grades in every subject. Sure, this means you can't start selling right away, but if you're completely sure that you're going to take your business seriously you can use this time to do everything that needs to be done to start your business. Like, use your allowance to buy materials and a postage scale. You can get a postage scale for about $10. As you buy your materials, you should be making a product so you start with a well-stocked store. Concentrate on making products first, but slowly set aside the money you'll need for the postage scale so you're ready to take off as soon as you get permission. This will show your parents that you're really serious."
    },
    {
      "title": "Start making your online store.",
      "content": "Start making your online store. There are many options. Search Google for free site hosting services. Evaluate each option by reading their terms of use, and learning about all the services they offer. For a stand-alone website , you will need the freedom to take payments and do SEO (Search Engine Optimization) so you're found in search. Check into selling on an established high traffic platform, like eBay or Etsy. They already have a lot of customers on their sites and they make selling easier since you don't need to make a website or do any SEO. They also keep business records for you, so you can go in any time and look at what items sell and what doesn't. Then base your future products on those market trends. Simple."
    },
    {
      "title": "Keep business records.",
      "content": "Keep business records. Write down everything you spend for your business, all materials, your shipping costs, and how much you sell. Compare your expenses to your income to make sure you're making a profit."
    },
    {
      "title": "Design your on-line store to represent your product and personality but keep the extras in your design minimal.",
      "content": "Design your on-line store to represent your product and personality but keep the extras in your design minimal. No one wants to hear music, don't use it. Remember, that song you like so much will bother a potential customer if they go to your website when they're at work. They will immediately click away to stop the music and you just lost a sale. You don't want that. Use a subtle background. You want your products to catch your customer's eye, not the background. Never use anything distracting, like animated gifs or unnecessary flash. Remember, keep focused on your product. You need to look professional if you want people to hand over their hard-earned money. Make sure you have a contacts page, an about page, and a policy page. Your policies will tell customers how you ship and when, what your return policy is if any, and if you take custom orders. For example, if you're making friendship bracelets, tell people you'll make them any color they want or in a different style. Once your business starts taking off, maybe you can order inexpensive business cards from a site like Vista print and use your logo. Include a card in every order you send so they can remember where they got that great item when it comes time for them to shop for a gift. Of course, you can make your business cards, but make sure they look professional and are cut straight. If you don't have a paper cutter for this, have someone take you to a Kinko's where you can use theirs for free. Before printing out a lot of cards, print out one sample page to show your parents. They will tell you if your cards look professional or if you need to make changes."
    },
    {
      "title": "Take advantage of the vast possibilities to promote your business, on-line and off-line.",
      "content": "Take advantage of the vast possibilities to promote your business , on-line and off-line. Start with some simple free ways to advertise, like telling your friends and family. They may love the product you sell and spread the word."
    },
    {
      "title": "Optimize your website for search engines.",
      "content": "Optimize your website for search engines. People will find you if they're looking for a kind of product related to yours. [5] X Research source For example, if you sell plant seeds, use keywords like seeds, planting seeds, and gardening. Think of relevant search phrases too, like marigold seeds, or pumpkin seeds. But don't just use keywords, write a little bit and use your keywords in sentences."
    },
    {
      "title": "Promote your business.",
      "content": "Promote your business. A successful online store starts with you being found. Use social media to create some buzz. Focus on platforms that people are most likely to check when looking up your type of business—for instance, a new restaurant owner might focus on platforms like Yelp, Instagram, and Facebook. Use Instagram. Create a Facebook page for your business. You will want to write a short story about your business. Remember to stay active and post pictures of your products as you make them, and include links to your store. Invite everyone you know to join your group and have them \"like\" your group and \"share\" your new products. Make a blog about the subject of your business and write in it at least once every day. It's fine to let your personality shine through on your blog but make sure you don't have any spelling, grammar, or punctuation errors. You want this to look both personable and professional."
    }
  ]
}