{
  "url": "https://www.wikihow.com/Treat-Crepitus-in-the-Knee",
  "title": "How to Treat Crepitus in the Knee",
  "steps": [
    {
      "title": "Know the symptoms of osteoarthritis.",
      "content": "Know the symptoms of osteoarthritis. [3] X Research source Unlike the \"normal\" popping sound that can come from stretching, which is painless, knee crepitus from arthritis is often quite painful. Luckily, there are several ways to detect osteoarthritis: [4] X Research source Look for signs of pain, redness, swelling, and stiffness while walking. The most common location of crepitus from arthritis is in the inner part of the knee. Feel for the presence of crepitus by placing one hand on top of the knee while flexing and extending the joint. Usually, crepitus results in a soft yet crunchy sensation. [5] X Research source"
    },
    {
      "title": "Reduce local swelling.",
      "content": "Reduce local swelling. If the crepitus is accompanied by pain and signs of inflammation, apply ice packs (wrapped in a towel) to the area. Ice packs help decrease the swelling of the inflamed area and ease the associated pain. You may also take small amounts of over-the-counter NSAIDs (non-steroidal anti-inflammatory drugs) such as Advil (Ibuprofen) or Naproxen (Aleve) for quick pain relief. However, don't rely on these drugs for long-term pain relief, as they can affect the kidneys and gastrointestinal tract. The benefit of NSAIDs (which are anti-inflammatory medications) is that they not only diminish pain but also reduce inflammation. You may combine an NSAID with an over-the-counter painkiller such as Tylenol (Acetaminophen). This does not diminish inflammation, but it can help to diminish the pain, and the two medications in concert (an NSAID and Tylenol) can be extremely effective and helpful at getting you through your day-to-day activities pain-free."
    },
    {
      "title": "Get a prescription for anti-inflammatory drugs.",
      "content": "Get a prescription for anti-inflammatory drugs. Prescription NSAIDs include Indocin, Daypro, Relafen, and a variety of other drugs. [6] X Research source Prescription-strength anti-inflammatory drugs are stronger-acting than over-the-counter varieties and may prove more effective at fighting the pain and inflammation associated with knee crepitus. However, these stronger drugs require permission from a doctor, which usually means your knee crepitus will need to be clinically examined by one. Prescription NSAIDs can have side effects - most commonly, stomach irritation, but in severe cases (and in cases of overdose), stomach ulcers and kidney damage are possible. [7] X Research source Always take medicine as directed, and not more than your doctor recommends."
    },
    {
      "title": "Receive a cortisone injection.",
      "content": "Receive a cortisone injection. Cortisone is a steroid hormone that is naturally produced by the body in response to stress. (Note: it is not the type of steroid used — and sometimes abused — by athletes and bodybuilders.) It suppresses the body's immune system, greatly reducing inflammation. For cases of painful knee crepitus, doctors may choose to inject cortisone directly into the knee joint to reduce pain and inflammation. Cortisone injections have proven useful as a treatment for periodic \"flare-ups\" of knee crepitus. However, frequent, repeated injections into the joint can actually cause cartilage to deteriorate, worsening crepitus-associated pain. For this reason, cortisone injections aren't suitable as a long-term form of treatment. [8] X Research source Cortisone injections are not recommended more than once every three months, but they can be used for as long as they are effective, which can be several years in certain cases."
    },
    {
      "title": "Undergo a treatment called \"viscosupplementation.\"",
      "content": "Undergo a treatment called \"viscosupplementation.\" Something called \"synovial fluid\" within the knee joint is used to lubricate and stabilize the motion of the joint. In some patients with osteoarthritis, the synovial fluid becomes \"thinner\" - in other words, less viscous. This can lead to extra friction and abnormal joint movement. In this case, your doctor may recommend \"viscosupplementation\" — a procedure that involves injecting new fluid into your knee joint to strengthen and lubricate your knee joint. Usually, this treatment takes place as a series of three to five injections over the course of several weeks. Note that, of patients who undergo \"viscosupplementation,\" about half find relief from their symptoms. [9] X Research source"
    },
    {
      "title": "Wear a knee brace.",
      "content": "Wear a knee brace. Special medical braces are sometimes given to patients with arthritis in the knee. These braces shift the weight off of the inside portion of the knee, where crepitus is most common. [10] X Research source Knee braces can also stabilize and support the knee joint, ensuring it bends in a healthy way and protecting it from further damage or irritation. While over-the-counter knee braces are commercially available for cheap prices, most medical-quality knee braces need to be custom-made to fit your joint and can, therefore, be more expensive. Talk to your doctor for pricing information if you're interested in a knee brace."
    },
    {
      "title": "Talk to a doctor about surgery.",
      "content": "Talk to a doctor about surgery. In severe cases of knee crepitus associated with arthritis, surgery may be an option. If your quality of life has seriously deteriorated due to knee pain and you've already tried non-surgical treatments, consider talking to your doctor about options for knee surgery. There are several types of knee surgery that your doctor may recommend: Total or partial knee replacement, cartilage repair, knee arthroscopy, and knee osteotomy are common options. [11] X Research source Note that knee surgeries that work well for one patient may not work for other patients. Arthritis is notoriously tricky to treat — be sure you discuss all options with your doctor before you make a decision."
    },
    {
      "title": "Make sure you have the correct diagnosis.",
      "content": "Make sure you have the correct diagnosis. Knee pain can be caused from a few different diagnoses, including osteoarthritis (caused by mechanical \"wear and tear\" on the knee joint over time — the most common cause), rheumatoid arthritis (caused by autoimmune problems), infectious arthritis, old knee injuries, or patellar dysfunction to name a few. [12] X Research source It is key to see a doctor to establish the correct diagnosis because the best treatment and management plan depends specifically on what is going on inside your knee. Similarly, if you have been diagnosed with osteoarthritis, for example, but find that it is not improving with treatments, speak to your doctor about the possibility of investigating other possible diagnoses. [13] X Research source"
    },
    {
      "title": "Manage your weight.",
      "content": "Manage your weight. Each pound of weight gain puts up to six more pounds of pressure on the knee joint. Thus, overweight people tend to develop arthritis more frequently than those at a healthy weight. [14] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source To prevent future knee pain (and to lessen symptoms that already exist), try to maintain a healthy weight, primarily through diet (exercise may be limited by the presence of knee pain). People with arthritis are advised to avoid processed or fried foods, sugars, refined carbohydrates, salt, preservatives, and corn oil, all of which may aggravate the inflammation of the joint directly or through weight gain."
    },
    {
      "title": "Exercise.",
      "content": "Exercise. Muscles around the joint act as shock absorbers, helping to support and stabilize the joints both in physically demanding situations (such as during sports and exercise) as well as in your daily activities. The stronger the muscles are, the greater stress they can absorb. To help prevent crepitus (and, if you already have it, to reduce it), gradually build the muscles around your joint through strength exercise. For knee crepitus, thigh contraction is a great exercise that strengthens muscles around the knee joint. Place a rolled-up towel under your knee and tighten your thigh muscles. Hold it for five seconds and relax and repeat again for 10 times. Isometric exercises such as straight leg raises ( with the knee locked), quad sets, or wall sits can strengthen the joint while limiting motion through the involved joint. This avoids aggravating the joint and increasing pain and inflammation). Low-impact cardio exercises such as biking or swimming may also be done (recommended at least three times a week) to improve the muscle strength of the thigh and calf. These exercises can also help you lose weight, further reducing crepitus pain."
    },
    {
      "title": "Try a combination of ice and heat packs.",
      "content": "Try a combination of ice and heat packs. [15] X Research source Both have been shown to help people diminish the pain that is often associated with knee crepitus. Try experimenting with icing and/or heat to see if it works for you."
    },
    {
      "title": "Cautiously consider dietary supplements.",
      "content": "Cautiously consider dietary supplements. Certain nutritional supplements, including glucosamine sulfate and chondroitin sulfate, are used by some arthritis sufferers to treat and/or prevent crepitus. [16] X Research source However, these supplements are not regulated by the FDA and have not yet been scientifically proven to work. There is also little information on any side effects from long-term use of these supplements. Clinical studies are underway to evaluate these supplements for medical use. In the meantime, talk to your doctor or someone you trust who has tried these dietary supplements before beginning to take them."
    }
  ]
}