{
  "url": "https://www.wikihow.com/Treat-Sandfly-Bites",
  "title": "How to Treat Sandfly Bites",
  "steps": [
    {
      "title": "Give icing or other home remedies a try.",
      "content": "Give icing or other home remedies a try. Sandflies are a common nuisance in many parts of the world, so there are many home remedies available online. Some people, for instance, find temporary relief by holding an ice pack wrapped in a washcloth over any bites for up to 10 minutes per hour. [1] X Research source Icing, in fact, seems to be the most medically-proven way to relieve itchy bug bites. [2] X Research source Other home remedies include: aloe vera gel, blue gel toothpaste; mentholated topical ointments (such as Vicks VapoRub); tea tree oil diluted in a carrier oil; baking soda and water mixed into a paste; soaking in a warm bath with a cupful of powdered oatmeal mixed in. [3] X Research source"
    },
    {
      "title": "Dab hydrocortisone cream onto the bite to manage your symptoms.",
      "content": "Dab hydrocortisone cream onto the bite to manage your symptoms. Over-the-counter hydrocortisone cream can reduce pain and inflammation from a bug bite. Read and follow the instructions on your hydrocortisone cream. Apply a small amount of cream directly onto your bite, but keep the cream off of your healthy skin. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Don't use hydrocortisone cream for longer than 7 days unless your doctor tells you to do so. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Try antiseptic, anti-itch, and/or soothing lotions on itchy bites.",
      "content": "Try antiseptic, anti-itch, and/or soothing lotions on itchy bites . You can find a range of products marketed for soothing bug bites, though there is limited evidence that they actually make much difference. Try different products for 2-3 days at a time and see if any one in particular works best for you. [6] X Research source Always follow the product instructions carefully and contact your doctor first if you have any concerns about side effects or drug interactions. [7] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source You might try, for instance, a gel containing 2% lidocaine or 1% hydrocortisone."
    },
    {
      "title": "Try an antihistamine lotion or tablets for more serious itching.",
      "content": "Try an antihistamine lotion or tablets for more serious itching. The itchiness associated with sandfly bites is caused by your body’s histamine response to the insect’s saliva in the wound. Try applying a pea-sized or smaller dab of a topical antihistamine to each bite mark. Follow the product instructions for how often to apply the lotion. [8] X Research source If you have numerous sandfly bites, you might have better results from taking an oral antihistamine—such as 10 mg cetirizine or loratadine—instead. Once again, follow the product instructions. You can buy topical and oral antihistamines over the counter (OTC), but it never hurts to contact your doctor before using an antihistamine. As with other OTC bug bite remedies, there is limited evidence that oral or topical antihistamines make much of a difference. [9] X Research source"
    },
    {
      "title": "Apply calamine lotion as another possible remedy.",
      "content": "Apply calamine lotion as another possible remedy. Shake up the bottle of calamine lotion, then apply a small amount to a cotton ball. Dab a thin coating of the lotion over each itchy bite mark and allow it to dry for 2-3 minutes before covering it with any clothing. Keep the lotion on for up to 3 hours before wiping it away with a damp cloth, and reapply it as often as needed. [10] X Research source Follow the product instructions or your doctor’s advice for specific guidance on using calamine lotion. If you develop a rash or irritation, stop using calamine lotion. Once again, the evidence for calamine lotion's effectiveness in soothing bug bites is limited at best. [11] X Research source"
    },
    {
      "title": "Take an over-the-counter pain reliever if your sandfly bites hurt.",
      "content": "Take an over-the-counter pain reliever if your sandfly bites hurt. Ask your doctor if it's safe for you to take over-the-counter nonsteroidal anti-inflammatory drugs (NSAIDs), such as ibuprofen (Advil, Motrin) or naproxen (Aleve). These medications will help relieve pain and reduce inflammation. Take the medication as directed on the label. [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you can't take NSAIDs, ask your doctor if you can take acetaminophen (Tylenol) for pain relief."
    },
    {
      "title": "Resist the urge to scratch the itchy bites!",
      "content": "Resist the urge to scratch the itchy bites! While scratching an itchy sandfly bite can provide very temporary relief, it runs a high risk of making the problem worse. Scratching can break open the skin and introduce bacteria, which in turn can cause the bite to become infected. In this case, you’ll need to see your doctor. [13] X Research source The bite may be infected if the swelling or redness increases, if you feel warmth in the area of the bite, if there’s any discharge from the bite, or if you get a fever. Contact your doctor if this occurs, whether or not you’ve been scratching the bite. You may need to use topical or oral antibiotics if the bite becomes infected."
    },
    {
      "title": "Cover your skin—especially legs, ankles, and feet—with light-colored clothing.",
      "content": "Cover your skin—especially legs, ankles, and feet—with light-colored clothing. Simply put, sandflies can’t bite your skin if they can’t get to it! Wear shoes, long socks, pants, and a long sleeve shirt if possible, and tuck your shirt into your pants. Stick to light colors as well, since sandflies seem to be more attracted to darker colors. [14] X Research source Focus especially on your feet, ankles, and lower legs, since this is where sandflies tend to bite most often. You may want to tuck your pants into your socks."
    },
    {
      "title": "Steer clear of bodies of water during dawn and dusk.",
      "content": "Steer clear of bodies of water during dawn and dusk. Most varieties of sandflies stay within about 10 m (33 ft) of a body of moving water, such as an ocean, lake, or river. Additionally, they tend to be most active during dawn and dusk hours. By avoiding these conditions, you can greatly reduce your risk of being bitten. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Not all sandfly varieties follow this pattern, however—some types are more active during mid-day sunshine, for instance. Ask locals for some insider info on the native sandfly varieties and how best to avoid them."
    },
    {
      "title": "Use an insect repellent containing DEET when going outdoors.",
      "content": "Use an insect repellent containing DEET when going outdoors. Follow the product instructions and spray the repellent on exposed skin, with a particular focus on any areas of exposed skin below the knees. You can also spray it on your clothing where it meets exposed skin—like the cuffs of your shirt and pants—although some repellents may stain certain fabrics. [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Insect repellents that contain DEET are safe to use on children, but use the lowest amount that's effective. Alternatively, use an insect repellent that contains natural ingredients if it's effective. [17] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Repellents containing DEET seem to be most effective in keeping away sandflies, but you can try alternate chemical or natural repellents instead."
    },
    {
      "title": "Know your risk for this illness based on where you live or travel.",
      "content": "Know your risk for this illness based on where you live or travel. Leishmaniasis is an infection caused by parasites that are introduced to your body when bitten by an infected sandfly. While very rare in many parts of the world, including North America, Australia and New Zealand, and most of Europe, it is more common in certain other areas. [19] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you live in or are traveling to Central or South America, the Middle East, North or Central Africa, southern Europe, or tropical parts of Asia, you may be at higher risk of getting leishmaniasis from sandfly bites. If you’re in an area with an elevated risk, it’s important to take measures to avoid getting sandfly bites. These include wearing long clothing, applying insect repellent with DEET, and avoiding moving bodies of water during dawn and dusk."
    },
    {
      "title": "Watch for signs of cutaneous or visceral leishmaniasis.",
      "content": "Watch for signs of cutaneous or visceral leishmaniasis. Cutaneous leishmaniasis is far more common, and often presents on the skin as raised red bumps or even ulcers that scab over or ooze from the middle. In short, your sandfly bite will appear infected and should be evaluated by a doctor. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Visceral leishmaniasis is more rare and involves an infection of your internal organs. Instead of watching for signs of infection at the site of the bite, keep an eye out for fever, unexplained weight loss, and fatigue. Your doctor will check for abnormal blood test results, low blood counts, and swelling of the spleen and liver. If you experience these symptoms but haven’t been in an area where leishmaniasis is endemic, you likely have another type of infection. You should still go to your doctor for an evaluation."
    },
    {
      "title": "Discuss potential treatments for cutaneous leishmaniasis with your doctor.",
      "content": "Discuss potential treatments for cutaneous leishmaniasis with your doctor. In most cases, cutaneous leishmaniasis will go away on its own over a period of weeks to months. Therefore, active treatment is not always recommended. In some cases, though, your doctor may recommend one of several medications for this condition. [21] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Some types of cutaneous leishmaniasis (especially types found in Central and South America) can spread to the mucous membranes of the mouth, nose, and throat. Active treatment is more likely if this is a possibility in your case. Most cases of cutaneous leishmaniasis don’t cause long-term medical problems, although you may experience scarring where the bumps or ulcers form."
    },
    {
      "title": "Undergo treatment right away if you have visceral leishmaniasis.",
      "content": "Undergo treatment right away if you have visceral leishmaniasis. Because it affects key internal organs such as your liver, visceral leishmaniasis must be treated as soon as possible. The first line of treatment is likely to be one of several medication options, but some cases may require surgical interventions or even organ transplants. [22] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source When detected early on, visceral leishmaniasis can usually be treated successfully. Advanced cases, however, are often fatal. This is why it’s so essential to keep an eye out for signs of infection if you’ve been in areas where leishmaniasis is endemic."
    }
  ]
}