{
  "url": "https://www.wikihow.com/Use-iCloud-Storage",
  "title": "How to Use iCloud Storage",
  "steps": [
    {
      "title": "Open your device's Settings.",
      "content": "Open your device's Settings. It's an app that contains gears (⚙️) and is typically located on your home screen. [1] X Expert Source Gonzalo Martinez Computer Repair Technician Expert Interview. 25 July 2019."
    },
    {
      "title": "Tap your Apple ID.",
      "content": "Tap your Apple ID. It's the section at the top of the menu that contains your name and image, if you've added one [2] X Expert Source Gonzalo Martinez Computer Repair Technician Expert Interview. 25 July 2019. If you are not signed in, tap Sign in to (your device) , enter your Apple ID and password, then tap Sign In . If you are running an older version of iOS, you may not need to do this step."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It's in the second section of the menu. [3] X Expert Source Gonzalo Martinez Computer Repair Technician Expert Interview. 25 July 2019."
    },
    {
      "title": "Select the types of data you wish to store on iCloud.",
      "content": "Select the types of data you wish to store on iCloud. Do so by sliding the buttons next to the apps listed under \"Apps Using iCloud\" to the \"On\" (green) or \"Off\" (white) position. Scroll down to see the complete list of apps that may access iCloud."
    },
    {
      "title": "Tap Photos.",
      "content": "Tap Photos . It's near the top of the \"Apps Using iCloud\" section. [4] X Research source Turn on iCloud Photo Library to automatically upload and store your camera roll to iCloud. When enabled, your entire photo and video library will be accessible from any mobile or desktop platform. Turn on My Photo Stream to automatically upload new photos to iCloud whenever you're connected to Wi-Fi. Turn on iCloud Photo Sharing if you'd like to create photo albums that friends can access over the web or on their Apple device."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It's in the upper-left corner of the screen."
    },
    {
      "title": "Scroll down and tap Keychain.",
      "content": "Scroll down and tap Keychain . It's near the bottom of the \"Apps Using iCloud\" section."
    },
    {
      "title": "Slide the \"iCloud Keychain\" button to the \"On\" (right) position.",
      "content": "Slide the \"iCloud Keychain\" button to the \"On\" (right) position. It will turn green. Doing so makes stored passwords and payment information available on any device that you've logged into with your Apple ID. Apple does not have access to this encrypted information."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It's in the upper-left corner of the screen."
    },
    {
      "title": "Scroll down and tap Find My iPhone.",
      "content": "Scroll down and tap Find My iPhone . It's near the bottom of the \"Apps Using iCloud\" section."
    },
    {
      "title": "Slide the \"Find My iPhone\" button to the \"On\" (right) position.",
      "content": "Slide the \"Find My iPhone\" button to the \"On\" (right) position. Doing so allows you to locate your device by logging into iCloud on a computer or mobile platform and clicking on \"Find My iPhone .\" Turn on Send Last Location to enable your device to send its location information to Apple when the battery is critically low."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It's in the upper-left corner of the screen."
    },
    {
      "title": "Scroll down and tap iCloud Backup.",
      "content": "Scroll down and tap iCloud Backup . It's near the bottom of the \"Apps Using iCloud\" section."
    },
    {
      "title": "Slide the button next to \"iCloud Backup\" to the \"On\" (right) position.",
      "content": "Slide the button next to \"iCloud Backup\" to the \"On\" (right) position. Do this to automatically save all of your files, settings, app data, pictures, and music to iCloud whenever your device is plugged in, locked, and connected to Wi-Fi. iCloud Backup enables you to restore your data from iCloud if you replace or erase your device."
    },
    {
      "title": "Slide the \"iCloud Drive\" button to the \"On\" (right) position.",
      "content": "Slide the \"iCloud Drive\" button to the \"On\" (right) position. Doing so will allow apps to access and store data on your iCloud Drive. Any app listed below iCloud Drive will be able to access its storage if the button next to it is in the \"On\" (green) position."
    },
    {
      "title": "Click on the Apple menu.",
      "content": "Click on the Apple menu. It's the black, apple-shaped icon in the upper-left corner of your screen."
    },
    {
      "title": "Click on System Preferences.",
      "content": "Click on System Preferences . It's in the second section of the drop-down menu."
    },
    {
      "title": "Click on iCloud.",
      "content": "Click on iCloud . It's on the left side of the window. If you're not automatically logged in, enter your Apple ID and password. [5] X Research source"
    },
    {
      "title": "Check the box next to \"iCloud Drive.\"",
      "content": "Check the box next to \"iCloud Drive.\" It's at the top of the right pane. Now you can store files and documents on iCloud. Do so by choosing \"iCloud Drive\" in any \"Save\" dialog box or dragging files to iCloud Drive in the left pane of a Finder window. Select which apps have permission to access iCloud Drive by clicking on the Options button next to \"iCloud Drive\" in the dialog box."
    },
    {
      "title": "Select the types of data to sync with iCloud.",
      "content": "Select the types of data to sync with iCloud. Do so by checking the boxes below \"iCloud Drive\". For example, check \"Photos\" if you want to back up and access your Photos on iCloud. Now, your selected data will be stored and available on iCloud. You may need to scroll down to see all the selections."
    },
    {
      "title": "Go to the iCloud website.",
      "content": "Go to the iCloud website . Do so from any browser, including on a computer running Windows."
    },
    {
      "title": "Enter your Apple ID and password.",
      "content": "Enter your Apple ID and password."
    },
    {
      "title": "View your stored data.",
      "content": "View your stored data. The iCloud web apps allow you to see any of the data you've stored or synced with iCloud. For example, click on Photos to see your synced pictures."
    },
    {
      "title": "Click on iCloud Drive.",
      "content": "Click on iCloud Drive . This opens your iCloud Drive interface, in which you can upload and download documents and files."
    },
    {
      "title": "Click and drag any documents you wish to save onto the Drive screen.",
      "content": "Click and drag any documents you wish to save onto the Drive screen. Now your documents will be available from any device, including iPhones and iPads."
    }
  ]
}