{
  "url": "https://www.wikihow.com/Turn-Off-Hardware-Acceleration",
  "title": "How to Disable Hardware Acceleration in Windows & Chrome",
  "steps": [
    {
      "title": "Right-click the Windows desktop and select Display settings.",
      "content": "Right-click the Windows desktop and select Display settings . This opens your display controls. [1] X Research source Note : Not all hardware supports system-wide hardware acceleration. You'll typically only find the option to enable or disable hardware acceleration on PCs with high-end GPUs. If you can't adjust your hardware acceleration settings for the entire system, you can often disable the feature in certain apps, including your browser, AutoCAD , Discord , and various games. If you have a dedicated GPU, you may see the option to open your GPU's settings on the right-click menu. Depending on your GPU, you may be able to find the setting to disable hardware acceleration if you click that menu item. If you want to turn off your hardware acceleration to stream movies on Discord , see the section to disable it in Google Chrome , Mozilla Firefox , or Microsoft Edge ."
    },
    {
      "title": "Click Graphics.",
      "content": "Click Graphics . It's below \"Related Settings\" in the Display Settings menu."
    },
    {
      "title": "Click Change default graphics settings.",
      "content": "Click Change default graphics settings . It's the blue text at the top of the menu below \"Default settings.\""
    },
    {
      "title": "Click the toggle switch below \"Hardware-accelerated GPU scheduling.\"",
      "content": "Click the toggle switch below \"Hardware-accelerated GPU scheduling.\" It's the first option at the top of the menu. This disables hardware acceleration."
    },
    {
      "title": "Reboot your computer.",
      "content": "Reboot your computer. Once you disable hardware acceleration, you'll need to restart your computer for the changes to take effect."
    },
    {
      "title": "Right-click the Windows desktop and select Display settings.",
      "content": "Right-click the Windows desktop and select Display settings . This opens your display controls. [2] X Research source Note : Not all hardware supports system-wide hardware acceleration. You'll typically only find the option to enable or disable hardware acceleration on PCs with high-end GPUs. If you can't adjust your hardware acceleration settings for the entire system, you can often disable the feature in certain apps, including your browser, AutoCAD, Discord, and various games. If you have a dedicated GPU, you may see the option to open your GPU's settings on the right-click menu. Depending on your GPU, you can find the setting to disable hardware acceleration if you click that menu item. If you want to turn off your hardware acceleration to stream movies on Discord, see the section to disable it in Google Chrome , Mozilla Firefox , or Microsoft Edge ."
    },
    {
      "title": "Click Advanced display settings.",
      "content": "Click Advanced display settings . It's toward the bottom of the right panel. This opens properties for your monitor and GPU."
    },
    {
      "title": "Click Display adapter properties for Display 1.",
      "content": "Click Display adapter properties for Display 1 . It'll be under the \"Display information\" header. A new window will expand."
    },
    {
      "title": "Click the Troubleshoot tab.",
      "content": "Click the Troubleshoot tab. If your video card supports hardware acceleration, you'll usually see this tab at the top of the window. If you don't have a Troubleshoot tab, click the Properties button at the top of the window, and then click the Resources tab."
    },
    {
      "title": "Click the Change settings button.",
      "content": "Click the Change settings button. If the Change settings button is grayed out/deactivated, your graphics card doesn't support changing hardware acceleration settings. [3] X Research source If you're sure your card can handle this change, you probably need to update your drivers ."
    },
    {
      "title": "Click the toggle switch next to \"Hardware acceleration\" and click OK.",
      "content": "Click the toggle switch next to \"Hardware acceleration\" and click OK . This disables hardware acceleration on your PC."
    },
    {
      "title": "Open your Windows Settings .",
      "content": "Open your Windows Settings . It's the gear icon in your Start menu. You can also open your Settings by pressing Windows key + i on the keyboard. If hardware acceleration is turned on for your PC's sound card, sound tasks may be shifted from the CPU to the audio card to avoid overtaxing the CPU. You can try disabling hardware acceleration if you're experiencing high amounts of noise, choppy sound, and slow performance during audio playback."
    },
    {
      "title": "Click System.",
      "content": "Click System . It's the first option in the menu bar to the left."
    },
    {
      "title": "Click Sound.",
      "content": "Click Sound . It's the second option in the main menu panel. It's next to an icon that resembles a speaker."
    },
    {
      "title": "Scroll down and click More sound settings.",
      "content": "Scroll down and click More sound settings . It's the last option below the \"Advanced\" header."
    },
    {
      "title": "Select your audio devices.",
      "content": "Select your audio devices. It will likely be speakers. It may be labeled as \"Realtek Audio\" or whatever sound card model you are using. Click it to highlight it."
    },
    {
      "title": "Click Properties.",
      "content": "Click Properties . It's in the lower-right corner of the Sound menu."
    },
    {
      "title": "Click the Advanced tab.",
      "content": "Click the Advanced tab. It's at the top of the window."
    },
    {
      "title": "Remove the check mark from \"Allow hardware acceleration of audio with this device.\"",
      "content": "Remove the check mark from \"Allow hardware acceleration of audio with this device.\" It's under the \"Hardware Acceleration\" header."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This disables hardware acceleration for audio immediately."
    },
    {
      "title": "Open your Windows Settings .",
      "content": "Open your Windows Settings . It's the gear icon in your Start menu. You can also open your Settings by pressing Windows key + i on the keyboard. If hardware acceleration is turned on for your PC's sound card, sound tasks may be shifted from the CPU to the audio card to avoid overtaxing the CPU. You can try disabling hardware acceleration if you're experiencing high amounts of noise, choppy sound, and slow performance during audio playback."
    },
    {
      "title": "Click the System icon.",
      "content": "Click the System icon. It's the first icon in the Settings panel."
    },
    {
      "title": "Click Sound.",
      "content": "Click Sound . It's on the left panel."
    },
    {
      "title": "Click Device properties in the right panel.",
      "content": "Click Device properties in the right panel. It's under the name of your sound device at the top of the panel."
    },
    {
      "title": "Click Additional device properties.",
      "content": "Click Additional device properties . You'll see this toward the bottom below \"Related settings.\""
    },
    {
      "title": "Click the Advanced tab.",
      "content": "Click the Advanced tab. It's at the top of the window."
    },
    {
      "title": "Remove the check mark from \"Allow hardware acceleration of audio with this device.\"",
      "content": "Remove the check mark from \"Allow hardware acceleration of audio with this device.\" It's under the \"Hardware Acceleration\" header."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This disables hardware acceleration for audio immediately."
    },
    {
      "title": "Open your Windows Settings .",
      "content": "Open your Windows Settings . It's the gear icon in your Start menu. You can also open your Settings by pressing Windows key + i on the keyboard. Since the 2020 release of Windows 10 version 2004, Microsoft has included a new feature called Hardware Accelerated GPU Scheduling, which reduces latency and performance while running apps and games that use the GPU. This feature is only available if you have a separate GPU with updated drivers, so not everyone can access the setting. Most GPU drivers are updated automatically, but you can always check the manufacturer's website to see if new updates are available. [4] X Research source"
    },
    {
      "title": "Click the System icon.",
      "content": "Click the System icon. It's the first icon in the Settings panel."
    },
    {
      "title": "Click Display.",
      "content": "Click Display . You'll see it at the top of the left panel."
    },
    {
      "title": "Click Graphics settings.",
      "content": "Click Graphics settings . It's toward the bottom of the right panel."
    },
    {
      "title": "Click the \"Hardware-accelerated GPU scheduling\" switch to Off .",
      "content": "Click the \"Hardware-accelerated GPU scheduling\" switch to Off . You'll only see this switch if you have a modern GPU with updated drivers and an up-to-date version of Windows 10. If you don't see this option and have a GPU separate from your motherboard, it may not support this feature. After disabling the feature, you'll be prompted to restart your computer. Hardware accelerated GPU scheduling will be turned off once your computer comes back up."
    },
    {
      "title": "Open Google Chrome .",
      "content": "Open Google Chrome . Google Chrome uses hardware acceleration to take advantage of your computer's GPU to lighten the load on your CPU. However, sometimes software incompatibilities can cause problems. Disabling hardware acceleration may fix these problems."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . It's the icon with three dots in the upper-right corner."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It's in the menu that appears when you click the icon with three dots."
    },
    {
      "title": "Click System.",
      "content": "Click System . It's in the menu bar to the left."
    },
    {
      "title": "Toggle off \"Use hardware acceleration when available.\"",
      "content": "Toggle off \"Use hardware acceleration when available.\" The switch will turn grey, and hardware acceleration will be disabled. Make sure to restart your browser to completely apply the new settings."
    },
    {
      "title": "Open Mozilla Firefox.",
      "content": "Open Mozilla Firefox. This looks like an orange fox wrapped around a purple sphere."
    },
    {
      "title": "Click ☰.",
      "content": "Click ☰ . This is in the top-right corner."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . You can find this towards the bottom of the pop-up menu."
    },
    {
      "title": "Scroll down to \"Performance\".",
      "content": "Scroll down to \"Performance\". This is on the General' tab."
    },
    {
      "title": "Uncheck \"Use recommended performance settings\".",
      "content": "Uncheck \"Use recommended performance settings\". Once unchecked, a new option will appear."
    },
    {
      "title": "Uncheck \"Use hardware acceleration when available\".",
      "content": "Uncheck \"Use hardware acceleration when available\". This will disable hardware acceleration on Firefox. Make sure to restart your browser to completely apply the new settings."
    },
    {
      "title": "Open Microsoft Edge.",
      "content": "Open Microsoft Edge. This looks like a blue and green swirled e ."
    },
    {
      "title": "Click ••• .",
      "content": "Click ••• . This is in the top-right corner."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . You can find this towards the bottom of the pop-up menu."
    },
    {
      "title": "Click System and performance.",
      "content": "Click System and performance . This is in the left panel."
    },
    {
      "title": "Toggle off \"Use graphics acceleration when available\".",
      "content": "Toggle off \"Use graphics acceleration when available\". This will disable hardware acceleration in Microsoft Edge. Make sure to restart your browser to completely apply the new settings."
    }
  ]
}