{
  "url": "https://www.wikihow.com/WooHoo-in-The-Sims-2",
  "title": "How to WooHoo in The Sims 2",
  "steps": [
    {
      "title": "Pick two Young Adult or older Sims.",
      "content": "Pick two Young Adult or older Sims. The couple can be straight or gay, as long as they're Young Adults or older. Teens cannot WooHoo or Try for Baby without third-party hacks."
    },
    {
      "title": "Build the relationship between the two Sims.",
      "content": "Build the relationship between the two Sims. The Sims will need to be in a romantic relationship in order to WooHoo. Try building the Daily and Lifetime relationships to around 75 or higher to reduce the chance of the act being rejected."
    },
    {
      "title": "Find a suitable location for your Sims to WooHoo.",
      "content": "Find a suitable location for your Sims to WooHoo. While the double bed is the classic, there are more spots where your Sims can WooHoo. Sims can WooHoo in a... Double bed (make sure that one side isn't against a wall) Hot tub Car at home (Nightlife) Tent (Bon Voyage) Sauna (Bon Voyage) Hammock (Bon Voyage) Closet (Apartment Life) Helicopter (Apartment Life)"
    },
    {
      "title": "Direct one Sim to go to the WooHoo location.",
      "content": "Direct one Sim to go to the WooHoo location. Once you've found a suitable WooHoo location, you can direct your Sim to wait there. For a double bed, click Relax . For a hot tub, car, sauna, or helicopter, click Get In ."
    },
    {
      "title": "Have their partner join them.",
      "content": "Have their partner join them. If their partner is selectable, just direct them to join the other Sim; if they're not selectable, click on them and select Ask to Join . If they're using a double bed, click on the Sim and select Cuddle to enable further romantic options. (You can direct them to kiss or make out, but if their relationship is high enough, it's not necessary.)"
    },
    {
      "title": "Direct the Sims to WooHoo.",
      "content": "Direct the Sims to WooHoo. Once the Sims are together, click on them or the object they're in and select WooHoo , and they'll get to it. Be aware that WooHoo drops some motives, like Hunger, so you might have to check their needs afterwards. If you have cinematic cameras enabled, a cutscene may play when your Sims WooHoo."
    },
    {
      "title": "Pick a Young Adult or older Sim that's already in a relationship.",
      "content": "Pick a Young Adult or older Sim that's already in a relationship. The couple can be straight or gay, as long as they're Young Adults or older. Teens cannot WooHoo without third-party hacks."
    },
    {
      "title": "Send your Sim and their partner to a community lot.",
      "content": "Send your Sim and their partner to a community lot. If their partner lives on another lot, you'll need to invite them out using a phone; if they live on the lot, you can call a taxi, take a car, or direct them to Walk to Lot. To make sure your Sims can WooHoo on the lot, check to see if the community lot has a... Changing booth Photo booth (Nightlife) Elevator (Open for Business or Apartment Life) Sauna (Bon Voyage)"
    },
    {
      "title": "Direct the Sims to WooHoo in a changing booth.",
      "content": "Direct the Sims to WooHoo in a changing booth. Included in the base game, Sims can WooHoo while trying on new clothes. Send a Sim to a changing booth. Click on the booth and select either Try On... or Change Outfit . Click on their partner and select Ask to Join . (If their partner is selectable, you can just direct them to WooHoo in the booth.) Other Sims will gather around the booth to react to what's going on."
    },
    {
      "title": "Send the Sims to WooHoo in a photo booth.",
      "content": "Send the Sims to WooHoo in a photo booth. Players with Nightlife get the added option of WooHoo in a photo booth. Direct one Sim into the photo booth with Get In . Click on their partner and click Ask to Join . (If their partner is selectable, you can just direct them to join.) Click on the photo booth and select WooHoo . Other Sims will gather around the booth to react to what's going on."
    },
    {
      "title": "Take WooHoo to the next level in an elevator.",
      "content": "Take WooHoo to the next level in an elevator. WooHoo in an elevator is fairly simple - click on the elevator and select WooHoo With . Your Sims will pop into the elevator and enjoy themselves, much to the amusement or horror of others on the lot."
    },
    {
      "title": "Let things get steamy in a sauna.",
      "content": "Let things get steamy in a sauna. Bon Voyage adds the sauna to the list of WooHoo-worthy places. If it's just your Sim and their partner in the sauna, they can let things heat up a little further. Direct one Sim into the sauna with Get In . Click on their partner and click Ask to Join . (If their partner is selectable, you can just direct them to join.) Click on their partner and select WooHoo . Other Sims will gather around the sauna to react to what's going on."
    }
  ]
}