{
  "url": "https://www.wikihow.com/Use-Midjourney-on-Discord",
  "title": "A Step-by-Step Tutorial to Use Midjourney on Discord",
  "steps": [
    {
      "title": "Go to https://www.midjourney.com/account/ and verify you're a human.",
      "content": "Go to https://www.midjourney.com/account/ and verify you're a human. Click the box next to the prompt to prove you're not a bot. Then, the page will load. You need a Discord account to use Midjourney AI. If you don't have a free account, go to https://www.discordapp.com to get started ."
    },
    {
      "title": "Click Join the Beta.",
      "content": "Click Join the Beta . It's in the top right corner of your browser window and will prompt Discord to open. If you have the Discord desktop client installed, you might be prompted to open it or to continue in the web browser. It's up to you what to pick! You can use Midjourney in either the Discord desktop app or the web browser. If you're not logged in, you'll need to log in now."
    },
    {
      "title": "Click Join Midjourney.",
      "content": "Click Join Midjourney . You'll see this button in the middle of your screen in your web browser or the Discord app."
    },
    {
      "title": "Join a newcomer channel.",
      "content": "Join a newcomer channel. They are all called \"newbies\" and are labeled with a hashtag, speech bubble, and lock icon. If you don't see any, click \"Newcomer Rooms\" to expand those menus. Double-click a newbie channel to join it. You'll see a list of all the channels in the server on the left side of your screen."
    },
    {
      "title": "Enter /subscribe.",
      "content": "Enter /subscribe . Make sure to press Enter or Return on your keyboard so the prompt goes through. Don't worry; typing this will not ruin whatever discussion is happening in that channel! This bot channel is specifically designed for this, so your message will give the bot a command. You will immediately get a DM from the Midjourney bot containing a link that's uniquely yours."
    },
    {
      "title": "Click the link in the DM.",
      "content": "Click the link in the DM. Click Visit Site if you're asked if you really want to go to the link. People have been abusing the free trials, so Midjourney stopped offering them. Instead, the AI generator releases shorter free trials around new version releases. You'll see the DM pop up in the left corner of your Discord window with a red notification icon."
    },
    {
      "title": "Select a plan and click Subscribe.",
      "content": "Select a plan and click Subscribe . You can switch between annual and monthly billing by clicking the blue text under the Subscribe button. Once you've signed up, return to Discord to create your first image! You can create your images within that newbie channel or add the Midjourney Bot to your Discord server ."
    },
    {
      "title": "Type /imagine.",
      "content": "Type /imagine . The slash makes it a command, so that's an important key in generating your art! Don't press Enter/Return yet."
    },
    {
      "title": "Enter your prompt.",
      "content": "Enter your prompt. You need to tell Midjourney in words what you're looking for. Be detailed so the generator can give you the results that you want. For example, enter /imagine a hyper-realistic render of a mermaid swimming through a green kelp forest surrounded by fish ."
    },
    {
      "title": "Press ↵ Enter or Return on your keyboard.",
      "content": "Press ↵ Enter or Return on your keyboard. Now that you have the full string typed out, you can press Enter/Return to send the command. It'll take a minute or longer, but you'll get a response of 4 variations of your prompt. You can browse online for prompt examples to get better results, but you generally want to use parameters and detailed writing."
    },
    {
      "title": "Click a \"U\" or \"V\" option.",
      "content": "Click a \"U\" or \"V\" option. If you like one of the tiles, click the corresponding number. The top two tiles are \"1\" and \"2\" and the bottom tiles are \"3\" and \"4.\" The \"U\" button upscaled your images in the past, but they are now generated at max size, and upscaling is no longer necessary. If you click the \"U\" buttons now, you can easily single out an image you like from the tiles. It's easier to edit further and download it that way. Use \"V1-4\" to create more variations of an image. If you do this, you'll get another 4 tiles with images with similar art styles and compositions. You can also click the refresh icon to re-roll for different images using the same prompt."
    },
    {
      "title": "More variations and zoom tools are available after you single out an image.",
      "content": "More variations and zoom tools are available after you single out an image. After selecting an image from the 4 tiles with the \"U\" button, you can edit your image as you like. Click Vary(Strong) or Vary(Subtle) to get more variations of your selected image. Use the zoom buttons to zoom in or out on your image. Use the arrow buttons to pan and expand your image. You can do this to make your image larger. Press the heart icon to add it to your favorites. Easily find your favorite images on the Midjourney website. Open the image on the Midjourney website."
    },
    {
      "title": "Save your image.",
      "content": "Save your image. Once you have a single image selected, click it to open it in the middle of your Discord app or as a pop-up on the web browser, then right-click it and select Save Image. [1] X Research source"
    },
    {
      "title": "Don't be wordy.",
      "content": "Don't be wordy. Make sure every word in your prompt pertains to the image you want to generate."
    },
    {
      "title": "Use styles and mediums.",
      "content": "Use styles and mediums. Just using \"cow\" might get you awesome results, but entering \"black and white cow as a 1700s era Victorian queen, line art\" will get you more results that you might be looking for. You can also use art styles like sketching, oil painting, and vector art. Or you can aim for specific artist styles, like \"in the style of Leonardo da Vinci\" or \"in the style of Andy Warhol.\" You can also specify colors and themes."
    },
    {
      "title": "Think about lighting.",
      "content": "Think about lighting. Midjourney might add a lighting choice to some AI-generated art by default, but if you specify it, you might get great results. For example, \"The Eiffel Tower at midday with cinematic lighting\" will get different results than \"The Eiffel Tower.\""
    },
    {
      "title": "Use images.",
      "content": "Use images. Sometimes, you want to create an AI-generated image based on your cat. In that case, paste your image's URL into the chat (or drag and drop the image to Discord to create a URL). For example, for a steampunk look of your cat, enter /imagine , enter the URL, and add steampunk cat . Press Enter/Return for the results! [2] X Research source If, for example, you have 2 to 5 cats, upload all your images and use the /blend command to mix them with AI!"
    },
    {
      "title": "Have fun.",
      "content": "Have fun. Use parameters at the end of your prompts to make sure you're getting what you want. For example, add -- no sky at the end of your prompt if you don't want the AI to generate sky. Also use parameters like \"weird\" and \"Chaos\" to get unexpected and quirky results. Use \"--ar\" to change the aspect ratio of a generation. Use \"--iw<0-2>\" to change the image weight relative to text weight. The default is 1. Use the /blend command as well as URLs to 2-5 images to create a mixture of the images in one."
    }
  ]
}