{
  "url": "https://www.wikihow.com/Why-Am-I-So-Unmotivated",
  "title": "8 Reasons You Feel Unmotivated + How to Work Past These Feelings",
  "steps": [
    {
      "title": "Being overwhelmed",
      "content": "Being overwhelmed When you feel overwhelmed and like there’s too much on your plate, it can be hard to muster up the motivation to complete even one task. You might also feel overwhelmed if you don’t completely understand the reasons behind why you’re doing each task, and this creates an opportunity for negative thoughts to creep in. [1] X Research source For example, you might be feeling overwhelmed and unmotivated to get work done because your boss never explicitly explained why you were given this task. Or, if you’re in school, you might be feeling overwhelmed because you’re juggling multiple classes, extracurricular activities, and/or a job."
    },
    {
      "title": "Burnout",
      "content": "Burnout People typically experience burnout when they take on too much or keep working without giving themselves proper time to rest. If you’ve been working non-stop recently or have been neglecting your own mental and physical health for other priorities, you may be experiencing a lack of motivation as a result of burnout. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, you might be burned out after working a 40-plus-hour week at your job. Or, you might be burned out after studying non-stop for a big test and barely taking any breaks. Burnout can also happen if you’re a caregiver who’s constantly tasked with looking after another person, whether it’s a child, parent, or friend."
    },
    {
      "title": "Lack of purpose",
      "content": "Lack of purpose You might become very unmotivated if you feel like you're simply going through the motions and not doing anything that’s actually meaningful to you. When the work you do doesn’t align with your personal values or goals, it can be really hard to find the motivation to keep working. For example, you may feel really unmotivated if you’re at a job that you don’t enjoy. Or, you might lack motivation to study for a test in a subject that you know won’t be useful in your future career."
    },
    {
      "title": "Unrealistic goals",
      "content": "Unrealistic goals While it’s great to set goals for yourself, aiming for things that simply aren’t realistic given your personal situation and resources can leave you feeling unmotivated to actually achieve them. Of course, setting some ambitious long-term goals can be good for pushing you to step out of your comfort zone, but a lack of smaller, attainable goals can leave you feeling a bit helpless. [3] X Research source For example, expecting to get a promotion within the first 6 months of a new job might be more on the unrealistic side. Or, aiming to get a 100% on a test you haven’t really studied for can leave you feeling disappointed and unmotivated to study for the next one if you don’t do that well."
    },
    {
      "title": "Self-doubt",
      "content": "Self-doubt When you feel confident in yourself and your abilities, you’re much more likely to feel motivated to take action and achieve your goals. However, constantly thinking negatively about yourself and putting yourself down can lead to a lack of motivation, fear of failure, and general unwillingness to take risks. [4] X Trustworthy Source Princeton University Leading academic institution devoted to expanding and sharing knowledge Go to source For example, you’re likely to be much less motivated to apply for your dream job if you tell yourself you’re not skilled enough or are lacking in a lot of ways. Or, if you don’t think you’re any good at playing a sport, you might be less motivated to practice."
    },
    {
      "title": "Lack of focus",
      "content": "Lack of focus It can be really hard to motivate yourself to get things done and stay productive when you’re constantly being distracted or interrupted. Maybe your coworkers are always coming up to you to talk and keeping you away from your work. Or, maybe you don’t want to study because the noise level in your house makes it too hard to concentrate. Whatever the case, being unable to focus can take a toll on your motivation to get things done. [5] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source It might be that you’re also distracted by thoughts about other things you need to get done. If you’re juggling 10 different tasks at a time, it can be hard to find the motivation to finish just one."
    },
    {
      "title": "Unmet needs",
      "content": "Unmet needs If you’re not in good condition either physically or mentally, you might feel unmotivated to get to work. For example, if you’re hungry or tired, it’s unlikely that you’ll have the energy needed to motivate you to get things done. You might also be dehydrated, or you’ve been working non-stop without enough breaks in between. [6] X Research source You might also be unconsciously neglecting your need for social interaction. If you haven’t seen your friends or family in a while, you may start feeling down and less motivated in your daily life."
    },
    {
      "title": "Depression",
      "content": "Depression Unfortunately, a lack of motivation can also be a sign of more serious issues like depression. People who are suffering from depression often lack motivation, experience feelings of emptiness and hopelessness, and may lose interest in things they once enjoyed. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you think you may be suffering from depression, talk to a licensed therapist or psychologist to get professional help and an official diagnosis."
    },
    {
      "title": "Set realistic goals with actionable steps.",
      "content": "Set realistic goals with actionable steps. One of the best ways to keep yourself motivated is to set goals that are both realistic and contain small, incremental steps that’ll allow you to track your progress. Instead of setting a single, vague goal, come up with multiple short-term goals that you know you’ll be able to achieve. When you have evidence of your growth and progression, you’ll be more motivated to take on even more challenges. One idea is to set SMART goals , which are specific, measurable, attainable, relevant, and time-bound. An example would be: Specific: I’m going to write a short story. Measurable: I’ll write 500 to 1,000 words each day for the next month. Attainable: My workload has lightened and I have a lot of free time after work to sit down and write. Relevant: I enjoy writing as a hobby, and I already have a basic outline for my story. Time-bound: I’ll start at the beginning of March and have my first draft done by the beginning of April."
    },
    {
      "title": "Focus on the “why” behind your actions.",
      "content": "Focus on the “why” behind your actions. Knowing why you’re doing something and the exact purpose of your actions can work wonders in keeping you motivated. If you’re simply going through the motions and don’t actually have a specific purpose in mind, it can be easy to lose motivation and become disinterested in a task. For example, if you’re feeling unmotivated to work on a project at work, remind yourself about why this project is important to the company and what your incentives for doing well are. If you’re a creative person (writer, artist, designer, etc.) and fall into a slump, remind yourself why you enjoy your work and what impact you’re hoping to make with your creations. For students who aren’t feeling motivated to study, think about why it’s so important that you do well in your classes. Maybe you’re hoping to get into a prestigious school, get your dream job, or eventually provide for your family."
    },
    {
      "title": "Reward yourself for making progress.",
      "content": "Reward yourself for making progress. If you only praise and reward yourself when you fully complete a task, it can be really easy to become unmotivated during all of the steps between the start and finish. Instead, give yourself a small reward or at least a pat on the back when you make even a little bit of progress, such as getting yourself a treat or taking a short break. These little rewards will give you something to look forward to while you work. [8] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For example, reward yourself with a small break whenever you finish a section of a project you’re working on for your job. Or, eat a small piece of chocolate every time you get a question right while you’re studying. It can also be really motivating to share your progress and excitement with others. For example, text your friends to let them know when you learn something new or interesting."
    },
    {
      "title": "Figure out when you feel most energized.",
      "content": "Figure out when you feel most energized. Another way to keep yourself motivated and productive is to do your most pressing tasks when your energy levels are at their highest. For example, many people tend to be most energized in the morning before 12 PM. Pay attention to your energy levels and do your best to modify your work schedule to follow this natural pattern. For example, if you feel most energized in the morning, start your day by working on bigger projects at your job and leave the afternoon for more menial tasks like answering emails. If you study or work best at night, make sure that all of your chores and errands are done beforehand so you can concentrate better."
    },
    {
      "title": "Work on only a few tasks at a time.",
      "content": "Work on only a few tasks at a time. Break up your workload into easily-digestible chunks so that you don’t become overwhelmed. Picking 1 or 2 tasks out of a list of 10 can help you get things done faster and be more efficient with your time. As you check off each item on your list one by one, you’ll feel more motivated to keep going and get the rest done. Prioritize the most important and pressing tasks first. If you save them for the end, there’s a chance you’ll be too drained or burned out by the time you get to them. For example, start with tasks whose deadlines are coming up the soonest, then move on to other projects that don’t need to be completed for a while."
    },
    {
      "title": "Avoid fixating on mistakes and “failures.”",
      "content": "Avoid fixating on mistakes and “failures.” If you constantly ruminate on things you supposedly did wrong, your thoughts can take a rather negative turn and leave you feeling unmotivated to keep trying. Instead, make an effort to accept your mistakes and reframe them as learning opportunities. Rather than criticizing yourself, tell yourself what you did well and find 1 or 2 things you can improve for next time. For example, if you received a lower grade than you expected on a test, go over the questions you got wrong and look for any patterns that might indicate where you need to invest more study time. If you made a small mistake at work, don’t be too hard on yourself. Ask yourself what you could’ve done differently, or ask for feedback from your superiors or coworkers to help you do better next time. If you’re ever feeling overwhelmed, don’t be afraid to ask for help from others. They might be able to give you the knowledge and tools you need to feel confident and motivated to try again and improve."
    },
    {
      "title": "Get rid of distractions.",
      "content": "Get rid of distractions. It can certainly be hard to motivate yourself if your focus is all over the place. Before you begin working, get rid of any potential distractions and let others know not to disturb you for the time being. For example: [9] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Turn off notifications on your phone or computer. Leave any distracting devices, like your phone, out of your sight. Set time limits on each task to keep yourself focused and manage your time more efficiently. Get rid of clutter that will end up distracting you, such as dirty laundry in your room or little trinkets on your desk. Reader Poll: We asked 181 wikiHow readers if social media distracts them from things they’d rather be doing with their time, and 85% of them said yes. [Take Poll] Eliminating distractions like your phone can help you focus more on your goals."
    },
    {
      "title": "Optimize your work environment.",
      "content": "Optimize your work environment. To stay motivated, it can also be really helpful to make sure you have all the supplies you need ready beforehand and are in a place where you know you’ll be able to concentrate. For example, make sure your laptop is charged and you have a bottle of water and a snack prepared before you start. Other things to keep in mind include: [10] X Research source Noise level. Do you work better in quiet places or places with a bit of noise? Lighting. Do you concentrate better with lots of light or when it’s a bit darker? Furniture. Are you sitting somewhere comfortable while you work? Do you work better laying down or standing?"
    },
    {
      "title": "Create daily routines and rituals that energize you.",
      "content": "Create daily routines and rituals that energize you. Sometimes it’s the small things that can give you a burst of motivation to get through your work for the day. To help keep yourself excited and motivated to work, indulge yourself in small routines and rituals that will keep your energized and feeling good. For example, be sure to have your morning cup of coffee if you know that the caffeine helps you stay focused. Some other things you might do before getting down to business include: Going for a jog Eating a good meal Reading a chapter of your favorite book Listening to an energizing song Spending time picking out a nice outfit to wear"
    },
    {
      "title": "Allow yourself time to rest and take care of yourself.",
      "content": "Allow yourself time to rest and take care of yourself. Taking proper care of yourself and managing your physical and mental health can help you avoid getting burned out or overly stressed. Take a minute to check in with yourself. Are you getting enough sleep? Eating enough throughout the day? Drinking enough water? If the answer is no, make an effort to address these areas of your life and give yourself the care you need to feel more energized and motivated. For example: Get at least 7 hours of sleep each night. Eat healthy by including lots of fruits, vegetables, whole grains, and protein in your diet. Stay hydrated throughout the day. For adults, drink around 13 cups (3.1 L) of water a day. Practice mindfulness to keep yourself calm and manage your stress. For example, meditate, do yoga, or do some breathing exercises. Exercise throughout the week to stay in shape and keep your stress levels low. Set aside time to pursue your hobbies and interests outside of your work, studies, or other obligations."
    },
    {
      "title": "Eliminate any unnecessary stress.",
      "content": "Eliminate any unnecessary stress. If there’s something in your life that’s really stressing you out, it can make it a lot harder to focus and motivate yourself to move forward. If your situation allows for it, do your best to eliminate the things in your life that are currently causing you stress or anxiety. If they’re not essential to your well-being, work, or relationships, get rid of them.For example: [11] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Cut out toxic friends who bring a lot of negativity to your life. Take a break from social media . Most people often only highlight the best parts of their life on social media, so you might end up feeling worse about yourself if you’re logged on for too long. Avoid worrying about the worst-case scenario. Thinking about everything that can go wrong can just make you more stressed about something that hasn’t even happened yet."
    },
    {
      "title": "Show yourself compassion to remain positive.",
      "content": "Show yourself compassion to remain positive. A lot of your motivation comes from how you talk to and treat yourself. If you criticize yourself harshly or lack confidence, it can be really hard to stay motivated and get things done. On the other hand, thinking about yourself positively and showing yourself compassion can help you form an outlook on life that’s more positive overall. Use positive affirmations to raise your self-esteem and confidence. Tell yourself things like, “I am capable,” “I am strong,” and “I can do this.” Cut yourself some slack when you make mistakes. Nobody’s perfect, and we all need to make mistakes in order to grow and learn. Remember that it's normal to have periods where you’re less productive. Working hard every single day without rest can be exhausting."
    },
    {
      "title": "Talk to a therapist.",
      "content": "Talk to a therapist. If you continue to feel unmotivated, getting help from a licensed therapist may be a beneficial step for you to take. When you go to therapy, you’ll be provided with a safe space to talk about your thoughts and feelings, and your therapist may have exercises that’ll help you feel more motivated. [12] X Research source"
    },
    {
      "title": "You have trouble completing tasks.",
      "content": "You have trouble completing tasks. When you’re lacking motivation, it might feel like it takes an enormous amount of energy to finish just one thing on your to-do list. You might even leave things until the very last minute, or not get a task done at all because you just don’t feel motivated. [13] X Research source What to do: Break your tasks up into smaller, more manageable sections, and just focus on finishing one piece at a time. Before you know it, you’ll be at the finish line."
    },
    {
      "title": "You’re not as excited about things as before.",
      "content": "You’re not as excited about things as before. A lack of motivation can cause you to view things you once enjoyed as tedious and boring. You probably don’t feel excited at the prospect of working on a project, learning something new, or going out to try new experiences. [14] X Research source What to do: Take care of yourself and make sure your most basic needs are met first. Eat well, get enough sleep, and drink water. You might feel more motivated after taking care of your physical well-being."
    },
    {
      "title": "You feel dissatisfied with your abilities.",
      "content": "You feel dissatisfied with your abilities. You might feel like nothing you do ends up the way you had planned. Or, you might feel like you’re lacking inspiration but also aren’t happy with the ideas you do come up with. Unfortunately, a lack of motivation may be caused by low self-esteem or anxiety that causes you to doubt yourself. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source What to do: Take a few minutes to identify your strengths and positive qualities. Sometimes you just need a reminder about all the great things you bring to the table to feel motivated again."
    },
    {
      "title": "You compare yourself to others.",
      "content": "You compare yourself to others. Sometimes we feel unmotivated because we think we’ll never be as good as other people. When you constantly compare yourself to others, you can start to feel insecure and less confident in your own abilities. This can make it really hard to find the motivation to give something a try or keep working to improve. [16] X Research source What to do: Avoid comparing yourself to others . The only person you should compare yourself to is you. For example, compare your past and present self to see just how much you’ve changed and grown."
    }
  ]
}