{
  "url": "https://www.wikihow.com/Speak-Minionese",
  "title": "Talk Like the Minions from Despicable Me: Rules, Examples, & More",
  "steps": [
    {
      "title": "Learn the “baby talk” syllables used by Minions.",
      "content": "Learn the “baby talk” syllables used by Minions. A part of the Minion language is made up of gibberish —Minions often combine simple consonant-vowel syllables to create their silly speech. These syllables create a funny rhythm throughout the Minion language. Minionese also uses a lot of “B” and “P” sounds, which are some of the first consonants that babies learn. [1] X Research source Here are some of the basic syllables that are used most often: “Ba” sounds: Ba, Ca, Da, La, Ma, Na, Pa, Ra, Sa, Ta, Sta “I” sounds: Di, Ki, Mi, Ni, Chi “O” sounds: Bo, Do, Fo, Mo, No, Ro, So, To “U” sounds: Bu, Du, Lu, Mu, Nu, Ru, Su, Tu"
    },
    {
      "title": "Bring in phrases from different languages.",
      "content": "Bring in phrases from different languages. Minionese is also made up of a ton of words and phrases from languages around the world, including (but not limited to) Spanish , French, Korean , Japanese, Chinese , Hindi , Indonesian , and Italian. Throw in some phrases in other languages (they don’t have to actually mean what you’re trying to say) to speak how a Minion does. [2] X Research source Using other languages in Minion speech allows people around the world to relate to these funny yellow creatures. The Minions tend to say the names of non-Minions in English. They also will repeat phrases in English. For example, when Margo suggested ordering a pizza with stuffed crust, the other two girls and one of the Minions said “ooo, stuffed crust.”"
    },
    {
      "title": "Use intentionally mispronounced words.",
      "content": "Use intentionally mispronounced words. The Minions often mispronounce words in English, which are pronounced correctly in their language. When using words in English in your Minionese, it can sound more authentic to “mess up” a couple of the words on purpose. [3] X Research source Here are some real examples of mispronunciations made by the Minions: [4] X Research source “Bello!” (Hello!) “Poopaye!” (Goodbye) “Baboi” (Toy) “Bapple” (Apple) “Buttom” (Bottom)"
    },
    {
      "title": "Use onomatopoeias to make sound effects throughout your speech.",
      "content": "Use onomatopoeias to make sound effects throughout your speech. Onomatopoeias, or vocal imitations of real things, are used by the Minions to symbolize objects or actions. [5] X Research source Here are a couple that Minions use in the movies: “Bee doo bee doo bee doo!” (The sound of a firetruck, means “fire”) “Muak! Muak! Muak!” (The sound of kissing, means “kiss”) “Pop!” (The sound of a balloon popping)"
    },
    {
      "title": "Use inflection and tone to convey meaning.",
      "content": "Use inflection and tone to convey meaning. The best part about Minionese is that all you have to do to communicate with others around you is to show as much emotion as possible. Laugh, scream, make little noises like “ooo” or “ahh,” and use hand gestures and different vocal intonations to get your point across. The natural rhythm that these constant little noises make helps create the bouncy rhythm of Minion speech. [6] X Research source The Minions often get into fights with each other or get into trouble, which provides the perfect opportunity to scream, grunt, and giggle. When running or riding bikes, Minions breathe in and out loudly, when they make goals or hear exciting news, they cheer, and of course, they laugh all the time, at almost everything!"
    },
    {
      "title": "Add common phrases into your Minionese vocabulary.",
      "content": "Add common phrases into your Minionese vocabulary. There are a ton of words and phrases, made of gibberish and other languages, that the Minions use consistently to communicate. Here are some of the most common words and phrases used by the Minions across all their movies: [7] X Research source “Tank yu” (Thank you) “Me want banana” (I’m hungry) “Pwede na?” (Can we start?) “Sa la ka!” (How dare you?) “Bi-do” (I’m sorry) “Tatata bala tu” (I hate you) “Tulalilloo ti amo” (We love you) “Poka?” (What?) “Underwear” (I swear) “Gelato” (Ice cream) “Hana, Dul, Sae” (One, two, three) “Para tu” (For you) “Chasy” (Chair) “Kampai!” (Cheers!) “La boda” (Marriage) “Stupa” (Stop) “Banananonina” (Ugly)"
    },
    {
      "title": "Laugh, scream, and make the little noises that Minions make.",
      "content": "Laugh, scream, and make the little noises that Minions make. Minions often make little sounds to show you what they’re talking about and convey their emotions. While you’re practicing some of the common phrases, try to insert little noises, giggles, and screams throughout your speech. Context makes it clear exactly what the Minions are saying. For example, you know that a Minion is in awe of a shiny new object if they “ooo” and “ahh” as they’re looking at it. Even though Minions sometimes say nonsensical words or phrases that don’t make sense, we can still understand what they’re talking about through their body language. For example, we know when one Minion is making fun of another when they push each other around and point and laugh at each other."
    },
    {
      "title": "Use a voice changer to make your tone match the Minions.",
      "content": "Use a voice changer to make your tone match the Minions. Minionese is often known for the high-pitched tone that the Minions use. [8] X Research source Use an app like Voice Changer With Effects on Apple or Android to adjust your voice to a higher pitch and sound exactly like the Minions. Most voice changer apps will adjust your speech to a higher pitch while speeding up your voice. To sound more like the Minions do, jot down some of the words and phrases you want to use beforehand and speak slowly into the microphone. If you’re using Voice Changer With Effects, choose the “Small Creature” option."
    },
    {
      "title": "Have fun with it!",
      "content": "Have fun with it! Although Minionese contains real words, it isn’t a real language—meaning you can pretty much add to the language in any way you’d like! When you’re learning the Banana Language, it’s all about being as silly as possible and having fun! The director of Despicable Me, Pierre Coffin, said that he thinks it’s funnier when the Minions act like they’re communicating with the gibberish they use, so don’t overthink it!"
    }
  ]
}