{
  "url": "https://www.wikihow.com/Take-Care-of-a-Huntsman-Spider",
  "title": "How to Take Care of a Huntsman Spider",
  "steps": [
    {
      "title": "Pick a tall terrarium that's at least 2 feet (0.61 m) with the closure at the top.",
      "content": "Pick a tall terrarium that's at least 2 feet (0.61 m) with the closure at the top. These spiders are fairly fast and can climb glass. Therefore, you want a terrarium that has a small opening positioned at the top. That way, you can see when your spider is at the bottom and quickly open the top to do what you need to do. [1] X Research source Pick a tank that has a screen for part of the closure. Fresh air is important for this spider. You should not turn a long terrarium on end to make a tall one. That puts the closure on the side, which will make it easier for the spider to escape. Aim for a tank that's 2.5 to 5 gallons (9.5 to 18.9 L)."
    },
    {
      "title": "Add 1 to 2 inches (2.5 to 5.1 cm) of sand to the bottom of the terrarium.",
      "content": "Add 1 to 2 inches (2.5 to 5.1 cm) of sand to the bottom of the terrarium. Sand is much like the huntsman spider's natural habitat, so it will work just fine for a substrate for your spider. Pour it in a thick layer across the bottom, spreading it out as you go. Be sure to rinse the sand several times. After rinsing it, lay it out in a single layer to dry before putting it in the cage."
    },
    {
      "title": "Lean a slab of cork bark up against one side of the glass.",
      "content": "Lean a slab of cork bark up against one side of the glass. These spiders loving crawling on bark, and they like to hide under it, too. Your spider will crawl around the back of it to hide, but you'll still be able to see it between the glass and the cork! [2] X Research source You can find this cork online or in pet stores. It's often sold by stores that stock items for aquariums. Add other enrichment items to the terrarium for your spider. These spiders like hiding under things, so put things like rocks, bark, and dried leaves in the bottom of the cage. You could also add twigs or larger piece of wood. [3] X Research source You can just gather these items from your backyard."
    },
    {
      "title": "Set the spider in a warm area or heat the tank to about 80 °F (27 °C).",
      "content": "Set the spider in a warm area or heat the tank to about 80 °F (27 °C). Huntsman spiders like a warm environment. To keep them warm, place a heat lamp above their cage but use the kind that doesn't give light. To ensure you're not making it too warm for your spider, set a thermometer in the cage to measure the temperature initially. Anything from 75 to 85 °F (24 to 29 °C) is fine."
    },
    {
      "title": "Mist your spider's environment once a day.",
      "content": "Mist your spider's environment once a day. Like tarantulas, the huntsman spider prefers a humid environment. Use a spray bottle to spray a light mist of water over the inside of the cage. A couple of squirts is enough, but don't spray your spider, as you may frighten it. You can also drip a bit of water into the sand at the bottom. The sand will absorb the water and release it into the cage through evaporation."
    },
    {
      "title": "Feed your spider live insects 2-3 times a week.",
      "content": "Feed your spider live insects 2-3 times a week. Provide live crickets, moths, katydids, beetles, and other insects. Drop 1 insect into the cage for your spider to catch or lay it in the cage with a pair of feeding tongs. [4] X Research source You can buy live crickets and other insects at most pet stores. They also like cockroaches. You can even just catch insects around your house or yard, as long as you haven't treated the area with insecticides or pesticides. If your spider doesn't eat what's in the cage, it's likely not hungry. Take it out after 6-8 hours and try again the next day. Interestingly, the spider won't build a web. Rather, it chases down its prey and eats it."
    },
    {
      "title": "Watch for your spider at night.",
      "content": "Watch for your spider at night. Huntsman spiders are nocturnal, so you're more likely to see your spider moving around when the sun goes down. It's also a good idea to turn off the lights for your spider at night, so it doesn't get disoriented living inside."
    },
    {
      "title": "Expect your spider to molt.",
      "content": "Expect your spider to molt. If you see a second spider in your terrarium, don't panic! Your spider has just gotten bigger by leaving its old skin behind. It's a perfectly natural process for your spider. [5] X Research source If you see your spider beginning to molt, don't try to feed it. Just let it get through the process first."
    },
    {
      "title": "Do not handle your spider.",
      "content": "Do not handle your spider. This spider will bite if threatened. While some people are not affected much by the venom, but other people can have an allergic reaction. Therefore, it's best not to handle this spider at all, but rather, let it live out its life in peace. Ice down the area if you get a bite. If it looks red and swollen or the bite seems to be expanding, seek medical attention immediately. [6] X Research source"
    },
    {
      "title": "Care for your spider for up to 2 years.",
      "content": "Care for your spider for up to 2 years. A healthy huntsman spider can easily live this long, so don't get one thinking it will only live a month or 2! If you get tired of caring for it, you can release it outside, as long as it is a native species in your area. [7] X Research source These spiders are native to countries like Australia, New Zealand, and the United States, but make sure the particular species you have is native to your area."
    }
  ]
}