{
  "url": "https://www.wikihow.com/Survive-a-Long-Flight-when-You-Have-Your-Period",
  "title": "How to Survive a Long Flight when You Have Your Period",
  "steps": [
    {
      "title": "Consider booking an aisle seat.",
      "content": "Consider booking an aisle seat. If it is possible, book a seat that is on the aisle. You will likely want to get up every hour or two to visit the restroom, and if you are sitting in the aisle, you won’t have to bother any other passengers in order to do so. If you aren’t able to get an aisle seat, try not to worry. Yes, you will have to ask your neighbor every time you want to get up, and yes, they might get mildly annoyed. Remember, though, that you need to do what you need to do, and it’s not your responsibility to keep them happy. Politely ask them if you can please get up to use the restroom. If you are courteous and respectful, then you have nothing to worry about."
    },
    {
      "title": "Pack plenty of supplies.",
      "content": "Pack plenty of supplies. Make sure you pack plenty of your product of choice. If you typically only use tampons or a menstrual cup, then you might also consider packing a few panty liners, which are like pads but thinner. These will help catch any leakage that might occur. If you use a menstrual cup, you could bring along an extra one if you have it. Otherwise, bring one or two more tampons or pads than you think you will need. You should also consider packing a small hand sanitizer. Though it is likely that the bathroom on the plane will have soap and water, it’s good to have it just in case they run out. You might also pack a small hand lotion. The soap that is provided by the airline could be drying for your skin, and since you will need to wash your hands often, it’s good to have something to help with the dryness."
    },
    {
      "title": "Pack an extra pair of pants.",
      "content": "Pack an extra pair of pants. It is possible that your menstrual product will fail you, and some blood could leak through to your pants. If this is the case, you will be glad that you have an extra, clean pair of pants to put on. If this happens, and you have a plastic bag with you that is big enough to store your pants, you can rinse them in the sink, and store them in the bag. If you don’t have a plastic bag that is big enough, roll your used pants up so that the blood-stained part is on the inside, and then you can just store them in the bottom of your carry-on until you can get to a place where you can wash and dry them properly."
    },
    {
      "title": "Wear comfortable clothes.",
      "content": "Wear comfortable clothes. A long flight is uncomfortable for most people, whether they are on their period or not. While you don’t need to dress like a slob, wear clothes that you feel comfortable in. Consider a pair of nice sweatpants or yoga pants in a color such as black, which will help hide any leakage that might occur. Wear layers. It can be hard to predict how warm or cold the plane will be, but most long flights tend to be on the cooler side. It is often a good idea to wear a comfortable, short-sleeve shirt in case it gets warm, and then pack a warmer sweatshirt, or light jacket that you can put on if you get cold. Pack an extra pair of underwear in case of any leakage. If it does happen, put on the clean underwear, and rinse out the dirty ones in the sink. Place them in a plastic bag so they won’t get any of your other things wet. Pack a pair of warm, comfortable socks to put on during the flight. You could also pack ear plugs and a cozy eye mask, if you plan to sleep."
    },
    {
      "title": "Bring a few sealable plastic bags.",
      "content": "Bring a few sealable plastic bags. It is a good idea to have an extra sealable plastic bag that you can use in case there is no trash can, or if the trash can is over-full. If this is the case, you will be able to wrap your used feminine product in toilet paper, zip it up in the bag, and throw it away later. While this may not be ideal for some, having a plastic bag will give you another option for disposing of your used products. If you get in the bathroom, and realize you won’t have any other place to get rid of used products, you’ll be glad you have them. It may also be handy to have this plastic bag in the event that you need to rinse any blood out of your underwear. This way, you can put the damp, rinsed underwear into the bag without worrying about it getting your other stuff wet. If the idea of putting your baggy of used products into your carry-on bag bothers you, you can stick the plastic bag in the air-sick bag, which is usually in the pocket of your airplane seat, take it to the area where the flight attendants are, and ask them if they have a trash can where you can put it."
    },
    {
      "title": "Pack all of your period supplies into one bag.",
      "content": "Pack all of your period supplies into one bag. If you are embarrassed about people seeing your menstrual products, you can pack them into a small handheld bag. Airplane bathrooms are usually very small, so taking your whole carry-on is probably not an option. Having a bag will also allow you to keep all of your supplies in one place, so you don't forget anything when you go to the restroom. Alternatively, if you don’t have, or don’t want to, bring along another bag to take with you into the bathroom, then just carry them in your hand. A period is a normal, natural thing, and you don’t need to feel embarrassed about it. Most people on flights are too busy sleeping, reading, watching movies, or working to take any notice of what you are doing anyway."
    },
    {
      "title": "Consider packing wet towelettes.",
      "content": "Consider packing wet towelettes. Having a wipe that is a bit moist to help clean up down there can help keep you feeling fresh and clean. There are many menstrual hygiene wipes on the market, and many come individually wrapped so you can open one only when you need it. While you should generally stay away from these type of products, and stick to plain white toilet paper, it's okay to use one every now and then, especially if you have a particularly messy period. You could also use a baby wipe, or simply wet some toilet paper or a paper towel, but be gentle with the skin around your vagina. If you use a wipe or a wet paper towel, do not flush them down the toilet as they may cause clogs. Instead, throw them into the trash can provided, or seal them up in your plastic bag, that you can throw away later."
    },
    {
      "title": "Have some pain killers in your carry on.",
      "content": "Have some pain killers in your carry on. If you are experiencing cramps, back pain, or headaches because of your period, take a pain killer designed to work against menstrual symptoms. You will be even more uncomfortable during your flight if you are suffering from cramps or headaches. Make sure to take only the recommended dosage!"
    },
    {
      "title": "Visit the bathroom every few hours.",
      "content": "Visit the bathroom every few hours. If you are wearing a pad, it is a good idea to check every 2 to 4 hours to see if it has become saturated. [1] X Research source This is especially true if you are experiencing a heavy flow. If you are using a tampon, and have a heavy flow, you may want to check for leakage every 1 to 2 hours, but understand that tampons must be changed at least every 6 to 8 hours. Wearing a tampon for too long, or wearing an absorbency that is too high increases your chances of developing Toxic Shock Syndrome, therefore it is important that you wear an absorbency that matches your flow; for example, only wear a high absorbency on the heaviest day of flow, and change your tampon at least every 6 to 8 hours. If you use a menstrual cup, you may be able to go without emptying it a bit longer, but depending on your flow, you should empty your cup every 4 to 8 hours. Four hours if you have a very heavy flow, and you start to notice a bit of leakage, 8 hours if you have a lighter flow, and aren’t experiencing any leakage. If the bathroom is occupied, it is OK to wait outside of it, or you can try a different bathroom as most bigger airplanes have at least two. It’s good to get up and walk around a bit on long flights anyway, so don’t feel like you’re bothering anyone."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. When you are going to put your hands near your genital area, it is important to wash your hands before and after doing so. The bacteria that is on your hands from touching various things, especially in a crowded public place like an airport, could cause unwanted infections. If you have brought along hand sanitizer, you can also use that. You should wash your hands again after you have finished using the toilet, whether or not you have gotten anything on your hands."
    },
    {
      "title": "Change your menstrual product.",
      "content": "Change your menstrual product. If you discover that it is time for you to change your product, then do so. Wrap the tampon or used pad in plenty of toilet paper, and throw it into the trash. If you use a menstrual cup, empty the cup into the toilet, and rinse it out in the sink before re-inserting it."
    },
    {
      "title": "Don’t throw pads or tampons into the toilet.",
      "content": "Don’t throw pads or tampons into the toilet. Whether you are on an airplane or not, you should not throw pads or tampons into the toilet. They will likely clog the pipes, so just wrap them in some toilet paper, and throw them in the trash provided."
    },
    {
      "title": "Clean up after yourself.",
      "content": "Clean up after yourself. Hopefully there won’t be much clean up to do, but if you accidentally make a mess, or get blood on anything be sure to clean it up well! You don’t want other passengers to come in and find a bathroom dirty because of you. Furthermore, due to concern regarding blood-borne illnesses, if another passenger finds a bit of blood on the toilet seat or anywhere else, there may be a big commotion about making sure it is safe to use the bathroom, and the flight attendants may be forced to close that bathroom all together."
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. Bring a reusable plastic water bottle with you, and fill it up in the bathroom or at a water fountain after you get through security, but before you get on the plane. Humidity in airplanes can drop as low as 20%, which will make you feel more dehydrated. [2] X Research source This may make you have to go to the bathroom more often, but in this case it is okay because you will want to get up regularly to check the status of your menstrual product anyway. Don't try to take a full bottle of water through security. Safety regulations will not allow it, and they will make you throw your bottle away if it is full of liquid."
    },
    {
      "title": "Distract yourself.",
      "content": "Distract yourself. Long flights can be extremely boring. You will want to have plenty of ways to entertain yourself. Bring along a book you’ve been wanting to read, pack music to listen to (through headphones), or pack a tablet or laptop computer to watch movies on. Many long-haul flights also offer in-flight movies, which is great, but you shouldn’t count on this as it may not always be the case. Have a back up plan. Try to get a bit of sleep. For many, sleeping on an airplane is next to impossible, but if you can, try to get a few hours of sleep. This will pass the time, and help you get a little bit of rest before you reach your destination."
    },
    {
      "title": "Recline the seat.",
      "content": "Recline the seat. If you are on a long-haul flight (e.g. a flight overseas) or one where you will fly through the night, recline your seat a bit. While many consider this to be rude behavior, you will find that most people do recline their seat on long flights. However, try to be courteous when doing so, only recline as far back as you need to get comfortable, and glance behind you to see who is sitting there before doing so. If someone that is very tall is already scrunched into the seat behind you, don’t recline the seat and make it even more uncomfortable for them."
    },
    {
      "title": "Bring along a travel pillow.",
      "content": "Bring along a travel pillow. Even if you are not planning to sleep, bringing along a travel pillow can help make you a bit more comfortable on a long flight. If you don’t use it to rest your head, you can place it behind your back or even sit on it to provide a bit more support."
    },
    {
      "title": "Pack snacks.",
      "content": "Pack snacks. While you will likely be offered food on your flight, this food is usually not very tasty or healthy. Oranges, bananas, watermelon, and whole wheat bread are all reported to be helpful for people suffering from menstrual symptoms. [3] X Research source Cut up the watermelon and put it in a sealable plastic container, or just throw an orange or banana in your bag. Not only are these foods healthier, they will help soothe your discomfort. Don’t forget to pack yourself a treat. Part of getting through a painful period is allowing yourself a treat. In this case, you might consider packing a bit of your favorite candy or chocolate to eat while you’re on the plane."
    },
    {
      "title": "Drink tea or coffee.",
      "content": "Drink tea or coffee. Tea and coffee are also believed to be useful for menstruating people. [4] X Research source Fortunately, many airlines will offer these complimentary, so enjoy a warm cup of tea or coffee to get some relief."
    },
    {
      "title": "Use a heat wrap.",
      "content": "Use a heat wrap. There are several products on the market that aim to provide heat to relax muscles. These wraps work like traditional heating pads in that you apply them to the affected area, but they don’t require electricity or hot water to work. There are even wraps that are designed specifically to help with menstrual cramps. These wraps can usually be worn underneath your clothes, so you can put one on your lower abdomen (or wherever you are experiencing muscle pain from your period) before you get to the airport. You could also apply one when you go to use the airplane bathroom. Cramps are caused by muscle contractions, and heat works to help the muscles relax a bit. [5] X Research source"
    }
  ]
}