{
  "url": "https://www.wikihow.com/What-to-Do-with-Old-Glasses",
  "title": "How to Donate, Recycle, or Sell Your Old Prescription Glasses",
  "steps": [
    {
      "title": "Drop your old glasses off at a local Lions Club chapter or dropbox.",
      "content": "Drop your old glasses off at a local Lions Club chapter or dropbox. Lions Club International runs a massive eyeglasses recycling program where they give old prescription glasses to people without affordable access to vision care in the US and abroad. [1] X Research source Before you donate, make sure your glasses aren’t broken or damaged and give the lenses a quick clean . Then, package your glasses in bubble wrap or a padded box or bag so they don’t break in transit (not all donation centers accept glasses cases). [2] X Research source To find a club near you, enter your address or zip code on their Club Locator page . Click the envelope icon next to a location’s listing to send them a message asking if they accept glasses and the best way to drop off or send them. Or, see if your local Walmart vision center has a collection box for the Lions Club. The Walmart Corporation has a partnership with the Lions Club to help collect and donate glasses. If there’s no club or participating Walmart near you, mail your glasses to one of the Lions Club’s eyeglasses recycling centers directly. Click a location on this list of international recycling centers to find its contact information. Once donated, your old glasses will be inspected, cleaned, and sorted by prescription. Then, they will be matched to someone whose prescription is the same as yours."
    },
    {
      "title": "Donate old glasses to other charities like ReSpectacle or OneSight.",
      "content": "Donate old glasses to other charities like ReSpectacle or OneSight. Lions Club International is far from the only organization that collects and redistributes old glasses. Here is a list of more charitable options to consider based on your preference and convenience: [3] X Research source ReSpectacle : This nonprofit collects gently used glasses by mail to give to those in need. Eyes of Hope (VSP Global Eyewear Donations): This vision insurance provider has a charitable branch called Eyes of Hope that redistributes used glasses worldwide. Volunteer Optometric Services to Humanity (VOSH): This organization provides eye care around the world (they are currently only accepting sunglasses donations). OneSight : This nonprofit largely raises money for new glasses, but also accepts gently used ones to redistribute. The Salvation Army : Most Salvation Army locations across the country accept used eyeglasses in most conditions. It’s estimated that at least 1 billion people worldwide have a vision impairment that could have been prevented or hasn’t been addressed yet. [4] X Research source Your donation—even if it’s just 1 pair—is sorely needed!"
    },
    {
      "title": "Or, drop off gently used glasses at retail stores with collection boxes.",
      "content": "Or, drop off gently used glasses at retail stores with collection boxes. There are many retailers in the US who have partnerships with one or more eyeglass collection and recycling services. If there’s no conveniently located charity in your area and you’re worried the glasses may break in the mail, try one of these stores near your town: [5] X Research source Costco Goodwill LensCrafters Pearle Vision Walmart Vision Center Warby Parker Most eyeglasses retailers accept used glasses for recycling or donation as well."
    },
    {
      "title": "No; most glasses must be taken apart and brought to a recycling center.",
      "content": "No; most glasses must be taken apart and brought to a recycling center. Since eyeglasses are made of a mix of materials (glass, plastic, and metal), they can’t be tossed into the recycling bin in one piece. [6] X Research source If you’re certain your lenses are pure glass and your frames are a recyclable type of metal (like aluminum) or plastic, you can disassemble your glasses and put the pieces into the bin. However, many lenses are partially plastic and can’t be recycled. The only time you can put eyeglasses in the recycling is if your local recycling plant specifies that they can take them. Contact your municipality or local center to ask about the glasses policy."
    },
    {
      "title": "Sell gently used glasses to a friend, a collector, or online.",
      "content": "Sell gently used glasses to a friend, a collector, or online. If you want to be certain you’re creating zero waste, consider asking your friends, family, or other acquaintances if they need a pair of glasses—if your prescription is the same, you could sell (or gift) your old pair. [7] X Research source You might also be able to sell to an eyeglasses collector. Search Google or apps like Facebook for eyeglass selling, trading, or collecting groups you could post in. You could also post your glasses on a marketplace app or site. Some great options for glasses are Facebook Marketplace , eBay , Gumtree , and Freecycle ."
    },
    {
      "title": "Keep them as your backup pair.",
      "content": "Keep them as your backup pair. You never know when you’ll accidentally break or lose your glasses. Consider keeping your old pair to keep your vision clear while you order a replacement. The prescription might be slightly outdated, but shouldn’t cause major problems while you temporarily use them (and it’s certainly better than nothing!). How long can you wear a pair of glasses? Generally, your glasses should be replaced every few years as your prescription changes. Wearing old glasses for too long can start to cause eye strain, headaches, and frequent squinting. If you notice these signs, it’s time for an eye exam and a new pair! [8] X Research source"
    },
    {
      "title": "Keep them to use for tasks that may damage your glasses.",
      "content": "Keep them to use for tasks that may damage your glasses. Maybe you have an active hobby like gardening or jogging and are worried about damaging or losing your primary pair of glasses. You could keep your old pair as your “activity glasses” if the prescription is very close to your current one. That way, you don’t have to act as protective of your eyewear and can just enjoy yourself."
    },
    {
      "title": "Use them to make other accessories or crafts.",
      "content": "Use them to make other accessories or crafts. There’s lots of crafty things you can do with an old pair of glasses! Here are a few fun and fashionable ideas for inspiration: Pop out the lenses, then paint or decorate them to use as a brooch, pendant, or Christmas ornament. [9] X Research source Remove the arms and decorate the frames as a snowman. Glue an original piece of art or a small photo into your frames for a makeshift photo frame. Combine multiple pairs of frames and lenses together to make a unique sculpture or hanging installation. Remove the lenses and paint your frames to wear as an accessory. Replace the lenses with magnifying lenses to help you see fine detail during crafting or repair projects."
    },
    {
      "title": "Add non-prescription lenses to use the glasses as a costume piece.",
      "content": "Add non-prescription lenses to use the glasses as a costume piece. Need to cosplay as your favorite fictional four-eyes? Simply pop the old prescription lenses out of the frame and swap them for clear plastic or glass lenses . To insert the lenses, slide the outer side of the lens into the bevel inside the frame. Then, push down on the inner side to pop the rest of the lens into place. [10] X Research source Now you’ve got a new costume piece! You could also swap in colored lenses or even sunglass lenses , depending on your costume needs. Or, for a super easy prop pair of glasses, just pop the original lenses out and wear them without any lenses in the frames. How do you know which size of lens to get? Check inside the arms of your glasses for a series of 3 numbers (usually separated by spaces or dashes). The numbers correspond to the lens width, bridge width, and temple length of the lenses in millimeters (for example, you may see something like 22-49-150 or 54-18-125). [11] X Research source"
    },
    {
      "title": "Sometimes—it depends on if the new lenses will fit.",
      "content": "Sometimes—it depends on if the new lenses will fit. If your new prescription is very similar to your old one, there’s a chance that your lenses will be the same size and you can reuse your frames. However, this isn’t often the case. Chances are the shape or thickness of the lens will be different, meaning they won’t fit in your frames. [12] X Research source Your frames may not be reusable if they’re discolored, scratched, cracked, rusted, bent, or have rim damage. Insurance companies may only help pay for new pairs of glasses, meaning it could actually end up being more expensive to just replace the lenses than to get a new pair."
    }
  ]
}