{
  "url": "https://www.wikihow.com/What-Is-an-Eastern-Star",
  "title": "Everything You Need to Know About the Order of the Eastern Star",
  "steps": [
    {
      "title": "An Eastern Star is a member of the Order of the Eastern Star.",
      "content": "An Eastern Star is a member of the Order of the Eastern Star. The Order of the Eastern Star (OES) is an appendant body, or offshoot, of the Freemasons, the oldest fraternal organization in the world. [1] X Research source Someone who says they’re “Eastern Star” is a proud member of this charitable fraternity. The OES is an organization that supports charitable outreach and philanthropic projects as well as lasting friendships and loving kindness toward all people. [2] X Research source The OES is not a secret society, a religion, or a cult. However, members do have specific ways to identify each other and their meetings are closed to the public. The Order of the Eastern Star began as a group for women, but now allows both men and women to join. The OES and Freemasons used to prevent African American members from joining. In response, they established the Prince Hall Masonic Order and the Prince Hall Order of the Eastern Star. [3] X Research source"
    },
    {
      "title": "Dr. Rob Morris founded the OES to let women into Freemasonry.",
      "content": "Dr. Rob Morris founded the OES to let women into Freemasonry. The ancient Order of Masonry does not allow women to be eligible for its degrees. So, schoolteacher and Master Mason Dr. Rob Morris founded the Order of the Eastern Star so women could be part of a fraternity and contribute to their noble deeds. [4] X Research source With the help of his wife, Charlotte, Dr. Morris also developed the OES degrees, which involve 5 heroic and highly moral women from the Bible. [5] X Research source Morris was also the Poet Laureate of Masonry and wrote over 400 poems and several books about Freemasonry. [6] X Research source"
    },
    {
      "title": "The name and general motto of the OES come from the Bible.",
      "content": "The name and general motto of the OES come from the Bible. The name and motto of the OES are believed to come from Matthew 2:2 in the Bible (KJV). [7] X Trustworthy Source Library of Congress Official library of the U.S. and main research institution for Congress and the American public Go to source The verse says: “Where is He that is born King of the Jews? for we have seen His star in the east, and are come to worship Him.” [8] X Research source In some orders, this is the page that’s customarily opened on the altar during meetings. [9] X Research source However, each chapter may have its own motto. [10] X Research source The motto of the OES in Georgia, for example, is “Outreaching with Enthusiastic Service.” [11] X Research source"
    },
    {
      "title": "OES works as a charitable organization that supports local communities.",
      "content": "OES works as a charitable organization that supports local communities. The purpose and mission of the OES is to “make a positive difference in the world with charitable works, lasting friendships, and loving kindness to all mankind.” [12] X Research source Each Chapter selects a charity and contributes time and money to projects that are needed by their towns and communities. If a project that a Chapter chooses makes money, then 100% of that money has to go back into their local community. For example, a Chapter might support scholarships for local college students, a home for aging OES members, literacy programs, or raise money to help people in disasters. [13] X Research source"
    },
    {
      "title": "The 5 points of the star refer to 5 moral women from the Bible.",
      "content": "The 5 points of the star refer to 5 moral women from the Bible. The emblem of the Order of the Eastern Star is an upside-down star (the “Star of Bethlehem”) with a symbol inside each point. Each symbol represents a Biblical heroine who exemplifies one of the principles of the OES. Sword and veil (blue): Adah, who embodies fidelity. Sheaf of barley (yellow): Ruth, who represents constancy. Crown and scepter (white): Esther, who exemplifies light, purity, and joy. Broken column (green): Martha, who embodies hope and immortality. Golden cup (red): Electa, who represents love or fervency. Some symbols include the letters “F.A.T.A.L.”—only initiated members know what each letter stands for. [14] X Research source"
    },
    {
      "title": "Master Masons and women who are related to Masons can join.",
      "content": "Master Masons and women who are related to Masons can join. All members must be 18 or older. To be eligible to join the OES, you must be a man who is a Master Mason in good standing with a Lodge of the Masonic Fraternity or a woman who is a relative of a past or present Master Mason in good standing. [15] X Research source You must also be of good moral character and affirm your belief in a Supreme Being. [16] X Research source You cannot join if you are addicted to alcohol or drugs or are convicted of a felony. [17] X Research source Women who are majority members of the International Order of the Rainbow for Girls or Job’s Daughters International are also eligible. [18] X Research source"
    },
    {
      "title": "Contact a chapter in your area and ask for a petition form.",
      "content": "Contact a chapter in your area and ask for a petition form. Email the chapter, ask a known member of the chapter, or visit the chapter during an event that’s open to non-members. If you live in the United States, submit a membership inquiry on the OES website by clicking on your state and filling out the online petition form. [19] X Research source You can also call or email the chapter to ask about membership. 2 of the members can help you complete and submit your petition for membership. [20] X Research source"
    },
    {
      "title": "Submit the completed petition form to the chapter.",
      "content": "Submit the completed petition form to the chapter. The petition form asks how long you lived in the area, which Freemason you’re related to or which Masonic Lodge you’re a member of, and whether you believe in a Supreme Being. You’ll also need to provide your name, address, and birthday. [21] X Research source If you’re already a member of the OES, submit a petition to be affiliated with another chapter or to become a dual or plural member."
    },
    {
      "title": "The Chapter will investigate your membership and meet with you.",
      "content": "The Chapter will investigate your membership and meet with you. After they receive your application, the Chapter will check to make sure you’re a Mason in good standing or are related to a Freemason, and that you’re a person of good moral character. The OES will then reach out to set up a meeting or phone call with you. [22] X Research source During the meeting, OES leaders try to learn if you have a happy home life, how you spend your spare time, what your profession is, and why you’re interested in joining the OES. [23] X Research source"
    },
    {
      "title": "The Chapter votes on your petition and schedules your initiation.",
      "content": "The Chapter votes on your petition and schedules your initiation. The local Chapter takes all the information gathered during the investigation and asks each member to vote on your petition. If it’s approved, they’ll work with you to schedule your initiation. [24] X Research source The Order strives to find people of good moral, mental, and spiritual quality who will work with the organization to complete its goals. [25] X Research source"
    },
    {
      "title": "Notable OES members include Laura Ingalls Wilder and Rosa Parks.",
      "content": "Notable OES members include Laura Ingalls Wilder and Rosa Parks. The Order of the Eastern Star includes tons of well-known members, including First Lady of the U.S. Eleanor Roosevelt and former U.S. President Harry S. Truman. [26] X Research source Other famous members include: [27] X Research source Clara Barton: American teacher, nurse, and humanitarian who organized the American Red Cross. Rosa Parks: American civil rights activist who refused to give up her seat on a bus to make room for a white passenger, sparking the Montgomery Bus Boycott. Laura Ingalls Wilder: American author of the Little House on the Prairie series. Her mother Caroline and sister Carrie were also members. Maya Angelou: American poet, activist, and scholar who wrote I Know Why the Caged Bird Sings and was awarded the Presidential Medal of Freedom. [28] X Research source Zora Neal Hurston: American author and anthropologist who studied Black folklore and wrote about African American life in the South. [29] X Research source Ruth Ann Minner: Delaware’s first female governor and the longest serving female governor in U.S. history. Dale Evans: American writer, singer, and movie star. She was the second wife of actor, rodeo performer, and Freemason Roy Rogers. Martha Griffiths: American lawyer and judge elected to the House of Representatives in 1954. She was responsible for including sex discrimination in the Civil Rights Act. Maxine Waters: Member of the U.S. House of Representatives serving California’s 43rd congressional district since 1991. Colleen Dewhurst: Canadian actress and wife of actor, director, and Freemason George C. Scott. Barbara Mandrell: Famous American country singer and musician. [30] X Research source Nikki Giovanni: American poet, civil rights activist, and respected English professor. [31] X Research source"
    }
  ]
}