{
  "url": "https://www.wikihow.com/Winterize-Your-Evaporative-Cooler",
  "title": "How to Winterize Your Evaporative Cooler",
  "steps": [
    {
      "title": "Understand that there are a few things that you should do to winterize your evaporative cooler, or swamp cooler as some call them.",
      "content": "Understand that there are a few things that you should do to winterize your evaporative cooler, or swamp cooler as some call them. Winterizing the Cooler can not only save you more maintenance during the next summer, but can actually help to make the unit last several years longer. Here are the few easy steps that you should do in the fall that will be well worth your time."
    },
    {
      "title": "Cut off the power supply before working on the cooler.",
      "content": "Cut off the power supply before working on the cooler. You do not need the power on to winterize the unit and it is always safe practice to disconnect the power source before working on any appliance."
    },
    {
      "title": "Turn off the valve supplying water to your swamp cooler.",
      "content": "Turn off the valve supplying water to your swamp cooler. The water line must also be drained to prevent freezing during the winter. This can be done by disconnecting the water line at the supply valve and the Cooler. If the water line does not slope all one way the water will not drain by itself. If that is the case, go to the highest end and blow through the line to force the water out of the line."
    },
    {
      "title": "Drain the cooler.",
      "content": "Drain the cooler. The pan should be drained every fall and the drain left open to allow any rainwater to escape throughout the winter. Even after draining you will find dirt and mineral sediment in the bottom of the pan. This should always be cleaned out. In your Cooler the water has been evaporating all summer while the minerals continue to build up in the Cooler pan. You may like to use your shop vacuum to remove all of the dirt and minerals. Then with the drain remaining open, hose out the pan with fresh water to make sure the minerals are completely out of the pan. This will help to prevent rusting of the metal pan through the winter."
    },
    {
      "title": "Change the cooler pads in the fall when winterizing the unit.",
      "content": "Change the cooler pads in the fall when winterizing the unit. Most people think of doing this in the spring when starting the cooler up. Keep in mind, the old pads have had minerals building up in them all through the summer. The way the louver panels are originally built, they cause any rainwater to flow into the Cooler and run down the pads. The pads are pressed against the metal louvers and can speed up the rusting all throughout the winter. With fresh new pads installed in the fall, you will keep the louvers from rusting all throughout the winter."
    },
    {
      "title": "Install a cooler cover.",
      "content": "Install a cooler cover. It stops the outside air from entering the home or building being supplied by the evaporative cooler. Most home Coolers have a damper that can be closed that will prevent most of the air from entering the ducts and getting into the building. A cover is especially needed if you do not have this damper or if the damper is not tight enough to stop any air from seeping in."
    }
  ]
}