{
  "url": "https://www.wikihow.com/Take-a-Mankind-Unwanted-Kit",
  "title": "How to Take a Mankind Unwanted Kit",
  "steps": [
    {
      "title": "Take the pills within the first 11 weeks of your pregnancy.",
      "content": "Take the pills within the first 11 weeks of your pregnancy. Mifepristone and misoprostol are only meant to be taken if you’re 11 weeks (77 days) pregnant or fewer. If you’ve been pregnant for more than 11 weeks, call your OB/GYN to find out what your best and safest options are. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Count the weeks starting from the first day of your last menstrual cycle. Avoid drinking alcohol before you take your pills since it will make you dehydrated later on."
    },
    {
      "title": "Swallow the mifepristone pill with a glass of water.",
      "content": "Swallow the mifepristone pill with a glass of water. Plan to take this pill a full 24-48 hours before you take the misoprostol pills. You likely won’t feel any symptoms after taking mifepristone and can go about your normal day freely. [2] X Research source If you throw up in the first 30 minutes after taking the pill, it likely won’t work and you might have to take it again. Call your doctor to see if you need to take another dose."
    },
    {
      "title": "Place 4 misoprostol pills under your tongue after 24-48 hours.",
      "content": "Place 4 misoprostol pills under your tongue after 24-48 hours. Wait a full day or two after taking the mifepristone pill—it doesn’t matter when during this time you take it, it'll still be just as effective. Place each pill under your tongue carefully so you’re sure not to swallow them. These pills are meant to dissolve in your mouth instead of being swallowed. [3] X Research source Plan out the timing so that you’ll be at home resting comfortably once you take the misoprostol pills. Don't worry if your mouth feels dry or tastes chalky once the pills are under your tongue; this is completely normal. If your kit uses the buccal form for the misoprostol, then hold them against your cheek or on the side of your mouth rather than under your tongue."
    },
    {
      "title": "Wait 30 minutes for the pills to dissolve.",
      "content": "Wait 30 minutes for the pills to dissolve. Set a timer to help you remember how long it’s been and remember not to swallow them. The majority of each pill will dissolve in your mouth in 30 minutes so that your system can absorb them. [4] X Research source Avoid eating or drinking anything during the 30 minutes that you wait for the pills to dissolve. The buccal form of the pill only takes around 3 minutes."
    },
    {
      "title": "Drink water after 30 minutes to swallow what’s left of the pills.",
      "content": "Drink water after 30 minutes to swallow what’s left of the pills. If the pills aren’t completely dissolved after 30 minutes, that’s okay. Take a sip or two of water to cleanse your mouth and swallow it so that any leftover pill particles will be in your system. [5] X Research source If you throw up before the 30 minutes are up, they may not work. But if you throw up after the pills have dissolved and are in your system, you’re likely okay."
    },
    {
      "title": "Wait 3 hours and take 4 more pills if you’re 9-11 weeks pregnant or aren’t bleeding.",
      "content": "Wait 3 hours and take 4 more pills if you’re 9-11 weeks pregnant or aren’t bleeding. Not everyone needs to take 4 more pills. If it's been several hours and you're still not experiencing any bleeding, or you're at least 9 weeks along, this means you need another dose. [6] X Research source To take another dose, repeat the same process and set the 4 misoprostol pills under your tongue to let them dissolve for 30 minutes. If you don't end up taking 4 extra pills but your doctor gave them to you, ask your OB/GYN what you should do with them."
    },
    {
      "title": "Take a dosage of ibuprofen to help with cramps.",
      "content": "Take a dosage of ibuprofen to help with cramps. Follow the directions on the ibuprofen bottle to make sure you're taking the correct amount. While it’s not required, taking ibuprofen before or after taking the misoprostol pills will help alleviate some of the pain and cramping you’ll feel later on. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid taking aspirin because this can make your bleeding worse."
    },
    {
      "title": "Change your pads regularly to manage the heavy blood flow.",
      "content": "Change your pads regularly to manage the heavy blood flow. You’ll likely notice that you’re bleeding more than you would during your regular cycle—this is completely normal and no cause for fear. It's a good idea to check your pad every 30 minutes to an hour to make sure it doesn’t need to be changed. The bleeding often lasts several hours, but if you’re worried that it’s lasting too long, call your OB/GYN so they can reassure you. Bleeding will likely start 1-3 hours after you take the misoprostol pills. You’ll bleed the heaviest when your pregnancy comes out. If you see the embryo or large blood clots, don’t panic! This is normal too. Avoid using tampons because it’s harder to see how much you’re bleeding and might cause you more discomfort."
    },
    {
      "title": "Use heat pads or a hot water bottle to help with cramps.",
      "content": "Use heat pads or a hot water bottle to help with cramps. It’s normal to feel cramping after taking the pills, and this could last a day or two. To help ease these symptoms, place a heating pad or a bottle filled with hot water on your stomach so the heat can help alleviate the pain. Taking a warm or hot shower can also help with any discomfort."
    },
    {
      "title": "Rest at home and stay hydrated to deal with nausea.",
      "content": "Rest at home and stay hydrated to deal with nausea. The misoprostol pills may make you feel super nauseous or sick to your stomach after you’ve taken them. You may even experience some diarrhea, which is also common and no reason to panic. Just keep resting and drinking fluids, and know that these symptoms should only last a day or two. Aim to have around 8 glasses of water so you stay hydrated. If your doctor gave you anti-nausea medicine, you can take this to help you feel better too. Avoid drinking alcohol after using the kit since it can dehydrate you more."
    },
    {
      "title": "Avoid heavy exercise or lifting for 3-4 days after taking the pills.",
      "content": "Avoid heavy exercise or lifting for 3-4 days after taking the pills. It’s normal to feel tired and sluggish when you’re recovering. Stay away from more intense exercising like biking, jogging, or swimming until you’re feeling stronger and more like yourself. Rest is the most important thing and will have you feeling better in a couple of days. [8] X Research source Avoid lifting heavy things so you don’t cause yourself more pain or discomfort."
    },
    {
      "title": "Call your OB/GYN if your symptoms are lasting a long time or you have concerns.",
      "content": "Call your OB/GYN if your symptoms are lasting a long time or you have concerns. If it has been at least 2 hours and you’re still going through 2 or more pads an hour, call your doctor and tell them what’s happening so they can help you. If you’re not feeling better after 2-3 days and are worried about your symptoms, call an OB/GYN to let them know and see what they recommend. [9] X Research source If you have a fever that isn’t going away after 1 day, or you're throwing up a lot and having trouble eating or drinking, call your OB/GYN so they can help. Don't feel embarrassed to call your OB/GYN—they're there to help you and can give you the best advice for how to feel better."
    }
  ]
}