{
  "url": "https://www.wikihow.com/Train-a-Horse-to-Drive",
  "title": "How to Train a Horse to Drive",
  "steps": [
    {
      "title": "Train your horse to lunge in a round pen.",
      "content": "Train your horse to lunge in a round pen. Fit your horse with a lunge cavesson and a 25–30 ft (7.6–9.1 m) lunge line. Stand in the middle of the pen, position your body in the direction that you want your horse to move, and lift the lunge whip towards your horse’s hip. As your horse moves forward, say “Walk,” loudly and clearly. Face your horse as it moves around the circle, keeping your body just behind the withers and the lunge whip at the hip. [1] X Research source Position yourself so that you form a triangle between the horse’s haunches, its shoulder, and yourself. You will use your body position to help drive the horse forward. You moving with your horse tells it to keep moving forward. To slow down or stop, relax your body, move with your horse more slowly, and lower the whip. Say “Stop!” or “Whoa!” clearly. To start trotting, raise your shoulders slightly, move more energetically, and slightly elevate the lunge whip at your horse’s hip. Give a clear, verbal “Trot!” command. A lunging whip is only a training tool and should never be used as punishment."
    },
    {
      "title": "Practice lunging until your horse responds to every verbal cue.",
      "content": "Practice lunging until your horse responds to every verbal cue. Spend the coming weeks and months working with your horse to get correct and consistent responses. Ensure that your horse can walk on, trot, slow down, and come to a full halt using verbal cues. [2] X Research source Although each command is important, getting your horse to come to a full stop regardless of the situation is the highest priority. [3] X Research source"
    },
    {
      "title": "Train with a long line to get your horse used to 2 lines.",
      "content": "Train with a long line to get your horse used to 2 lines. To move clockwise, feed the left line through the left stirrup so that it wraps gently around your horse’s rear, and hold this in your left hand. Hold the right line in your right hand. Start lunging your horse normally with the lunge whip and practice each gait. [4] X Research source To prepare your horse for long lining, tack up the saddle and bridle. Connect the stirrups together under your horse’s belly using a leather strap to stop them moving around. Attach 1 long line to each bit ring. To move counterclockwise, feed the right line through the right stirrup and hold this in your right hand. Then hold the left line in your left hand and lunge from the other direction. Keep the lines tight enough so your horse can't trip, but loose enough that it can feel the slack lines around its rear, tail, back, and legs. [5] X Research source"
    },
    {
      "title": "Practice long lining until every verbal command gets a correct response.",
      "content": "Practice long lining until every verbal command gets a correct response. Spend as much time as your horse needs to train with the long lines. Check that your horse is fully comfortable with the feeling of the lines and that every walk on, trot, slow down, and full halt command gets the right response. [6] X Research source"
    },
    {
      "title": "Work your horse from behind on long lines to start ground driving.",
      "content": "Work your horse from behind on long lines to start ground driving. Tack up your horse with its saddle, bridle, and long lines. Stand almost behind your horse but slightly towards the center of the pen. Keep consistent, gentle pressure on both lines and use verbal cues to ask your horse to walk on and halt. Move around the pen with your horse. [7] X Research source Try to stay out of kicking range while ground driving. Put on a pair of driving gloves to protect your hands from rope burns in case the horse panics and starts running."
    },
    {
      "title": "Release the tension slightly in the outside line to practice turning.",
      "content": "Release the tension slightly in the outside line to practice turning. To turn right, loosen the left line and keep the pressure in the right line the same. Turning left is very similar. Simply loosen the right line and maintain the same tension on the left, inside line. [8] X Research source You don’t need to use verbal cues for turning, as the line pressure will do the communicating."
    },
    {
      "title": "Use the whip if your horse doesn’t respond to the first command.",
      "content": "Use the whip if your horse doesn’t respond to the first command. Responding to every cue is essential for driving. Lightly touch your horse’s hip with the lunging whip if it doesn’t move on from your command. If you consistently have troubles with getting a response when ground driving, go back to long lining again to build more confidence and trust with your horse. [9] X Research source The more practice you and your horse get ground driving, the more prepared you will be for actual driving. Spend as much time training as you need and try not to rush anything."
    },
    {
      "title": "Get a driving harness professionally fitted to your horse.",
      "content": "Get a driving harness professionally fitted to your horse. Choose a leather or synthetic driving harness. Arrange for a professional to measure your horse to find the right size. Let your horse inspect and sniff the driving harness before you put it on to build confidence. [10] X Research source A driving instructor or your local driving club will be able to help you with harness fitting. Move the harness around near your horse to get it used to the sounds and smell of the harness."
    },
    {
      "title": "Start by walking your horse on a lead line while it wears the harness.",
      "content": "Start by walking your horse on a lead line while it wears the harness. Before you try lunges, you’ll need to get your horse used to wearing the harness. Put the harness on your horse and take it for a brief walk, no more than 10-15 minutes. Use a short lead so that you can take control if your horse begins to panic while wearing the new harness."
    },
    {
      "title": "Practice lunging in the harness.",
      "content": "Practice lunging in the harness. Place the driving harness on your horse and begin lunging as you normally would. Work slowly so that your horse has time to adjust to the new feeling of the harness on its back. Practice each verbal cue until you get a consistent response and use plenty of affection and praise. [11] X Research source If your horse has trouble lunging in the harness, remove it and practice normal lunging to build trust. Then give your horse plenty of time to inspect the harness before trying again."
    },
    {
      "title": "Work your horse with long lines and the harness.",
      "content": "Work your horse with long lines and the harness. Tack up your horse with the driving harness and follow your normal long lining routine. Practice each verbal cue, moving slowly and steadily. This stage may take a little longer than expected, as your horse will need to get comfortable with the weight of the harness in addition to the slack lines. [12] X Research source"
    },
    {
      "title": "Start ground driving with the harness.",
      "content": "Start ground driving with the harness. Long line your horse from behind with the harness on and practice every verbal command. Train in both directions. Take your time and don’t rush the training, so that you and your horse can build confidence and trust. This is as close as you can get to real driving without using a cart! [13] X Research source If your horse loses confidence or has trouble at any time, simply return to a previous stage like lunging or long lining to get more practice."
    },
    {
      "title": "Train your horse to drag objects while ground driving in the harness.",
      "content": "Train your horse to drag objects while ground driving in the harness. Learning to pull weight is an essential part of driving. Attach heavy cotton ropes to the harness and let these drag behind your horse as you ground drive. When your horse is comfortable, practice with heavier weights by tying the ropes around PVC pipes and then a tire. Practice every gait, verbal command, and direction while ground driving with the added weight. [14] X Research source The PVC pipes and tire will bounce around. This is ideal because it helps to desensitize your horse to the noise, weight, and movement of a cart."
    },
    {
      "title": "Get professional advice before you start driving your horse.",
      "content": "Get professional advice before you start driving your horse. Contact a driving instructor or your local driving club. They will visit you and your horse and watch you work with the harness. Take any advice that they give on-board and don’t begin driving with a cart until you have been given the all-clear. [15] X Research source Don’t feel discouraged if the driving professional suggests that you repeat some training. Safety is essential while driving, and the instructor just wants to make sure that you and your horse are fully prepared."
    },
    {
      "title": "Attach the driving cart to your horse once you are both confident.",
      "content": "Attach the driving cart to your horse once you are both confident. Place the cart in the middle of the pen and let your horse inspect it for as long as necessary. Show your horse any noises that the cart makes before you attach it. When your horse is fully comfortable, place the harness on and attach the cart shafts to the harness. Walk alongside your horse and get 2 other people to help pull the cart as your horse moves so that it can get used to the new feeling. [16] X Research source If your horse loses confidence at any point, remove the cart immediately. Return to an earlier stage of training to build trust again before slowly reintroducing the cart. Never remove the bridle of a horse that is attached to a cart. This is because there would be no way to control the horse if an accident happened. Never leave a horse unattended while it’s attached to a cart. Accidents can happen very quickly and with little to no warning."
    },
    {
      "title": "Enter the cart and slowly begin driving.",
      "content": "Enter the cart and slowly begin driving. Begin in a safe, quiet, and secure location. Communicate with the driving lines and verbal cues like you would while ground driving. Start with simply walking on and halting, before moving on to turning and trotting. Practice slowly and steadily so that you and your horse gain confidence and trust. [17] X Research source Join your local driving club to gain more experience, learn new skills, and attend driving outings when your horse is ready. Whenever you are in the cart, always wear a riding helmet. This goes for passengers too. When you first begin driving in more risky situations like on roads, at shows, or with other horses, always have someone experienced with you. They can provide advice and assistance if anything unexpected happens."
    }
  ]
}