{
  "url": "https://www.wikihow.com/Write-Your-Own-Eulogy",
  "title": "How to Write Your Own Eulogy",
  "steps": [
    {
      "title": "Know your purpose for writing your own eulogy.",
      "content": "Know your purpose for writing your own eulogy. People choose to write their own eulogy for a variety of reasons, such as ensuring accuracy, relieving the burden on their family, or creating a lasting impression of who they are. Knowing your reasons will help you figure out what you want people to remember about you. [1] X Research source"
    },
    {
      "title": "Write down your priorities in life.",
      "content": "Write down your priorities in life. Think about what is most important to you. Many people will include things like family, their hobbies, and their religion if they have one. Your list will be unique to you and should reflect what’s most important to you. Ask yourself, “What do I want people to say about me after I pass?” You may want them to talk about how well you played the piano, or how many dogs you took in from the local shelter. You may realize that your priorities included sharing music with others and helping animals. If you’re having trouble figuring out your priorities, consider how much time you spent doing particular activities. Don’t criticize yourself for not spending as much time on a priority as you would have liked."
    },
    {
      "title": "List the various roles you played over your lifetime.",
      "content": "List the various roles you played over your lifetime. You may have been a parent, spouse, friend, boss, entrepreneur, photographer, teacher, counselor, caregiver, scout leader, musician, or groupie. From your list, choose the roles that you want to be your legacy. [2] X Research source Consider how each of your roles fits in with your priorities to help you decide what you want to focus on in your eulogy. Don’t worry about focusing on too many or too few roles. For example, some people may have focused their lives on encompassing one role, such as parent or entrepreneur. Others, on the other hand, may have moved through various roles at different stages of their lives."
    },
    {
      "title": "Define your legacy.",
      "content": "Define your legacy. Think about what you’ll leave behind, whether it’s a large extended family, a thriving business, or the best recipe for cherry pie your town has ever eaten. Write down a few sentences about your contribution to the world, and how you hope it’ll continue. [3] X Research source"
    },
    {
      "title": "Make a list of your defining qualities.",
      "content": "Make a list of your defining qualities. Based on how you want to be remembered, choose a few words that you could use to describe yourself. For example, you may choose to define yourself as compassionate, generous, and a talented pianist. [4] X Research source Answer the question “Who is [your name]?” Start by writing down the first five things you think of when you think about yourself. Group your characteristics into categories to help you condense them into meaningful references in your eulogy."
    },
    {
      "title": "List your accomplishments.",
      "content": "List your accomplishments. Think about your major accomplishments in life and how they fit into the overall picture of yourself that you’re creating in your eulogy. If you want people to remember something that you’ve done, note it so that you can include it; however, it’s unlikely that you’ll have room to include every accomplishment that you’ve made in life. [5] X Research source Prioritize the accomplishments that are the most meaningful to you, such as graduating college, having your children, or writing a book. If you’re having trouble deciding what to include, go back to your list of life priorities and roles. Choose the accomplishments that reflect what you value most."
    },
    {
      "title": "Ask family members and friends to share a favorite memory of you.",
      "content": "Ask family members and friends to share a favorite memory of you. Even though you’re writing your eulogy yourself, that doesn’t mean that you can’t include the ideas of others. Those closest to you often have a different perspective on you and on your memories together. How you impacted their lives will be an important piece of your legacy, so reach out to them for their stories. [6] X Research source If you find out that several people share the same favorite memory, then consider including that in your eulogy. This is a great opportunity to share warm moments with friends and family, remembering good times together."
    },
    {
      "title": "Write down a few of your favorite stories about yourself.",
      "content": "Write down a few of your favorite stories about yourself. After you’ve talked to your family and friends, think about what you remember. You want to include several stories in your eulogy that show who you were as a person, so focus on finding stories that illustrate your defining characteristics and reflect your priorities. [7] X Research source Is there a story that all of your friends have heard you tell so many times that they can finish your sentences? Think of the stories about yourself that you tell most often and how you can weave them into your eulogy. Plan to add some lesser told stories as well."
    },
    {
      "title": "Incorporate humor.",
      "content": "Incorporate humor. Don’t be afraid to make people laugh. While your passing is sad, your life held happy moments that your friends and family can hold on to. Eulogies should remind people of those good times and how much you meant to them, so include stories that will make them smile. [8] X Research source"
    },
    {
      "title": "Plan for the reading of your eulogy to take 5-10 minutes.",
      "content": "Plan for the reading of your eulogy to take 5-10 minutes. While an obituary is short, a eulogy provides enough time for a well-developed narrative about your life. As you write, remember that you can always trim it down during editing if it gets too long. [9] X Research source"
    },
    {
      "title": "Choose a tone.",
      "content": "Choose a tone. While it’s normal for a eulogy to have a somber tone, how you want to be remembered will shape the tone you choose for your own eulogy. If you’re fun-loving and lived a full life, then it makes sense to choose a light-hearted tone. If you have always been a serious person, then you may feel that keeping your eulogy serious is the best way to reflect who you are. Consider incorporating more than one tone at different points in the eulogy to capture the feeling of what you’re sharing in a particular story or accomplishment. Think about who will be delivering your eulogy when choosing your tone. Some people may feel uncomfortable with or unable to convey a particular tone."
    },
    {
      "title": "Create an outline.",
      "content": "Create an outline. Your eulogy should include an introduction, body, and conclusion. Using the lists and notes you created, fill in your outline with what you’ll include in each part of the speech. The bulk of your information should fit in the body of your eulogy. [10] X Research source"
    },
    {
      "title": "Write your introduction.",
      "content": "Write your introduction. Provide a brief biography of yourself and establish how you want to be remembered, using your defining characteristics, priorities, and roles. Set the tone of your eulogy, but know that you can shift the tone later if that’s your desire. [11] X Research source When you provide your biography, remember your audience, which will likely include those closest to you. They likely know a lot about you already, so focus on filling in the gaps about what they don’t know, such as where you spent your childhood or the nickname that your parents called you when you were growing up."
    },
    {
      "title": "Write the body.",
      "content": "Write the body. The body of your eulogy will contain most of your stories and accomplishments. [12] X Research source Plan to incorporate at least 3-4 stories that illustrate who you are."
    },
    {
      "title": "Write your conclusion.",
      "content": "Write your conclusion. Remind the audience of how you want them to remember you, and cap off your eulogy with something that you’d like to stick with them, such as a favorite quote, a lesson you exemplified, or a call to action based on your life. [13] X Research source"
    },
    {
      "title": "Edit your eulogy.",
      "content": "Edit your eulogy. After you finish writing your eulogy, set it aside for a day or two. Then reread it, making any changes that you think it needs. Time it to see how long it takes to read aloud, and make sure that it fits into the 5-10 minute window. When you’re satisfied with your eulogy, pass it on to those who you’ll entrust with it. Consider getting someone to read over your eulogy and help you with editing. If you know who you want to read the eulogy, it's a good idea to have them look it over. That way, they can provide some advice on what to change or ask questions if they aren't sure what something means."
    }
  ]
}