{
  "url": "https://www.wikihow.com/Wax-With-Honey",
  "title": "How to Wax With Honey",
  "steps": [
    {
      "title": "Mix your ingredients.",
      "content": "Mix your ingredients. In a pot or microwave-safe dish, pour ¼ cup (59 ml) honey. Add 1 cup (200 g) of white sugar, then 1 tablespoon of lemon juice. Stir to combine evenly. The texture will appear grainy when first mixed."
    },
    {
      "title": "Heat your mixture.",
      "content": "Heat your mixture. If you’re using the stovetop, turn the burner to low or medium heat and stir periodically as the mixture heats up. If you’re using a microwave, nuke it for 10 to 30 seconds. Then remove the dish, stir the mixture, and repeat as needed, for a combined cooking time of roughly a minute, depending on your microwave’s strength. In either case, remove the mixture from before it comes to a boil or starts to cook. If using a high setting on a microwave, stick to 10-second bursts in between stirring so you don’t overheat it. Use a food thermometer to check its temperature. The mixture shouldn’t rise over 110 degrees Fahrenheit (43 degrees Celsius)."
    },
    {
      "title": "Let it cool down before using.",
      "content": "Let it cool down before using. Even though you didn’t bring your mixture to a boil, keep in mind that it’s still pretty hot. Give it a chance to cool down to the point that it’s still warm, but safe to touch. Give it 15 or 20 minutes at least before testing with your finger. Once that feels fine, apply a very small dab to the area that you’re going to wax to test it, just in case it’s more sensitive. If you’d like, stir in a few drops of your favorite scented oil as it cools for a more fragrant wax."
    },
    {
      "title": "Check the texture while you wait.",
      "content": "Check the texture while you wait. Give your mixture a stir with your spoon. The grainy texture should have thickened and grown smooth during heating. If it seems liquidy, stir in another tablespoon of sugar and return it to heat. Remember: since it’s already hot, it shouldn’t take very long for the extra sugar to melt and combine with the honey, so don’t overdo it."
    },
    {
      "title": "Spread the wax.",
      "content": "Spread the wax. Use a butter knife or similar tool, like popsicle sticks or a spatula. Add just enough wax to lightly cover the target area. As you do, spread the wax down in the direction that your hair grows. For example, with your calf, spread it from your knee down to your ankle, not the other way. With each application, apply it in a fast, clean motion in order to spread it as thinly as possible. Dragging it too slowly over your skin may result in thicker deposits, which will be tougher to remove. This may take some practice, so consider making an extra batch just in case you mess up."
    },
    {
      "title": "Apply your fabric.",
      "content": "Apply your fabric. Use cotton muslin strips of an appropriate size for the area you’re waxing, or slightly larger. Set it over the wax, with at least a couple inches (about 5 cm) remaining clear of the wax at one end, so you have a tab that’s easy to pull. Then gently rub the portion that’s stuck to the wax in the same direction that your hair grows, without pressing directly down into your flesh. Do this two or three times. Alternately, you can cut up an old t-shirt or other cloth and use strips of that. If you do, just make sure the material isn’t too stretchy. You want something nice and firm for easy removal. The free end should be in the direction of your hair growth. For example, with your calf, it should be pointing toward your ankle, not your knee."
    },
    {
      "title": "Strip the fabric from your skin.",
      "content": "Strip the fabric from your skin. With one hand, use your fingers to pull the surrounding skin away from the fabric, so it’s nice and taut. Then, with the other, take the fabric’s free end in between your fingertips. Quickly pull the fabric free of your skin in the opposite direction that your hair grows. For example, with your calf, you should pull the strip up toward your knee. As you do, try to keep as straight as possible. Avoid pulling it off at an angle that’s different from the one in which it was applied. Tear it off like a bandaid, in one quick, clean motion."
    },
    {
      "title": "Repeat if necessary, then clean up.",
      "content": "Repeat if necessary, then clean up. Apply more wax and strips as needed to wax all of the intended area. Depending on how large an area you’re waxing, reheat the mixture if it cools off or hardens to the point that you can’t spread it easily. Once you’re done, wash your skin with warm to hot water. If needed, apply more wax to the same area and use a second strip. After that, use a tweezer to pluck any remaining hairs. Your skin will probably be too sensitive for a third waxing. [1] X Research source Use soap if you want when washing, but it isn’t necessary. All you need is warm water, so stick with that if you used scented oil and want the smell to last. If your skin feels dried out afterward, apply baby oil after washing to rehydrate it. [2] X Research source The fabric can also be cleaned with hot water, so you can use them again.."
    },
    {
      "title": "Wash and dry your skin beforehand.",
      "content": "Wash and dry your skin beforehand. Use soap and water to remove any dirt, grime, or other substances that may prevent the wax from bonding to your hair. Rinse off afterward. Then dry your skin thoroughly, since any remaining water may thin the wax and weaken its bond with the fabric. Additionally, try dusting your skin with baby powder after drying. This will soak up any lingering moisture in your skin that might interfere with the wax bonding. [3] X Research source"
    },
    {
      "title": "Grow your hair out first.",
      "content": "Grow your hair out first. If you’ve been shaving instead of using other forms of wax, be patient. Give your hair a chance to grow longer so it’s easier to remove when waxing. Wait at least a week or two after shaving before switching to waxing. After repeated waxes, you’ll only have to wait for your hair to grow about a centimeter long before doing it again."
    },
    {
      "title": "Plan to wax often in the beginning.",
      "content": "Plan to wax often in the beginning. If you’re new to waxing, anticipate having to do it more often than people who have been doing it for a while. After your first wax, inspect your skin for hair growth. Younger hairs may have been too short for the wax to bond to the first time, so wax again as they grow out. Individual hairs fall out naturally, so each regrowth may be at a different stage than those around it. This means you have to wax numerous times the first few weeks. Over time, the roots will lose their strength, at which point they won’t need to grow as long. As this happens, each wax should remove more hairs at once, so you won’t have to do it quite so often."
    }
  ]
}