{
  "url": "https://www.wikihow.com/Unprotect-a-Word-Document-Without-the-Password",
  "title": "How to Remove a Password from a Word Document",
  "steps": [
    {
      "title": "Open the document and enter the password.",
      "content": "Open the document and enter the password. This method is only useful if you remember the password but want to remove it so anyone can access it."
    },
    {
      "title": "Click File and select Info.",
      "content": "Click File and select Info . This will show you more options to edit the document in the panel on the right side of the Word window. If you're using a Mac, click the Review tab instead."
    },
    {
      "title": "Click Protect Document.",
      "content": "Click Protect Document . It's the first option next to an icon of a padlock and key. On Mac, find this in the \"Protect\" grouping."
    },
    {
      "title": "Click Encrypt with Password.",
      "content": "Click Encrypt with Password . A little window pops up with your current password. Under the password field is a warning that losing or forgetting this password means that your Word document is lost and cannot be recovered. This article covers a few options that might help you get back into this document, but a lost or forgotten password usually means the document is unretrievable."
    },
    {
      "title": "Delete everything in the text box, and click OK.",
      "content": "Delete everything in the text box, and click OK . You want this box to be empty to remove any passwords protecting it. Now anyone can open the document! [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The box turns yellow when there is a password in place. You'll know there is no password when it's not colored."
    },
    {
      "title": "Open the document and enter the password.",
      "content": "Open the document and enter the password. This method is only useful if you remember the password but want to remove it so anyone can access it."
    },
    {
      "title": "Click the Review tab.",
      "content": "Click the Review tab. It's in the editing ribbon above the document."
    },
    {
      "title": "Click Protect Document.",
      "content": "Click Protect Document . Find this in the \"Protect\" grouping. Another window will open; look for the \"Security\" section. Under the password field is a warning that losing or forgetting this password means that your Word document is lost and cannot be recovered. This article goes over a few options that might help you get back into this document, but a lost or forgotten password usually means the document is unretrievable."
    },
    {
      "title": "Delete everything in the text box, and click OK.",
      "content": "Delete everything in the text box, and click OK . You want this box to be empty to remove any passwords protecting it. Now anyone can open the document! [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The box turns yellow when there is a password in place. You'll know there is no password when it's not colored."
    },
    {
      "title": "Rename the file to change its extension.",
      "content": "Rename the file to change its extension. - This is highly unreliable and may not work for you, but it is something you can try. Here's what to do: Open File Explorer and navigate to your .doc or .docx file. Right-click it and select Rename . Delete the .doc or .docx extension and enter .zip . Press Enter after changing the file extension. A confirmation window will appear. Click Yes in the pop-up window to confirm the file name change. If you have a .docx extension, and following this method doesn't work, try again and put the \".zip\" extension after the .docx extension so it looks like this: .docx.zip ."
    },
    {
      "title": "Open the .zip file.",
      "content": "Open the .zip file. You can double-click to open it or right-click it and select Open in new window ."
    },
    {
      "title": "Double-click the Word folder.",
      "content": "Double-click the Word folder. You'll see more files, including a file called \"settings.xml.\""
    },
    {
      "title": "Delete the settings.xml file.",
      "content": "Delete the settings.xml file. Right-click the file name and select Delete, or click it once and click the trashcan icon in the toolbar. [3] X Research source"
    },
    {
      "title": "Rename the file to change its extension.",
      "content": "Rename the file to change its extension. - This is highly unreliable and may not work for you, but it is something you can try. Here's what to do: Open your file manager (Finder for Mac or File Explorer for Windows) and navigate to your .doc or .docx file. Right-click or control-click it and select Rename . Delete the .doc or .docx extension and enter .zip . Press Enter after changing the file extension. A confirmation window will appear. Click Yes in the pop-up window to confirm the file name change. If you have a .docx extension, and following this method doesn't work, try again and put the \".zip\" extension after the .docx extension so it looks like this: .docx.zip . This is highly unreliable and may not work for you, but it is something you can try. This helped in the case of a Mac user who was unable to get rid of the password-protected feature that was preventing auto-saves. [4] X Research source"
    },
    {
      "title": "Open the .zip file.",
      "content": "Open the .zip file. You can double-click to open it or right-click it and select Open in new window ."
    },
    {
      "title": "Double-click the Word folder.",
      "content": "Double-click the Word folder. You'll see more files, including a file called \"settings.xml.\""
    },
    {
      "title": "Drag the file outside the Word folder.",
      "content": "Drag the file outside the Word folder. For example, drag it to your desktop. This way, you can edit it directly, and it's not protected by the Word folder."
    },
    {
      "title": "Open the document and search for enforcement.",
      "content": "Open the document and search for enforcement . If you right-click on the XML file, you can choose to open it in Notepad on Windows, or TextEdit for macOS. Press Ctrl + F to quickly find the term \"enforcement.\" You'll see a 1 after \"enforcement\" in the XML file ."
    },
    {
      "title": "Change the \"1\" to a \"0,\" and save the XML file.",
      "content": "Change the \"1\" to a \"0,\" and save the XML file. You can save it to write over the original file."
    },
    {
      "title": "Put the file back into the Word folder and rename it to .docx again.",
      "content": "Put the file back into the Word folder and rename it to .docx again. You can drag and drop the file back into the Word folder, right-click the overall folder, which is your original Word document, and rename it to have the .docx file extension again. The document will no longer be password protected whenever you try to open it."
    },
    {
      "title": "Open the document in Word and save it as an RTF file.",
      "content": "Open the document in Word and save it as an RTF file. This only helps as long as you can open the document. To do this, follow these steps: Open the document in Word and go to File > Save as. Change the \"File Type\" to Rich Text Format (.rtf) and save it."
    },
    {
      "title": "Open the .rtf file in Notepad.",
      "content": "Open the .rtf file in Notepad. You can also use any other plain text editor. Do this by right-clicking the file in your file manager and selecting Open with > Notepad ."
    },
    {
      "title": "Replace passwordhash with nopassword and save it.",
      "content": "Replace passwordhash with nopassword and save it. Press Ctrl + F to pull up the Finder to easily search for \"passwordhash\". Erase that term and replace it with \"nopassword.\" Press Ctrl + S to save the document."
    },
    {
      "title": "Open the document in Word and remove the password.",
      "content": "Open the document in Word and remove the password. Once you've made the changes in Notepad or the general text editor of your choice, you can re-open it in Word to remove any lingering protections. The password is gone, so you can open it without any issue. [5] X Research source To open your document in Word, you have two options: Open Word, go to Open, and select your document. Double-click your document or right-click it and select Open with > Word ."
    }
  ]
}