{
  "url": "https://www.wikihow.com/Write-in-Latin",
  "title": "How to Write in Latin",
  "steps": [
    {
      "title": "Classic Latin is written using the same alphabet as English.",
      "content": "Classic Latin is written using the same alphabet as English. There are many other languages that use this alphabet, including Spanish, Italian, and French—although other languages use accent marks that aren't used for English or Latin. In practice, some letters aren't used to spell Latin words, such as \"j\" and \"k.\" [2] X Research source The letter \"u\" is considered a variant of \"v.\" In classical Latin texts, the \"u\" vowel sound is written with the letter \"v.\" When you're writing in Latin, you can use either, but if you're writing something for a class, check with your instructor to find out what they prefer."
    },
    {
      "title": "Use Roman numerals when including numbers in Latin writing.",
      "content": "Use Roman numerals when including numbers in Latin writing. The numerals used in English and other Western languages (1, 2, 3, 4, 5, etc.) are Arabic numerals. If you're writing completely in Latin, including Roman numerals rather than Arabic numerals makes your writing more authentic. [3] X Research source For example, if you were writing the number 34, you'd use the Roman numerals \"xxxiv.\" X is the Roman numeral for 10, and you'd repeat it 3 times. Then you'd put \"iv,\" the Roman numeral for 4, at the end. The Romans didn't use any symbol for zero. For example, the number 3002 is \"MMMII.\" M is the Roman numeral for 1000, and you have 3 thousands in your number. Then you have the 2 in the ones place."
    },
    {
      "title": "Indicate the number of days until \"Kalendes,\" \"Ides,\" or \"Nones.\"",
      "content": "Indicate the number of days until \"Kalendes,\" \"Ides,\" or \"Nones.\" Start with the phrase \"ante diem,\" then use the Roman numerals for the number of days until the next special day. Add that day, then the month. Kalendes are always the first of the month. Nones are the 5th of the month, except in March, May, July, and October, when they are the 7th day. Ides are the 13th day of the month, except in March, May, July, and October, when they are the 15th day. [4] X Research source For example, if it's March 10, 2021, start by figuring out when the next special day is. The ides of March is the 15th, and it's only the 10th, so you know the next special day is \"Idus.\" The Romans count both the days leading up to the day and the day itself, so you would write \"ante diem vi Idus Martias MMXXI A.D.\" If the date you need is one of the special days of the month, just use the name for that day without \"ante diem\" or any Roman numerals. Always use capital Roman numerals for the year and lower-case Roman numerals for the date. For example, to write March 16, 2021, in Latin, you would write \"ante diem xvii Kalendas Apriles MMXXI A.D.\" [5] X Research source"
    },
    {
      "title": "Add the Latin suffix \"-us\" or \"-a\" to create a Latin version of a name.",
      "content": "Add the Latin suffix \"-us\" or \"-a\" to create a Latin version of a name. Some modern names have specific Latin translations, but you can also create your own Latin name to use when writing in Latin. Use \"-us\" for a masculine name or \"-a\" for a feminine name. [6] X Research source For example, \"Mark\" would become \"Markus.\" A feminine name, such as \"Karen,\" would become \"Karena.\" This puts the name in the nominative or vocative case, so you would use it when you're addressing someone or using the name as the subject of the sentence. When the name is the object of the sentence or used in another way, decline the endings the same as you would any other noun. For feminine names that end in \"y,\" change the \"y\" to an \"i\" before you add the \"a.\" For example, \"Mary\" becomes \"Maria.\""
    },
    {
      "title": "Inflect nouns based on number, gender, and case.",
      "content": "Inflect nouns based on number, gender, and case. The ending of a noun changes depending on how many you're writing about (singular or plural) and whether the noun is classified as masculine, feminine, or neuter. If you're familiar with European languages such as Italian, French, or Spanish, you have some experience with gendered nouns. [7] X Research source The ending also depends on how the noun is used in the sentence, with different endings depending on whether the noun is the subject, object, or indirect object—these are the cases. There are 2 additional cases, one indicates possession while the other indicates separation (nouns that are \"by,\" \"with,\" or \"from\" something else). If you're just getting started in Latin, find the Latin words for things you refer to every day. Make a chart with the inflected forms and study 5-10 words a week. Within just a few months, you'll have a healthy Latin vocabulary."
    },
    {
      "title": "Use simple connecting words to form basic sentences.",
      "content": "Use simple connecting words to form basic sentences. Don't worry about complicated sentence structures, especially if you're just starting to write in Latin. Basic connecting words such as \"et\" (and) and \"sed\" (but) will usually do the trick. Here are some others you can try: [8] X Research source \"Nam\" (for) \"Ergo\" (therefore, accordingly) \"Igitur\" (therefore) \"Cum\" (when, since, because) \"Si\" (if) \"Nisi\" (unless) [9] X Research source"
    },
    {
      "title": "Write Latin passages in present tense.",
      "content": "Write Latin passages in present tense. In Latin, present tense is typically used for telling stories, even if what you're writing about happened in the past. Writing in present tense also keeps your writing relatively simple. [10] X Research source Use active voice primarily, which will also make your writing simpler and more direct. [11] X Research source"
    },
    {
      "title": "Latin adjectives agree with the noun they modify.",
      "content": "Latin adjectives agree with the noun they modify. Like nouns, the endings of adjectives also change relative to number, gender, and case. With adjectives, these endings reflect the ending of the noun they modify, so no matter where the adjective appears in the sentence your reader will always know which word it applies to. For example, suppose you wrote: \"unitam logica falsa tuam philosophiam totam suffodiant\" (may faulty logic undermine your entire philosophy). [12] X Research source In this rather unkind statement, it is clear which adjective belongs with which word (\"falsa\" with \"logica\" and \"totam\" with \"philosophiam\") because they have the same endings."
    },
    {
      "title": "Form adverbs regularly by changing the suffix of the adjective.",
      "content": "Form adverbs regularly by changing the suffix of the adjective. Just as in English you form most adverbs by adding \"-ly\" to the adjective form, in Latin you also add a suffix to the adjective stem. Which suffix you add depends on the declension of the adjective: [13] X Research source 1st and 2nd declension adjectives: -ē, as in cārē (dearly), from cārus (dear), stem cāro- 3rd declension adjectives: -ter, as in fortiter (bravely), from fortis (brave), stem forti-"
    },
    {
      "title": "Traditionally the verb is last, but Latin has a relatively free sentence structure.",
      "content": "Traditionally the verb is last, but Latin has a relatively free sentence structure. Because nouns, adjectives, adverbs, and verbs are all inflected, anyone reading Latin can understand what's being said without taking clues from the order of the words in the sentence. This frees you up to put the words in an order that sounds best and works best rhythmically. [14] X Research source For example, you likely know the Latin sentence \"cogito, ergo sum,\" which means \"I think, therefore I am.\" In that case, the structure of the Latin sentence is exactly the same as the English translation. But you could also say \"ergo sum cogito\" and it would mean the same thing."
    },
    {
      "title": "Read your text out loud to make sure it flows properly.",
      "content": "Read your text out loud to make sure it flows properly. If you know how to pronounce Latin, this is the best way to revise your piece. By reading aloud, you'll immediately notice anything that sounds off. [15] X Research source When you're first making revisions, go sentence-by-sentence so it's easier to focus on the Latin. Then, do another read-through and consider how the sentences work together to form a complete passage. Add transitional words where needed to improve the flow of your writing."
    },
    {
      "title": "If you're writing primarily in another language, use italics to set off the Latin.",
      "content": "If you're writing primarily in another language, use italics to set off the Latin. Quotes are typically marked with double quotation marks. But if you're including a Latin word or phrase in your writing, italics are typically appropriate since it's considered a foreign language. This doesn't apply to abbreviations, such as \"e.g.,\" or Latin words and phrases that are commonly used, such as \"quid pro quo.\" [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source For example, you might write, \"It's rare for courts to overrule prior decisions because they follow the doctrine of stare decisis .\" If you're writing something for a class or for publication, always double-check the appropriate style guide to make sure. Some style guides have specific rules for Latin in certain situations, particularly in medicine, science, and law, where Latin terminology is commonly used. [17] X Research source"
    }
  ]
}