{
  "url": "https://www.wikihow.com/Wash-a-Jacket-in-a-Washing-Machine",
  "title": "How to Wash a Jacket in a Washing Machine",
  "steps": [
    {
      "title": "Read the tag to confirm that the jacket is machine-washable.",
      "content": "Read the tag to confirm that the jacket is machine-washable. Clothing tags list specific washing instructions, if there are any. Before putting the jacket in the washing machine, check the tag for any washing restrictions. If it says, “Handwash only” or “Dry-clean only,” then don’t put it in the machine or you might ruin it. [1] X Research source Also look for any washing instructions. The tag may specify water temperature or detergent type to use. Follow any instructions provided. If you aren’t sure about washing instructions, try contacting the manufacturer to see if the jacket is machine-washable."
    },
    {
      "title": "Handwash the jacket if the care tag has a bucket with a hand over it.",
      "content": "Handwash the jacket if the care tag has a bucket with a hand over it. Some care tags only have symbols rather than precise instructions. The handwash symbol is a bucket filled with water and a hand over it. This means the jacket is not machine-washable, so do not put it in the washing machine. [2] X Research source If you handwash the jacket, use a milder detergent that's designed for handwashing."
    },
    {
      "title": "Dry-clean the jacket if there is a bucket with an X over it.",
      "content": "Dry-clean the jacket if there is a bucket with an X over it. This symbol means that the jacket isn't machine-washable at all and getting it wet could ruin it. If your jacket's care tag features this symbol, take it to the dry-cleaner to have it properly and safely cleaned. [3] X Research source"
    },
    {
      "title": "Wash nylon, fleece, and down-filled jackets in cold water on the gentle cycle.",
      "content": "Wash nylon, fleece, and down-filled jackets in cold water on the gentle cycle. If there isn't a care tag, then a general rule is that these materials are machine-washable. Use only the cold water setting to prevent damaging the fibers in your jacket, and run the machine on the gentle cycle. [4] X Research source You can usually use normal detergent for these materials. If you aren't sure, check with the manufacturer. Machine-washing and drying can also help restore the fluffiness of a puffer jacket."
    },
    {
      "title": "Avoid putting suede, leather, or fur in the washing machine.",
      "content": "Avoid putting suede, leather, or fur in the washing machine. These materials are usually not machine-washable. Even if your jacket doesn't have a care tag, assume that you can't wash your jacket if it's made with any of these materials. [5] X Research source It's best to bring these jackets to a professional dry-cleaner."
    },
    {
      "title": "Pre-treat stains with liquid laundry detergent or a specialty product.",
      "content": "Pre-treat stains with liquid laundry detergent or a specialty product. If your coat has stains, it's best to spot treat them before washing the jacket to ensure the stains come out. Rub liquid laundry detergent or a laundry stain remover directly over each stain and let the jacket sit for 10 minutes before putting it in the washing machine. [6] X Research source If you don’t have stain remover, use a dab of dish soap instead."
    },
    {
      "title": "Zip up the jacket and pockets before loading it.",
      "content": "Zip up the jacket and pockets before loading it. The zippers on the jacket can get stuck on other clothes in the machine and rip them. Protect your other clothes by closing all the zippers on the jacket before starting the wash cycle. [7] X Research source Also remove any loose or detachable pieces, like detachable hoods. Check your jacket's pockets and empty them, if needed, before washing."
    },
    {
      "title": "Turn fleece jackets inside-out before loading them in the machine.",
      "content": "Turn fleece jackets inside-out before loading them in the machine. This prevents the fleece jacket from getting damaged in the wash. Make sure fleece jackets are zipped or buttoned up completely and turned inside-out before you start the wash cycle. [8] X Research source Other jackets can be washed without turning them inside-out first."
    },
    {
      "title": "Wash jackets by themselves to avoid damaging them.",
      "content": "Wash jackets by themselves to avoid damaging them. Best practice is washing each jacket separately. This way, you avoid staining or jackets getting caught on each other and ripping. [9] X Research source If you have a few jackets of the same type and material, then you can wash them together. Never mix jacket types and materials."
    },
    {
      "title": "Use a front-loading washing machine for down-filled jackets.",
      "content": "Use a front-loading washing machine for down-filled jackets. These jackets are a bit more fragile, and the agitator in the center of a top-loading washing machine could damage them. Use a front-loader to protect your down-filled jackets. [11] X Research source Some top-loading machines don't have an agitator. In this case, you can use it for a down jacket. If you don't have a front-loading machine, you can wash the jacket at a laundromat instead. Even if you have a front-loading washing machine, taking the jacket to a laundromat can still be a valid option, since these establishments tend to have commercial grade machines that are more adequate to wash heavy garments. This way, you don't run the risk of damaging your washing machine because of a single piece."
    },
    {
      "title": "Turn your washing machine to the delicate setting.",
      "content": "Turn your washing machine to the delicate setting. All jackets need a delicate wash cycle to prevent damage. Turn the wash knob to delicate before starting the machine. [12] X Research source On some washers, the delicate setting is listed as handwash or gentle. If you have a similar item that requires a different wash cycle, then don’t wash it with the jacket."
    },
    {
      "title": "Set the machine to use cold water.",
      "content": "Set the machine to use cold water. Besides the wash cycle knob, the washing machine should have another knob for the temperature setting. Turn this knob to cold whenever you wash jackets. [13] X Research source"
    },
    {
      "title": "Use your usual laundry detergent for nylon and down jackets.",
      "content": "Use your usual laundry detergent for nylon and down jackets. Most jackets don’t need any special detergent to get them clean. You can use the same general detergent you use for your normal loads of laundry. [14] X Research source Confirm that the jacket doesn’t have any specific detergent needs. Check the tag for specific directions."
    },
    {
      "title": "Use specialized wool detergent for wool coats.",
      "content": "Use specialized wool detergent for wool coats . Wool is machine-washable, but normal detergent can damage the wool fibers. Look for special wool detergent in the laundry aisle at your local grocery or drug store. [15] X Research source If you can't find wool detergent in the store, you can order it online."
    },
    {
      "title": "Dry the jacket in the dryer using a low heat setting unless it’s fleece.",
      "content": "Dry the jacket in the dryer using a low heat setting unless it’s fleece. Once the wash cycle finishes, transfer your jacket to the dryer just like any other piece of laundry. Set the dryer to a low-medium heat and dry it normally. The only exception is fleece, which you should hang up so that it can air-dry. [16] X Research source Machine-drying is especially helpful for puffy jackets to restore their fluffiness after a wash cycle. If you're unsure about the drying process, then it's best to air-dry the jacket. Machine-drying can damage some fabrics."
    }
  ]
}