{
  "url": "https://www.wikihow.com/Write-a-Business-Plan",
  "title": "How to Write a Business Plan",
  "steps": [
    {
      "title": "Analyze the potential markets for your business.",
      "content": "Analyze the potential markets for your business. Consider which segment of the local (and/or international) population will be seeking to use your products or services. This needs to be more than mere guesswork and involves doing accurate and intelligent research. You need to analyze secondary research collected by outside observers, as well as getting primary research that you collect yourself, with your own methods and observations. [1] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Consider the following areas of inquiry: Is there a viable market for the product or service you want to sell? How old are your potential customers? What do they do for a living? Is your product or service attractive to a particular ethnic or economic population? Will only wealthy people be able to afford it? Does your ideal customer live in a certain type of neighborhood or area?"
    },
    {
      "title": "Establish the size of your potential market.",
      "content": "Establish the size of your potential market. [2] X Research source It's important to be as specific as possible in regard to your market and your product. If you want to start a soap business, for example, you may believe that every dirty body needs your product, but you can’t start with the entire world as your initial market. Even if you’ve developed such a universally needed item as soap, you need to identify a smaller, more targeted customer group first, such as children under eight who might like bubblegum scented bubble bath, or soap made for mechanics. From there, you can analyze demographic information more specifically: How many car mechanics are in need of soap in any given community? How many children in the United States are currently under the age of eight? How much soap will they use in a month or a year? How many other soap manufacturers already have a share of the market? How big are your potential competitors?"
    },
    {
      "title": "Identify your company’s initial needs.",
      "content": "Identify your company’s initial needs. What will you require to get started? Whether you want to buy an existing company with 300 employees or start your own by adding an extra phone line to your home office desk, you need to make a list of the materials you’ll need. Some may be tangible, such as five hundred file folders and a large cabinet in which to store them all. Other requirements may be intangible, such as time to create a product design or to do market research on potential customers. [3] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source You might need to consider how your personal savings are and factor in a living wage for yourself."
    },
    {
      "title": "Prepare product samples.",
      "content": "Prepare product samples. If you’re going to build a better mousetrap, you may have constructed a prototype out of used toothpaste tubes and bent paperclips at home, but you’ll need a sturdier, more attractive model to show potential investors. What exactly will your mousetrap look like? What materials will you need? Do you require money for research and development to improve on your original toothpaste tube and paper clip construction? Do you need to hire an engineer to draw up accurate manufacturing designs? Should you patent your invention? Will you need to investigate federal safety standards for mousetraps?"
    },
    {
      "title": "Research possible locations for your business.",
      "content": "Research possible locations for your business. Call a real estate broker and look at actual retail spaces in the neighborhood where you’d like to open your restaurant. Make a chart of the most expensive and least expensive sites by location and square footage. Then estimate how much space you require and how much money you’ll need to allow for rent."
    },
    {
      "title": "Determine your start-up cost.",
      "content": "Determine your start-up cost. Make a list of all the tangible and intangible resources you need to get your business going. The total estimated price of all of these items will become your start-up cost whether you’re buying highly sophisticated computers or simply installing a new telephone line on your desk. If there’s any item in your estimates that seems unreasonably high, research other alternatives. But keep in mind that it’s better to include every element you truly need along with a reasonable estimate of the cost of each item, so you don’t run out of money or default on your loans. [4] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source Be honest and conservative in your estimates, but also be optimistic. [5] X Expert Source Keila Hill-Trawick, CPA Certified Public Accountant Expert Interview. 30 July 2020. Don't aim for the best of everything at the beginning. You can forgo the expensive trimmings of an office of a more well-established company and stick to the basics at the beginning. Get what is affordable, works and is actually needed and don't buy frills."
    },
    {
      "title": "Put yourself in the shoes of potential investors.",
      "content": "Put yourself in the shoes of potential investors. Ask yourself, “If I were going to invest X amount of dollars into a concept or idea, or even a product, what would I want to know?” Gather as much helpful and credible information as you can. Depending on your product, you may need to search long and hard for relevant information. Don't lose heart if you discover some, or even all, of your ideas have been adequately covered by the market. Don't ignore this reality; instead, work with it. Can you still do a better job or provide a better widget than your competitors? In many cases, it's likely that you can provided you know the market well and how to add value in ways your competitors are not doing. In other cases, it may be a case of focusing more narrowly or more broadly than your competitors are doing."
    },
    {
      "title": "Identify potential investors.",
      "content": "Identify potential investors. Banks and other funding sources don’t lend money because people with interesting business ideas are nice. They follow specific guidelines, such as the Risk Management Association (R.M.A) [6] X Research source database, which are designed to ensure that they will make money by investing in or lending to your business. Lenders will typically look to the company's Capital, Capacity, Collateral, Conditions, and Character or what is known as the 5C's of lending when underwriting a loan. You'll need to have covered all these bases well before seeking funding."
    },
    {
      "title": "Define your company.",
      "content": "Define your company. [7] X Research source A business plan won't be useful until you're certain what your company exists for. What will you accomplish for others? What products and services will you produce or provide? Write down all the specific needs your company will satisfy. [8] X Expert Source Keila Hill-Trawick, CPA Certified Public Accountant Expert Interview. 30 July 2020. Potential investors need to know that your business will be meaningful and marketable to people who can use your product or service. So concentrate on the external needs your company will meet. What will your product or service enable people to do better, more cheaply, more safely, or more efficiently? Will your restaurant make people’s palates delirious with new taste sensations? Will your new mousetrap help people capture mice without feeling sick to their stomachs? Will your new bubblegum scented bubble bath revolutionize the way children agree to take nightly baths?"
    },
    {
      "title": "Choose a winning strategy.",
      "content": "Choose a winning strategy. Once you’ve established the competitive advantage your business offers, you will be able to select the best strategy to reach your goal. How will you distinguish your product or service from others? Although there are millions of types of businesses, there are actually only a few basic strategies that can be applied to make any enterprise successful. The first step in selecting an effective strategy is to identify a competitive advantage for your product or service. [9] X Trustworthy Source Iowa State University Extension and Outreach Iowa State University's Extension and Outreach program dedicated to educating and engaging communities Go to source Your competitive advantage may include designing special features not found in rival products. It may entail superior service characteristics such as speedier delivery, a lower price, or more attentive sales people––these are never to be sniffed at as possible winning ways, as many companies grow complacent and can be overtaken by giving customers experiences that are better than the average expectations. Even where your product or service is already well established, perhaps you’re establishing an image or brand of exceptional quality or reputation."
    },
    {
      "title": "Design your company.",
      "content": "Design your company. Consider how will you hire and organize your workforce. By the time you’ve reached this stage of thinking about your potential business concept, you’ll probably have a good idea of the number of people you’ll need and the skills they’ll require to get your enterprise up and running. [10] X Research source Keep in mind that your initial plans will undoubtedly change as your business grows. You may need to hire more managers to supervise your expanding staff or to set up new departments to meet new customer demands. Projected growth and expansion for your company should be mentioned in your business plan, but it’s not the primary focus. For now, you want to secure help in getting started and convince your funding sources that you will become profitable."
    },
    {
      "title": "Consider the practical issues of running a business.",
      "content": "Consider the practical issues of running a business. Think about your role as leader or boss of the business. As you think about hiring personnel and organizing your workforce, you must also confront your desire and ability to be a good boss. Decide how you will handle your employees' entitlements. For example, salaries and wages, their insurance and retirement benefits, as well as analyzing the extent of your knowledge of tax related issues. [11] X Expert Source Keila Hill-Trawick, CPA Certified Public Accountant Expert Interview. 30 July 2020. Investors will want to know if you’re capable of running the business. Do you need to bring in experienced managers right away? Will you keep some of the existing employees or hire all new people? And where do you find these potential employees? Funding sources will also want to know if any of your partners expect to work alongside you or if their obligations are only financial. Your plan will need to specify the key management jobs and roles. Positions such as president, vice presidents, chief financial officer, and managers of departments will need to be defined along with stating who reports to whom."
    },
    {
      "title": "Decide on a marketing plan.",
      "content": "Decide on a marketing plan. [12] X Research source One of the most common flaws in plans is the entrepreneur’s failure to describe exactly how customers will be reached and how products will be presented to them. Potential investors, staff, and partners won’t be convinced that your idea can succeed until you’ve established well-researched and effective methods of contacting your customers––and the assurance that once you’ve reached them, you can convince them to buy your product or service. Consider how will you reach your customers. [13] X Research source What will you say to persuade and convince customers that your product or service is better value, more timely, more useful, etc. to the consumer than the rival product or service? If it currently has no rival, how will you properly explain the purpose of and the consumer's need for the product? What advertising and promotional efforts will you employ? For example, two for the price of one specials or free coupons inside those same kid-oriented cereal boxes? Where can you locate lists of the greatest concentrations of children under the age of eight or whatever group constitutes your market?"
    },
    {
      "title": "Build a dynamic sales effort.",
      "content": "Build a dynamic sales effort. The word “sales” covers all the issues related to making contact with your actual customers once you’ve established how to reach them through your marketing campaign. In a nutshell, this part of your business plan is about how you will attract customers or clients for your product or services. What will your basic sales philosophy be? Building long-term relationships with a few major clients or developing a clientele of many short-term customers?"
    },
    {
      "title": "Organize all the relevant information about your business.",
      "content": "Organize all the relevant information about your business. Begin creating section headings and putting the appropriate information under the appropriate headings. [14] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source Effectively separating your business' unique approach to each of these headings will organize your plan in a way investors find useful: Title Page and Table of Contents Executive Summary , in which you summarize your vision for the company General Company Description , in which you provide an overview of your company and the service it provides to its market Products and Services , in which you describe, in detail, your unique product or service Marketing Plan , in which you describe how you'll bring your product to its consumers Operational Plan , in which you describe how the business will be operated on a day-to-day basis Management and Organization , in which you describe the structure of your organization and the philosophy that governs it Financial Plan , in which you illustrate your working model for finances and your need from investors Sustainability Plan , in which you consider how your business's operations in the ecological, social, and economic context will create long-term value for society. [15] X Research source"
    },
    {
      "title": "Write the executive summary last.",
      "content": "Write the executive summary last. The executive summary is basically your big appeal to investors, or really anyone who reads your business plan, that should summarize and articulate what it is that's great about your business model and product. It should be less about the nitty-gritty details of operations and more about your grand vision for the company and where it is headed. [16] X Research source"
    },
    {
      "title": "Gather all the information together and prepare multiple drafts.",
      "content": "Gather all the information together and prepare multiple drafts. You've done all of the hard work researching, deciding what your business is about, targeting it accurately and selling it. It's time to put the business plan together and articulate all your thinking, research, and hard work into a comprehensive description of your structure and service. At first, do not worry about capitalization, punctuation, and grammar. All you need to worry about is putting your ideas down on paper. Once you have a general form, you can spend time proofreading your plan and correcting mistakes. Have someone else read over it for you and take heed of their comments."
    },
    {
      "title": "Sell yourself and your business.",
      "content": "Sell yourself and your business. The idea of the business plan is to present yourself in the best light. The talents, experience and enthusiasm you bring to your enterprise are unique. They provide some of the most compelling reasons for others to finance your concept. Keep in mind that investors invest in people more than ideas. Even if your potential business has many competitors or is not on the cutting edge of an industry, the qualifications and commitment you demonstrate in your plan can convince others to proffer their support. [17] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source Your resume will be included in the separate appendix of exhibits at the end of the plan, so this is not the place to list every job you’ve ever had or the fact that you were an art history major in college. But don’t overlook the impact of some part of your background that might even seem unrelated to your new venture. Focus on group experiences, leadership opportunities, and successes at all levels. [18] X Expert Source Keila Hill-Trawick, CPA Certified Public Accountant Expert Interview. 30 July 2020."
    },
    {
      "title": "Present and explain your financial data.",
      "content": "Present and explain your financial data. How will you convince others to invest in your endeavor? By having clear, transparent and realistic financial information that shows you know what you're talking about and that you're not hiding anything. [19] X Research source The accuracy of your financial figures and projections is absolutely critical in convincing investors, loan sources, and partners that your business concept is worthy of support. The data must also be scrupulously honest and extremely clear. Since banks and many other funding sources will compare your projections to industry averages in the R.M.A data, in the United States you can use the R.M.A figures to test your projections before the bank does."
    }
  ]
}