{
  "url": "https://www.wikihow.com/Win-Back-the-Love-of-Your-Life-After-Cheating",
  "title": "12 Tips for Saving Your Relationship After You’ve Had an Affair",
  "steps": [
    {
      "title": "End the affair",
      "content": "End the affair . If you are truly committed to getting your significant other back after your affair, the first thing you need to do is cut off all contact with the person you cheated with. Let them know that you are not interested in any further communication with them, and remove them from your phone, email, social media, and anywhere else you may have their contact information. [1] X Research source It can help to rebuild trust in your relationship if you involve your significant other in this step. You can remove the other person from your contacts in front of your significant other, and allow your significant other to read and/or hear your ending dialogue with the other person. Don't expect to be able to maintain any relationship, even non-romantic one, with the person you cheated with moving forward."
    },
    {
      "title": "Tell your partner everything about the affair.",
      "content": "Tell your partner everything about the affair. If you’ve cheated on someone, you've completely betrayed their trust. Prove that you want to earn it back by admitting your mistake to your partner openly and honestly. Be honest about why you cheated, and allow time for your partner to ask questions or simply to process the information. [2] X Research source Think carefully about what you will say before you begin the conversation with your partner. You should have a clear idea of what you've done, what you feel sorry for, and how you want to tell them before you start a dialogue. It can be tempting to conceal part of the truth because you don’t want to hurt your partner or because you worry they won’t be able to forgive you if they knew everything, but it’s important to be as forthright as possible. Your partner will likely be very upset at this news. Allow them time to process in whatever way is most helpful to them. This may include giving them days or weeks to think about what you’ve said. Your significant other may have very personal questions about the nature of your relationship with the other person. It will be important to answer their questions honestly regardless of how ashamed, frustrated, or embarrassed you are."
    },
    {
      "title": "Make a sincere apology",
      "content": "Make a sincere apology . Admit your fault for your actions, and be genuine about it. Acknowledge your mistake without making excuses for why you cheated: your partner doesn’t hold agency over you, and nothing they did “made” you cheat. Let them know that you understand this is your fault. [3] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Tell your partner, \"I know I have hurt you immeasurably, and I will do whatever it takes to rebuild our relationship. I am truly sorry, and I want to talk about how we can move forward.\" Do not make an insincere apology. Apologize only for what you mean and what you feel you've done wrong. Your partner will be able to sense any insincerity, so the apology needs to come from your heart, not from your sense of guilt. There are a number of circumstances under which someone might cheat. But when you make your apology, express your remorse using \"I\" statements—in other words, keep the focus on what you did, rather than pointing the finger at your partner, the person you cheated with, or a particular situation that \"caused\" you to cheat."
    },
    {
      "title": "Ask for forgiveness",
      "content": "Ask for forgiveness —but don’t expect it instantly. Forgiveness won’t be fast or easy. If it comes at all, it will likely take a long time; however, if you are looking to win your partner back, it’s important that they know early on that you want forgiveness and are willing to work for it. [4] X Research source Let your partner know, “I don’t expect you to forgive me right away. I know I have to earn that. But I am committed to doing whatever it takes to earn back your love and trust.\" Allow your partner to tell you what they feel, as well as what they expect and need from you before they feel they can reasonably forgive you. Ask your partner about their feelings, and actively listen to their responses. Realize forgiveness isn’t a linear process: your partner may want to forgive you, but healing from your infidelity will likely take time. Don’t expect your partner to forgive and immediately move on."
    },
    {
      "title": "Give your partner as much space as they need",
      "content": "Give your partner as much space as they need . Your partner may want space away from you after your confession. You might feel anxious about it, which is understandable: it might seem like you’re losing them—and, truthfully, they may process their feelings and ultimately decide they don’t want to stay in the relationship. But it’s important to show your love and respect by letting them have the space they need: it doesn’t have to mean that they’ll want to break up, just that part of the healing process means getting distance from you. [5] X Research source If your live-in partner indicates they want distance, arrange to stay with a friend or family member or at a hotel for a while. If your partner prefers to be the one to leave, allow them to make that call. Do not pressure your partner to come around or let you back in. Show your respect for them by allowing them the space they request. If physical intimacy was a part of your relationship, expect that it will be slow to return. Do not pressure your partner into anything. Let them come to you only when they are ready."
    },
    {
      "title": "Attend couples therapy",
      "content": "Attend couples therapy . Couples counseling can be incredibly helpful after a partner has been unfaithful. Find a counselor that specializes in helping couples cope with infidelity and meet with them regularly to work on healing your relationship and moving forward. [6] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Your partner should be involved in the decision to go to couple’s counseling. Let them know that you would like to seek professional help mending your relationship, and make them an equal and active partner in deciding which counselor is right for you. Set up a therapy schedule that works for both of you. Since you are attending as a couple, you will need to find time once a week or biweekly where you can go in together. Be considerate of your partner’s schedule when you make appointments. Let the counselor know directly that you are there to work past infidelity. Understand that recovery will take time, but let your therapist know you are looking for long-term solutions."
    },
    {
      "title": "Practice being radically honest with your partner.",
      "content": "Practice being radically honest with your partner. Frank and honest communication will be essential to helping rebuild trust between you and your partner. To rebuild your partner’s trust, you will likely need to share your daily activities with them. Moreover, the healthiest romantic relationships are those where both partners are friends who share their feelings, desires, fears, and motivations—all subjects you will need to discuss openly with your partner in order to determine why you may have had an affair and how you can both move forward. [7] X Research source If your partner lets you know that they want more communication about where you are and what you are doing, be understanding and work out a plan to check in with them. Communicate honestly with your partner about your everyday thoughts and feelings. Allow yourself to be emotional and express struggle or regret if that is what you are feeling. Equally as important, allow your partner the chance to communicate. Engage them in conversation, make an effort to not only listen but truly internalize and work to understand what they are saying. Actively listen by repeating back what you hear them say. Reader Poll: We asked 796 wikiHow readers who’ve cheated, and 60% of them agreed the biggest challenge in rebuilding trust is dealing with the emotional fallout and broken trust. [Take Poll]"
    },
    {
      "title": "Use conflicts with your partner as opportunities for growth.",
      "content": "Use conflicts with your partner as opportunities for growth. You and your partner will likely argue as you try to move forward from your infidelity. This can be draining for you both, and you may both feel tempted to try to \"win\" the fight rather than use your disagreements as opportunities to discuss issues and grow together. It is important that you try to work through confrontation rather than fighting to win. Try not to bring up old arguments or unrelated subjects, as this will likely only upset your partner further. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try to fight fair with your partner. Focus on the issue at hand and avoid bringing in other issues. Keep your calm, and discuss specific instances and your emotional responses, rather than making broad generalizations about your relationship. [9] X Research source Come to a concrete resolution. Don’t assume that a fight is resolved simply because you or your partner starts to run out of energy."
    },
    {
      "title": "Accommodate your partner's needs as they relearn to trust you.",
      "content": "Accommodate your partner's needs as they relearn to trust you. In order to help rebuild trust, your partner may request certain things such as spending more time together or having you work to show them that you have changed. Be accommodating to your partner and put effort into any reasonable request they present. [10] X Research source Your partner may request access to your texts, e-mails, and other devices to see who you are talking to. If you are comfortable with this, offer your partner access to your devices. Getting defensive or private about your time or space may cause your partner to become suspicious. If there is a reason you cannot meet their request, be open about it and talk with them honestly. Say, “I am completely willing to do this because I want to rebuild trust in this relationship. Would you be willing to share with me what you hope to gain from this so that I better understand the common goal we are working toward?” Some individuals have even found it helpful to hire a personal detective to assure themselves that the cheating has completely stopped. Be aware that this is something your partner might want to do, and make sure it is something with which you are comfortable as well."
    },
    {
      "title": "Follow through on your commitments to your partner.",
      "content": "Follow through on your commitments to your partner. Show your partner you've changed for the better. You can make all the promises you want, but they won't mean much unless you also make an effort to show your partner that you are working toward change. This means not only being honest but keeping your commitments. [11] X Research source Show your partner your dedication not just through grand gestures, but through daily, intentional efforts such as picking up the slack in areas your partner can’t manage on their own or by helping with things you didn’t help with before. This may mean working harder to listen if your partner feels like you don’t pay attention, helping more around the house if your partner feels overwhelmed with other work, or making other contributions to your relationship to show your partner that you are committed and that you care. It may help to establish a ritual that you and your partner do daily. For example, having a cup of decaf coffee together after dinner to discuss your day."
    },
    {
      "title": "Accept their decision to leave if they feel it's the best thing to do.",
      "content": "Accept their decision to leave if they feel it's the best thing to do. Some couples find a way to work through infidelity, but many couples don't. Your partner may decide they need to end the relationship, and unfortunately, this is something you must try to accept. Some 30% of divorces in the US are the result of infidelity, along with countless more separations between non-married couples. If your partner decides that they cannot be with you after you cheated, respect their choice. [12] X Research source Fighting for a partner who does not want to continue their relationship may cause them and you greater emotional stress and damage. Show your love by respecting their decision if they want to leave the relationship."
    },
    {
      "title": "Move on",
      "content": "Move on if your partner chooses to break up. If your partner ultimately decides to end the relationship, try to accept this, and don't live your life hoping they will change their mind. If your partner does not want to take you back after infidelity, that is their right. [13] X Research source If you truly regret your mistake, resolve to not repeat it in future relationships. Use this as an opportunity to improve your romantic partnerships moving forward. Cheating does not happen in a vacuum. Spend some time looking at what contributed to your infidelity, and assess whether these are issues you can work on yourself. Moving on is also a kindness to yourself. You’ve hurt somebody, but this doesn’t mean you have to suffer forever for it. If your partner wants to end the relationship, they have a right to—but don’t beat yourself up forever. Just try to do better in the future. Seek individual counseling if you feel you need it. A counselor may be able to help you get closure from your relationship, and work with you to develop more productive relationship choices in the future."
    }
  ]
}