{
  "url": "https://www.wikihow.com/Style-2b-Hair",
  "title": "How to Style 2b Hair",
  "steps": [
    {
      "title": "Shampoo your hair 2 to 3 times a week to prevent your hair from drying out.",
      "content": "Shampoo your hair 2 to 3 times a week to prevent your hair from drying out. Wavy hair tends to dry out easier than straight hair and it needs the moisture from natural oils on your scalp. Wash your 2B hair whenever it's dirty or greasy instead of every day. This way your hair is less likely to become frizzy. [1] X Research source You might find that your wavy hair looks best the day after you wash it."
    },
    {
      "title": "Use a sulfate-free shampoo to prevent damage and frizz.",
      "content": "Use a sulfate-free shampoo to prevent damage and frizz. Harsh ingredients like sulfates, silicones, and alcohol can really dry out your hair. To protect it and prevent frizz, reach for a shampoo that contains hydrating ingredients like shea butter, coconut oil, jojoba oil, argan oil, or elastin protein. [2] X Research source Look for sulfates on the ingredient label. The most common ones are sodium lauryl sulfate, sodium laureth sulfate, and ammonium laureth sulfate. Read labels when you're buying shampoo and look for a product that says it's moisturizing or hydrating. Some products designed for wavy or curly hair may be labeled \"low poo.\" This means that they don't contain the harsh ingredients that create rich lather like in most shampoos. [3] X Research source"
    },
    {
      "title": "Apply a moisturizing conditioner and leave it on for 5 minutes to absorb nutrients.",
      "content": "Apply a moisturizing conditioner and leave it on for 5 minutes to absorb nutrients. Work a silicone-free moisturizer into your hair and pay extra attention to the tips since these tend to dry out easily. Then, let it sit for5 minutes before you rinse it off with cool water. The cool water helps close the hair cuticle to lock in moisture. [4] X Research source If you're not a fan of cold showers, you can finish taking a hot shower. Then, rinse your hair in the sink using cool water. You don't need to apply moisturizer to your scalp. Since your 2B hair tends to be straighter near the roots, moisturizer on the scalp can actually weigh your hair down even more so it looks less wavy."
    },
    {
      "title": "Run a wide-toothed comb through your hair if you want to detangle it.",
      "content": "Run a wide-toothed comb through your hair if you want to detangle it. Your wavy hair probably tends to tangle easily and you may find knots when you're washing or conditioning. Take the time to gently break apart each knot with your fingers. Then, comb through your hair with a wide-toothed comb or your fingers just to check for more tangles. [5] X Research source In general, if you've got 2B hair, you should always use a comb instead of a brush if you're detangling your hair. Brushes contain many tiny bristles that create friction. This is a huge cause of frizz."
    },
    {
      "title": "Apply a lightweight leave-in conditioner that supports your waves.",
      "content": "Apply a lightweight leave-in conditioner that supports your waves. Rub the product between your palms and gently work it through your wet hair. Use a product that's designed for wavy or curly hair so it won't weigh down your tresses. A leave-in conditioner will strengthen and keep your hair moisturized throughout the day. [6] X Research source Keep in mind that leave-in conditioner is slightly different than your standard conditioner. It won't leave your hair looking dull or greasy since it's formulated to add shine and protect your hair from heat damage."
    },
    {
      "title": "Use a hair mask once a week to deeply hydrate your hair and prevent frizz.",
      "content": "Use a hair mask once a week to deeply hydrate your hair and prevent frizz. Apply a moisturizing hair mask or a deep-conditioning treatment to your wavy hair about once a week or whenever your hair feels extra dry. [7] X Research source Hair masks usually contain intensely hydrating products like argan oil, shea butter, or coconut oil to add moisture and prevent frizz. If you use hair masks too often, you'll notice product buildup, which can weigh down your waves."
    },
    {
      "title": "Blot your hair with a cotton cloth or clean T-shirt to minimize friction.",
      "content": "Blot your hair with a cotton cloth or clean T-shirt to minimize friction. Skip the bath towels—they're made up of thousands of loops that can snag on your hair. Instead, tilt your head to the side so your hair hangs down. Hold a cotton cloth or T-shirt right under the hair and press it up onto the hair, squeezing gently. Repeat this for the hair on the other side of your head. [8] X Research source The goal is to reduce friction that causes frizz. Blotting your hair with a cloth keeps the wavy hair structure intact."
    },
    {
      "title": "Apply a mousse, hair serum, or wavy styling product while your hair is damp.",
      "content": "Apply a mousse, hair serum, or wavy styling product while your hair is damp. There are thousands of wavy hair products on the market, so experiment to find ones that work best for your unique 2B waves. Look for products that reduce frizz or add shine. [9] X Research source For instance, you could rub a few drops of nourishing hair serum between your hands and gently work it into your hair when you get out of the shower. You might use a volumizing product to really accentuate the curls in your hair. [10] X Expert Source April Ferri Professional Hair Stylist Expert Interview. 8 December 2020. If your hair is especially prone to frizz, you could use an anti-humectant product, which helps block your hair from absorbing moisture. [11] X Expert Source April Ferri Professional Hair Stylist Expert Interview. 8 December 2020. Mousses and curl creams are designed to be lightweight so they won't weigh your waves down."
    },
    {
      "title": "Let your hair air dry to protect your natural waves.",
      "content": "Let your hair air dry to protect your natural waves. Resist the urge to brush or adjust your tresses once you've finished applying the product. The beauty of 2B hair is that your hair will dry in attractive, natural waves! [12] X Research source If your hair is really thick, it might take several hours for your hair to dry. You may want to use a diffuser to dry your hair until it's about half-dry. Then, let it finish air drying."
    },
    {
      "title": "Blow dry your hair on low heat with a diffuser if you're in a hurry.",
      "content": "Blow dry your hair on low heat with a diffuser if you're in a hurry. Some days, you just can't wait for your hair to dry on its own! Push a diffuser attachment onto your blowdryer and adjust the settings to low heat. The diffuser spreads out the heat, so one area doesn't dry out and become frizzy. Work the diffuser around your head until your hair is almost dry. [13] X Research source Avoid using straightening irons or high heat on your wavy hair. These can really dry out your tresses which increases frizz. If you want to refresh your waves throughout the day, you can mix equal parts of water and leave-in conditioner in a spray bottle. Shake it thoroughly and spritz it onto your hair whenever your waves look a bit frizzy or out of control."
    },
    {
      "title": "Diffuse your hair close to your scalp if you want your hair to be curlier.",
      "content": "Diffuse your hair close to your scalp if you want your hair to be curlier. Instead of pointing the diffuser attachment to the side of your hair, Tilt your head to the side or flip your head upside down. Turn your diffuser straight up and hold it below the tips of your hair. Bring the diffuser straight up, so your hair gathers into it. Keep pushing the diffuser up toward your scalp, so your hair bunches together. Hold it there until your hair feels mostly dry. [14] X Research source Using the diffuser attachment with your hair close to your scalp encourages a curlier texture."
    },
    {
      "title": "Put your damp hair into a braid or bun for wavier texture.",
      "content": "Put your damp hair into a braid or bun for wavier texture. If you've naturally got loose waves that you'd like to play up more, braid your hair or gather it into a bun on the top of your head. Secure the braid or bun with a scrunchie and let your hair dry completely. When you put your hair down, you'll see the extra texture in your tresses. [15] X Research source Gently run your fingers through your hair to break up the waves and soften your look."
    },
    {
      "title": "Wear your hair loose in messy beach waves to enjoy your natural texture.",
      "content": "Wear your hair loose in messy beach waves to enjoy your natural texture. Rock your natural style! If you've been caring for your hair, you won't need to do much to pull off this easy, beautiful look. To give your hair that fun, beachy style, spritz some texturizing spray onto your hands and gently run your fingers through your tresses."
    },
    {
      "title": "Pull your hair back into a half-updo for a casual, everyday style.",
      "content": "Pull your hair back into a half-updo for a casual, everyday style. Gather the hair on the top half of your head and bring it back into a ponytail or bun. Leave the hair on the bottom half of your head loose and wavy. For a slightly romantic look, let a few strands of wavy hair fall near your temples to frame your face. [16] X Research source This is a great look if you haven't washed your hair in a few days and you need to quickly style it."
    },
    {
      "title": "Put your hair into loose braids for a soft, romantic style.",
      "content": "Put your hair into loose braids for a soft, romantic style. If you've got long, wavy hair, try a French braid . For shorter hair, part your hair down the center of your head and make a small braid on each side. You can also leave a few waves hanging down the side of your face. [17] X Research source Keep the braids as loose as you like. Tighter braids look more polished, but your wavy hair won't be as noticeable."
    },
    {
      "title": "Part your hair on the opposite side and pin back your waves for an elegant look.",
      "content": "Part your hair on the opposite side and pin back your waves for an elegant look. Create instant volume and switch up your look by just changing your part. Once you part your hair on the opposite side, pull back the hair on the side of your head that's closest to the part. Then, pin it on the side using a stylish hair clip. [18] X Research source For a dressier style, pull back your hair using a jeweled hair comb instead of a clip."
    },
    {
      "title": "Ask for layers when you get a haircut, so your waves don't weigh your hair down.",
      "content": "Ask for layers when you get a haircut, so your waves don't weigh your hair down. You're lucky—2B waves look great on hair of any length! When you're talking with your stylist about getting a cut, discuss layers . Strategic layers in wavy hair can create movement, make your hair look curlier, or give an interesting texture. For instance, you might get layers in a long bob hairstyle. This adds interest and movement, so your waves don't look heavy or limp."
    }
  ]
}