{
  "url": "https://www.wikihow.com/Talk-to-a-Human-when-Calling-a-Business",
  "title": "How to Talk to a Human If Calling a Business: Tips That Work",
  "steps": [
    {
      "title": "Dial \"0\".",
      "content": "Dial \"0\". Most of the time, pressing \"0\" will take you to an operator. If it doesn't, press it multiple times. For many systems, pressing it twenty times will do the trick. For general tips, see our guide on making effective business calls ."
    },
    {
      "title": "Dial \"*\" or \"#\" four or more times.",
      "content": "Dial \"*\" or \"#\" four or more times. Many companies have a special combination (usually repeated keys) to let their sales reps or field technicians quickly get a hold of someone. If you don't have the time or are desperate to avoid having to speak with a chat bot, keep trying different combinations for a better chance of success."
    },
    {
      "title": "Press nothing and wait.",
      "content": "Press nothing and wait. Most automated systems have support for old \" rotary \" style phones which cannot submit a silent tone from the newer touch-tone styles. This confusion will register with an operator and usually will mean being transferred to a human call agent. If not, you will often hear a recorded message instructing you to press a specific number to reach a representative."
    },
    {
      "title": "Choose the option for \"new service\" or \"cancel my account.\"",
      "content": "Choose the option for \"new service\" or \"cancel my account.\" This usually connects you to a live operator who can help and/or re-direct your call to the right person. Ask them for their name and ID number first, so that they know they can be held accountable for transferring you properly. Alternatively, choose the option for checking your account. When asked for your account number, dial anything. If you can’t get on the line with an operator, you can always try emailing customer service instead ."
    },
    {
      "title": "Say, \"I would like to speak to a person.\"",
      "content": "Say, \"I would like to speak to a person.\" Or, repeat the words \"operator,\" \"agent,\" or “speak to a representative.” You can also try, \"I would like to speak with a human.\" Since these systems often miss the first 1/4 second of your statement, full sentences allow for a clearer understanding. For more customer service info, see our guide on getting good customer service when talking to a representative."
    },
    {
      "title": "Say \"complaint\" or \"I'm having a problem\" repeatedly.",
      "content": "Say \"complaint\" or \"I'm having a problem\" repeatedly. Do it as many times as you can. Many voice-controlled systems have checks for certain words, so you may be forwarded to a human being after three or four repetitions of that word."
    },
    {
      "title": "Mumble something indistinguishable.",
      "content": "Mumble something indistinguishable. If the system hears you making sounds and cannot distinguish words, it usually asks you to repeat yourself twice, then gives up and sends you to customer service."
    },
    {
      "title": "Call a local branch.",
      "content": "Call a local branch. You can sometimes talk to a person faster if you call a local branch of that business rather than the national help number. Make sure to get the local branch number from an official source to avoid scam numbers."
    },
    {
      "title": "Call during off hours.",
      "content": "Call during off hours. Almost every call center has had a high call volume lately. Try calling early in the morning or midweek. This can help get you to a human operator faster."
    },
    {
      "title": "See if the business offers online support.",
      "content": "See if the business offers online support. Go to the business's website and look for a \"Contact\" or \"Support\" page—you may find a live chat option that allows you to speak to a human via chat. If the business doesn't offer live chat, check their official Twitter/X or Facebook profile to see if they accept customer messages. Many companies, including Xfinity, have a dedicated support X/Twitter account you can send a direct message to , and an actual human will respond. [1] X Research source"
    }
  ]
}