{
  "url": "https://www.wikihow.com/What-Is-a-Good-Age-to-Start-Wearing-Makeup",
  "title": "What's the Right Age to Start Wearing Makeup? A Guide for Parents and Kids",
  "steps": [
    {
      "title": "Your child might start wanting to wear makeup in middle school or when they’re 11-13.",
      "content": "Your child might start wanting to wear makeup in middle school or when they’re 11-13. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source At that age, it’s natural for your kid to want to copy older adults. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, you won’t be alone if you still feel like 11-13 is too young. Some parents don’t approve of young people wearing makeup until they’re 14 years old or older. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It really comes down to what feels right and appropriate for your lifestyle and situation. For instance, school rules or dress codes might influence how people wear makeup, while wearing makeup at a young age might be totally normal for certain activities like dance team or cheer. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "It’s okay for your child not to wear makeup at all!",
      "content": "It’s okay for your child not to wear makeup at all! They might feel pressured to wear makeup, but remind them that who they are on the inside matters more than what they look like on the outside. Instead of focusing on their appearance, help your child build skills, pursue their passions, and praise their effort when they try something difficult. [5] X Research source Most of all, model body confidence by speaking positively about your own features. [6] X Research source Praise your child’s effort and choices by saying something like, “I can see how much work you put into folding your clothes, and I love that you picked out a shirt that shows off your personality.” Instead of criticizing yourself in front of your child, model positive body image. For example, say something like, “I love my legs and hips because they’re strong enough to pick you up and carry you! I love my smile wrinkles because they remind me how often you make me smile and laugh.”"
    },
    {
      "title": "From a health standpoint, the right makeup is fine for kids’ skin.",
      "content": "From a health standpoint, the right makeup is fine for kids’ skin. [7] X Research source Just be sure to research ingredients before using new products so you can make sure they don’t contain kohl, talc, BHA (butylated hydroxyanisole), urea, sulfates and phthalates. Those chemicals may cause irritation and increased risk of cancer. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use makeup as an opportunity to get kids to wear products with SPF and learn about healthy hygiene practices."
    },
    {
      "title": "Makeup is fine from a psychological standpoint for most kids.",
      "content": "Makeup is fine from a psychological standpoint for most kids. You might worry makeup will cause kids to focus too much on appearance. Even though it’s tempting to adopt an “all-or-nothing” stance on whether makeup is good or bad, demonstrate having an open mind about makeup. That way, you avoid reinforcing excessive focus on appearance and sending the message that looking one specific way or another is wrong. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source While makeup use hasn’t been studied in depth for children, some studies find that makeup might boost self-confidence. [10] X Research source If your child begins to express body image issues, start a conversation about how society, digital editing, and social media put huge pressure on people to look an unrealistic way. [11] X Research source Take your child to a counselor or psychologist if you’re concerned about body image issues."
    },
    {
      "title": "Adopt an attitude of non-judgement.",
      "content": "Adopt an attitude of non-judgement. Let your child know you’re there to answer any questions or concerns about makeup. Judging their makeup use might hurt their self-esteem and model negative behavior of scrutinizing others’ appearances. [12] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Try asking about why they'd like to wear makeup, which can start a good conversation! Say something like, \"Can you tell me about why you’re interested in wearing makeup?” If they’re insecure about their appearance, remind your child they don’t need makeup. Say, “I like that you’re using your creativity with makeup, but I just want to remind you that you’re beautiful whether you wear it or not.”"
    },
    {
      "title": "Teach your child about makeup safety and skincare.",
      "content": "Teach your child about makeup safety and skincare. Explain to them how some makeup chemicals (phthalates, parabens) are bad for their health and demonstrate looking at ingredient labels to find chemical names. Describe how oil-free and non-acnegenic products are better choices if your child is prone to clogged pores. [13] X Research source Teach your child to wash their face and remove makeup before bed. [14] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Demonstrate good hygiene habits. Tell your child to wash their hands before applying makeup, throw out old products to prevent infection, and clean their brushes and beauty blenders. Emphasize the importance of not sharing makeup or makeup brushes. [15] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Tell your child to let you know if a certain product makes them feel itchy or if they think they’re having an allergic reaction. Pay attention to their skin so you can spot any issues, too!"
    },
    {
      "title": "Set expectations and boundaries for what types of makeup you’ll allow.",
      "content": "Set expectations and boundaries for what types of makeup you’ll allow. Just as with screen time, curfew, and chores, you’ll have to find rules that feel right for your family. Start by agreeing which products are allowed, but you might also have a conversation about whether certain looks are too mature or inappropriate for your child’s age. [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Check out these sample guidelines for inspiration as you decide what’s right for your child: Let pre-teens and young tweens experiment with tinted moisturizer, light lip tint or gloss, and a brow pencil/pomade. Skip heavy foundation and lipstick for this age group. [17] X Research source Allow 12-13 year olds to use concealer for blemishes, eye shadow, eyeliner, powder for oily skin, and a light coat of mascara. Let teens start wearing heavier coverage foundation, bronzer/highlighter, blush, and lipstick. If your teen wants to go for a bolder look, advise them to go bold with either their eye makeup or their lips–not both. That way it won’t look overdone. [18] X Research source Set the rule that you’ll tell your child when they’re wearing too much makeup. For instance, say, “You can experiment with makeup, but I’m going to tell you if I think it’s too much before you leave the house. After that, I’ll leave it up to you to decide whether you want to take it off, and I trust you to make a good choice.”"
    },
    {
      "title": "Start the conversation in a straightforward way.",
      "content": "Start the conversation in a straightforward way. Tell your parents you want to wear makeup , and ask for their opinion on it. It might feel scary to ask for something, but even if they say “no,” it probably won’t be “no” forever! You might be able to reach a compromise. [19] X Research source “Mom, I’d like to talk to you about wearing makeup. Is now a good time to talk?” “Dad, I’m interested in wearing makeup. How do you feel about that?”"
    },
    {
      "title": "Tell them why you’re interested in makeup.",
      "content": "Tell them why you’re interested in makeup. You may feel like makeup lets you be creative or express yourself. You might feel a little self-conscious about your skin (even though we bet your skin is beautiful the way it is). Or you might just want to try something new! Being honest about your feelings behind makeup can help your family understand your point of view. [20] X Research source “You know I like art. I like to think of makeup as just another form of art.” “I think wearing makeup might boost my self-confidence.” [21] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Act mature when you ask.",
      "content": "Act mature when you ask. Show your parents you can handle something more on the adult side, like makeup, by asking without whining or complaining. If they give you a serious “no,” even though that might feel super frustrating, accept it for the time being, and know that they might change their mind in the future! [22] X Research source If you disagree, say, “I have a different perspective on that. I think…” To let your parents know you hear them, say, “I can see your point of view…” or “I understand what you’re saying is…”"
    },
    {
      "title": "Go for a “less is more” approach if you’re not sure where to start.",
      "content": "Go for a “less is more” approach if you’re not sure where to start. That way you’ll get the basics of applying makeup figured out, and your parents might feel more comfortable with subtle makeup. Then, as you get older or decide you want to experiment with other looks, you can try out bolder makeup. [23] X Research source Instead of foundation, try a tinted moisturizer with SPF to protect your skin and smooth out your skin tone. Make sure to still wear sunscreen that has at least SPF 30 if you’re going to be outside or in the sun. [24] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Try out a light lip gloss or a lip tint that can double as blush. [25] X Research source Use an eyelash curler to add a bit of flair to your lashes without having to deal with mascara or eyeliner. [26] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source Reader Poll: We asked 1209 wikiHow readers if they believe that makeup is required to look great, and 66% of them said no . [Take Poll] You heard it here first—even though makeup can make you feel and look awesome, you can also be a stunner with just your natural beauty."
    }
  ]
}