{
  "url": "https://www.wikihow.com/Take-Glucosamine-Supplements",
  "title": "How to Take Glucosamine Supplements",
  "steps": [
    {
      "title": "Ask your doctor if you are a candidate.",
      "content": "Ask your doctor if you are a candidate. Glucosamine may be effective in reducing pain caused by a number of different conditions. However, you should talk to your doctor before you start taking supplements to find out if they would be beneficial for you. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source For example, you might say \"Since my diagnosis of osteoarthritis, I've been reading a lot about glucosamine supplements as a possible treatment. Can you tell me about any risks and benefits to taking glucosamine supplements for me?\" Keep in mind that there haven't been extensive studies on the effects of glucosamine supplements on many conditions. For this reason, your doctor may decide the potential benefit to you isn't worth the risk of trying them. There may be little benefit to taking glucosamine unless you have been diagnosed with a specific condition. For example, if you want to take glucosamine to treat your back pain, you generally should have a diagnosis of osteoarthritis. Absent a diagnosis, your doctor should rule out other causes for your back pain before you try supplements. [3] X Research source You also will want to talk to your doctor about the potential benefit. Most studies have shown only a modest improvement of symptoms in patients taking glucosamine supplements, so you may decide that such a small benefit is not worth the cost of the supplements. [4] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source"
    },
    {
      "title": "Identify conditions that glucosamine could worsen.",
      "content": "Identify conditions that glucosamine could worsen. While glucosamine supplements typically are safe for most adults, they can cause problems if you have certain other medical conditions such as diabetes. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you have diabetes, you may want to avoid glucosamine. It can adversely affect your insulin resistance and your blood-sugar levels. Another thing to keep in mind is that since glucosamine is harvested from shellfish, you shouldn't take these supplements if you are allergic to shellfish. Children under 18 should not take glucosamine supplements, which means you also shouldn't take glucosamine supplements if you are pregnant or planning to become pregnant. Glucosamine supplements also can interfere with drugs you're already taking to treat particular conditions such as depression or high blood pressure. Discuss this with your doctor in light of all medications you currently take, even those you only take on an as-needed basis. For example, you might say \"If I take glucosamine supplements, will it cause more bleeding or bruising than I'm currently experiencing? I've read that glucosamine can increase bleeding in people like me who are taking warfarin.\""
    },
    {
      "title": "Determine whether you are at a heightened risk for other conditions.",
      "content": "Determine whether you are at a heightened risk for other conditions. Glucosamine supplements may increase your risk of certain medical conditions such as heart disease or bleeding disorders. Ask your doctor about any conditions that you personally may be susceptible to if you take glucosamine supplements. [6] X Research source For example, if you are already at an increased risk for heart disease, your doctor may advise against prolonged use of glucosamine. The supplements may cause heart palpitations or other irregularities. If you have dry eyes or an increased risk of cataracts, glucosamine supplements may further increase this risk or cause cataracts to develop. Your regular doctor may not know about your eye health. If your ophthalmologist has told you that you are at risk for cataracts, let your regular doctor know. For example, you might say \"My ophthalmologist told me I was at risk for cataracts, and I've heard taking glucosamine supplements can increase that risk. Would you still recommend I try the supplements to treat my osteoarthritis, or should I talk to my ophthalmologist first?\" Since glucosamine supplements can increase the risk of bleeding, first tell your doctor if you have a bleeding disorder or are currently taking drugs such as warfarin that increase your risk of bleeding. [7] X Research source"
    },
    {
      "title": "Research manufacturers thoroughly.",
      "content": "Research manufacturers thoroughly. In the U.S. and many other countries, nutritional supplements aren't regulated by the government like other drugs are. This means you must take care to evaluate the brand of supplements you're taking. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Focus on major brands that have strong reputations in the industry, particularly pharmaceutical companies that manufacture prescription drugs as well as nutritional supplements. Read information and articles about the manufacturer from reputable, unbiased sources. You also can search the internet for any complaints, recalls, or other customer satisfaction incidents that may have occurred. If you are allergic to shellfish but still want to try glucosamine supplements, look for specific manufacturers such as Schiff or Weider Nutrition Group which contain lower levels of shrimp allergens and may be safe for consumption by people who are allergic."
    },
    {
      "title": "Ask your doctor or pharmacist for a recommendation.",
      "content": "Ask your doctor or pharmacist for a recommendation. Given the lack of regulation of nutritional supplements, rely on someone with education and experience about the brands and types of supplements available to help you choose the right ones. [9] X Research source If your doctor knows of a particular brand that has been used by many patients – particularly patients similar to you – they can recommend that brand based on experience and tell you more about the benefits you're likely to achieve, as well as your potential side effects. Keep in mind that your doctor is likely to recommend a brand-name product that may be more expensive than other supplements that are available. They aren't trying to make you spend more money – they are recommending a brand that typically is more trusted by healthcare professionals."
    },
    {
      "title": "Choose the correct type of glucosamine for your particular condition.",
      "content": "Choose the correct type of glucosamine for your particular condition. Glucosamine generally is available alone, as glucosamine hydrochloride, or as glucosamine sulfate. Discuss which is best to take with your doctor. [10] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source For example, glucosamine hydrochloride is recommended to treat bone disease, while glucosamine sulfate is recommended for high cholesterol. Health care professionals specifically advise against using certain types of glucosamine for specific conditions. For example, the American Academy of Orthopaedic Surgeons advises against glucosamine sulfate and glucosamine hydrochloride for symptomatic knee osteoarthritis. If you do decide to take glucosamine sulfate or glucosamine hydrochloride for knee osteoarthritis, it is recommended that you take relatively low doses of 300-500 milligrams three times a day, and only take it for 12 weeks at the most."
    },
    {
      "title": "Opt for a third-party verified product.",
      "content": "Opt for a third-party verified product. With higher quality, you are more likely to notice benefits. The Food and Drug Administration (FDA) doesn’t regulate for content, purity, labeling, or claims, so you’re best off if you and your doctor choose a supplement that has been verified by a third party, such as The United States Pharmacopeia (USP). [11] X Research source If you take the supplements for a month or two and notice an improvement in your pain or joint function, ask your doctor about switching to a different brand to see if those benefits continue. Allow two months before you decide glucosamine isn't doing anything for you and discontinue taking the supplements. Take extra caution switching brands if you're allergic to shellfish, or have other medical conditions. You may want to consult your doctor before you move to a cheaper manufacturer."
    },
    {
      "title": "Take your supplements with food and as instructed on the label.",
      "content": "Take your supplements with food and as instructed on the label. The most common side effects of oral glucosamine supplements are gastrointestinal symptoms such as heartburn and nausea. These side effects typically are reduced or eliminated by taking your supplements with food. [12] X Research source Since dosage recommendations often involve taking the supplement three times a day, you can easily take it after eating breakfast, lunch, and dinner. If you're only taking glucosamine supplements once a day, it’s usually best to take them in the middle of the day after eating lunch, unless your doctor recommends otherwise."
    },
    {
      "title": "Follow the accepted daily dosages based on body weight.",
      "content": "Follow the accepted daily dosages based on body weight. Even though supplements aren't regulated, there is general agreement regarding the amount of glucosamine that is appropriate for an adult based on their body weight. [13] X Research source For example, if you're taking glucosamine sulfate supplements, you should take no more than 1,000 milligrams daily if you weigh under 100 pounds. if you weigh more than 100 pounds, you can safely take up to 1,500 milligrams. However, you should consult your doctor if you weigh over 200 pounds or are categorized as obese. Talk to your doctor about whether you should space these dosages out over the course of the day, or take the entire dosage once a day. The total dosage may differ depending on whether you are taking glucosamine, glucosamine sulfate, or glucosamine hydrochloride. For example, 1,500 milligrams of glucosamine sulfate is roughly equivalent to 1,200 milligrams of glucosamine, while 750 milligrams of glucosamine hydrochloride is about 625 milligrams of glucosamine."
    },
    {
      "title": "Augment the recommended daily dosage.",
      "content": "Augment the recommended daily dosage. Some dosage other than what is listed on the bottle may be recommended by your doctor for the treatment of certain conditions, or depending on other medications you're taking. [14] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source For example, if you're treating general osteoarthritis, your doctor may instruct you to take between 1,000 and 2,000 milligrams of glucosamine daily for up to 18 months. However, for knee osteoarthritis usually requires a divided daily dosage that’s only between 300 and 500 milligrams three times a day. When getting glucosamine injected, you generally get a much lower dose than you would if you took supplements by mouth."
    },
    {
      "title": "Use caution when taking glucosamine over a long period of time.",
      "content": "Use caution when taking glucosamine over a long period of time. Even at the recommended doses, glucosamine supplements may cause complications if you take them for longer than six months. At the same time, keep in mind that you may need to take glucosamine supplements for at least a month before you realize the full benefit of the substance. After four to six weeks, if you don't notice any improvement in your condition you may want to talk to your doctor about discontinuing your supplements. The length of time you should take glucosamine supplements depends on the condition for which you are taking them. However, you generally shouldn't take glucosamine supplements for more than six months unless directed to do so by your doctor. Osteoarthritis is an exception to the six-month rule. For general osteoarthritis, your doctor may have you take oral glucosamine supplements for up to 18 months."
    },
    {
      "title": "Monitor conditions likely to be affected by glucosamine supplements.",
      "content": "Monitor conditions likely to be affected by glucosamine supplements. If you have a medical condition such as asthma, high blood pressure, or a bleeding disorder, watch these carefully and see your doctor about discontinuation if you have any changes. [15] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source For example, if you have problems with blood pressure or are at risk of heart disease, you should check your blood pressure daily while you are taking glucosamine supplements. A wide range of gastrointestinal problems are associated with taking glucosamine supplements. If you have heartburn, gas, nausea, indigestion, upset stomach, or similar problems that become unbearable, you may want see your doctor about discontinuing glucosamine supplements."
    }
  ]
}