{
  "url": "https://www.wikihow.com/Test-Fuses-with-a-Test-Light",
  "title": "How to Test Fuses with a Test Light",
  "steps": [
    {
      "title": "Find your vehicle’s fuse box panel and remove the panel’s cover.",
      "content": "Find your vehicle’s fuse box panel and remove the panel’s cover. The fuse box panel is usually located under the hood, underneath or on the side of the dash, in the glovebox, or in the trunk. The fuse box panel is a panel with different colored and numbered fuses. Pry the plastic cover off once you find the panel. [1] X Research source Different vehicles have fuse box panels in different places. Read your owner’s manual or search online if you can’t find the fuse box panel in your vehicle. Note that some vehicles may have multiple fuse boxes."
    },
    {
      "title": "Ground the test light’s clip or clamp on a grounded metal surface.",
      "content": "Ground the test light’s clip or clamp on a grounded metal surface. Squeeze the clip or clamp to open it up and place it over the car battery’s negative terminal, a bolt, or another nearby, unpainted metal surface on the vehicle. The test light must be grounded for it to work. [2] X Research source What you ground the test light to depends on where the fuse box panel is located. For example, if it is located underneath the dash, the test light cable won’t reach the car’s battery. However, you could find a nearby bolt on the car door hinge. Any unpainted piece of metal on the vehicle will work to ground the test light. For instance, it could be a part of the metal frame under the hood or a nut or bolt on the engine block."
    },
    {
      "title": "Poke the tip of the test light’s probe into 1 of the holes on a fuse to test it.",
      "content": "Poke the tip of the test light’s probe into 1 of the holes on a fuse to test it. Pick a fuse that you want to test. Hold the test light by the handle and stick the pointy metal tip of the probe into 1 of the 2 round or square holes on the fuse. [3] X Research source Note that you don’t need to have your vehicle or any of its accessories powered on to test a fuse and you don’t have to pull out the fuses to test them."
    },
    {
      "title": "Wait for the test light to light up to determine whether a fuse is working.",
      "content": "Wait for the test light to light up to determine whether a fuse is working. The test light will light up right away when you poke the probe into a working fuse. The fuse is likely blown if the test light doesn’t light up. [4] X Research source If you find a blown fuse, you can just pull it out with your fingers or a pair of pliers and replace it with a new fuse to fix the issue."
    },
    {
      "title": "Test the second hole on the fuse.",
      "content": "Test the second hole on the fuse. Stick the metal tip of the probe into the other hole. Watch for the test light to go on to verify that the fuse is fully functional. [5] X Research source The 2 holes on each fuse are for testing the power in and the power out, so make sure to check both the holes to ensure the fuse is working 100%. If only 1 of the holes lights up the test light, the fuse is probably blown."
    },
    {
      "title": "Turn off any electronics in the area that you are testing the fuse for.",
      "content": "Turn off any electronics in the area that you are testing the fuse for. Turn off all the lights and unplug any electrical appliances from outlets in the room that you want to test the fuse for. This will help avoid electrical surges. [6] X Research source For example, if you’re testing the fuse that supplies power to the bathroom, turn off all the bathroom lights and unplug things like hair dryers from the outlets."
    },
    {
      "title": "Make sure the fuse you want to test is in the “on” position.",
      "content": "Make sure the fuse you want to test is in the “on” position. Open up your breaker box and locate the switch for the fuse you want to test. Flip the fuse switch on if it is off or partially off. [7] X Research source Your breaker box probably has a list of the breakers and the areas of the home that they correspond to, or it might have labels right next to the breaker switches themselves. Breaker boxes are usually located in a basement, garage, utility closet or kitchen. Some homes may have them in different places. If you aren’t sure where yours is, just look around for a panel on a wall that you can open up."
    },
    {
      "title": "Clip the test light’s clip onto the bare metal of the breaker box.",
      "content": "Clip the test light’s clip onto the bare metal of the breaker box. Squeeze the test light’s alligator clip or clamp to open it up, then clip it onto a piece of bare metal on the breaker box that surrounds the fuse panel. [8] X Research source Some fuse panels have a grounding screw that you can attach the clip to. This screw is usually located just above the main breaker. If you aren’t sure, just stick to grounding the clip on the surrounding metal box."
    },
    {
      "title": "Touch the test light’s probe to the fuse’s screw.",
      "content": "Touch the test light’s probe to the fuse’s screw. Look for the exposed screw to the left or right of the breaker switch you want to test. Hold your test light by the handle and touch the pointy metal tip of the probe to the fuse’s screw. [9] X Research source Each breaker switch has 1 corresponding screw that attaches the wires to the switch, so it should be very clear which screw you need to touch to test each breaker."
    },
    {
      "title": "Watch to see if the test light turns on to find out if the fuse works.",
      "content": "Watch to see if the test light turns on to find out if the fuse works. The test light will light up immediately if the fuse is working properly. The fuse is likely bad if the test light does not turn on. [10] X Research source If a breaker switch flips off before you can test it or while you’re testing it, and there is no electricity being used in the room you’re testing that fuse for, there could be a wiring problem. If this happens, contact a licensed electrician to come and check your wiring out and troubleshoot the issue."
    },
    {
      "title": "Connect the test light’s clip or clamp to a metal surface to ground it.",
      "content": "Connect the test light’s clip or clamp to a metal surface to ground it. Any metal surface on the car or the car battery’s negative terminal will work for this. Squeeze the clip or clamp open and slide it onto the ground source, then release the clip or clamp to secure it in place. [11] X Research source You can buy a test light online for as little as $10 USD. You could also purchase one at an auto supply shop or home improvement center."
    },
    {
      "title": "Touch the tip of the test light’s probe to a positive power source.",
      "content": "Touch the tip of the test light’s probe to a positive power source. The probe is the metal needle at the end of the cable that has the handle. Hold the test light by the handle and touch the end of this needle against the car battery’s positive terminal or any other positive power source. [12] X Research source You could use any positive battery cable or a fuse that you know is working for this."
    },
    {
      "title": "Watch for the test light to light up to see if it is working.",
      "content": "Watch for the test light to light up to see if it is working. The test light will light up as soon as you touch the probe to the power source. Proceed with testing your fuses once you are sure that your test light is working properly. [13] X Research source If the test light doesn’t light up, double-check that it is grounded or try a different power source. If it still doesn’t light up after testing it again, you may need to replace it."
    }
  ]
}