{
  "url": "https://www.wikihow.com/Store-Apple-Cider-Vinegar",
  "title": "How to Store Apple Cider Vinegar",
  "steps": [
    {
      "title": "Screw the cap on tight.",
      "content": "Screw the cap on tight. Vinegar is a food that doesn't really go bad, per se. However, if you leave the cap open, bacteria and even bugs can get into it, so make sure you have the cap on tight before storage. [1] X Research source"
    },
    {
      "title": "Keep the vinegar out of direct sunlight.",
      "content": "Keep the vinegar out of direct sunlight. Stick your vinegar somewhere the sun can't reach to help it retain its quality. Your pantry or cupboard is a good place to store it. If you prefer to store the vinegar on the counter, pour it into a sterile, dark glass bottle to protect it from sunlight. [2] X Research source"
    },
    {
      "title": "Pick a cool place to store your vinegar.",
      "content": "Pick a cool place to store your vinegar. Vinegar is sensitive to heat, so try not to store it near the stove or the warm side of the fridge. Pick a cooler area if possible, such as in the pantry, away from any heat source. [3] X Research source Basically, you want to store vinegar on the cool side of room temperature."
    },
    {
      "title": "Don't dilute the vinegar.",
      "content": "Don't dilute the vinegar. The reason apple cider vinegar doesn't go bad is the acidity level keeps bad bacteria from growing. However, if you dilute it, you're decreasing the acidity level, and it won't be shelf stable. You can keep diluted apple cider vinegar in the refrigerator if you must dilute it. [4] X Research source"
    },
    {
      "title": "Don't worry about cloudiness.",
      "content": "Don't worry about cloudiness. Vinegar naturally gets cloudy over time. However, the cloudiness doesn't mean it's gone bad. The cloudiness just comes from a naturally occurring fiber in the vinegar. However, if you don't like the look of it, you can filter out the cloudiness and keep your vinegar in the fridge to prevent cloudiness in the future. To filter out cloudiness, run the vinegar through a piece of clean muslin or even just a coffee filter."
    },
    {
      "title": "Use the expiration date as a guide, not a rule.",
      "content": "Use the expiration date as a guide, not a rule. The expiration date on apple cider vinegar mainly tells you when the vinegar is getting past its peak quality. It can be safely used for many years afterwards, so you don't need to throw it away unless you've noticed a decrease in flavor. Some manufacturers just use a bottling date, and they suggest it's at its peak for another 5 years after this date."
    },
    {
      "title": "Notice changes in the vinegar's smell.",
      "content": "Notice changes in the vinegar's smell. It's rare for apple cider vinegar to go bad, but you may notice a change in the smell or taste. For instance, you may notice that it doesn't smell as acidic or vinegary. While it probably hasn't gone bad, it may not be at its peak. [5] X Research source If your vinegar smells bad, go ahead and toss it."
    },
    {
      "title": "Pay attention to changes in the vinegar's appearance.",
      "content": "Pay attention to changes in the vinegar's appearance. Watch for a change in color, as that could indicate a quality change. If you notice bulging sides or you hear gas escaping when you open the bottle, that's also a sign you should probably toss it. Some sediment is fine, as it's just the build of the fiber in vinegar. You can filter it out if you want. However, excessive amounts of sediment could indicate the vinegar is changing, and you should probably toss it. [6] X Research source If you're creating homemade vinegar, you should toss the batch if you notice mold on the top during the fermentation process."
    },
    {
      "title": "Note changes in the vinegar's taste.",
      "content": "Note changes in the vinegar's taste. If the vinegar just doesn't taste as strong, it's likely still fine. If it tastes off or more acidic, it may be going bad, and you should get a new bottle. [7] X Research source"
    }
  ]
}