{
  "url": "https://www.wikihow.com/Stop-a-Dry-Cough",
  "title": "How to Stop a Dry Cough",
  "steps": [
    {
      "title": "Get plenty of rest.",
      "content": "Get plenty of rest. [2] X Research source While many people tend to push through an illness, you will get over a dry cough quicker if you allow yourself to rest and rejuvenate. If you push yourself, you are also likely to infect friends, family and co-workers, as well as risk becoming worse by running down your immune system. It can be tough, but if you need to, take a day off from work. Keep your kids home from school as well. Their teacher and all the other parents will appreciate it! Viruses are often spread through droplets sprayed by coughing. Make sure you or your child always cover your mouth when you cough. Try to cough into the crook of your elbow and wash your hands immediately if you cough into them."
    },
    {
      "title": "Keep the air humidified.",
      "content": "Keep the air humidified. Use a vaporizer or take hot, steamy showers. You can also leave bowls of water around your house, especially near sources of heat, so that the water evaporates into the air."
    },
    {
      "title": "Drink lots of warm fluids.",
      "content": "Drink lots of warm fluids. Drink water, water, and then more water. You can add honey and lemon (another source of Vitamin C), and warm up the water. Other fluids can include tea, juices, and clear chicken or vegetable broths. While you should try to keep hydrated at all times, it's even more important when you have a cold. If you have a dry cough, you want to moisturize that cough. At a minimum, try to drink eight to 10 8-ounce glasses of water a day. Try drinking green tea, as it contains antioxidants."
    },
    {
      "title": "Eat small, nutritious meals.",
      "content": "Eat small, nutritious meals. Try to eat small amounts of easily digestible food. Avoid greasy and heavy foods. You want to give your immune system enough energy to fight off the illness, so you will need to eat these meals frequently. Include quality protein, such as fish and skinless poultry, as well as complex carbohydrates. Some good foods to eat when you are sick include: Hot cereal, such as oatmeal: Adding a pinch of cayenne pepper can help break up the mucus and increase drainage. Yogurt: The active bacterial cultures can boost your gut bacteria and boost your immune system at the same time. Foods rich in Vitamin C and antioxidants: Foods that have high levels of Vitamin C include red peppers, oranges, berries (like blueberries, strawberries, raspberries) and leafy green vegetables. Foods rich in beta-carotene and Vitamin A: These include any yellow or orange food, including carrots, squash and sweet potatoes. Chicken soup: Keep it light with brown rice and a few easily digestible vegetables, such as spinach, peas, carrots, celery, or summer squash."
    },
    {
      "title": "Gargle with warm salt water if your throat hurts.",
      "content": "Gargle with warm salt water if your throat hurts. Salt water will have little effect on your cough, but it can soothe a sore throat, which may accompany a cough. Add 1 teaspoon of salt (table salt or sea salt both work fine) to about 6-ounces of warm water. Stir to dissolve the salt and then gargle with it. Don’t swallow! Just gargle and spit it out. The salt water does at least two things: First, the salt helps reduce any swelling in your throat, making a cough less likely. Second, the sea salt can help supply various minerals that can be useful for the immune system (zinc, selenium, magnesium)."
    },
    {
      "title": "Consider letting your cough run its course.",
      "content": "Consider letting your cough run its course. Coughing is the body’s natural way of literally getting rid of the virus or other pathogen. Coughing also gets rid of the phlegm (mucus) that builds up during an infection or as a reaction to an irritant. So, it is generally best not to suppress a cough and to let your body get rid of the virus and fluids that are making your life miserable. On the other hand, the reality is that coughing can really affect your well-being. In some cases, coughing won’t let you sleep and causes it to hurt when you breathe. If this is the case, it's probably a good time to consider a cough suppressant."
    },
    {
      "title": "Take an over-the-counter cough suppressant.",
      "content": "Take an over-the-counter cough suppressant. Use cough drops, hard candies, or throat sprays to ease a dry cough. These can be found at any local pharmacy or drugstore and are usually very effective for less-serious coughs."
    },
    {
      "title": "Determine the cause of your cough to narrow possible treatments.",
      "content": "Determine the cause of your cough to narrow possible treatments. A dry, non-productive cough is most commonly associated with irritations in the throat. These are mostly minor, but can be very annoying. A dry cough can also be due to: Inhaling an environmental irritant. Certain medications: Angiotensin-converting enzyme (ACE) inhibitors and Beta-blockers in particular. Both ACE inhibitors and Beta-blockers are prescribed to treat high blood pressure and some heart diseases. Some disorders including Gastroesophageal Reflux Disease (GERD), tuberculosis, viral infections and congestive heart failure. Smoking. Post-nasal drip irritating the throat and causing a reflex cough. Allergies. Asthma, especially in children. Chronic bronchitis."
    },
    {
      "title": "Get your medication changed.",
      "content": "Get your medication changed. If you are on an ACE inhibitor or other medication that you suspect is the reason for your cough, speak to your physician about changing the medication or the dosage. That may be sufficient to eliminate the cough. For other causes of a cough, make sure you have a proper diagnosis and are being treated for the underlying disorder. If the cough does not disappear after that, you may need to get a second opinion about the specific cause of your cough."
    },
    {
      "title": "Get immediate medical care if you have severe symptoms.",
      "content": "Get immediate medical care if you have severe symptoms. If you don’t get any relief after several weeks or if you experience any of the \"red flag\" symptoms, call your physician for an appointment. Symptoms that are red flags and require immediate medical care include: If you or your child are coughing up thick, greenish-yellow phlegm. If you or your child are wheezing, or there is a whistling sound at the beginning or end of your breath. If you or your child experience any odd sounding coughs and have difficulty catching your breath, especially at the end of a cough. If you or your child experience a fever of more than 100.4°F (38°C). If you or your child experience any shortness of breath. If you or your child have a whooping cough. Whooping cough has been on the rise, likely because of decreased immunization rates and the appearance of new bacterial strains. It is characterized by fits of uncontrolled, violent coughs making it very hard to breathe. The deep breaths that follow a fit of coughing often sound like a “whoop.” This is a highly contagious disease that can be prevented and treated. Early treatment is very important. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Eat honey to calm your cough.",
      "content": "Eat honey to calm your cough. Honey has both antibacterial and antiviral properties. In fact, honey is better at soothing coughs than dextromethorphan, a commercial cough suppressant. [4] X Research source Viuda-Martos, M., Ruiz-Navajas, Y., Fernandex-Lopez, J., Perez-Alvarez, JA. Functional Properties of Honey, Propolis and Royal Jelly. J Food Sicence; 73 (9) R117-R124, 2008. Do not give honey to any child under one year old. There is a very small risk of getting infant botulism from the bacterial toxins sometimes found in honey. Infants have an immature immune system though, and being exposed to botulism could cause a fatal outcome. Medicinal honey (Manuka honey from New Zealand is recommended) can help soothe a cough but any organic honey will have antibacterial and antiviral properties."
    },
    {
      "title": "Take a combination of honey and lemon.",
      "content": "Take a combination of honey and lemon. Lemon should be added to honey for cough treatment because lemon juice contains high levels of Vitamin C. The juice of one lemon contains 51% of the daily Vitamin C requirement. Lemon juice also has antibacterial and antiviral properties. To take honey and lemon, gently warm up one cup of honey in a small saucepan. Add 3–4 tablespoons of freshly squeezed lemon juice, 4–5 tablespoons of bottled lemon juice, or a whole lemon, cut into thin slices. Heat over a low flame for 10 minutes and stir constantly until the mixture is warm and the lemons (if you used them) are broken up. Add ¼ to ⅓ cup of water to the honey-lemon mixture and stir. Take 1–2 tablespoons as needed. Refrigerate the mixture."
    },
    {
      "title": "Use a mixture of honey, lemon, and garlic.",
      "content": "Use a mixture of honey, lemon, and garlic. This recipe may work better for adults and children who enjoy garlic. Garlic has antibacterial, antiviral, antiparasitic and antifungal properties. Combine one cup of honey and one lemon, finely sliced in a small saucepan. Peel two to three cloves of garlic and chop them as finely as possible. Add this to the honey-lemon mixture. Heat on low flame for about 10 minutes. Stir in ¼ to ⅓ cup of water to the honey-lemon mixture. Keep heating briefly over the low flame. Take 1–2 tablespoons as needed and keep the mixture in your refrigerator."
    },
    {
      "title": "Make a mixture of honey, lemon juice, and ginger.",
      "content": "Make a mixture of honey, lemon juice, and ginger. Ginger is often used to improve digestion and to treat nausea and vomiting, but it is also used as an expectorant. It thins out mucus and phlegm and is a bronchial relaxant. This means that the urge to cough can be decreased by taking ginger."
    },
    {
      "title": "Combine one cup honey and one thinly sliced lemon in a small saucepan.",
      "content": "Combine one cup honey and one thinly sliced lemon in a small saucepan. Cut and peel about 1.5 inches of fresh ginger root. Finely grate it and add it to the honey-lemon mixture. Heat this honey, lemon, and ginger mixture over low flame for about 10 minutes. Then add ¼ to ⅓ cup of water to this mixture and stir in while heating over the low flame. Take 1–2 tablespoons as needed and refrigerate the remaining mixture. Allow the mixture to cool before taking it to avoid burning your mouth."
    },
    {
      "title": "Substitute glycerin for honey.",
      "content": "Substitute glycerin for honey. If you don’t have, don’t like, or can’t use honey, substitute glycerin. You should get natural glycerin (not the synthetic or man-made form). Use ½ cup of glycerin instead of one cup honey in the recipes provided. Glycerin has a “generally recognized as safe” (GRAS) status with the FDA. [5] X Research source Pure glycerin is a colorless and somewhat sweet vegetable product that is used to make all sorts of indigestible products and personal care products. Because it takes up water, it can be helpful in small amounts to reduce any swelling in the throat. Be aware that glycerin is used to treat constipation, so if diarrhea becomes a problem, reduce the amount of glycerin used. Prolonged and excessive ingestion of glycerin can increase blood sugar and blood fat levels."
    },
    {
      "title": "Take peppermint.",
      "content": "Take peppermint. Peppermint is considered safe for both children and adults. Peppermint can be used as a tea. Put 1–2 teaspoons of dried herb in 1 cup of boiled water and brew for two to four minutes. Peppermint can also be used as a steam treatment. To use as a steam treatment, add 1–2 teaspoons of dried herb to 2 cups of boiled water in a bowl. Being careful to avoid scalding, place your face over the bowl of water (make sure there is at least a distance of 12 inches between your face and the water), cover the back of your head with a towel, and breathe the fumes in through your nose and mouth. As with all herbs, there is a chance you can have an allergic reaction. Try a small amount of tea or steam first and wait 30 minutes. If there is no reaction, you can proceed."
    },
    {
      "title": "Use marshmallow root.",
      "content": "Use marshmallow root. Marshmallow root is not the soft, spongy candy but, like the candy, it is considered safe for both children and adults. It is also known as Althaea officinalis and has been used for centuries as a cough suppressant. In herbal medicine, it is known as a demulcent, which is a herb that relieves irritation, usually by decreasing inflammation. Like peppermint, marshmallow root can be used as a tea or a steam treatment. To make marshmallow root tea place 1–2 teaspoons of dried herb in 1 cup of boiled water. Brew for a few minutes and then remove the herb. Sweeten with honey if desired. Because there is a small risk of allergy as with all herbs, try a small amount of tea first and wait 30 minutes. If there is no reaction, you can proceed."
    },
    {
      "title": "Add thyme to your tea.",
      "content": "Add thyme to your tea. Thyme has been traditionally used as a cough suppressant and for sore throats. It is considered safe for both children and adults and can be used as a steam treatment as well."
    },
    {
      "title": "Eat ginger root.",
      "content": "Eat ginger root. Ginger root has also been used for centuries as a cough suppressant and to increase salivation, which can relieve a dry throat. The easiest way to use ginger is to cut off a small, quarter-sized slice of fresh ginger root and simply chew it. If the taste of ginger is too strong, try making a ginger tea or ginger steam. Ginger root is considered safe for both children and adults"
    },
    {
      "title": "Drink turmeric milk.",
      "content": "Drink turmeric milk. Turmeric milk is a traditional treatment for a cough. [6] X Research source Mix ½ teaspoon of turmeric in one glass of warm milk. If you don’t like milk, try soy or almond milk."
    },
    {
      "title": "Take a combination of fish oil and citrus juice.",
      "content": "Take a combination of fish oil and citrus juice. Combine a ½ ounce of fish oil with the juice of one lemon or one orange. They don't mix very well. The fish oil provides Vitamins A, D and E and the citrus provides Vitamin C, all of which can be beneficial in relieving your cough. In addition, the citrus does a pretty good job of covering the fishy taste of the oil. Hold your nose as you drink the fish oil and juice mixture. The perception of taste is based on a number of senses, and if you can’t smell it, the taste won’t be as strong."
    }
  ]
}