{
  "url": "https://www.wikihow.com/Use-a-Trangia-Camping-Stove",
  "title": "How to Setup a Trangia Camping Stove",
  "steps": [
    {
      "title": "Unpack the stove.",
      "content": "Unpack the stove. The stove is packaged to take up as little space as possible. As you take it apart, remember how each piece fits together so you can put it back together after use. [1] X Research source"
    },
    {
      "title": "Find somewhere firm and flat to place the windshield.",
      "content": "Find somewhere firm and flat to place the windshield. Stoves should never be used in your tents, as the fabric that the tents are made from is very flammable. The Trangia comes with a two-piece windshield to keep the flame from going out if it's windy. Place the bottom part of the windshield on the flat surface/ground. [2] X Research source"
    },
    {
      "title": "Assemble the burner.",
      "content": "Assemble the burner. Remove the lid off the brass burner unit and pour in some methylated spirits (denatured alcohol) Never more than 3/4 full!"
    },
    {
      "title": "Replace the lid immediately.",
      "content": "Replace the lid immediately. Put the burner carefully in the centre of the windshield and put the second windshield in place. [3] X Research source"
    },
    {
      "title": "Light a match",
      "content": "Light a match and hold it into the burner. You won't see flames, but you'll feel heat when the spirit begins burning."
    },
    {
      "title": "Add the pan.",
      "content": "Add the pan. Use the handle to place the pan on the metal supports inside the windshield. [4] X Research source"
    },
    {
      "title": "Cook.",
      "content": "Cook. You can now use the stove to boil water, or heat food in the pan or frying pan."
    },
    {
      "title": "Adjust the flame while cooking.",
      "content": "Adjust the flame while cooking. Use the adjustable burner top to control the flame. Always use the handle attachment when putting this in place."
    },
    {
      "title": "Finish cooking.",
      "content": "Finish cooking. Put the closed burner top in place to turn off the stove. The lack of oxygen will cause the methylated spirits to stop burning after just a few seconds. Do not use the burner lid to extinguish the stove, the rubber seal inside the lid is not fireproof and will burn and melt all over your burner. Remove the burner top to make sure the fire has extinguished. Leave the Trangia to cool before packing it away."
    }
  ]
}