{
  "url": "https://www.wikihow.com/Write-a-Letter-Pleading-Not-Guilty",
  "title": "How to Write a Letter Pleading Not Guilty",
  "steps": [
    {
      "title": "Read your ticket carefully.",
      "content": "Read your ticket carefully. Your traffic ticket includes important information regarding your procedural rights and how to respond to the ticket. You may need to go to the court's website or call the clerk's office to get additional information about pleading not guilty. Often the ticket will provide instructions on how to pay it, but you may have to dig a bit deeper to find information on how to fight it. [3] X Research source"
    },
    {
      "title": "Gather information about the incident.",
      "content": "Gather information about the incident. If you have any photos or if there were any witnesses to the incident that led to the traffic citation, you should review that evidence before you make a final decision to plead not guilty. Whether you decide to plead not guilty should depend on how strong your defense is and how likely you think you are to win your case. Avoid pleading not guilty just for the sake of fighting a ticket when you know you have no valid defense – it will only cost you additional time and money. [4] X Research source"
    },
    {
      "title": "Decide how to plead.",
      "content": "Decide how to plead. Due to the costs of pleading not guilty, it's worth reviewing your ticket and your driving record to determine whether it would be easier for you to just pay the ticket. If the ticket is your first offense, you may be eligible to attend traffic school and have the infraction removed from your record after successful completion. Before you decide to fight the traffic ticket, find out if this option is available. [5] X Research source If you aren't eligible for traffic school, or have no interest in attending, pleading guilty to the ticket or simply paying the fine could result in higher insurance premiums and other costs to you. If you have a strong argument that you should not be held liable for the violation, you should consider pleading not guilty and fighting the ticket. [6] X Research source If you got a ticket as a result of your involvement in an accident, you probably should consider consulting an experienced traffic attorney for guidance on how to proceed. Being found guilty after a trial could result in civil liability to the other drivers for damages they suffered in the accident. [7] X Research source Keep in mind that you have the right to plead not guilty, regardless of whether you actually committed the infraction. [8] X Research source When you plead not guilty, you are forcing the state to prove beyond a reasonable doubt that you committed the infraction. If the state doesn't have enough evidence to do this, you cannot be found guilty in a court of law. [9] X Research source"
    },
    {
      "title": "Take note of your deadline.",
      "content": "Take note of your deadline. Typically, your ticket will include a deadline by which you must enter your plea if you intend to plead not guilty. Figure out if the date on your ticket is the date by which you must respond or the date you must appear in traffic court. That first date probably is an arraignment – not the date of the hearing itself – but this varies widely among jurisdictions. [10] X Research source Typically if you want to plead without appearing at arraignment, you must do so several days prior to the date the arraignment or first appearance is scheduled. You may have to go to the court's website or conduct additional research to find out exactly when the court must receive your plea if you want to avoid appearing in court. [11] X Research source"
    },
    {
      "title": "Find out if there's a required form.",
      "content": "Find out if there's a required form. Many jurisdictions have a form you must fill out to notify the traffic court how you intend to plead in response to a traffic ticket. Typically this form will be included with your ticket. If not, you should be able to find it by visiting the traffic court's website or contacting the clerk's office. In some jurisdictions you must send a check for the amount of the fine as bail when you send your letter pleading not guilty. This amount will be returned to you if you win your case. Check with the court's website or call the clerk if you are unsure. [12] X Research source"
    },
    {
      "title": "Draft your letter.",
      "content": "Draft your letter. If no specific form is available for pleading not guilty, you may be able to enter your plea by writing a letter to the court. Keep in mind that if you choose to write a letter pleading not guilty, you typically must also include a statement indicating that you understand you have a right to an arraignment and are waiving that right. [13] X Research source Typically there's no specific format required, and you don't have to indicate or explain your defenses – you simply can state that you plead not guilty, just as you would if you attended an arraignment in person. [14] X Research source Type your letter in standard business format using a basic, legible font such as Helvetica or Times New Roman. Single space your letter with a double-space between paragraphs. Make sure you include accurate contact information in case the clerk needs to contact you regarding your plea. [15] X Research source"
    },
    {
      "title": "Include all required information.",
      "content": "Include all required information. Your traffic ticket may include a list of the information required to accurately process your plea. At a minimum, you should include the date of your traffic ticket and the infraction with which you were charged. If the traffic ticket includes a case or reference number, that number should also be included in your letter for identification purposes. Typically the officer will write your name and address as they appear on your driver's license, but that information may no longer be accurate if, for example, you recently moved or changed your name due to marriage or divorce. Regardless, you should provide your full name and address in your letter as they are listed on the ticket, even if they are incorrect. You may consider making a copy of the front and back of the citation itself and attaching these to your letter."
    },
    {
      "title": "Consider consulting an attorney.",
      "content": "Consider consulting an attorney. Depending on the seriousness of the offense, you may want to discuss your plea with an experienced traffic attorney. It is especially important that you consult an attorney if you received the ticket as a result of your involvement in an accident. Your decision may affect your civil liability for damages incurred by other drivers. [16] X Research source"
    },
    {
      "title": "Submit your letter.",
      "content": "Submit your letter. Once you're satisfied that you've included everything necessary, you can submit your letter pleading not guilty to the traffic court. Before you mail your letter to the court, make a copy of the letter you've written as well as any attachments, so you have it for your own records. You should be able to find the address and department to which your letter should be mailed on your traffic ticket. If the information isn't there, you may have to call the clerk of court to find out where to mail your letter. [17] X Research source You might consider sending your letter using certified mail with returned receipt requested, just so you know when the court has received your letter. This could be essential evidence later on if the court tries to say that the deadline had already passed before your letter was received."
    },
    {
      "title": "Find out if a trial by declaration is allowed in your jurisdiction.",
      "content": "Find out if a trial by declaration is allowed in your jurisdiction. Some jurisdictions allow you to mail in a written statement rather than appearing in court for a trial. Even if trial by declaration isn't specifically allowed in your jurisdiction, the judge may permit it anyway to save court time and resources. If you can't find any information about it, you can always ask the clerk if the option is available. [18] X Research source A trial by declaration is especially beneficial if you got your ticket in another state or a location far away from where you live, because it saves you the time and costs necessary to appear in court and fight the ticket. [19] X Research source Even if the jurisdiction has a procedure in place for a trial by declaration, this option may not be available for certain infractions. For example, Oregon does not allow a trial by declaration for photo radar or red light tickets, speed racing, or reckless driving with accident or injury. [20] X Research source"
    },
    {
      "title": "Submit your request.",
      "content": "Submit your request. Typically you must request a trial by declaration or affidavit in advance of the date your trial is scheduled. When you submit your request, you also may be required to pay the amount of the fine as a bail. If you win your case you'll get this money back. [21] X Research source [22] X Research source By requesting a trial by declaration, you waive your right to appear, to testify in person, and to subpoena witnesses. [23] X Research source"
    },
    {
      "title": "Prepare your evidence.",
      "content": "Prepare your evidence. Before you complete your declaration or affidavit, organize the evidence you want to present that supports your argument that you are not guilty of the offense for which you received the ticket. Keep in mind that if you request a trial by declaration, the officer who issued the ticket in your case will have to present written testimony as well. Typically you won't have the opportunity to review the officer's statement before you prepare yours, so you have to do your best to anticipate any points you think the officer will raise. [24] X Research source"
    },
    {
      "title": "Fill out all required forms.",
      "content": "Fill out all required forms. Once you've properly filed your request for a trial by declaration or affidavit, the court clerk typically will send you a packet of forms and instructions. Most jurisdictions with a formal procedure for trial by declaration have specific forms that you must use to present your testimony. [25] X Research source If you have witnesses, you typically can get them to submit affidavits as well, which you will submit together with your own declaration as evidence in your defense. [26] X Research source If your jurisdiction doesn't have any forms available, you can write an additional letter to the clerk containing your declaration. As with your letter pleading not guilty, use standard business format. Include your citation number and your case name and number in the subject line of your letter. [27] X Research source Your form typically will include a statement that you have waived your right to appear in person at trial and submit your evidence to the court personally. [28] X Research source You usually may attach any documentary evidence you want the court to consider, such as photographs or written testimony from witnesses. This includes anything you would present at trial. For example, if you have drawn a diagram that demonstrates the officer who issued your citation did not have an unobstructed view of your car before he pulled you over, you could include that with your declaration. [29] X Research source [30] X Research source You also may be required to include a long-form written statement in which you describe the incident that led to your citation in your own words. [31] X Research source"
    },
    {
      "title": "Sign your forms.",
      "content": "Sign your forms. Affidavits contain sworn testimony and often must be signed in the presence of a notary public. [32] X Research source Even if you're not required to sign in the presence of a notary, any prepared forms typically will include a statement that you are signing the document under oath and represent under penalty of perjury that the statements it contains are true and correct to the best of your knowledge. [33] X Research source After you've signed your forms, be sure you make a copy of everything you plan on submitting to the court so you have it for your records. Once you send the originals to the court they will not be returned."
    },
    {
      "title": "File your declaration or affidavit.",
      "content": "File your declaration or affidavit. Once you've completed all your forms, you must send them to the clerk of court together with any evidence you want the court to review. Although you can always file your declaration or affidavit by taking it to the clerk's office personally, you typically also have the option of mailing it. You should use certified mail with returned receipt requested so you have notice when your paperwork is received. [34] X Research source Pay attention to the deadlines included in your instructions for a trial by declaration or affidavit. There will be a date by which you must file your declaration and evidence with the clerk, typically no later than 24 hours before the date your trial is scheduled. [35] X Research source The judge will review your testimony and evidence as well as the testimony and evidence from the officer who issued your citation and render his verdict. In some jurisdictions you will receive written notice of the judge's decision within a few weeks after your declaration packet is received. [36] X Research source If the judge ruled in your favor, the notice may include a check refunding you the amount of the fine you posted as bail. [37] X Research source In other jurisdictions, it remains your responsibility to contact the court and learn of the judge's decision after the trial date you've been assigned. [38] X Research source"
    }
  ]
}