{
  "url": "https://www.wikihow.com/Water-a-Cactus",
  "title": "How Often to Water Cactus & How to Do It",
  "steps": [
    {
      "title": "Water desert cactus when the soil is completely dry.",
      "content": "Water desert cactus when the soil is completely dry. While cacti typically need to be watered more often than people think, it’s still easy to overwater them. To avoid overwatering, which can cause root rot and other health issues, make sure your soil is completely dry or almost completely dry before watering the cactus. Stick your finger about 2 in (5.1 cm) into the soil. If it feels dry, it’s time to water. [1] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source Another option is to use a moisture meter , or hygrometer, to determine if the soil is dry enough, or simply stick a gardening stake in the soil, as wet soil will stick to the stake. If the soil still feels a bit moist when you stick your finger in, hold off on watering."
    },
    {
      "title": "Water cacti every 10-14 days in the spring and summer.",
      "content": "Water cacti every 10-14 days in the spring and summer. Cacti grow from March to September in the northern hemisphere, so that is when they need the most water. While your cactus is active, thoroughly water the soil to keep it moist. Keep in mind that factors like exposure to sunlight also affect how fast the soil dries out. During hot, dry weather, you may need to water your cactus weekly, or even add water 2 or 3 times a week. [2] X Research source If you’re in the southern hemisphere, water your cactus more often from September to March instead. During this time, give your cactus some fertilizer, as well. Use a balanced fertilizer and dilute it in the water you add to the soil. This timeframe is especially true if you’re growing cacti indoors , as they aren’t exposed to the elements. If you have an outdoor cactus, it may be best to water every 4-6 weeks if they’re exposed to rain. This varies based on your climate and typical weather conditions."
    },
    {
      "title": "Water a cactus every 4-6 weeks in winter.",
      "content": "Water a cactus every 4-6 weeks in winter. Most types of cacti go dormant and stop growing in the fall. Although they are sleeping, they still need a little bit of water to survive! Monitor the quality of the soil, and water it thoroughly when it dries out to keep your cactus well-nourished. [3] X Research source Overwatering is just as dangerous as underwatering a cactus. Remember that they don’t need a lot of water anyway, but they need even less when they’re dormant."
    },
    {
      "title": "Water tropical cacti before the soil has completely dried out.",
      "content": "Water tropical cacti before the soil has completely dried out. Tropical plants like the Christmas cactus are not drought-tolerant like desert cacti are. If you happen to have a tropical cactus, make sure the soil is always a little moist. Tropical cacti are much more prone to underwatering than desert cacti. If you have a desert cactus, wait until the soil has finished drying out to ensure you don’t overwater it. [4] X Research source Tropical cacti still only need to be watered about once a week. Check the soil a little more often to ensure it doesn’t get too dry."
    },
    {
      "title": "Give your cactus less water if you leave it out in the rain.",
      "content": "Give your cactus less water if you leave it out in the rain. Depending on how much rain your area gets, you might not need to water your cactus at all. Instead, leave it out in the sun to dry out. As long as the pot and soil have adequate drainage, your cactus will be fine. Monitor the soil’s quality afterward to tell when it dries out and requires more water again. [5] X Research source If you expect heavy rain over several days, take your cactus inside so it doesn’t get too soggy. Soggy soil leads to root rot, so make sure it has plenty of time to dry out. A potted cactus will be safe outdoors as long as its soil drains well. Many varieties can even survive in temperatures under 32 °F (0 °C) as long as they are kept dry."
    },
    {
      "title": "Wait at least a day before watering a repotted cactus.",
      "content": "Wait at least a day before watering a repotted cactus. Help your cactus adapt by making its new home as inviting as possible. Put the cactus in its pot and cover the roots. Later on, water the soil lightly until the first 3 in (7.6 cm) stay wet. Watch the soil condition afterward as you transition to weekly watering. [6] X Research source If you have a tropical cactus, be sure to water it before it completely dries out. Watch for any underwatering signs like shriveling. Some growers prefer to wait as long as 1 week before watering a repotted cactus. If you took a cutting, waiting gives the cactus time to heal so it doesn’t become infected or waterlogged."
    },
    {
      "title": "Deeply water the soil around the cactus until it's completely soaked.",
      "content": "Deeply water the soil around the cactus until it's completely soaked. This is known as the soak-and-dry method. Use a watering can or sprayer to soak the soil, leaving the cactus dry. Keep adding water until it flows out from the drainage holes at the bottom of the container. If you’re using a container without drainage holes, add enough water to moisten the upper 3 in (7.6 cm) of soil. Check back in about 2 hours to see if the soil is still moist and add more water as needed. [7] X Research source Most home growers water cacti this way. It’s simple and effective. It gives you much more direct control over how much water you introduce to the soil. Some cacti grow very wide and make it hard for you to reach the soil. If this is a problem, try watering it from the bottom-up with a planter saucer. Spraying a cactus directly could spread bacteria or root rot. Unless you’re in an area with a bone-dry summer or winter, avoid misting a cactus."
    },
    {
      "title": "Fill a planter saucer with water for an efficient watering method.",
      "content": "Fill a planter saucer with water for an efficient watering method. Most cacti grown at home happen to be from the desert, and these varieties have long roots that pull water from deep within the soil. To water one, get a saucer, fill it up with lukewarm water, then place it underneath the cactus’ pot. Come back in 2 hours to check on it. If the soil is moist halfway down, then your cactus has enough water to last until the next watering session. Remove the saucer afterward. [8] X Research source Tap water is safe to use, but rainwater and distilled water are better due to their lack of minerals. Alternatively, use a planting tray or even a plastic container. A planting tray comes in handy for watering multiple cacti at once. Many desert cactus lovers prefer using this method, but the soil can become too wet if you’re not careful. If you’re unsure or notice problems, top-down watering will be fine."
    },
    {
      "title": "Irrigate outdoor cacti with a dripping hose for more controlled watering.",
      "content": "Irrigate outdoor cacti with a dripping hose for more controlled watering. This is a useful method for bigger cacti and those planted outdoors. Set a garden hose nearby, making sure it isn’t touching the cactus. Turn on the water so it begins dripping lukewarm water at a slow but steady rate. After 2 to 6 hours, shut off the hose. [9] X Research source You will have to use tap water unless you have a way to pipe rainwater through a hose, such as a rain barrel with a hose attachment. If your cactus is in a pot, look for water coming out of the drainage holes. The soil at the bottom of the pot, around the roots, will also stay damp. Bigger cacti need more water. A barrel cactus will have enough water after 2 hours, but err toward 6 hours for something like a tall Saguaro."
    },
    {
      "title": "Place water near a tropical cactus for humidity.",
      "content": "Place water near a tropical cactus for humidity. Tropical cacti require a little additional moisture. One way to do this is by filling a small container with gardening pebbles. Mist the pebbles with water, then set the potted cactus on top of it. Check the pebbles when you water the cactus and spray them to keep them damp. [10] X Research source Or, keep a dish of water near the cactus to evaporate over time. Desert cacti don’t require humid conditions, so keep them away from excess moisture. Your home has the perfect humidity level for them."
    },
    {
      "title": "Add a balanced liquid fertilizer to the water during the growing season.",
      "content": "Add a balanced liquid fertilizer to the water during the growing season. If you wish to give your cactus a little boost, add liquid fertilizer to the water. Pick a balanced or low-nitrogen houseplant fertilizer. Dilute it to half its strength according to the directions on the bottle, such as by adding about 1 ⁄ 2 teaspoon (2.5 mL) per 1 US gal (3.8 L) of lukewarm water. Then, use it to water the plant once or twice in the spring and summer. [11] X Research source Try using a fertilizer rated 20-10-20 or 20-20-20, for instance. The first number represents nitrogen, while the second number represents phosphorous and the third one represents potassium. For example, water the plant with fertilizer at the beginning of spring and at the beginning of summer. Tropical plants like the Christmas cactus can be fertilized once a month during the growing season. [12] X Research source"
    },
    {
      "title": "Overwatered cacti pads split, wrinkle, or change color.",
      "content": "Overwatered cacti pads split, wrinkle, or change color. Overwatering is the most common cause of health problems in cacti, and unfortunately, sometimes the effects are irreversible. Keep an eye out for the following signs and cut back on water immediately if you notice them: [13] X Research source The skin of the pads are starting to split Pads have wrinkles or folds The soil remains moist for too long The pads and base of the cactus are turning brown or black The cactus appears overly plump The stems are soft or mushy Root rot A foul odor"
    },
    {
      "title": "Underwatered cacti wither, wilt, or droop.",
      "content": "Underwatered cacti wither, wilt, or droop. When a cactus isn’t watered frequently or adequately enough, it becomes dehydrated, which can stunt its growth and cause other health problems. Keep an eye out for the following signs, as you may need to water your cactus more frequently: Discoloration (turning light green or yellow) Spines turning brown and/or falling off The cactus is wilting or shriveling Pads are withering or drooping The base of the cactus is turning brown and decaying"
    },
    {
      "title": "What kind of water is best?",
      "content": "What kind of water is best? While you can use most fresh water to water your cactus, tap water may have high levels of minerals and chemicals that can potentially harm cacti. [14] X Research source If you’re concerned, opt for filtered or distilled water instead, or collect rainwater. These types of water have healthy minerals and remove impurities."
    },
    {
      "title": "What time of day should you water a cactus?",
      "content": "What time of day should you water a cactus? Many experts suggest watering your cactus in the morning so the warmth of the day will help the soil dry out and prevent excess moisture, which could lead to unwanted bacteria. [15] X Research source"
    },
    {
      "title": "How long can cacti go without water?",
      "content": "How long can cacti go without water? Cacti have stems that store water much longer than other plants. The exact length of time varies depending on the type of cactus, but many desert types can go a year or longer without water, and most large cacti can go 4 to 6 months without it. Still, underwatering can damage your cactus, so keep an eye out for signs like shriveling. [16] X Research source"
    },
    {
      "title": "How do you prevent root rot?",
      "content": "How do you prevent root rot? Root rot is frequently a result of overwatering. To prevent root rot , water your cactus only when the soil is completely dry, and make sure the cactus is planted in well-draining soil in a pot with drainage holes. [17] X Research source"
    },
    {
      "title": "When should you repot my cactus?",
      "content": "When should you repot my cactus? Repot your cactus when the roots start to grow out of the drainage holes or if the cactus is too big for the pot. If the soil dries out too quickly after watering, it could be a sign the roots need more space to grow. [18] X Research source"
    },
    {
      "title": "How do you water a freshly rooted cutting?",
      "content": "How do you water a freshly rooted cutting? Watering cuttings is different from watering well-established cacti. Wait until the cutting shows signs of thirst, like wilting or shriveling. Minimize moisture around the cactus’s base by watering around the rim or bottom. This encourages the roots to grow toward the water. Continue watering this way until the root system is well-established. [19] X Research source"
    }
  ]
}