{
  "url": "https://www.wikihow.com/Treat-the-Flu",
  "title": "14 Ways to Treat Flu Symptoms",
  "steps": [
    {
      "title": "Taking it easy when you’re sick helps your immune system fight the flu.",
      "content": "Taking it easy when you’re sick helps your immune system fight the flu. As soon as you’re recognize flu symptoms , call in to work or school to let them know you’re sick and need time to recover. While you’re home, just try to relax as much as possible and avoid any activities that take up a lot of your energy. Try to stay away from other people so you don’t get them sick while you’re contagious. [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Stay home for at least 1 day after your fever is gone. If you need to go out, wear a face mask so you don’t spread the flu. If you have a hard time resting because lying down makes you congested, try using an extra pillow to raise your head."
    },
    {
      "title": "Drinking water, juice, and other clear fluids prevents dehydration.",
      "content": "Drinking water, juice, and other clear fluids prevents dehydration. If you have a high fever from the flu, you’re more likely to sweat and lose moisture. Slowly sip on water or fruit juice throughout the day to keep yourself hydrated . You can also try hot drinks, like caffeine-free tea or warm water with lemon, to rehydrate and relieve a sore throat . [2] X Trustworthy Source National Cancer Institute An agency in the National Institutes of Health focused on cancer research and patient support Go to source Stay away from caffeinated drinks and alcohol while you’re recovering since both could make your symptoms worse. Try an electrolyte drink if you’ve been vomiting or have diarrhea since it will work better to keep you hydrated. [3] X Research source"
    },
    {
      "title": "Bland foods will be easier to eat if the flu makes you feel nauseous.",
      "content": "Bland foods will be easier to eat if the flu makes you feel nauseous. If the flu left you a little bit queasy, start by sipping warm broth or making a classic chicken noodle soup since they’re easy to tolerate and can relieve your symptoms. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you’re able to keep soup down, try eating bread, crackers, oatmeal, and other foods that are bland and low in fiber. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Have smaller, more frequent meals throughout the day so you don’t make your stomach more upset. [6] X Research source Skip greasy, spicy, or processed foods while you’re sick since they’re harder for your body to digest and could make you feel worse."
    },
    {
      "title": "Gargling salt water",
      "content": "Gargling salt water alleviates pain from a sore or scratchy throat. Dissolve ¼–½ teaspoon (5.8–11.6 g) of table salt in a glass with 8 fluid ounces (240 ml) of warm water. Just take a sip of the salt water and gargle it in the back of your throat for about 1 minute before you spit it out. [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Avoid giving salt water to children 6 or under since they may swallow it instead of gargling it properly."
    },
    {
      "title": "Heat helps drain mucus if the flu made you congested.",
      "content": "Heat helps drain mucus if the flu made you congested. When you’ve got a stuffy nose, wet a washcloth under warm water and wring it out completely. Set the warm cloth on your face so it covers your nose and the sinus area between your eyes. After a few minutes, try blowing your nose to break apart the mucus so you can breathe easily again. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source A hot compress can also help relieve muscle pain or headaches, which are other flu symptoms."
    },
    {
      "title": "A saline nasal spray breaks apart congestion caused by the flu.",
      "content": "A saline nasal spray breaks apart congestion caused by the flu. Use a nasal spray whenever you have a stuffy or runny nose caused by the flu. [9] X Research source Start by gently blowing your nose before putting the spray nozzle in your nostril. Press the spray nozzle down and breathe in slowly through your nose to help loosen the mucus. [10] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Alternatively, you can use a Neti pot to rinse all of the mucus out of your sinuses."
    },
    {
      "title": "Steam thins out the mucus so it’s easier to blow your nose.",
      "content": "Steam thins out the mucus so it’s easier to blow your nose. One of the easiest ways to treat congestion from the flu is taking a hot shower or sitting in your bathroom while you run your shower. Alternatively, you can heat a bowl of water in the microwave until it starts steaming and lean over it. Take slow deep breaths of the steam to break apart your congestion. [11] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Avoid breathing in hot steam from a boiling pot of water since it could burn your airways."
    },
    {
      "title": "A humidifier relieves a sore throat and opens your sinuses.",
      "content": "A humidifier relieves a sore throat and opens your sinuses. Dry air can make a sore throat or congestion from the flu feel worse, but a humidifier helps add moisture so you feel better. Run the humidifier the whole time while you’re recovering, and change the water once a day for continued relief. [12] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Add 1 tablespoon (15 ml) of vapor rub to your humidifier for even more relief from congestion."
    },
    {
      "title": "A compress helps bring a fever down without using any medication.",
      "content": "A compress helps bring a fever down without using any medication. Wet a washcloth with clean, cold water and wring it out until it’s damp. Then, just lay the washcloth against your forehead and rest for a few minutes until you start to feel cooler. [13] X Research source You can also use an ice pack wrapped in a towel to cool yourself down."
    },
    {
      "title": "Acetaminophen",
      "content": "Acetaminophen and ibuprofen help with discomfort caused by the flu. While they won’t make your symptoms go away any sooner, they’ll be a lot more manageable with over-the-counter pain relievers. [14] X Research source You can usually take 1 or 2 pain relief pills every 4–6 hours, but follow the directions on the bottle carefully so you don’t exceed the daily recommended limit. [15] X Research source You can take acetaminophen and ibuprofen together for extra pain relief. [16] X Research source Avoid using medications with aspirin for teenagers and children since it could lead to a fatal condition known as Reye’s syndrome. Avoid taking more than 1,200 mg of ibuprofen or 4,000 mg of acetaminophen within 24 hours. [17] X Research source"
    },
    {
      "title": "Decongestants",
      "content": "Decongestants and cough suppressants make your flu symptoms manageable. If you’re suffering from a stuffy nose, take an oral decongestant to clear out the mucus so it’s easier to breathe. If you have a sore throat and persistent cough, try a dose of cough suppressant as a pill or syrup so you can get some relief. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source An expectorant can thin out mucus so it’s easier to blow your nose. Antihistamines can help you if you have a runny nose. Try sucking on cough drops to help treat a cough or sore throat from the flu. Some flu medications also contain pain relievers, so be sure to avoid mixing them with acetaminophen or ibuprofen if you’re already taking them separately."
    },
    {
      "title": "Elderberry",
      "content": "Elderberry and echinacea have antiviral properties that may fight the flu. While there isn’t a lot of evidence on herbal supplements curing the flu, studies have shown that they could be effective against the flu. Consult with a doctor before you start any new supplements to make sure they’re safe with any other medications or supplements you’re using. [19] X Research source Take 300 mg of elderberry or echinacea twice each day to help treat the flu. [20] X Research source"
    },
    {
      "title": "Your doctor may prescribe antivirals for severe flu cases.",
      "content": "Your doctor may prescribe antivirals for severe flu cases. If you’re feeling extremely sick or if your symptoms get worse, ask your doctor what prescription options are available. You may be able to use antiviral medications to help manage the flu virus and make your symptoms go away. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Oseltamivir phosphate is an oral medication that anyone 2 weeks or older can take. Zanamivir is inhaled and available for people 7 and older. Avoid zanamivir if you have respiratory illnesses like asthma. Peramivir is administered through an IV by your doctor and is available for people 2 and older. Avoid any antibiotics since they won’t help treat your flu symptoms."
    },
    {
      "title": "The flu could lead to more complications if your symptoms are severe.",
      "content": "The flu could lead to more complications if your symptoms are severe. If you still have symptoms after 7 days, or if you develop sudden chest pains, have difficulty breathing, or cough up blood, visit your doctor right away. [22] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Severe flu could lead to pneumonia, bronchitis, or other infections, but your doctor will be able to give you the treatment you need to start feeling better and recover. [23] X Research source You should also reach out to a doctor if you’re 65 or older, pregnant, or have underlying conditions, such as diabetes, heart disease, lung disease, or a weakened immune system."
    }
  ]
}