{
  "url": "https://www.wikihow.com/Store-an-Exercise-Ball",
  "title": "How to Store an Exercise Ball",
  "steps": [
    {
      "title": "Hide the ball in a closet if you have space.",
      "content": "Hide the ball in a closet if you have space. This might seem too simple, but it’s a great way to keep the exercise ball from rolling around and getting in the way. Try making some extra room in a closet, and just toss the exercise ball in when you’re done with it. [1] X Research source You’ll probably have to tidy up the closet a bit to make the exercise ball fit. Clear any clutter off the floor so you have plenty of room. If you have an exercise room in your home, try clearing out a whole closet for your other equipment. This way, the whole room will stay nice and neat."
    },
    {
      "title": "Hang a bungee cord in a corner to rest the ball on.",
      "content": "Hang a bungee cord in a corner to rest the ball on. There’s a lot of space on your walls for extra storage. Drive 2 screws or nails into the wall at opposite sides of a corner, then attach a bungee cord to the mounts. This creates a little makeshift shelf for your exercise ball to rest on. [2] X Research source This could also work with a plain string or rope. If you have more than one exercise ball, then you can mount more bungee cords above or below the first one. This gives you more vertical stacking space."
    },
    {
      "title": "Attach a large net to your wall for a simple hanging option.",
      "content": "Attach a large net to your wall for a simple hanging option. A large net can help keep your exercise ball out of the way. Simply find a stud in your wall and drive in a screw or nail. Then hang the net over the nail. This way, you can toss your exercise ball in there when you’re done with it. [3] X Research source Make sure the net is in a spot where you won’t bump into it. A corner is always a good place. You could also mount the net inside a closet, if you have room, to keep your exercise ball off the floor. Nets are also good for storing other light exercise equipment like mats, straps, and bands. This won’t work for heavier items like medicine balls, so stick with light equipment."
    },
    {
      "title": "Toss the ball in a large bin to keep it from rolling around.",
      "content": "Toss the ball in a large bin to keep it from rolling around. Any kind of storage bin or garbage can will work fine, as long as the exercise ball fits. Just throw the ball in there to prevent it from rolling around the room and getting in your way. [4] X Research source Make sure the bin is clean so you don’t pick up any germs while you’re working out. This takes up a bit of floorspace, so it might not work if you have a tiny room."
    },
    {
      "title": "Build a PVC storage rack for multiple exercise balls.",
      "content": "Build a PVC storage rack for multiple exercise balls. This is a bit more involved, but it’s a good way to store multiple exercise balls and other equipment. You can build all kinds of racks with PVC pipe. Just cut the pipes to the correct length to make a rectangular box that fits all of your exercise balls. Make 2 rectangles by screwing the pipes into 3-way elbow joints. Then attach support pipes into the joints at the corners and fit the 2 rectangles together. Now you can enjoy your handy new storage rack. [5] X Research source For more storage, build multiple levels for the rack. This way, you can stack more equipment or boxes for lots of storage space. You could also build a smaller, square structure to hold a single ball. This keeps the ball in place without taking up a lot of room."
    },
    {
      "title": "Use a balance base to keep your ball in one place.",
      "content": "Use a balance base to keep your ball in one place. A balance base is a small platform with a notch that an exercise ball can sit in. This keeps your ball in place so it doesn't roll around. If you want a simple solution for a single ball, then a balance base is a good option. [6] X Research source Balance bases cost around $30, so they're a cheaper solution than other storage tools."
    },
    {
      "title": "Get a stability rack to stack your exercise balls.",
      "content": "Get a stability rack to stack your exercise balls. Sporting goods stores have all kinds of pre-made racks to store exercise balls. These range from small mounts that hold single balls to large cases that can hold a lot of equipment. If you really want to keep your gym organized, a rack would be a good choice. You’ll probably have to assemble these racks, so follow all the instructions to do it correctly. For vertical storage, there are racks that can stack a few exercise balls above one another. This is great if you don’t have a lot of floor space. There are also shelves that can hold lots of exercise balls of all different sizes. They can also hold heavier equipment like medicine balls. These racks can cost a few hundred dollars, depending on how big they are, so keep that in mind if you’re on a budget."
    },
    {
      "title": "Mount an exercise ball holder onto your wall if you prefer raised storage.",
      "content": "Mount an exercise ball holder onto your wall if you prefer raised storage. There are several types of wall mounts designed for exercise balls. Most hold a single ball for easy storage. Choose a rack and attach it to your wall with a screw or nail. Then toss your exercise ball into it when you’re finished with it. [7] X Research source Always follow the installation instructions for any rack you use. You could also get a larger wall rack for multiple exercise balls."
    },
    {
      "title": "Repurpose a stuffed animal holder to store exercise balls.",
      "content": "Repurpose a stuffed animal holder to store exercise balls. You’ve probably seen stuffed animal holders in toy stores. These are simple boxes with stretchy bungee cords for walls. While they’re meant to hold toys, they’re also great for storing exercise balls. Throw the ball in there when you’re done for a simple storage solution. [8] X Research source These can take up a lot of room, so they might not be right if you have limited floorspace. There are also smaller stuffed animal holders that can mount to your wall. This is a good choice for limited space or a single ball."
    }
  ]
}