{
  "url": "https://www.wikihow.com/Use-a-Computer-Mouse",
  "title": "How to Use a Computer Mouse",
  "steps": [
    {
      "title": "Place the mouse on a clean, smooth surface, preferably a mouse pad.",
      "content": "Place the mouse on a clean, smooth surface, preferably a mouse pad. [1] X Research source This allows the mouse to move without interference. You may have issues with the mouse if it is not on a mousepad, such as it not scrolling smoothly."
    },
    {
      "title": "Grip the mouse lightly in your dominant hand.",
      "content": "Grip the mouse lightly in your dominant hand. You don’t want to hang on to the mouse too tightly or click with a lot of force. Keep your fingers relaxed, and keep the mouse at elbow level. If your fingers become tired, take breaks from the computer."
    },
    {
      "title": "Plug in the mouse with its USB connector.",
      "content": "Plug in the mouse with its USB connector. Your mouse will have a cable extending from it, or it will come with a small USB connector if it is wireless . USB ports are located in different areas for every computer, but in general, laptops will have USB ports on the left or right side of the keyboard; most desktops will have a USB on the front or back of the computer or either side of the monitor. Look for a small square port about the size of your USB connector. Insert the USB connector. Flip the USB connector upside down if it does not fit the first time, but never force the USB connector in."
    },
    {
      "title": "Connect the mouse via Bluetooth if necessary.",
      "content": "Connect the mouse via Bluetooth if necessary. [2] X Research source Plug the Bluetooth transceiver into a USB port, then press and hold the connect button on the USB transceiver for five seconds. Next, the connection wizard will pop up, so follow the instructions in the wizard to connect your device."
    },
    {
      "title": "Make sure the mouse is working.",
      "content": "Make sure the mouse is working. Your computer should be on, and you should see a cursor on the screen you can control by moving your mouse. If the mouse isn’t working, try plugging it in to a different USB port or plugging it in again. Also, make sure a wireless mouse is on and has batteries."
    },
    {
      "title": "Practice clicking with the mouse.",
      "content": "Practice clicking with the mouse. The left button is the primary button for right-handed users, and the right button is the primary button for left-handed users. Click the primary button once to click on something and twice in a row to “double click” on a program or menu. When clicking the non-primary button, this is called “right-clicking.” Single-clicking often selects an item or opens a menu. Double-clicking often opens items or folders. Right-clicking usually displays a list of things you can do with a selected item."
    },
    {
      "title": "Practice scrolling and dragging items with the mouse.",
      "content": "Practice scrolling and dragging items with the mouse. Move the wheel with your pointer finger to scroll up and down pages. To drag an object, place the cursor on it, then press and hold down the primary button, and move the mouse to a new location. Release the primary button once you are done."
    },
    {
      "title": "Customize the mouse as needed.",
      "content": "Customize the mouse as needed. You can change how quickly your mouse pointer moves on the screen, change the mouse’s primary buttons if you’re left-handed, and even change the pointer’s appearance. Go to the settings on your PC to do this."
    },
    {
      "title": "Familiarize yourself with the “Magic Mouse.”",
      "content": "Familiarize yourself with the “Magic Mouse.” The MAC mouse is called a “Magic Mouse” and doesn’t have the same buttons as a PC mouse. It is seamless and does not operate via buttons but through a chip. [3] X Research source It has an on and off button and a censor on the bottom."
    },
    {
      "title": "Set up the mouse via Bluetooth.",
      "content": "Set up the mouse via Bluetooth. [4] X Research source First, charge the batteries with the installer the mouse came with, install the batteries for the Magic Mouse by putting them in the mouse. After that is done, use the mousepad on your computer to open “mouse system preferences” by clicking “system preferences” from the Apple menu, and then click “mouse.” Next, click “setup Bluetooth mouse” in the lower-right corner. Then, turn on the mouse by sliding the mouse power switch to “on.” After doing this, mouse should work. If the light on the bottom of the mouse does not glow or flash when you turn it on, make sure the batteries are charged and installed properly."
    },
    {
      "title": "Click on the mouse.",
      "content": "Click on the mouse. With the MAC mouse, you can click on any part of the surface to click on a program or menu. Click the top right corner only in order to “right-click” with this mouse. If you are left-handed, you can customize the mouse to “right-click” in the left corner. Navigate to “system preferences,” which is a gray wheel icon at the bottom of the MAC screen, then click “mouse” to customize the mouse. You can even turn off the multi-touch functions on the mouse if you want to use it like a PC mouse."
    },
    {
      "title": "Scroll with the mouse by rubbing your finger vertically.",
      "content": "Scroll with the mouse by rubbing your finger vertically. This will make pages move up and down. Moving your finger horizontally will scroll left or right, and moving your finger in a circle will allow you to scroll circularly around a document or picture."
    },
    {
      "title": "Swipe two fingers left or right to browse pages.",
      "content": "Swipe two fingers left or right to browse pages. Using two fingers, swipe left or right. This will move you between pages in Safari, pictures in iPhoto, or songs in iTunes."
    },
    {
      "title": "Zoom with the mouse.",
      "content": "Zoom with the mouse. By holding down “control” on your keyboard and scrolling up, you can zoom in on your desktop. Hold down “control” and scroll down to zoom back out."
    }
  ]
}