{
  "url": "https://www.wikihow.com/Upload-Files-to-an-FTP-Server",
  "title": "5 Ways to Upload Files to an FTP Server - wikiHow",
  "steps": [
    {
      "title": "Understand when you want to use an FTP client.",
      "content": "Understand when you want to use an FTP client. Although both Windows and Mac computers have FTP functionality built in, the tools are rather limited. If you're going to be uploading a lot of files and need features like queuing and upload resuming, you'll want to use an FTP client to connect to the server."
    },
    {
      "title": "Download and install an FTP client.",
      "content": "Download and install an FTP client. There are tons of FTP clients out there, many of which are free. One of the most popular free clients is FileZilla, which is an open-source FTP client available at filezilla-project.org. FileZilla can be installed on Windows, Mac, and Linux."
    },
    {
      "title": "Create a new connection.",
      "content": "Create a new connection. When you start your FTP client, you'll need to create a new connection profile. This will save your connection information, allowing you to quickly reconnect in the future."
    },
    {
      "title": "Enter your connection's information.",
      "content": "Enter your connection's information. Type in the FTP address (e.g., \" ftp://ftp.server.com \"), your user name, and your password (if required). Most FTP servers run on port 21, so you won't have to change this value unless specified by the server. For example, to connect to a test FTP server, you would type ftp://speedtest.tele2.net into the text box. Some servers don't require the second \"ftp\" line in the address. In cases such as these, adding the second \"ftp\" line will prevent you from being able to access the server. FileZilla also supports SFTP and FTPS. Simply choose SFTP or FTPS under the \"Protocol\" dropdown, and supply the required information to connect to that server when prompted."
    },
    {
      "title": "Connect to the FTP server.",
      "content": "Connect to the FTP server. Once you've entered all of your information, you can connect to the FTP server by clicking the Connect or Save button. You'll see the connection log in the status section of the client as your computer contacts and connects to the server."
    },
    {
      "title": "Navigate to the folder you are allowed to upload to.",
      "content": "Navigate to the folder you are allowed to upload to. Many FTP servers restrict uploads from users to specific folders. Refer to your FTP server's documentation to see what folder you have permission to upload to. Use the right panel to navigate through the FTP's folders."
    },
    {
      "title": "Use the left panel to navigate to your files.",
      "content": "Use the left panel to navigate to your files. Typically speaking, the left panel in the FTP client shows your local computer's directories. You can navigate through the folders here to find the files you want to upload."
    },
    {
      "title": "Start uploading the files.",
      "content": "Start uploading the files. Either double-click a file to begin uploading it, or drag it from the left panel to the right panel."
    },
    {
      "title": "Monitor your uploads.",
      "content": "Monitor your uploads. The upload progress will be displayed in the bottom panel of the FTP window. Wait until your upload has completed before disconnecting from the FTP server. Depending on your selected FTP client, you may be able to queue your uploads (e.g., upload files automatically from a list)."
    },
    {
      "title": "Open Start .",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen."
    },
    {
      "title": "Open This PC.",
      "content": "Open This PC. Type in this pc , then click the computer-shaped This PC app icon at the top of the Start menu."
    },
    {
      "title": "Click the Computer tab.",
      "content": "Click the Computer tab. It's in the upper-left side of the window. Doing so prompts a toolbar to appear at the top of the window."
    },
    {
      "title": "Click Add a network location.",
      "content": "Click Add a network location . You'll find this option in the \"Network\" section of the toolbar."
    },
    {
      "title": "Click Next when prompted.",
      "content": "Click Next when prompted. Doing so will begin the FTP server setup."
    },
    {
      "title": "Click Choose a custom network location.",
      "content": "Click Choose a custom network location . It's at the top of the window."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . This option is at the bottom of the window."
    },
    {
      "title": "Enter the address for the FTP server.",
      "content": "Enter the address for the FTP server. Type the address of the FTP server to which you want to connect (usually in \" ftp://ftp.server.com \" format) into the text box in the middle of the window. For example, to connect to a test FTP server, you would type ftp://speedtest.tele2.net into the text box. Some servers don't require the second \"ftp\" line in the address. In cases such as these, adding the second \"ftp\" line will prevent you from being able to access the server."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's at the bottom of the window."
    },
    {
      "title": "Set your username for the FTP server.",
      "content": "Set your username for the FTP server. If the FTP server requires usernames in order to connect, uncheck the \"Log on anonymously\" box and enter the username you want to use in the text field. If the server doesn't require a username, it's a good idea to keep the \"Log on anonymously\" box checked."
    },
    {
      "title": "Enter a name for the FTP server.",
      "content": "Enter a name for the FTP server. Type your preferred name for the server into the text box in the middle of the window. The name is simply for your reference to help you find it on your computer."
    },
    {
      "title": "Click Next, then click Finish.",
      "content": "Click Next , then click Finish . Both options are at the bottom of their respective pages in the FTP setup window. This will complete the setup process and attempt to open your FTP server. You may have to wait a minute or so before the FTP server folder opens. You can also just double-click the server's folder in This PC to open it."
    },
    {
      "title": "Enter your password if prompted.",
      "content": "Enter your password if prompted. If you are connecting to a secure FTP, you'll be asked for your user password when you first connect. Enter the password when prompted or the connection won't work."
    },
    {
      "title": "Upload files to the FTP server.",
      "content": "Upload files to the FTP server. By copying files and pasting them into the FTP server's folder, the files will be uploaded to the FTP server. Keep in mind that this only works for servers for which you have permission to upload: Find a file that you want to upload. Click the file, then press Ctrl + C . Open This PC, then double-click your FTP server's folder. Press Ctrl + V to paste in the file."
    },
    {
      "title": "Open Finder.",
      "content": "Open Finder. Click the blue, face-shaped Finder app icon in your Mac's Dock. This will ensure that the Go menu item is at the top of the screen. You can also just click your Mac's desktop to prompt the proper menu to appear."
    },
    {
      "title": "Click Go.",
      "content": "Click Go . It's at the top of your Mac's screen. Clicking it prompts a drop-down menu."
    },
    {
      "title": "Click Connect to Server….",
      "content": "Click Connect to Server… . You'll find this option near the bottom of the drop-down menu."
    },
    {
      "title": "Enter the server's address.",
      "content": "Enter the server's address. In the \"Server Address\" text box, type in the address for the server to which you want to connect. This is usually entered in \" ftp://ftp.server.com \" format. For example, to connect to a test FTP server, you would type ftp://speedtest.tele2.net into the text box. Some servers don't require the second \"ftp\" line in the address. In cases such as these, adding the second \"ftp\" line will prevent you from being able to access the server."
    },
    {
      "title": "Add the server to your favorites.",
      "content": "Add the server to your favorites. If desired, click ＋ to the right of the server's address in order to add it to your Mac's \"Favorites\" folder. This is optional, but recommended if you plan on connecting often to the server."
    },
    {
      "title": "Click Connect.",
      "content": "Click Connect . It's a blue button in the lower-right side of the window."
    },
    {
      "title": "Enter a username and password if prompted.",
      "content": "Enter a username and password if prompted. You will be prompted for your username and password if the FTP requires it. If not asked for a username or password, you can choose to log in as a Guest (anonymously)."
    },
    {
      "title": "Upload files to the FTP server.",
      "content": "Upload files to the FTP server. By copying files and pasting them into the FTP server's folder, the files will be uploaded to the FTP server. Keep in mind that this only works for servers for which you have permission to upload: Find a file on your Mac. Click the file, then press ⌘ Command + C . Open the FTP window. Press ⌘ Command + V to paste in the copied file."
    },
    {
      "title": "Download the FTPManager app.",
      "content": "Download the FTPManager app. FTPManager is a free app that allows you to access and upload files to an FTP server from your iPhone. To download it, open your iPhone's App Store , then do the following: Tap Search Tap the search bar. Type in ftpmanager and tap Search Tap GET to the right of the orange-and-white \"FTPManager\" heading. Enter your Apple ID or Touch ID when prompted."
    },
    {
      "title": "Open FTPManager.",
      "content": "Open FTPManager. Once FTPManager finishes downloading, tap OPEN in the App Store, or tap the orange FTPManager app icon on your iPhone's Home Screen."
    },
    {
      "title": "Tap ＋.",
      "content": "Tap ＋ . It's in the top-right corner of the screen."
    },
    {
      "title": "Tap FTP.",
      "content": "Tap FTP . This option is near the top of the page. Doing so opens a form for a new FTP connection."
    },
    {
      "title": "Enter your FTP server's address.",
      "content": "Enter your FTP server's address. Tap the \"Host Name/IP\" text box in the \"FTP Connection\" section, then type in your FTP server's address in \" ftp://ftp.server.com \" format. For example, to connect to a test FTP server, you would type ftp://speedtest.tele2.net into the text box. Some servers don't require the second \"ftp\" line in the address. In cases such as these, adding the second \"ftp\" line will prevent you from being able to access the server."
    },
    {
      "title": "Add a username and password.",
      "content": "Add a username and password. If your FTP server requires you to log in with a username and password, enter them in the \"LOGIN AS...\" section at the bottom of the page."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It's in the top-right corner of the screen. Doing so saves your FTP server and adds it to the main FTPManager page. You can only have one FTP server at a time on the free version of FTPManager. To delete an FTP server, tap Edit in the top-left corner, tap the red circle to the left of your FTP server, and tap the trash icon."
    },
    {
      "title": "Select your FTP server.",
      "content": "Select your FTP server. Tap the server's address below the \"CONNECTIONS\" heading in order to do so. This will connect to your FTP server."
    },
    {
      "title": "Create files in the FTP server.",
      "content": "Create files in the FTP server. Keep in mind that this only works for servers for which you have permission to upload: Tap ＋ at the bottom of the screen. Tap New Folder or Blank File Name your folder or file, then tap Save or Create"
    },
    {
      "title": "Upload photos to the FTP server.",
      "content": "Upload photos to the FTP server. While there isn't much that you can upload from your iPhone, photos and videos are still feasible to upload: Tap the Photo Library option on the FTPManager main page. Tap Allow when prompted to let FTPManager access your photos. Select an album. Tap Edit Select a photo or a video. Tap Copy to at the bottom of the screen. Tap your FTP connection. Select a folder, then tap Save"
    },
    {
      "title": "Download the AndFTP app.",
      "content": "Download the AndFTP app. AndFTP is a free app that allows you to connect to an FTP server of your choice on your Android. To download it, open the Google Play Store , then do the following: Tap the search bar. Type in andftp , then tap AndFTP (your FTP client in the results. Tap INSTALL Tap ACCEPT when prompted."
    },
    {
      "title": "Open AndFTP.",
      "content": "Open AndFTP. Once it finishes downloading, tap OPEN in the Google Play Store, or tap the AndFTP app icon in your Android's App Drawer."
    },
    {
      "title": "Tap ＋.",
      "content": "Tap ＋ . It's at the top of the screen."
    },
    {
      "title": "Enter your FTP server's address.",
      "content": "Enter your FTP server's address. In the \"Hostname\" text box, type in the address of your FTP server in the \"server.com\" format. For example, to connect to a test FTP server, you would type speedtest.tele2.net into the text box. Unlike most FTP clients, AndFTP doesn't need the \"ftp://\" tag in front of the server's address—in fact, entering this tag will cause an error."
    },
    {
      "title": "Add a username and password.",
      "content": "Add a username and password. If your FTP server requires you to log in with a username and a password, enter your credentials in the \"Username\" and \"Password\" text fields."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It's at the bottom of the screen."
    },
    {
      "title": "Enter a name.",
      "content": "Enter a name. Type in the name that you want to use for your FTP server settings, then tap OK . This will create your FTP connection and take you back to the main AndFTP page."
    },
    {
      "title": "Select your connection.",
      "content": "Select your connection. Tap the name of the FTP server that you just created. Doing so will open it."
    },
    {
      "title": "Log in if prompted.",
      "content": "Log in if prompted. If asked to enter your login credentials, enter your username and password. If asked for anonymous users only, type anonymous into the \"Username\" text box."
    },
    {
      "title": "Upload files.",
      "content": "Upload files. Keep in mind that this only works for servers for which you have permission to upload. Select a folder to upload to, then do the following: Tap the phone-shaped icon at the top of the screen. Find a file that you want to upload. Tap and hold the file to prompt a checkmark to appear on its icon. Tap the Upload arrow at the top of the screen. Tap OK when prompted."
    },
    {
      "title": "What is an FTP upload?",
      "content": "What is an FTP upload? FTP stands for File Transfer Protocol, and is used to download, upload, and transfer files over the internet. Instead of sending a file over email or in an instant message, you can upload the file to the FTP server, and it can be downloaded by another user."
    },
    {
      "title": "Does it cost money to upload files to an FTP server?",
      "content": "Does it cost money to upload files to an FTP server? Most web hosts include an FTP server for you to use. However, if you want your own private FTP server, it will cost money to start up and run. Individual uploads won't incur costs, but purchasing and upkeep of the server will."
    },
    {
      "title": "Can I upload files to an FTP server in the command line?",
      "content": "Can I upload files to an FTP server in the command line? Yes, you can upload to an FTP server via the command line. Start by typing open [FTP IP address] and log in with your username and password when prompted. Then you can upload a file with the put command, and download files with the get command."
    }
  ]
}