{
  "url": "https://www.wikihow.com/Use-Dryer-Balls",
  "title": "How to Use Dryer Balls",
  "steps": [
    {
      "title": "Dryer balls separate wet clumps of clothes as they tumble around.",
      "content": "Dryer balls separate wet clumps of clothes as they tumble around. This allows hot air to circulate more freely between garments in your dryer, reducing the time it takes to dry your load. The balls also collect lint and naturally soften fabrics as they tumble around, reducing static cling and stiff clothes without chemicals or perfumes. Wool dryer balls are the most popular—they’re hypoallergenic, absorbent, and quieter in your dryer than plastic or rubber balls. 100% wool dryer balls contain no chemicals, dyes, or fillers. Plastic and rubber balls may contain PVCs and other substances."
    },
    {
      "title": "For a medium sized load, use 3 or 4 dryer balls.",
      "content": "For a medium sized load, use 3 or 4 dryer balls. For larger loads, add 5 or 6 balls. Most sets of dryer balls come with 2 or 3 balls, so you may need multiple sets depending on your laundry needs."
    },
    {
      "title": "Add your wet clothes to the dryer.",
      "content": "Add your wet clothes to the dryer. Dryer balls work most effectively with medium-sized loads. If you have a lot of laundry, plan to run 2 smaller dryer cycles rather than one massive one if possible. Some people store their dryer balls in the dryer and add wet clothes on top of them. Either can go in first since they will tumble around anyway."
    },
    {
      "title": "Add essential oil to wool dryer balls if you want to scent your laundry.",
      "content": "Add essential oil to wool dryer balls if you want to scent your laundry. Scented wool dryer balls are a great, chemical-free alternative to scented dryer sheets. Add 3 or 4 drops of your favorite scent to each dryer ball—bright, fresh scents like lavender , orange , or lemon work great. [1] X Research source Let the balls absorb the oil drops for at least 20 minutes. An hour or more is best for maximum absorption. Only use oil-infused dryer balls in warm or no-heat cycles. Oil is flammable, and a high-heat cycle with overly-saturated dryer balls could be a fire hazard."
    },
    {
      "title": "Spray wool dryer balls with water to prevent static cling.",
      "content": "Spray wool dryer balls with water to prevent static cling . Since your clothes will dry faster, there’s a chance they’ll tumble around in a hot, dry dryer and build up static before the cycle is done. Simply spray or dunk your dryer balls with water beforehand—they’ll release moisture evenly during the cycle to fight wrinkles and static cling. Wool balls absorb moisture from clothing in the dryer, maintaining a more humid environment, and helping you get rid of static cling and friction."
    },
    {
      "title": "Add 3 or 4 dryer balls and start the dryer.",
      "content": "Add 3 or 4 dryer balls and start the dryer. This is the ideal number of dryer balls for a medium-sized load. For larger loads, use 5 or 6 dryer balls for the best results if you have them. Toss them in anywhere—all of your clothes and dryer balls will jumble up once the dryer starts. When wool dryer balls are new, they might leave some lint on your clothes. Use light-colored balls for light clothes and dark-colored balls for darks to fix the problem."
    },
    {
      "title": "Reduce the normal drying time by up to 25% when you set the cycle.",
      "content": "Reduce the normal drying time by up to 25% when you set the cycle. Your load will dry more quickly than normal, so check for dryness a few minutes before the cycle is up to avoid over drying. If they’re fully dry, you’re all done! If they’re still damp, keep running the dryer (the exact time it takes to dry depends on the load size and your individual dryer). [2] X Research source An auto-sense dryer will automatically stop once it senses that the load is dry."
    },
    {
      "title": "Replace wool dryer balls when they look scraggly.",
      "content": "Replace wool dryer balls when they look scraggly. It takes a long time for wool dryer balls to break down—they can last up to 4 years or more, or about 1,000 loads. [3] X Research source If they begin to unravel, leave bits of wool on your clothes, or start to look fuzzy and misshapen, it’s time to replace them. [4] X Research source Plastic dryer balls last even longer and may not ever have to be replaced unless they break."
    },
    {
      "title": "Dryer balls are cost-effective over time.",
      "content": "Dryer balls are cost-effective over time. With proper use, they can reduce drying cycle times by up to 25%, leading to a smaller energy bill. They also last for years, so you won’t have to keep spending money on new bottles of fabric softener and boxes of dryer sheets. [5] X Research source"
    },
    {
      "title": "Dryer balls are eco-friendly.",
      "content": "Dryer balls are eco-friendly. They're gaining popularity as an alternative to fabric softener and dryer sheets. Whether wool or plastic, they prevent plastic fabric softener bottles and synthetic dryer sheets from ending up in landfills since they last so long. Wool dryer balls are also all-natural and chemical-free. [6] X Research source Wool dryer balls are also compostable. Just toss them into an organics bin when they’re used up!"
    },
    {
      "title": "Dryer balls are chemical-free.",
      "content": "Dryer balls are chemical-free. The chemicals and fragrances in other products can irritate sensitive skin and coat fabrics. Dryer sheets and liquid fabric softener can leave a buildup of residue on your clothing over time, leading to problems like eczema or irritated skin when you wear your clothes. When they coat towels, they gradually make them less absorbent, too. [7] X Research source"
    }
  ]
}