{
  "url": "https://www.wikihow.com/Take-off-a-Shirt",
  "title": "How to Easily Remove a Shirt",
  "steps": [
    {
      "title": "Take off your jewelry first.",
      "content": "Take off your jewelry first. Remove any necklaces or earrings before taking off your shirt. They can snag on the fabric, especially if your shirt is very tight. Earrings are especially dangerous when they snag, as they can tear your earlobe easily if you pull too hard."
    },
    {
      "title": "Take off any hair accessories.",
      "content": "Take off any hair accessories. Clips, bobby pins, or other clasps can snag on shirts as easily as jewelry. Having your hair pulled is pretty painful, so remove all hair accessories before you take your shirt off."
    },
    {
      "title": "Remove makeup.",
      "content": "Remove makeup. Before you take your shirt off, you might want to remove any makeup if you’re wearing it. If you rub your face on your shirt as you take it off, it can leave stains and ruin your clothes. Remove makeup beforehand to eliminate the chances of messing up your shirt. [1] X Research source If you do get makeup on your clothes, you can typically remove makeup stains using household products."
    },
    {
      "title": "Stand in an open area.",
      "content": "Stand in an open area. The more open space you have, the less chance you’ll hit objects as you remove your shirt. You might have to move your arms a lot to get a very tight shirt off, so you don’t want to be too crowded. Try removing your shirt in your room, for instance, rather than in a small bathroom."
    },
    {
      "title": "Roll the shirt up your torso.",
      "content": "Roll the shirt up your torso. Starting with the bottom of the shirt, roll or fold the bottom of the shirt up until your torso is exposed. This gets the majority of the shirt bunched together in one place, leaving the harder parts, like the neck and arms, for last. [2] X Research source"
    },
    {
      "title": "Push the rolled torso portion over your shoulders.",
      "content": "Push the rolled torso portion over your shoulders. Keep rolling it upwards, bunching it so that the bottom of the shirt is now around your shoulders. You may have to push hard to stretch the bottom of the shirt around your shoulders, depending on how tight the shirt is."
    },
    {
      "title": "Pull the neck over your head.",
      "content": "Pull the neck over your head. Once the shirt is completely over your shoulders, pull the neckline up over your head. The folded lower portion of the shirt will still be stretched around your shoulders, and the sleeves will still be on your arms. If you need to protect your hair-do, use both hands to stretch the neckline over your head without touching your hair. [3] X Research source"
    },
    {
      "title": "Extend your arms.",
      "content": "Extend your arms. Now that your neck is through and the shirt is stretched around your upper body, raise your hands up. The shirt will pop off of your head and you’ll only be wearing the shirt on your arms."
    },
    {
      "title": "Take the shirt off your arms.",
      "content": "Take the shirt off your arms. Simply lower your arms and remove the shirt. This might be a little tricky if the shirt has tight, long sleeves, but tug on the shirt until it comes off. You’re now shirtless!"
    },
    {
      "title": "Unbutton starting from the top down.",
      "content": "Unbutton starting from the top down. Men's style dress shirts typically have a row of buttons from the neck to the bottom of the shirt, generally in the middle. Always unbutton the shirt from top to bottom before removing it. Pulling the shirt over your head without unbuttoning won't work, and you may rip the fabric. Push each button through its hole until each one is unclasped."
    },
    {
      "title": "Make sure to remove a tie.",
      "content": "Make sure to remove a tie. If you wore a tie with your button down, make sure to remove it. You won't be able to take your shirt off if the tie is still clasped around the neck of the shirt. Loosen the knot and remove it first. [4] X Research source"
    },
    {
      "title": "Unbutton sleeve buttons.",
      "content": "Unbutton sleeve buttons. Men's shirts usually have buttons around the wrists. These buttons keep the sleeves clasped tight around your wrists, and depending on how large your hands are, they may not fit through the cuffs unless they're unbuttoned. Push the buttons through their holes using your free hand. Since the hand with the cuff you want to unbutton won't reach the clasp, you may have a little trouble undoing the buttons. Try holding the button between your index and middle fingers, then pushing the fabric up over the button."
    },
    {
      "title": "Remove one sleeve first.",
      "content": "Remove one sleeve first. It doesn't matter which sleeve you choose first. Pick whichever is most comfortable for you. Grasp the end of the sleeve, near your wrist, and keep the fabric taught as you pull your arm out, towards your body. You may have to pull hard if the shirt is tight."
    },
    {
      "title": "Remove the other sleeve.",
      "content": "Remove the other sleeve. With the arm that you just removed, grasp the remaining sleeve near the wrist. Pull the shirt off of your other arm. Your shirt will end up in the hand of the sleeve you removed first."
    },
    {
      "title": "Use the same T-Shirt method for sweaty workout shirts.",
      "content": "Use the same T-Shirt method for sweaty workout shirts. Super-tight workout shirts can get sweaty, but you’ll have to use the same method. The sweat may cause some friction, but this only means you’ll have to pull a little harder. Also, try crossing your arms as you pull the shirt over your head, which will give you more pulling power. [5] X Research source"
    },
    {
      "title": "Try removing tank tops by going down and not up.",
      "content": "Try removing tank tops by going down and not up. If you are having trouble removing a tight tank top over your head, it might be because your arms are at a strange angle or not strong enough to pull it off. Try pushing it down over your hips instead, all the way down to your ankles. Then simply step out. This will only work for tube style tank tops or other shirts with wide necklines, because the neckline has to be larger than your waist."
    },
    {
      "title": "Unbutton polo shirts before removing.",
      "content": "Unbutton polo shirts before removing. While your head may fit through the neck of a buttoned polo shirt, you may risk stretching it out. Unbutton the shirt first, starting with the top button and working your way down: there are generally three buttons. Then remove the polo as you would a normal t-shirt."
    },
    {
      "title": "Unzip shirts with zippers in the back.",
      "content": "Unzip shirts with zippers in the back. Many women's shirts have zippers or buttons at the nape of the neck. You may have to unzip or unbutton these before you can easily take the shirt off. These clasps can be hard to reach, so you might have to get help: ask a friend or family member in the house to help you unclasp the shirt. It may be embarrassing to ask for help, but they may be your only hope. [6] X Research source If there’s no one around, try using a mirror to see where the clasp is, then reach behind your neck and unzip little by little."
    }
  ]
}