{
  "url": "https://www.wikihow.com/Use-Amazon-Locker",
  "title": "How to Use Amazon Locker",
  "steps": [
    {
      "title": "Add the item you'd like to purchase to your cart.",
      "content": "Add the item you'd like to purchase to your cart. To do this, navigate to the item's Amazon page and click the yellow \"Add to Cart\" button the right side of the screen. If you aren't already signed in to Amazon, you will be prompted to enter your username and password after choosing to proceed to your cart."
    },
    {
      "title": "If the Amazon Locker option is available in your area, you'll see a link under your shipping address.",
      "content": "If the Amazon Locker option is available in your area, you'll see a link under your shipping address. Click the link to pick a locker location."
    },
    {
      "title": "Either pick a locker location from the listed options or search for another location by address, zip code, landmark, or locker name.",
      "content": "Either pick a locker location from the listed options or search for another location by address, zip code, landmark, or locker name. Most Amazon Lockers are located within 7-Eleven stores."
    },
    {
      "title": "After choosing your locker location, you'll be directed to a page that lets you pick your shipping speed.",
      "content": "After choosing your locker location, you'll be directed to a page that lets you pick your shipping speed. The most common options are standard locker delivery (free), two-day locker delivery (free with Amazon Prime), and one-day locker delivery."
    },
    {
      "title": "Once you've chosen from the different shipping options, press continue.",
      "content": "Once you've chosen from the different shipping options, press continue."
    },
    {
      "title": "Choose your payment method and press \"Continue.\"",
      "content": "Choose your payment method and press \"Continue.\" You can pick from the payment types already associated with your account, or you can add a new credit, debit, or gift card."
    },
    {
      "title": "Review and place your order.",
      "content": "Review and place your order."
    },
    {
      "title": "Check your email.",
      "content": "Check your email. You'll get a delivery notice when your package arrives at your locker location. This notice will have the code you need to access your package at the locker. [2] X Research source"
    },
    {
      "title": "Go to the pick-up location.",
      "content": "Go to the pick-up location. The lockers are usually fairly close to the entrance, but if you can't find them, ask a store employee."
    },
    {
      "title": "Follow the instructions on the screen and enter your pick-up code.",
      "content": "Follow the instructions on the screen and enter your pick-up code. Your locker will open, and you'll be able to retrieve your package. [3] X Research source"
    }
  ]
}