{
  "url": "https://www.wikihow.com/Write-a-Complaint-Letter-to-a-Company",
  "title": "How to Write an Effective Complaint Letter",
  "steps": [
    {
      "title": "Include your full name and contact information.",
      "content": "Include your full name and contact information. When formatting your letter, be sure to include all relevant information so the company can easily reach you. This includes information like your full name, address, phone number, and/or email address."
    },
    {
      "title": "Address your letter to the customer service department.",
      "content": "Address your letter to the customer service department. When writing a letter of complaint, your best chance of success will come from directing the letter to the company’s customer service department. Because this department is accustomed to dealing with complaints, your letter will likely be processed efficiently and effectively. [1] X Research source Try to find out the name of the customer service manager or director and address your letter to them personally. Begin your letter with Dear “Mr., Mrs., Miss, or Ms.,” followed by their surname. If you cannot find the name of the customer service manager, simply write “Dear Sir or Madam.”"
    },
    {
      "title": "Quickly address the problem.",
      "content": "Quickly address the problem. Start the letter by explaining why you’re writing the letter and what your exact complaint is on the first line. Provide as many pertinent facts as possible, including the date, time, and location where you made the purchase or received service, along with any relevant serial or model numbers. [2] X Research source Customer service representatives may receive as many as hundreds of letters a day, so it's vital that you get to the point quickly. If your letter is too long or detailed, the reader will be inclined to skim its contents and end up with an unclear idea of the exact problem or your desired resolution. You may provide further detail of the situation in the paragraph following your opening sentence, but the first line should draw attention to your complaint as succinctly as possible. Try to keep your letter on a single page, or under about 200 words. State only the facts, not the emotion. While you may be extremely upset, writing about your emotions might overshadow the real issue. For example, your opening sentence might read: “I am writing to complain about a faulty hair dryer that I purchased from your company on July 15th at your location on First Street, Exampletown. The serial number is 12345.”"
    },
    {
      "title": "Specifically state what outcome or remedy will satisfy you.",
      "content": "Specifically state what outcome or remedy will satisfy you. If you want a replacement, a refund, a repair, or some other form of compensation, state this clearly in your second paragraph. Requesting a specific action will help to avoid receiving a form letter or other stock response and give the recipient something to work with on their end. Try to suggest a way you can move forward and continue your relationship with the company. If you demand compensation yet inform them you plan to take your business elsewhere, they will have little incentive to try to resolve the problem. If you’d like the company to correct a broader problem, state that in your letter but recognize that it may take some time. Do not threaten legal action in your first communication. It may be the solution you ultimately require, but send your complaint letter first and await a response. For example, you might say, “To resolve the problem, I would like to exchange the faulty hair dryer for one that works properly.”"
    },
    {
      "title": "Give them a time limit to resolve the matter.",
      "content": "Give them a time limit to resolve the matter. Provide an exact time period within which you would like the issue to be resolved. This will give you peace of mind and help bring the issue to a speedy conclusion. A week or 2 is usually sufficient, but this could vary depending on your request. [3] X Research source Providing a time limit also helps prevent your letter from getting lost or forgotten, which could lead to further resentment between you and the company. For example, say “I look forward to your reply and a solution to my problem. I will wait until July 31st before I contact a consumer protection agency or seek other help.”"
    },
    {
      "title": "Keep your tone polite, yet firm.",
      "content": "Keep your tone polite, yet firm. While you likely have every right to be angry, being rude will only put the recipient on the defensive. Avoid making threats or sarcastic comments at all costs but be authoritative and firm so the company knows to take your complaint seriously. Remember that the person reading your letter was not directly responsible for whatever happened, and they will be much more responsive and willing to please a gracious, polite customer than an angry, accusatory one. Don't write when you're furious. Wait to write your letter until you have calmed down. Or if you wish, write the letter while you are fully steamed, and then let it sit for a day or two before you send it. In all likelihood, you will want to rephrase things in a less incendiary way. [4] X Research source Remember, the company to which you are writing probably isn't out to get you intentionally. Most companies have an interest in their customer's satisfaction, so you’ll have much better success treating the recipient as somebody who wants to help you rather than assuming they’re filled with malicious intent. Being authoritative encompasses a range of things, such as the quality of the language used, your knowledge of your rights and the company's responsibilities, as well as the professional presentation of the letter."
    },
    {
      "title": "Thank the recipient and sign off.",
      "content": "Thank the recipient and sign off. Finish the letter respectfully by thanking them for their assistance and letting them know how and when they can reach out to you to resolve the matter. This will make their job a lot easier, resulting in a more efficient outcome for you. Sign off the letter with Yours sincerely if you know the name of the person you are writing to or Yours faithfully if you referred to them as \"Sir\" or \"Madam\". Avoid informal closings such as \"Best,\" or \"Yours truly.\" To write your signature, leave a blank space under the Yours faithfully or Yours sincerely where you can write in your signature by hand. Underneath this space, type your name so it is easy to read. Etiquette expert Tami Claytor says to conclude with “Thank you for your time” or “Thank you for your consideration.” So try saying something like “Thank you for your consideration. You can reach me at (phone number) or (email address). Yours sincerely, (your name).”"
    },
    {
      "title": "Format your complaint like a business letter.",
      "content": "Format your complaint like a business letter. Formatting your letter in a professional way can favorably influence how your complaint is received. Include your name, address, and the date in the top right-hand corner, followed by the name or title of the person you’re writing to, along with the company’s address, on the left-hand side just above the body of the letter. [5] X Research source If possible, type your letter to make it easier to read and more professional-looking. If you must handwrite your letter, make sure your writing is clear and legible with no crossed-out words or ink smudges. Keep the letter tidy and well-spaced, with paragraphs of approximately equal size."
    },
    {
      "title": "Attach copies of supporting documents.",
      "content": "Attach copies of supporting documents. These may include receipts, guarantees, warranties, copies of checks you sent, and, if appropriate, photos or videos. All documentation should be attached and mailed with your letter. [6] X Research source Make sure to send copies of any documentation, not the originals. That way, there’s no chance of this key information being lost or mislaid should you need to provide evidence to someone else. Keep copies of all correspondence and the dates your letters were sent, as well. If you’re including documentation, make sure to state the exact materials in the body of your letter. For example: “Please find attached a copy of my original receipt, along with a copy of the hair dryer’s guarantee and information regarding the serial number.”"
    },
    {
      "title": "Check spelling and grammar.",
      "content": "Check spelling and grammar. Incorrect spelling and grammar can negatively influence how your complaint is received. Do a spell check on your computer and read through the letter yourself before sending it. You may also want to have someone else read it over to catch any mistakes you might have missed. [7] X Research source Reading your letter aloud can help you catch any sentences that are awkwardly phrased. Make sure everything you’ve written is truthful, sincere, and verifiable, as well."
    },
    {
      "title": "Send your letter by certified mail.",
      "content": "Send your letter by certified mail. Certified mail is a USPS delivery service that provides the sender with a certificate stating the letter has been sent. The recipient then provides a signature when it has been delivered. By using certified mail , you’ll know when the company received your letter and who signed for it. [8] X Research source Make a copy of the letter for your files, as well. If you file your complaint online, take a screenshot or print the screen that shows your letter before you submit it."
    },
    {
      "title": "",
      "content": "Dear Super Grocery manager: I am writing to inform you of a serious issue I experienced at your store on January 17th. I purchased a bag of frozen chicken patties and when I cooked one, I bit into a large piece of plastic. I often buy these chicken patties for my children, so finding the plastic inside was very alarming. I am a regular customer at your store and have bought this brand of chicken patties many times, and while this has never happened before, I wanted to reach out to ensure the store will take measures to check recalls and faulty products so this does not cause harm to someone else. I would like to hear back from you as soon as possible and will reach out again if I have not received a response within a week. Please reach me by phone at (555)-555-5555 or by email at janedoe@emaildomain.com. Thank you for your time. Yours sincerely, Jane Doe"
    },
    {
      "title": "Wait until the time limit you provided is up.",
      "content": "Wait until the time limit you provided is up. Be patient and do not pursue any further action until the time limit you provided in your initial letter is up. If this date passes and you still haven’t heard anything, follow up with a phone call or email to check if the letter was received. It’s always best to give the company the benefit of the doubt. [9] X Research source"
    },
    {
      "title": "Proceed along the chain of command.",
      "content": "Proceed along the chain of command. If you are unsuccessful in your dealings with the customer service director, try to find out who the next person in the chain of command is and reach out to them instead. Each time you move up the ladder (from customer service all the way up to CEO), attach the correspondence you had at the previous level. This will update your new company representative and possibly get the matter resolved in a non-litigious way. Start at the customer service level instead of going straight to the top. Customer service is there to handle these complaints, and any letters addressed to the CEO will probably be referred back to this department anyway. Customer service employees might regard you unfavorably if you try to go over their heads. If you write a letter to a CEO or managing director, make sure it’s clear, concise, and well-written, as they will have no prior knowledge of the incident."
    },
    {
      "title": "Seek outside legal help.",
      "content": "Seek outside legal help. If you wish to pursue legal action, see an attorney to find out how to proceed. Keep in mind that legal action should be your last resort, and leading with it in your letter sets a negative tone and will derail any requests for compensation you may ask for. If you’re serious about pursuing outside help, here are some actions you can take: [10] X Research source Contact your state attorney general or state consumer protection office. These government agencies often mediate complaints, conduct investigations, and take other action against those who break consumer protection laws. Contact a national consumer organization. Groups like Call for Action and Consumer Action try to help with complaints. Contact your local Better Business Bureau . The BBB is made up of organizations supported by local businesses and try to resolve customer complaints. File a report with the Federal Trade Commission. While the FTC doesn’t resolve individual complaints, your report can help law enforcement detect patterns and might lead to an investigation. Visit USA.gov/complaints for information on filing complaints about specific types of products, steps to filing a complaint with a manufacturer or seller, and links to product recall information. Note that you should only contact these organizations if the issue cannot be resolved through the original company. These complaints should be serious issues rather than minor inconveniences."
    }
  ]
}