{
  "url": "https://www.wikihow.com/Why-Is-Temu-So-Cheap",
  "title": "Why Everything on Temu is So Cheap",
  "steps": [
    {
      "title": "Unfair working conditions for sellers",
      "content": "Unfair working conditions for sellers Like many other low-cost Chinese marketplaces, such as Shein and AliExpress, Temu has been accused of selling products produced by people working in unfair conditions. These workers typically work long hours and have extremely low pay, no employee contract or benefits, no days off, and no compensation for overtime. [1] X Research source"
    },
    {
      "title": "Fake or “knockoff” items",
      "content": "Fake or “knockoff” items A large majority of products sold on Temu are unauthorized copies or replicas of well-known items. Temu's items are usually generic goods produced in bulk by Chinese manufacturers. [2] X Research source Temu offers low-cost alternatives to many popular products, from insulated tumblers to headphones. Temu claims its direct supplier relationships take away the need for middlemen, allowing it to keep prices down. However, the company's ability to sell such discounted goods may also stem from cheaply-made items shipped at a low cost."
    },
    {
      "title": "Cheap manufacturing costs",
      "content": "Cheap manufacturing costs According to a study performed by Wired, Temu pressures its manufacturers to reduce prices in order to please customers, which actually ends up leaving the manufacturers with little to no profits. Wired also reported that while Temu covers most of the international shipping costs, it relies on frequent orders from American customers to make up for the money it loses. [3] X Research source As noted by the Wired study, the incredibly low prices on Temu are not sustainable. A look into the company's supply chain costs revealed that Temu is losing an average of $30 per order as it expands into the American market."
    },
    {
      "title": "Heavy competition among sellers",
      "content": "Heavy competition among sellers As a Temu seller , you must stick to the prices set by the platform. Temu places a lot of pressure on the profits sellers make, which makes selling super competitive in order to drive more sales. The only way to achieve this is by going lower than competitors' prices. The lower you price your offerings, the more customers you will attract, as price remains the most important factor for consumers. [4] X Research source"
    },
    {
      "title": "Tax cuts from the de minimis exception",
      "content": "Tax cuts from the de minimis exception In one report by the U.S. House Select Committee, Temu's shipping uses the de minimis exception, which allows shipments valued under $800 to bypass U.S. Customs inspections, to ship low-cost goods directly to American customers. [5] X Research source It is estimated that both Temu and Shein account for over 30% of all packages shipped daily to the United States under the de minimis exception. Nearly half of all de minimis shipments to the U.S. are believed to originate from China."
    },
    {
      "title": "Temu is a low-cost online shopping destination.",
      "content": "Temu is a low-cost online shopping destination. Based out of China, it offers a variety of products, from car accessories and clothing to kitchen appliances, electronics, outdoor furniture, power tools, and baby clothes—virtually anything you can imagine. Temu's standout feature is its incredibly low prices. You can find clothes for $15, jewelry for $1, and electronics for just $10. In fact, Temu likely offers most products for less than $50. Launched in late 2022, Temu quickly climbed to the top of the shopping categories on both the App Store and Play Store. Heavy advertising made shoppers aware of the platform, and its low prices proved to be a major draw."
    },
    {
      "title": "Yes, Temu is a legit company.",
      "content": "Yes, Temu is a legit company. PDD Holdings, the company behind the Temu marketplace, is pretty easy to find information about. Originally registered in China, the company relocated to Dublin in 2023. PDD Holdings has been legally operating in the United States since 2022, meaning Temu is safe . [6] X Research source Given this well-documented corporate background, it is reasonable to conclude that the Temu platform itself is a real marketplace."
    },
    {
      "title": "To purchase items from Temu, the process is similar to other e-commerce sites.",
      "content": "To purchase items from Temu, the process is similar to other e-commerce sites. First, browse the selection and add any desired items to your cart. However, there is a minimum $10 order value required before you can complete the checkout. [7] X Research source Temu includes free shipping on orders that meet this $10 minimum. Additionally, the company offers credits if your order arrives late—$5 for standard shipping or $13 for express shipping."
    },
    {
      "title": "Keep your product expectations low.",
      "content": "Keep your product expectations low. In many cases, the items you order may arrive on time, be of good quality, and look like the online images on Temu's website. However, product quality can be unpredictable, so, in other words, don’t expect a knock-off pair of AirPods to be like the real deal! [8] X Research source If your items arrive damaged, don't match the listing, or fail to arrive, you're eligible for Temu's Purchase Protection Program. This program guarantees a full refund if you return the items within 90 days of purchase. Temu product prices go up and down frequently. If the price drops after you've made a purchase, you can request a price adjustment, and the difference will be credited to your account as Temu credit within minutes."
    },
    {
      "title": "Buying from Temu is safe, but not necessarily ethical.",
      "content": "Buying from Temu is safe, but not necessarily ethical. Investigations have uncovered concerning reports about the poor working conditions in factories for sites like Temu, especially in regions where forced labor is well-documented. [9] X Research source Temu's products aren't designed to last, meaning many end up getting quickly thrown away, winding up in landfills, incineration facilities, or shipped off to developing countries. Before purchasing from Temu, review customer feedback on their website. These reviews can provide valuable insights into the product's true appearance, quality, and fit. For a more sustainable and ethical shopping experience, consider thrifting at consignment shops and vintage stores, or using second-hand apps like Depop and Poshmark."
    }
  ]
}