{
  "url": "https://www.wikihow.com/Turn-Off-Twitter-Image-Previews",
  "title": "How to Turn Off Twitter Image Previews",
  "steps": [
    {
      "title": "Open X.",
      "content": "Open X. Tap the X app icon, which resembles a white X on a black background. Doing so opens your X feed if you're logged in. If you aren't logged into your X account, enter your email address (or username) and password before proceeding."
    },
    {
      "title": "Tap the menu ☰.",
      "content": "Tap the menu ☰ . It's at the top-left corner."
    },
    {
      "title": "Tap Settings and privacy on the menu.",
      "content": "Tap Settings and privacy on the menu."
    },
    {
      "title": "Tap Display and sound.",
      "content": "Tap Display and sound . It's the first option in the \"General\" section."
    },
    {
      "title": "Tap the \"Media previews\" switch or checkbox to disable previews.",
      "content": "Tap the \"Media previews\" switch or checkbox to disable previews. If you're using an iPhone or iPad, tap the green switch to turn off previews. If you're on an Android, tap the checkbox to remove the checkmark. X will no longer display photo or video previews on your timeline."
    },
    {
      "title": "Understand what you can block.",
      "content": "Understand what you can block. While the X website doesn't allow you to block all image previews, you can prevent potentially sensitive or offensive content from appearing in your feed."
    },
    {
      "title": "Go to https://www.twitter.com in your computer's web browser.",
      "content": "Go to https://www.twitter.com in your computer's web browser. This opens your X feed if you're logged in. If you aren't logged in, enter your email address (or username) and password before proceeding."
    },
    {
      "title": "Click the More tab.",
      "content": "Click the More tab. It's on the left side of the page."
    },
    {
      "title": "Click Settings and privacy on the menu.",
      "content": "Click Settings and privacy on the menu."
    },
    {
      "title": "Click Privacy and safety.",
      "content": "Click Privacy and safety . It's under the \"Settings\" header in the center panel."
    },
    {
      "title": "Click Content you see.",
      "content": "Click Content you see . It's in the right panel under \"Your Twitter activity.\""
    },
    {
      "title": "Uncheck the “Display media that may contain sensitive content” box.",
      "content": "Uncheck the “Display media that may contain sensitive content” box. It's at the top of the right panel. This prevents X from displaying potentially inappropriate content in your feed."
    }
  ]
}