{
  "url": "https://www.wikihow.com/Survive-High-School-Orientation",
  "title": "How to Survive High School Orientation",
  "steps": [
    {
      "title": "Review all orientation materials.",
      "content": "Review all orientation materials. It is likely that you received materials from your school regarding orientation. These materials should direct you on where you need to go and what you will need to do. Thoroughly review any instructions from the school regarding where you need to go and what time. These instructions will save you from being in the wrong place at the wrong time and potentially being embarrassed, as well as missing important information."
    },
    {
      "title": "Discuss logistics with your parents.",
      "content": "Discuss logistics with your parents. The night before orientation is a great time to review with your parents what is going to happen the next day while you’re at orientation. This is important because you’ll need a thorough understanding of where you need to be and when. You may also need money to pay for certain things, depending on your school and its requirements, so you should discuss that with your parents. If your parents are required to be involved in orientation, they will need to work that into their schedules and be aware of dates and times. You can start a conversation with your parents by saying, “Can we talk about my orientation tomorrow? I’d like to go over a few things.” If you would like some extra time to walk around the school to find your classrooms, talk to your parents and let them know that you would like an extra hour or so to do this. You can say, “I’d like extra time at orientation to be able to walk around and see my classrooms” to start a conversation with your parents about this."
    },
    {
      "title": "Establish your transportation.",
      "content": "Establish your transportation. Work with your parents or guardians to determine who will pick you up and drop you off or how to use the public transportation in your area, if applicable. Maybe you will even choose to walk or bike to your orientation if you live close enough. If your parents will be picking you up and dropping you off, work with them to determine what time you need to be there and what time you should be leaving the house to be there on time. Then work to determine how long you will be there and what time they should plan to pick you up. You can ask, “What time should we leave the house in the morning so that I get to orientation on time?” If one of your friends is going to orientation at the same time as you, you can ask if their parents would mind picking you up and/or dropping you off. Your parents and your friend’s parents may even coordinate times that they can pick up and drop off you and your friend. Ask your parents’ permission before doing this. You can also arrange to be with your friend at orientation, which could make it much more fun. If you will be using public transportation, look at bus/train schedules to find out what time you need to be at the bus or train stops. Google Maps will often provide routes via public transportation, which can be very useful and save you time. [2] X Research source If you are walking, make sure that you know exactly how to get there. Talk to your parents about which route to take if you are unsure. If you plan to ride your bike, look it over night before. Make sure that the tires have air in them and that your bike is in working order. It would be a good idea to take it for a test ride if it’s not too dark out. If the bike is broken, you will need to repair it yourself, ask a parent to assist you repair it, or take it to a shop."
    },
    {
      "title": "Pack your backpack.",
      "content": "Pack your backpack. It’s a good idea to bring a backpack to orientation because it is likely that you will be bringing home plenty of books and papers. Make sure to pack any forms that you or your parents filled out. Designate a special folder for these forms so that you don’t lose them in the bottom of your backpack or get them mixed in with other papers. You can ask your parents if they have filled out the necessary forms by posing the question: “Have you filled out the forms for my orientation? I’m getting ready to pack my backpack.” If your high school provided you with a list of things that you’ll need for orientation, review the list and make sure that everything is in your backpack and ready to go. If you need assistance, ask a parent or guardian for help with the task by saying, “Can you please help me make sure that I have everything on my list for orientation?”"
    },
    {
      "title": "Set out your clothes and toiletries.",
      "content": "Set out your clothes and toiletries. It’s a good idea to have the next day’s outfit picked out and ready to go the night before so that you don’t spend too long deciding what to wear the next morning and end up being late to your orientation. Pick out your outfit and set it aside on a hanger or neatly folded somewhere in your room. Pick out what shoes you would like to wear and set them near your outfit so that you know where they are and they are ready to go. Decide how you plan to style your hair for orientation. If you need to prepare anything for your hair the night before, you will be able to do so by already deciding how you plan to style your hair. Set out your toiletries in the bathroom or bedroom (depending on your preference). This is a good time to determine which shampoo, conditioner, soap, hair products, makeup (if applicable), and hair brushes you would like to use in the morning and have them ready to go. If you shower at night, make sure that you have the toiletries for your morning routine ready to go in your bedroom and/or bathroom to save time by having to look for things or not knowing what you would like to use."
    },
    {
      "title": "Get to bed early.",
      "content": "Get to bed early. It’s a good idea to get plenty of rest the night before orientation so that you are well-rested and ready to face the day. If you have a nightly routine, start it a little earlier than usual and take your time so that you can prepare your mind and body for sleep. If you have trouble sleeping, a great way to fall asleep is to read while you are in bed. If you are worried about falling asleep quickly , try sipping on a warm drink before you go to bed, such as warm milk or chamomile tea. The warmth of the drink will help you relax. Taking a warm shower or bath before bed can help you fall asleep quickly. This is because the warmth of the shower or bath raises your body temperature and the subsequent cooling effect of stepping out of the shower or bath lowers your body temperature, inducing drowsiness."
    },
    {
      "title": "Wake up early.",
      "content": "Wake up early. Waking up early will ensure that you will have plenty of time to get ready and prepare for the day ahead. Waking up early in general can be correlated with better grades. Set your alarm clock an hour earlier than you normally do so that you do not have to rush and can have a relaxing morning routine. Using an alarm clock will help wake you up at the desired time. If you have a phone, you can set an alarm using your iPhone or Android phone. This is generally done by using the default alarm application or downloading a third-party alarm application to use. Avoid hitting the snooze button. It’s an important day and you need to make sure that you are able to leave your house on time and not be late to your orientation."
    },
    {
      "title": "Get ready for the day.",
      "content": "Get ready for the day. This is the time for you to get ready for the day with your usual morning routine. Eat breakfast. Brush your teeth. Shower, if you choose to. Get dressed with the clothes you set out the night before. Style your hair, if you choose to. Apply makeup, if applicable."
    },
    {
      "title": "Check that you have everything.",
      "content": "Check that you have everything. Before leaving the house, check your backpack to make sure that you have all the required forms, documents, and materials for orientation."
    },
    {
      "title": "Arrive at your school.",
      "content": "Arrive at your school. If you have a schedule, look at it to see where you need to be at the time you have arrived. You may have to wait around for a bit, depending on how early you are. Follow all directions and listen carefully in the orientation. Take notes if you feel you need to. Remember that you can socialize with friends anytime, but the information you are getting at your orientation is critical to understanding how your school works and what the expectations are for its students."
    },
    {
      "title": "Meet up with your friends.",
      "content": "Meet up with your friends. If you know that some of your friends are going to orientation at the same time as you, arrange a time and place for you and your friends to meet. This way, you’ll have someone familiar by your side while you are learning about your new school. Call, text, or message your friends the night before to find out what time they are going to be at their orientation. If they are going at the same time as you, ask if they would like to meet somewhere and go through orientation together. Being with a friend can make orientation much more fun! Remember to pay attention to information being given to you, even though you are with your friends. You don’t want to miss out on anything important."
    },
    {
      "title": "Request your schedule.",
      "content": "Request your schedule. If you do not already have your schedule for school, it is likely that you will be receiving it at orientation. Follow the instructions given to you at your orientation to obtain your schedule. [3] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. Once you receive your schedule, look it over to make sure that it is correct. If the classes look incorrect, ask a nearby teacher or instructor for help. You can say, “Excuse me, would you mind helping me? It looks like I have the wrong class on my schedule.” Review your schedule carefully to see what time your classes are and what classrooms they are located in. If you are with friends, you can compare your schedule with theirs to see if you share any classes. This can be the most exciting part of receiving your schedule!"
    },
    {
      "title": "Obtain your identification (ID) card.",
      "content": "Obtain your identification (ID) card. This often involves standing in a line to get your picture taken. You may or may not receive the card the same day that you get the picture taken. When it is your turn, follow the photographer’s instructions. They may tell you to face your body a certain way or to tilt your head in a certain direction. This is so that the pose in the picture looks consistent with the other students’ pictures and so that your posture looks nice in the photo as well. After the photo is taken, depending on how your school works, you may receive the photo ID a few minutes afterward. If that is the case, you may be directed to stand in line again to receive your ID. After you receive your school ID, be sure to store it in a safe spot in your backpack or wallet."
    },
    {
      "title": "Obtain your textbooks.",
      "content": "Obtain your textbooks. If you are receiving your textbooks at orientation, follow the instructions provided to you for getting them. Your school may have a “book room” that holds all of the textbooks. You may have to wait in a long line to receive your textbooks. When it is your turn, give your name or present your schedule to the teacher or school employee working there. They will retrieve the books for you. When you receive your textbooks, store them in your backpack."
    },
    {
      "title": "Find your locker.",
      "content": "Find your locker. Once you have your schedule and information about your locker, you can find where it is located and make sure that the combination provided works and that the locker opens. Look over your locker to see if there is any damage. If there is, report it to a teacher or school employee. Practice opening and closing your locker a few times so that you are familiar with it."
    },
    {
      "title": "Find your classrooms.",
      "content": "Find your classrooms. Once you have your schedule, and you are finished with your orientation activities, walk around the school to find your classrooms. This can be a fun activity to do with your friends. Obtain a map of the school if you do not know your way around. You can ask teachers or school employees if they have any maps or where you can find one. Once you know the location of your classrooms, try walking to them in the same order as your schedule. This is a great way to familiarize yourself with the routes you will be taking to classes every day."
    },
    {
      "title": "Talk to fellow students.",
      "content": "Talk to fellow students. If you have time, ask some students what grade they are in (even if you already know) to start a conversation. This is a great way to meet and introduce yourself to new people! You can start the conversation by saying, “Hi, my name is Sarah. I’m going into 10th grade. What grade are you going into?” After you have started the conversation, you can ask what teachers they have and if they have any favorite teachers. Try talking to at least two or three different people you don’t know. It’s good to step out of your comfort zone and talk to new people. You never know when you will have things in common with them and make a new friend! If your friend’s friends are there and you haven’t met them, try talking to a couple of them and getting to know them more. This is a great way to grow your circle of friends and meet new people, and it doesn’t require you to step out of your comfort zone as much. You can say, “How do you know Michael?” which should start up a conversation and lead to talking about other things."
    }
  ]
}