{
  "url": "https://www.wikihow.com/Tell-Someone-You-Still-Love-Them",
  "title": "How to Tell Someone You Still Love Them",
  "steps": [
    {
      "title": "Be open, honest, and direct when explaining your feelings.",
      "content": "Be open, honest, and direct when explaining your feelings. You don't need to play any games, especially if you have been with this person in the past. Say exactly what you feel. Put all of your cards onto the table. Spell out your expectations for this relationship, and explain what you want. If you're going to rebuild a relationship, it's incredibly important to establish a line of open and healthy communication. If you want to get back together, say so. If you just want this person to know that you love them, then make that clear. If you have a vision for what you want to happen next, then explain it."
    },
    {
      "title": "Choose to be bold instead of waiting around in fear.",
      "content": "Choose to be bold instead of waiting around in fear. Don't wait too long, and don't be afraid to act on your feelings. The more you obsess about this, the harder it will be. Work up your courage, talk to your love, and explain how you feel. Ask yourself this question: \"If I do not do this, will I regret it later?\""
    },
    {
      "title": "Take the conversation seriously and be straightforward.",
      "content": "Take the conversation seriously and be straightforward. All you need to say, really, is \"I still love you.\" But once you do this, don't laugh or stare at them, that will give them the wrong message that it is a prank or joke. Act serious but show them the personality in you that they love. If you have the words for it, then explain why you still love them, or explain how long or how consistently you have loved them. [1] X Research source If you need to apologize for something, then make your apology and let it stand. You should not have to grovel in order to get this person back."
    },
    {
      "title": "Choose to tell them when you're alone and there are no distractions.",
      "content": "Choose to tell them when you're alone and there are no distractions. If you have agreed to meet this person somewhere, don't just leap right into the \"I still love you,\" line. Make a bit of small talk: ask how they've been, and tell them a bit about yourself, and try to set a positive scene. That said – don't beat around the bush. This person probably has some idea of why you wanted to meet up, and they may be waiting for you to speak your piece. Be patient, but forthright. [2] X Expert Source Cristina Morara Communication Coach Expert Interview. 29 September 2020."
    },
    {
      "title": "Make sure that you mean it.",
      "content": "Make sure that you mean it. If you're going to tell someone that you still love them, you should be certain that you do, indeed, still love them. Try to gain a clear perspective on the situation. Clarify why you are telling this person that you still love them, and try to imagine how they will react. Ask yourself what you hope to gain from saying this. Perhaps you are trying to win someone back, or apologize for something that you did, or simply reaffirm your feelings. [3] X Expert Source Cristina Morara Communication Coach Expert Interview. 29 September 2020."
    },
    {
      "title": "Talk over your feelings with a friend.",
      "content": "Talk over your feelings with a friend. Find someone mature and trustworthy – ideally, someone who is experienced with navigating the waters of love. Ask your friend for advice. Test out the words that you want to say. Talk out the situation in order to clarify your thoughts. Do not take this person's advice without considering the situation for yourself! It can help to confide your feelings in a friend who personally knows the object of your love. Be careful, though: you don't want to tell someone who will gossip and spread the word!"
    },
    {
      "title": "Write down your feelings.",
      "content": "Write down your feelings. Try brainstorming and writing in stream-of-consciousness in order to explore your thoughts more effectively. Make sure that you don't just want your partner back out of loneliness, guilt, power, or fear – nor any other reason, save love. Be true to yourself and the other person. [4] X Research source Ultimately, you will need to forgive yourself and your partner. Avoid conditional forgiveness. Let go. Look at what you want, but also what the relationship needs. If the case is conditional, such as, \"I love you, but I want you to stop drinking,\" then you may need a third-party counselor, friend, or relative to help you and your partner. Ultimately it is up to your partner to choose to change themselves. You cannot change them directly."
    },
    {
      "title": "Put yourself in his or her shoes.",
      "content": "Put yourself in his or her shoes. Think about the situation from the perspective of the person that you love. Ask yourself whether this person still loves you, and whether they will be receptive to your admission. Love is a two-way street, so try not to make it all about your own feelings! Be aware of the impact that your words will have. You might stir up old feelings, and you might destabilize the new life that this person is trying to build. Ask yourself whether you intend to follow through on your words. Consider that it is sometimes best to \"let sleeping dogs lie.\" If it has been a while since your relationship with this person ended, then it may not be appropriate to confess your love. This might be especially true if they are in the middle of building a relationship with someone else."
    },
    {
      "title": "Figure out what went wrong.",
      "content": "Figure out what went wrong. Simple mistakes or problems happen, such as forgetting an anniversary or being late or absent one too many times to a special event, but when there is an innocent explanation most problems resolve themselves. Do not rush back into things without understanding why the relationship ran aground. Determine whether distance is the cause. The uncertainty can lead you to paranoia about what the other partner is doing, or with whom they spend time. If you will be separated for months at a time, then you may need to make a plan to keep the relationship alive. Consider taking a break, or opening up the relationship, or moving to wherever your partner is. You may find that you disagree on certain matters that feel central to your partnership: religious, political, familial, or lifestyle choices. Perhaps your partner wants children, but you do not; perhaps the two of you have begun to fight about which candidate to support in the upcoming election. Consider whether these things are more important than the love you have for this person."
    },
    {
      "title": "Make a plan.",
      "content": "Make a plan. First, ensure that you understand why the relationship foundered, where you see yourself in the future, and whether you still truly love this person. Then, decide when and where you're going to do it. If you are able to do so, meet your love in person. If you are less confident, or if there is no way to be physically with this person, then you might call them, or email them, or write them a letter."
    },
    {
      "title": "Set it up.",
      "content": "Set it up. Ask the person if they will meet you at a neutral location: a coffee shop, or a public park, or a favorite restaurant. If they will not meet you, then try a less direct means of communication like phone, email, or handwritten letter. Avoid saying this over text or instant message. Try to say it as thoughtfully and intentionally as possible. If there is a medium that the two of you always used to communicate, then consider using that medium. If the person doesn't want to see you, then you need to respect that. Do not show up at his/her home or workplace. Do not follow this person, or arrange for someone else to follow him/her."
    },
    {
      "title": "Hedge your expectations.",
      "content": "Hedge your expectations. You can hope and pray that this person will return your love, but you need to be prepared for rejection. If you did something to seriously hurt or anger this person, then they may not be ready to take you back. If your love has found someone else, then they may simply want to focus on the new relationship instead of trying to sort out the past. It is good to be bold, and to speak what is on your mind – but you must do so with abandon, with the conviction that you absolutely must say this thing, regardless of the outcome. Be prepared to respect this person's decision. Whether or not they love you back or want you back, you need to allow them the right to say so. If you do not respect a person, then perhaps you do not love them."
    }
  ]
}