{
  "url": "https://www.wikihow.com/Write-a-Funny-Comic-Strip",
  "title": "How to Write a Funny Comic Strip",
  "steps": [
    {
      "title": "Brainstorm",
      "content": "Brainstorm amusing tale or skits for your comic. Come up with a joke you want to share with the world. Scribbling down some basic dialogue for your characters may be helpful. Make use of subjects that interest you and what you find funny, then try to fit it into your own sense of humor. [1] X Research source A lot of literary work comes from personal experience. Your past may be rich with stories you can tell. You can also put yourself in new situations to get more inspiration. For example, Bill Watterson’s Calvin and Hobbes is about a boy and his stuffed tiger. Scott Adams’s Dilbert lampoons office culture. Ask yourself what age group your comic is meant for. Complicated jokes are more appropriate for teens and adults, for instance. Tone down the joke if you’re writing for children."
    },
    {
      "title": "Choose a topic for your comic.",
      "content": "Choose a topic for your comic. Before setting pencil to paper, make a final decision about your comic’s subject matter. This is very important since it determines how you design the rest of your comic. Select a scenario that is easy for you to imagine. It may not seem laugh out loud hilarious yet, but it can be a good starting point. [2] X Research source Even ideas that seem insignificant at first can turn out to be very funny. For example, imagine drawing a child pretending to be Superman. You can take this concept in many different directions."
    },
    {
      "title": "Determine who will be in your comic.",
      "content": "Determine who will be in your comic. Once you have settled on the story you want to tell, think of who you need in the comic to tell it. Most short comics involve a limited number of characters, usually less than 3 or 4 at a time. The comic’s story can be driven by the personalities of a few characters and how they interact. [3] X Research source You do not need to have multiple characters. For instance, picture a child blowing bubble gum until it pops all over her. Her actions and reaction, driven by her personality, create the humor. If your comic is short, having a lot of characters can be overwhelming and obscure the writing. Keep your comic simple so it stays funny."
    },
    {
      "title": "Come up with a reason why your characters are in the comic.",
      "content": "Come up with a reason why your characters are in the comic. Ask yourself what your characters are doing. You should have a basic idea of this from brainstorming funny ideas earlier. Expand on your idea before beginning to draw. Any characters you use should contribute to the joke presented in your comic. [4] X Research source This may help you come up with more amusing situations or dialogue. Take into account the character’s personality. Keep their actions true to their character. The reason doesn’t have to be complex, but it does keep the humor cohesive. For example, a child may dress up as a Superhero because superheroes are fun and they want to fly."
    },
    {
      "title": "Establish where the comic takes place.",
      "content": "Establish where the comic takes place. The setting may be a very important part of your joke. If this is the case, you will need to draw the setting into your panel. Close your eyes and try to imagine your characters in the location you chose. You should be able to see the background and any important plot details you need to draw in. [5] X Research source If your character visits a zoo, for example, plan on drawing cages, animals, and possibly walkways and other scenery. If your comic can take place anywhere, having a specific setting isn’t necessary. Many black and white comics use a white background. Color comics keep the background an unobtrusive color like blue."
    },
    {
      "title": "Choose a time period for the comic to take place in.",
      "content": "Choose a time period for the comic to take place in. Think about when your comic takes place. The time of day, season, or year may not make a difference in some situations. For others, it can be very important. Many comics are funny because they address present-day issues that readers relate to. Also, your choice of time period can affect your comic’s background. [6] X Research source For instance, a comic set in autumn looks different than one set in summer. Instead of a bright, radiant sun, you may end up drawing piles of leaves. For example, Hagar the Horrible is about a viking. The setting is the Middle Ages, so you won’t see cars, vending machines, skyscrapers, or computers laying around."
    },
    {
      "title": "Plot out how you will tell your story in a comic format.",
      "content": "Plot out how you will tell your story in a comic format. Most funny stories can be told within 3 or 4 individual panels. Each panel gives you space to tell a part of the joke. The first panel sets up a situation, the second panel shows what happens, and the last panel explains what happens, completing the joke. [7] X Research source Many short comics have a 3-act structure, similar to lots of books and plays. Having a beginning, middle, and end is a simple, classic way to arrange comics. Not all comics are in this format. Many good comics are 1 panel, such as those printed in magazines like The New Yorker and Women’s World . Comics can also be much longer than 4 panels."
    },
    {
      "title": "Make a rough copy of your comic in pencil.",
      "content": "Make a rough copy of your comic in pencil. Your first draft is your comic’s test run. Start by drawing out the number of panels you want, then fill them in with characters and dialogue. You don’t have to add in all the details yet. Use stick figures and other quick drawings to plot out the basic structure of your comic. The rough draft doesn’t need to be perfect, so don’t spend all your time on it. Sketch out your comic until you’re happy with the design. Another option is to make the first draft in a computer file. Use a separate file for subsequent drafts so you don’t lose the original. Correct your rough draft until you are satisfied with how it looks."
    },
    {
      "title": "Create a second, more complete draft of your comic.",
      "content": "Create a second, more complete draft of your comic. Sharpen your pencil and grab another piece of paper. If you prefer working by computer, boot up an art program. Redo your cartoon, sketching your rough draft out a second time. This time, add in all of the details that will appear in the final comic. Some good computer programs for comics include Photoshop, Clip Studio Paint, Final Draft, and SketchUp. You can go back and edit your original draft instead of making another comic. You won't have the original as a point of reference, so be careful when editing in permanent details."
    },
    {
      "title": "Ink in the details with a dark pen.",
      "content": "Ink in the details with a dark pen. Use a dark permanent marker or select a darker line setting in your editing program. Trace over the panel borders first, then any dialogue boxes, then the outlines of your characters to make them stand out more. Finish up by darkening any smaller details you want to stand out in the final draft. [8] X Research source Black lines stand out, so use them strategically to draw attention to certain areas of the comic. They give your comic a border and give your figures depth. For example, if you draw a cat, darken the cat’s outline. You may also wish to add some extra marks to draw attention to the eyes, fur, or whiskers."
    },
    {
      "title": "Add any dialogue in dark letters.",
      "content": "Add any dialogue in dark letters. Your dialogue needs to be bold in order to stand out. If your readers don’t pay attention to it, they miss the humor you painstakingly crafted. Filling in dialogue is easy, since all you need to do is trace over the letters with a dark marker. The letters should be penciled in first to ensure they look perfect once they are inked. [9] X Research source If you do your work on a computer, most programs have a text box option. You type the letters into the box and can adjust the settings to change the font, size, and color."
    },
    {
      "title": "Color in the rest of your comic as needed.",
      "content": "Color in the rest of your comic as needed. Pick up your art supplies and give your comics some life! Felt-tip pens, colored pencils, and markers are a few options you can use. Because of the black outlines you made earlier, you shouldn’t have much of an issue with colors bleeding over into the wrong areas. Still, work slowly to make your comic look professional. [10] X Research source Black and white comics are acceptable even in many professional publications, so don’t feel pressured to add colors. Many artists use computer programs to improve their coloring. You can upload images drawn by hand by making use of a computer scanner. Programs like Photoshop or Flash are good ways to add coloring effects to your comics."
    },
    {
      "title": "Create a unique name if you want to title your comic.",
      "content": "Create a unique name if you want to title your comic. Choose a name that tells the reader what your comic will be about. Avoid stealing popular names, but also avoid choosing dull names. Settle on something unique that entices people to read your work. If you have trouble thinking of a name, surf the Internet for suggestions and read the titles of other comics for inspiration. [11] X Research source Creating a title is especially important for recurring comics. For one-off comics, you can either go without a title or come up with a short caption referencing the joke. For example, Garfield and Cyanide and Happiness are a couple of examples of comic strip names that stand out and give the comic context."
    },
    {
      "title": "Show the comic to your family and friends.",
      "content": "Show the comic to your family and friends. Ask them to read it and give you a critique. Gauge their reactions as well as what they say. See if they laugh at the humor or pay more attention to the art. Both of these aspects need to be balanced and appreciated. If you don’t get the reception you desire, use the feedback to improve your next comic! People that you know may compliment your work but not appreciate the humor. You may wish to test your comic on strangers to get an unbiased reactions. Not all critique will be useful to you. If your parents have a much different sense of humor than you, they may not find your comic funny. That doesn’t mean you need to change your style to please them, since you can still find an audience that shares your sense of humor."
    },
    {
      "title": "Store your comic in a safe place.",
      "content": "Store your comic in a safe place. Get a portfolio folder to protect your art. Slide all of your rough drafts into the folder when you aren’t using them. As long as you have a rough draft, you can recreate the comic. Also keep any finished copies safe in your portfolio. [12] X Research source Consider uploading copies onto your computer. Use a computer scanner for this. If you draw on the computer, make backup copies of all of your work. Upload them to a cloud-based storage system, hard drive, or flash drive."
    },
    {
      "title": "Publish",
      "content": "Publish your work if you want others to read it. Many artists enjoy sharing their work so others can laugh too. The key to publishing work officially is to find places that accept similar styles to yours. Newspapers run some comics, but so do some magazines. Online magazines and comic websites have become great spots for budding artists to display their work. For example, a magazine like The New Yorker is a great spot for adult-oriented single-panel comics. Comics meant for children’s magazines need to be simpler and more colorful. If you can’t get your comic published immediately, consider starting your own website . Post your work there so other people can read it and spread your work."
    },
    {
      "title": "Practice your drawing skills before making an official comic.",
      "content": "Practice your drawing skills before making an official comic. In order to ensure that you’re at your very best, create sketches of basic items. People, animals, backgrounds, and props are excellent starting points. Familiarize yourself with the shape and structure of general items. You will eventually find comic strips easier to draw and will produce better work. [13] X Research source At first, your drawings may not look like what you see in a newspaper. Through perseverance and a lot of practice, you can begin to improve as an artist. Once you have your drawing technique down, try sketching some comics. Don’t worry about nailing the humor or perfecting the design."
    },
    {
      "title": "Create some characters for your comic.",
      "content": "Create some characters for your comic. Funny comics come in a variety of different forms, so you aren’t stuck with a single subject matter. However, a lot of artists get their start with a single, basic character. This character can be whatever you want. Try superheros, aliens, inanimate objects coming to life, or animal companions. Take inspiration from real life. For example, many people turn a pet or a person they know into a character. Satirical comics often involve politicians and real-life events. You can make use of existing characters. If you look at a site like DeviantArt, you will see many people drawing characters they know. If you like superheroes, for instance, draw Batman or Superman in your unique style. Characters with exaggerated features are often useful for creating humor. For instance, you can make an owl with a large head to represent a brainy person. Read political satire for more examples."
    },
    {
      "title": "Draw your characters in various positions.",
      "content": "Draw your characters in various positions. Play around with different body positions and facial features. You need to be adjustable as an artist, especially if you plan on using characters for multiple comics. Master their basic body structures and expressions first. Then, try putting them in a variety of situations. Working with your characters this way may give you some funny ideas you can use in your comic strip. Dig deep into your character to make them real. Putting them in various situations can help make them feel real to you. You will soon learn their unique quirks you can bring to life in funny ways."
    }
  ]
}