{
  "url": "https://www.wikihow.com/Travel",
  "title": "How to Travel",
  "steps": [
    {
      "title": "Determine how much money you can spend on a trip.",
      "content": "Determine how much money you can spend on a trip. You don't need to be rich to travel, but knowing how much money you have available will likely shape all other aspects of your trip. If things are tight, you may decide to delay your trip until you can save more money. Where you go, how you get there, where you stay may all rely on how much you have to spend. Remember that in addition to any travel expenses, you still have to pay rent and bills at home. Make sure you have enough to cover these essentials before you spend money traveling. Be savvy and cut out small, unnecessary purchases where you can. Eating in, avoiding ATM fees and skipping the $4 lattes are all quick, easy changes you can make to save extra cash for traveling. If you can't afford to jet to a distant location but you're itching to explore, research where you can go that is within a day's drive of home. Search for national parks, weird roadside attractions, or even look at a travel guide for your area. If you don't have wheels you can rent a car or take a bus to get away for the day."
    },
    {
      "title": "Figure out how long you will be gone.",
      "content": "Figure out how long you will be gone. If you are working, check how much vacation time you have saved up. Check your calendar for any important dates that might conflict with your travel plans--you might need to push your trip back a few days so you don't miss your grandpa's 100th birthday. Don't forget to factor in travel time--if you only have a long weekend, it might be best to stick relatively close to home. You can determine the percentage of your vacation you will spend traveling by dividing the total number of hours you spend on the road by the total number of hours you plan to spend at your destination."
    },
    {
      "title": "Choose when to go.",
      "content": "Choose when to go. Find out the high, low, and shoulder season for tourists at your destination by looking at their tourist bureau online. [1] X Research source When you travel may also impact the cost of your ticket. If you're not choosy about dates, you can plan your trip around the lowest fares. High season is when there are the biggest crowds, the best weather, attractions selling out, and the highest prices. Low season usually means great deals, fewer tourists, the possibility of terrible weather, and the risk of some attractions being closed. You may also find that locals are a little more welcoming. Shoulder season is considered the best time to travel. You get the best of both worlds--you will miss the crowds, snag the good deals, and still have good weather. Book right before or right after high season to take advantage of shoulder season."
    },
    {
      "title": "Decide what kind of trip you want this to be.",
      "content": "Decide what kind of trip you want this to be. Ask yourself what you'd like to get out of your time away. If you need a break from your hectic schedule, consider planning a relaxing beach vacation. If you are going crazy with boredom, look into an adventure vacation white-water rafting, zip lining, or rock climbing. Become one with nature by visiting a national park, or gain new perspective by visiting a country halfway across the globe. Many travel websites will include inspiration and ideas for different types of trips: family, ecotourism, road trips, and more. Try a website like Triptuner that will give you suggestions based on your preferences. Ask friends and family about places they've been. They may have some great recommendations and insights on what to do, where to stay, and what to eat."
    },
    {
      "title": "Set a budget.",
      "content": "Set a budget. Do your best to estimate how much your entire trip will cost. Factor in travel expenses (plane or train tickets, gasoline if you're driving), hotels or hostels, travel insurance, passport or visa fees, transportation at your destination (taxis, buses, car rental), the average cost of a meal (or set the total amount you are allowed to spend on food each day). Be sure you leave yourself some cash to splurge on something special and something extra for emergencies. Research the cost of the activities that interest you--look up the admission fee to the Musée d'Orsay or the price of a ticket to a Broadway show. The more accurate you can be with costs, the better you can plan your trip. Many cities offer some kind of tourism pass, which, for a flat fee, grants free or discounted entry into popular attractions like museums, tours, and historical sites. [2] X Research source If your plans exceed your budget, you may need to make a few sacrifices. Stay at a hostel instead of a hotel or skip the four star restaurant. Being flexible will make it easier to stick to your budget. Don't forget to look up the money conversion rate if you're going abroad and work that into your budget."
    },
    {
      "title": "Make travel arrangements.",
      "content": "Make travel arrangements. There are dozens of websites you can use to search for reasonable flights all over the world. Take the time to check multiple booking search engines, as they don't always feature the same deals. Try the airlines' direct websites, too. If you're not flying, you can book train and bus travel online, too. Be sure you have plenty of time to switch planes if you have a layover in another city. Studies have shown the best time to buy a ticket for a domestic flight is between 100-50 days (3.3-1.5 months) before to your departure date. Tickets for international flights are usually lowest between 171-50 days (5-1.5 months) before travel. [3] X Research source If you're not sure how you want to get to your destination, a website like Rome2Rio will give you estimated cost and travel times for just about every mode of transportation. Train travel is big in Europe, and websites like Seat61 can help you plan a route and look for deals."
    },
    {
      "title": "Book your accommodations.",
      "content": "Book your accommodations. From hostels to luxury hotels, tree houses, campgrounds, and private apartment rentals, there are tons of options when it comes to deciding where to stay. Consider how you plan to use your accommodations. If you want to meet other travelers and don't mind sharing a bathroom, a hostel may be a good choice. If you want to sleep late and order room service in a fluffy robe, you probably want to find something upscale. There are even ways to arrange for a free place to stay--sign up at couchsurfers.com to crash with someone local, or try WWOOFing (World Wide Opportunities on Organic Farms) to exchange work for room and board. Make reservations ahead of time. It may decrease the spontaneity of your trip, but it's no fun to arrive and find every hostel in town is booked for the night and you have nowhere to sleep."
    },
    {
      "title": "Make a rough itinerary.",
      "content": "Make a rough itinerary. If you plan to visit multiple cities on your trip, try to determine how many days you will spend at each location. Decide which attractions are priorities and find out if you need tickets in advance. Don't be too strict, though. If you're stressing out because you're 15 minutes behind your itinerary schedule, you (and your travel companions) aren't going to have a very good time. [4] X Research source Researching the transportation system will make it easier to plan and budget your time. Learn how the metro works before you visit Paris, or find out which train lines will take you to Pisa from Florence and how long the trip will take. [5] X Research source Add the addresses and contact numbers of any hotels, car rental agencies, so you have them in one place and can reference them quickly. Share your itinerary with your family, and include all your travel information. It's important someone knows where you are and how to reach you in case of an emergency. Email your itinerary to yourself so it's easily accessible."
    },
    {
      "title": "Make a packing list.",
      "content": "Make a packing list. Check the average weather at your destination for the time of year you are traveling. Many blogs and travel websites have compiled suggested packing lists, so if you search “what to pack for a week in Bali,” you should find lots of good recommendations. Pack light. Pick basic clothes that coordinate so you can mix and match over the course of your trip. If you are flying, remember the safety restrictions, including the 3-1-1 rule: each passenger can have one 1-gallon bag of liquids, gels, or creams, each in a 3.4oz container. Most drug stores sell travel-sized shampoos and moisturizers you can pack. Make sure you pack any medications you take and that you have enough for your entire trip, plus a little extra. Other must-haves: a light rain jacket, a back-up battery for your phone or other electronics, something to read or pass the time on flights and bus rides. Consider the weather. It might be snowing outside, raining cats and dogs, windy, or it might be as hot as the desert sun. Well, it all depends on the weather, and so the type of weather is the type of weather activity you'll be doing. Roll your clothes up when packing. Don't fold your clothes-roll them up! You'll have tons more space in your bag. To make things even easier, roll up each outfit into one big roll. That way, you can grab the whole thing at once, no search required."
    },
    {
      "title": "Get your passport.",
      "content": "Get your passport. First things first--you aren't going abroad anywhere if you don't have a valid passport. The average processing time for a U.S. passport is 4-6 weeks and costs $110-$135. If you are applying for a new passport, you must submit your paperwork in person at a passport agency or approved facility (usually a post office), and some are by appointment only. Save yourself a lot of stress and get your passport in order before you do anything else. It is possible to expedite the process and get your passport sooner than 4-6 weeks (even as quickly as 24-hours in an emergency), but you will have to pay an extra fee. If you are renewing your passport, you can skip the lines and submit by mail. When you receive your passport, scan a copy and email it to yourself. You may also want to make a photocopy and keep it in your suitcase. These copies will be very helpful if your passport is lost or stolen while you're out of the country. Keep your passport somewhere safe while you are traveling--a jacket with an inside pocket or a money belt that goes under your shirt can keep you from losing your passport or having it stolen."
    },
    {
      "title": "Find out if you need a visa.",
      "content": "Find out if you need a visa. Some countries visitors to obtain a travel visa to enter the country. As with your passport, you should apply well in advance, as it could take days or weeks to process. You may need to arrange your hotel accommodations before applying for a visa and be asked to present the address and contact information when you apply."
    },
    {
      "title": "Go to the doctor and get vaccinated.",
      "content": "Go to the doctor and get vaccinated. Tell your doctor where you are going and discuss which vaccines you will need. Some countries require proof of certain vaccinations to enter the country. Your doctor can give you an International Certificate of Vaccination, or Yellow Card, to provide as proof of inoculation. Vaccines can take several weeks to start working, or you may need multiple doses, so don't wait until the last minute. See your doctor 4-6 weeks before travel. [6] X Research source You can also visit a travel clinic for vaccines--the staff specializes in travel medicine and will be well-versed in what precautions you should take while abroad. [7] X Research source"
    },
    {
      "title": "Learn the language.",
      "content": "Learn the language. Even a few key phrases--\"hello,\" \"thank you,\" \"excuse me,\" \"where is the bathroom?\"--can go a long way. Often people will be more willing to help you if you make an effort to speak their language. English is common as a second language in many countries, but you should never assume everyone will be fluent."
    },
    {
      "title": "Research the customs of the country you are visiting.",
      "content": "Research the customs of the country you are visiting. Traveling somewhere unfamiliar can make you vulnerable, and the last thing you want to do is inadvertently offend the locals. Things that are perfectly acceptable at home may be frowned upon in your host country. Buy a travel guide or check out the forum on a travel website like Lonely Planet to get tips. Pay attention to things like how locals typically dress (some countries are more modest than others and you may get unwanted attention by showing skin), if tipping is expected, and how much \"personal space\" is normal (you may find people stand and talk much closer than you're used to). Check for travel warnings or alerts for the country you plan to visit. You may learn that certain areas are experiencing conflict or are considered unsafe to visit and decide to alter your plans."
    },
    {
      "title": "Notify your bank or credit card company you will be traveling abroad.",
      "content": "Notify your bank or credit card company you will be traveling abroad. If your account shows sudden activity in another country, your card may be flagged for fraud. A quick phone call will keep your card from being declined or, in some cases, lost to an ATM that won't give it back. Ask your bank if they have any international partners or branches you can visit. The fees for ATM withdraws in foreign countries are fairly high and can add up quickly. Using your ATM card for withdraws will almost always get you the best exchange rate. Just watch for those fees."
    }
  ]
}