{
  "url": "https://www.wikihow.com/Tie-a-Quick-Release-Knot-(Highwayman%27s-Hitch)",
  "title": "How to Tie a Quick Release Knot (Highwayman's Hitch)",
  "steps": [
    {
      "title": "Fold the rope approximately 2 ft (0.61 m) from one end to form a loop.",
      "content": "Fold the rope approximately 2 ft (0.61 m) from one end to form a loop. Loops are also known as bights. Once you make the bight, place it behind the pole, post, or other object that you’ll be securing the knot around. Wrap the topmost part of the loop over or around the side of the pole or post. [1] X Research source"
    },
    {
      "title": "Form another bight out of the rope on the right side of the first loop.",
      "content": "Form another bight out of the rope on the right side of the first loop. This side is known as the standing end. Loop the rope just as you did before to make the first bight, but using the standing end just below the post or pole. The standing end is the side of the rope that will not release and that you’ll secure this end to whatever you’re tethering. [3] X Research source If you are using this knot to secure a horse, the horse would be secured to the right side of the rope and the left side would be left hanging."
    },
    {
      "title": "Insert the new bight through the first one you made.",
      "content": "Insert the new bight through the first one you made. The 2 bights or loops need to connect to start the knot. Push the bight you just made into the first one you made by bringing them towards each other around the pole or post. [4] X Research source"
    },
    {
      "title": "Create a third bight with the quick-release end (working end).",
      "content": "Create a third bight with the quick-release end (working end). This is the left side of the rope. Form this bight about 6 to 12 in (15 to 30 cm) from the other 2 bights. [5] X Research source"
    },
    {
      "title": "Bring the new bight through the last bight you made.",
      "content": "Bring the new bight through the last bight you made. Just as you did the first time, tuck your new bight into the loop of the last bight you made. Pull it through so that the rope is taut at the base of the bight. [6] X Research source"
    },
    {
      "title": "Pull the standing end to tighten the hitch.",
      "content": "Pull the standing end to tighten the hitch. This is the non-release part of the rope on the right that will be sturdy when you tug on it. Tug on this end to tighten the knot until it feels secure. [7] X Research source"
    },
    {
      "title": "Untie the knot by tugging on the quick-release end.",
      "content": "Untie the knot by tugging on the quick-release end. To untie or collapse the hitch, pull on the quick-release end and the knot will instantly come undone. Only do this when you are ready to untie the knot as it will undo it completely and you’ll need to retie it if you’re not through with it. [8] X Research source"
    },
    {
      "title": "Make a safety ring from baling twine if you’ll be tying up a horse or boat.",
      "content": "Make a safety ring from baling twine if you’ll be tying up a horse or boat. If you’re using a quick-release knot to tie up a horse or boat, create a safety string around the hitching ring or post you’ll be using. Tie a 1 ft (0.30 m) piece of baling twine loosely around the object. Double knot the ends together. Then, tie your knot through the twine instead of directly to the object. This will ensure that you can easily cut the rope free if the knot gets tangled and you can’t undo it. [9] X Research source"
    },
    {
      "title": "Tuck the end into a loop to prevent it from becoming undone.",
      "content": "Tuck the end into a loop to prevent it from becoming undone. Some horses figure out that if they tug on the end of the rope with their teeth, they can undo the knot and free themselves. The knot may also come loose on its own if it’s not strong enough or if you accidentally tug on it. To prevent this, tuck the quick-release end of the rope into the loop at the top of the knot. This will help to secure the knot. [10] X Research source"
    },
    {
      "title": "Add an extra bight to strengthen the knot.",
      "content": "Add an extra bight to strengthen the knot. If you want to make the highwayman's hitch more secure, add one more bight through the last loop that you made. Use the standing end (right side) of the rope to do this and then tug on the standing end of the rope to secure it. [11] X Research source This is similar to the tumble hitch knot, which has 3 layered bights."
    },
    {
      "title": "Avoid using the highwayman’s hitch knot for climbing purposes.",
      "content": "Avoid using the highwayman’s hitch knot for climbing purposes. If you accidentally grab the quick-release end, the knot will come completely undone and you will fall. Reserve this knot for when you only need to quickly secure something and having it come undone won’t be a hazard. [12] X Research source For example, you might use this knot, if you need to secure your horse for a few minutes or tie up a kayak while you get into it."
    }
  ]
}