{
  "url": "https://www.wikihow.com/Stop-Direct-Mail-Advertising",
  "title": "How to Stop Direct Mail Advertising",
  "steps": [
    {
      "title": "Call your local phone companies and ask that your address be removed from your telephone listing.",
      "content": "Call your local phone companies and ask that your address be removed from your telephone listing. Telecom companies gather this information and then regularly sell it to businesses and directory companies. Unlisted numbers do not usually have an address associated with them. [1] X Research source"
    },
    {
      "title": "Register to remove your address from the largest mailing list provider in the United States, Mail Preference Service of the Direct Marketing Association.",
      "content": "Register to remove your address from the largest mailing list provider in the United States, Mail Preference Service of the Direct Marketing Association. Visit dmachoice.org and register your name and address. Remember that your registration for direct mail renewal is only good for 5 years, so you will need to reapply. [2] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Go to optoutprescreen.com or call the number 1-888-5-OPTOUT to take your name and address off the lists of the 3 largest credit monitoring agencies.",
      "content": "Go to optoutprescreen.com or call the number 1-888-5-OPTOUT to take your name and address off the lists of the 3 largest credit monitoring agencies. With 1 call, you can remove your information from the Experian, Trans Union and Equifax monitoring services. These companies sell information to credit card companies, who send you offers. [3] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source You can also initiate a more permanent opt-out process. Go to optoutprescreen.com, get your 5-year opt-out process completed, and then turn in a signed form once you receive it."
    },
    {
      "title": "Call all the companies you do business with and ask that they remove your information from their advertising mailings.",
      "content": "Call all the companies you do business with and ask that they remove your information from their advertising mailings. You may want to call banks, stores, insurance companies, frequent flier programs, credit card companies, phone companies and Internet shopping sites. Clarify if you want to be removed from all mailings or just those related to product offers. [4] X Research source"
    },
    {
      "title": "Keep a stack of unwanted magazines and take some time to call their customer service numbers.",
      "content": "Keep a stack of unwanted magazines and take some time to call their customer service numbers. Request that you be removed from their mailing list. If you want to receive some magazines from the company, request that you be put on an infrequent mailing cycle. [5] X Research source"
    },
    {
      "title": "Stop offensive advertising mail by filling out a Form 1500.",
      "content": "Stop offensive advertising mail by filling out a Form 1500. Go to a US Post office or go to USPS.com and request the form. Give all the details of the business or person sending you the offensive junk mail. [6] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Never fill out a contest application on an Internet landing page or in person.",
      "content": "Never fill out a contest application on an Internet landing page or in person. Usually contests are a way for companies to gather valuable personal data and selling it on to other companies. The database is worth far more than the prize they are giving away."
    },
    {
      "title": "Avoid filling out warranties or registrations unless it is guaranteed that your information will not be sold.",
      "content": "Avoid filling out warranties or registrations unless it is guaranteed that your information will not be sold. For most companies, this is also a way to gather a database filled with valuable survey data. This is usually true of online registrations as well, so only register when it is unavoidable."
    },
    {
      "title": "Fill out a temporary, rather than a permanent, change of address form when you move.",
      "content": "Fill out a temporary, rather than a permanent, change of address form when you move. With the U.S. Postal Service, they are required to share your new address with companies if your move is listed as permanent. You can still get mail forwarding for 10 months if it is listed as a temporary move, giving you time to give your information to important parties. [7] X Research source"
    },
    {
      "title": "Ask how your information will be used when you are filling out any application.",
      "content": "Ask how your information will be used when you are filling out any application. They are required to tell you if they plan to sell your information. You may be given the option of opting out of receiving mailings from the business you are applying to."
    },
    {
      "title": "Track who sells your information by providing a fake middle name.",
      "content": "Track who sells your information by providing a fake middle name. Keep a designated list of the middle names you use so that you can contact the offending company to opt-out. This should not be done for bank or government applications."
    },
    {
      "title": "Write \"Please do not sell my name or address\" on any applications to new services.",
      "content": "Write \"Please do not sell my name or address\" on any applications to new services. They may not be required to remove your name from the database, but some companies will tick a box that says you opted out."
    },
    {
      "title": "File a complaint with the Federal Trade Commission, if you believe your information is being abused or you have opted out a few times and it has not worked.",
      "content": "File a complaint with the Federal Trade Commission, if you believe your information is being abused or you have opted out a few times and it has not worked. Call 1-877-382-4357 or visit ftc.gov. [8] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    }
  ]
}