{
  "url": "https://www.wikihow.com/Tesla-Waze",
  "title": "How to Use the Tesla Nav & Waze to Navigate the Road",
  "steps": [
    {
      "title": "Built-in nav is available all the time and has real-time traffic alerts for premium subscribers.",
      "content": "Built-in nav is available all the time and has real-time traffic alerts for premium subscribers. The map displays automatically on your Tesla's screen (except if a Model 3 is in reverse), and you can use it to get directions to anywhere. You can choose the fastest or slowest route or whether you want to avoid tolls to get to your destination. Pre-schedule routes or navigate to a charger in order to precondition the battery . [1] X Research source"
    },
    {
      "title": "Open Waze on your smartphone for notifications.",
      "content": "Open Waze on your smartphone for notifications. Even with Tesla's navigation as the main source of navigation, you can have Waze open, without a destination set (so you don't hear \"Make a left\" all the time), and it will alert you for upcoming road conditions. Get the notification sound from Waze by going to Voice & sound within the app settings and changing \"Play sound via\" to Play as Bluetooth phone call . In this case, Waze will not be your main navigation app, since the Tesla provides good navigation services. Instead, Waze will only alert you of road conditions ahead, like speed traps or debris on the road."
    },
    {
      "title": "Go to https://teslawaze.azurewebsites.net/ using the display in your Tesla.",
      "content": "Go to https://teslawaze.azurewebsites.net/ using the display in your Tesla. Allow your location to be used so you can use the navigation service. This navigation service allows you to choose your route, and warns you about upcoming road conditions like traffic accidents, lane, or road closures. [2] X Research source"
    },
    {
      "title": "Use Tesla Display on Android smartphones.",
      "content": "Use Tesla Display on Android smartphones. This method is not available for iOS. Not all Android smartphones are compatible with hotspots, either. Make sure your cellular provider allows you to set up and use a hotspot before attempting this method. Enable the Wi-Fi hotspot on your Android. It's as easy as tapping the hotspot icon in the Quick Settings panel. Connect your Tesla to your hotspot. Tap the Wi-Fi icon in the top right corner of the screen in your Tesla, and select your hotspot. Open the Tesla Display app and check a few boxes. Tap the gear icon at the bottom of your screen to open \"Settings,\" then tap Control on Touchscreen and make sure the option next to \"Mirror Mode\" is Image . Tap the Start icon and select Phone screen when driving/Phone screen . Tap Accept when prompted. If you need to, follow the instructions in the pop-up. Go to https://td9.cc:7777 in your Tesla's web browser. You'll see your phone's screen mirrored to your Tesla's screen! Open the Waze app on your Android. Keep the Tesla Display app running in the background so it will continue mirroring your screen. You can control and interact with the Waze app that's running on your Android from the car's display! [3] X Research source"
    },
    {
      "title": "Cancel Tesla Nav and use Waze on your smartphone.",
      "content": "Cancel Tesla Nav and use Waze on your smartphone. Skip this method if you don't have a mount that allows you to see your screen and you want that feature. This method lets you use Waze completely without using Tesla navigation (which awesomely points you in the direction of local superchargers ). Make sure you have the sounds on in \"Voice & sound\" in the Waze app and that you're connected to Bluetooth on the car. [4] X Research source"
    }
  ]
}