{
  "url": "https://www.wikihow.com/What-to-Text-a-Ghoster-for-Closure",
  "title": "What to Text a Ghoster for Closure",
  "steps": [
    {
      "title": "Asking how they're doing is a low-key way to get their attention.",
      "content": "Asking how they're doing is a low-key way to get their attention. If you’ve sent message after message with no response, consider flipping the script. You just want to know they’re alive and safe, and there’s no harm in letting them know that. This text may be a good idea to send if a long-time friend or partner with mental health concerns has ghosted you. [1] X Research source “I don’t want to get back together. I just want to know you’re okay.” “Could you get back to me so I know you’re okay?” “This last month was rough, and I just want to know you’re okay. No strings attached.”"
    },
    {
      "title": "Acknowledging their absence can start a conversation.",
      "content": "Acknowledging their absence can start a conversation. They disappeared without notice, so there’s no shame in speaking up! Be upfront about wanting closure so you can move on, too. ““Hey, I’m not sure why you’re not talking to me, but I’d love some closure.” “Hey, miss talking to you. Would you be open to a quick chat about what happened between us?” “I know something’s up because you haven’t answered my texts. That’s cool, but some closure would be nice so we can both move on.”"
    },
    {
      "title": "Let them know you’re open to chatting if they are.",
      "content": "Let them know you’re open to chatting if they are. If you want to keep it simple, this can be a good approach. Don’t be afraid to share your feelings. They’ve hurt you, and you can express that. “Not going to lie, some closure would be nice. Are you free to chat?” “You ghosting me hurts, especially when all I’d like is a proper goodbye.” “Can we talk about what happened? I don’t want to get back together, but some closure would be great.”"
    },
    {
      "title": "Be honest about how this is affecting you.",
      "content": "Be honest about how this is affecting you. Acknowledge that you’re ready to move on and have no intention of rekindling the relationship, but you need answers. Some people ghost because they think it’s the easier, more considerate thing to do. If you’re asking yourself “why,” consider seeing if they’ll talk one more time. “I assume you’ve moved on, but I can’t do that without answers.” “I don’t want to get back together. I just want to talk about what happened so we can both move forward.” “Are you free to talk? I think some closure would help us both.”"
    },
    {
      "title": "Bringing up the length of the relationship can work well.",
      "content": "Bringing up the length of the relationship can work well. Whether you’ve been friends for years or just started dating, remind them of the good times you’ve shared. You both deserve to speak your mind before going separate ways. “We’ve been friends for years. Leaving without a goodbye feels cruel.” “I know you hate goodbyes, but the time we shared deserve at least a short one.” “I know we’ve only just met, but a proper goodbye is better than leaving me without answers.”"
    },
    {
      "title": "Ask them to be honest about why they ghosted you.",
      "content": "Ask them to be honest about why they ghosted you. Be direct in your message, acknowledge what’s happened between you, and ask them why. Sometimes, you need to know the truth to move on, even if the ghoster thinks disappearing protects you from it. [2] X Research source “I know things didn’t go as we hoped, but I still deserve to know why you disappeared.” “I’m ready to move on too, but I need answers. Can you tell me why you left?” “It sucks this didn’t work out. Would you mind telling me what the turning point was?”"
    },
    {
      "title": "Sending a question let's them know you need an answer.",
      "content": "Sending a question let's them know you need an answer. Being ghosted can be confusing and frustrating. If you don’t know where you stand with this person, be upfront with them. Phrase your question around where you think the relationship stands. “So, are we broken up?” “Should I be seeing new people? Would really love some closure.” “We’re still friends, right?”"
    },
    {
      "title": "Showing vulnerability could get you some closure.",
      "content": "Showing vulnerability could get you some closure. Don’t be afraid to share your emotions in a quick, straightforward text. If you’ve been in a relationship for a long time, you do deserve a goodbye. Let them know how you feel, and they might just realize ghosting you hurts more than having a break-up conversation. “I wish you would’ve just talked to me before disappearing.” “Getting ghosted hurts more than saying we’re breaking up.” “This relationship had to end, but I wish we could’ve said goodbye.”"
    },
    {
      "title": "A simple, kind message may get a response out of them.",
      "content": "A simple, kind message may get a response out of them. Even if they’re not answering your texts, they’re probably reading them. Just be polite, open, and honest when asking for closure. Don’t be afraid to mention why you want to talk. “I hope you’re well! I’d love to talk about what happened between us.” “Hoping you’re okay. Maybe talking about what happened will help us both.” “Would you be down to chat soon? Getting some closure would really help me move on.”"
    },
    {
      "title": "Remind them you exist by bringing up a shared memory.",
      "content": "Remind them you exist by bringing up a shared memory. Even if you’ve only known one another for a short amount of time, chances are you have good memories of your time together. Rather than sending a surge of texts asking why they’ve ghosted you, send them a chill text that doesn’t necessarily warrant a response. [3] X Research source This is a great way to refer to your past while acknowledging the need for closure. “You won’t believe what I saw on my way to work this morning! I’d love to tell you all about it and talk about what happened between us.” “Saw the funniest shirt thrifting today that made me think of you. I wish things didn’t end so abruptly. Maybe we can chat about it soon.” “Hey, drove by the old burger joint. I'd love to grab a milkshake and talk about what went down between us.”"
    },
    {
      "title": "Ghosters aren't the most forthcoming folks.",
      "content": "Ghosters aren't the most forthcoming folks. People ghost out of convenience, because it's easier, or because they want to avoid conflict. They may by unwilling to elaborate on why they ghosted you. It's okay to let their silence speak for itself and consider that closure enough. [4] X Research source They chose to end the relationship, and that’s their loss! There are plenty of people out there who'd love to get to know you better. Rather than texting the ghoster, text one of your friends instead. Getting ghosted can be a whirlwind of emotions, but your friends are always there to support you."
    }
  ]
}