{
  "url": "https://www.wikihow.com/Use-a-Stapler",
  "title": "How to Use a Stapler",
  "steps": [
    {
      "title": "Open the stapler.",
      "content": "Open the stapler. Most staples are top load staplers. To open these, grip the base of the stapler, then pull the top of the stapler until it lifts open and the staple tray is revealed. [2] X Research source Back load staplers usually have a button on the back, so to open these, push the button until the stapler tray pops out slightly. Then, pull on the staple tray until it is fully extended. Electric staplers will also have a release button on the back. Hold the base steady when opening a stapler. Some models may vary, but in general, you can open a stapler by pulling it open or by pushing a back button. [3] X Research source"
    },
    {
      "title": "Load the stapler",
      "content": "Load the stapler . Insert the recommended staples, placing the pointy legs first into the staple tray. To close top load staplers, push the top of the stapler down until it clicks into place. For back load staplers, push the stapler tray in to close it."
    },
    {
      "title": "Gather up to 20 pieces of paper.",
      "content": "Gather up to 20 pieces of paper. This is the amount most manual desktop and electric staplers can bind, but heavy-duty staplers can handle up to 100 or more pieces. Be sure your papers are all facing the same way and are in the order you want to bind them in."
    },
    {
      "title": "Put the upper left edge of the stack of paper in the stapler’s mouth.",
      "content": "Put the upper left edge of the stack of paper in the stapler’s mouth. The staple is going to come out of the stapler ejection gap (located at the very end of the stapler tray), so place the part you want to staple under it. [4] X Research source If you are using an electronic stapler, the staple will shoot out immediately. If the electronic stapler does not shoot the stapler out immediately, push your papers further back, and be sure it is plugged in. You will hear electronic staplers “click” when the papers are bound."
    },
    {
      "title": "Press down firmly and quickly on the top of the stapler.",
      "content": "Press down firmly and quickly on the top of the stapler. Then, let go of the stapler’s top, and your papers should be bound."
    },
    {
      "title": "Check to make sure that the staple has bound the papers.",
      "content": "Check to make sure that the staple has bound the papers. [5] X Research source You can remove the staple if it is not in the location you wanted, if it is loose, or if it is bent. Pry open the staple legs, then pull the staple out, and try stapling it again."
    },
    {
      "title": "Unjam the stapler, if necessary.",
      "content": "Unjam the stapler, if necessary. Staplers often jam if you try to staple too many papers or if a staple bends in an unexpected way. Open up the stapler, and use tweezers, pliers, or a similar tool to pull out any jammed staples. Unplug electronic staplers before fixing any jams."
    },
    {
      "title": "Open the stapler.",
      "content": "Open the stapler. Hold the base of the stapler firmly in one hand, then pull back the top of the stapler where the staple tray is. [6] X Research source Other stapler models include a silver tab on the bottom of the stapler, toward the back. Press it, and the stapler will automatically pop open, enabling you to use it for tacking purposes. Let the base hang as you use the stapler tray end for tacking. Do not use electronic staplers for tacking."
    },
    {
      "title": "Hold up the paper you are trying to staple.",
      "content": "Hold up the paper you are trying to staple. You may need to ask a friend for help since you do not want to tack a crooked piece of paper to the wall, and using the stapler to tack will require two hands. Tape the paper in place while you staple it if a friend cannot help you hold it."
    },
    {
      "title": "Push the stapler ejection gap firmly down on the part of the paper you want to tack.",
      "content": "Push the stapler ejection gap firmly down on the part of the paper you want to tack. You will hear the staple enter the wall. [7] X Research source Repeat this tacking process as necessary. If the tacking function is not working, do not force it. Your walls may simply be too thick for staples, and you will have to use screws or hooks."
    }
  ]
}