{
  "url": "https://www.wikihow.com/Wet-Mop-Haircut",
  "title": "The Wet Mop Haircut: What to Ask For, Popular Styles, Origins & More",
  "steps": [
    {
      "title": "The wet mop is a textured, medium-length cut with parted fringe.",
      "content": "The wet mop is a textured, medium-length cut with parted fringe. Popularized by the Beatles and Justin Bieber, the wet mop features longer hair on the top of the head, with shorter hair on the sides and back. The top hair is brushed down for a combed-over effect, and the bangs are swept to the side to create a shaggy appearance. Some key elements of the wet mop include: [1] X Research source A tapered flow into a layered top. Short to mid length on the sides and back. Lots of texturized layers and added movement. Often worn with natural waves or styled with curls."
    },
    {
      "title": "Request a choppy bowl cut in front without extending it to the sides.",
      "content": "Request a choppy bowl cut in front without extending it to the sides. For a wet mop haircut, ask your barber to cut the top so it’s about 4 inches (10.2 cm) in length, falling past your eyebrows. Have them add lots of texturized layers and movement throughout your hair, then trim the sides with a #4 clipper guard until they reach earlobe level. [2] X Research source Show your barber reference photos of wet mop haircuts that have the texture, flow, and styling you like. The key to a flattering haircut is to be clear about what you want!"
    },
    {
      "title": "Visit your barber every 4 to 6 weeks to trim your wet mop.",
      "content": "Visit your barber every 4 to 6 weeks to trim your wet mop. You need between 3 to 5 inches (7.6 to 12.7 cm) of hair on top for a wet mop haircut, which means you can go in for a trim every 4 to 6 weeks. If you want a shaggier wet mop, you can visit your barber every 6 to 10 weeks (depending on how fast your hair grows). [3] X Research source You can always grow out your wet mop for an even messier look, or teach yourself how to trim the sides or fringe at home."
    },
    {
      "title": "For wavy or curly hair, apply sea salt spray before blow-drying.",
      "content": "For wavy or curly hair, apply sea salt spray before blow-drying. Spritz sea salt spray onto damp hair to add volume and definition to your locks. Hold your hair dryer a few inches away from the hair on top and point the nozzle downward to minimize frizz. Celebrity hairstylist Noël Reid-Killings says to “use a round brush” to lift the hair up and away from your forehead, while blow-drying your hair in the front. This will “get your bang to lay at the curve you’re looking for.” Repeat this process 2 to 3 times until your hair is the perfect shape. To minimize hair damage, apply a heat protectant spray before blow-drying. Keep the blow dryer moving while you shape your hair with the round brush , instead of holding it in place. Pressing the nozzle against one area will fry your hair."
    },
    {
      "title": "For straight hair, apply mousse into damp hair and blow-dry with a diffuser.",
      "content": "For straight hair, apply mousse into damp hair and blow-dry with a diffuser. Work a golf-ball sized amount of texturizing mousse into your hair while it’s still damp. Attach a diffuser to your blow dryer and set it to the lowest heat and pressure settings. Cup small sections of your hair into the bowl of the diffuser and scrunch your hair from the ends up. When you get closer to your scalp, professional hairstylist Martin Nepton recommends “putting your hand in between your scalp and the diffuser so you don’t burn yourself.” Move the diffuser around your head until your hair is completely dry. Use dry shampoo in between washes to give your hair a gritty texture that makes it easier to style."
    },
    {
      "title": "Brush your fringe forward with a wide-tooth comb and apply pomade.",
      "content": "Brush your fringe forward with a wide-tooth comb and apply pomade. After you’ve blow-dried your hair, brush it forward and part the fringe. Warm a dime-sized amount of pomade in your hands, then run it through the fringe and the top layer of your hair. This emphasizes the soft texture of the wet mop, while keeping your hair in place. For extra hold, spritz a flexible hairspray all over. [4] X Research source Alternatively, use a matte wax or other texturizing product to achieve the look you want."
    },
    {
      "title": "Tousled Wet Mop",
      "content": "Tousled Wet Mop To make this style look less like a bowl cut, ask your barber to use a scissor over comb technique, rather than clipping your hair. Add extra texture with point cutting, which helps it grow out nicely and makes it easier to style. [5] X Research source"
    },
    {
      "title": "Undercut Wet Mop",
      "content": "Undercut Wet Mop If you want a bad boy-inspired look, opt for the undercut version of the wet mop. It features the long bangs from the original haircut, but the sides and back are completely shaved. This sharp contrast in length looks crisp, clean, and effortlessly cool."
    },
    {
      "title": "Mod-Inspired Wet Mop",
      "content": "Mod-Inspired Wet Mop This medium length wet mop is softly textured, shaggy, and universally flattering (especially if you have an oval or square face shape). Keep your hair collar length at the back, slightly shorter at the sides, and heavily textured at the crown with an eyebrow-length fringe. You can also use a razor to give your fringe a jagged, piecey look. [6] X Research source"
    },
    {
      "title": "Textured Wet Mop with Fringe",
      "content": "Textured Wet Mop with Fringe If you’re searching for a softer wet mop haircut, this one’s for you! Leave your hair slightly longer at the back so it reaches the top of your collar, and ask your barber to cut lots of choppy layers to get an effortless, tousled texture. Rub a pea-sized amount of matte wax or pomade into your fingertips, then run it through your hair to enhance the texture. [7] X Research source"
    },
    {
      "title": "The wet mop haircut is longer and more texturized than the curtain cut.",
      "content": "The wet mop haircut is longer and more texturized than the curtain cut. The fringe in a wet mop haircut usually falls past the eyebrows, while the fringe in a curtain cut is clearly parted in the middle. Unlike the wet mop, the curtain cut often features straight and shiny hair that’s cut to a medium length. This gives it a preppy, ‘90s boy-band aesthetic, rather than the disheveled, rockstar vibe of the wet mop. [8] X Research source If you add flippy curtain bands and a center part to a mod-inspired wet mop, you’ll get the curtain cut."
    },
    {
      "title": "When did the wet mop haircut become popular?",
      "content": "When did the wet mop haircut become popular? The haircut was popularized by The Beatles in the 1960s. At the beginning of the decade, the band befriended an art student named Jürgen Vollmer in Hamburg. A few years later, Paul McCartney and John Lennon met up with Vollmer in Paris and requested the hairstyle, which Vollmer cut in the middle of his hotel room. Paul and John brought the wet mop back to England, where it became a symbol of youth. [9] X Research source Older generations thought the hairstyle looked like a wet mop, and it was named accordingly. Today, the wet mop haircut has resurfaced in popularity due to male TikTok creators, such as Bryce Hall and Noah Beck."
    },
    {
      "title": "What celebrities have the wet mop haircut?",
      "content": "What celebrities have the wet mop haircut? Celebrities like Justin Bieber, Charlie Heaton, Will Sharpe, Liam and Noel Gallagher, Louis Tomlinson, Noah Beck, Bryce Hall, Vinnie Hacker, and Jungkook from BTS have rocked the wet mop. The haircut was popularized by the core members of The Beatles, which include Paul McCartney, John Lennon, George Harrison, and Ringo Starr. [10] X Research source"
    },
    {
      "title": "What face shapes look best with the wet mop haircut?",
      "content": "What face shapes look best with the wet mop haircut? The wet mop suits a variety of face shapes, but it’s especially flattering for those with square or heart faces. With that being said, you can always style the longer hair on top in a way that complements your face shape, or customize the texture to accommodate your natural hair. After you determine your face shape , talk to your barber to see what style suits you. They can offer advice on what works well with your hair texture and length."
    }
  ]
}