{
  "url": "https://www.wikihow.com/Survive-Jury-Duty",
  "title": "How to Survive Jury Duty",
  "steps": [
    {
      "title": "Bring food from home.",
      "content": "Bring food from home. Your day may be long and you might get hungry before the official lunch break. Food available near the courthouse may be expensive, too. Bring some snacks and even a meal to be safe. [1] X Research source There may be very limited places to get lunch during your break. If you’re a picky eater or have special dietary concerns, bring enough food to get you through the day. There probably won't be a refrigerator or microwave available to you, so pack things that don't require those things, such as crackers, protein bars, or fruit. Bring healthy foods that are high in protein to keep your energy level up."
    },
    {
      "title": "Bring entertainment or work with you.",
      "content": "Bring entertainment or work with you. You won’t be able to use your tablet or read your book all of the time. However, there will almost certainly be plenty of time spent waiting outside of the courtroom. You can use this time to read, watch a movie, or listen to music. [2] X Research source If you plan to listen to music or watch a movie, make sure to bring headphones so that only you can hear it. Many courts provide wireless internet for free or for a fee. This can be great for getting work done or catching up on emails and social media. However, the Wi-Fi may not accommodate streaming, so download anything you wish to watch ahead of time. Be mindful of what you share over public Wi-Fi as most courthouses are open internet."
    },
    {
      "title": "Make sure you have cash.",
      "content": "Make sure you have cash. Sometimes the eating establishments in or near the courthouse only accept cash. Make sure you have some with you so you don’t have to pay to use an ATM. [3] X Research source Some courts will give you cash to cover the expense of lunch (approximately $10). If you’re driving, you should also bring cash to cover the cost of parking meters or a garage. The court may reimburse you for this, but not all do."
    },
    {
      "title": "Dress appropriately.",
      "content": "Dress appropriately. Check the court’s website for information on what type of dress is expected. Most have guidelines but do not enforce a strict dress code. Generally, courts expect you to dress in business casual. [4] X Research source thisfairytalelife.com/jury-duty-survival-tips/ Bring a light jacket, even in the summer. The courthouse may be air conditioned and could be cool. Remember that you’ll probably be sitting for long periods of time. Wear something relatively comfortable."
    },
    {
      "title": "Take public transportation.",
      "content": "Take public transportation. If public transportation is available, it may be easier than trying to find parking near the courthouse. Many urban courthouses are in places where parking can be difficult or expensive. You may be exempt from jury duty if the distance between your home and the court is greater than a certain number of miles. Check with your local court if you think you may live too far to have to serve."
    },
    {
      "title": "Research the neighborhood around the courthouse.",
      "content": "Research the neighborhood around the courthouse. This will help you avoid being late if you can’t find parking, or the entrance to the building. It will also help you plan for how to spend your lunch break. [5] X Research source There may be places to eat in the neighborhood that you haven’t heard of. There may be a nice park or plaza where you can eat your lunch if the weather is nice. After sitting in the courtroom all day, you’ll likely be ready to stretch your legs a bit."
    },
    {
      "title": "Chat with your fellow jurors.",
      "content": "Chat with your fellow jurors. Jury duty brings together people from all walks of life. You’re likely to meet people you’d never speak to otherwise. Be friendly, but avoid talking about politics or other sensitive topics that could be relevant to the case. [6] X Research source If the case goes to trial, or if it’s a grand jury, you could be spending quite a bit of time with these people. Be friendly and get to know them. Your fellow jurors are the only people you’ll be able to talk to much. The lawyers, witnesses, plaintiff and defendant are not allowed to socialize with you or to talk to you about the case."
    },
    {
      "title": "Ask if there’s a quiet room or lounge.",
      "content": "Ask if there’s a quiet room or lounge. Some courtrooms will have separate rooms designated for reading or working while you wait. When you sign in, ask if such a thing exists for jurors. [7] X Research source The lounge will sometimes have vending machines, coffee, or even a movie playing."
    },
    {
      "title": "Accept being on the jury.",
      "content": "Accept being on the jury. Jury duty is part of being a citizen. If you’ve been selected, your best course of action is to accept the reality of serving. Don’t try to get out of it by lying or exaggerating the hardship it will cause you. If jury duty would truly cause you financial hardship, be honest about that. Just remember that other people may be in the same boat. If you’re unemployed or underemployed, you may actually be making more money by serving on a jury."
    },
    {
      "title": "Take care of yourself physically.",
      "content": "Take care of yourself physically. As a juror, you'll probably be sitting for long periods of time. Besides being boring, this can make you fatigued and uncomfortable. Take advantage of breaks to stay healthy and keep yourself comfortable. During breaks, go outside and stretch your legs. Take a short walk, if you can. Drink water. It will help keep you alert and awake. If you have time in the morning exercise before heading to court. It will give you more energy for the day."
    },
    {
      "title": "Engage with the judicial process.",
      "content": "Engage with the judicial process. Many people who serve on a jury end up learning a lot about the judicial process. You may be surprised at how interesting the case is; or you may learn things about the system that you didn’t know. [8] X Research source Listen carefully to all instructions given to you by the judge. Always ask questions if you don’t understand something. Pay close attention to any educational videos they show you. Even if they’re boring, they’re meant to be informative."
    },
    {
      "title": "Take care of yourself emotionally.",
      "content": "Take care of yourself emotionally. If you're serving on a jury for a violent crime or something that hits close to home, serving on a jury can be emotionally intense. For some people it can even trigger past traumas. Do what you need to do in order to emotionally manage being on a jury. If the circumstances of a case are personally triggering to you, make sure the judge or the attorneys know that. You may be excused. Learn grounding and meditation techniques to use after each day, or after the trial is over. Some districts offer counseling services for jurors after the trial is over."
    },
    {
      "title": "Remember that your daily payment is not taxable.",
      "content": "Remember that your daily payment is not taxable. It may be a small amount of money, but it’s considered reimbursement for your time. This means that you don’t have to claim it on your taxes. That’s one small perk. [9] X Research source"
    }
  ]
}