{
  "url": "https://www.wikihow.com/Tweet-Someone",
  "title": "How to Send a Tweet to Someone on Twitter",
  "steps": [
    {
      "title": "Open X.",
      "content": "Open X. If you're using a computer, sign into https://www.twitter.com in a web browser. If you're using a phone or tablet, you can tap the X app (a black icon with a white X) on the home screen or in the app drawer. [1] X Research source You will need an X account to tweet at someone. If you don't have an account, you can create one . When you type a person's X username (e.g., @wikihow) anywhere in your tweet, this is called a mention . Mentioning a user in a tweet has different results depending on where you place their username."
    },
    {
      "title": "Click Tweet or +.",
      "content": "Click Tweet or + . On a computer, you'll see the big blue Tweet button on the left side of the page. On a phone or tablet, the + appears at the bottom-right corner."
    },
    {
      "title": "Type the person's X username beginning with \"@.\"",
      "content": "Type the person's X username beginning with \"@.\" For example, to tweet at wikiHow, you'd use @wikiHow . You'll get different results depending on where you place the person's username: At the beginning of the tweet: To tweet a specific person, begin the tweet with their @username (before the rest of the text). Only people who follow you both will see your tweet in their feeds. [2] X Research source Example: @wikihow I loved your article about sending tweets! All tweets you send will be visible on your own profile, even when you tweet people directly. If your X account is not private , anyone can see your tweets. If your account is private, only your own followers can see them. Anywhere else in the tweet: If you want to get someone's attention or link to their profile in a way that all of your followers will see on their feeds, place the @username anywhere except the beginning. You can mention multiple people in a tweet. Example: I just read a great @wikiHow article. You should check it out, @elonmusk! No matter how you mention @usernames in tweets, the people you mention will be notified that you've mentioned them. Their usernames will also appear as clickable links in your tweet."
    },
    {
      "title": "Type your tweet's content.",
      "content": "Type your tweet's content. Press the spacebar, then type the contents of your tweet. Tweets can be up to 280 characters in length, including hashtags, mentions, and links. [3] X Research source If you subscribe to X Blue, you can send longer tweets up to 4000 characters. [4] X Research source"
    },
    {
      "title": "Attach media to the tweet (optional).",
      "content": "Attach media to the tweet (optional). You can include up to 4 photos, one video, or a GIF in your tweet, as well as other features: Select the photo icon below the text box to insert photos or a video. Choose the GIF icon to attach an animated .GIF. Use the bar graph icon to add a poll. Select the pushpin icon to tag your location. In the X mobile app, you can also use the waveform icon to create a voice tweet."
    },
    {
      "title": "Click or tap Tweet to send.",
      "content": "Click or tap Tweet to send. Once you send the tweet, all mentioned users will be notified that they were mentioned in a tweet (as long as your tweets are visible to them). To see a list of tweets that other users have mentioned you in, click or tap the bell icon (on the left side of the page on a computer, and the bottom on the mobile app), then select Mentions ."
    },
    {
      "title": "Open X.",
      "content": "Open X. If you're using a computer, sign into https://www.twitter.com in a web browser. If you're using a phone or tablet, tap the X app (a black icon with a white X) on the home screen or in the app drawer. Replying to someone's tweet not only tweets your response directly to them, but it also adds your response to an ongoing conversation. Your followers won't see your replies in their feeds unless they are also following the user you're replying to (or they visit the Replies section of your profile). If your X account is private, the replies you send will only be visible to people who follow you."
    },
    {
      "title": "Go to the tweet you want to reply to.",
      "content": "Go to the tweet you want to reply to. You can scroll to it in your feed, or search for the user by typing their username into the search box."
    },
    {
      "title": "Click or tap the chat bubble icon.",
      "content": "Click or tap the chat bubble icon. It's below the bottom-left corner of the tweet. A pop-up containing a typing area will appear. If you just want to view replies to a tweet , click or tap the tweet itself to open it. You'll be able to see replies from public accounts, as well as private accounts that you follow."
    },
    {
      "title": "Type your response.",
      "content": "Type your response. You'll notice that \"Replying to @username\" appears at the top of the typing area automatically, so you won't have to type it yourself. You can then type up to 280 characters of text. If you want to mention another X user in your reply, type that person's username (starting with the \"@\" symbol) anywhere in the tweet. This will notify the person that you've tagged them in a tweet, and also adds a link to that person's profile in your reply. Just like when creating a new tweet , you can attach media to tweet replies. If you're replying to a conversation between two or more X users, you'll see both or all of their usernames next to \"Replying to.\" Everyone in that username list will receive a notification of your response."
    },
    {
      "title": "Click or tap Reply.",
      "content": "Click or tap Reply . This tweets your reply and adds your response to the thread. Tweets you reply to will also appear on your own X profile."
    }
  ]
}