{
  "url": "https://www.wikihow.com/Write-a-Speech-About-Yourself",
  "title": "How to Write a Speech About Yourself",
  "steps": [
    {
      "title": "Clarify the purpose of your speech.",
      "content": "Clarify the purpose of your speech. Is the purpose to explain why you've joined a class about metal working? Is the purpose to introduce your place and history with your company to a work seminar? Before you write a single thing down, you should have a clear idea about what this speech is meant to accomplish. Write down the purpose of your speech at the top of the page."
    },
    {
      "title": "Brainstorm on what important things you want to include.",
      "content": "Brainstorm on what important things you want to include. If the speech is a general introduction of yourself, include things like where you're from, how you ended up here in this group, what your passions and interests are, and what you hope to get out of this event or group. If this is a work-related speech, it would be wise to include things like your own qualifications and important skills, things that bolster your credibility and reason for being there. Ultimately it's up to you to decide what topics and ideas should make up your speech. [1] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source One method for brainstorming is to create a mind map. You can do this with a paper and pencil, starting by writing your central idea or theme in the middle of the page. Then use lines to connect ideas and points that branch off from this central idea. For a speech about yourself, you might start with a central bubble labeled \"Me\". Then you might have three or four bubbles connected to the central one that say things like \"Interests\", \"Aspirations\", etcetera. Then as you continue branching out the bubbles will get more specific. There are other methods for brainstorming you might find useful. You could try the alphabet method, where you list a few things related to the subject of your speech for each letter, starting with A and working down. Another brainstorming method is the three perspectives method. You think about the subject of the speech in three perspectives. First, describe the subject, which is yourself in this case. Then, trace it. Trace your history, where you came from and where you've come to, and how you've changed over that journey. Finally, map it. Think about who and what has influenced you and how. How do you fit into the bigger picture. [2] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Tailor your content to your audience and purpose.",
      "content": "Tailor your content to your audience and purpose. First, determine who your audience is. It could be work colleagues, classmates, a hobby group, etcetera. Think about how big the audience will be, what the age range will be like, and why the audience has gathered. Then, think about what your audience is interested in. What is it about you that you think people would want to know? What kind of information are they expecting? Ask yourself these questions and then decide how the answers will inform the content of your speech. [3] X Research source It's worth thinking about various aspects of the audience, because this will determine various aspects of your speech, such as its length, its tone, etcetera. For example, if your audience is a wedding reception, and this is a best man speech, your audience will be most interested in your relationship with the groom and your history with him. You also don't want a speech like this to drag on because the best man isn't the focal point of the event."
    },
    {
      "title": "Review your assignment.",
      "content": "Review your assignment. Before you write anything, you need to understand your assignment fully. Look over the guidelines and purpose of the assignment. This will likely tell you how long the speech should be, what ideas need to be included in it, etcetera. For example, a two minute speech is going to be written very differently from a ten minute speech, so knowing what guidelines you're working with will affect the rest of the writing process. [4] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source The most important difference between a long and a short speech is the amount of detail. A two minute speech in which you introduce yourself to a class will have a short intro that might be just your opening statement. There might be only a paragraph or two in the body of the speech, and the conclusion will probably be only a sentence or two. A ten to fifteen minute speech will have an introduction that in itself has a beginning, middle, and end, an opening statement, an introduction fo the main points of speech, and a summary of the main theme. The body might consist of four to six paragraphs, and each one will include both explanations of the main points, as well as examples. The conclusion will be a lengthier summary, and might include a sentence or two that ties the theme of the speech into a broader context."
    },
    {
      "title": "Write an outline.",
      "content": "Write an outline. Before you start writing the main meat of the speech, you'll want to create an outline. With a word processor, or pencil and paper, write \"Introduction,\" \"Body,\" and \"Conclusion.\" Then sum up the main points in each section with bullets. You don't even have to use full sentences here. Just get down quick summaries of what each section of your speech will contain. [5] X Research source Depending on the length of your speech, you may need to break up the body section into multiple parts, like \"Paragraph 1,\" \"Paragraph 2,\" etcetera. Speeches two minutes and shorter should have one or two main points, which can probably fit into a single body paragraph. Speeches between two and five minutes should have two to three main points, given a paragraph each in the body. Longer speeches, over five minutes, should have up to five main points, given a paragraph each in the body. At this stage, you should also begin thinking about how your content will be organized. For a speech about yourself, it would make sense to either organize your content chronologically, with each main point being a different period in your history, or topically, with each main point as a different topic related to yourself."
    },
    {
      "title": "Plan your opening statement.",
      "content": "Plan your opening statement. Depending on what this speech is for, and who your audience is, you can start your speech in several different ways. [6] X Research source If this is a simple, short speech, meant to introduce you to your class or group, you can start with a basic introduction that includes a brief greeting, your name, and the purpose of the speech. This can look something like \"Good morning everyone! My name is so-and-so and I'd like to take this chance to introduce myself to the group.\" If this speech about yourself is for a more specific purpose than just introducing yourself, you may want to make the introduction a little more entertaining and interesting. You can start with a provocative question, a shocking fact, a joke, or an evocative image. For example, if your speech is about an interesting aspect of your life, like your unusual profession, you can start with something like \"Imagine waking up every morning to sound of safari wildlife in every direction around you.\""
    },
    {
      "title": "Finish the introduction.",
      "content": "Finish the introduction. Your introduction should outline what your speech will be about. You should summarize what the body of your speech will include, and why you're giving this speech. [7] X Research source For example, if you're giving a small speech about yourself to your class you can say something like \"First I'll tell you a little bit about my past, and then I'll tell you about some of my interests and aspirations. I'll close with my plans for my career.\""
    },
    {
      "title": "Continue with the body of the speech.",
      "content": "Continue with the body of the speech. Depending on the purpose of your speech, the body might be one paragraph or several. If you're using several paragraphs, make sure each paragraph has its own intro, body, and conclusion. For each main point or idea in your speech, a paragraph should be made. And these body paragraphs should start with an introducing sentence on the purpose of the paragraph, the content, and then a summary of the paragraph and its relevance to the speech as a whole. [8] X Research source For example, if you're writing an introductory speech for a college organization, like a photography club, you might start the body with a paragraph about how you got interested in photography. The opening sentence might go like \"Photography caught my interest very early on, especially with its ability to caption and preserve life's precious moments.\" The closing sentence might look like \"Since then, I've been eagerly pursuing more knowledge on the ins and outs of what makes a photo great.\""
    },
    {
      "title": "End with a strong conclusion.",
      "content": "End with a strong conclusion. Don't overthink this. The conclusion is just a paragraph summing up your entire speech. Summarize the main points of your speech, and answer any questions from your introduction. But do so in a way that leaves an impression. The conclusion should tie everything together and make the speech more universal. [9] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source For example, if your speech was about your interest and experience in the film industry, you can tie your own experiences with the idea of cinema on a grand scale. The conclusion should focus on the overarching importance of the topic of your speech. If your speech is simply to introduce yourself, you can end with a less grand conclusion. The conclusion of a self-introduction speech should reiterate and summarize the most important parts of your speech, the main details about yourself that you shared."
    },
    {
      "title": "Take inspiration from other speeches.",
      "content": "Take inspiration from other speeches. Some people learn best by example. It can be helpful to look at examples of other speeches when starting your own. Do a search for \"sample self introduction speeches\" to locate some examples of speeches about oneself."
    },
    {
      "title": "Edit your speech.",
      "content": "Edit your speech. Since speeches are heard, not read, proofreading for spelling and formatting isn't as important, but that doesn't mean you shouldn't be editing. Read back through your speech after you've written. Mark passages and words that you think you could improve. Don't think of the first version as a final draft, but a rough draft. [10] X Research source Read your speech out loud as well. This will help you hear the rhythm of the speech and make adjustments to improve its flow. Fragments are okay, as long as they're used sparingly. Use active verbs in favor of passive ones. When reading your speech out loud to yourself, note any sentences that are too long to be spoken comfortably in one breath. Split these sentences up as you edit."
    },
    {
      "title": "Include signposts.",
      "content": "Include signposts. Signposts in speeches allow the audience to easily follow along with your ideas and the movement of your speech. They signal when you move to a new idea, where in the speech you are, whether it's the start, middle, or end, and how two ideas relate to each other. When running through a short list of ideas, numeric signposts are used like \"first,\" \"second,\" and \"third,\" or \"firstly,\" \"secondly,\" and \"thirdly.\" Signposts that show how two ideas relate to each other include, \"furthermore,\" \"in addition,\" \"nevertheless,\" \"however,\" \"subsequently,\" and \"for instance.\" Major signposts tell the listener where in the speech you are. For example, the first paragraph will often start with something like, \"I'd like to start by...\" and the final paragraph will often start with something like \"To summarize...\""
    },
    {
      "title": "Avoid cliches.",
      "content": "Avoid cliches. For example, don't say \"In conclusion...\" or \"thank you\" at the end of your speech, just conclude it. [11] X Research source Don't start with something like \"Today I'll be talking to you about...\" Find a more interesting way to introduce your topic. Overused phrases like these don't add anything valuable to your speech. What do you replace cliches with? First you have to deduce the basic meaning of the cliche phrase, then you can either think of a more interesting way to say the same thing, or, in many cases, you can forgo the phrase entirely. For example, the phrase \"in conclusion\" means that you are signaling that you going to summarize all the ideas previously stated. This can be replaced by something like, \"So what does this all mean?\" or \"I've told you a lot about myself. Here's the reason.\" Often, cliche phrases are just filler that don't add anything important to the speech. Instead of saying, \"Today I'll be talking to you about...\" just start talking about it."
    },
    {
      "title": "Talk about yourself with humble confidence.",
      "content": "Talk about yourself with humble confidence. Talking about yourself can sometimes feel awkward. In order to make your audience as interested and accepting as possible, make sure to speak with humble confidence. Read through your speech carefully, identify any instances of arrogance or self-shaming, and adjust them to sound humbly confident instead. [12] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Avoid speaking too highly of yourself. For example, saying \"everyone know's that I'm the best soccer player on the team...\" when receiving the captain award in the presence of your entire soccer team probably won't go over well. If, for example, you're the best soccer player on your team, you can instead humbly highlight your accomplishments by saying something like, \"I've beat my personal record this season and scored 12 total goals. While it feels great to set this record, I know that it wouldn't be possible without the hard work and help of my teammates.\" If you feel uncomfortable, it's okay to add some humor or briefly acknowledge that you feel awkward about talking about yourself. This will just make your audience feel like they can relate better to you."
    },
    {
      "title": "Find a friend or teacher who can help.",
      "content": "Find a friend or teacher who can help. In addition to reading through the speech on your own and making necessary edits, find someone to read through and edit it for you. It can be helpful to have another set of eyes look over your speech, and look for places where it could use improvement. It's likely that a friend, colleague, teacher, or peer will be able to notice things that you didn't pick up. [13] X Research source"
    }
  ]
}