{
  "url": "https://www.wikihow.com/Tie-Someone-Up",
  "title": "Bondage 101: How to Tie Up Your Lover, Explained",
  "steps": [
    {
      "title": "Gain positive verbal consent to what will, and what will not occur.",
      "content": "Gain positive verbal consent to what will, and what will not occur. Have a candid conversation , preferably face-to-face, about exactly what is acceptable, and what is not. Should there be any wavering on what the nature is of what you are both agreeing to, then take the time to write everything down, yes, everything. When you both can agree on everything, sign it. This is for your own individual peace of mind (and be aware it doesn't provide a legal basis for what you've agreed to); it becomes a matter of two-way integrity and consent---or you shouldn't agree to then DO anything. Candidly respect each others' needs and wants, not only during this up-front necessary conversation, but also during subsequent actions, or 'scenes'."
    },
    {
      "title": "Use sturdy rope that doesn't stretch.",
      "content": "Use sturdy rope that doesn't stretch. Materials that stretch can get tighter—and that's not something you want to happen. You can buy suitable rope at any hardware store, but the strength, texture, and material can make a difference in your experience. Here are some options for you to consider: [2] X Research source Hemp: a soft natural rope of medium strength that knots easily Jute: a natural rope of lighter and weaker strength than hemp, also knots easily Nylon: a very strong synthetic rope, typically considered too slippery for beginners Polyester: a strong synthetic rope, typically stiffer than nylon"
    },
    {
      "title": "Get enough rope to complete the scene you've chosen.",
      "content": "Get enough rope to complete the scene you've chosen. It'll be quite the let-down if you get halfway into a beautiful bind and realize you've run out of rope! The amount of rope you'll need does depend to some extent on the size of your partner and the intricacy of your bind, but most basic binds can be completed with the following: [3] X Research source 3 \"main\" ropes, each 25-30 feet (7-8 meters) long 1 smaller rope, 10-15 feet (3-4 meters) long You can also use household items, like a tie or a scarf."
    },
    {
      "title": "Practice making basic knots in the rope.",
      "content": "Practice making basic knots in the rope. Maybe you have experience tying knots in other contexts, such as camping or boating. If so, you can bring that knowledge into play here! Otherwise, it's a good idea to play around and get some practice before you tie someone up. [4] X Research source If you've never used rope before, you might want to start with a couple of different types. As you play around with them, you'll get a better feel for which types of rope you like the best and which are easiest for you to manipulate. It's a really good idea to take a rope class before you start tying someone up. If you don't have access to a class, there are plenty of good books out there (Midori is a great author). There are lots of tutorial videos online if you need a little extra guidance learning to tie knots. Just search for the type of knot you want to learn."
    },
    {
      "title": "Combine basic knots to form a single-column knot.",
      "content": "Combine basic knots to form a single-column knot. Fold your rope in half and wrap it around the object. Place the top of the loop (the \"bight\") on top, then pull the tail through it to form a lark's head. Reverse the tension and wrap the rope back around, running the second wrap around the side opposite the direction you want the tail to go when you're done. Pull the tail through the bight you formed when you reversed the tension on the rope, creating another lark's head. Then, lock it off with a half-hitch knot. [5] X Research source A single-column knot is secure and won't tighten or collapse on its own or under pressure, which makes it an ideal knot for bondage—especially if it's part of your scene for your partner to struggle. Once you become familiar with this knot, it typically takes only about 30 seconds to tie. This knot works well for most scenes and can be used to secure your partner to furniture or to tie limbs together."
    },
    {
      "title": "Tie your partner to a piece of furniture.",
      "content": "Tie your partner to a piece of furniture. Choose sturdy furniture that won't give way if you tie someone to it, especially if it's part of your scene for your partner to struggle. Use single-column knots to bind your partner's limbs to a narrow part of the furniture. The configuration is up to you—get creative! For example, you might have your partner sit in a chair, then tie their legs to the chair legs. From there, you can tie their arms to the arms of the chair or, if the chair doesn't have arms, tie their arms or wrists together behind their back. Always make sure that you can slip a finger in between the binding and the person's wrist—that way, you know it isn't too tight."
    },
    {
      "title": "Bind your partner in a sexual position for an easy tie.",
      "content": "Bind your partner in a sexual position for an easy tie. This is especially helpful if sexual play is going to be a part of your scene. Just get your partner into the position first, then secure their arms and legs using single-column knots. Never use a slip knot, as it could tighten on its own and cause a pinched nerve or loss of circulation. [6] X Research source For example, you could secure your partner's wrists and ankles to 4 posts (of a bed , typically) in a spread eagle position. You can also tie your partner's wrists together, then secure them over your partner's head. To mimic the \"rear entry\" position, have your partner get on their hands and knees, then lower their shoulders and drop their arms behind them and along their sides. From there, you can bind the arms and legs together on either side using single-column knots."
    },
    {
      "title": "Try a frog tie if your partner has flexible legs and hips.",
      "content": "Try a frog tie if your partner has flexible legs and hips. With a frog tie, your partner is on their back with their legs in the air and their knees bent. Then, you bind their ankles to their thighs. You can also bind their arms above their head, across their body, or however you want. [7] X Research source The frog tie can be an incredibly vulnerable position for your partner, especially if they're unclothed. Check in on them often to make sure they're comfortable."
    },
    {
      "title": "Hogtie",
      "content": "Hogtie your partner if they have upper-body flexibility. Have your partner lie on their stomach with their legs extended behind them. Tie their ankles together, then tie their wrists together behind their back (this requires your partner to have relatively flexible shoulders). Raise their ankles behind their buttocks, then loop another rope around to tie their ankles and wrists together at a single point. [8] X Research source This position also requires quite a bit of spinal flexibility because of the backbend. However, the nature of the tie gives you some leeway here. If they can't bend their spine backward very much, you can simply use a longer rope to tie the ankles to the wrists so they have more space."
    },
    {
      "title": "Communicate openly while you're on the scene.",
      "content": "Communicate openly while you're on the scene. If you're the one doing the tying, you're in charge and your partner's safety is your responsibility. Safety is important, but so is fun—and if your partner starts feeling uncomfortable, they're not having fun anymore. If roleplaying is part of your scene, set up code words and phrases with your partner ahead of time so you can check in with them without interrupting the scene. [9] X Research source If you have the person's arms and legs bound, ask about them specifically. If they can't feel their hands or feet, take off the rope immediately—you don't want them to lose circulation. Speak up if you're the one being tied up and you feel pain or severe discomfort, or if a part of your body starts to feel cold or numb. Even though your partner should be checking in on you every few minutes, don't wait if you have an issue. If your scene includes gagging your partner, make placing the gag your last step. Have a communication system in place after you gag your partner so they can still let you know if they want to stop."
    },
    {
      "title": "Check the rope's tension if you change your partner's position.",
      "content": "Check the rope's tension if you change your partner's position. If your partner isn't tied to furniture, you'll have the ability to move them around once you've tied them up. However, changing positions can also change the tension on the rope, making it too tight where previously it was fine. Place 2 fingers between your partner's skin and the ropes every time you move them. [10] X Research source With practice, you can do this quickly so that it doesn't interrupt your scene."
    },
    {
      "title": "Discuss",
      "content": "Discuss your plans with your partner before you begin. Open and honest communication is essential due to the riskiness of rope play. Make sure you understand your partner's physical needs, condition, and preferences about being tied up. Here are some topics to get you started: [11] X Research source Background and experience: How long have you been working with rope? Has your partner ever been tied up before? Does your partner have any experience tying other people up? Health conditions: Does your partner have any circulatory, respiratory, or neural issues? Are they currently taking medication for any condition? Placement and preferences: Does your partner prefer certain types of rope over others? Are there parts of their body where they don't want rope? Are there parts of their body that are off-limits? Will your partner be clothed, and to what extent?"
    },
    {
      "title": "Outline the scene you'll be doing.",
      "content": "Outline the scene you'll be doing. It's entirely possible that you're just doing this to get some practice with rope and tying someone up. But usually, you want to tie someone up as part of a larger scene. Both you and your partner need to be on the same page in terms of what will happen once they're tied up. Here are some things to consider: [12] X Research source Setting: Are you tying your partner up as part of a role play scene? If so, clearly define the roles and their expectations. Sexual play: Will sexual play be a part of your scene? Will there be sexual touch while you're tying your partner up, or only after you're done? Do you and your partner have a particular dynamic or power exchange (typically Dominant/submissive)? Aftercare: How will you signal when the scene is over? What does your partner need from you after the scene is over? Will you leave immediately after the scene or stay for a while?"
    },
    {
      "title": "Pick a safe word for your partner to use.",
      "content": "Pick a safe word for your partner to use. The idea of using a safe word might seem intimidating, especially if you and your partner don't have a lot of experience with bondage—but it doesn't need to be a big deal! The safe word simply stops the scene entirely and frees your partner. It should be a word that both of you are comfortable with and will remember. [13] X Research source Remembering a safe word in the moment can be the most difficult part of having a safe word. For this reason, a safe word chosen by the person being tied up is often best. Some couples use the red-yellow-green traffic light system, with \"red\" as the \"safe word\" that immediately ends the scene. \"Yellow\" means that the person is approaching their limit. This system works best if you check in with your partner regularly and ask specifically about the color of their traffic light. It's possible to substitute a specific safe word for open communication. If your scene doesn't involve any kind of role play, you can simply ask your partner how they're feeling. If they say they aren't comfortable or don't want to do it anymore and you immediately untie them, you've fulfilled the purpose of a safe word."
    },
    {
      "title": "Let your partner see and feel your rope.",
      "content": "Let your partner see and feel your rope. Keep in mind it's going to be directly against their skin, so they should have the final word on the material you use—even if that means you have to go out and buy something else. For example, if your partner has a grass allergy, jute or hemp rope might make them break out in hives. [14] X Research source You might also try a practice knot so your partner can get used to how the rope feels against their skin. This can be especially helpful if your partner has never been tied up before."
    },
    {
      "title": "Test out positions for comfort before you start tying.",
      "content": "Test out positions for comfort before you start tying. The best position to use depends on your partner's flexibility and stamina. Your partner might be able to get in a position easily, but that doesn't mean they can hold that position for an hour or longer. [15] X Research source If it's the first time for either you or your partner, go with a position in which your partner's body is supported at all times, such as sitting in a chair or lying on a bed. This allows them to relax so they don't have to rely on their own muscles to hold the position."
    },
    {
      "title": "Check the tightness of your knots with the 2-finger test.",
      "content": "Check the tightness of your knots with the 2-finger test. Any time you wrap rope around any part of your partner's body, you should be able to easily slip 2 fingers between the rope and your partner's skin. Even if you're practicing on an inanimate object, it's good practice to get in the habit of using this test. Remember to check the tightness at various points, not just one! If the rope is too tight at any point, you risk damaging nerves or cutting off circulation."
    },
    {
      "title": "Pack an emergency kit with something to cut the rope.",
      "content": "Pack an emergency kit with something to cut the rope. EMT shears work well for this, but it still might take some time to cut the rope. It's worth taking some time to practice cutting the rope under tension so you can do it as quickly as possible if you need to. [16] X Research source Include bottled water and some snacks in your emergency kit, especially if you have a longer scene planned. Factor in how long it will take for you to complete the tie as well as what you have planned after your partner's tied up. Put some drinking straws in your emergency kit if your partner's hands are going to be tied up. It can be difficult to give someone a drink out of a bottle—straws are typically much easier to use."
    }
  ]
}