{
  "url": "https://www.wikihow.com/Use-Tea-Tree-Oil",
  "title": "How to Use Tea Tree Oil",
  "steps": [
    {
      "title": "Tea tree oil works slowly, but is less harsh than other options.",
      "content": "Tea tree oil works slowly, but is less harsh than other options. Twice a day after washing your face with lukewarm water, dip a cotton ball in a 5% tea tree oil gel (or a homemade carrier oil mix). [2] X Expert Source Lorena Barcal Clinical Herbalist & Clean Beauty Specialist Expert Interview. 28 June 2020. Dab this over your acne. It might take a couple months to notice a big improvement. This is less likely to irritate your skin than the stuff you'd typically find at a drug store (like benzoyl peroxide). [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source (And those drugs aren't much faster anyway. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source ) Using a stronger mix is a gamble—it might work faster, but you might also become allergic and have to stop using the oil. Alternatively, you can use borage seed oil or niacinamide. [5] X Expert Source Kaveri Karhade, MD Board Certified Dermatologist Expert Interview. 11 January 2021. It may be better to see a dermatologist and find out what type of acne you have and the best way to treat it. [6] X Expert Source Kaveri Karhade, MD Board Certified Dermatologist Expert Interview. 11 January 2021."
    },
    {
      "title": "Use the oil on the skin twice a day.",
      "content": "Use the oil on the skin twice a day. Treat each area with a fresh cotton bud or wipe dipped in a 5% tea tree oil mix. This isn't a cure-all, but there's a good chance it will help keep symptoms down. Besides fighting bacteria, fungus, and viruses directly, tea tree oil can also help with pain and inflammation. [7] X Expert Source Lorena Barcal Clinical Herbalist & Clean Beauty Specialist Expert Interview. 28 June 2020. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It might even help with warts. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source But most warts require intensive treatments. [10] X Expert Source Kaveri Karhade, MD Board Certified Dermatologist Expert Interview. 11 January 2021. Talk to a doctor first before treating deep cuts or puncture wounds that got infected. Never use tea tree oil to treat burns, whether or not they're infected. [11] X Research source Tea tree oil isn't great for most rashes, but you can use it on rashes caused by an allergy to nickel. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Use a strong tea tree oil mix on athlete's foot twice a day.",
      "content": "Use a strong tea tree oil mix on athlete's foot twice a day. Wash your feet with soap and water, dry between the toes, then wipe a tea tree oil mix onto your skin wherever you see the fungus. Doing this twice a day for at least a few weeks can help clear up symptoms—or even cure the athlete's foot, if you're lucky. [13] X Research source You'll have better chances if you go strong, between 25% and 50% tea tree oil and the rest carrier oil. [14] X Research source However, that does mean you're at a higher risk of becoming allergic, which is a pity if you like using tea tree oil for other things. [15] X Research source If you don't want to risk that, try an athlete's foot treatment from the pharmacy instead."
    },
    {
      "title": "Wipe pure tea tree oil onto the nail twice a day.",
      "content": "Wipe pure tea tree oil onto the nail twice a day. Use a cotton bud to dab the tea tree oil onto the nail wherever you see the fungus. Since this isn't going on your skin, it's good to use 100% oil for maximum fungus-fighting powers. This is a regular maintenance option that can make your nails look better. Complete cures are unfortunately not all that common. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you need more oil, use a fresh cotton bud instead of double-dipping."
    },
    {
      "title": "Mix a few drops into a bottle of regular shampoo.",
      "content": "Mix a few drops into a bottle of regular shampoo. Shake it up well, and shake again before using it each time with your regular schedule. Over a few weeks, this can make your dandruff-suffering scalp less itchy and greasy. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you feel like busting out the scales and droppers, you can measure out a stronger treatment, with up to 5% tea tree oil and the rest shampoo. There's a chance that the tea tree oil can separate out and float to the top. Remember to shake it up each time to avoid stinging your scalp. (If you are also mixing in other essential oils that are less safe than tea tree oil, it might be smarter to make a new mix each time in a small dish. [18] X Research source )"
    },
    {
      "title": "Add two or three drops to a pot of hot water and inhale the steam.",
      "content": "Add two or three drops to a pot of hot water and inhale the steam. Drape a towel over your head, similar to a tent, and lean forward over the steam. This is a traditional treatment from the area of Australia where tea tree grows. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Talk to your doctor first if you have asthma or other chronic lung or sinus issues. Do not drink the water. Tea tree oil is toxic to drink."
    },
    {
      "title": "Shake together 2 teaspoons (9.9 mL) tea tree oil and 2 cups (470 mL) water.",
      "content": "Shake together 2 teaspoons (9.9 mL) tea tree oil and 2 cups (470 mL) water. Add to a spray bottle and spray directly onto any hard surface that needs cleaning, then wipe off with a sponge or paper towel. On visible mold and mildew that doesn't wipe off, spray until wet, let soak for at least an hour, then scrub with water. [20] X Research source If the bottle is transparent, store in a pitch-black cupboard so light and heat don't break down the oil. You can use distilled white vinegar instead of water. [21] X Research source This makes your spray a little better for general grime and gunk. Tea tree oil is toxic when swallowed. If you have infants or pets around, block off their access to the room until you have wiped the tea tree oil away. Rinse the surface thoroughly when you're done. Oil and water don't mix, so you'll have to shake again thoroughly before each use."
    },
    {
      "title": "Use it in the rinse cycle to help with mold or unpleasant smells.",
      "content": "Use it in the rinse cycle to help with mold or unpleasant smells. Add a few drops of pure tea tree oil to the rinse cycle compartment of your washing machine. This could help if your washing machine smells a little funky, or if there are damp clothes sitting too long that need a quick refresh. [22] X Research source"
    },
    {
      "title": "Mix up to 20 drops per 1 tablespoon (15 mL) of oil for a soothing bath.",
      "content": "Mix up to 20 drops per 1 tablespoon (15 mL) of oil for a soothing bath. Stir the mixed tea tree and fractioned coconut oils together thoroughly. Pour 1 tablespoon (15 mL) into the bathtub to give it a slight tea tree oil scent. [23] X Research source (This is a pretty strong, piney scent, so take care not to overdo it.) Don't add the tea tree oil directly to the bath water. Since oil and water don't mix, the pure oil will float to the top and give your skin a harsh tea tree oil blast instead of a relaxing bath. Mixing it into any vegetable oil will prevent this, but fractionated coconut oil is a good choice since it feels silky instead of greasy. [24] X Research source If you use a lot of essential oils, you can order some alternatives to fractionated coconut oil online that are designed for this."
    },
    {
      "title": "Tea tree oil is toxic when swallowed.",
      "content": "Tea tree oil is toxic when swallowed. Drinking or eating it could make you lose control of your muscles, make you confused or disoriented, or even knock you out out. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Tea tree oil is dangerous to cats, dogs, and possibly other animals.",
      "content": "Tea tree oil is dangerous to cats, dogs, and possibly other animals. Never use anything with tea tree oil directly on your pet's skin and fur. Even products marketed for pets can kill them. When cleaning with tea tree oil, keep pets away and wipe the area with plain water afterward."
    },
    {
      "title": "Put a few drops of diluted oil under a bandage and see how you react.",
      "content": "Put a few drops of diluted oil under a bandage and see how you react. Take the product you intend to use (not pure tea tree oil) and put a couple drops onto the pad of a bandage. Leave the bandage on your forearm for 48 hours (or until you react). If your skin gets itchy or red, you're allergic and should avoid putting tea tree oil on your skin. [26] X Research source If you have a bottle of pure 100% tea tree oil, dilute it in a carrier oil first. Avocado oil and jojoba oil are a couple popular options, but any common vegetable or nut oil should work (but not another essential oil). It's best to dilute it to 3 to 5% concentration. [27] X Research source"
    },
    {
      "title": "Tea tree oil is safest when diluted.",
      "content": "Tea tree oil is safest when diluted. Pure tea tree oil on your skin is pretty low-risk, but it can cause skin rashes in some people. [28] X Research source Using products with only 5% or less tea tree oil is a good rule of thumb for your skin. [29] X Research source ) If you have no reaction to that, then it's okay to try strong mixes (10% and up) for fighting infections like athlete's foot. [30] X Research source Stop using tea tree oil on your skin if it causes irritation or redness. [31] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can become allergic to it even if you've been fine in the past. Store tea tree oil away from light, air, and heat, which break it down and make it more irritating to skin. [32] X Research source An opaque, airtight container in the fridge is a good option. Use at your own risk if you are pregnant or breastfeeding. [33] X Research source There may also be side effects in prepubescent children. [34] X Research source If you have pure tea tree oil, you can dilute it yourself in a carrier oil, weighing out the amounts with a sensitive scale. Counting drops is much less accurate, but as a *very rough* estimate, 1 drop of essential oil for every 1 teaspoon (4.9 mL) carrier oil makes a 1% concentration. [35] X Research source"
    },
    {
      "title": "Get personalized medical advice for sensitive places.",
      "content": "Get personalized medical advice for sensitive places. Wet, interior places (\"mucosal membranes\") like the mouth, nose, vagina, eyes, and ears are extra sensitive. Most essential oils are way too strong for them. Tea tree oil is an exception that has been used in these areas, for instance against yeast infections. [36] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source However, that doesn't mean it's safe to experiment at home. Talk to your doctor first, and use a commercial product that's been tested for that use instead of making your own medicine. Since tea tree oil is toxic when swallowed, using it in the mouth is especially risky. Use low concentration (2.5%, for instance) products only, do not swallow, and do not let children use it."
    }
  ]
}