{
  "url": "https://www.wikihow.com/Talk-to-a-Shy-Person",
  "title": "How to Talk to a Shy Person",
  "steps": [
    {
      "title": "Give them a warm introduction.",
      "content": "Give them a warm introduction. Approach the shy person with a friendly face and tone. Avoid getting too close or rushing up to them; instead, be calm about the interaction. You might also ask them a question about themselves to break the ice and get the conversation flowing. [1] X Research source For instance, you might say “Hey Terry! I’m glad to see you. Did I see you at the movies last night?” If you have never officially met them before, introduce yourself and tell them you’re glad to meet them."
    },
    {
      "title": "Carry the conversation in the beginning.",
      "content": "Carry the conversation in the beginning. If they don’t know you well, the shy person is unlikely to begin chatting, so you'll have to lead the discussion. Be mindful of this during the interaction and don’t expect tons of chatter from them. [2] X Research source You can start off by saying something like “Did you know there were free donuts in the break room?” Don't be put off or insulted if they only provide short or brief answers at first. It may take them some time to warm up."
    },
    {
      "title": "Choose topics you know they can contribute to.",
      "content": "Choose topics you know they can contribute to. Before or while you speak to them, make note of things they do well or things they like. If you know where they’re from or things they’re interested in, use this to make conversation. This helps ensure that they have something to talk about. [3] X Research source You can say something like “So, you’re from Fayetteville? I used to go there a lot with my mom. Did you like living there?” or “I noticed that you were wearing a Princess Leia shirt the other day. I really like Star Wars! What’s your favorite movie of the series?"
    },
    {
      "title": "Ask about their hobbies.",
      "content": "Ask about their hobbies. You and the shy person might have more in common than you know. Ask them about what kinds of things they like to do in their spare time. Share the things you like to do, as well. [4] X Research source Say “Lately, I’ve really been into reading dystopian fiction books like “Fahrenheit 451”. What do you like to do for fun?”"
    },
    {
      "title": "Ask for recommendations.",
      "content": "Ask for recommendations. A shy person may feel uncomfortable talking about themselves, but they may enjoy having conversations about other topics. You can get to know them by asking for recommendations for books, shows, movies, and fun activities. For example, if you notice them reading a book, ask them if it is good. You can ask if they have read the author before or if they have reading suggestions. If you're at a social function, you can ask the person what they enjoy doing in the area. Where are their favorite places to go?"
    },
    {
      "title": "Opt for topics deeper than small talk.",
      "content": "Opt for topics deeper than small talk. Shy people tend to dislike small talk, so avoid discussions of things like the weather. Instead, focus on things like their likes, dislikes, work, children or academic interests. [5] X Research source You might say something like “I remember that you used to be really interested in WWII. Have you been to any cool museums or seen any recent movies about it?”"
    },
    {
      "title": "Ask open-ended questions.",
      "content": "Ask open-ended questions. Instead of asking questions that only require one or two word responses, dig a little deeper. Since shy folks tend to dislike small talk, ask them questions that will help you get to know them better and that’ll allow them to talk about themselves. Ask things like “So, why’d you decide to move here?” or “How do you get up so early to work out every day?”"
    },
    {
      "title": "Manage awkward silences by changing the topic.",
      "content": "Manage awkward silences by changing the topic. Even when you aren’t shy, awkward silences can be painful. Instead of sitting in silence, introduce them to friends of yours who are nearby, or have conversation topics on hand to continue your talk. You can even offer to go get them a drink or snack if you are at a luncheon/mixer. For instance, you might discuss school, work, or the latest political or social headlines. At large parties or social functions, it may be difficult to hold a long conversation. If the conversation stalls, ask the person if they want to meet up another time to continue your talk one on one."
    },
    {
      "title": "Gauge how interested they are in the conversation.",
      "content": "Gauge how interested they are in the conversation. Even when someone is shy, you can still tell if they’re engaged in the discussion. If they’re responsive to your open-ended questions, looking at you, or smiling, they’re probably interested. However, if they have their body turned away from you and have a blank facial expression, they might not want to be bothered. [6] X Research source Give them their space if they’re uninterested. Remember that that’s okay - at least you tried. You can say something like “Well, I’m glad we got to talk, Josh. Hope you have a good day.”"
    },
    {
      "title": "Give them time to warm up.",
      "content": "Give them time to warm up. Shy people need a little more time to get comfortable than others. They might be feeling intimidated or nervous. Start one day by telling them ‘hello.’ The next day, greet them and make a comment about the cool watch or shirt they’re wearing. The next day, try to have a full-on conversation with them. [7] X Research source Also, be aware that every talk you have with them doesn’t need to be long. You can get to know them over time."
    },
    {
      "title": "Respect their boundaries.",
      "content": "Respect their boundaries. Give them the space that they need and respect their decisions. Shy people may need more alone time, and that’s okay. Though you may want to be social with them, give them some room to breathe. [8] X Research source For instance, if they say they don’t want to go to lunch with you and your other coworkers, don’t try to force them. They may really value quiet time at lunch or they may not like being in large groups."
    },
    {
      "title": "Use their name casually throughout conversation.",
      "content": "Use their name casually throughout conversation. People respond well to hearing their name being used. It helps to establish comfort and closeness. When speaking to them, use their name every so often. [9] X Research source Say something like “So Vicky, I really like all your clothes. Where do you get them from?” Don’t overdo it, though. Try to use their name only once every three minutes or so."
    },
    {
      "title": "Use appropriate body language.",
      "content": "Use appropriate body language. Shy people tend to be uncomfortable with direct eye contact, but eye contact is important to show you’re listening. To manage this, look at them only occasionally. In addition, give them a friendly smile when first greeting them. Don't get too close into their personal space. Maintain a friendly distance as you talk. If they seem uncomfortable, try scooting back a little bit and see if they relax."
    },
    {
      "title": "Don’t comment about how shy or quiet they are.",
      "content": "Don’t comment about how shy or quiet they are. Even if they are super quiet, don’t make a comment about it. They are likely aware of their shyness and may be trying really hard to be liked. Keep quiet about it and continue making conversation. [10] X Research source"
    },
    {
      "title": "Use technology to communicate with them.",
      "content": "Use technology to communicate with them. Maybe you are shy too and want to break the ice online before you do so in person. Send them a message on social media or text them if you have their number. [11] X Research source You can send something like “Hey Maddox, I’m glad we have the same English class this year. Do you understand the homework assignment we have to do?”"
    },
    {
      "title": "Help them if you see them struggling.",
      "content": "Help them if you see them struggling. Another great way to start a conversation is to help them when they’re in need. If you see them struggling to unlock their bike or clean up coffee they spilled, give them a hand. [12] X Research source"
    },
    {
      "title": "Do an activity together.",
      "content": "Do an activity together. Another great way to break the ice is to do something fun or productive together. Maybe your teacher has told you to pair up for an assignment; ask them if they want to work with you. Finding small ways like this to engage with them over time can help you two get to talking in no time!"
    }
  ]
}