{
  "url": "https://www.wikihow.com/What-to-Say-to-Someone-Before-Surgery",
  "title": "15+ Things to Say to Someone Before Surgery",
  "steps": [
    {
      "title": "Keep your well-wishes optimistic to lighten the person's mood.",
      "content": "Keep your well-wishes optimistic to lighten the person's mood. They're probably worried and anxious about the procedure, so a quick message wishing them well can help them keep a positive attitude. Here are a few other things you could say: [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source \"Sending you all my best wishes for a speedy recovery!\" \"Wishing you the best in health, wealth, and happiness.\" \"Hurry up and get well soon! 🙂\""
    },
    {
      "title": "Talk about how the surgery is going to go well so they feel reassured.",
      "content": "Talk about how the surgery is going to go well so they feel reassured . Some people find it hard to talk about what's happening—they might worry about the surgery itself or be frightened about the outcome. You can really put their mind at ease by expressing confidence in the surgery and recovery. For instance, say: \"You have the best hospital team—they're all rooting for you!\" \"Getting surgery is hard, but I’m sure it will improve your quality of life in the long run.\" \"I just know you'll get through this and be stronger than before.\""
    },
    {
      "title": "Offer a hug to physically comfort the person.",
      "content": "Offer a hug to physically comfort the person. Physical connection can go a long way in making someone feel better . However, it's always a good idea to ask first. You can say: [2] X Research source \"Would it be alright if I give you a hug?\" \"Need a hug?\" \"I'm here if you need a hug.\""
    },
    {
      "title": "Give them positive reminders that they'll make it through surgery.",
      "content": "Give them positive reminders that they'll make it through surgery. They're probably stressed and asking themselves how they'll do during or after the procedure . To help them emotionally prepare, be as optimistic as possible. Say something like: \"Sending you courage and strength for your procedure.\" \"You're one of the toughest people I know—you've got this!\" \"This illness picked the wrong person—you're going to beat it.\""
    },
    {
      "title": "Offer a quote if you're struggling to come up with your own words.",
      "content": "Offer a quote if you're struggling to come up with your own words. Sometimes, there's the perfect quote for the situation. Look for uplifting quotes by the person's favorite author—they'll appreciate that you hunted down words of encouragement. If you're still stuck, consider using one of these great quotes: “Tough times never last, but tough people do.” – Robert H Schuller \"You're in pretty good shape for the shape you are in.\" – Dr. Seuss “Be strong because things will get better. It may be stormy now but it never rains forever.” – Evan Carmichael"
    },
    {
      "title": "Saying something funny can break the tension and make them smile.",
      "content": "Saying something funny can break the tension and make them smile . Plus, a humorous message or silly text can take their mind off of their worries for a moment. Lighten the mood with a phrase like: [3] X Research source \"If you can handle the hospital food, surgery will be a breeze! Can't wait to treat you to a nice meal.\" \"Being sick is your body's way of saying you're too amazing and you need to slow down!\" \"I can't believe the lengths some people will go to to get out of work! In all seriousness, I hope you feel better soon and get back into the swing of things.\""
    },
    {
      "title": "Send them a quick text to boost their confidence.",
      "content": "Send them a quick text to boost their confidence. Researchers found that people who texted before surgery and had positive conversations needed less pain management. The key is to avoid talking about the surgery or your anxieties. Instead, keep the messages upbeat. For instance, send: [4] X Research source \"Sending good vibes today. 🙂\" \"You're my hero! xoxo\" \"Keep your spirits up—you'll do great today. 🤗\""
    },
    {
      "title": "It's fine to keep your message short and sweet.",
      "content": "It's fine to keep your message short and sweet. If you don't know the person very well, a simple message still shows them that you care. You can use this one before surgery or during recovery. Here are a few more generic phrases you could use for an acquaintance or colleague: [5] X Research source \"We're all sending our best wishes and hopes for a speedy recovery.\" \"Thinking of you.\" \"Looking forward to having you back in the office when you're ready!\""
    },
    {
      "title": "Remind them how brave and courageous they are.",
      "content": "Remind them how brave and courageous they are. They may not feel at their absolute best, but tell them how impressed you are that they're fighting so hard. Their courage can see them through the surgery and recovery. Try saying something like: [6] X Research source \"You are the bravest person I know.\" \"You inspire me.\" \"I'm proud to know such a courageous person.\""
    },
    {
      "title": "Someone who's spiritual would appreciate a religious sentiment.",
      "content": "Someone who's spiritual would appreciate a religious sentiment. You could simply share that they're in your thoughts and prayers, or you could send a favorite religious verse. Use something like: [7] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source \"And the power of the Lord was with him to heal.\" Luke 5:17 \"I'm praying that God will heal you and give you peace and comfort with His presence and love.\" \"And when I am ill, it is He who cures me.\" Quran 26:80"
    },
    {
      "title": "Offering practical support can really make the person feel cared for.",
      "content": "Offering practical support can really make the person feel cared for. Sure, you could say something like, \"Let me know if you need anything,\" but they're more likely to take you up on specific offers. For instance, you could say: [8] X Research source \"Do you need someone to take care of your kids after school?\" \"Can I bring you dinner when you get out of the hospital?\" \"Are there any errands that I could run for you?\""
    },
    {
      "title": "Ask the person how they're doing so they can share their emotions.",
      "content": "Ask the person how they're doing so they can share their emotions. When someone gets surgery, they may feel like they have to hide what they're going through. Give them a chance to open up and talk about their worries or hopes. Say something like: [9] X Research source \"You know, you can tell me what you're thinking.\" \"How are you holding up?\" \"How has today been?\""
    },
    {
      "title": "Let them know how much they mean to you so they feel loved.",
      "content": "Let them know how much they mean to you so they feel loved. Emotions run high before surgery, but this can make it a good time to share how you feel. Talk about a special memory the two of you have or just let them know they're important to you. You could say: [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source \"We've been friends since we were kids, so I know you've totally got this!\" \"I'm so thankful to have you in my life. Praying for a quick recovery.\" \"You're so caring and you always look after everyone else. Give us a chance to look after you!\""
    },
    {
      "title": "Remind the person that they're not alone during this challenging time.",
      "content": "Remind the person that they're not alone during this challenging time. They might feel like they have the weight of the world on their shoulders. Let them know that you're there to support them. Here are a few more ways to say you care : [11] X Research source \"Let's take this one day at a time.\" \"We'll get through this—we always do!\" \"We've got this!\""
    },
    {
      "title": "Focus on their recovery so they're optimistic about the future.",
      "content": "Focus on their recovery so they're optimistic about the future. It's easy to concentrate on the surgery itself, but talking about life after the surgery can relieve their anxiety . Point out how much better they'll feel or mention things you can do together. [12] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source \"Remember, each day brings you closer to a full recovery!\" \"Rest and recover—the team can't wait to have you back.\" \"Hang in there, so we can hang out together soon!\""
    }
  ]
}