{
  "url": "https://www.wikihow.com/Write-a-Eulogy-For-a-Father",
  "title": "How to Write a Eulogy For a Father",
  "steps": [
    {
      "title": "Remember it's a eulogy and not an obituary.",
      "content": "Remember it's a eulogy and not an obituary. A eulogy is different from an obituary. An obituary is an overview of the facts of someone's life. It covers things like achievements, career, place of birth, surviving family, and so on. Eulogies focus on capturing the essence of who someone was. [1] X Research source As obituaries are fact-based, they are often less emotional. A eulogy focuses on a person's story. What did this person's life mean? What did this person mean to you? [2] X Expert Source Rebecca Tenzer, MAT, MA, LCSW, CCTP, CGCS, CCATP, CCFP Clinical Therapist & Adjunct Professor Expert Interview. 29 November 2021. Avoid writing laundry lists of achievements, and including an excess of facts about the person. Instead, focus on stories and memories that speak to a person's character."
    },
    {
      "title": "Brainstorm",
      "content": "Brainstorm some ideas. Before you start writing, a brainstorming session can help get your mind going. [3] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Spend some time jotting down memories and stories, as well as things you remember about your father's character. This can help you find an angle for your obituary. Start by writing down all initial ideas you have about your father. What do you first think of when thinking about your father? What is your strongest memory of him? What do you want people to know about him? [4] X Expert Source Rebecca Tenzer, MAT, MA, LCSW, CCTP, CGCS, CCATP, CCFP Clinical Therapist & Adjunct Professor Expert Interview. 29 November 2021. Also, think about what external things you associate with your father. What music reminds you of your dad, as well as movies, television shows, foods, sounds, and smells? You may want to immerse yourself in these things as you write, as this may trigger some valuable memories for your eulogy."
    },
    {
      "title": "Focus on an overarching theme.",
      "content": "Focus on an overarching theme. A eulogy should be concise and make a point. You do not want a disparate connection of memories. As you brainstorm, try to figure out a larger theme. What central theme or message ties the various memories together? [5] X Research source You do not have to be insightful or make sense of death. It's okay to admit death is terrible and baffling. Try to make sense of a person's life. Who was your father and what will the world be like without him? You can figure out vague concepts as a theme. Maybe your father was an attorney who took on civil rights cases. You can focus on the theme of generosity, community, and helping others. Maybe your father was a business man who made his own fortune. Your theme can be something like the benefits of tenacity, hard work, and dedication. You can also talk about what you learned from your father. What is the greatest lesson he taught you? How do you incorporate that lesson in your life today?"
    },
    {
      "title": "Decide how you want to organize your eulogy.",
      "content": "Decide how you want to organize your eulogy. There are many different ways to organize your eulogy. Your organization method depends on your eulogy's theme, as well as what information you're including. As you pre-write, figure out the best way to organize your eulogy. [6] X Research source You can write your eulogy in chronological order. This may be helpful if you include anecdotes from your father's early life, as well as his later life. If you find your stories and memories come from different points in time, chronological order may make sense. You can also organize your eulogy by ideas. If you're talking about several characteristics of your father, all illustrated by different moments and memories, organize by ideas. For example, you're talking about your father's success as a business man and how this success was due to determination, work ethic, and personal skill. You can have a section on each of these qualities, and include appropriate memories and anecdotes."
    },
    {
      "title": "Introduce yourself.",
      "content": "Introduce yourself. It may feel awkward, as many people at a funeral will know you, but it is customary to begin a eulogy with a brief introduction. Let the audience know who you are, and what your relationship to the deceased was. [7] X Research source This will probably be the easiest part of the eulogy. You simply have to say who you are, and how close you were to your father. This helps give you credibility. For example, you can open with something like, \"My name is Jane Sherman, and we are gathered here today to say goodbye to my father, Glenn. I was an only child, and because of this particularly close to my dad. We talked almost every day, even after I moved away from home.\""
    },
    {
      "title": "Establish a tone.",
      "content": "Establish a tone. Tone is important to a eulogy. You will want to stick with a consistent tone throughout your work. Think about what kind of tone would best convey the message you're attempting to get across. [8] X Research source You may want to talk with your family and the funeral director here. You want your tone to match the service. If it's a religious ceremony, you may want to adopt a somber and respectful tone, for example. However, do not let the service completely dictate tone. You want your tone to reflect who your father was as a person, primarily. If your father was a jovial person, always joking around, you can adopt a more lighthearted tone. Think of your eulogy more as a celebration of a life than an act of grieving. Even if your overall tone is more sober, try to open your eulogy with a positive memory or statement about your father. [9] X Expert Source Rebecca Tenzer, MAT, MA, LCSW, CCTP, CGCS, CCATP, CCFP Clinical Therapist & Adjunct Professor Expert Interview. 29 November 2021."
    },
    {
      "title": "Include a story.",
      "content": "Include a story. Most eulogies should include at least one story about the deceased. Opening with a story can help engage your audience. Select a story that speaks to your father as a person here. Your story should convey the overarching theme of your eulogy. [10] X Research source For example, say your eulogy is about how your father was always able to find fun, despite having a somewhat difficult life. Select an anecdote that speaks to your father's ability to find levity, despite the circumstances. Say your father died of lung cancer. You can talk about how he faced his diagnosis with humor. You could start with something like, \"When my father first found out he had cancer, he joked about his treatment options. I remember him saying to me, 'I'm optimistic about radiation though.' When I asked him why, hoping the prognosis was positive, he responded, 'I'm hoping exposure to radiation will turn me into a superhero. I could be the next Spiderman.'\""
    },
    {
      "title": "Focus in on small details.",
      "content": "Focus in on small details. In addition to capturing an overarching sense of who your father was, work on recording tiny details. This will help ground your audience and give them small, physical reminders of your father to help with the grieving process. [11] X Research source Sensory details can help. Maybe your father loved working outdoors, and he always smelled like soil. Maybe your father loved the color red, and almost always incorporated red into his wardrobe. Include as many tiny details as you remember. For example, \"I remember my dad was always singing old Johnny Cash songs, and he had a deep, baritone voice just like Johnny Cash. I would wake up Sunday mornings to hear him singing, 'I Walk the Line' from the basement, the smell of fresh coffee wafting into my bedroom.'\""
    },
    {
      "title": "Pull in outside sources.",
      "content": "Pull in outside sources. If you're having trouble figuring out how to express something, pull in outside sources. A quote or a reference can help explain something about your father. If your father was religious, Bible quotes can help. There is a lot in the Bible about life and death, so you can look here. You can also look into books, movies, songs, and television quotes your father loved. If your father was a huge fan of Robert Frost, you can include a line from a Robert Frost poem in your eulogy."
    },
    {
      "title": "Provide levity.",
      "content": "Provide levity. A eulogy should not be completely somber. You want to provide some levity. If a eulogy is too serious, it may seem like you're romanticizing the dead. This can come off as overly preachy or sentimental. Find some moments for levity in which you talk about a person's flaws. This can provide a rounded version of the person you're remembering. [12] X Research source Think of something funny to say about your father. Was he overly argumentative? Include a humorous story about him arguing about a bill in a diner long after everyone else had let the issue go. You could say something like, \"Despite my father's appreciation for humor, he was not perfect. He could be overly critical, and at times argumentative. I remember once, on a family vacation, we stopped at a Denny's...\" A story that illustrates flaws should be light in nature. You do not want to sound like you're angry at the deceased, as this can come off as disrespectful. You do not, for example, want to include the story of an epic, serious argument you and your dad had to illustrate he was argumentative. This will not provide laughter. Instead, focus on a low-stakes situation that will make people laugh."
    },
    {
      "title": "Add a few concluding statements.",
      "content": "Add a few concluding statements. As you wrap up your eulogy, end with a few brief statements that summarize your point. This is where you will get to the meat of your theme. What was your eulogy trying to say? What do you want people to remember about your father? Think of a few final thoughts that will sum up your father for others. Tell the audience, directly, what you are trying to say. For instance, \"What I learned from my father was that life is short, and often brutal, and the best way to combat all that is with a good laugh and an ability to appreciate the small moments of joy, despite any circumstances.\" You should also thank the audience for their time. Briefly say something like, \"I appreciate you all coming out to remember my father, Glenn Sherman, and giving me an opportunity to tell you a little bit more about him. I know he would have been honored to know how many people cared enough to attend.\""
    },
    {
      "title": "Edit your eulogy and add more information as needed.",
      "content": "Edit your eulogy and add more information as needed. Once you have written a draft of your eulogy, print out a copy and read it through. As you read, look for moments to expand on content and provide more details when necessary. Ask yourself whether your eulogy makes sense. Do your stories illustrate your theme? Do you feel like anything is missing? Is there a story you should have included or an aspect of your father's personality you could have explored more? Is there anything that feels like it doesn't belong? Add to your eulogy as needed. If you feel like there's room for expansion, expand as needed. You can also cut anything out that you feel like does not add to the theme. Time is an issue. The average eulogy should only last 5 to 7 minutes."
    },
    {
      "title": "Memorize part of the eulogy.",
      "content": "Memorize part of the eulogy. When delivering your eulogy, it can help to have a portion memorized. This can make the delivery go smoother. You do not need to memorize the entire eulogy. You should keep some notes during delivery, as you may be nervous or emotional when delivering the speech. If you want to memorize the whole speech, memorize small chunks one at a time. It can be daunting to remember everything. You should write down notes with reminders on them. This will help you stay on track as you deliver your speech."
    },
    {
      "title": "Practice your eulogy regularly.",
      "content": "Practice your eulogy regularly. You should practice your eulogy several times in the days leading to the funeral. Read it out loud to yourself, or before a mirror. Focus on moments where you stumble, and practice those portions more. [13] X Research source You can ask a friend or family member to listen to you practice. They can give you feedback on how to make your delivery smoother."
    },
    {
      "title": "Stay strong emotionally.",
      "content": "Stay strong emotionally. It is never easy to write a eulogy, and it can be particularly trying if you're writing a eulogy for your father. As you work on your eulogy, try to stay strong emotionally. [14] X Research source Reach out to others. Your existing relationships are important during grief. Lean on friends and family members during your weak moments. Try to work on reframing your sense of identity. Losing a parent can make you feel you've lost a source of personal guidance. Try to think about who you are without your father, and how you can move forward. Stay in the present. Remember, the present is where your life is occurring right now. Be grateful for what you do have. Try to be thankful for life each day, and live it to the fullest despite your loss."
    }
  ]
}