{
  "url": "https://www.wikihow.com/Write-a-Ballad",
  "title": "How to Write a Ballad",
  "steps": [
    {
      "title": "Think about a memorable event or tale.",
      "content": "Think about a memorable event or tale. A ballad can also be an exaggeration or fictionalization of a memorable event that happened to you. Maybe you have a funny story from when you were a teenager or perhaps you have a good family tale that you’d like to retell from your perspective. For example, you may write a ballad about a ghost that haunts a member of your family or you may write about the time you snuck out to meet someone when you were a teen."
    },
    {
      "title": "Look at current events.",
      "content": "Look at current events. Many ballads focus on a major event in the news or the media. Surf through the news online or flip through the headlines in your local newspaper. Look for a current event that sounds like a fascinating or strange story and use it as source material for your ballad. [1] X Research source For example, you may find a story about a young woman on trial for killing her father in self-defense. Or perhaps you find a news story on a refugee in refugee camp trying to make a better life for themselves."
    },
    {
      "title": "Read examples of a ballad.",
      "content": "Read examples of a ballad. You can read ballads that are in poem form and in song form. Check online and at your local library for printed ballads. Search online or at your local music store for recordings of ballads in song form. You may look at: [2] X Research source “The Rime of the Ancient Mariner” by Samuel Taylor Coleridge \"La Belle Dame Sans Merci\" by John Keats \"Ballad in A\" by Cathy Park Hong \"Maude Claire\" by Christina Rossetti \"Ballad of the Moon Moon\" by Federico Garcia Lorca “The Lonesome Death of Hattie Carroll” by Bob Dylan"
    },
    {
      "title": "Follow the structure of a ballad.",
      "content": "Follow the structure of a ballad. Most ballads are composed in four four-line stanzas. The first two lines will rhyme and the third line will not, creating an AABC rhyme scheme. You can also try a rhyme scheme where the second and fourth line rhyme and the third line does not, creating an ABXB rhyme scheme. [3] X Research source You can also try writing eight-line stanzas if you’d prefer and create your own rhyme scheme for the ballad. Modern ballads often have longer stanzas and a more loose rhyme scheme."
    },
    {
      "title": "Introduce the main character to the reader.",
      "content": "Introduce the main character to the reader. The first line of the ballad is important, as it draws the reader into the story. Introduce your main character or characters in the first line. [4] X Research source For example, in Bob Dylan’s “The Lonesome Death of Hattie Carroll,” the first line introduces the two main characters in the story: “William Zanzinger killed poor Hattie Carroll.” [5] X Research source In John Keats’ \"La Belle Dame Sans Merci,” the first line addresses the main character of the story with a question: “O what can ail thee, knight-at-arms…”. [6] X Research source"
    },
    {
      "title": "Limit the number of minor characters.",
      "content": "Limit the number of minor characters. Stick to one to two main characters maximum, and one or two minor characters only if they are absolutely necessary. The ballad should focus on key details of one story with a small set of characters, not multiple main characters and plots at once. [7] X Research source For example, in Bob Dylan’s “The Lonesome Death of Hattie Carroll,” there are two main characters, William Zanzinger and Hattie Carroll. Minor characters like a policemen and a judge are also mentioned. In John Keats’ \"La Belle Dame Sans Merci,” there are two main characters, the knight-in-arms and the belle dame, or the woman."
    },
    {
      "title": "Use a memorable line as the chorus.",
      "content": "Use a memorable line as the chorus. In a typical ballad, the chorus is the third or fourth line in the stanza that repeats throughout the piece. The chorus should be relevant to the rest of the ballad and contain strong imagery that sticks in the reader’s mind. [8] X Research source For example, in Coleridge’s “The Rime of the Ancient Mariner,” the chorus is a variation on the line “The bright-eyed Mariner.” [9] X Research source In Bob Dylan’s “The Lonesome Death of Hattie Carroll,” the chorus appears at the end of each stanza and is several lines long: “But you who philosophize disgrace and criticize all fears/Take the rag away from your face/Now ain't the time for your tears.”"
    },
    {
      "title": "Include rhyme and repetition.",
      "content": "Include rhyme and repetition. Follow a set rhyme scheme in each stanza. Repeat certain words or phrases over again in the ballad. Use simple language that is descriptive to create a sense of rhythm in the poem. [10] X Research source For example, in Coleridge’s “The Rime of the Ancient Mariner,” the speaker repeats words like “eye” and “Mariner” in the ballad: “He hold him with his glittering eye-/The Wedding-Guest stood still,/And listens like a three years’ child:/The Mariner hath his will.”"
    },
    {
      "title": "Use dialogue in the ballad.",
      "content": "Use dialogue in the ballad. Have your characters speak in the ballad, using quotation marks around their speech. Keep the dialogue short and tight. Only provide the most essential details of the character’s thoughts in the dialogue. [11] X Research source For example, in Coleridge’s “The Rime of the Ancient Mariner,” the Mariner tells a story of being at sea to the wedding guests a few stanzas into the ballad: “The ship was cheered, the harbour cleared/Merrily did we drop/Below the kirk, below the hill,/Below the lighthouse top.”"
    },
    {
      "title": "Build to a climax or realization.",
      "content": "Build to a climax or realization. Like any good story, a ballad should have a beginning, middle, and end, with a powerful climax or realization in the latter half of the poem. The climax could be the most dramatic thing that happened to the speaker or the main character. It could also be the moment the main character realizes the reality of their situation. [12] X Research source For example, in John Keats’ \"La Belle Dame Sans Merci,” the climax comes in the tenth stanza when the knight-in-arms realizes he is being entrapped by the belle dame: “I saw pale kings and princes too,/Pale warriors, death-pale were they all:/They cried- ‘La Belle Dame sans Merci/Thee hath in thrall!’”"
    },
    {
      "title": "Have a powerful last stanza.",
      "content": "Have a powerful last stanza. The final stanza in the ballad should sum up the key theme or idea in the piece. It should leave the reader with a powerful image or wrap up the sequence of events. It can also put a twist or spin on the events in the ballad, making the reader reconsider the original events. [13] X Research source For example, in John Keats’ \"La Belle Dame Sans Merci,” the ballad ends with the knight-in-arms responding to the question posed to him in the first stanza after revealing he woke from the spell of the belle dame, though he now lives alone in a lifeless world: “And this is why I sojourn here,/Alone and palely loitering,/Though the sedge is withered from the lake,/And no birds sing.”"
    },
    {
      "title": "Read the ballad out loud.",
      "content": "Read the ballad out loud. Once you have completed a draft of the ballad, read it aloud to yourself. Listen for rhyme, repetition, and rhythm. Make sure the ballad tells a story in a clear, concise way. Notice any awkward or long winded lines. Adjust them so they are easy to follow and understand. You should also read the ballad out loud to catch any spelling, grammar, or punctuation errors."
    },
    {
      "title": "Show the ballad to others.",
      "content": "Show the ballad to others. Get friends, peers, or family members to read the ballad. Ask them if they find the ballad engaging and easy to follow. Find out if the ballad sounds rhythmic and lyrical. Be open to constructive feedback from others as it will only improve your ballad."
    },
    {
      "title": "Set the ballad to music.",
      "content": "Set the ballad to music. Traditionally, ballads are spoken or sung aloud to music. You may set the ballad to instrumental music that has already been recorded, and has a rhythm that suits the piece. Or you may play acoustic guitar as you read the ballad aloud, or try to sing it aloud. [14] X Research source You can also try using string instruments like a cello, a harp, or a violin to accompany the ballad."
    }
  ]
}