{
  "url": "https://www.wikihow.com/Stop-Having-An-Inappropriate-Crush",
  "title": "How to Stop Having An Inappropriate Crush",
  "steps": [
    {
      "title": "Consider all the reasons why the crush is a bad idea.",
      "content": "Consider all the reasons why the crush is a bad idea. Instead of focusing on all of the reasons you are drawn to your crush, you need to change your focus and consider all of the reasons why the crush can lead to no good and is not worth pursuing. There are many different reasons why any crush can be inappropriate, and it's important to know exactly what you'd be getting yourself into in order to avoid it. You should think about why the crush is a bad idea, and consider potential reasons that you may be feeling what you're feeling (other than the initial attraction, of course). Here are some potential reasons you may be dealing with: If they're a lot younger than you are or they're a lot older than you are, why are you interested in a young or old partner whose interests and priorities will be very different from your own? If you are into a guy who works for you, are you more into the idea that you can call the shots than the actual person? If you have a crush on your brother's girlfriend, is it more about getting one over on your brother than actual interest in the girl? It might be that for a series of circumstances you are feeling needy and vulnerable, making it a bad time to take any action."
    },
    {
      "title": "Consider your background and whether your new crush could be undermining your relationships if your crush is inappropriate because you're already in a relationship.",
      "content": "Consider your background and whether your new crush could be undermining your relationships if your crush is inappropriate because you're already in a relationship. If one or both parents had extra-marital affairs when you were growing up or if you have a history of infidelity you may have some underlying issues that need to be addressed to successfully enjoy a committed relationship."
    },
    {
      "title": "Ask yourself about the current state of your relationship if your crush is inappropriate because you're already in a casual relationship with no children who can be affected by leaving it.",
      "content": "Ask yourself about the current state of your relationship if your crush is inappropriate because you're already in a casual relationship with no children who can be affected by leaving it. For example, if you have a crush on a guy but are already in a relationship, then you have to ask yourself if the crush is really meaningful, or if this is your way of telling yourself that it's not really working out with you and your boyfriend. If you and your boyfriend were really happy together, then would you have \"room\" to develop strong feelings for another person? [1] X Research source Of course, everyone, even the happiest couples, can get harmless little crushes from time to time, but if your crush turns more serious, then you should question your current relationship. This is your chance to exit without serious consequences if there is a problem. You should especially question the status of your current relationship if this kind of thing keeps happening. If you occasionally really click with someone outside of your relationship and feel a harmless crush on him or her while knowing it won't lead to anything, that's one thing, but if you feel frequently embroiled in a one-sided love affair, then you have to wonder about the real reason behind your feelings."
    },
    {
      "title": "Recognize the importance of letting go of an age-inappropriate crush.",
      "content": "Recognize the importance of letting go of an age-inappropriate crush. Relationships need to happen between equals. It's important to date someone who is in your stage of life (such as high school, college, newly entering the workforce, etc.) or who is very close to it (such as someone about to graduate from college dating someone who recently graduated from it). Dating someone in a different stage of life is likely not to work out and may involve (intentional or inadvertent) exploitation. The stage of life and level of maturity should be identical or very close. Older people have a responsibility not to date people who are too young for them. It's harder to relate to someone who has different goals, responsibilities, abilities, friend groups, and other ideas or traits that change with age. [2] X Research source A significant age gap involves an imbalance of power. A 16-year-old is much more experienced than a 12-year-old. A 46-year-old is much more experienced than a 25-year-old. The younger person may be (even inadvertently) pressured to do things they aren't ready for. Even if they say they're ready, hindsight might tell a different story, and they could get hurt. [3] X Research source If the younger person is a minor and the older person is an adult, then serious legal action could be taken against the older person. The older person may be perceived (incorrectly or correctly) as predatory."
    },
    {
      "title": "Project the potential fallout.",
      "content": "Project the potential fallout. If you were to get involved with this person, how would the fallout affect you? Them? Your friends, family, co-workers? Think as if it were a chess game and visualize the next several moves: \"If I do this, then they will do that; then my brother will hate me; then the first time we argue I will lose my job...\" and so on. Thinking about the worst that could happen if you and your crush were united can make you realize that it would be a huge mistake. Ask yourself, is the potential relationship with this person worth all the trouble you will endure, and what are the chances the relationship would survive all of the chaos that will ensue?"
    },
    {
      "title": "Consider your reputation.",
      "content": "Consider your reputation. What will other people think — will they think more, or less of you? Though we often say that it doesn't matter what people think and that love conquers all, in some cases, the fact of the matter is that what other people think does matter, because their disapproval, or even their scorn, may make it very difficult for you to carry out your potential inappropriate relationship. It's important to step back and look at the big picture, to consider how other people would react to your relationship. If you're already certain it's inappropriate, then considering how others would react will further dissuade you. Here are some scenarios to consider: It's not cool to try to steal your buddy's girl. You might end up with her, but you will lose your friend. If you're older, and the boy is a minor, you will be considered a cradle-robber —and on top of that, if you actually pursue that relationship into a sexual situation, you could be looking at jail. Sex with a minor is worse than inappropriate — it's a crime. Sure, you may have a crush on your wife's sister. But imagine what would happen if you did anything about it — would your wife ever be able to look you in the eye? Would her family ever forgive you?"
    },
    {
      "title": "Think about your future.",
      "content": "Think about your future. If you get involved with someone inappropriate, you will not just be dealing with problems now. You will be dealing with the fallout far — maybe years — into the future. It's one thing to think about the exciting adventures you'll have with your inappropriate crush if he or she returns you feelings, but it's another try to imagine what your relationship will really look like in a few years. Will it really be possible to sustain it? Will your feelings really last? It's important to think about whether you can really have a future with this person, or if you would just be sacrificing everything for a few fleeting moments of joy. For instance, the person you are crazy about may not be a very nice person. You start ditching your friends and family to spend time with her. She's super flaky, and you become flaky, too — going back on your word because she wasn't willing to do whatever it was you promised you'd do — and won't let you do it, either. Even after you break up with her, everyone you know will still view you with distrust. They will question your judgment for ever getting involved with someone like that in the first place."
    },
    {
      "title": "Focus on your crush's negative qualities.",
      "content": "Focus on your crush's negative qualities. Almost by definition, a crush involves an idealized picture of someone else. But everyone is human, and even your crush has characteristics that are probably not pleasant. Perhaps he says mean things to people, or maybe she listens to music that you think is dumb. Or perhaps he or she merely ignores you. Try to work up some negative energy about the person that you can focus on in order to weaken the crush. Write down a list of all of the negative qualities of your crush. If you really think your crush is perfect and you can't think of a single thing that is wrong with him or her, then this means that you don't know the person well enough. If you can't think of a single thing wrong with your crush, then you have him or her up on a pedestal. One of the reasons your crush may be inappropriate is simply because the person is \"bad\" for you. Writing down the reasons why, such as the fact that the person abuses alcohol or is a known player, can help you see that, while you may get butterflies in your stomach when you see him, he's no good for you in the long run."
    },
    {
      "title": "Distract yourself as much as you can.",
      "content": "Distract yourself as much as you can. Now that you've analyzed, considered, and really meditated upon how terrible this idea is, you need to stop obsessing over this person. No matter how tempting it is to think about him/her, fantasize, and get yourself all tingly doing it, stop it. Think about and do something else. In loose psychological terms, it's called redirecting behaviors and thought patterns. You have to find ways to stay busy and to stop thinking about your inappropriate crush. If all you do is sit around the house all day, then your inappropriate crush will be a lot harder to forget than if you throw yourself into your work and studies and have an active social life. [4] X Research source At first, not thinking about your crush will be even harder because you'll be so busy thinking about nothing thinking about him or her. But have faith — soon enough, you'll be on your way to moving forward. Learn to redirect your thoughts. Train yourself to think about something else every time you start thinking about him/her — think about how much you love the person you're with instead. Think about how much work you have to get done. If you're at home, turn on the radio or TV, and get some other thoughts running through your head. If you still feel yourself reverting to thoughts of your forbidden crush, find someone to talk to; call a friend. Ask that friend if he or she wants to hang out — you can get out of the house and stop thinking about your crush! Throw yourself into a new hobby or an activity. Try tennis, yoga, writing short stories, or training for a 5K. Though these activities alone won't make you forget your crush, they will bring more richness to your life and will help you think of other things."
    },
    {
      "title": "Avoid the person as much as you can.",
      "content": "Avoid the person as much as you can. If you can remove yourself from that person as much as possible, the crush will weaken. In order to sustain our adoration for someone, we generally need to reinforce it by seeing the person. (Absence usually doesn't make the heart grow fonder, actually.) Of course, this isn't always practical, but do what you can to minimize contact with the other person. Try to avoid doing anything dramatic while finding a way to limit the time you spend with your crush. [5] X Research source Unfortunately, there are some cases where it would be quite hard to limit contact with the person entirely. If you have a crush on your married boss and it won't go away, for example, you may have to consider looking for another job. If you have a crush on your professor and it won't go away, see if you can switch into another class. If you do have to be in the same room as the person, try to minimize eye contact and conversation. You shouldn't make things extra awkward by avoiding or ignoring the person entirely, but you should limit how much time you spend interacting. Do not look at their social media accounts."
    },
    {
      "title": "Give it time.",
      "content": "Give it time. All crushes fade with time. If you can avoid doing something regrettable and keep your feelings in check, eventually those powerful emotions will run their course. You may feel like you're trapped and that you are bound to have these feelings forever, but that won't be the case. One day, you'll be looking back on this moment, wondering how you could have harbored such feelings. If you have faith that you won't always feel this way, you'll be on the way to getting over it. Unfortunately, there's no timeline for how long it takes to get over a crush. But if you go about living a busy and fulfilling life instead of spending all your time moping and pining, you'll be guaranteed to get over it faster. Reader Poll: We asked 897 wikiHow readers what’s the longest a crush has lasted for them, and 60% of them said over a year. [Take Poll] It’s totally okay if you can’t get over your crush immediately, especially if you’ve liked them for a long time!"
    },
    {
      "title": "Start dating other people when you're ready.",
      "content": "Start dating other people when you're ready. If you're single, then you should begin to put yourself out there when you're starting to get over your crush. You don't have to feel 100% cured, but you should feel like you're ready to start a meaningful relationship with someone else — if you're still completely lovesick, then it won't be fair to the other person to start dating just to distract yourself. But once you're ready, ask a friend to set you up or be open to meeting new people. You'll soon find that your crush is far from your thoughts. [6] X Research source It doesn't matter if that person does not measure up to your \"wrong crush.\" What does matter is that you spend some time in the pleasant company of someone other than that person. Start dating others, and keep an open mind . That person is off limits to you, and you have to start re-wiring your brain to think about being with someone else."
    },
    {
      "title": "If you can't fight it, find a way to make it right first.",
      "content": "If you can't fight it, find a way to make it right first. Let's face it: sometimes, you can't convince yourself that you don't feel the way you feel. If you've tried to fight it, all to no avail, and you still find yourself sighing over them, then make it right. There are ways to make an inappropriate crush totally appropriate — the most important thing to remember is to make it right first — and then, and only then —get involved. And then, true love wins the day! If she's your brother's girl, then you have to behave as a gallant gentleman, and never hit on her. If your brother breaks up with her, you can ask your brother if he'd mind you asking her out. Maybe he wouldn't mind, and there certainly is precedent for it. If he doesn't break up with her, or if he won't give you permission, you're out of luck unless you are prepared to accept the consequences — your brother may not speak to you. If you are falling for your subordinate, then you must decide what measures you should take at work before you pursue the relationship. You can transfer to another department or take on a different position, or do whatever you have to do at work so that your relationship would not be viewed as inappropriate or a power play."
    }
  ]
}