{
  "url": "https://www.wikihow.com/Tame-Your-Guinea-Pig",
  "title": "How to Tame Your Guinea Pig",
  "steps": [
    {
      "title": "Make sure your guinea pig has its own space.",
      "content": "Make sure your guinea pig has its own space. Your guinea pig should have an appropriate cage or hutch (available from pet stores) to spend his/her own time in. It can live inside or outside, as long as it is comfortable and safe. However, if you live in a region with cold seasons, the pig should be brought indoors during the winter. Guinea pigs are social animals and love companionship, but this works best when the guinea pigs have grown up together so it can really understand you. If you have more than one, keep them in same sex groups to avoid breeding, and make sure there is a hiding place for each so they can have solitude when they choose; otherwise they may try to fight each other to assert dominance (male-male), or reproduce (male-female). Good features to look for in a guinea pig cage include: [2] X Research source Large size (a minimum of eight square feet of floor space) [3] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Wooden construction with solid flooring (no wire bottoms or any other strings like hair seeing as this could be very hurtful and cause a problem with the pads of their sensitive feet and cause something very nasty called bumble foot.) Separate running and sleeping areas in case they do not want to huddle Protection from the weather (if outdoors) Bedding: straw or hay is best, and fluffy materials should be avoided for safety reasons, as guinea pigs may eat their bedding. Earthenware or stainless steel bowls that clip to the cage or hutch (for food and water). A door that can be opened so that the guinea pig can enter the run area without being picked up (optional)"
    },
    {
      "title": "Provide a quiet environment for your guinea pig.",
      "content": "Provide a quiet environment for your guinea pig. [4] X Research source Guinea pigs have sensitive hearing, so they’ll be most comfortable in a place that is free from major sources of noise (such as traffic, loud televisions, and rambunctious play). Keeping things especially quiet for the first few days that your guinea pig is home might help it adjust. You can also cover your guinea pig’s cage or hutch with a light cloth for the first few days. This may help it feel more secure and peaceful."
    },
    {
      "title": "Give your guinea pig some space at first.",
      "content": "Give your guinea pig some space at first. On the first day you bring your guinea pig home, don’t bother it by trying to play or cuddle—just silently check on it now and then to make sure that it is okay. Guinea pigs have to build trust in you, as they are prey animals in nature. Giving yours some time alone at first will help it get used to its new home. If you have young children, make sure they understand that the guinea pig needs some alone time at first."
    },
    {
      "title": "Feed your guinea pig at the same time each day.",
      "content": "Feed your guinea pig at the same time each day. Having a regular supply of food will keep your guinea pig healthy and happy. If you feed it regularly (try doing so twice a day), it will associate your sounds with food and comfort. You should ask your vet or pet supply store for food suggestions, but generally your guinea pig should eat: [5] X Research source [6] X Research source Hay Guinea pig mix Fruits and vegetables (for vitamin C): melons, oranges, spinach, broccoli, kale, cabbage and lettuce(not iceberg)."
    },
    {
      "title": "Make sure your guinea pig is eating.",
      "content": "Make sure your guinea pig is eating. At first, guinea pigs are unlikely to eat in front of you. To make sure that yours is eating and healthy, just check its food and water dishes in the morning. If your guinea pig has eaten, you will see that these supplies have been depleted. Some guinea pigs might not eat or drink much or at all during the first day or two in a new home. If it has been several days and you are sure that yours is not eating, however, contact your veterinarian."
    },
    {
      "title": "Talk to your guinea pig.",
      "content": "Talk to your guinea pig. When you stop in to check on your guinea pig, talk to it softly and calmly, while still keeping your distance at first. This will help to get your guinea pig slowly used to the sound of your voice and presence."
    },
    {
      "title": "Let your guinea pig sniff your hand.",
      "content": "Let your guinea pig sniff your hand. After a few visits, you can try sticking your hand in your guinea pig’s cage. If your guinea pig is feeling adventurous, it might come and sniff your hand. Don’t try to pick your guinea pig up just yet; but rather keep your hand still. Be patient if your guinea pig won’t sniff your hand yet. It can take some time to build trust."
    },
    {
      "title": "Try picking your guinea pig up.",
      "content": "Try picking your guinea pig up. Once it seems more used to your presence, entice it into a corner of its cage. Placing one hand under its belly, and your other hand under its rear end, gently pick it up. [7] X Research source Alternatively, wrap one hand around its shoulders, and place your other hand under its rear end. [8] X Research source Hold it against your chest and talk softly to it. If your guinea pig seems calm, you can sit with it in a chair and pet it. If it is not calm, put it back in its cage and try again later. You can also try wrapping your guinea pig in a towel as you pick it up. Hold it to your chest area, as this seems to make some feel safer. Try picking your guinea pig up on a daily basis for the first few weeks. Even if yours seems a little nervous or frightened, you will eventually become friends if you are consistently calm and patient with it. If your guinea pig starts to make a purring sound (a low purring), this is actually a good sign and means they are relaxed. Guinea pigs are generally gentle, but can bite or scratch if they are frightened."
    },
    {
      "title": "Offer your guinea pig lots of treats.",
      "content": "Offer your guinea pig lots of treats. Especially during the first few weeks, when you are trying to get your guinea pig used to you, treats can reward it and help it feel comfortable. [9] X Research source Whenever you try to get near your guinea pig or pick it up, offer it a treat. However, don’t try to “trick” it into being picked up by offering it a treat, as this can cause it to distrust you. Good choices for snacks include: Leafy green vegetables Bits of food that are rich in vitamin C, like melon and broccoli Guinea pig pellets"
    },
    {
      "title": "Give your indoor guinea pig some play time.",
      "content": "Give your indoor guinea pig some play time. Outdoor guinea pigs may have larger cages and more space to run around. If your guinea pig stays indoors and is well-tamed, then you can periodically let it have some free time, too. Look for a room that is free from holes or openings (so your guinea pig won’t accidentally escape), and where your guinea pig will be safe from harm (there are no cords or plastic that can be chewed, for instance). [10] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source As long as you supervise, your guinea pig will benefit from the chance to run around the room and get some exercise. Indoor playpens with tubes, ladders, boxes, and other devices to amuse guinea pigs are another option. [11] X Research source You can build one of these on your own, but supplies for them can also be found at pet stores. You can try to teach your guinea pig tricks, such as jumping on a box or running through a tube to get a treat from your hand."
    },
    {
      "title": "Find some bonding activities.",
      "content": "Find some bonding activities. Once your guinea pig is used to you and to being picked up, spend some time each day bonding with it. Hold it in your lap and pet it while you watch your favorite television show, listen to music, or just talk (guinea pigs are very very very vocal)."
    }
  ]
}