{
  "url": "https://www.wikihow.com/Tell-if-You-Genuinely-Like-Someone",
  "title": "How to Tell if You Genuinely Like Someone",
  "steps": [
    {
      "title": "Determine if you leave a date with them feeling happy.",
      "content": "Determine if you leave a date with them feeling happy. One of the best ways to figure out if you like a certain guy or girl is to spend time with them alone. If the conversation flows naturally, they make you laugh, and you leave the date feeling satisfied and happy, it’s a pretty clear sign that you like them. [1] X Research source If you don’t feel comfortable with them or they seem distant during your date, it might be a sign that there isn’t a connection between the two of you. Don’t feel bad if you want to end things after a bad date. In the long run, you’re saving time and effort for the both of you."
    },
    {
      "title": "Figure out if you feel excited when they call or text you.",
      "content": "Figure out if you feel excited when they call or text you. If you jump on your phone when they text you and never let their calls go to voicemail, it’s a good sign that you’re really into them. No matter how busy your day is, you should want to send them a message just to let them know you’re thinking of them! [2] X Research source If they text you and you often don’t have any desire to respond or have nothing to say, you might just see them as a friend."
    },
    {
      "title": "Recognize when you see things that remind you of them.",
      "content": "Recognize when you see things that remind you of them. If you constantly see things that make you think of them, it’s a good sign that you actually like them. Pay attention to how many times throughout the day you tell them about something you think they'd like, and how many times you tell your friends and family a funny story or fact about them. [3] X Research source If you don't really think of them throughout the day, you might just be spending time with them when you're feeling lonely."
    },
    {
      "title": "Spend time with other people to see if you miss them.",
      "content": "Spend time with other people to see if you miss them. Going out with your friends or bonding with your family will surround you with people who you like and have a good time with. If you find yourself wishing that they were there, or wanting to text them to give them an update on the day, it’s a good sign that you actually like them. [4] X Research source If you don’t really think about them when you’re with other people, ask yourself why. You might’ve just been too busy to think about them, or you might just be interested in them because you don’t want to be alone. Try to be honest with yourself about your feelings."
    },
    {
      "title": "Notice if you contact them first when you get good or bad news.",
      "content": "Notice if you contact them first when you get good or bad news. Having someone who will celebrate the good things and help you figure out the bad things is an important part of a relationship. If something major happens in your life, pay attention to who you call or text first. If it’s them, you probably trust and respect them a lot. [5] X Research source It’s okay to make exceptions for people like your parents or best friend, who you might reach out to first. However, they should probably be one of the first people who you contact when something happens in your life."
    },
    {
      "title": "Figure out if your values, interests, and desires align.",
      "content": "Figure out if your values, interests, and desires align. Many people have “deal breakers,” which are signs that they absolutely cannot date someone, like different views on marriage, personal interests, and much more. Asking your date about their morals, hobbies, and future plans will likely reveal if you’re a compatible match, and bring up any potential problems. [6] X Research source For example, you might ask them, “What do you value most in friendship?” or, “What’s something that’s too serious to be joked about?” If you’re comfortable being more forward, you can ask, “What do you look for in a relationship?” or, “What’s your idea of the perfect partner?” Remember that little things can be important. You can ask them “What do you like to do on the weekends?” or, “Would you rather go camping in the mountains or take a trip to the beach?” to see if your general interests align."
    },
    {
      "title": "Touch their arm or hand to gauge your physical attraction.",
      "content": "Touch their arm or hand to gauge your physical attraction. It’s difficult to be in a relationship with someone if you aren’t physically attracted to someone. Touching them gently on the arm or hand will let you know if they’re comfortable around you, and will show you how it feels to be close to them. If you don’t have any urge to touch them at all, you might be better suited as friends. [7] X Research source If you touch them and they seem uncomfortable, it’s a good sign that they aren’t ready for a relationship. Listen to your gut feelings and intuition when it comes to physical attraction. If you don’t have the urge to touch them or be close to them, it’s a good sign that you don’t really like them."
    },
    {
      "title": "Think about whether you are attracted to their personality and value their opinion.",
      "content": "Think about whether you are attracted to their personality and value their opinion. There are many physically attractive people in the world, but it’s unique to find someone whose opinion is important to you, beyond physical compatibility. If their kindness or intelligence is the first thing that comes to mind when you think about them, that’s a great sign that you like them for who they are. [8] X Research source It’s okay to find someone physically attractive as long as you’re also interested in their personality and mind. If the only thing you can think about is their body, you might just be having feelings of lust, which will fade after a while."
    },
    {
      "title": "Discuss your feelings with someone who you trust.",
      "content": "Discuss your feelings with someone who you trust. Set aside time with a close and trustworthy friend or family member to talk about what’s going on. Sometimes, an outsider is able to give you more clarity on the situation because they aren’t involved. Tell them all about how you feel when you’re around the other person, and ask what they think. [9] X Research source It’s best to pick a friend who doesn’t know the other person, to avoid any drama or secret-keeping that might arise. Try to avoid getting upset with your friend if they tell you something unpleasant that you might not want to hear. Reader Poll: We asked 1601 wikiHow readers who they go to when they need to talk through a personal issue, and 61% said that they reach out to their best friend for support. [Take Poll] Your best friend knows you really well, so they may help you better understand your feelings."
    },
    {
      "title": "Ask yourself if you’re afraid of being alone.",
      "content": "Ask yourself if you’re afraid of being alone. Many people have a hard time coming to terms with the idea of being alone, even for short periods of time. If you don’t like spending time alone and are looking for someone to provide company, your feelings might not be genuine. If you’ve just moved to a new city and have no friends, you’re probably just looking for companionship. [10] X Research source If you want to combat this, you can learn how to enjoy being alone . Sometimes, this is the best way to figure out if you like someone because it gives you an idea of how you feel without them there."
    },
    {
      "title": "Learn how to tell when you’re feeling jealous.",
      "content": "Learn how to tell when you’re feeling jealous. In many cases, jealousy is a surefire indicator of whether or not you’re interested in someone. Experiencing jealousy can be uncomfortable and upsetting. If you get sad or angry when they hang out with someone else who they might be interested in romantically, it might be a good sign that you really like them. [11] X Research source While jealousy can sometimes be healthy, it can quickly become a way to control your partner. Try not to get too upset about the person you like being around other people because they’re probably thinking of you! If you have had problems with jealousy in the past or you feel like your anger is out of control, consider learning how to control your jealousy before getting into a relationship.relación."
    }
  ]
}