{
  "url": "https://www.wikihow.com/Wide-Rib-Cage",
  "title": "Everything You Need to Know About Having a Wide Rib Cage",
  "steps": [
    {
      "title": "Check if your torso has a box shape in the bust and shoulders.",
      "content": "Check if your torso has a box shape in the bust and shoulders. Take off your clothes so you're just wearing underwear and look at yourself from the front in a full-length mirror. Most people with wide rib cages have broad shoulders and a thick chest or bust (which is the area of the torso between the waist and the neck). Some women may have narrow waists, but they're more likely to be just as wide or only slightly thinner than the rib cage. Your hips may also be the same width or narrower than your ribs (they can also be wider on some women, too). If you have a narrow rib cage, your bust and waist are usually small and don't noticeably pro Apple, rectangular, and hourglass shapes can all have wide ribs."
    },
    {
      "title": "Check if your ribs flare out above your stomach from the side.",
      "content": "Check if your ribs flare out above your stomach from the side. Turn to the side and look at your torso's profile in a mirror. Notice if the bottom of your rib cage protrudes over your stomach while standing at rest. If so, that could be another good sign you have a wider-than-normal rib cage. Your rib cage can also stick out over your stomach if you're very thin."
    },
    {
      "title": "Your rib cage may be wide because that's how it naturally developed.",
      "content": "Your rib cage may be wide because that's how it naturally developed. It's perfectly normal to have a wide rib cage instead of a narrow one. For most people, there aren't any underlying causes or health issues to be concerned about. It's just another body type that millions of people have and live with happily!"
    },
    {
      "title": "Poor posture and shallow breathing can also cause wide ribs.",
      "content": "Poor posture and shallow breathing can also cause wide ribs. If your rib cage is flared at the bottom or on just one side but not the other, you may simply have poor posture. Your ribs can stick out if you don't make a habit of sitting or standing up straight. Breathing shallowly and not taking the time for deeper breaths is also a common factor. [1] X Research source Unless your flared ribs are making it harder for you to breathe or causing you pain, though, they're nothing to worry about!"
    },
    {
      "title": "Your abdominal muscles may be too weak to hold up your rib cage.",
      "content": "Your abdominal muscles may be too weak to hold up your rib cage. When your abdominal muscles are strong, they help tilt your rib cage downward so it doesn't flare outward. If these muscles have grown weak or atrophied, your ribs may protrude more to one or both sides of your torso than normal. If this is what's causing your ribs to appear wider, it can often be fixed simply by exercising your core. [2] X Research source Muscles often weaken naturally with age, so many older people with a flared rib could have this problem."
    },
    {
      "title": "Pregnancy can widen your rib cage by 2 cm (0.79 in).",
      "content": "Pregnancy can widen your rib cage by 2 cm (0.79 in). During pregnancy, the body has to make room for the growing baby. During that process, the diaphragm gets moved upward and outward. [3] X Research source The result is that the ribs widen slightly as if you were constantly inhaling (even though you feel you're still breathing normally). Breathing exercises can reactivate your diaphragm and bring you relief. [4] X Research source"
    },
    {
      "title": "Certain medical conditions and injuries can also cause a wide rib cage.",
      "content": "Certain medical conditions and injuries can also cause a wide rib cage. For example, people who have barrel chests have significantly wider, rounder rib cages than normal. This condition is usually caused by the lungs over-inflating and forcing the rib cage stay open for long stretches of time, which they often do in a disease like chronic obstructive pulmonary disease (COPD). [5] X Research source Traumatic injuries like untreated rib fractures can also cause ribs to look slightly wider over time. [6] X Research source Additionally, people with scoliosis – a disease that causes the spine and ribs to curve unnaturally – may notice their ribs looking wider than normal because of the way they protrude from their torso. [7] X Research source In rare cases, some children are born with a birth defect called pectus carinatum where their breastbone and ribs stick out. This can make them look like their rib cages are wider than normal. [8] X Research source"
    },
    {
      "title": "No, you can't get surgery to slim down your wide rib cage.",
      "content": "No, you can't get surgery to slim down your wide rib cage. Your ribs and rib cage must stay the way they are; there are no surgical procedures that can shrink down this part of your body. Sometimes, though, if your ribs are flared out, you can turn them back in with breathing exercises and by working out your abdominal muscles."
    },
    {
      "title": "Improve your posture while sitting, standing, and walking.",
      "content": "Improve your posture while sitting, standing, and walking. Hold your shoulders back instead of rounded and your torso straight and tall. Keep your head level and your neck straight (unless, of course, you need to look up or down at something for a few seconds). Finally, pull your stomach in toward you without sucking in too hard; your goal isn't to look skinnier but to stack your core. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Practicing these basic positions will help your rib cage get back into its proper place."
    },
    {
      "title": "Exercise your core to strengthen your abdominal muscles and fix rib flare.",
      "content": "Exercise your core to strengthen your abdominal muscles and fix rib flare. If your ribs look wider because of a flare at the bottom, you may be able to gently move your rib cage back into its proper position by strengthening your core . Your core includes your abdominal muscles, which are responsible for tilting your rib cage down into a non-flared position. When they're strong again, they should be able to support your rib cage again and fix the wide look."
    },
    {
      "title": "Perform breathing exercises to reactivate your diaphragm postpartum.",
      "content": "Perform breathing exercises to reactivate your diaphragm postpartum. Breathing exercises can do wonders for realigning your diaphragm and ribs. Try diaphragmatic breathing, where you breathe in and out gently through your nose and imagine a beach ball resting in your belly. As you inhale, imagine filling up the beach ball, expanding it so your belly and rib cage push outward. Then, on every exhale, imagine the air whooshing out of the beach ball and allow all your core and pelvic muscles to completely relax. [10] X Research source"
    },
    {
      "title": "Some women are celebrating their wide rib cages to feel body positive.",
      "content": "Some women are celebrating their wide rib cages to feel body positive. Worldwide, women are often held to unrealistic beauty standards. One of those standards is a slim torso with a defined waist. Rather than feeling bad about their wide rib cages, however, many female social media influencers and models are showing off their bare midriffs in selfies and short videos. They're choosing to celebrate their body type as unique and beautiful instead of trying to change it for likes and clicks. Sara Puhto (@saggysara on Instagram) made an \"appreciation post\" for her wide rib cage in July 2021 while she was pregnant. In the post's caption, she wrote, \"Don’t let articles or anyone, including yourself, make you feel bad about your body… We are all unique and have different bodies.\" Autumn (@au.tu.mn888 on TikTok) gushed about figuring out how to dress to flatter her wide rib cage in a video from August 2023 . The text on the TikTok reads, \"Me after figuring out how to properly style my wide ribcage\" and features a sound by makeup artist James Charles saying, \"Oh my God!\" over and over. Jacquie Leal (@jacquie.lm on Instagram) posted a Reel in April 2024 advising women with wide rib cages which clothes will look best on them. She suggests opting for off-the-shoulder, wrap, and V-neck necklines and avoiding square, boxy-tops."
    },
    {
      "title": "Kim Kardashian",
      "content": "Kim Kardashian Kim Kardashian is one of the stars of the hit reality TV show Keeping Up with the Kardashians , an influencer, and the founder of the shapewear brand SKIMS – not to mention a prominent figure in the fashion and beauty world! Her rib cage is naturally wide and her waist is thick. Her hips are also wide (although many people speculate she enlarged them with plastic surgery), which gives her more of an hourglass shape."
    },
    {
      "title": "Margot Robbie",
      "content": "Margot Robbie Margot Robbie is a famous actress best known for her role as Barbie in the 2023 blockbuster film of the same name and the irrepressible Harley Quinn in Suicide Squad . Her rib cage and waist are both wide, the sides of her torso are straight, and her hips are narrow."
    },
    {
      "title": "Florence Pugh",
      "content": "Florence Pugh You may have seen Florence Pugh as Princess Irulan in Dune Part 2 , Amy March in Little Women , or Yelena Belova in Black Widow . She's also a great example of a woman with wide ribs, a short torso, and a body shape that's more square than hourglass."
    },
    {
      "title": "Most people with wide rib cages are healthy and have a normal body type.",
      "content": "Most people with wide rib cages are healthy and have a normal body type. There's nothing wrong with you that needs to be \"fixed\" – your wide rib cage is just another natural part of your body! Of course, if your wide rib cage is making it harder for you to breathe or sit comfortably, it may be a good idea to see a doctor or a physical therapist to discuss potential treatment options. Otherwise, you don't have to change your body to meet unrealistic body standards. You're beautiful just the way you are!"
    }
  ]
}