{
  "url": "https://www.wikihow.com/Stop-Being-an-Attention-Seeker",
  "title": "How to Stop Seeking Attention",
  "steps": [
    {
      "title": "Practice a creative art form.",
      "content": "Practice a creative art form. People who are considered attention seekers tend to behave in ways that are inauthentic. They do things for attention, rather than simply being or expressing who they really are. Doing something creative is a great way to express yourself authentically, and practice being yourself. You can choose any form that you want, including painting, writing, making music, singing, or practicing a craft. [2] X Research source If you’ve never done something creative before, don’t be afraid. Try something that interests you, even if you don’t know if you’ll be any good at it. Remember that you’re doing this for you. Practice expressing yourself creatively without worrying what others will think, or planning to show off what you make."
    },
    {
      "title": "Use social media constructively.",
      "content": "Use social media constructively. Social media can often be misused by people who are seeking attention. It’s okay to use social media to make plans with friends and stay on top of current events. However, if you notice that you’re using it just to get attention, you should reconsider before you post. Notice if most of your posts seem like bragging, or like showing off. Notice if your posts often express feeling sorry for yourself, or seem like you’re fishing for compliments or support. An attention-seeking post could be, \"Always having the most fun with the coolest friends in the world!!\", whereas you could instead post a picture of your friends and write, \"So grateful to have such great friends in my life.\" If you need support, instead of writing something like, \"Worst day of anyone's life, ever. I totally want to crawl into a hole and die right now,\" you could write, \"I had a really terrible day today. Is anyone available to talk? I could use some company.\" It’s okay to ask directly for support with social media. However, be clear that you’re asking for support, and keep the conversation private once someone offers."
    },
    {
      "title": "Focus on others.",
      "content": "Focus on others. When you’re always seeking attention, most of your focus is on yourself. In order to shift this, try focusing on others. There are many ways to do this. You can spend time with people you care about, volunteer, or even spend time learning about others. Are there people in your community who are in need? You could volunteer your time at a soup kitchen or retirement home. You could also volunteer at your local library, reading to kids or helping students with homework after school. Spend time with friends and family, and ask them about their own lives. Remember how much you care about them, and spend time investing in what they have to say. You can invent a way of focusing on others that’s fun for you. For example, you could organize a coat drive in the winter, or organize a neighborhood cleanup. However, don't compare yourself to others, as this often leads to inadequacy. Usually, comparisons stack your everyday experiences up against other people's highlight reels, which can make you feel bad about yourself. This can make you seek attention even more. [3] X Research source"
    },
    {
      "title": "Forgive yourself for your mistakes.",
      "content": "Forgive yourself for your mistakes. Even though it feels bad to dwell on mistakes we’ve made, many people replay those things over and over again in their heads. Allow yourself forgiveness, and see what you can learn from your mistakes. [4] X Research source You can’t change the past, but you can learn valuable lessons from it. Tell yourself how great it is that you’ve learned something new and can change the way you do things in the future. If you remember certain times that you acted in an attention-seeking way in the past, forgive yourself for those things, too. The fact that you can acknowledge those behaviors means you can work to prevent them in the future. Talk to yourself kindly, the way that you would to a friend having a difficult time. Say to yourself, \"I know I messed up that time, but I was doing my best in the moment. Everyone messes up sometimes. It's okay, and I'll try to do things differently next time.\""
    },
    {
      "title": "Create a daily practice of authenticity.",
      "content": "Create a daily practice of authenticity. Choose ways that you want to practice being authentic each day. This can mean doing something that you enjoy by yourself, or reciting an important affirmation to yourself. [5] X Research source Practice being yourself and acting in a way that feels genuine, without worrying what people will think. You can make a practice of doing one thing each day, when you feel that you’re being true to how you feel in the moment. This could mean saying something honest that you haven't before, such as, \"Actually, I don't like going to that cafe very much.\" It can also mean doing something differently, such as wearing an outfit that's comfortable, even if it's not stylish. You can develop personal affirmations to help you accept yourself. You can say something like, “I am a valuable, lovable person the way that I am,” or, “I accept and love all aspects of myself even as I work to grow and change.”"
    },
    {
      "title": "Practice mindfulness.",
      "content": "Practice mindfulness. Mindfulness refers to trying to stay present wherever you are, without getting lost in thoughts or feelings that take you out of the moment. Mindfulness is most often practiced through meditation techniques. However, there are many ways to practice mindfulness. [6] X Research source You can find books or websites that offer meditation techniques, or visit a meditation center to find guidance on how to begin meditating. You can also use an app, such as Insight Timer, Calm, or Headspace. If meditating isn’t right for you, practice mindfulness by noticing the physical sensations you’re experiencing. If you start to get distracted by guilt, shame, or unpleasant memories, just notice the feeling of your clothes on your skin, or your feet on the ground."
    },
    {
      "title": "Commit to making the change.",
      "content": "Commit to making the change. It is almost impossible to make a change in ourselves if we don’t consciously commit to doing so. If you want to change or eliminate your attention-seeking behavior, make a commitment to do so, and to take specific steps toward that goal. [7] X Research source Write down your commitment. You can put it on a calendar, marking the day you commit to start working on it. Write down daily or weekly goals, such as, “I will meditate for five minutes each day,” or, “Each week, I will volunteer 5 hours of my time to a charitable cause.” Tell someone else about your commitment. Tell a trusted friend or family member. They can check in on you to see if you’ve followed through on your commitments."
    },
    {
      "title": "Spend quality time alone.",
      "content": "Spend quality time alone. If you're an attention seeker, you probably try to spend lots of time with other people. Practice spending time by yourself, too. Set a goal for how much time you'll spend alone each day or week. When you're alone, do things that you enjoy. This will help being alone feel more fun and enticing. You can read your favorite books and magazines, walk around your favorite park or neighborhood, or dedicate time to a favorite hobby. It may be uncomfortable to spend time alone at first. However, push through that discomfort and you'll begin to cherish the time you get by yourself."
    },
    {
      "title": "Monitor your progress.",
      "content": "Monitor your progress. Once you have a practice for making positive changes, take time to reflect and see how you're progressing. You can do this by writing in a journal, asking for feedback from someone you trust, or simply taking some time to think back on the past day or week. Be gentle with yourself as you progress. Making big changes in yourself doesn't happen overnight. Praise yourself for any positive changes. [8] X Expert Source Supatra Tovar, PsyD, RD Licensed Clinical Psychologist (PSY #31949), Registered Dietitian, & Fitness Expert Expert Interview. 6 October 2021. Give yourself credit for the work you've done. Say to yourself, \"Great job. You've really been doing your best at this, and it's working.\""
    },
    {
      "title": "Look for the root of your attention seeking behaviors.",
      "content": "Look for the root of your attention seeking behaviors. Identifying why you're seeking attention can help you confront the root cause of your behaviors. For example, you may have a feeling of inadequacy, you may have trouble being alone, or you may feel like you aren't doing enough with your life. Confronting these issues will help you overcome your attention seeking tendencies. Journaling can help you explore your feelings. You can also talk to a therapist who can help you identify your underlying issues."
    },
    {
      "title": "Rely on friends and family.",
      "content": "Rely on friends and family. This should be someone you who you know will be honest with you. They should also be someone who you know has your best interests at heart. You’ll need to trust their opinion, and to be willing to hear them, even if it’s hard. they could be a sibling, aunt, close friend, or coworker. [9] X Research source Choose someone whom you see or interact with regularly. That way, they’ll be able to notice your behaviors on a more regular basis. Make sure the person will be willing to tell you things that you might not want to hear. Make sure the person is able to be kind and compassionate, even when sharing things that may sound critical."
    },
    {
      "title": "Ask for an honest evaluation.",
      "content": "Ask for an honest evaluation. Let them know the kinds of behaviors that you’re concerned about. Ask them to keep an eye out for those. They can also tell you if they think your emotional reactions to situations are dramatic or overblown. [10] X Research source If you don’t know which behaviors to look for, you can simply tell the person that you’re worried that you’re an attention seeker. Ask them to point out any behaviors that reflect that. You can also ask the person if they’ve already noticed anything you do that seems like attention seeking. Say something like, \"I'm trying to work on my attention-seeking behaviors. Have you noticed any of them? Would you be willing to keep an eye out and let me know if you notice me doing things for attention?\""
    },
    {
      "title": "Join a support group.",
      "content": "Join a support group. Attention seeking behavior is often associated with addictive behavior and personality types. If you don’t struggle with any kind of addiction, it may not make sense to join a group. However, if you are aware of other addictions or compulsive behaviors in yourself, consider joining a support group. Common addictions that are often paired with attention seeking are alcoholism, drug abuse, and compulsive eating. Being an attention seeker does not necessarily mean you’re at higher risk for addiction. Seeking help from a group can be useful whether or not you have one other person whom you’ve asked for help. You can find listings for local support groups online. If there is not a group in your area, there may be online groups that can provide support."
    },
    {
      "title": "Go to therapy.",
      "content": "Go to therapy. If you don’t have an individual person or a group to help you, you may want to find a therapist. Therapists can help you work through your attention seeking behaviors, as well as the underlying issues that have led to them. You can seek out a therapist for individual sessions, or see if they have a therapy group that would make sense for you. You can find listings for local therapists online. Many sites will have profiles of each therapist. You can see if they have a specific focus, or have experience dealing with your particular problems. Some therapists may accept health insurance or offer sliding scale payment plans."
    }
  ]
}