{
  "url": "https://www.wikihow.com/Tell-a-Friend-You-Love-Them-Platonically",
  "title": "How to Tell a Friend You Love Them Platonically",
  "steps": [
    {
      "title": "Use a term of endearment to make it clear it’s platonic.",
      "content": "Use a term of endearment to make it clear it’s platonic. [1] X Research source While it’s perfectly fine to just say “I love you,” you can add a word like “girl,” “bro,” or “dude” if that makes you feel more comfortable. If you have a silly shared inside joke or nickname, feel free to add that, too. After all, nicknames are signs of admiration and affection. [2] X Research source “I love you, girl!” “Dude, I love you.” “Hey, Smarty Pants! I love you.”"
    },
    {
      "title": "Ditch the “I” or turn “you” to “ya.”",
      "content": "Ditch the “I” or turn “you” to “ya.” Take down the intensity of “I love you” by shortening the phrase a little. It might feel more natural to say in conversation, and you still get to express how you feel. [3] X Research source Say “Love you!” as you leave after hanging out. Text “ILY” or “I luv u!” or “Love u!” or “Love ya!”"
    },
    {
      "title": "Avoid misunderstanding by clarifying how you see them.",
      "content": "Avoid misunderstanding by clarifying how you see them. Just saying “I love you” can feel a little intense, and you might be worried about it sounding romantic. To keep things platonic and set a boundary, pair your heartfelt statement with a nice comment about what their friendship means to you. [4] X Research source “I love you, Kendra! Your friendship means so much to me. I wouldn’t have gotten through Ms. Mack’s algebra class without you.” “You are such a good friend, Danny. I love you!” “I’m so glad we became friends. I love you.”"
    },
    {
      "title": "It’s okay to directly let them know you love them without caveats!",
      "content": "It’s okay to directly let them know you love them without caveats! If you’re concerned about keeping things platonic, just pick a neutral moment to say it. For instance, if you’re worried about coming off too romantically, you might want to avoid saying it while staring deeply into their eyes under the stars, while slow dancing, or while watching the sunset on the beach. Here are some examples of platonic situations where saying “I love you” is definitely appropriate: Your friend is leaving for a trip or a long drive. Your friend is sharing a major life milestone or achievement with you (ex. graduation, becoming a parent, getting a job). You haven’t seen your friend in a while. You’re thanking your friend for doing something for you (ex. bringing you a snack, giving you a ride, picking you up from the airport)."
    },
    {
      "title": "Let a GIF do the talking or pair your message with an emoji.",
      "content": "Let a GIF do the talking or pair your message with an emoji. Since it’s tough to judge tone over text, keep it light and platonic with something a little over-the-top or silly. Bonus points if you pick a GIF with a reference to a show or character/celebrity you both like. For heart emoji fans, opt for a non-traditional color like blue, green, or yellow to play it safe, and red or pink if you’re all about spreading the love and want to shout your love for your friend from the rooftops. [5] X Research source Find a GIF of cute animals being friends and send it with an “I love you” text. Pick a GIF that has “I love you” for a caption. Send “I love you” and pair it with an animal emoji or random emoji to keep things from seeming flirty or romantic. Feel free to send a kissy face emoji or heart emoji if you’re not worried about it being misinterpreted."
    },
    {
      "title": "Does your close friend feel like a sibling to you?",
      "content": "Does your close friend feel like a sibling to you? Include them in your “fam” by expressing that you love them and letting them know they're a part of your chosen family. [6] X Research source Talk about your shared history together and the ways they’ve supported you over time. Use familial language to set boundaries, too, and clarify that your relationship is platonic. “I love you, fam. You’ve really been there for me in some tough moments.” “You’re like family to me, I love you.”"
    },
    {
      "title": "How has their friendship shaped who you are?",
      "content": "How has their friendship shaped who you are? Indirectly let them know you appreciate them by telling them exactly how their presence has mattered in your life. Choose to add the phrase “I love you” if it feels right, but if you don’t add it, this is still a great way to express deep appreciation. “I don’t know that any other teammate has had as big of an impact on my life as you have. Your friendship has made me a stronger, more compassionate person.” “Because you’ve been my friend and supported me, I felt really loved this past year, even though it was really tough for me.”"
    },
    {
      "title": "Tell your friend why they’re a role model for you.",
      "content": "Tell your friend why they’re a role model for you. Which of their qualities do you aspire to have? What have you seen them do that’s inspired, moved, or transformed you? “Micah, I hear about the way that you care for your patients, and your selflessness inspires me to try and help others.” “I really admire how you’ve worked your way up to floor manager. You’ve got a killer work ethic.” “One day, I hope I’ll be as good of a surfer as you. You’re my inspiration.”"
    },
    {
      "title": "Help them out with a task to show love.",
      "content": "Help them out with a task to show love. Surprise your friend by offering them a ride, bringing them a meal, or doing a task they don’t like doing. Either do the task by yourself, or help them tackle it so that it becomes a team event. Giving your time and energy can be one of the best ways to say “I love you\"–especially if you're not super comfortable expressing that verbally. [7] X Research source"
    },
    {
      "title": "Let them know you believe in them and why.",
      "content": "Let them know you believe in them and why. Even if they’re not currently struggling, it’s okay to show them you love them by telling them what a rockstar they are! Describe how they've succeeded in the past and the qualities that you know will make them successful. \"I really believe in you and I know you're going to crush this event because you're so fast.\" \"I'm here for you, and I know you'll get through this. You're so tough!\""
    },
    {
      "title": "Praise their accomplishments, personality, and whatever else makes them special!",
      "content": "Praise their accomplishments, personality, and whatever else makes them special! Add “I love you” if it feels right, or just let your little statements of appreciation express how much you love them. Worried about coming on too strong? Chances are, your friend will appreciate whatever nice thing you say. But if you’re still worried, just avoid compliments about their appearance to dodge the romantic atmosphere. [8] X Research source “You’re always the life of the party.” “I love your outfit today. But I also love you.” “You’re an incredible singer.”"
    },
    {
      "title": "Keep the conversation casual and kindly correct your friend.",
      "content": "Keep the conversation casual and kindly correct your friend. If your friend misinterprets your platonic \"I love you\" as romantic, it can be a little awkward. They might feel uncomfortable, or they might actually have feelings for you and get their hopes up. If they're just uncomfortable with the sentiment, let them know your feelings are platonic and move the conversation along. If your friend has feelings for you , be gentle and kind as you explain that you don't feel the same way. \"Hey, I meant that in a friendly way.\" \"I really care about you, but I meant what I said in a platonic way.\" \"I think you're amazing. I only see you as a friend, though.\""
    }
  ]
}