{
  "url": "https://www.wikihow.com/Yelp-Remove-Spam-Comments",
  "title": "A Comprehensive Guide to Fighting Spam Comments On Yelp",
  "steps": [
    {
      "title": "Go to your Yelp account and find the spam comment.",
      "content": "Go to your Yelp account and find the spam comment. You can log into your business account using the mobile app or a web browser. Use this method if you see a photo or a written comment that is suspiciously spammy , but it hasn't triggered the filter. Remember that negative comments are not spam comments."
    },
    {
      "title": "Click or tap … .",
      "content": "Click or tap … . This three-dot menu icon is in the top right corner of the review."
    },
    {
      "title": "Click or tap Report Review.",
      "content": "Click or tap Report Review . Answer the following questions thoroughly, as these answers are the leading factors of getting the comment removed from your business page. [1] X Research source Yelp's team of User Operations Associates will remove the comment if they discover that it violates Yelp's quality guidelines. After flagging a comment, you'll get an email that explains whether or not Yelp removed the comment. [2] X Research source"
    },
    {
      "title": "Respond to positive reviews and monitor your profile regularly.",
      "content": "Respond to positive reviews and monitor your profile regularly. Doing both of these will help make the algorithm smarter and improve the filters that catch spam comments. You're not only improving the filter, but showing to other customers that your business is engaging, which encourages more reviews. You can also improve the spam filter by politely responding to negative reviews. By regularly monitoring your business's Yelp account, you can catch spam comments faster."
    },
    {
      "title": "The main criteria of Yelp's content guidelines are:",
      "content": "The main criteria of Yelp's content guidelines are: Relevancy : content should only review the business and stay on-topic. Conflict of interest : comments shouldn't originate from people who are associated with the reviewed business. Privacy : content shouldn't reveal private concerns of others. Originality : comments should be human-written, and first-hand experience; not written by AI or a friend. Appropriate content : no content should ever harass or threaten others. Promotional content : comments should not contain promotional or commercial content. [3] X Research source"
    },
    {
      "title": "Go to Yelp's hiring page and search for User Operations.",
      "content": "Go to Yelp's hiring page and search for User Operations . The address for their hiring page is https://www.yelp.careers/us/en . To become a Yelp content moderator, you'll be responsible for determining if the reported comment violates any one of the 6 main quality guidelines or if it is honest and is simply a negative comment that the business owner reported as spam."
    }
  ]
}