{
  "url": "https://www.wikihow.com/Write-a-Response-Letter",
  "title": "How to Write a Response Letter",
  "steps": [
    {
      "title": "Determine what the original letter was asking.",
      "content": "Determine what the original letter was asking. A response letter should address what the original letter wanted to know. Read the original letter carefully. Find out what the writer needs and begin figuring out how you can provide the information that’s needed. [1] X Research source Sometimes determining what a letter is asking isn’t very easy, especially if the letter wasn’t written clearly. Review the letter to figure out what the original writer needs from you. If you have to, take some notes on the letter to determine the point. Jot down what the letter is asking and how you might answer it."
    },
    {
      "title": "Find out the information the letter asks for if you don’t know it already.",
      "content": "Find out the information the letter asks for if you don’t know it already. If the letter you received is requesting information, you may not know it offhand. Take whatever steps you can to figure out how to answer the writer’s question before responding to the letter. [2] X Research source For example, the letter may be asking the status of a job application. If you’re not connected with the hiring process, call the hiring manager to check on the application status before responding."
    },
    {
      "title": "Forward the letter to someone else if you aren’t qualified to answer it.",
      "content": "Forward the letter to someone else if you aren’t qualified to answer it. Sometimes, especially in business, people send letters to the general address or contact person. If you receive a letter that you know someone else could answer much better, then send it along to them to reply. This ensures the recipient will get the most accurate response possible. If the person you gave the letter to may take some time to answer, it’s good practice to respond to the original writer saying that you’ve passed the letter to someone more qualified to answer it. This shows the writer that their message was received and someone is working on it."
    },
    {
      "title": "Address the letter to the person who requested the information.",
      "content": "Address the letter to the person who requested the information. Always open with a polite salutation like “Dear,” followed by the person’s name. Greet the person directly, rather than using a generic opening like, “To Whom It May Concern.” This is impersonal and seems like the request was handled by a computer. Instead, greeting the person by name is more personal and shows that care went into writing this response. [3] X Research source If you don’t know the person personally, use the titles Mr., Mrs., or Ms., followed by the person’s last name. If the person has a known title, like Dr., use this instead. If you know the person or are unaware of their gender, use their first name. As a good rule, open the letter with the same name and title that the person signed their letter with. For example, if they signed their letter “Dr. Johnson,” then open your letter with \"Dear Dr. Johnson.\""
    },
    {
      "title": "State that you’re responding to the original letter.",
      "content": "State that you’re responding to the original letter. Within your first sentence, let the reader know that you’re responding to their letter. This tells the reader that their letter was received and processed, and also lets them know the purpose of your letter. [4] X Research source Very simply sating, “I am writing in response to your letter from June 13th” is a perfect opening for a response letter. If you aren’t the original person that the recipient wrote the letter to, state where you got the letter from. For example, write, “Our customer service representative, Michelle Harris, forwarded your letter to me.” [5] X Research source"
    },
    {
      "title": "Answer the person’s inquiry as directly as you can.",
      "content": "Answer the person’s inquiry as directly as you can. After the opening, get to the main point of the letter. Address each question or concern from the person’s original letter as completely as you can. Make sure you’ve hit every point so the person is satisfied with your response. [6] X Research source State what the original letter inquired about, and then answer the question. For example: “Your letter asked who the contact person for media inquiries is. The person is Janet Walters. Her email address and phone number are as follows.” For longer inquiries, use a numbered list to answer each question. This is easier to read and shows that each concern has been addressed. Be thorough, but brief. A few sentences per question should be enough to respond to the person’s original inquiry. [7] X Research source"
    },
    {
      "title": "Acknowledge clearly if you can’t fulfill the person’s request.",
      "content": "Acknowledge clearly if you can’t fulfill the person’s request. Sometimes you can’t fulfill a person’s request. Be direct about this. Don’t use a long-winded response trying to soften the blow. Your recipient will appreciate a clear, direct response to their question. Remember to always be polite and apologize while you’re doing this so your recipient doesn’t get offended. [8] X Research source Always use an understanding tone while turning down a request, but also provide a firm response. State, “Unfortunately, I’m unable to fulfill this request. We don’t have the information you need, and I can’t say when we may have it.” If you might be able to answer the question with more information, ask the person for a response. State, “I’d like to answer your inquiry but I need to know more about your situation first. At your convenience, please respond with the date of your application and the name of the person you contacted, and I will answer as soon as possible.”"
    },
    {
      "title": "Thank the person for writing.",
      "content": "Thank the person for writing. Whether you were able to answer the person’s request or not, always be courteous and thank the person for their letter. This shows you appreciate their attention and maintains a positive relationship with the letter writer. [9] X Research source Some people prefer to open their letter with a thank-you instead. The exact placement isn’t very important, as long as you thank the person at some point."
    },
    {
      "title": "Sign the letter with your name and title.",
      "content": "Sign the letter with your name and title. Wrap the letter up with a formal closing like, “Sincerely,” followed by your name. If you’re working for a business, write your professional title underneath your name. [10] X Research source If you’re handwriting or printing the letter, leave room for your signature after printing your name. If you’re sending an email , then writing your name is fine."
    },
    {
      "title": "Review the letter to make sure you’ve answered the person’s question.",
      "content": "Review the letter to make sure you’ve answered the person’s question. Your recipient will be frustrated if they receive a response that doesn’t answer their questions. Failing to satisfy the person could leave a customer unhappy, or create more work for you because you’ll have to respond to another inquiry later on. Keep the recipient satisfied by answering their request as completely as you can. Double-check your letter and make sure it addresses everything from the original letter. If anything is missing, add it in before sending the letter out. Having a friend or coworker read the letter is helpful as well. They can put themselves in the recipient's shoes and tell you if they'd be satisfied with the response."
    },
    {
      "title": "Use the typical business letter format.",
      "content": "Use the typical business letter format . Consider all response letters formal business communications. Write professionally and use the normal business letter format to set the right tone. [11] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source On the top left, write your name, title, company (if applicable), and address. Underneath that, write the date. Finally, write the full name and address of the person you’re responding to. For typed letters, use 1-inch (2.5 cm) margins around the border. Use single-spaced text with 2 spaces in between paragraphs. If you’re typing the letter, use 12-point font and a standard text setting. If you’re handwriting the letter, make sure you write legibly."
    },
    {
      "title": "Make the recipient feel as if you’re happy to receive their request.",
      "content": "Make the recipient feel as if you’re happy to receive their request. This is especially important if you’re running a business or service. People should always feel like you appreciate their time and thoughts. Thank them for their inquiry and always use a warm, cordial tone when you write. [12] X Research source Just a simple, \"Thanks so much for writing, we appreciate hearing from you,\" can make a big difference in the tone of your letter. Make phrases like this a habit in your letters. Never give off the idea that you’re annoyed with the person writing to you. It’s better to go overboard with friendliness than make someone think you’re angry or annoyed."
    },
    {
      "title": "Keep the letter brief so your recipient can read it quickly.",
      "content": "Keep the letter brief so your recipient can read it quickly. Respect your recipient’s time. Don’t expect them to read a 3-page letter when 1 paragraph would answer their question just fine. Address the original letter’s concern as well as you can, and then send the letter. Don’t add additional passages that don’t have to be in the letter. [13] X Research source This is especially important if you’re running a business or answering a customer service inquiry. Your customer may get frustrated if they have to spend time reading a long letter that could have been half the size. Of course, don’t be so brief that you haven’t answered the person’s question. If something requires a lot of explanation, then provide the explanation. Just don’t ramble on or provide more information than you have to."
    },
    {
      "title": "Write clearly so the recipient understands your response.",
      "content": "Write clearly so the recipient understands your response. Don’t use long-winded sentences or convoluted terms. Write in plain, direct language that won’t confuse your reader. Shorter sentences are best for this purpose. As a good rule of thumb, imagine your reader is skimming the letter quickly. Will they be able to see all the main points you were making? If not, improve your language and make it clearer."
    },
    {
      "title": "Avoid jargon and technical terms that the reader may not understand.",
      "content": "Avoid jargon and technical terms that the reader may not understand. This is related to writing clearly. Unless you know for sure that the person you’re writing to is a professional who will understand technical terms, keep them out of your letter. Replace any technical terms with alternate words that a non-specialist can understand. Edit your letter by asking yourself, “Would someone who doesn’t do my job know what I’m talking about?” If not, then change your language so average people can understand it. This is a good way to eliminate jargon from your writing."
    },
    {
      "title": "Proofread your letter.",
      "content": "Proofread your letter. Typos and other mistakes make your writing look unprofessional. Always read through your letter and correct any problems with spelling, grammar, construction, and flow. A few minutes of extra work could make your letter look much more professional. [14] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Don't just rely on spell check to catch your mistakes. These programs usually don't catch grammar errors. Read the letter word-for-word to find your mistakes. If this is a very important letter, like to a business partner, have someone else read it as well. A fresh set of eyes could see mistakes that you missed."
    }
  ]
}