{
  "url": "https://www.wikihow.com/Work-at-SpaceX",
  "title": "How to Work at SpaceX",
  "steps": [
    {
      "title": "Find available positions on the company's website.",
      "content": "Find available positions on the company's website. SpaceX is a fast growing company, so they almost always have job openings available. Check on their website to find out what positions they have open and which location they are at. You can look at job openings by visiting https://www.spacex.com/careers . [1] X Research source SpaceX has locations in Texas, Florida, Washington, California, and Washington DC. If you are not located near any locations, SpaceX will pay for you to fly to the closest location for an interview. If you do get a job at SpaceX, you will need to live near one of their locations. Be prepared to relocate if you are hired."
    },
    {
      "title": "Get a relevant degree or experience for the position you're interested in.",
      "content": "Get a relevant degree or experience for the position you're interested in. There are many different career opportunities at SpaceX, most of which require experience in different fields. Engineers, electrical technicians, and machinists are always in demand at SpaceX. Look through each job opening at SpaceX and see if your degree or experience will qualify you for a specific opportunity. [2] X Research source Most job openings at SpaceX require a minimum of a Bachelor’s Degree in a relevant field. Engineering jobs may require a Master’s Degree or PhD. There are positions at SpaceX that aren't specifically tech-related, like sales and administration. However, it's still important to understand the technical side of things as much as possible. Jobs at SpaceX are very competitive, so the more you know, the better your chances will be at landing a position."
    },
    {
      "title": "List your relevant skills and accomplishments on your resume.",
      "content": "List your relevant skills and accomplishments on your resume. Degrees are important, but so is your experience. Write down your relevant skills and achievements in your resume so that your application stands out from others. [3] X Research source Be sure to highlight your passion, drive, and talent by emphasizing why you are in your line of work and what has lead you to achieving your accomplishments. SpaceX often emphasizes passion and enthusiasm in the media, so they definitely value these attributes."
    },
    {
      "title": "Write about a failure you’ve overcome to make your resume stand out.",
      "content": "Write about a failure you’ve overcome to make your resume stand out. Anyone can list their accomplishments and what they’re good at, but it takes guts to show how you’ve messed up and what you did to resolve it. To make your resume stand out, show that you can adapt to bad situations by listing a mistake or misstep that has happened in your career and how you fixed it. [4] X Research source For example, if you broke a tool while working at an engineering job, you might write down how you stopped production to fix the tool and then wrote a safety procedure to make sure it didn’t happen again. You can add this to your resume by listing it in the skills section. “Wrote a safety procedure to ensure a tool does not break again in the future and slow down production.”"
    },
    {
      "title": "Craft a cover letter that details why you are interested in SpaceX.",
      "content": "Craft a cover letter that details why you are interested in SpaceX. Cover letters are more personal than resumes and can show specifically why you are applying to SpaceX. Make sure to detail why you want to apply for your specific position and what exactly about SpaceX makes you interested in their company. [5] X Research source For example, if you love space exploration and you’ve been interested in it for a long time, write down that your passion matches the mission of SpaceX."
    },
    {
      "title": "Practice answering interview questions with a friend.",
      "content": "Practice answering interview questions with a friend. Interviews can be intimidating, so it can help to practice one with a friend. Write down some potential interview questions and have a friend or family member ask you them so you get a feel for what the interview might be like. [6] X Research source Answer questions like, “Why do you want to work for SpaceX?” You might answer with, “To help with your space missions and change the way we view space travel.” ”What motivated you to apply for this position?” You might say, “SpaceX’s mission of revolutionizing technology seems very interesting to me, and I’d like to help you reach that goal.” ”How would your skills help SpaceX reach its goal?” You could reply, “I’ve been an engineer for 10 years, and I’ve worked on a few rocket launches. I can help with creating new technology as well as implementing it.” ”Why did you choose your career path?” Try saying something like, “I love advancing technology and moving society forward. I thought an engineering job would help me do that.” ”Describe a leadership position that you’ve had in the past.” You might answer with, “For the past 2 years, I’ve been a project manager for my department. I assign tasks, make sure everything is on schedule, and assist wherever I’m needed.”"
    },
    {
      "title": "Be able to clearly explain why you want to work for SpaceX.",
      "content": "Be able to clearly explain why you want to work for SpaceX. Just like a cover letter, an interview is a chance for a company to get to know you and your values. Tell your interviewer why you applied to SpaceX and what you like about the company specifically. Reference your career path and the passion that you have for it. [7] X Research source Be sure to take a look at SpaceX’s mission statement on their website to get a feel for what they want to accomplish. Say something like, “SpaceX seems like it is innovative and lets its employees be creative with how they improve technology. I’d love to be a part of a team like that.”"
    },
    {
      "title": "Be ready to discuss how your skills will help SpaceX reach their goals.",
      "content": "Be ready to discuss how your skills will help SpaceX reach their goals. You applied to SpaceX to help with their projects. During your interview, make sure to specify what exactly your skills will help to accomplish, and how they can assist in SpaceX’s missions. For example, “I’ve been a welder for 5 years now, and I have experience in machine building. I can translate this directly to rocket building as well as other niche projects if needed.”"
    },
    {
      "title": "Research the projects that SpaceX is working on before your interview.",
      "content": "Research the projects that SpaceX is working on before your interview. SpaceX wants to hire people that are invested in their company. Spend some time before your interview reviewing the projects that SpaceX is undertaking and what your role might be. You can talk about these in your interview to show that you care about the company enough to research what they are doing. [8] X Research source"
    },
    {
      "title": "Brush up on your skills to prepare for the technical skills test.",
      "content": "Brush up on your skills to prepare for the technical skills test. SpaceX is a hugely technical company, and they only want to hire people who can contribute to their projects. Prepare yourself for a test of your technical skills that you wrote in your resume in the interview. This may come in the form of a quiz or test, or it can be an in-person workshop. [9] X Research source This may happen at a later interview stage, like a second or third."
    },
    {
      "title": "Dress well and look your best for the in-person interview.",
      "content": "Dress well and look your best for the in-person interview. Depending on the position you apply for, you may need to dress more or less formal. A welder, for instance, probably should wear a button-down shirt and slacks, while an engineer might wear a suit. SpaceX is an elite company, so you need to look the part before you can work there. SpaceX may interview you over the phone before an in-person interview. If you start with a phone interview, make sure you are not distracted by anything in your environment and that you use professional and respectful language."
    },
    {
      "title": "Use open body language to express that you are interested in the job.",
      "content": "Use open body language to express that you are interested in the job. SpaceX often says that it wants their employees to be able to do a little bit of all of their projects. Sit up straight and keep your arms uncrossed to show that you are excited about their work and that you are interested in what your interviewer is saying. Slouching or looking away from your interviewer can express that you don’t want to be there, even if you actually do."
    },
    {
      "title": "Be enrolled in a 4-year college or university.",
      "content": "Be enrolled in a 4-year college or university. Internships at SpaceX are for students enrolled in college. You also need to be pursuing a relevant degree, like engineering. Masters and PhD students can apply for an internship, but they are mostly for undergraduate students. [10] X Research source Your university or college must be accredited."
    },
    {
      "title": "Have a GPA of 3.5 or above for a better chance.",
      "content": "Have a GPA of 3.5 or above for a better chance. SpaceX only hires the top percentage of people in their field, and their internships are no exception. Although you can apply for an internship with a GPA lower than 3.5, you will have a much higher chance at getting one if you have a GPA above 3.5. [11] X Research source"
    },
    {
      "title": "Submit a resume detailing your college and job experience.",
      "content": "Submit a resume detailing your college and job experience. A strong resume is important, even for an internship. Make sure that your resume describes your university, your major, your GPA, and any projects you’ve completed in school. List any relevant job experience you’ve had on your resume as well. [12] X Research source You can find a list of internship opportunities here: https://www.spacex.com/internships/ ."
    },
    {
      "title": "Interview with a technical quiz or test.",
      "content": "Interview with a technical quiz or test. Internships at SpaceX are like jobs, except you’ll be doing a little bit of everything. Your interview will mostly consist of a technical test to make sure that you are able to handle the responsibilities of working at SpaceX and that you’d be an asset to whatever team you are assigned to. [13] X Research source You should also be prepared to go into detail about any projects that you listed on your resume."
    },
    {
      "title": "Emphasize your specific role in projects and accomplishments.",
      "content": "Emphasize your specific role in projects and accomplishments. If you’ve gotten any certificates, awards, or special achievements in your field, be sure to emphasize them on your resume and in your interview. Describe in detail any projects that you have completed and what your specific role in them was. [14] X Research source"
    }
  ]
}