{
  "url": "https://www.wikihow.com/Will-My-Alarm-Go-Off-on-Do-Not-Disturb",
  "title": "How to Ensure Your iPhone's Alarm Goes Off in Do Not Disturb",
  "steps": [
    {
      "title": "Do Not Disturb mode does not affect your alarm.",
      "content": "Do Not Disturb mode does not affect your alarm. Whether you set your alarm in the Clock app , using Siri, or by creating a Sleep Focus, you can rest assured that your iPhone's alarm will go off when your phone is on Do Not Disturb. [1] X Research source To make sure your iPhone's alarm goes off when you need it, see Setting Your Alarm Properly . If your iPhone's alarm didn't go off while on Do Not Disturb, see Why didn't my alarm go off? Your iPhone alarm will also go off in Silent mode. If you've switched the physical Silent Mode switch to On, your alarm will still go off as scheduled."
    },
    {
      "title": "Open the Clock app on your iPhone.",
      "content": "Open the Clock app on your iPhone. There are two easy ways to get to the Clock app: You can either tap the Clock app on your Home screen or in your App Library, or open the Control Center and tap the Clock icon. [2] X Research source"
    },
    {
      "title": "Tap the +.",
      "content": "Tap the + . You'll see it at the top-right corner of the app. [3] X Research source If you want to edit an existing alarm, tap Edit at the top-left corner, then choose an alarm."
    },
    {
      "title": "Select the time you want your alarm to sound.",
      "content": "Select the time you want your alarm to sound. Scroll up or down on each of the three wheels to choose the exact hour, minute, and time of day (AM or PM) you want your alarm to sound. Don't forget to choose AM to ensure your alarm goes off in the morning, or PM for a night alarm."
    },
    {
      "title": "Choose whether to repeat the alarm.",
      "content": "Choose whether to repeat the alarm. By default, your iPhone's alarm will only go off once. If you want to set an alarm that repeats daily, weekly, or on certain days, you can create a repeating alarm: Tap Repeat . Choose which days you'd like this alarm to go off at the selected time. Tapping a day adds a checkmark to that day. For example, if you want your alarm to ring at the same time every weekday, select Monday , Tuesday , Wednesday , Thursday , and Friday . If you only want to use this alarm once, don't select any days. Tap Back to return to the previous screen when you're finished."
    },
    {
      "title": "Add a label for this alarm (optional).",
      "content": "Add a label for this alarm (optional). If you're setting a recurring alarm, you can add a name to the alarm so you'll always know which alarm you're using. To do so: [4] X Research source Tap Label . Type a name for the alarm, such as Work or School . Tap the done key on the keyboard to save."
    },
    {
      "title": "Select an alarm sound.",
      "content": "Select an alarm sound. By default, your alarm sound is Radar , but you can choose any alarm sound on your iPhone. To change the sound: Tap Sound . Tap a sound to hear a preview. The orange checkmark will move next to the selected sound. Tap Back once you've settled on your preferred sound."
    },
    {
      "title": "Toggle Snooze on or off.",
      "content": "Toggle Snooze on or off. If you want to give yourself a chance to sleep for 10 extra minutes by tapping Snooze when your alarm sounds, leave the Snooze switch in the On (green) position. If not, you can tap the switch to turn it off. If you turn off Snooze for this alarm, you won't be given the option to snooze your alarm when it goes off. This means that if you turn your alarm off in your sleep, it won't ring again. Disable this option at your own risk!"
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It's at the top-right corner of the screen. Your alarm is now properly set and will go off at the selected time, on the selected days, even in Do Not Disturb. [5] X Research source"
    },
    {
      "title": "The volume may be too low.",
      "content": "The volume may be too low. Even if you've set your alarm properly , you might not hear it if the volume is too quiet. To check and change your alarm volume: [6] X Research source Open the Settings app. Tap Sounds & Haptics . Drag the slider to the right to increase the volume. If you have the \"Change with Buttons\" option toggled on, you can also adjust your alarm volume using the physical volume buttons on the side of your iPhone. However, this could be dangerous as far as your alarm goes—if you make your ringtone too quiet using these buttons, you might forget to increase the volume before you go to sleep."
    },
    {
      "title": "You might not have an alarm sound selected.",
      "content": "You might not have an alarm sound selected. If your iPhone only vibrates instead of sounding your alarm, you may have set the alarm tone to None instead of one of the alarm sounds. Here's how to check: Open the Clock app. Tap Edit and select your alarm. If you see None next to \"Sound,\" tap it, then choose a sound. Tap Back and then Save to save your changes."
    },
    {
      "title": "You set the alarm for the wrong time or day.",
      "content": "You set the alarm for the wrong time or day. If you choose PM instead of AM or didn't choose the right time or day, your alarm won't go off when you expect it. To avoid this problem, use our guide to setting your alarm properly."
    },
    {
      "title": "You may have unknowingly turned it off in your sleep.",
      "content": "You may have unknowingly turned it off in your sleep. If you're a deep sleeper , it's possible that your alarm did go off, but that you turned it off while still asleep. This may sound silly, but it's very common! If this happens to you often, you might want to set a backup alarm that goes off a few minutes after your first alarm so you don't oversleep."
    }
  ]
}