{
  "url": "https://www.wikihow.com/Turn-On-an-Android-Phone",
  "title": "Turning On an Android Phone: With or Without Power Button",
  "steps": [
    {
      "title": "Press and hold the \"Power\" or \"Side\" button for 5-7 seconds.",
      "content": "Press and hold the \"Power\" or \"Side\" button for 5-7 seconds. It's usually a single button along the phone's top or right edge. [1] X Research source Since quickly pressing this button can easily happen accidentally, the button needs to be held for a few seconds for it to trigger."
    },
    {
      "title": "Release the \"Power\" button when you see the startup logo.",
      "content": "Release the \"Power\" button when you see the startup logo. You can let go of the button when you see the phone's splash screen (it's usually the phone's manufacturer). If you have a security code, you will need to enter it before you can use your Android phone. [2] X Research source"
    },
    {
      "title": "Press and hold \"Volume Up\", and \"Volume Down\", and plug your phone into a computer.",
      "content": "Press and hold \"Volume Up\", and \"Volume Down\", and plug your phone into a computer. This will trigger your Android phone to start in fastboot mode. Use this method if the \"Power\" button on your phone is broken or doesn't work. At this point, your computer will recognize your phone and prompt you for instructions on how to continue. If you simply want to turn the phone on, you can choose to Use for USB charging only'\"; however, if you want to access your phone with your computer, choose Allow data sharing over USB ."
    },
    {
      "title": "Check for damage.",
      "content": "Check for damage. If your phone won't turn on with any method, look for damage that could be preventing the phone from working: Look in the USB port for corrosion or bent pins. Look for liquid damage (corrosion, rust, or condensation can be clues). Make sure the USB cable connects securely to the phone's USB port. If necessary, clean it ."
    },
    {
      "title": "Try a soft reboot.",
      "content": "Try a soft reboot. Press and hold the \"Power\" and \"Volume Down\" keys at the same time until your phone restarts. Skip this step if your \"Power\" button is broken. You may need to hold the buttons down for 60 seconds. If your phone enters Maintenance Boot Mode, use the \"Volume Up\" and \"Volume Down\" keys to select Normal Boot ."
    },
    {
      "title": "Make sure the phone is charged.",
      "content": "Make sure the phone is charged. If a quick 10-minute charge isn't working, try charging the phone longer, for about an hour. You need to use the charging cable and adapter that came with the phone. It can take up to 10 minutes to see a battery charging indicator on the screen, especially if the battery was completely drained."
    },
    {
      "title": "Request service.",
      "content": "Request service. If you've tried troubleshooting to no avail, you should get in touch with your phone's manufacturer to schedule a repair for your phone."
    }
  ]
}