{
  "url": "https://www.wikihow.com/Test-if-a-Plant-Is-Edible",
  "title": "How to Test if a Plant Is Edible",
  "steps": [
    {
      "title": "Avoid ever having to use this method without careful planning.",
      "content": "Avoid ever having to use this method without careful planning. Some plants can be deadly, and even if you follow these guidelines perfectly, there is always a chance that a plant will make you seriously ill. Prepare yourself for wilderness outings by learning about the local flora and fauna, and carry a guidebook or taxonomic key to help you identify plants. Even if you are unprepared and cannot find food you know to be safe remember that, depending on your activity level, the human body can go for days without food, and you're better off being hungry than being poisoned."
    },
    {
      "title": "Find a plant that is plentiful.",
      "content": "Find a plant that is plentiful. You don't want to go through the rigorous process of testing a plant if there's not a lot of it to eat."
    },
    {
      "title": "Abstain from eating or drinking anything but purified water for 8 hours before the test.",
      "content": "Abstain from eating or drinking anything but purified water for 8 hours before the test. (If you have to use this method, this step will probably be unavoidable.)"
    },
    {
      "title": "Separate the plant into parts.",
      "content": "Separate the plant into parts. Some plants have edible parts and poisonous parts. In order to test if a plant is edible, you must separate it into the leaf, stem, and root and test each part separately for edibility. [1] X Research source After you have separated the plant into parts, inspect each part you are preparing for parasites. If you encounter worms or small insects inside the plant, discontinue the test with that sample and consider seeking a different sample of the same plant. Evidence of worms, parasites or insects indicates that the plant is rotten, especially if the organism has vacated the plant. Many parts of plants are only edible during certain seasons (for example, acorns collected after the fall are usually rotten). If you find grubs inside the plant, the plant is rotting, but the grubs are edible and contain high amounts of protein (although they taste sour and are gritty)."
    },
    {
      "title": "Find out if the plant is contact-poisonous.",
      "content": "Find out if the plant is contact-poisonous. A contact-poisonous plant is one that causes a reaction merely by touching your skin. Rub the selected plant part on the inside of your elbow or wrist. Crush it so that the sap touches your skin, and hold it there for 15 minutes. If the plant causes a reaction in the next 8 hours, do not continue testing that part of that plant. [2] X Research source Do this with each part of the plant until you find a part that isn't contact-poisonous."
    },
    {
      "title": "Cook a small portion of the plant part.",
      "content": "Cook a small portion of the plant part. Some plants are poisonous only when raw, so it's a good idea to cook the plant part you are testing if possible. If you can't cook the plant or if you don't anticipate that you will be able to cook it in the future, just test it raw."
    },
    {
      "title": "Test the plant in your mouth.",
      "content": "Test the plant in your mouth. This portion of the test is where things get dangerous, so proceed very slowly and carefully. Take the following steps to test the plant in your mouth: Hold a small portion of the prepared plant part against your lip for 3 minutes. Do not put the plant in your mouth. If you notice any burning, tingling, or other reaction, discontinue testing. [3] X Research source Place another small portion of the plant part on your tongue. Hold the plant on your tongue without chewing for 15 minutes. Discontinue testing if you notice any reaction. [4] X Research source Chew the plant and hold it in your mouth for 15 minutes. Chew the plant well, and do not swallow. Discontinue testing if you notice any reaction. Swallow the small portion of the plant."
    },
    {
      "title": "Wait 8 hours.",
      "content": "Wait 8 hours. Do not eat or drink anything during this period except purified water. If you feel sick, immediately induce vomiting and drink plenty of water. If activated charcoal is available, take that with the water. Discontinue testing if you experience any adverse reaction. [5] X Research source"
    },
    {
      "title": "Eat 1/4 cup of the same kind of plant part prepared the same way.",
      "content": "Eat 1/4 cup of the same kind of plant part prepared the same way. It is critical that you use exactly the same part of exactly the same kind of plant, and that you prepare it in exactly the same way as you did the initial sample. [6] X Research source"
    },
    {
      "title": "Wait an additional 8 hours.",
      "content": "Wait an additional 8 hours. Abstain from any other food except purified water. Induce vomiting immediately as above if you should feel ill. If no reaction has occurred, you may assume only that particular part of the plant is safe to eat, and only as prepared during the test."
    },
    {
      "title": "Begin a new test if the plant part you have chosen fails any of the tests.",
      "content": "Begin a new test if the plant part you have chosen fails any of the tests. If the first plant part you choose appears contact-poisonous, you may immediately test a new plant on your other arm or behind your knee. If the plant causes a reaction before you have swallowed it, wait until the symptoms have disappeared before testing a new plant. If you have an adverse reaction after you've swallowed the plant, wait until symptoms have disappeared and start a new test. Although there may be edible parts of the plant you initially chose, it is preferable to move on to a different plant for subsequent tests."
    },
    {
      "title": "Do a gradual test if you have other food sources.",
      "content": "Do a gradual test if you have other food sources. If you are in a situation where you have access to other sources of safe food, you can incorporate this test into your diet more gradually by splitting it up into 3 stages, and using your 8 hours of normal sleep as the 8 hours of the pre-test for each stage. Again, this should only be used if you are in a survival situation (e.g. your existing food rations are running low, and you need to start testing another source before your current one is depleted) or if you cannot find documentation for a particular plant and are willing to undergo the risks (poisoning and death) involved. Wake up and do the contact-poisonous part of the test. After 8 hours, eat a normal meal ( not of the plant under test). Next morning, complete the test up to swallowing a single piece. After 8 hours, assuming you are still alive and well, eat a normal meal again. Eat the full sample of the plant under test on the 3rd morning. After 8 hours, celebrate life and the adding of a new edible plant to your experience by eating a nice meal. Don't disregard any other steps, or tips, or warnings; this alternative method is only to save your body from the stress of 24 hours of fasting. This method also enables you to continually test new plants in your area without going hungry for more than 16 hours a day, and only 8 hours on the final day, assuming 1/4 cup of the food can sustain you."
    },
    {
      "title": "Know the signs of a poisonous plant.",
      "content": "Know the signs of a poisonous plant. Some plants that are poisonous look, smell and taste completely edible, but others provide signs that they aren't to be eaten by humans. Avoiding plants with these qualities might cause you to miss out on a plant that's actually edible, but it's much better to play it safe. Stay away from plants with the following characteristics: [7] X Research source White berries. Milky sap. An almond scent. Seeds, beans or bulbs inside pods. Thorns, spines or hairs. A bitter taste. Grain heads with pink or black spurs. Groups of three leaves."
    },
    {
      "title": "Look for recognizable edible plants.",
      "content": "Look for recognizable edible plants. If you know what you're looking for, you're likely to find some plants that you recognize from the produce aisle of the grocery store. Do not eat any unfamiliar berries that you see unless you are 100% sure that the berry is edible unless you are willing to risk illness and death. Every plant you encounter in the wild should be tested according to the above method since some poisonous plants look very similar to edible ones. However, plants that look like the following common edible plants are a good place to start: [8] X Research source Blueberries Blackberries Dandelion Asparagus Strawberries Wild onion Persimmon Chestnut Bananas Mangos Coconuts Papaya Taro Cactus"
    },
    {
      "title": "Don't forget seaweed.",
      "content": "Don't forget seaweed. Seaweed is a nutritious plant source that is edible as long as it's harvested fresh from the ocean. Don't attempt to eat seaweed that has washed up on the shore. If you can wade out a bit and harvest some fresh seaweed, you'll have a good food source that provides minerals and vitamin C. These common seaweeds are edible: [9] X Research source Kelp Green seaweed Irish moss Dulse Laver"
    }
  ]
}