{
  "url": "https://www.wikihow.com/Wear-Hand-Wraps",
  "title": "How to Wear Hand Wraps",
  "steps": [
    {
      "title": "Hook your thumb through the loop.",
      "content": "Hook your thumb through the loop. First, hold your hand up in an open position, palm-down. Keep your hand straight with your forearm, with your fingers straight and slightly spread out. Spread your fingers and thumb apart. Then slip the wrap’s looped end over your thumb so that the wrap itself falls across the back of your hand. [1] X Research source Be sure to begin wrapping your hand across the back of your hand rather than your palm. Beginning with the back of your hand will prevent the wrap from loosening later on."
    },
    {
      "title": "Wrap your wrist.",
      "content": "Wrap your wrist. Let the wrap fall from the outside (pinky-end) of your hand. Pull the loose end under your wrist, below the ball of your thumb. Then wind it over the top of your wrist, drawing it tight enough to provide support for your wrist, but not so tight that it cuts off circulation. Repeat so that you complete a total of two to three passes under and over your wrists. [2] X Research source For extra support, wrap your wrist three times. However, if your wrap is too short, or if you prefer keeping your wrists a little loose for specific punching styles (like uppercuts and angled hooks), only wrap it twice."
    },
    {
      "title": "Encase your hand.",
      "content": "Encase your hand. Once you have finished your wrist, let the loose end hang once again from the outside of your wrist. Pull the loose end under your palm to the area between your thumb and index finger. Draw it over the top of your hand, again making sure that you pull it tight enough for support, but not tight enough to restrict blood-flow. Repeat for a total of three passes under and over your hand. [3] X Research source At this point, focus more on wrapping your hand securely rather than your knuckles."
    },
    {
      "title": "Start between your pinky and ring fingers.",
      "content": "Start between your pinky and ring fingers. The loose end of your wrap should again be hanging from the outside of your hand. Draw it under your palm to where your wrist meets the ball of your thumb. From there, pull it over the top of your hand and down in between your pinky and ring fingers. Then draw the wrap to the inside of your hand. Pull it up and over your index knuckle and then across the back of your hand to where it meets your wrist. [4] X Research source Looking at the top of your hand, you will now see that you have formed an X, with the loose end once again hanging off the outside of your hand."
    },
    {
      "title": "Make a second X.",
      "content": "Make a second X. Draw the loose end under your hand so that it comes up below your thumb, as before. Now pull it over the top of your hand and down in between your ring and middle fingers. Draw the wrap to the inside of your hand. Pull it around your index knuckle and then cross the back of your hand again, finishing as before with the loose end hanging from the outside of your hand, at its bottom. [5] X Research source"
    },
    {
      "title": "Make one last X.",
      "content": "Make one last X. Repeat the same process. Only this time, pull the wrap down in between your middle and index fingers. This way, each knuckle will be supported and safely separated from each other, reducing the risk of injury. Finish as before by drawing the wrap from the inside of your hand, across the back, and down around the bottom, where it meets your wrist. [6] X Research source"
    },
    {
      "title": "Wrap or strap your thumb.",
      "content": "Wrap or strap your thumb . After you finish the last X along the back of your hand, pull the loose end under the bottom of your hand, below your thumb. Now wrap it over and under your thumb, covering the joint in the middle of your thumb. Only do so once. After that, flip your hand so that the palm faces up."
    },
    {
      "title": "Secure your thumb.",
      "content": "Secure your thumb. Once you have flipped your hand over, draw the wrap along the back of your hand to where it meets your wrist on the pinky-side. Now pull it up and over the bottom of your palm to the base of your thumb. With your thumb spread wide, pull the wrap behind your thumb and then straight across your palm to its pinky-side. [7] X Research source"
    },
    {
      "title": "Cover your knuckles.",
      "content": "Cover your knuckles. Pull the wrap around the backs of your knuckles. Then draw it over the base of your fingers along your palm. Repeat this twice, for a total of three wraps around your knuckles. [8] X Research source"
    },
    {
      "title": "Hook-and-loop fasten to finish.",
      "content": "Hook-and-loop fasten to finish. Once you have wrapped your knuckles, draw what is left of your wrap down to your wrist. If you have excess material left, either wrap it around your knuckles as before, create more X’s across the back of your hand, or both. Once done, use the hook-and-loop fastener to secure your wrap along your wrist. Clench your hand into a fist to make sure the wrap tightens when you do so. [9] X Research source Be sure that any excess wrapping along your knuckles doesn’t prevent your glove from fitting. If your glove doesn’t fit with all that extra padding, use a shorter wrap."
    }
  ]
}