{
  "url": "https://www.wikihow.com/Talk-Faster",
  "title": "How to Speak More Quickly",
  "steps": [
    {
      "title": "Read a book or another text out loud at different speeds.",
      "content": "Read a book or another text out loud at different speeds. Grab a book—any book—and start reading out loud. Begin at a comfortable, conversational pace, then gradually ramp up your speed until you’re reading as fast as possible. This helps strengthen the connection between your brain and mouth, helping your mouth catch up to your brain. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Read the same passage multiple times, each time at a different speed, and time how long it takes you to finish it. Push yourself to go faster! Also try reading the passage backward as fast as possible, which can help you confidently get the words out without thinking too hard about what they mean."
    },
    {
      "title": "Insert filler words into a passage and read it out loud.",
      "content": "Insert filler words into a passage and read it out loud. As you read, say a “filler” word between each word on the page, such as “and” or “or.” This helps you think more about diction than the meaning, and helps your mouth practice separating each word so that they don’t all blend together. [2] X Research source For example, the phrase, \"The dog walked down the street,” becomes, \"The and dog and walked and down and the and street and.\""
    },
    {
      "title": "Say tongue twisters in your free time.",
      "content": "Say tongue twisters in your free time. Voice and speech coach Patrick Munoz suggests saying tongue twisters whenever you have a spare moment to exercise your mouth, get better at enunciating your words, and speak smoothly. Try saying them both staccato, or choppy, then as smoothly as possible. For example, say, “Peter Piper picked a peck of pickled peppers. A peck of pickled peppers Peter Piper picked. If Peter Piper picked a peck of pickled peppers, where’s the peck of pickled peppers Peter Piper picked?” If you struggle with words that begin with a certain letter, such as “j” words, focus on a tongue twister that features the letter “j”, like, “James just jostled Jean gently. Jack the jailbird jacked a jeep.” Tongue twisters are also great warm up tools for when you’re about to talk to others or deliver a speech and want to speed up your pace and practice enunciation."
    },
    {
      "title": "Try speaking with a pen in your mouth.",
      "content": "Try speaking with a pen in your mouth. Hold the pen or pencil horizontally in your mouth between your teeth. Then, practice speaking, or reading a text out loud. This makes your tongue work overtime to enunciate your words, making it much easier when you want to speak quickly later. [3] X Research source Try to articulate every word as you read out loud, even if it may be difficult due to the pen. Aim to pronounce each word as though the pen wasn’t there. This also helps you develop exaggerated mouth and facial movements, which can make you a more engaging speaker."
    },
    {
      "title": "Use short pauses to catch your breath.",
      "content": "Use short pauses to catch your breath. Breathing is key, even when you’re trying to talk quickly. Practice taking short breaths in between sentences, and deeper breaths in between bigger ideas or sections in your speech. This helps you breeze along, and also lets your audience keep up with you. [4] X Research source For example, you might take a deeper breath between topics in a presentation, or when another person begins to speak during a performance."
    },
    {
      "title": "Reduce the use of “filler words” in your speech.",
      "content": "Reduce the use of “filler words” in your speech. Filler words are terms that you tend to say when you’re thinking of what to say next, or when you’re nervous. Words like “uh”, “um”, “like”, and “you know” do not hold any meaning and will slow you down when you are trying to talk quickly. [5] X Research source Challenge yourself to cut them out of your sentences. Voice and speech coach Patrick Munoz suggests taking a breath whenever you want to say a filler word, and to embrace a little silence. That silence gives your audience a moment to absorb what you’re saying. Also wear a rubber band on your wrist, and snap it lightly on your skin when you say a filler word to train the impulse away. Aim to cut down filler words like “actually,” “literally,” and “in fact,” as well. These can be useful words, but we sometimes lean on them too much."
    },
    {
      "title": "Record yourself speaking and count the words.",
      "content": "Record yourself speaking and count the words. Use your phone to record yourself speaking, then listen back to it. Are there moments where you can’t understand yourself? Pinpoint those moments and repeat the words clearly. Also, count the number of words you say in a minute. For reference, a normal speaking rate is about 140 words per minute. [6] X Research source Keep recording your practice exercises and challenging yourself to squeeze in more!"
    },
    {
      "title": "Exercise while speaking to expand your lung capacity.",
      "content": "Exercise while speaking to expand your lung capacity. Voice and speech coach Patrick Munoz says to “jump around” as you practice talking quickly. It’s much harder, but the exercise helps you build up stamina and lung capacity, which means you’ll be able to take faster, quicker, and deeper breaths while speaking. Do jumping jacks while singing along to a song, or ramble out loud while running."
    },
    {
      "title": "Sing along to rap or hip hop songs for practice.",
      "content": "Sing along to rap or hip hop songs for practice. Find a rap artist with serious, rapid flow and practice rapping along. This not only helps you talk faster, but gives you an ear for speaking rhythm and pacing, too. Some super speedy rappers include Twista, Eminem, Busta Rhymes, and Tech N9ne. [7] X Research source"
    },
    {
      "title": "Warm up your vocal chords before a presentation or talk.",
      "content": "Warm up your vocal chords before a presentation or talk. Give yourself 10-15 minutes before a presentation to warm up your voice and lungs and prepare your vocal chords for some fast talking. It’s like stretching before a workout—it gives your mouth more range and ability to perform its best. [8] X Research source Try some common warm up vocal exercises , including: Close your lips and force air between them until you make a horse-like noise to loosen up the muscles around your mouth. Voice and speech coach Patrick Munoz suggests taking a big yawn and a sigh to “open up your throat… relax your muscles,” and expand and stretch your vocal cords. Stretch your facial muscles by trying to get your mouth, nose, and eyebrows as close together as possible. Then, try to get them as far apart as possible. Stick your tongue out while you do this."
    },
    {
      "title": "Practice and record your speech beforehand.",
      "content": "Practice and record your speech beforehand. Voice and speech coach Patrick Munoz says to say your speech out loud and record yourself to get a feel for your own pacing and enunciation. Practice in front of a mirror to get familiar with the material, and to analyze and tailor your delivery. Listen to the playback of your presentation and note if you slow down in particular areas of your speech. Focus on speeding up your delivery in these spots the next time you practice the speech."
    },
    {
      "title": "Practice or replace words you find difficult to pronounce.",
      "content": "Practice or replace words you find difficult to pronounce. Voice and speech coach Patrick Munoz emphasizes practice, practice, practice. If you find yourself stumbling over a certain word, stop and repeat it over and over until it’s natural. Or, when preparing the speech , simply replace it with a simpler synonym or phrase that still conveys your meaning. For example, you may replace a term like “utilize” with the more simplified term, “use”. Or, you may replace a more academic phrase like “let me solidify my point” with a more simplified phrase, “let me demonstrate what I mean.” Also, revise wordy or long-winded sections of your speech to be shorter and more to-the-point. Often, shorter is better for speeches and talks."
    },
    {
      "title": "Keep talking through a mistake.",
      "content": "Keep talking through a mistake. A mistake is only a problem for as long as you dwell on it, which also slows down your speech. But if you move on quickly, your audience also forgets the mistake quickly. [9] X Research source Whenever you stumble, find your footing and keep talking! Avoid drawing attention to your fumble by apologizing or saying things like “oops!” Correct yourself if necessary, then move on. Also, focus more on the words you’re saying and how you say them than the audience. Worrying about your audience only distracts you and leads to more mistakes."
    },
    {
      "title": "Use your hands when you speak.",
      "content": "Use your hands when you speak. When you gesture during a speech, your audience has an easier time understanding you, even when talking quickly. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Gestures also help you pace yourself, as your words sync up with your movements. Incorporate some simple motions into your presentation to make it smoother and easier to follow. For example, you might clasp your hands during an emotion segment, or move them up and down to really drive home an important point. Also, demonstrate positive body language. Make eye contact with your audience and position your body to face them to keep them engaged. [11] X Research source"
    }
  ]
}