{
  "url": "https://www.wikihow.com/Stop-Efflorescence",
  "title": "How to Stop Efflorescence",
  "steps": [
    {
      "title": "Apply vinegar to the affected area to avoid using chemicals.",
      "content": "Apply vinegar to the affected area to avoid using chemicals. Dampen the wall with water first. Mix even portions of vinegar and water to create a solution. Regular white vinegar with 5% acidity works fine. With a sponge, apply vinegar to the area with efflorescence and clean it a circular motion. Leave the solution on the area for 10 minutes before rinsing the area thoroughly with water. Vinegar works best on surfaces like stucco, but can also work on concrete and bricks. It may take multiple applications of vinegar solution to completely remove efflorescence from the area."
    },
    {
      "title": "Scrub smooth surfaces with a coarse brush if residue remains.",
      "content": "Scrub smooth surfaces with a coarse brush if residue remains. A stiff-bristled brush will work best as you scrub the area. Keep the affected area dry as you scrape the salt and residue away. After using the brush, wipe away any remainder with a wet sponge or cloth. Brush away outdoor efflorescence on a warm, dry day. [1] X Research source"
    },
    {
      "title": "Use pressurized water if the efflorescence is outdoors.",
      "content": "Use pressurized water if the efflorescence is outdoors. Either a pressure washer or a power washer hose attachment will work. Hold the nozzle 1 foot (0.30 m) from the ground as you spray, moving it in short side-to-side movements until the efflorescence is gone. [2] X Research source Since most of the salts would be water-soluble, dry the area or use a wet vacuum to remove the standing water."
    },
    {
      "title": "Clean the efflorescence with a chemical cleaner as a last resort.",
      "content": "Clean the efflorescence with a chemical cleaner as a last resort. A stronger acid, like muriatic acid, may be necessary if efflorescence is persistent. Follow the mixing directions on the bottle to make an acid solution. [3] X Research source Presoak the wall with water before application. Let the acid sit for 5 minutes before brushing the efflorescence away. [4] X Research source Use fresh water to rinse away the acid solution when you are finished. [5] X Research source Wear rubber gloves, safety glasses, and protective clothes like aprons while applying the acid solution. You can use white vinegar, ammonia, and muriatic acid solution to clean white efflorescence residue from pavers. Rinse the pavers with water. Then pour the cleaning solution over the pavers and let them sit for a few minutes. Scrub the surface with a hard brush. Finally, rinse everything off with a water hose."
    },
    {
      "title": "Store your masonry materials off the ground.",
      "content": "Store your masonry materials off the ground. Many building materials are porous and will absorb water if they are left sitting on the ground. Store bricks or cement on pallets and cover them with a waterproof tarp at the end of each night. [6] X Research source"
    },
    {
      "title": "Implement overhangs, copings, and flashings to minimize water absorption.",
      "content": "Implement overhangs, copings, and flashings to minimize water absorption. Including these into the structure you're building will help prevent water from entering the material when it rains. [7] X Research source Overhangs extend over a wall so rainwater does not come into contact with the wall. Copings are slanted caps on top of walls so water does not rest on the flat surface. Flashings are like gutters and divert the water in a different direction than the masonry."
    },
    {
      "title": "Install a plastic sheet in-ground to prevent moisture.",
      "content": "Install a plastic sheet in-ground to prevent moisture. Form a capillary break between the soil and your building material, either as a sheet of polyethylene or as liquid-applied waterproofing. [8] X Research source Capillary breaks are usually installed during the initial building process and may be difficult to add afterward."
    },
    {
      "title": "Point sprinklers away from walls.",
      "content": "Point sprinklers away from walls. Keep water away from an area that may be susceptible to efflorescence. [9] X Research source If you have plants next to a porous wall, use a hose and water them directly rather than setting up a sprinkler."
    },
    {
      "title": "Purchase a silicate-based concrete sealer.",
      "content": "Purchase a silicate-based concrete sealer. Silicate sealers soak into the concrete and create a hard barrier that is waterproof. They can be painted over once they have dried. You can find these sealants at big box home care stores. [10] X Research source Silicate-based sealers do not work on walls or areas that have already been treated or painted over. [11] X Research source"
    },
    {
      "title": "Wait until the concrete has cured for 30 days.",
      "content": "Wait until the concrete has cured for 30 days. If you are planning on sealing new concrete, wait until it has cured fully, which usually takes around 4 weeks. [12] X Research source Silicate and siliconate sealers can be applied as soon as the concrete can support your weight. [16] X Research source Sili"
    },
    {
      "title": "Apply when temperatures are between 50 °F (10 °C) or 90 °F (32 °C).",
      "content": "Apply when temperatures are between 50 °F (10 °C) or 90 °F (32 °C). Check the label on the product to determine the temperature range when it should be applied. If the temperature is hotter than listed, the sealer may crack or bubble, making it less effective. [14] X Research source If applying the sealer outdoors, check the weather to make sure rain is not expected for the next 24 hours. [15] X Research source"
    },
    {
      "title": "Use a paint roller or pump sprayer.",
      "content": "Use a paint roller or pump sprayer. If you're covering a large area, a sprayer is suggested. Otherwise, use a paint roller with ¼ in to ⅜ in (6.35 mm to 9.5 mm) nap. [16] X Research source"
    },
    {
      "title": "Apply 2 thin coats of the sealer to the concrete.",
      "content": "Apply 2 thin coats of the sealer to the concrete. Allow the first layer of sealer to dry for 2 to 4 hours before applying the second coat. The second coat should be applied in an opposite direction, or perpendicular, to how you put on the first coat. [17] X Research source Avoid using too much sealer on one coat or else you will have puddles and bubbling. [18] X Research source"
    },
    {
      "title": "Allow the sealant to dry for up to 3 days.",
      "content": "Allow the sealant to dry for up to 3 days. Try your best to avoid foot or vehicle traffic over your freshly sealed concrete. Areas with heavy traffic should be given the most time, about 3 days, to set before they are walked on again. [19] X Research source"
    }
  ]
}