{
  "url": "https://www.wikihow.com/Sujood",
  "title": "What Is Sujood & Why Is It Important in Islam?",
  "steps": [
    {
      "title": "Sujood is the act of prostration to Allah while facing the Qibla.",
      "content": "Sujood is the act of prostration to Allah while facing the Qibla. Sujood is performed during each rak’ah in the 5 daily prayers (Salah). When you prostrate, you kneel and bow until your nose, forehead, knees, the palms of your hands, and both sets of toes touch the ground. The soles of your feet face behind you, and your elbows point far out from your body. [1] X Research source A rak’ah is a set or unit of movements that is repeated a number of times determined by the type of prayer. A single act of Sujood is called a Sajdah (Sajdat or Sujood is the plural form). The Qibla is the direction of the Kaaba in Mecca, Saudi Arabia. The Kaaba is a shrine considered by Muslims to be the most sacred place on Earth. [2] X Research source Some scholars and schools may say that women must tuck their elbows into their body as an act of modesty."
    },
    {
      "title": "Sujood is the physical act of humbling yourself to Allah.",
      "content": "Sujood is the physical act of humbling yourself to Allah. When you prostrate, you’re surrendering to the power of Allah and humbly submitting yourself to Him. In this position, you’re the closest you can get to your Lord because you set aside any pride or arrogance to submit to His superiority. [3] X Research source The intimacy between you and Allah is most powerful while prostrating because you enter a vulnerable state that requires you to concentrate on Him entirely. The intercession of the Prophet Muhammed (ﷺ) on the Day of Judgement will begin after he performs Sajdah, and everyone who makes Sajdah will not be consumed by the fire. [4] X Research source"
    },
    {
      "title": "Sajdah al-Shukr",
      "content": "Sajdah al-Shukr This is known as the prostration of gratitude, and is performed when you receive good news or are saved from a calamity. To perform a Sajdah of Shukr, turn toward the Qibla, say that Takbeer ( “Allahu Akbar” ) and prostrate. [5] X Research source Abu Bakrah reported that “when the Prophet (ﷺ) heard news that made him happy, or for which one should be happy, he would fall down prostrate in gratitude to Allah, the Blessed and Exalted” (Book 5, Hadith 592). [6] X Research source This type of prostration can be performed at any time except during Salah or immediately after completing Salah."
    },
    {
      "title": "Sajdah al-Sahw",
      "content": "Sajdah al-Sahw Sajdah al-Sahw is performed when a mistake is made during Salah. A mistake might include adding an extra movement, leaving out an essential or obligatory part of the prayer, or feeling uncertain that you have prayed the required number of rak’ah. To perform it, correct your mistake and then prostrate before saying the salam. [7] X Research source When you do an extra movement (such as a bow (ruku)) on purpose, your prayer becomes invalid and you must repeat it. If it’s an accident, do the prostration of forgetfulness. If you leave out a part of the prayer, perform it and continue from there. If you don’t remember that you left it out until the next rak’ah, make up the invalid rak’ah. Then prostrate. If you’re not sure whether you left out a rak’ah or not, decide which option is more likely, complete the prayer, and go into the prostration of forgetfulness."
    },
    {
      "title": "Sajdah al-Tilawah",
      "content": "Sajdah al-Tilawah This prostration is performed when you recite or hear someone recite one of the 14 ayatt al-tilawah (verses of prostration) in the Qur’an. To perform a Sajdah of Tilawah, turn toward the Qibla, say the Takbeer ( “Allahu Akbar” ) and prostrate while reciting “Subhana Rabbiyal A’la” (Glory to Allah my Lord, the most high) three times. [8] X Research source When this “۩” symbol appears in the Quran, it signals that this verse is one of the ayatt al-tilawah. After performing Sajdah al-Tilawah during Salah, stand back up while saying “Allahu Akbar” and continue with the rest of the prayer."
    },
    {
      "title": "Obligatory Sajdah",
      "content": "Obligatory Sajdah This is the only type of Sujood that is mandatory for Muslims to perform. Perform this prostration during each rak’ah in each prayer. In each of the 5 daily prayers, Sujood is performed two to three times in each rak’ah. [9] X Research source"
    },
    {
      "title": "Prostration is an essential part of submission to Allah in the Qur’an.",
      "content": "Prostration is an essential part of submission to Allah in the Qur’an. In the Qur’an, Allah asked all the angels to prostrate before Adam, His creation made of mud. Iblis (Shaytan, the leader of devils) became prideful and disobeyed Allah’s command to prostrate. As a result, Iblis was cast out of heaven. [10] X Research source The Qur’an also says: “Do not prostrate to the sun or the moon, but prostrate to Allah, Who created them all, if you truly worship Him alone” (Surah 41:37). [11] X Research source “Always remember the Name of your Lord morning and evening, and prostrate before Him during part of the night, and glorify Him long at night.” (Surah 76:25-26) [12] X Research source"
    },
    {
      "title": "Recite the Prophet Muhammed’s supplication.",
      "content": "Recite the Prophet Muhammed’s supplication. When the Messenger of Allah (ﷺ) prostrated, he would say “Allahumma laka sajadtu wa laka aslamtu wa bika amantu sajada wajhi lilladhi khalaqahu wa sawwarahu fa ahsana suratahu wa shaqqa sam’ahu wa basarahu, tabarak Allahu ahsanul-khaliqin.” [13] X Research source This translates to “O Allah, to You I have prostrated and to You I have submitted, and in You I have believed. My face has prostrated to the One Who created it and shaped it and shaped it well, and brought forth its hearing and sight. Blessed be Allah the best of Creators.” Recite this dua or any of the ones below after you have said “Subhana Rabbiyal A’la” (Glory to Allah my Lord, the most high) three times."
    },
    {
      "title": "Ask Allah for forgiveness and mercy.",
      "content": "Ask Allah for forgiveness and mercy. This Quranic dua says, “Laa yukalliful-laahu nafsan illaa wus’ahaa; lahaa maa kasabat wa ‘alaihaa maktasabat; Rabbanaa laa tu’aakhiznaaa in naseenaaa aw akhtaanaa; Rabbanaa wa laa tahmil-‘alainaaa isran kamaa hamaltahoo ‘alal-lazeena min qablinaa; Rabbanaa wa laa tuhammilnaa maa laa taaqata lanaa bih; wa’fu ‘annaa waghfir lanaa warhamnaa; Anta mawlaanaa fansurnaa ‘alal qawmil kaafireen” (Surah 2:286). [14] X Research source This translates to “Our Lord! Do not punish us if we forget or make a mistake. Our Lord! Do not place a burden on us like the one you placed on those before us. Our Lord! Do not burden us with what we cannot bear. Pardon us, forgive us, and have mercy on us. You are our only Guardian. So grant us victory over the disbelieving people.” [15] X Research source"
    },
    {
      "title": "Ask Allah for a righteous life partner and obedient children.",
      "content": "Ask Allah for a righteous life partner and obedient children. This dua from the Quran says “Rabbana hablana min azwaajina wa dhuriyyatina qurrata A’yunin waj’alna lil- muttaqina imama” (Surah 25:74). This translates to “Our Lord! Grant unto us wives and offspring who will be the comfort of our eyes, and give us (the grace) to lead the righteous.” [16] X Research source This dua asks Allah for a united family unit. It can also be recited when you’re trying to get pregnant or when you are pregnant and want to ask Allah for a safe delivery. [17] X Research source"
    },
    {
      "title": "Prostration improves your relationship with Allah.",
      "content": "Prostration improves your relationship with Allah. Prostration is a symbol of obedience and praise towards Allah that can result in rewards from Him. [18] X Research source When you’re in sujud, you bring yourself close to Allah and allow your soul to be healed by Him. [19] X Research source This also makes sujood a great time to make dua and ask Allah for what you want. [20] X Research source"
    },
    {
      "title": "Practicing sujood frees you of your burdens.",
      "content": "Practicing sujood frees you of your burdens. When you prostrate before Allah, you connect your forehead to the Earth and ground yourself with your surroundings. [21] X Research source Not only can grounding yourself connect you to Allah, but it can relieve anxiety, depression, and pain. [22] X Research source The effects that Salah can have on your body is part of the reason why it’s considered a form of meditation. [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Sujood can improve your brain activity.",
      "content": "Sujood can improve your brain activity. One study on the effects of prostration found that just 10 seconds of Sajdah in the direction of the Qibla while putting one’s forehead on the mohr (or turbah, a clay tablet used by Shia Muslims) influenced the brain activity in the prefrontal cortexes of Muslims. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Sajdah tended to increase the participants’ cognitive and attention processing and the control of their cognition. In the study, Sajdah sometimes had the opposite effect on women that it did on men."
    }
  ]
}