{
  "url": "https://www.wikihow.com/Upload-Files-to-iOS-from-PC-via-SHAREit",
  "title": "How to Upload Files to iOS from PC via SHAREit",
  "steps": [
    {
      "title": "Open SHAREit on your computer.",
      "content": "Open SHAREit on your computer. Do so by double-clicking the SHAREit icon, which is a trio of white dots on a blue background. You can download SHAREit to your PC by visiting the SHAREit website , clicking PC , double-clicking the setup file, and following the on-screen instructions."
    },
    {
      "title": "Click Show QR Code.",
      "content": "Click Show QR Code . This option is near the bottom of the SHAREit window when you first open SHAREit. Clicking it will cause a QR code specific to your computer to display in the SHAREit window."
    },
    {
      "title": "Open SHAREit on your iPhone.",
      "content": "Open SHAREit on your iPhone. It's a blue app with three white dots. You'll first need to download SHAREit from the App Store if you haven't done so already."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . It's in the top-left corner of the screen."
    },
    {
      "title": "Tap Connect PC/MAC.",
      "content": "Tap Connect PC/MAC . This is the top option in the left-most column of options."
    },
    {
      "title": "Tap Scan to Connect.",
      "content": "Tap Scan to Connect . It's near the bottom of the screen."
    },
    {
      "title": "Point your iPhone's camera at the computer screen.",
      "content": "Point your iPhone's camera at the computer screen. Try to frame the QR code on your PC's screen in the box on your iPhone's screen. After a second, the QR code will scan, which will connect your iPhone and PC. You may first need to tap OK to allow SHAREit to access your camera. If you can't get your QR code to scan, alternate between moving the iPhone further away from the screen and moving it closer to the screen."
    },
    {
      "title": "Locate a file you wish to transfer.",
      "content": "Locate a file you wish to transfer. SHAREit imposes no file size limits, meaning the maximum size of the file is contingent on your internet connection and your iOS device's remaining storage."
    },
    {
      "title": "Click and drag the file onto the SHAREit window.",
      "content": "Click and drag the file onto the SHAREit window. Doing so will invoke a prompt on your iPhone."
    },
    {
      "title": "Tap OK on your iPhone.",
      "content": "Tap OK on your iPhone. This will import the file into your iPhone's SHAREit app. Tapping OK will also set importing as the default action, meaning you won't have to tap OK again for each file you transfer."
    },
    {
      "title": "Tap the file.",
      "content": "Tap the file. Doing so will open it."
    },
    {
      "title": "Tap the \"Share\" button.",
      "content": "Tap the \"Share\" button. It's the upward-facing arrow in the bottom-left corner of the screen."
    },
    {
      "title": "Tap a share option.",
      "content": "Tap a share option. \"Sharing\" your file with your iPhone's Notes app or Depending on the type of file you're transferring, this process will vary: For example, you would tap Add to Notes for text files. Photo and video files will automatically download to your iPhone's camera roll, although you'll need to tap OK the first time you transfer a photo or video file to allow this process. Music files will be saved for playback using SHAREit's built-in music player."
    }
  ]
}