{
  "url": "https://www.wikihow.com/Written-Up-at-Work",
  "title": "A Complete Guide to Getting Written Up at Work (and What to Do About It)",
  "steps": [
    {
      "title": "Getting written up means that you've violated a company policy.",
      "content": "Getting written up means that you've violated a company policy. Most employers have an employee handbook or manual that lists company policies and the consequences for violating them. A write-up is a formal document that creates a record of the violation along with goals to meet and steps to take to get you back on the right path. [1] X Research source In some places, a write-up along with the opportunity to appeal the disciplinary action are both required by law. Check your local labor laws for more information or talk to a local attorney who specializes in employment law if you have questions."
    },
    {
      "title": "Employers typically use write-ups for repeat offenses.",
      "content": "Employers typically use write-ups for repeat offenses. While your employee handbook lists employer rules and policies, most employers aren't going to write you up the first time you violate a policy. Rather, they use write-ups when you've shown a pattern of continually violating the policy. Some of the most common reasons employees get written up include: [2] X Research source Repeated tardiness or unexcused absences Consistent complaints from customers or other employees Disregard for safety or sanitation protocols Substandard work performance or production Insubordination Creation of a hostile work environment Misuse of company resources Working under the influence of drugs or alcohol"
    },
    {
      "title": "Take a moment to calm your nerves.",
      "content": "Take a moment to calm your nerves. Finding out that you've been written up (or are about to be written up) is a pretty stressful experience, even if it's happened to you before. Do some breathing exercises to help ease tension and get your emotions under control so you can think clearly and rationally. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source In some places, you're allowed to bring someone with you when you talk about the write-up, such as a coworker or trade union representative. If that's the case for you, talk to that person before you meet with your employer to talk about the write-up. [4] X Research source You might also request to have someone accompany you, either for emotional support or just as a witness. Ask your employer if they'd be willing to accommodate that and see what they say."
    },
    {
      "title": "Read through the write-up carefully.",
      "content": "Read through the write-up carefully. Part of the point of a write-up is to create a record of the incident, so you want to make sure it's accurate. Depending on the issue, it might be embarrassing or painful to read, but it's important for you to understand how the situation looks from your employer's perspective so you can consider what you want to do next. [5] X Research source While you're understandably worried about your job, remind yourself that the point of this process isn't to punish you, but to help you learn to be a better employee. But should you start looking for another job? Maybe. It depends on what your employer normally does after writing someone up. You might also consider the changes your employer wants you to make and decide if those are things you really want to do or if you'd rather just go work somewhere else."
    },
    {
      "title": "Ask questions if you need clarification.",
      "content": "Ask questions if you need clarification. You want to understand exactly what you did wrong and how you can change your behavior so that the problem doesn't happen again. If there's anything about your employer's policies or their expectations that you don't understand, now is the time to speak up. [6] X Research source For example, if you were written up for being late, you might ask your employer if you're expected to be at your desk working or if it's okay if you're somewhere else in the office in the morning."
    },
    {
      "title": "Stand up for yourself if you believe the write-up is unfair.",
      "content": "Stand up for yourself if you believe the write-up is unfair. Maybe you feel like your employer is singling you out for doing something that everyone else does with no consequence. Or maybe the write-up accuses you of doing things that you just didn't do. Regardless, if you disagree with the write-up or think your employer is disciplining you unfairly, you have the right to be heard on the issue. [7] X Research source Put your statement in writing, along with copies of any evidence, so it can go in your file along with the write-up. You want your response to be part of the record as well. If you have coworkers who saw the incident and will back you up, get them to write statements on your behalf as well. If you think your employer is discriminating against you or retaliating against you for something you said or did, go ahead and chat with an employment law attorney who specializes in those issues. They typically offer free initial consultations."
    },
    {
      "title": "Acknowledge your role in the incident and apologize.",
      "content": "Acknowledge your role in the incident and apologize. If you made a mistake or violated a policy, take ownership of your actions. This tells your employer not only that you understand the issue but also the impact that your actions had on your employer or your coworkers. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Even if you don't agree with all of the details in the write-up or think you were unfairly written up, there still might be part of it that you can acknowledge. For example, if you were written up for leaving a dangerous piece of equipment running unattended, you might acknowledge that you left while mentioning that one of your coworkers was also close by at the time and able to watch it."
    },
    {
      "title": "Get feedback from management and coworkers.",
      "content": "Get feedback from management and coworkers. These can be tough conversations, but this feedback is crucial. If you've recognized something from the write-up that you need to improve, your managers and coworkers can help you understand what you need to focus on to make that improvement happen. [9] X Research source For example, your coworkers might give you suggestions on how to up-sell customers after you get written up for a low average transaction rate."
    },
    {
      "title": "Work openly and actively to remedy the problem.",
      "content": "Work openly and actively to remedy the problem. You can say that you're going to change, but your employer and your coworkers likely won't fully believe you until they see that change in action. It might take time to get to where you want to be, but it should still be obvious that you're moving in the right direction. [10] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If you're making clear progress towards the goals listed in the write-up, your job is probably safe, at least in the short term. Keep in mind that it costs a company a lot of money to terminate an employee and hire someone else to take their place. Typically, the company would much rather work with you to improve your performance than have to let you go."
    },
    {
      "title": "What information is included in a standard write-up?",
      "content": "What information is included in a standard write-up? Most write-ups use a form that includes basic information about you and your employer as well as a description of the incident or pattern of conduct that led to the write-up. Most write-up forms also include space for signatures and might have lines indicating what it means that you've signed the form. [11] X Research source There will likely be a reference to the specific employer rule or policy that you violated, such as a page or section number in the employee handbook. Depending on the type of violation, there might also be copies of documents attached as evidence."
    },
    {
      "title": "Can you refuse to sign a write-up?",
      "content": "Can you refuse to sign a write-up? You can, but it might not have the effect you think. If you just want to record your disagreement with what's included in the write-up, attach your own statement and write \"I disagree\" above your name before you sign. Also make sure you cross out any preprinted statements on the form that might indicate that you agree to everything in the write-up. [12] X Research source If you refuse to sign the write-up, the outcome depends on the employment laws where you live. It might not affect anything at all or your employer might decide to fire you if you're unwilling to cooperate with the plan they've laid out. Be sure to read the statement on the form that explains what a signature means. On some of these forms, your signature merely indicates that you've read the form and understand it—not that you agree with it. If that's the case, there's no reason not to sign it."
    },
    {
      "title": "Can you get fired without any write-ups?",
      "content": "Can you get fired without any write-ups? It depends on where you live. If you live in a place that has at-will employment laws, your employer doesn't need a reason to fire you and write-ups don't really matter in that sense—although most employers follow the write-up process anyway. [13] X Research source In other areas, employers are required by law to go through this process before they can legally terminate someone, unless that employee committed an extreme violation, such as getting into a fist fight in the workplace. [14] X Research source"
    },
    {
      "title": "What if you disagree with the write-up?",
      "content": "What if you disagree with the write-up? You typically have the opportunity to state your case and present any evidence that supports your position to your employer. It's usually best if you get all of this in writing so that you're creating a record of your response that your employer can keep in your file with the write-up. [15] X Research source For example, if you were written up for being a \"no call, no show,\" you might lean on a text conversation between you and the shift manager that proves you did call out before your shift started. You might also note if you think that you're being unfairly targeted for something. For example, if you get written up for being five minutes late when everyone you work with is routinely 10 to 15 minutes late without getting written up. In some countries, such as the U.S., employees can't write you up as retaliation against you after you stand up for your rights. At the same time, you might have to sue your employer to get any relief. [16] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source If you live in an area with at-will employment laws, you might want to talk to an employment law attorney. Expressing disagreement with a write-up could result in your termination."
    },
    {
      "title": "How do you write up an employee?",
      "content": "How do you write up an employee? Download a free form online or create your own with space for information about the employee, the violation they committed, and what their goals are for the future to avoid getting into further trouble. You might also include a section with any specific recommendations for improvement. Finally, you'll have a space for both you and the employee to sign the form. [17] X Research source Typically, you'll fill out the form ahead of time and schedule a sit-down meeting with the employee. Once the two of you are together, explain the situation and give the employee the write-up so they can review it. Give the employee time to read the write-up and answer any questions they may have. Keep in mind that any employee you write up is likely going to be upset. Handle the situation with discretion and empathy so a written-up employee doesn't feel embarrassed or attacked."
    },
    {
      "title": "Are you required to write up an employee before terminating them?",
      "content": "Are you required to write up an employee before terminating them? In some areas, write-ups are either required by law or by a collective bargaining agreement between the employer and a union. If neither of those things applies to your business, then you generally aren't required to do formal write-ups. But even if it's not required, it can protect your interests as an employer to go ahead and do it. [18] X Research source Having a formal, written record can protect you if you later end up having to terminate the written-up employee and they try to sue for wrongful termination. The write-up indicates that there were, in fact, problems with that employee's performance and you had a legitimate reason to terminate their employment. It also creates a record so that you can easily keep track of employee violations for progressive discipline purposes so that you don't have to constantly remember how many violations each employee has accrued."
    }
  ]
}