{
  "url": "https://www.wikihow.com/Treat-Tennis-Elbow",
  "title": "How to Treat Tennis Elbow",
  "steps": [
    {
      "title": "Stop doing the activity that caused the injury.",
      "content": "Stop doing the activity that caused the injury. Immediately stop doing any activity that involves your elbow if you’ve just been injured. If you’re not sure how you hurt your elbow, avoid all activities that cause you pain or discomfort in your elbow. Try to use the affected elbow as little as possible and avoid any movement that irritates it. Examples of activities to avoid include: [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Sports where you throw, catch, or hit a ball with a racket Repetitive motions, such as hammering Lifting heavy objects Supporting your bodyweight with your arms, such as doing push-ups"
    },
    {
      "title": "Apply ice to the affected elbow for 15 minutes 3 to 4 times daily.",
      "content": "Apply ice to the affected elbow for 15 minutes 3 to 4 times daily. Wrap an ice pack with a clean dish towel or paper towel and press it against your affected elbow. Hold the ice pack in place for about 10 to 15 minutes and then remove it. Allow your skin temperature to return to normal before using another ice pack. [3] X Research source Don’t apply ice to your bare skin. Doing this can cause frostbite and skin damage."
    },
    {
      "title": "Take an over-the-counter pain reliever.",
      "content": "Take an over-the-counter pain reliever. If your elbow is causing you pain, you can take an over-the-counter pain reliever, such as ibuprofen, naproxen, or acetaminophen. Follow the manufacturer’s recommendations for how much to take and how often to take it. Do not exceed the recommended dose. [4] X Research source If an over-the-counter pain reliever does not help, call your doctor. You may have a more severe injury, such as a ligament tear."
    },
    {
      "title": "Wear an elbow brace",
      "content": "Wear an elbow brace or splint to limit your movement. It can be difficult to remember not to move your elbow in a certain way, so wearing a counter-force brace that restricts your movement can be helpful in some cases. A brace may help to reduce muscle and tendon strain at the origin of the injury. Your doctor may recommend this if the injury is causing you severe pain or if you cannot avoid using your elbow and need to restrict its movement, such as on the job or while doing household chores. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source A brace is most helpful in the first 6 weeks after an injury. Make sure to position the brace 6–10 in (15–25 cm) from your elbow joint so it is closer to your hand than your elbow."
    },
    {
      "title": "Get a diagnosis from your doctor to confirm that you have tennis elbow.",
      "content": "Get a diagnosis from your doctor to confirm that you have tennis elbow. It's best to visit your doctor for a proper diagnosis. If you have a break or tear, it may not heal correctly without proper treatment. Tennis elbow’s main symptom is pain in the outer part of the elbow joint that radiates down the back of your arm. The pain may extend into your wrist in severe cases. Your elbow may also look red. If your pain is severe, see a doctor right away to determine if you have a break or tear. Pain caused by tennis elbow may be worse when you do certain activities, such as: [6] X Research source Gripping an object Turning something Holding an item Shaking hands"
    },
    {
      "title": "Go for physiotherapy to restore movement to the injured area.",
      "content": "Go for physiotherapy to restore movement to the injured area. Your doctor may recommend that you see a physical therapist to learn exercises and stretches. These may help your elbow heal faster and allow you to resume your normal activities sooner. If your doctor recommends it, you’ll need to see a physiotherapist once or more per week and do the exercises and stretches that they teach you at home. [7] X Research source Continuing to do the exercises that your physiotherapist teaches you after your injury heals may also help to protect you from repeat injuries. Physiotherapy provides the most benefit over the long-term compared with other treatments, such as steroid injections. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Ask your doctor about steroid injections to reduce inflammation.",
      "content": "Ask your doctor about steroid injections to reduce inflammation. Steroid injections can help to reduce inflammation in your elbow joint, which may help you to resume your normal activities faster. Injections are not usually necessary since tennis elbow heals on its own within a couple of weeks. However, you may ask your doctor about injections if you’re not seeing an improvement in your condition from physical therapy and home care strategies. [9] X Research source The injection is delivered directly into the affected joint, which can be quite painful. However, your doctor can anesthetize the area before delivering the injection. Keep in mind that the effects of a steroid injection will last for 3 to 6 months and then they wear off, so repeat injections may be necessary for ongoing issues. Be aware that these injections will not prevent a future injury and usually only provide short-term improvement. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Look into shockwave therapy to reduce pain and promote movement.",
      "content": "Look into shockwave therapy to reduce pain and promote movement. Shockwave therapy is helpful for some people and it’s a non-invasive option. The shockwaves are delivered to the affected area and pass through the skin to penetrate the joint. This can be painful, so you may receive a local anesthetic before your treatment begins. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Although it’s generally considered a safe treatment option, you may experience some bruising and redness following shockwave therapy."
    },
    {
      "title": "Ask about platelet-rich plasma injections to speed up healing.",
      "content": "Ask about platelet-rich plasma injections to speed up healing. For this treatment, a doctor will remove a blood sample from your body, place it into a machine to separate the healing platelets, and then inject them directly into the affected joint. The whole treatment only takes about 15 minutes and it may help to speed healing. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This might be a good option if you’ve had repeat injuries or if your injury isn’t healing well on its own. However, keep in mind that the results of this therapy are uncertain, so it might not be helpful. Make sure to see an orthopedic specialist who has done many of these procedures. Check with your insurance first to see if this treatment will be covered. Many insurances do not cover it."
    },
    {
      "title": "Discuss surgery as a last resort if other treatments have failed.",
      "content": "Discuss surgery as a last resort if other treatments have failed. Surgery is rarely necessary for tennis elbow, but you may discuss it with your doctor if all other treatment methods have failed. They can refer you to a surgeon who can advise you on your options. This is usually only necessary if you have a severe injury that isn’t healing on its own. [13] X Research source For example, if you have a tear, then you may require surgery to repair it if it’s not healing on its own."
    },
    {
      "title": "Get clearance from your doctor before beginning an exercise routine.",
      "content": "Get clearance from your doctor before beginning an exercise routine. Before you start an exercise program, make sure to check with your doctor and ask if it’s safe for you to stretch and strengthen your elbow and the connecting muscles and tendons. Otherwise, you may delay your healing or injure yourself further. [14] X Research source"
    },
    {
      "title": "Perform a wrist extensor stretch to stretch the back of your forearm.",
      "content": "Perform a wrist extensor stretch to stretch the back of your forearm. To do this, straighten out your affected arm so that it is perpendicular to your torso and hold your hand and fingers out straight as well. Turn your arm so that your palm is facing the ground. Use your opposite hand to grasp your fingertips and gently pull them down towards the ground until you feel a slight stretch in your forearm. Hold this for 15 seconds. [15] X Research source Repeat the stretch 2 to 4 times daily."
    },
    {
      "title": "Do a wrist flexor stretch to stretch the underside of your forearm.",
      "content": "Do a wrist flexor stretch to stretch the underside of your forearm. To do this, straighten out your affected arm perpendicular to your torso with your hand and fingers out straight as well. Turn your arm so that your palm is facing up. Use your opposite hand to grasp your fingertips and gently pull them down towards the ground until you feel a slight stretch on the underside of your forearm. Hold this for 15 seconds. [16] X Research source Repeat this stretch 2 to 4 times daily."
    },
    {
      "title": "Squeeze a tennis ball or sock to strengthen your forearm muscles.",
      "content": "Squeeze a tennis ball or sock to strengthen your forearm muscles. Grasp the tennis ball or sock in the hand of your affected arm. Squeeze the ball and hold the squeeze for 6 seconds. Then, release the squeeze and relax your hand for 10 seconds. [17] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Do 8 to 12 repetitions 2 to 4 times daily."
    },
    {
      "title": "Move your hand up and down with your arm flat against a table to strengthen your wrist.",
      "content": "Move your hand up and down with your arm flat against a table to strengthen your wrist. [18] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020. Sit down and lay your affected arm flat on a table or desk. Position your wrist and hand so they’re hanging over the edge of the surface. Then, turn your forearm on its side, so that you’re positioned to shake someone’s hand. With your fingers out straight, move your hand up and down. [19] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Repeat the up and down motion 8 to 12 times 2 to 4 times daily. Don’t lift your forearm off of the table while you do this."
    },
    {
      "title": "Do bicep curls",
      "content": "Do bicep curls to build muscle in your arm and around your elbow. While seated or standing, hold a dumbbell in your hand with your arm down at your side. Position your hand so that your palm is facing forward. Then, slowly raise the dumbbell up towards your chest. Hold for 3 seconds, then slowly lower it back down to the start position. [20] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Repeat this 8 to 12 times and do 2 to 4 sets twice per week. Make sure to get your doctor or physical therapist’s clearance before you do bicep curls."
    },
    {
      "title": "Change up your movements to avoid injury from repetition.",
      "content": "Change up your movements to avoid injury from repetition. Repetitive movements can irritate an old tennis elbow injury and lead to new injuries as well. [21] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020. If you work in a profession or participate in a sport where you need to move your arm in a certain way many times in a row, try to give yourself breaks and look for ways to change up your movement. [22] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source For example, if you play tennis, vary your practices by hitting the ball from different positions and take breaks throughout your workout."
    },
    {
      "title": "Get your form evaluated by a professional if the injury is from a sport.",
      "content": "Get your form evaluated by a professional if the injury is from a sport. Poor form can lead to repeat injury, so you may want to have your form evaluated by a personal trainer or coach if that’s how you got your original injury. Ask them to watch you and give you feedback and use their feedback to correct your form. [23] X Research source For example, if you’re a tennis player, having a tennis coach watch you and evaluate your form may help you to avoid a repeat injury."
    },
    {
      "title": "Warm up before you participate in activities that might strain your elbow.",
      "content": "Warm up before you participate in activities that might strain your elbow. Always take at least 5 minutes to warm up your muscles before you engage in physical activity. Perform a light version of the exercise or movement you’ll be doing, such as walking while moving your arms at your sides or doing some gentle practice swings with a tennis racket. [24] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Even gently swinging your arms back and forth for a few minutes can help to warm up your muscles and prepare your joints for activity. [25] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020."
    },
    {
      "title": "Use equipment that works well for you.",
      "content": "Use equipment that works well for you. If the equipment you’re using is too heavy or otherwise ill-suited to you, this may lead to re-injury. Try using a different item to see if it’s more comfortable for you, or ask a coach or trainer for a recommendation. [26] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source For example, if you’re using a baseball bat that’s too heavy, this could irritate your elbow and lead to re-injury."
    }
  ]
}