{
  "url": "https://www.wikihow.com/Use-a-Pull-Buoy",
  "title": "How to Position and Use a Pull Buoy While Swimming",
  "steps": [
    {
      "title": "Pick a foam pull buoy that fits comfortably between your legs.",
      "content": "Pick a foam pull buoy that fits comfortably between your legs. Foam buoys come in 2 different designs: a solid foam figure 8 shape or 2 foam pieces connected by ropes. Either design will work, but try putting the buoy between your upper thighs to see if it fits well. Test out different sizes to see what is the most comfortable for you. [1] X Research source You can buy pull buoys online or from sporting goods stores. Some pools will have pull buoys that you can use or rent while you’re training. If the pull buoy has ropes, you can adjust their length until they’re comfortable."
    },
    {
      "title": "Slide the pull buoy between your thighs.",
      "content": "Slide the pull buoy between your thighs. When you’re at the pool, sit at the edge of the water so you can easily position the pull buoy. Spread your legs far enough apart so you can place the buoy in between your thighs as high as you can. Squeeze your legs together so you have a firm grip on the buoy. [2] X Research source If one side of your pull buoy is larger than the other, have the larger end facing the front. If your buoy has ropes connecting the foam pieces, hold the ropes in between your thighs so the foam is in front of and behind you."
    },
    {
      "title": "Band your ankles together if you want to prevent kicking your feet.",
      "content": "Band your ankles together if you want to prevent kicking your feet. Even though pull buoys make it so you don’t have to use your legs while swimming, you still may feel the urge to kick. Kicking while using a pull buoy can lead to poor form when you swim without one. If you think that you’ll start kicking while using the buoy, secure a swimming band around your ankles. This prevents you from kicking your legs individually and helps you build more arm strength. [3] X Research source You can buy ankle bands online or from a sporting goods store. If you don’t have an ankle band, you can also use a small inner tube."
    },
    {
      "title": "Ease yourself into the water.",
      "content": "Ease yourself into the water. Don’t jump into the water since the pull buoy might slip out or you could lose balance. Slide into the pool from the edge, keeping your legs underneath you until you’re ready to swim. Hang onto the wall if you can’t touch the bottom of the pool. The pull buoy will try to float once you’re in the water so make sure to keep it underneath you until you’re reading to start swimming."
    },
    {
      "title": "Pull your body through the water using your arms.",
      "content": "Pull your body through the water using your arms. When you’re ready to start swimming, push off from the wall with your feet. Start with the front crawl , or freestyle, using only your arms to propel yourself through the water. Rock your hips from side to side with each pull forward to perfect your form, but don’t use your legs at all. Swim 100 m (330 ft) with the pull buoy. [4] X Research source Use hand paddles to give your upper body more of a workout."
    },
    {
      "title": "Practice bilateral breathing to improve your swimming pace.",
      "content": "Practice bilateral breathing to improve your swimming pace. While doing the front crawl, many swimmers only turn their head to one side to breathe. Bilateral breathing, or turning your head to the left and right during your stroke, can allow you to swim faster. When you lift your arm out of the water during your stroke, turn your head to the same side and take a breath. Practice breathing on the left and right side of your body throughout your exercise. [5] X Research source It’s easier to practice bilateral breathing while using a pull buoy because your legs aren’t using up as much oxygen when you aren’t kicking. [6] X Research source"
    },
    {
      "title": "Try different swimming strokes to practice various arm movements.",
      "content": "Try different swimming strokes to practice various arm movements. Pull buoys can help you perfect your arm movement while you do the backstroke , breaststroke , or sidestroke . Keep the pull buoy in between your legs for each stroke you practice so you can work on your core and upper body. Try swimming at least 100 m (330 ft) in each stroke. [7] X Research source Don’t kick during any of the strokes since it could give you poor form."
    },
    {
      "title": "Alternate between swimming with and without the pull buoy.",
      "content": "Alternate between swimming with and without the pull buoy. Swimming with the pull buoy at all times can limit your hip rotation and make you reliant on using it. After you go about 100 m (330 ft) with the pull buoy, take it out from between your legs and incorporate kicking back into your stroke. Continue alternating between exercises with and without the pull buoy to stay balanced. [8] X Research source Scale your workout over time so you’re swimming or pulling a further distance each time. For example, start by swimming 100 m (330 ft) with and without the pull buoy, and then increase the distance to 200 m (660 ft) for exercise."
    }
  ]
}