{
  "url": "https://www.wikihow.com/Zoom-in-on-a-PC",
  "title": "5 Easy Ways to Zoom In on a PC to Change Text or Image Size",
  "steps": [
    {
      "title": "Open the application or page you want to zoom in on.",
      "content": "Open the application or page you want to zoom in on. You can use keyboard shortcuts and gestures to zoom in and out on most apps. This is helpful when you want to zoom in on something like a website or a photo, or make text bigger ."
    },
    {
      "title": "Press Ctrl++ to zoom in.",
      "content": "Press Ctrl + + to zoom in. You can press this keyboard combination as many times as you need to zoom in for a closer look. The zoom feature may not be available in all apps."
    },
    {
      "title": "Press Ctrl+- to zoom out.",
      "content": "Press Ctrl + - to zoom out . As with zooming in, you can keep pressing the button to zoom out as far as you'd like to go."
    },
    {
      "title": "Press Ctrl + \"0\" to return the screen to default magnification.",
      "content": "Press Ctrl + \"0\" to return the screen to default magnification."
    },
    {
      "title": "Open the application or page you want to zoom in on.",
      "content": "Open the application or page you want to zoom in on. You can use keyboard and mouse to zoom in and out on most apps."
    },
    {
      "title": "Hold Ctrl and scroll up to zoom in.",
      "content": "Hold Ctrl and scroll up to zoom in. Use the mouse wheel to do so. If you have a touchpad , you can place two fingers on the touchpad and spread them apart to zoom in."
    },
    {
      "title": "Hold Ctrl and scroll down to zoom out.",
      "content": "Hold Ctrl and scroll down to zoom out. Use the mouse wheel to do so. If you have a touchpad, you can pinch two fingers to zoom out."
    },
    {
      "title": "Press Ctrl +\"0\" to return the screen to default magnification.",
      "content": "Press Ctrl + \"0\" to return the screen to default magnification. The screen will be reset."
    },
    {
      "title": "Press ⊞ Win++ on the keyboard.",
      "content": "Press ⊞ Win + + on the keyboard. This will activate the Magnifier feature on Windows. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The tool will immediately magnify the entire screen until you change the settings. If you're using Windows 7, click the Start button, type magnifier into the search bar, and then click Magnifier in the search results. Users who'd prefer to use a mouse can also open Magnifier by navigating to Settings > Ease of Access > Magnifier > Turn on Magnifier (or use the slider)."
    },
    {
      "title": "Click the + to zoom in.",
      "content": "Click the + to zoom in. This magnifies the entire screen. You can keep clicking this button until you reach the desired zoom level. The percentage (e.g., 200%) will update as you zoom in and out. If you'd rather zoom in with the keyboard, press Windows key and the + key (the same shortcut you used to open the tool)."
    },
    {
      "title": "Click the - to zoom out.",
      "content": "Click the - to zoom out. As with zooming in, you can keep clicking this button until you're zoomed out to the desired level. You can also zoom out by pressing the Windows key and the - (minus) key."
    },
    {
      "title": "Click the gear icon to manage your Magnifier preferences.",
      "content": "Click the gear icon to manage your Magnifier preferences. This opens the Magnifier panel in settings, where you can customize Magnifier to your liking. If you'd like Magnifier to launch automatically when you start your computer, select either Start Magnifier after sign-in or Start Magnifier before sign-in for everyone . To change the default view, select an option from the \"Choose a view\" menu. Lens acts like a magnifying glass that you move around the screen. Full-screen magnifies the entire screen (the default). Docked magnifies a fixed portion of the screen in a bar or box. The zoomed content will appear in the box as you move the cursor around. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click the X at the top-right corner to close Magnifier.",
      "content": "Click the X at the top-right corner to close Magnifier."
    },
    {
      "title": "Open a web browser.",
      "content": "Open a web browser. All web browsers, including Chrome , Firefox, and Edge, have their own built-in zoom options that can be accessed from different menus."
    },
    {
      "title": "Open the web browser's menu.",
      "content": "Open the web browser's menu. The location of nearly all browser menus is at the upper-right corner of the application. Microsoft Edge : ••• Google Chrome : ⋮ Mozilla Firefox : ☰"
    },
    {
      "title": "Click the + to zoom in.",
      "content": "Click the + to zoom in. You'll see a \"Zoom\" option on the menu of nearly all web browsers. Clicking the + to the left of the word \"Zoom\" in the menu makes the items on each page bigger. The magnification level (e.g., 125%) will update as you continue to click the button. Clicking on the icon at the extreme right will activate the full screen mode (hit F11 to exit full screen mode)."
    },
    {
      "title": "Click the - to zoom out.",
      "content": "Click the - to zoom out. It's to the right of \"Zoom.\" This makes the items on each page smaller."
    },
    {
      "title": "Press Ctrl + \"0\" to return the screen to default magnification.",
      "content": "Press Ctrl + \"0\" to return the screen to default magnification."
    },
    {
      "title": "Place two fingers on your touchscreen.",
      "content": "Place two fingers on your touchscreen. Make sure to pick a spot next to the area you want to zoom in on."
    },
    {
      "title": "Spread your fingers apart to zoom in.",
      "content": "Spread your fingers apart to zoom in. The screen will zoom in. The zoom feature may not be available in all apps."
    },
    {
      "title": "Pinch your fingers in to zoom out.",
      "content": "Pinch your fingers in to zoom out. The screen will zoom out."
    }
  ]
}