{
  "url": "https://www.wikihow.com/Use-Hair-Rollers",
  "title": "How to Use Hair Rollers: Velcro, Hot, and Foam Rollers",
  "steps": [
    {
      "title": "Use Velcro rollers to add volume with softer curls.",
      "content": "Use Velcro rollers to add volume with softer curls. Velcro rollers are ideal if for soft, voluminous curls but don’t want that tight-curled Shirley Temple look. These rollers are easy to use and don’t require any heat or wet hair. [1] X Research source There are two types of Velcro rollers: mesh and aluminum. Never heat the mesh rollers. You can use heat with the aluminum rollers if you want, although it’s not mandatory. The advantage of mesh rollers is that they’re just more forgiving. It’s easier to bend and adjust them if you make a mistake."
    },
    {
      "title": "Wash and condition your hair for tighter curls.",
      "content": "Wash and condition your hair for tighter curls. If you want to wet-set your hair (curl it when wet), wash and shampoo your hair the way you normally would. Squeeze the moisture from your hair in the shower, but don't towel dry it. Comb through wet hair to remove any knots. [2] X Research source Velcro rollers should never be used in very wet hair. Air or blow dry your hair until it is slightly damp before using them. Wet-setting will give your curls a little more tightness and staying power. For many people, the whole point of Velcro rollers is that they’re fast and don’t require wet hair though, so it’s okay to skip this step."
    },
    {
      "title": "Divide your hair into sections.",
      "content": "Divide your hair into sections. Part your hair at the left and right temples. Aim for at least three sections: one over each ear and one at the top of your head. Leave the back alone for now. [3] X Expert Source Karen Leight Professional Hair Stylist Expert Interview. 13 November 2020. Use the width of the roller to help guide the size of your sections. If you need to use more sections for smaller rollers, that’s totally okay!"
    },
    {
      "title": "Roll the first section up starting at the end of your hair.",
      "content": "Roll the first section up starting at the end of your hair. Comb the first section forward and then hold it up away from your head. Then, grab the roller and press it against the hair. The Velcro will grip the hair and hold it in place. Roll the roller towards your head and go all the way down to your scalp. [4] X Research source Secure the roller with a pin or clip if it feels like the roller is going to come undone. Whether you roll on top of the end of your hair or underneath the end of your hair is totally a matter of taste. Your hair will curl in whatever direction you choose. Run a bit of hair gel or smoothing cream through your hair before rolling it if you want more staying power!"
    },
    {
      "title": "Continue rolling each of your sections the same way.",
      "content": "Continue rolling each of your sections the same way. For each section of your hair, comb it out away from you, hold it in place, and set a roller at the end. and roll the curls away from your face. [5] X Research source If you want very small tight curls, use small rollers and put them close together. If you want larger curls, use larger rollers and make your sections longer. If you want a touch of staying power but don’t feel like bothering with gels or creams, just spritz your hair with some hairspray when you’re done."
    },
    {
      "title": "Heat your curls or wait an hour to set them.",
      "content": "Heat your curls or wait an hour to set them. If you want to avoid heat on your hair, just leave your rollers in for at least an hour before unraveling your hair. Alternatively, blow dry your hair with the rollers in. [6] X Research source If you blow dry, allow the rollers to stay in about 15 minutes after you've dried your hair to cool and set the curls. The longer you leave the rollers in, the tighter your curls will be when you take the rollers out. To take the rollers out, just remove any pins or clips and then unravel each roller the same way you put it in."
    },
    {
      "title": "Use hot rollers instead of a curler if you have fine hair.",
      "content": "Use hot rollers instead of a curler if you have fine hair. Want that big, dramatic blow out look but don’t want to expose your hair to a lot of heat? Hot rollers are ideal for you! These rollers heat up on a little stand so that they’re warm when you put them in your hair and cool off slowly over time. [7] X Research source This is preferable to a red-hot curling iron because it puts way less stress on your hair. If you have fine hair but you don’t want really expressive, voluminous curls, just use Velcro rollers. The heat isn’t necessary for softer curls."
    },
    {
      "title": "Straighten your hair with a blow dryer first, if necessary.",
      "content": "Straighten your hair with a blow dryer first, if necessary. If you have curly or wavy hair, blow dry your hair straight before rolling. This will help you set smooth, uniform curls. [8] X Research source"
    },
    {
      "title": "Preheat your rollers on the stand they came with.",
      "content": "Preheat your rollers on the stand they came with. Hot rollers must be preheated to get them to the optimal temperature before you begin rolling. Follow the manufacturer's instructions. If you have a hot roller set with variable temperatures, you may need to experiment to find the right setting for your hair. [9] X Research source For tighter, spiral curls use small rollers and a high temperature. For softer, looser curls use larger rollers and a low temperature."
    },
    {
      "title": "Apply a heat-protecting product to your hair.",
      "content": "Apply a heat-protecting product to your hair. If you’re using a higher temperature, apply a heat protectant spray to your hair before adding the rollers. Distribute the product evenly throughout your dry hair before you start adding the rollers. [10] X Research source If you’re using a lower heat setting and your hair isn’t especially prone to breakages or heat damage, it’s okay to skip the heat protectant spray."
    },
    {
      "title": "Divide your hair into sections.",
      "content": "Divide your hair into sections. Create a “mohawk” about 2 to 3 inches (5 to 8 cm) wide that runs from your forehead to the back of your neck. Secure it with a clip. Using a tail comb, part the hair on the sides of your head into a few even sections and secure them with clips. [11] X Expert Source Karen Leight Professional Hair Stylist Expert Interview. 13 November 2020. The smaller the sections the easier it will be for your hair to curl. [12] X Expert Source Karen Leight Professional Hair Stylist Expert Interview. 13 November 2020."
    },
    {
      "title": "Begin rolling the first section from the end of your hair.",
      "content": "Begin rolling the first section from the end of your hair. Comb through a section of hair as wide as the roller you're using. Hold that section up and away from your head. Place the roller at the ends of your hair and roll down toward the scalp, away from your face. Secure the roller with the clips that came with it. [13] X Research source Don’t use normal plastic clips with hot rollers—they may melt a bit from the heat. Continue rolling the mohawk section, working your way from front to back. Section off manageable sections of hair and roll them onto the rollers, then secure with clips."
    },
    {
      "title": "Roll the sides horizontally or vertically.",
      "content": "Roll the sides horizontally or vertically. Comb through the section, pull it up and away from your head, and place the roller diagonally across the ends. Roll tightly to your scalp and secure with clips. Repeat until all your hair is rolled. [14] X Research source To achieve bigger lift, roll hair at the top part of the side sections diagonally. For the highest possible lift, roll the hair up at a 90° angle from each section. Horizontal rolls will create a more textured, bouncy look. Vertical rolls will give you a more dramatic, lengthy vibe. You can create different curl or wave shapes by wrapping your hair around the curler multiple times. For example, making 1 ½ wraps around a curler will create a “c” shaped curl. 2 ½ wraps will produce an “s” shape."
    },
    {
      "title": "Leave rollers in your hair until they’re totally cooled.",
      "content": "Leave rollers in your hair until they’re totally cooled. Allow the rollers to completely cool before removing them from your hair. Removing the rollers too quickly will result in less long-lasting curls. Rollers will take longer to cool in very thick or curly hair, so just be patient. The results will be worth it! [15] X Research source"
    },
    {
      "title": "Remove the rollers.",
      "content": "Remove the rollers. Start at the bottom and work your way to the top of your head. Hold the roller in one hand and remove the clips with the other. Do not pull or tug the roller out of your hair as it will mess up the curl. Just unravel it slowly."
    },
    {
      "title": "Style your hair as desired once you’re done.",
      "content": "Style your hair as desired once you’re done. Brushing through your curls will remove much of the curl and result in loose, flowing waves. To keep the curls neat and tight, run your fingers gently through your hair. Spray with hairspray to ensure long-lasting curls. If you want more volume, bend over and let your head hang down. Shake your head a few times and run your fingers gently through the curls. This will give you bigger, bouncier hair."
    },
    {
      "title": "Opt for foam rollers if you want maximum comfort.",
      "content": "Opt for foam rollers if you want maximum comfort. Foam rollers are good for many types of hair, but they are particularly good for fragile hair as they are unlikely to snag or damage it. They’re also great if you feel like sleeping with the rollers in. That’s right, these comfy rollers can be left in while you snooze! [16] X Research source Foam rollers aren’t the best if you’re in a rush. They take a bit more time to put in, and they need to be left in longer than Velcro and hot rollers."
    },
    {
      "title": "Wash your hair or apply product to your hair.",
      "content": "Wash your hair or apply product to your hair. You have two options with foam rollers. Wash your hair and let it air dry in the rollers or apply styling product (like cream, hairspray, or gel) and then put the rollers in. You can use foam rollers with dry, untreated hair, but the curls won’t have much shape or staying power."
    },
    {
      "title": "Divide your hair into sections.",
      "content": "Divide your hair into sections. Studio owner and stylist Karen Leight says, “Make sure you do small enough sections so the hair gets evenly rolled in the roller. I think that's where people make the biggest mistake—they try to take a big chunk of hair, put it in a roller, and then, they're like why didn't they get curly? Why is it not looking good or smooth? So, my best suggestion with that would be to just take small, small sections.” [17] X Expert Source Karen Leight Professional Hair Stylist Expert Interview. 13 November 2020. Any type of hair clip is suitable for holding your sections in place once you roll them. Comb through each section before rolling the hair. Use your tail comb to comb through your hair to eliminate any tangles and pull the section gently away from your scalp."
    },
    {
      "title": "Begin rolling at the front of your forehead.",
      "content": "Begin rolling at the front of your forehead. Roll the hair in this section away from your face, toward the back of your head. Keep the hair taut as you roll by holding onto the ends with one hand as you roll with the other. After a few complete rolls, tuck the loose ends in and finish rolling the curl. [18] X Research source If you want volume all the way along your curl, start rolling about an inch or so from the ends and roll the curl all the way down to your scalp. Secure with a clip. If you want your hair to be straight near your head, start rolling about three inches from your head, and roll all the way to the ends. Then wind the roller down to your scalp. Secure with a clip."
    },
    {
      "title": "Continue rolling until your other sections are curled.",
      "content": "Continue rolling until your other sections are curled. Divide each side section in half horizontally, using a tail comb to part the hair just above your ears. Roll the two parts of each side section under (rolling away from your face, toward the hairline at your neck) and secure with clips. Roll the back the same way. [19] X Research source You may want to use larger curlers at the bottom and smaller curlers at the top for a varied look."
    },
    {
      "title": "Blow dry if you want to set the curls fast.",
      "content": "Blow dry if you want to set the curls fast. Blow dry until your hair is dry and warm to the touch. This will set the curl as quickly as possible. Leave the rollers in for about 15 minutes, then gently remove them if you’re in a rush. Don't brush your hair after removing the rollers! This will destroy the curls. If you need to, use your fingers to lightly separate your curls. If you want more volume, bend over and let your head hang down. Shake your head a few times and run your fingers gently through the curls. This will give you bigger, bouncier hair."
    },
    {
      "title": "Spray with hairspray and take the rollers out.",
      "content": "Spray with hairspray and take the rollers out. Leave the foam rollers in 6-12 hours. You can even sleep with the rollers in if you’d like! When you’re ready to remove the curls, spritz your hair with hairspray before slowly removing the curls. For long-lasting volume, flip your hair upside down before spraying."
    }
  ]
}