{
  "url": "https://www.wikihow.com/Write-a-Market-Description",
  "title": "How to Write a Market Description",
  "steps": [
    {
      "title": "Plan time for research.",
      "content": "Plan time for research. Before launching your business, schedule some time to compile information about your competitors, potential customers, and the industry or sector you are entering. Use government databases, like those available from the U.S. Small Business Association, for information. Business magazines, academic or trade associations, and local business bureaus can also be helpful. Before writing a market description, be aware of the “iceberg principle.” The majority of the iceberg is underwater. This represents your research time and spent energy. Only the tip is visible. The small tip is your output, e.g., website, advertising, brochures, and business cards. [1] X Research source Your market description forms part of your business plan overall. For tips on writing a thorough business plan, see Write a Business Plan ."
    },
    {
      "title": "Determine who your customers are.",
      "content": "Determine who your customers are. When conducting market research, it is key to identify your customers. What are the demographics of this group? For example, do they live in urban, suburban, or rural settings? Are you marketing your product to men, women, boys, or girls? Who will use your product (whether a human or animal)? What are your customers' interests? What is missing from their lives that your product could fill? How do their budgets look? [2] X Research source For example, let's say you are starting a high-end laundering service. Your customers could be professional workers with high amounts of disposable income. They are both men and women, some with children and some without children. Your customers like to spend their time with their families and working out or taking cooking lessons. What they lack is free time. Your potential customers would probably not include families with low amounts of disposable income, individuals who work at jobs that don’t require high-end laundering of their wardrobe, etc."
    },
    {
      "title": "Identify the size of this market.",
      "content": "Identify the size of this market. You want to have an idea of how many customers you can expect to draw with your business. For example, if your potential customers are professional workers with high amounts of disposable income, you need to make sure that there are sufficient numbers of people in your area that match your description. If your target market is too small, your business will have a hard time remaining profitable. Do some demographic research on your area. The SBA is a good place to start, but chambers of commerce and other offices in your community can also help. How many people matching the description of your target market live in your area? Do they tend to live in one area, or spread out?"
    },
    {
      "title": "Get a sense of your competitors.",
      "content": "Get a sense of your competitors. What is the quality of your customers’ product or service? How is their pricing? How often do their customers change? Is their website well-designed? What about their advertising? Aim to identify your competitors’ weaknesses and design your product or service to fill the hole the competitors are leaving. [3] X Research source Try to find some of their existing customers to interview. You also could look at your competitors' reviews on websites like Yelp or tripadvisor. About what things do their customers complain? What do their customers praise? For instance, your competitor could offer laundry services with delivery. Customers are annoyed, though, that they have to drop off their laundry. Could you create a profitable model that combines pick-up and drop-off delivery services?"
    },
    {
      "title": "Overview what your business does.",
      "content": "Overview what your business does. Share with your reader the purpose of your business. Explain its basic tasks or services. Write what sets it apart from the competition. Aim to provide a short, concise description of 1-2 sentences. For example, \"Petra’s Pick Up and Drop Off Laundry offers a full range of laundry services, e.g., washing, drying, ironing, dry cleaning. Our business prides itself on being the only business in the Luxesville area that offers both pick up and drop off delivery services.\""
    },
    {
      "title": "Explain why you chose your market.",
      "content": "Explain why you chose your market. Aim for two to three sentences. You might talk about the ease of entry into the market, e.g., lower business taxes. Any conditions, whether financial or demographic, should be mentioned here. This section should give a clear idea of the future outlook for this market and why the need for your business exists. For example: “Our market research has shown that there are too few laundry services available to Luxesville’s highly professional population. Only two businesses exist for a population of 125,000 people and they are both located in the same neighborhood. We would like to offer our services in the up-and-coming south end of the city where young, busy professionals are flocking. Because of market trends, we anticipate demand for our services will increase by 20% in the next two years.\""
    },
    {
      "title": "Describe your intended customer base.",
      "content": "Describe your intended customer base. Provide an overview of your customers’ demographics. Use statistical findings to demonstrate how your product fits the market you’ve chosen. What is it about these customers, whether their age, incomes, marital statuses, sex, sexualities, etc., that makes your product well-suited for this market? You might have all these facts through official means like surveys or customer questionnaires or through observations. [4] X Research source academic.uprm.edu/jacruz/admi3125/Sample_Business_Plan.doc For example, you might write: “Because 80% of Luxesville’s residents work over sixty hours per week and thus have limited free time, laundry services are particularly attractive. Additionally, as the median income in Luxesville is $175,000, we ascertain that residents have enough disposable income to afford our services. 60% of those workers earning above the median income are women, meaning that this area has a large number of professional women. In fact, only 14% of households have a stay-at-home spouse. This means the traditional relegation of laundry to an at-home partner is less likely to occur. We plan to target professional households with high disposable income between the ages of 25-55.”"
    },
    {
      "title": "Evaluate the values and interests of your potential customers.",
      "content": "Evaluate the values and interests of your potential customers. Discuss the lifestyles, values, and behaviors of your potential customers. In this section, you define features of your product that will appeal to your customers on an emotional or personal level. You describe the benefits you are providing. For example, you might help a person’s work-life balance or improve their quality of life. You also show customers’ current opinions on existing products or services related to yours and their buying behaviors. Describe how these products are working or failing. Give concrete examples. For example, “Luxesville’s professional population is highly educated, overworked, and extraordinarily stressed. Many of these people value any free moment of time they have to exercise, spend time with their children, or visit restaurants. They do not want to waste time on mundane tasks like grocery shopping or laundry. They are frustrated that the only laundry services available require customers to drop off their laundry during business hours of 8 a.m. to 6 p.m. Many of these professionals are not home until 8, 9, or 10 p.m. Thus, having the ability to have their laundry picked up and dropped off and to order such services online is a huge attraction.”"
    },
    {
      "title": "Review competitors.",
      "content": "Review competitors. Evaluate what your competitors are doing right or wrong. Some of this information might have appeared in your customer overview. That is okay. Use this moment to point out any additional points. Research your competitors and their customers, and then map out your data onto three important areas: cost, service, and technology. [5] X Research source What are your competitors' costs, and what are they charging? What services do they provide? What technology are they using? You can also use surveys to ask your competitors' customers about their perceptions, ask suppliers in your industry about orders, and use online tools to do market research. [6] X Research source Provide any details about your competitors that can make your entry into the market stronger. For example, you might write, “Our competing launderers, “Drop and Sop” and “Clarity is Wearity,” are serving their maximum amount of customers. As previously noted, they both operate in the Hedgefund Forest neighborhood. Because they are family-owned enterprises, which is a positive point to some customers, they offer restricted hours and both close at 6 p.m. This does not serve the professional community. Their decision not to offer pick up services also has left many customers disgruntled. Thus, by beginning our business in the south end of the city, we hope to build a strong base and eventually expand towards Hedgefund Forest to pick up the slack of other launders.”"
    },
    {
      "title": "End with a product review.",
      "content": "End with a product review. Reiterate what you have to give to the market. In this section, you state your business goals through clear steps and plans. In a sense, this is your selling point. You have set up what the market is and what it lacks. Now you say how you will fill the gaps. Examine the larger context of your products or services. You might offer information on pricing, other consumer metrics, or any other information that strengthens your point."
    },
    {
      "title": "Revise for flow.",
      "content": "Revise for flow. Read your plan out loud. Cut down any excessive information (e.g., superfluous adjectives, too many transition words). Stick to the point but don’t forget to tell a story. Market descriptions are often persuasive. Especially if you are seeking investors, you want to sell your product but more so why your product fits the market you are trying to enter."
    }
  ]
}