{
  "url": "https://www.wikihow.com/Travel-when-Flying-on-a-Plane",
  "title": "How to Travel when Flying on a Plane",
  "steps": [
    {
      "title": "Determine how much luggage to take.",
      "content": "Determine how much luggage to take. Will a simple carry-on item do or do you also need a checked bag or two. Depending on how long you will be traveling or what types of items you are packing, figure out what types of luggage you need to use. The permitted size of carry-on bags varies from airline to airline. Check the requirements for the airline with which you will travel to learn how big your carry-on bag can be. [1] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source Remember that certain items are only permissible when packed in a checked bag."
    },
    {
      "title": "Make a list of any items you plan to pack that might be regulated.",
      "content": "Make a list of any items you plan to pack that might be regulated. TSA, or Transportation Security Administration and other national bodies have guidelines for a variety of items, ranging from foods and liquids to weapons. Consider what items you need to pack that might be prohibited or restricted: [2] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source Food items Liquids, such as bath products Sporting goods Tools Self defense items Sharp objects Small lighters."
    },
    {
      "title": "Learn how many items your carry-on and if you have to check a bag or two.",
      "content": "Learn how many items your carry-on and if you have to check a bag or two. There are not many things that TSA and other relevant organizations completely prohibits, compared to the number of things that are allowed. However, many items are only permitted when they are packed in your checked bag. Research your questionable items and learn if they are only permissible when checked. [3] X Expert Source Amy Tan Travel Planner & Founder, Planet Hoppers Expert Interview. 12 March 2020. Most liquids and some food items, like gravies and sauces or sometimes even ketchup, must be 3.4 fluid ounces (100.6 ml) or less in order to be allowed in a carry-on bag. The rules may be different for necessities such as medicine, but there still are restraints for that. [4] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source"
    },
    {
      "title": "Pack as lightly as you can.",
      "content": "Pack as lightly as you can. While you may be inclined to pack several different outfits and pairs of shoes, consider packing only a few basic essentials and pack tighter by pairing them different ways. [5] X Research source If you want to limit your packing to a carry-on only, then you have a limited amount of space. On the other hand, while you have more space in a checked bag, you will be charged more if it is overweight. Additionally, overpacking your carry-on or checked bag might result in it not fitting into the airline-approved measurements, in which case you might have to remove items from your bag to put into another bag or leave it at the airport. [6] X Research source Checked bag fees start at $25 for one checked bag at the majority of airlines and go up from there, with increases for multiple checked bags and bags that are overweight. [7] X Research source"
    },
    {
      "title": "Understand how liquids must be packed.",
      "content": "Understand how liquids must be packed. Because liquids and aerosols have the potential to explode due to the changing air pressure of air travel, TSA and other relevant organizations have special regulations about them. All liquid items that are 3.4 fluid ounces (100.6 ml) or smaller can go in your carry-on, and they must be packed in one 1-quart bag. Each traveler is only permitted to have one of these bags. [8] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source Items that are larger that 3.4 fluid ounces (100.6 ml) can be packed in a checked bag. They do not have to be enclosed in a zip-top bag, but it is recommended in order to protect your other packed belongings. Medications and nourishment items for infants and children are exempt from these rules. [9] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source"
    },
    {
      "title": "Roll your clothing to pack it, instead of folding it.",
      "content": "Roll your clothing to pack it, instead of folding it. One of the easiest ways to save space in your luggage is to change how you pack your clothing. Instead of folding your clothing and stacking it, roll it up so that it takes up less space. [10] X Research source Rolling your clothing not only saves space but also reduces wrinkles in clothes."
    },
    {
      "title": "Layer your packed items from heaviest to lightest.",
      "content": "Layer your packed items from heaviest to lightest. Start packing your bag by putting all of the heaviest items on the bottom, such as shoes. Then, start layering your rolled clothes on top, starting with the heaviest or largest rolled items, like sweaters or jeans, and moving to the lightest items. [11] X Research source Packing your items in this way prevents your clothes from being further compressed and wrinkled by being buried under heavier items. Put toiletries and other light items on top so that they are easily accessible for removing at the security checkpoint."
    },
    {
      "title": "Consider packing some clothes inside other items, like shoes.",
      "content": "Consider packing some clothes inside other items, like shoes. If you are packing boots or shoes, you can pack small clothing items, like undergarments, inside them. This saves packing space for other items, but only do this with items that you do not mind getting wrinkled."
    },
    {
      "title": "Plan to pack a change of clothing in your carry-on.",
      "content": "Plan to pack a change of clothing in your carry-on. When taking both a carry-on item and a checked bag, consider putting a change of clothes in your carry-on, just in case your checked bag does not make it to your destination. [12] X Research source This way, you have at least one additional set of clothing to wear until you receive your checked bag. It would also be helpful to include some key toiletry items, like a toothbrush, toothpaste, and deodorant, as long as they meet the 3.4 fluid-ounce (100.6 ml) requirement."
    },
    {
      "title": "Put thin items or nothing at all in the outer zip pockets.",
      "content": "Put thin items or nothing at all in the outer zip pockets. If you are using a suitcase, either a small one for a carry-on or a large one for a checked bag, avoid putting bulky items in the outer zipper pockets. Doing so causes the bag to become overstuffed, causing it to no longer fit airline size requirements. [13] X Research source Put magazines, thin books, or other slim items in these pockets."
    },
    {
      "title": "Avoid locking your luggage.",
      "content": "Avoid locking your luggage. Security checks all luggage, and they ask that it not be locked so that they can easily access it. If you lock it, they may damage your luggage trying to get it open. Security is not liable when this happens. [14] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source Security does have approved locks that they can open with their own tools, including Safe Skies and Travel Sentry."
    },
    {
      "title": "Check in for your flight up to 24 hours before departure.",
      "content": "Check in for your flight up to 24 hours before departure. Airlines now allow travelers to check in for their flights and secure their seats online up to 24 hours in advance. You can do this via airline apps on smartphones or on their websites. Checking in online ahead of time also saves you time in getting to the airport, because you can head straight to security and skip the check-in lines upon arrival."
    },
    {
      "title": "Print or secure your boarding pass ahead of time.",
      "content": "Print or secure your boarding pass ahead of time. If you check in early, you can print or access your boarding pass through your airline's mobile app. Be sure to print it out or take a screenshot of it on your smartphone, in case you have no service in the airport to access the mobile app. [15] X Expert Source Amy Tan Travel Planner & Founder, Planet Hoppers Expert Interview. 12 March 2020. If you check in at the airport, then airline agents will provide you with your boarding pass at that time."
    },
    {
      "title": "Have the appropriate identification ready in order to get through security.",
      "content": "Have the appropriate identification ready in order to get through security. Identification is required for adult travelers who are 18 and older. Children under the age of 18 are not required to have identification when they are traveling with an adult companion. You must have a valid form of identification, including but not limited to: [16] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source U.S. driver's license that is Real ID Act compliant (see dhs.gov/real-id for more information). If you do not have a Real ID compliant ID, then you will need to obtain an alternate form of identification (such as a passport or passport card) to pass the security lines. U.S. passport U.S. passport card U.S. military ID Permanent resident card Government-issued passport Border crossing card."
    },
    {
      "title": "Arrive at the airport with plenty of time to spare.",
      "content": "Arrive at the airport with plenty of time to spare. Be aware of what time your flight is supposed to depart and what time boarding is supposed to begin. Plan to be at the airport with enough time to get through security and make it to your gate on time. Airlines recommend that you arrive 30-45 minutes prior to departure for domestic flights, depending on whether you have to check any baggage. For international flights, it is recommended that you arrive at least two hours prior to departure to allow time for completing international requirements. [17] X Research source Accommodate for extra time if you have to drive yourself and park in long-term parking. You will have extra time for traveling from the parking lot to the terminal via the airport shuttle. If your airport is large and extremely busy, take that into consideration and arrive early, just to be sure. Also think about what day of the week you are traveling. Weekends are usually busy travel times, which means the airport and security checkpoint might be busier."
    },
    {
      "title": "Have all items needed for the security checkpoint easily accessible.",
      "content": "Have all items needed for the security checkpoint easily accessible. You will need your boarding pass and a form of identification, and when you reach the screening checkpoint, you will need to have certain items easily accessible to put through screening. Keep them at the top of your carry-on so that you do not have to dig through it to find them. Liquids and aerosols in the quart-sized bag Technology devices Medically necessary medications and liquids Nourishment items for infants and children."
    },
    {
      "title": "Remove all metal items from your person prior to going through screening.",
      "content": "Remove all metal items from your person prior to going through screening. When going through security, you have to remove a variety of items—or not wear them at all—in order to pass the screening. [18] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source You will put these in their own containers to pass through the X-ray machine, and then you can proceed through the metal detector. Shoes Coats, jackets, and sweaters Belts Coins Cell phones Jewelry."
    },
    {
      "title": "Know how to declare medications and items for infants and children.",
      "content": "Know how to declare medications and items for infants and children. If you do have liquid medications or breast milk, formula, or juice for an infant or child, you need to alert the officers so that it can be screened properly. Let the officer or other representative know that you have medically necessary liquids or medications when you are going through the screening. If you also need items such as ice packs, syringes, pumps, and IV bags, notify the officer about those, as well. It is helpful to have them labeled for easy screening. Keep all of these items separate from other liquids, like bath and hygiene products. Any ice packs or frozen gel packs that are necessary for your medication must be frozen solid at the security checkpoint. You do have the option to not have your medication screened by X-ray or to not have it opened, but in that case, other screening measures will have to be taken. [19] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source If you have nourishment items for an infant or child, you are also allowed to bring them in excess of 3.4 fluid ounces (100.6 ml) in a carry-on item, and they can be in a zip-top bag larger than one quart. However, they must be separate from other liquids that you are checking through security. Alert the officer that you have these items so that they can be screened correctly. The officer may want to X-ray or open your breast milk, formula, or juice, but you can deny that if you would like to. In that case, other screening measures will have to be taken. Ice packs and frozen gel packs will need to be frozen solid at the time you go through security. Other items such as canned, jarred, and processed baby food are permitted, as well as liquid-filled teethers, but they will also have to be screened. [20] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source"
    },
    {
      "title": "Find your gate and wait for boarding to start.",
      "content": "Find your gate and wait for boarding to start. Once you are through security, use the signs in the airport to help you find your gate. It is best to go straight there in order to avoid missing your flight and to make sure that you know where it is. After you have found your gate, you can go to the restroom, get something to eat, or shop, if you have time."
    },
    {
      "title": "Keep anything you might want during the flight in your carry-on.",
      "content": "Keep anything you might want during the flight in your carry-on. It makes the boarding process faster for you and everyone else, by keeping any items that you anticipate you will want during the flight in the carry-on item that you will put under the seat in front of you. This will save you from digging through your carry-on item before sitting down and holding up the boarding process. [21] X Expert Source Amy Tan Travel Planner & Founder, Planet Hoppers Expert Interview. 12 March 2020."
    },
    {
      "title": "Have snacks and drinks.",
      "content": "Have snacks and drinks. After getting through security, you can go to the restaurants and shops in your terminal to buy drinks. You can also pack approved snacks in your carry-on to avoid buying them from vendors in the terminal. Being prepared with snacks and drinks will help tide you over until you get to your destination, because although flights still do beverage service, many short haul flights no longer offer food or snacks. When they do offer meals, you normally have to pay for them. An alternative is to eat at one of the airport restaurants. These are usually overpriced, but if you have a long time to wait or will have a long time before you can get your next meal, it is a good idea to eat at a restaurant."
    },
    {
      "title": "Use your technology sparingly.",
      "content": "Use your technology sparingly. It can be hard to find places to charge your technology in airports. Many other people are trying to do the same thing, so finding power outlets is tricky. Once you are on your plane, you will be asked to power off your electronic devices or put them in Airplane Mode. Be sure to do this to avoid interference with airline signals. Remember that you cannot access any apps that require cellular data or Wi-Fi when your smartphone or other device is in Airplane Mode. Many airlines now offer Wi-Fi on flights, but it is almost always for a fee. Determine whether it is worth the money to access Wi-Fi on the flight. For example, if you are taking a business trip and have work to do while you travel, it will likely be worthwhile. If your trip is for pleasure, though, and you have no real need for using Wi-Fi other than entertainment, it might not be worth the price."
    },
    {
      "title": "Take books or other forms of entertainment.",
      "content": "Take books or other forms of entertainment. To pass time on layovers and during travel, bring books, crossword puzzles, word searches, or other types of entertainment. You can read by yourself, read to one of your travel companions, or work on the puzzles with travel companions. [22] X Expert Source Amy Tan Travel Planner & Founder, Planet Hoppers Expert Interview. 12 March 2020."
    },
    {
      "title": "Take a nap.",
      "content": "Take a nap. Either while you are traveling or while you wait in the airport for your flight, you can take a nap. Airports and airplanes are not the most comfortable places to sleep, but if you have an extremely early flight, overnight flight, or long travel day, it is a great time to get some rest."
    },
    {
      "title": "Watch a movie or TV show.",
      "content": "Watch a movie or TV show. Once your plane has reached a certain altitude, your flight attendants will announce that approved electronic devices can be used. If you would like to use your technology, you can watch a movie or a TV show to pass the time. Some airplanes have small TV screens in the backs of the headrests, so you can watch what is on those TVs. Keep in mind that you usually have to pay extra to access more desirable channels, instead of watching their infomercial channels or a map of your travel."
    },
    {
      "title": "Unfasten your seat belt.",
      "content": "Unfasten your seat belt. Wait until directed to do so and the fasten seat belt sign turns off."
    },
    {
      "title": "Other passengers may race to get up.",
      "content": "Other passengers may race to get up. If you don't wish to squeeze through at the first instant you can kindly let others pass infront of you."
    },
    {
      "title": "Take caution when opening overhead compartments.",
      "content": "Take caution when opening overhead compartments. Suitcases may fall out unexpectedly."
    },
    {
      "title": "Have your legal travel documents ready.",
      "content": "Have your legal travel documents ready. If you have landed in a different country or region have documentation including your passport and your customs form ready, and follow the following steps: Proceed out and follow the signs to the customs booth. Self-service kiosks can also do the same thing. Present your passport and your customs form to the officer or scan them in the booth. Scan your fingerprints on the scanner if necessary. This can happen if your name is on a country's blacklist, where you may be denied entry and deported. Scanning your fingerprints prove to the country that it is really you."
    },
    {
      "title": "Claim your baggage.",
      "content": "Claim your baggage. This can be found at the baggage claim carousel. It can take a while to claim your baggage. Be sure to gather your belongings from the plain before claiming your baggage. You cannot go back into a restricted area, without clearing security again."
    },
    {
      "title": "Leave the airport.",
      "content": "Leave the airport. Go to your arranged mode of transportation. You can also take a taxi, Uber, Lyft, or public transport."
    }
  ]
}