{
  "url": "https://www.wikihow.com/Steam-Eggplant",
  "title": "How to Steam Eggplant",
  "steps": [
    {
      "title": "Slice the eggplant diagonally into strips.",
      "content": "Slice the eggplant diagonally into strips. Cut them lengthwise so they are 1 ⁄ 2 inch (1.3 cm) thick, forming 1 ⁄ 2 inch (1.3 cm) strips. This will help to steam the eggplants quickly and evenly. [1] X Research source Alternatively, you can cut the eggplant into 1 ⁄ 2 inch (1.3 cm) cubes if you’d prefer."
    },
    {
      "title": "Fill a wok or sloped pot with water and put it on the stove.",
      "content": "Fill a wok or sloped pot with water and put it on the stove. Use a heat safe pot with sloped sides, as this will ensure the steamer does not come in contact with the water. Put about 1 inch (2.5 cm) of water in the wok. [2] X Research source"
    },
    {
      "title": "Put the steamer in the wok.",
      "content": "Put the steamer in the wok. Place the steamer in the wok, just above the water. Make sure the steamer is not touching the water and that there is a little space between the water and the steamer. [3] X Research source If you are using a colander as your steamer, put it in the wok right side up so the colander sits just above the water."
    },
    {
      "title": "Place the eggplant in the steamer and close it.",
      "content": "Place the eggplant in the steamer and close it. Spread the eggplant in an even layer on bottom of the steamer. If you are using a metal steamer, push the top of it closed to the eggplant can steam. If you are using a bamboo steamer or a homemade steamer, put the lid on the steamer, making sure it is snug."
    },
    {
      "title": "Turn the heat to high and steam the eggplant for 10-20 minutes.",
      "content": "Turn the heat to high and steam the eggplant for 10-20 minutes. Let the steamer do its job. Do not lift the lid or remove it until the eggplant is done steaming. If you prefer eggplant with a bit more crunch, you may only steam it for 10 minutes. For softer eggplant, steam it for 20-25 minutes."
    },
    {
      "title": "Take the steamed eggplant out of the steamer.",
      "content": "Take the steamed eggplant out of the steamer. Once the eggplant has been steamed to your liking, open the steamer or remove the lid. Take the eggplant out of the steamer with kitchen tongs or a fork. Be careful, as it will be hot. You can then place the steamed eggplant on a plate and season it to your liking with a salt and pepper, or a sauce."
    },
    {
      "title": "Scoop the flesh out of the eggplant, if desired.",
      "content": "Scoop the flesh out of the eggplant, if desired. If you’d prefer the eggplants without the skin, you can use a spoon to scoop out the steamed flesh of the eggplant. Try to take out only the flesh and leave the seeds."
    },
    {
      "title": "Make a sauce with soy sauce, chili, and garlic.",
      "content": "Make a sauce with soy sauce, chili, and garlic. Combine 2 tablespoons (30 ml) of soy sauce, 1 tablespoon (15 ml) of white vinegar or rice vinegar, 1 clove of minced garlic, and 1 teaspoon (4.9 ml) of caster sugar in a bowl. Then, pour it over the steamed eggplant. [4] X Research source You can then garnish the eggplant with finely chopped small red chili and one handful of chopped coriander."
    },
    {
      "title": "Add a sauce made with ginger, sesame oil, and scallion.",
      "content": "Add a sauce made with ginger, sesame oil, and scallion. Mix together 1 teaspoon (4.9 ml) of minced ginger, 1 ⁄ 4 cup (59 ml) of sliced scallions, 1 ⁄ 4 cup (59 ml) of sesame oil, and 1 ⁄ 4 cup (59 ml) of canola oil in a bowl. Put in a splash of soy sauce and a dash of kosher salt to taste. Then, put the sauce on the steamed eggplant and enjoy."
    },
    {
      "title": "Put a premade sauce or oil on the eggplant.",
      "content": "Put a premade sauce or oil on the eggplant. If you’d prefer to buy a sauce for the steamed eggplant, look for a Chinese garlic or ginger sauce. You can also buy chili oil and sprinkle it on the steamed eggplant to season it."
    },
    {
      "title": "Serve the eggplant.",
      "content": "Serve the eggplant. You can then serve the eggplant on its own as a side dish or a light snack. Put the eggplant on a bed of white rice and add tofu to make it a main dish that is vegetarian. You can also serve the eggplant with beef, chicken, or pork as a main dish."
    },
    {
      "title": "Use a metal steamer.",
      "content": "Use a metal steamer. The most common type of steamer is a basket made of stainless steel that fits into a 9 inches (23 cm) pot on the stove. The basket opens so you can place the eggplant inside and then folds closed to steam the vegetables. Look for metal steamers at your local kitchen supply store or online. Most metal steamers are dishwasher safe, making them easy to clean and use."
    },
    {
      "title": "Try a bamboo steamer.",
      "content": "Try a bamboo steamer. Bamboo steamers come in two pieces, a round bamboo bowl and a bamboo lid that fits snugly over the bowl. These steamers are great if you want to steam a lot of vegetables at once. [5] X Research source Look for bamboo steamers that are 10 to 12 inches (25 to 30 cm) in diameter at your local kitchen supply store or online. You can also use bamboo steamers to cook other items, such as meat or dumplings."
    },
    {
      "title": "Make a steamer with a colander and a heat-safe plate or lid.",
      "content": "Make a steamer with a colander and a heat-safe plate or lid. If you don’t have access to a steamer, make one with a metal colander and a heat-safe plate or the lid of a pot. Make sure the lid or plate fits snugly over the colander. Do not use plastic items to make the steamer, as they may not hold up to the heat."
    }
  ]
}