{
  "url": "https://www.wikihow.com/Strawberry-Fade",
  "title": "Understanding TikTok’s Strawberry Fade Haircut Meme",
  "steps": [
    {
      "title": "The original strawberry fade meme referred to a closely shaved head.",
      "content": "The original strawberry fade meme referred to a closely shaved head. The term took off on TikTok after cosmetic and hair transplant surgeon Dr. Rob Berberian created videos showing scalps that were pink or red with blood, with tiny holes where the hair follicles had been buzzed. Rather than an appealing haircut trend, the strawberry fade is a meme about a gross look created in preparation for a hair transplant. No one is actually getting this haircut. [1] X Research source After user @drrobberberian1’s videos went viral, the look became known as the trypophobia fade. Trypophobia refers to an unofficial disorder in which looking at images or things with small holes, bumps, or patterns causes a strong sense of unease and anxiety. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Over time, other creators have made their own viral strawberry fade videos. Most show a close shave, but some put unique spins on the trend."
    },
    {
      "title": "Most strawberry fade TikToks show a shaved scalp.",
      "content": "Most strawberry fade TikToks show a shaved scalp. Text overlaid in the video or the caption of the TikTok indicates in a joking tone that it’s the strawberry fade. For example, Dr. Berberian’s TikToks will joke that the patient only asked for a slight trim, but got a strawberry fade instead (when they’re actually receiving a hair transplant.) In another viral video , user @cole_durbin gave someone a close shave down the center of his head, calling it the strawberry fade. Another look that commenters claim is the strawberry fade is the R9 haircut, a look Brazilian footballer Ronaldo Nazário wore at the 2002 FIFA World Cup. The look features a head completely shaved except for a small tuft of hair at the front."
    },
    {
      "title": "In one viral TikTok, a man uses strawberries to dye a fade haircut.",
      "content": "In one viral TikTok, a man uses strawberries to dye a fade haircut. User @officialmartyblendz, a barber and content creator, created this variation on the strawberry fade. In the video , he pours a strawberry smoothie on his model’s hair to dye it pink before shaving it into a fade style . It’s unclear if the strawberry mixture dyed the model’s hair, or if actual hair dye was used behind the scenes."
    },
    {
      "title": "An AI-generated strawberry fade haircut went viral.",
      "content": "An AI-generated strawberry fade haircut went viral. The TikTok , posted by user @txrek_, shows a man with an AI-generated fade haircut that resembles the tip of a strawberry. Users debate in the comments about signs this strawberry fade was created using AI, such as its unnatural glossiness and the warping of the barber’s hands at the start of the TikTok. The creator who uploaded this video is known for his disruptive AI-generated content."
    },
    {
      "title": "Ice Cream Hair",
      "content": "Ice Cream Hair Ice cream hair is a TikTok hair trend that went viral as a meme in 2022. The look features fluffy, voluminous hair that rounds down on top but flips out at the bangs and edges. It resembles a scoop of ice cream."
    },
    {
      "title": "Wolf Cut",
      "content": "Wolf Cut The wolf cut is an edgy hairstyle that combines the mullet and the shag. It’s a popular style for any gender due to its length and versatility. A classic wolf cut features layers that start short at the crown of your head, but become longer toward the back."
    },
    {
      "title": "Scandinavian Hairline",
      "content": "Scandinavian Hairline In the summer of 2023, the Scandi hairline went viral on TikTok. The trend refers to bleaching or lightening the hairline and baby hairs that frame the face, helping dyed blondes to appear more natural and sunkissed. The Scandinavian hairline can work on any hair color, not just blondes!"
    },
    {
      "title": "Warrior Cut",
      "content": "Warrior Cut The warrior cut took off in August 2024, but the look is inspired by ‘90s idols like Leonardo DiCaprio. A warrior cut features a low taper fade and a textured top that has medium length, while the back is shorter."
    },
    {
      "title": "Broccoli Cut",
      "content": "Broccoli Cut The broccoli haircut is one of the most unusual cuts to go viral on TikTok and other social media platforms. What started as a meme became a mega-popular look for Zoomer boys everywhere. The haircut’s veggie name refers to how its shaved sides and volumized top resemble a broccoli floret."
    },
    {
      "title": "Jellyfish Haircut",
      "content": "Jellyfish Haircut Inspired by K-pop artists, the jellyfish haircut went viral online in 2023 and stayed on trend in 2024. The look combines a bob with long layers, resembling the body of a jellyfish. The multi-layered haircut can be customized to any length or preference."
    },
    {
      "title": "Use color-depositing shampoo and conditioner.",
      "content": "Use color-depositing shampoo and conditioner. These products coat your hair cuticles in pigment, helping to enhance your natural color. While not dyes, they can have the same strong effects. Try your best to find the right color before using the product, and test on a small strand that’s underneath most of your hair before applying all over. [3] X Research source"
    },
    {
      "title": "Cover your hair when you’re in the sun.",
      "content": "Cover your hair when you’re in the sun. Studies have found that exposure to UV light contributes to fading of artificial hair color. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Even if you have natural, undyed hair, you’ll want to protect it from sun damage by covering it with a parasol, hood, hat, or bandana. Add UV-protectant products to your hair care routine to help prevent fading. [5] X Research source"
    }
  ]
}