{
  "url": "https://www.wikihow.com/Wear-a-Cowboy-Hat-Properly",
  "title": "How to Wear a Cowboy Hat Properly",
  "steps": [
    {
      "title": "Get the right size.",
      "content": "Get the right size. The first step to properly wearing a cowboy hat is making sure the hat is the right size and fits your head properly. Cowboy hats should typically fit snug around your head. If you are buying one, know your hat size ahead of time but also try the hat on before you buy it."
    },
    {
      "title": "Fix your current hat to fit better.",
      "content": "Fix your current hat to fit better. You may have a hat already that is just barely too big but not big enough that you would want to get a smaller size. You can fix this. You can buy foam strip that is specifically made to put into hats to make them fit tighter. Depending on how much you need, and the shape of your head, you can either put this foam all the way around, or you can put a little in the front and back, just on the sides, or even just the front or just the back. Figure out where your hat is fitting too loosely. If the whole hat is sitting too low on your head, you probably want to put some sizing foam around the whole hat. There should be a band around the inside of the hat that you can flip up and place the foam strip under. Then flip the band back down before wearing the hat."
    },
    {
      "title": "Pick the right hat.",
      "content": "Pick the right hat. You have a lot of options when it comes to cowboy hats. The main material choices are felt (made of beaver or rabbit pelt), leather, and straw. Felt hats are warmer so they tend to be worn more in the cold seasons. Straw hats are better for staying cool during hot days."
    },
    {
      "title": "Shape your hat.",
      "content": "Shape your hat. Most cowboy hats can be conformed to a certain shape by gently bending and squeezing them. [1] X Research source How exactly you do this will depend on the material of the hat itself. You want the front and back of the brim to be fairly flat. Curl the sides so they stick up just slightly. You don’t want to curl them too tightly. You can also gently dent the sides of the crown of the hat. No tools are required for this. Simply use your hands."
    },
    {
      "title": "Adjust your hair.",
      "content": "Adjust your hair. You need to make sure that your hair does not get in the way of your hat sitting properly on your head. If you have short hair, this won’t apply to you. For longer hair, it can be a good idea to slick your hair back so it lays smoothly. Don’t pile your hair up on your head in any way. If you need to tie it in place, a ponytail that hangs straight down is the best option."
    },
    {
      "title": "Put the bow to the back.",
      "content": "Put the bow to the back. One of the most basic rules is making sure that the hat is on your head correctly with the front to the front. Most cowboy hats have a small bow on the inside lining around the headband. The bow should be in the back of your head. If your hat does not have this bow, a general rule is that the hat will be narrower at the front."
    },
    {
      "title": "Angle your brim accordingly.",
      "content": "Angle your brim accordingly. Positioning your hat in different ways can affect the way you look in the way. If you want to appear casual and friendly, tilt the front of the hat up just slightly so you can see about half of you forehead. [2] X Research source To look more serious, or almost mysterious, lower the brim to just above your eyebrows. Slanting the hat slightly to the left or right will give you an appearance of being confident, almost to the point of looking for women or for trouble."
    },
    {
      "title": "Pick the right outfit.",
      "content": "Pick the right outfit. Your best and simplest bet to wear with a cowboy hat is a button up shirt, jeans, and a nice pair of cowboy boots. The shirt be a plain color or plaid. Flannel shirt work well too. [3] X Research source You want basic, straight leg blue jeans with no extra pockets on the sides, no designs or extra buttons on the back pockets, no intentional bleaching or stain marks. Just classic blue jeans. If you are going to wear a cowboy hat, boots are pretty much a must. It’s going to look wrong if you try to go out with some sneakers on. You should also tuck in your shirt and most likely wear a nice black or brown leather belt. Fancy belt buckle is optional."
    }
  ]
}