{
  "url": "https://www.wikihow.com/Why-Do-I-Want-to-Text-My-Ex",
  "title": "Should I Text My Ex? (Plus, Why You Want To & How to Resist the Urge)",
  "steps": [
    {
      "title": "You crave the positive brain chemicals from the relationship.",
      "content": "You crave the positive brain chemicals from the relationship. Relationship coach Amy Chan explains that “the same flood of chemicals that cause you to be blissfully in lust during the beginning stages of love are the exact same chemicals that cause you to painfully suffer when it ends.” When you get that urge, it’s usually just your brain acting on old habits and looking for those chemicals again. Those chemicals are things like dopamine and cortisol, which are pleasure and adrenaline chemicals that give you a rush, and can be hard to ignore. That said, you can find those chemicals elsewhere, like when you talk to friends or do something you enjoy."
    },
    {
      "title": "You feel nostalgic for the relationship.",
      "content": "You feel nostalgic for the relationship. “You're remembering them,” says licensed counselor Dr. Tara Vossenkemper, “and you're thinking of them fondly.” But Vossenkemper reminds us that nostalgia only gives you part of the picture. You’re remembering the highs and now the lows, which makes you start to think that you lost something that was better than it really was, and now you want it back."
    },
    {
      "title": "You don’t have the closure you need to move on.",
      "content": "You don’t have the closure you need to move on. Maybe it feels like you didn’t have a clean break, or that maybe with enough time away, you’ll both be able to see what went wrong and do things better this time. But that’s just not true. You crave closure , and you think hitting them up or doing it all over again would give you that closure, but the truth is that it’d probably just fall apart for the same reasons. [1] X Research source Closure can come in other forms, and often, time brings its own sort of closure that not even your ex could give you."
    },
    {
      "title": "You’re curious or concerned about how your ex is doing now.",
      "content": "You’re curious or concerned about how your ex is doing now. You’ve gone months without hearing anything about them, and now you just have to know. Or, you’ve heard through the grapevine that they’re in a rough patch and, because you still care for them, you want to help. [2] X Research source We get it! But right now, it’s not your place to reach out, and doing so might only tear open old wounds that you’re both trying to mend. This is especially hard if you feel a little good when you hear they’re doing bad. It’s an ugly feeling, and while it’s a natural one, it’s a feeling that’s best left alone."
    },
    {
      "title": "You’re not happy with your current life post breakup.",
      "content": "You’re not happy with your current life post breakup. Maybe you fell into a new relationship and it’s not everything you hoped for, so your mind is drifting back to your ex, Vossenkemper suggests. Or, maybe single life just isn’t working out for you the way you wanted it to. Whatever the case, you might be unhappy, and so you’re yearning for happier times. But you have to trust that you’ll find even better days ahead of you , not behind you."
    },
    {
      "title": "You just haven’t healed yet.",
      "content": "You just haven’t healed yet. Chan tells us that romantic feelings tend to fade after 6 months, but it could take as long as 2 years or more. A hurting heart is a serious wound, and while it heals , you’ll look for any way to make it hurt less. But you have to trust that time and new experiences will patch things up. You can’t go back to the person who caused the hurt in the first place."
    },
    {
      "title": "Text or talk to a good friend or family member, instead.",
      "content": "Text or talk to a good friend or family member, instead. This not only gives you the quick serotonin boost you were looking for, but it reminds you that you have other valuable people in your life, and that you don’t have to lean on your ex. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Ask your friend how their day is going, if they want to hang out, or just share a meme you like. That little bit of contact will go a long way. You might even open up to them and talk about your feelings about your ex, which can help you vent those feelings instead of leaving them pent up inside."
    },
    {
      "title": "Distract yourself with an absorbing activity like cooking or reading.",
      "content": "Distract yourself with an absorbing activity like cooking or reading. Getting your mind off of your ex is key. Try doing something that engages all 5 of your senses to separate your body and mind from your ex—cook a meal, bake some sweets, go for a run, take a walk in the park. [4] X Research source When you immerse yourself in a life without your ex, it becomes easier to start separating the person you are know from the person you were with them. You might also play video games, watch a movie, treat yourself to a meal at a restaurant, or visit a museum or another attraction."
    },
    {
      "title": "Remind yourself of why it didn’t work out.",
      "content": "Remind yourself of why it didn’t work out. Dating coach Erika Kaplan says, “You have to just accept that you have feelings for a former person in your life, and that's okay.” In the meantime, though, think back on the relationship and why it ended, and remind yourself that you can’t change things. In fact, if you could do it over again, it’d probably end the same way. Remember the pain and hurt, and start looking toward a future without that hurt. For example, remind yourself of your ex’s flaws, or of how being with them made you feel at the end. Often, focusing on these is enough to remember why it can’t work. Psychologist Dr. Julia Yacoob says it’s also important to identify any fault you have and accept it. Otherwise, you might make the same mistakes in the next relationship."
    },
    {
      "title": "Talk to a professional if you feel grief or depression.",
      "content": "Talk to a professional if you feel grief or depression. Breakups are often followed by a period of mourning, which is natural! Sometimes, though, they also throw you into a depression, and while it’s not unusual, depression is something best handled with a little help. If your breakup still feels overwhelming, consider talking to a counselor or therapist , who can help you untangle your emotions and start moving forward."
    },
    {
      "title": "When you still have feelings for them.",
      "content": "When you still have feelings for them. Vossenkemper warns that contacting an ex while you still feel any type of way for them is counterproductive. If you think of your ex and you still feel sad, or your heart skips a beat, or you get a little angry, then it’s still too soon to contact them. Those feelings will only get more intense once you start talking, and all the old ghosts will come back to haunt you. [5] X Research source"
    },
    {
      "title": "When one of you is in a new relationship.",
      "content": "When one of you is in a new relationship. Whether you’ve met someone new, or they’ve found their own new person, texting them in either situation is not a good idea. The first days of a relationship are important and delicate. Jeopardizing your own relationship is a risky move, and meddling with their new relationship is asking for trouble—and just not cool, no matter how much they might deserve it. [6] X Research source Wait 12 months to contact them, if you’re really dead set on it. That gives you both plenty of time to establish yourselves with new people and build trust."
    },
    {
      "title": "When you “just want to check in.”",
      "content": "When you “just want to check in.” It’s tempting to want an update on how they’re doing, or to offer your help if they’re going through a hard time, but the truth is that there’s always more to it than “just checking in.” You’re still hoping for something and wanting something from them, and that dynamic doesn’t help you heal. [7] X Research source Even just “checking in” is getting your foot in the door, and holding it open, when what you need is to close that door altogether."
    },
    {
      "title": "When you want to get back at them.",
      "content": "When you want to get back at them. This is a common situation—you might want to hit them up just to show them that you’re doing great, and that you actually don’t care that you broke up, and that life is better now without them. But contacting them at all just shows them that you do still think about them, which is counterproductive and doesn’t convince anyone. It’s better to let them go altogether and save your own peace of mind. [8] X Research source"
    },
    {
      "title": "When you don’t have romantic feelings for them.",
      "content": "When you don’t have romantic feelings for them. When the day comes that you can think of your ex and not feel that little tug on your heartstrings, then and only then should you entertain the thought of linking back up . Usually, you’ll reach that point when you’re in a new and strong relationship, or you’ve moved on with your life and started doing things that give you security and confidence. Even then, ask yourself some questions, like, “Would they want me to reach out?” “What am I trying to get from this?” “Am I violating a personal boundary?” “Is this necessary or urgent?” Wait until you can think of them and smile, like, “What an interesting time in my life, I’m glad I had that experience.” Only then will you be ready."
    },
    {
      "title": "When you need something urgent from them.",
      "content": "When you need something urgent from them. Whether we like it or not, exes are still important people in our lives, and the time may come when you need them. They might still have something important to you, like a family heirloom, that you want back. Or, you may need a desperate favor, and your ex is the only person who could help. At times like these, texting them may be necessary, but treat it more like a business transaction than a relationship."
    },
    {
      "title": "Have a game plan for what you want to achieve.",
      "content": "Have a game plan for what you want to achieve. Don’t just hit them up and improvise the situation. Before you text them, ask yourself what you're trying to achieve, make sure it’s a worthy goal, and stick to it. If you’re trying to get your stuff back, then that’s all you’re here for. [9] X Research source If you’re looking for closure, then be prepared for the possibility it won’t come, and bail as soon as the convo turns dicey. It’s a good idea to open your message with your purpose, like, “Hey, I left things at your place, and I’d like to have them back,” or, “I don’t mean to talk for long, but I want to know why you ended things, and then I’ll leave you alone.”"
    },
    {
      "title": "Be prepared for them to not take it well, or not respond at all.",
      "content": "Be prepared for them to not take it well, or not respond at all. It shouldn't be surprising that your ex might not want to hear from you. [10] X Research source They might respond with aggression, or they might leave you on read. In either case, don’t push it—you’re already overextending, and worst case scenario, they could get the law involved. If they’re angry or aggressive, put the phone away and don’t send any more text messages. You might just make things worse."
    },
    {
      "title": "Keep in mind that they’re your ex, even if you’re friends.",
      "content": "Keep in mind that they’re your ex, even if you’re friends. Being someone’s ex is a dynamic that stays front and center. Remember that even if you’re on good terms, you’ve drawn boundaries and put up walls, and respect those boundaries. No flirting, no reminiscing on the good times, no chance of getting back together. It can be nice to be in touch with an ex , if you’re both mature and moved on, but you’re still exes. [11] X Research source"
    },
    {
      "title": "Experts say it takes 6 months to 2 years, on average, to get over it.",
      "content": "Experts say it takes 6 months to 2 years, on average, to get over it. Chan tells us that it often takes up to 24 months to move on from someone and feel independent and ready to live your own life again. That said, this timeline is different for everyone, and depends on many factors, like how close you were, your own attachment style, and your current support network. Give yourself as much time and patience as you need. For example, Chan says that someone with an anxious attachment style—who craves validation—may take longer to heal than someone with an avoidant attachment style—someone who’d rather put distance between themselves and their partner."
    },
    {
      "title": "Wanting to text an ex is a temporary feeling, and usually not a great idea.",
      "content": "Wanting to text an ex is a temporary feeling, and usually not a great idea. There are many natural, understandable feelings for wanting to text your ex—loneliness, curiosity, nostalgia. But at the end of the day, it’s better if you let that wound heal instead of opening it up again. Years from now, when you’ve moved on, you might be able to talk to them without risk, or you might not feel the urge at all. It’s best to wait and let the feeling pass rather than pick up the phone. In the meantime, remind yourself of why the relationship ended and how you felt in its final days, which will help you realize why it’s not a good idea. Also, talk to close friends or family, and do an activity that engages all 5 senses in order to help you distract yourself from the urge."
    }
  ]
}