{
  "url": "https://www.wikihow.com/Write-a-Love-Letter-to-a-Girl-You-Do-Not-Know",
  "title": "How to Write a Love Letter to a Girl You Do Not Know",
  "steps": [
    {
      "title": "Brainstorm.",
      "content": "Brainstorm. Before you begin writing a love letter, you should spend some time brainstorming. This means gathering your thoughts so you can better express yourself when writing the physical letter. To start, ask yourself some questions. Who are you writing the letter to? Think about how you know this girl. Is she someone you admire from school who you've never spoken to? Is she a barista at a local coffee shop who you admire but are unsure how to approach? What do you like about this person? As you begin thinking about the letter's recipient, think about why you're infatuated with her. What about her do you admire and why? Go beyond mere physical beauty. For example, if you're writing about a barista you have a crush on you might admire her hairstyle and eyes. However, try to push beyond this. What about her personality is intriguing to you? Is she always particularly polite with customers? Does she always smile at people, even if they don't smile back? [1] X Research source Can you think of any specific incidents? People are attracted to people who notice them. If you can think of a specific moment when you realized you had feelings for this person, that would be great to include in the letter. Try to jog your memory and think of a specific moment when you began to develop romantic feelings. [2] X Research source"
    },
    {
      "title": "Focus on the energy over the specific message.",
      "content": "Focus on the energy over the specific message. It can be hard to write to someone you do not know. Even if you admire this person very much, you will not have as much information at your disposal as you would writing to someone you have an existing relationship with. Therefore, focus on the energy over the message. Even if your feelings are vague, the fact you wrote a letter at all speaks volumes. [3] X Research source Writing someone a love letter takes courage and commitment. You have to sit down and physically write out your feelings. Delivering the letter carries a risk of rejection, especially if the recipient is very much a stranger to you. Therefore, the effort you took to write the letter in and of itself may be seen as impressive by the recipient. [4] X Research source Remember your intention if you feel nervous or frustrated when writing the letter. You want to let this stranger know you admire her. The energy behind that intention is more important than finding the perfect words and phrases. Allow your intent to guide you as you begin to express your feelings. [5] X Research source"
    },
    {
      "title": "Think about the past, present, and future.",
      "content": "Think about the past, present, and future. If you're still struggling to think of ideas, focus on the past, present, and future. This can get your creative juices flowing. When did you meet this person? What is your relationship now? What do you hope for in the future? Some details may be inexact when writing a love letter to a stranger but you may find some inspiration considering these factors. When did you first notice this person? Did she sit ahead of you in algebra class and you noticed the smell of her conditioner? Did you order a latte from her when you were having a bad day and notice she drew a smiley face on the side of your cup? While your meeting may have been brief, and while she may not remember, you might have noticed something you can include in your letter. [6] X Research source How does this person affect you now? While you may not have a relationship in the present, you may still gain something valuable from day-to-day interactions with this person. For example, maybe it's nice to see her through the window as you pass by your local Starbucks. Maybe it's nice to overhear the music she's listening to before the bell rings for class. [7] X Research source Finally, think of the future. Where do you want to go from here? Maybe you just wanted to express your feelings rather than bottling them up. However, maybe you're hoping you could meet this person and the two of you could get to know each other. Think about what you want from this letter when considering the future. [8] X Research source Reader Poll: We asked 1174 wikiHow readers, and 57% of them agreed that the memory they cherish the most about the person they like is the moment they first met them or felt sparks fly . [Take Poll]"
    },
    {
      "title": "State your intent first.",
      "content": "State your intent first. When you feel ready to write the letter, begin by stating your intent. This can be brief, as short as a single sentence. However, it's an important sentence. You want the recipient to know this is a letter expressing some deep feelings so she'll pay attention to its content. For example, you could say something like, \"We don't know each other, but I'm writing to tell you I've admired you for quite some time. We have an algebra class together in a lecture hall on campus, and I think your taste in music is amazing.\""
    },
    {
      "title": "State exactly how you feel.",
      "content": "State exactly how you feel. As you move forward in the letter, be upfront about your feelings. A love letter is not the place to be shy. Tell the girl why you admire her and what qualities about her most intrigue you. Go into specifics when possible. You may not know a lot about this person, but mention small things about her that you love. For example, maybe you think the buttons she has on her purse are hilarious. Maybe you notice she listens to a particular band on her headphones that you also enjoy. Be upfront about why you've never approached her in person. While many people enjoy anonymous love letters, there is always the risk of coming off the wrong way. You don't want the recipient to feel like she's being watched. It can help if you assure her, at some point, you're a relatively normal person who happens to feel more comfortable expressing feelings in writing. There are a variety of reasons you may prefer writing a love letter. You could be shy, for example, and find expressing yourself easier in words. Maybe you only see her when she's at work and don't want to bother her. Whatever you reason, make sure you state it early on. You want to make sure the recipient understands why you chose a letter over simply talking to her. This way, you can help avoid potential confusion or discomfort. Returning to the example of the girl you know in algebra class, you may hesitate to approach her because you're shy. You could write something like, \"I always want to talk to you in person. However, I'm very shy by nature. Now that we're halfway through the semester, I'm worried I'll never get the courage together. So, I decided to write you a letter.\""
    },
    {
      "title": "Focus on the recipient.",
      "content": "Focus on the recipient. Oftentimes, people end up inadvertently talking about themselves in a love letter. While you should certainly talk about your own feelings, make sure to focus primarily on the recipient. As you write the letter, express what you like about this person. If you admire that she's always listening to Elliot Smith on her headphones, say so. However, do not go on a 3 paragraph anecdote about your own admiration for Smith. [9] X Research source Use specifics when possible. If you're writing to a relative stranger, specifics may be hard. However, small things go a long way. Do you love the coconut-like smell of her shampoo? Do you enjoy how she laughs to herself during downtime at the coffee shop? Do you remember a comment she made in class that was particularly insightful? Let's return to the algebra class example. You could write something like, \"I notice you're always listening to Elliot Smith. I am a big fan of his as well. I'm impressed by how drawn in you seem to the music. You seem to have an intense appreciation for art.\""
    },
    {
      "title": "Use your own voice.",
      "content": "Use your own voice. You don't have to write in a lofty, elevated style if it doesn't come naturally to you. The primary purpose of a love letter is to express your feelings in a way that makes the recipient feel good about herself. The best way to do this is to simply be yourself and use your own words. This will sound more authentic and sincere when expressed in a way that feels natural to you. Do not get hung up on inserting elaborate metaphors or dramatic declarations of your admiration into your writing. Instead, focus on simply being yourself and speaking in your own voice. [10] X Research source"
    },
    {
      "title": "Say how this person has affected you.",
      "content": "Say how this person has affected you. As you near the end of your letter, tell the person how their presence has affected you. The girl you're writing to may be flattered to know she made an impact on your life. Talk about how she makes your days better and why you appreciate her. [11] X Research source This may be something small, as you don't know this girl yet. However, even a small impact can be flattering. For example, maybe you always look forward to your 8AM British Literature seminar simply because you enjoy the contributions this girl makes to class. Returning to are example, you could write something like, \"I know it sounds silly, but getting to see you each day makes me a bit more enthusiastic about going to algebra. I've never been a math person, but seeing you is a small treat that makes class more bearable.\""
    },
    {
      "title": "Reaffirm your feelings.",
      "content": "Reaffirm your feelings. As you begin to conclude your letter, reaffirm your feelings briefly. Say something like, \"I will continue to look forward to my morning algebra class as it give me a chance to be close to you.\" You want the recipient to know you're feelings are serious and not fleeting. You can also briefly summarize what was said in the letter to help you reach your concluding thoughts. [12] X Research source"
    },
    {
      "title": "End on a single sentence summing up what's been said.",
      "content": "End on a single sentence summing up what's been said. It can be difficult to do, but you should try to end on a single sentence that sums up the gist of what you're saying. This is an elegant way to end a love letter. It can reiterate your feelings and leave a lasting impression on the recipient. [13] X Research source It may take a few tries before you find the right sentence. You may want to grab a piece of scrap paper and write down a few sentences before settling on one to include in your letter. It's okay to be a little cheesy. Love letters are often somewhat overwrought but infatuation itself is often dramatic. Don't be afraid to use language that sounds somewhat hyperbolic or ridiculous. [14] X Research source In our example, try something like, \"You really do light up my mornings Mondays, Wednesdays, and Fridays with your spark, passion, and enthusiastic nature.\" Above all, make sure that the message is authentic and representative of who you are as a person. [15] X Expert Source Rebecca Tenzer, MAT, MA, LCSW, CCTP, CGCS, CCATP, CCFP Clinical Therapist & Adjunct Professor Expert Interview. 19 August 2020."
    },
    {
      "title": "Give her information on how to contact you.",
      "content": "Give her information on how to contact you. If you want this letter to lead to a possible date, provide some contact information for yourself. You can say something like, \"If you're interested, text or call the following number.\" You could also include your e-mail or a link to a social media profile"
    },
    {
      "title": "Find a way to deliver the letter.",
      "content": "Find a way to deliver the letter. Once you've finished your letter, find a way to deliver it. This can be tricky if you're writing to someone you don't know. If you know the person's name, it might be a good idea to write her name on a envelop and place the letter in there. Then, leave the envelop where she will see it. For example, if you're writing to someone who works at a coffee shop you could leave the letter on your table or where drinks are set down. If you have an e-mail address for the person, consider e-mailing your letter. If the two of you have a mutual friend, see if that friend can deliver the letter. Do not try to send the letter in the mail. Getting a letter in the mail from a stranger can be scary. You do not want to come off as creepy."
    }
  ]
}