{
  "url": "https://www.wikihow.com/Switch-Twitch-Drops-Channel",
  "title": "How to Watch Another Channel for Twitch Drops Rewards",
  "steps": [
    {
      "title": "Close the current channel.",
      "content": "Close the current channel. You can only earn progress toward a Drop with one participating channel at a time. Watching another channel in a separate tab will not build your progress more quickly; Twitch only counts the stream you're actively watching . Drops can only be obtained on your PC/Mac in a web browser or the Twitch app for Android and iOS. This feature is currently unsupported on consoles, Smart TVs, and other streaming devices."
    },
    {
      "title": "Navigate to a new channel.",
      "content": "Navigate to a new channel. You can use the Browse tab on the home page to find active channels. This channel must have Drops enabled to count toward your progress. In most cases, you'll see the DropsEnabled tag in the stream's description."
    },
    {
      "title": "Watch the new channel.",
      "content": "Watch the new channel. It can take a few minutes for your progress to move again. You can check your Drops progress by clicking your profile picture in the top-right corner. The progress bar will be shown under Drops ."
    },
    {
      "title": "Twitch Drops are in-game loot rewards given for watching streamers.",
      "content": "Twitch Drops are in-game loot rewards given for watching streamers. With Twitch's Drops campaign, you can earn in-game loot by tuning into a participating channel for a period of time. You'll gain progress towards a reward by actively watching the channel and be notified when you meet the watch quota. [1] X Research source Your Twitch account must be linked to the proper game developer to receive the in-game drops. For example, if you're watching a participating streamer play Overwatch, you must link your Battle.net (Blizzard) account to claim the rewards. You'll only be able to earn progress by watching one channel at a time. However, you can easily switch the channel for Twitch Drops."
    },
    {
      "title": "Click your profile picture in the top-right corner.",
      "content": "Click your profile picture in the top-right corner. If you aren't already logged into your Twitch account, enter your username and password now. A drop-down menu will open."
    },
    {
      "title": "Click Drops.",
      "content": "Click Drops . You can find this below Subscriptions . A new page will open."
    },
    {
      "title": "View your Drops.",
      "content": "View your Drops. You'll see a list of Drops and their progress underneath In Progress . If you have a checkmark underneath a Drop, you have already claimed it. If you see a purple Connect button, you'll need to connect the associated account to receive the rewards. Click the button, and enter your username and password to link the accounts."
    }
  ]
}