{
  "url": "https://www.wikihow.com/Treat-Lice-in-Cats",
  "title": "How to Treat Lice in Cats",
  "steps": [
    {
      "title": "Notice if your cat is constantly scratching its body.",
      "content": "Notice if your cat is constantly scratching its body. A cat with lice is intensely itchy. Your cat may scratch itself, bite itself, rub the affected areas, or act agitated. This constant scratching should prompt you to check your cat’s coat for parasites. [1] X Research source You may also notice matted or balding spots in your cat’s coat."
    },
    {
      "title": "Look for lice on your cat’s coat.",
      "content": "Look for lice on your cat’s coat. With good eyesight, you can see lice with the naked eye. They are about the size of a sesame seed with an elongated, oval body, like a grain of rice but smaller. They have 3 pairs of tiny legs. [2] X Research source The lice scavenge sloughed skin cells and like to anchor themselves to hair shafts near the skin’s surface. They should be easy to look for by moving your hands through your cat’s fur."
    },
    {
      "title": "Search for lice eggs in your cat’s hair.",
      "content": "Search for lice eggs in your cat’s hair. The adult louse lays eggs along hair shafts. To the naked eye these eggs look like tiny white glistening specks stuck to the hair. They can also look like white dust. However, if you try to comb them out, you will find that they are tightly glued onto the hair shaft. [3] X Research source Pay particular attention to the hair shafts near your cat’s skin. The eggs will be glued onto your cat’s hair and may be easier to see than adult lice as they don't move away. [4] X Research source"
    },
    {
      "title": "Use spot-on products that contain fipronil.",
      "content": "Use spot-on products that contain fipronil. Fipronil is a pharmacy-controlled product, so you can buy it over the counter from certain pharmacies. Products containing fipronil include Frontline and Effipro. Fipronil works by interfering with an insect neurotransmitter that is not present in mammals, which causes paralysis and death of the louse. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Apply this product once every 30 days. Treat all cats that may have come into contact with lice so they do not act as a reservoir of infection."
    },
    {
      "title": "Select spot-on products that contain selamectin.",
      "content": "Select spot-on products that contain selamectin. Selamectin is an active ingredient in Revolution (US) and Stronghold (UK). It works by interfering with the louse's neurotransmission, causing it to become paralyzed and die. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This is a prescription product, so a veterinary surgeon must prescribe this medication for your cat. Though products containing fipronil and selamectin are not licensed to treat lice infections, they are widely acknowledged as being safe and effective at killing lice."
    },
    {
      "title": "Apply the product directly to the cat’s skin.",
      "content": "Apply the product directly to the cat’s skin. Put the product in a place where the cat cannot easily lick it off. The back of a cat’s neck would be a good option. Part the cat’s fur with your fingertips so that you can see the skin and apply the product there. Allow the product to dry for 2 to 3 hours before stroking the cat, otherwise you risk wiping the product off."
    },
    {
      "title": "Use only 1 pipette of product per cat, per month.",
      "content": "Use only 1 pipette of product per cat, per month. Spot-on products are designed to produce a micro-fine layer of active medication over the surface of the cat's skin, so don’t over apply it. If you want to improve the appearance of the cat’s coat, wait 2 days after applying the product to give the adult lice a chance to die. Then, comb the cat’s coat to remove the dead lice. The eggs need to hatch out before they will die, so repeat the combing weekly until the comb is clean for 2 consecutive weeks."
    },
    {
      "title": "Take your cat to the vet to ensure it is in good health.",
      "content": "Take your cat to the vet to ensure it is in good health. Sick or debilitated cats have a hard time grooming themselves, which can make them more prone to getting infested with lice. In addition to using spot-on treatments, get your cat treated for any underlying conditions that might make it vulnerable to infestations. Ask the vet if spot-on treatments are safe for your cat based on your cat’s size, age, and overall health."
    },
    {
      "title": "Remove any tangles in the cat’s hair before combing.",
      "content": "Remove any tangles in the cat’s hair before combing. Combing only works if you get right down to the skin, and if the cat is badly matted the tangles need removing. Cats most likely to pick up lice are those who live in overcrowded and unclean conditions, and these are the cats most likely to have knotted coats. If the cat only has an occasional tangled knot of fur, then try snipping the knots out with scissors. Always take care to only cut the cat’s fur and keep the scissor’s blades away from the skin so it doesn’t nick the cat’s skin."
    },
    {
      "title": "Have a vet trim the cat if their coat is badly matted.",
      "content": "Have a vet trim the cat if their coat is badly matted. The cat may need to be sedated because the knots tug on the skin and are uncomfortable. Many cats will not tolerate having their mats touched. In these cases, it may be best to take your cat to a vet or professional groomer."
    },
    {
      "title": "Use a fine-toothed nit comb on your cat’s fur.",
      "content": "Use a fine-toothed nit comb on your cat’s fur. This is a drug-free way of trying to eliminate a louse infestation. You can use a comb that is similar to those used on children to manage head lice. This method takes extraordinary patience and dedication, and it is all too easy to miss a part of the cat where lice are hiding, such as their armpits or groin. This is also a time-consuming method as it takes hours to properly comb through a cat’s fur, not to mention that it is a rare cat who will not lose patience after a few minutes."
    },
    {
      "title": "Work methodically with the comb so you cover every inch of the cat’s body.",
      "content": "Work methodically with the comb so you cover every inch of the cat’s body. You can start at its head and work backwards over the spine towards the tail. Then cover the left flank, right flank, tummy, legs, and tail."
    },
    {
      "title": "Dry comb the cat’s fur in sections.",
      "content": "Dry comb the cat’s fur in sections. Separating a section of the cat’s hair and comb it from root to tip. It helps to have a damp cloth or towel on hand to wipe the debris, nits and lice from the comb between swipes."
    },
    {
      "title": "Have someone hold the cat’s scruff to subdue it.",
      "content": "Have someone hold the cat’s scruff to subdue it. If the cat is fidgety but not aggressive or overly anxious, then holding the scruff of its neck in one hand may help. Better yet, have an assistant hold the cat's scruff to make it easier for you to comb the cat. If the cat is acting aggressively, combing is probably not a good option. There's a good chance you will get injured, and also it is very unlikely you will be able to do a thorough enough job and get all of the lice."
    },
    {
      "title": "Be aware of the drawbacks of using shampoo to counteract lice.",
      "content": "Be aware of the drawbacks of using shampoo to counteract lice. One major drawback of shampooing lice away is that once the cat’s coat is dry, there is no residual action of the active ingredient. This means there is nothing on the coat to kill future lice that hop on, so if the cat goes back onto dirty bedding there is nothing to stop the cat from becoming reinfected immediately. [7] X Research source The use of shampoo has largely been superseded by products that are more effective and easier to use, such as spot-on treatments. In the days before spot-on treatments, the shampoo commonly used against lice was seleen. Seleen is a thick green shampoo that contains selenium sulphide. This chemical decreases excess skin cell shedding and food for the lice. But it is not licensed for use in cats so use Seleen on your cat at your own risk. [8] X Research source The therapy of parasitic skin infestations. Hewitt et al. Clin Exp Dermatol 6 (5), 527-531"
    },
    {
      "title": "Only use shampoo if your cat enjoys being bathed.",
      "content": "Only use shampoo if your cat enjoys being bathed. Most cats dislike baths and being shampooed. Cats that do like bathing are probably show cats and the least likely to pick up lice in the first place, by virtue of their pampered lifestyle. [9] X Research source Notes on parasitic skin disease in the dog and cat. Grant. Br Vet J 141 (5), 447-462"
    },
    {
      "title": "Use a baby bath or kitchen sink to shampoo the cat.",
      "content": "Use a baby bath or kitchen sink to shampoo the cat. Gather the necessary materials, such as towels, medicated shampoo, and a jug to pour the water."
    },
    {
      "title": "Fill the sink with warm water.",
      "content": "Fill the sink with warm water. The water should reach the cat's elbows or just below its elbows. Pour warm water over the entire cat, taking care not to get it into its ears or eyes. If necessary, put cotton wool in the cat’s ears to protect them."
    },
    {
      "title": "Work a coin-sized amount of shampoo into the cat’s coat until it lathers.",
      "content": "Work a coin-sized amount of shampoo into the cat’s coat until it lathers. Place the shampoo in the palm of your hand, then work it into your cat’s wet fur. Repeat this process until the whole cat is shampooed. If possible, leave the shampoo in the cat’s coat for 10 minutes to allow for the maximum effect before rinsing. Rinse the cat well with plenty of fresh warm water and then towel-dry the cat."
    },
    {
      "title": "Make sure the cat goes back into a clean environment to prevent re-infection.",
      "content": "Make sure the cat goes back into a clean environment to prevent re-infection. Wash the cat’s bedding as well as any other bedding in the room and spray any soft furnishing such as sofas and beds with an insecticidal spray suitable for killing flea eggs and larvae, such as RIP Fleas or Staykill. [10] X Research source Always use these sprays in a well-ventilated room and remove any reptiles, birds, or fish from the room to avoid toxicity. Leave the room uninhabited for 2 hours after spraying to allow any lingering aerosol to settle out of the atmosphere so you and your pets don’t breathe it in."
    }
  ]
}