{
  "url": "https://www.wikihow.com/Stop-Minecraft-from-Pausing-when-Tabbing-Out",
  "title": "How to Prevent Minecraft's Auto-Pausing When You Use Alt-Tab",
  "steps": [
    {
      "title": "Open your inventory or a chest.",
      "content": "Open your inventory or a chest. Press the “E” key on your keyboard to open your inventory menu. While your inventory is open, Minecraft won’t pause—even after you hit Alt+Tab and navigate away. Similarly, if you have the materials to craft a chest , you can open it and stay on the chest inventory menu to prevent Minecraft from pausing. [1] X Research source [2] X Research source To make a chest, place 8 wooden planks in your 3x3 crafting table. Then, just place the chest in the world and open it!"
    },
    {
      "title": "Open a chat window.",
      "content": "Open a chat window. Press “T” on your keyboard or “right” on the d-pad to open a chat window in your Minecraft game. This can trick the game after you Alt+Tab away; it’ll think the game still has focus, even though you’re really on a different window. [3] X Research source"
    },
    {
      "title": "Enable LAN mode.",
      "content": "Enable LAN mode. “LAN” stands for “local area network,” so by enabling LAN mode, you’re also opening up your single-player Minecraft world to other players (although they have to be on the same network to join). Still, using LAN mode will stop Minecraft from losing focus and auto-pausing when you switch tabs. Enabling it is simple: [4] X Research source 1. Press “Esc” to pause the game and open up your menu. 2. Select the “Open to LAN” button. 3. Confirm the action by clicking the “Start LAN world” button. 4. You don’t have to do anything else; once you start LAN mode, you can tab out of Minecraft without auto-pausing."
    },
    {
      "title": "Use the F3 + P key bind (Java edition only).",
      "content": "Use the F3 + P key bind (Java edition only). You can disable Minecraft’s focus parameters and prevent it from auto-pausing by hitting the “F3” and “P” keys at the same time. This is a debug command; it essentially disables the game’s ability to pause upon losing focus. It’s a super easy fix, but remember: it’ll only work in Minecraft’s Java edition. For those who are unsure, the Java edition is just the original version of Minecraft (playable on PC, Mac, and Linux). Bedrock edition is the other main version of Minecraft; it’s playable with Windows 10+ and VR headsets and offers cross-platform play with other Bedrock editions."
    },
    {
      "title": "Change your Minecraft config file (Java edition only).",
      "content": "Change your Minecraft config file (Java edition only). This fix is a little more technical, but it’ll permanently disable auto-pausing when tabbing out until you change the settings manually again. Like the key bind trick above, this method is only for the Minecraft Java edition! To change your config file: [5] X Research source 1. Go to your main Minecraft directory and open the “options.txt” file (it’s a text file). 2. Locate the line “pauseOnLostFocus:true”. 3. Change “true” to “false” (so the whole line reads “pauseOnLostFocus:false”). 4. Save the file and close it. You’re all set!"
    },
    {
      "title": "Play Minecraft multiplayer on your own server.",
      "content": "Play Minecraft multiplayer on your own server. If you aren’t using LAN mode, you can alternatively create a free multiplayer server and host it to prevent the game from pausing when tabbing out. Since the server is live for multiple players, it won’t auto-pause just because you aren’t looking at it! [6] X Research source"
    },
    {
      "title": "Use a Minecraft mod to eliminate pausing (Java version only).",
      "content": "Use a Minecraft mod to eliminate pausing (Java version only). If you have time to install Minecraft mods , you can undoubtedly find one that will disable auto-pausing when tabbing out of the game screen. Once you’ve set up your game to support mods (using the Minecraft Forge add-on), find and download a mod from one of the common Minecraft modding sites, such as: https://www.minecraftmods.com/ https://www.curseforge.com/minecraft/search?page=1&pageSize=20&sortBy=relevancy&class=mc-mods https://www.minecraftforum.net/forums/mapping-and-modding-java-edition/minecraft-mods https://www.planetminecraft.com/resources/mods/ Search terms like “No pause” or “No pausing on lost focus” to find the right mod for you."
    },
    {
      "title": "Auto-pause is supposed to be a helpful safety function.",
      "content": "Auto-pause is supposed to be a helpful safety function. It’s intended to prevent player characters from getting hurt or dying while the player is off doing something else. After all, Minecraft has plenty of roaming dangers—and if a mob (like a creeper or skeleton) were to find your character while you were looking at a different window, you might have a problem on your hands! On the other hand, players who need to switch windows often or prefer to multitask while playing Minecraft might find the auto-pause feature frustrating. For example, you can farm resources more easily when you leave Minecraft running and do other things for a while—but that’s impossible if the game is auto-paused."
    },
    {
      "title": "Yes; when auto-pause is enabled, you can use Alt+Tab to trigger it.",
      "content": "Yes; when auto-pause is enabled, you can use Alt+Tab to trigger it. If you don’t want to pull up the Minecraft menu yourself (which will pause the game), you can just use the “Alt” + “Tab” combination on your keyboard to switch windows. As long as you haven’t used any of the above methods and pausing is still enabled, the game will auto-pause once you tab away to another window."
    }
  ]
}