{
  "url": "https://www.wikihow.com/Take-a-Screenshot-on-a-Mac",
  "title": "How to Take a Screenshot on a Mac: Complete Guide",
  "steps": [
    {
      "title": "Make sure your screen displays exactly what you want to show in your screenshot image.",
      "content": "Make sure your screen displays exactly what you want to show in your screenshot image. Ensure all the relevant windows are visible."
    },
    {
      "title": "Press ⌘ Command+⇧ Shift+3.",
      "content": "Press ⌘ Command + ⇧ Shift + 3 . This keyboard shortcut takes a screenshot of everything on your screen. If your sound is on, your computer should make a brief camera shutter noise. [1] X Expert Source Chiara Corsaro Certified Apple Technician Expert Interview. 18 October 2019."
    },
    {
      "title": "Find your screenshot on your desktop.",
      "content": "Find your screenshot on your desktop. It will be a .png file named \"Screen Shot\" labeled with the date and time. [2] X Research source Earlier versions of OS X will save it as \"Picture #\"—for example, if it's the 5th screenshot on your desktop it will be labeled \"Picture 5\"."
    },
    {
      "title": "Use the screenshot.",
      "content": "Use the screenshot. Once you have taken your screenshots, they are now ready to be used as needed. You can attach them to an email, upload them to the Web, or even drag them straight into an application such as a word processor."
    },
    {
      "title": "Press ⌘ Command+⇧ Shift+4.",
      "content": "Press ⌘ Command + ⇧ Shift + 4 . Your cursor will turn into a small crosshair reticle. [3] X Expert Source Chiara Corsaro Certified Apple Technician Expert Interview. 18 October 2019."
    },
    {
      "title": "Click and drag your cursor to highlight the area you'd like to take a picture of.",
      "content": "Click and drag your cursor to highlight the area you'd like to take a picture of. A gray rectangle should appear where you drag your cursor. If you need to adjust your windows at all, press Escape to return to a regular cursor without taking a picture. [4] X Expert Source Chiara Corsaro Certified Apple Technician Expert Interview. 18 October 2019."
    },
    {
      "title": "Let go of the mouse.",
      "content": "Let go of the mouse. You should hear a brief camera shutter noise if your computer's sound is turned on. That signals that your screenshot has been taken. [5] X Expert Source Chiara Corsaro Certified Apple Technician Expert Interview. 18 October 2019."
    },
    {
      "title": "Find your screenshot on your desktop.",
      "content": "Find your screenshot on your desktop. It will be a .png file named \"Screen Shot\" labeled with the date and time. [6] X Research source Earlier versions of OS X will save it as \"Picture #\"—for example, if it's the 5th screenshot on your desktop it will be labeled as \"Picture 5\"."
    },
    {
      "title": "Use the screenshot.",
      "content": "Use the screenshot. Once you have taken your screenshots, they are now ready to be used as needed. You can attach them to an email, upload them to the Web, or even drag them straight into an application such as a word processor."
    },
    {
      "title": "Press ⌘ Command+⇧ Shift+4 then press the spacebar.",
      "content": "Press ⌘ Command + ⇧ Shift + 4 then press the spacebar. The cursor will turn into a small camera. [7] X Research source"
    },
    {
      "title": "Move your cursor over the window you want to capture.",
      "content": "Move your cursor over the window you want to capture. The camera will highlight different windows blue as it moves over them. You can use keyboard commands such as ⌘ Command + Tab ↹ to alternate through your windows while still in this mode."
    },
    {
      "title": "Click on the window.",
      "content": "Click on the window. The picture of the window you selected will be saved to the desktop by default just like the other screenshot methods."
    },
    {
      "title": "Find your screenshot on your desktop.",
      "content": "Find your screenshot on your desktop. It will be a .png file named \"Screen Shot\" labeled with the date and time. [8] X Research source"
    },
    {
      "title": "Use the screenshot.",
      "content": "Use the screenshot. Once you have taken your screenshots, they are now ready to be used as needed. You can attach them to an email, upload them to the Web, or even drag them straight into an application such as a word processor. After you’re done taking screenshots, check out how to delete cookies on your Mac ."
    },
    {
      "title": "Press ⌘ Command+Control+⇧ Shift+3.",
      "content": "Press ⌘ Command + Control + ⇧ Shift + 3 . This method works exactly the same as the one above, except the screenshot does not immediately create a file. Instead, the image is saved to the clipboard, the same temporary storage area where your computer remembers the text that you have copied . [9] X Research source You can also take a portion screenshot with this method using ⌘ Command + Control + ⇧ Shift + 4 and dragging your reticle over the appropriate part of your screen, exactly as the portion screenshot method."
    },
    {
      "title": "Use ⌘ Command+V to paste your image.",
      "content": "Use ⌘ Command + V to paste your image. Your screenshot image can be pasted straight into any compatible application, such as a Word document, an image editing program, and many email services. You can also use Edit > Paste in the menu bar. Next, check out how to view your web browser history on your Mac ."
    },
    {
      "title": "Press ⌘ Command+⇧ Shift+5.",
      "content": "Press ⌘ Command + ⇧ Shift + 5 . This opens Mac’s built-in Screenshot app. A small gray menu of screenshot tools will appear. This app can take screenshots of the entire screen, a portion of the screen, and individual windows. You can also choose to set a timer and include the cursor. The app also allows you to record your screen. [10] X Research source"
    },
    {
      "title": "Select a tool.",
      "content": "Select a tool. Click the tool you want to use for taking a screenshot. Here are your options: Capture the entire screen Capture a window Capture a portion of the screen Record the entire screen Record a portion of the screen"
    },
    {
      "title": "Click Options.",
      "content": "Click Options . Here, you can set a timer, show the cursor in the screenshot, and indicate where you want to save the screenshot."
    },
    {
      "title": "Click Capture.",
      "content": "Click Capture . This will take a screenshot of the entire screen or the portion you’ve selected. To capture a window, click the window on the screen while using the window tool."
    },
    {
      "title": "Go to Applications > Utilities > Grab.",
      "content": "Go to Applications > Utilities > Grab . This opens the Grab Utility Tool application. You will see the menus shown in the upper left of your screen, but no windows will open. [11] X Research source This tool has been replaced by the Screenshot app in later versions of macOS."
    },
    {
      "title": "Click the Capture menu and choose from the four different options.",
      "content": "Click the Capture menu and choose from the four different options. [12] X Research source To take a picture of your entire screen, click Screen . A window will pop up telling you where to click and letting you know that the window will not appear in the shot. To take a picture of a portion of your screen, click Selection . A window will pop up instructing you to drag your mouse over the portion of your screen you'd like to capture. To take a picture of a specific window, select Window . Then, click on the window you'd like to take a picture of."
    },
    {
      "title": "When the new window opens, choose Save.",
      "content": "When the new window opens, choose Save . You can also choose Save As to give it a different name and/or move it to a more appropriate location, but note that it can only be saved as a .tiff file. Note that the file is not automatically saved."
    }
  ]
}