{
  "url": "https://www.wikihow.com/Survive-a-Hurricane",
  "title": "How to Survive a Hurricane",
  "steps": [
    {
      "title": "Be ready if you live in a hurricane-prone area.",
      "content": "Be ready if you live in a hurricane-prone area. Do you live in a state that gets frequent hurricanes, like Florida, Georgia, or the Carolinas? Agencies like the Federal Emergency Management Agency (FEMA) and National Oceanic and Atmospheric Administration (NOAA) advise you to be ready before the start of hurricane season, i.e. June 1. Your preparations should include a “Family Disaster Plan” and an “ Emergency Disaster Supply Kit ” that's easy for the family to locate in a hurry. A family disaster plan outlines what you will do in an emergency. Plan out your emergency evacuation routes, for example, and try to have several in case a favored one is unusable. Agree on where to meet if you get separated. Do drills to teach family members how to turn off water, gas, and electricity. Make sure even the youngest knows how to call emergency services . A disaster kit is something to have ready at a moment's notice. It should have the basic things you'll need to survive on your own for at least 72 hours, like food, water, a first aid kit, and lights. Once winds reach tropical force, preparation is impossible, and you will have to focus on survival. Review your insurance plan to make sure it covers damage from hurricanes. If you don't have homeowners or renters insurance, then get a plan."
    },
    {
      "title": "Consider buying a generator.",
      "content": "Consider buying a generator . A generator will ensure that you have electricity after a storm abates, until the power returns. Store it in a secure place away from rain and rising water. Know how to use it correctly, and pay special attention to proper ventilation. Always make sure a generator is grounded and in a dry area. Never plug a portable generator into a regular outlet or hook it directly to your home's wiring, as it can back-feed into the power lines. To reduce the risk of carbon monoxide poisoning, always run generators outside and away from doors and windows. Ask for a demonstration from the retailer if you're unsure how to use it. Generators require regular maintenance and tests. Be sure to follow the instructions to avoid discovering it doesn't work when you need it most."
    },
    {
      "title": "Buy self-powered radios and flashlights.",
      "content": "Buy self-powered radios and flashlights. You will almost certainly lose electricity during a major hurricane and will not have access to communications or light. Consider having battery or kinetic energy-powered radios and flashlights on hand. A NOAA “All Alerts” weather receiver with a battery backup is best. This radio will let you listen to regular updates and forecasts from the NOAA. Have it set to alert mode during the threat and make sure it is powered up. Buy some efficient battery-powered or kinetic lights. The Coleman LED Micropacker is a good model and will light a small area on three AAA batteries for several days. Kinetic-energy lights use mechanical energy from sources like cranks and will never run out of power. Glowsticks are a safe alternative, too. Given the risk of gas leaks during a storm, you should be very wary of candles. Keep a large supply of regular batteries, as well, stored in a watertight container."
    },
    {
      "title": "Add a “safe room” to your house if you can.",
      "content": "Add a “safe room” to your house if you can. A safe room is a structure designed to withstand the federal government's criteria for an extreme weather event, like a tornado or hurricane. They are often inside homes in an inner room. People who take shelter in a certified safe room are very likely to escape injury or death in a weather emergency. [1] X Trustworthy Source Federal Emergency Management Agency Federal agency responsible for coordinating responses to disasters and states of emergency Go to source Residential safe rooms are “hardened.” This means that they have been strengthened to withstand high winds, with thickened or reinforced concrete ceiling, floor, and walls and other features. Safe rooms can be added to a house or retrofitted. You will want to ensure that it is accessible, supplied with water and other essentials, and will be moderately comfortable for occupants. People often choose an interior bathroom for this purpose. Can't afford to build a safe room? The federal government offers grants and other funding programs."
    },
    {
      "title": "Secure your property well in advance.",
      "content": "Secure your property well in advance. The majority of hurricane damage comes from high winds, which can either blow away or rip apart anything that's not well secured. [2] X Expert Source Steve Linton Custom Home Builder Expert Interview. 16 September 2020. Try to minimize potential damage by acting before the season starts. [3] X Research source Since high winds can cause branches and trees to fall, pre-emptively remove any damaged tree limbs near your property before the season begins. Clear away other debris that is likely to fly during a storm. Retrofit your home's roof, windows, and doors to protect it better. For example, you can have impact-resistant windows, reinforced doors, and hurricane shutters installed ahead of time to guard against storm damage. [4] X Research source You can also have a contractor secure your roof to the house frame using metal hurricane clips braces, or straps."
    },
    {
      "title": "Reinforce your home during a watch or warning.",
      "content": "Reinforce your home during a watch or warning. [5] X Expert Source Steve Linton Custom Home Builder Expert Interview. 16 September 2020. Take further steps if you know that a hurricane is on the way. Even if you've retrofitted your house, there are measures you can take to strengthen it before the storm breaks. [6] X Research source If you have storm shutters, close them. [7] X Expert Source Steve Linton Custom Home Builder Expert Interview. 16 September 2020. Otherwise, board up or tape your windows. Plywood works best, and use alligator tape instead of duct tape. Secure loose rain gutters and downspouts and clear them of debris or clogs. Turn off all propane tanks, as well. Check that your garage doors are secured. Do not leave them open and board up any gaps between the door and ground: flying garages can destroy your home."
    },
    {
      "title": "Stock up on food and water.",
      "content": "Stock up on food and water. When the power goes out, your refrigerator will stop working and any meat, dairy, or perishable foods will spoil. Your water may also get cut off. To give yourself the best shot at survival, keep a well-stocked pantry of canned and non-perishable food and bottled water – at least a three day supply. Fill bottles with fresh drinking water and store them in your shelter. You will need about one gallon of water per day, per person, and more for cooking and washing. Mark your calendar to ensure that drinking water is regularly updated. Keep at least a three-day supply of food that will not spoil. This means food that is canned, tinned, or freeze dried. Make provisions for pet food, too. During the threat stage, disinfect your bathtub and other large jugs and fill them with water. These sources might be vital post-storm for drinking, bathing, and toilet flushing. [8] X Research source"
    },
    {
      "title": "Evacuate",
      "content": "Evacuate . Head north to avoid the storm if you can, where it will have lost strength by the time it reaches you. For example, go to Georgia if you live in southern Florida or move inland if you live in the Carolinas. It's a lot easier to keep the family and pets together and safe when you are away rather than weathering the storm. [9] X Research source Stay together. Leave your home in a group and take one car if possible. Always obey local orders to evacuate. Evacuation should be an added priority if you live in a mobile home, even one made after 1994. Mobile homes can be destroyed in the weakest, Category 1 hurricanes. Only take what you really need, like your cell phone, meds, identification, cash, and perhaps some clothes. Have an emergency medical kit with you, as well. Fill up the gas tank and give yourself plenty of time. You do not want to be in your car during a hurricane. Never leave pets behind––if they're not able to escape debris, flood waters, or flying items, they can be injured or killed."
    },
    {
      "title": "Find a shelter.",
      "content": "Find a shelter. If you decide to stay, you'll need to find a place that will protect you, your family, and your pets during the storm. This shelter should not have any windows or skylights. If it's in your home, close all interior doors and secure and brace the external doors. [10] X Research source [11] X Research source Hopefully you will have prepared as mentioned above. In that case, you should have a safe space and everything you need. If not, make do in the time available. Choose an interior room with strong walls and no windows. An interior bathroom or closet can work, for example. You can even protect yourself in a ceramic bathtub, covering the top with plywood. Alternatively, look for a community shelter. Hurricane areas like Florida have shelters statewide that open during storms. Find one near you, bringing things like meds, insurance papers, IDs, bedding, flashlights, basic snacks, and games."
    },
    {
      "title": "Take shelter at least 2 hours before the storm hits.",
      "content": "Take shelter at least 2 hours before the storm hits. Don't cut it close. Get to your shelter before the storm starts. Bring a battery-powered radio and a supply of batteries and use it for updates (every 15 to 30 minutes). At this point, the outer bands of the hurricane should have already started to affect you. [12] X Research source Have your Emergency Disaster Supply Kit close at hand. Stay inside at all times, even if it seems calm. The weather in a hurricane can moderate and worsen quickly, especially if you are passing through the eye of the storm. Keep away from windows, skylights, and glass doors. The biggest risk in a hurricane is from flying debris or broken glass. For added protection, try to lie on the floor under something sturdy like a table. Water and lightning pose electrocution risks during a hurricane. Turn off your main breaker and big appliances if you lose power or are threatened with flood water. Try not to use electric appliances, the phone, or the shower."
    },
    {
      "title": "Stay put in an emergency, but do call for help.",
      "content": "Stay put in an emergency, but do call for help. A lot can happen in a serious hurricane. You might be in danger from the storm surge, injured by debris, or face some other medical crisis. What should you do if something happens? Unless you're threatened by flood waters, it's probably best to stay inside and sheltered. The high winds and flying debris can injure or even kill you. Try to call 911 or your local emergency services if you or your family are in life-threatening danger. But keep in mind that the phone may not work, and emergency services may not be available. Thousands of 911 calls went unanswered during Hurricane Katrina, for example. [13] X Research source Use the resources you have. Treat injuries as best you can with a first aid kit. If you can reach 911, they may at least be able to advise you on a course of action."
    },
    {
      "title": "Be sure it's safe to emerge.",
      "content": "Be sure it's safe to emerge. Don't leave your shelter until you get the official “all-clear” from the NOAA. If the winds die down it may only be the dangerous eye of the storm, which will be followed by the back side of the “eye wall” and high winds. A hurricane can take hours to pass. The area around the eye of the storm is where wind speeds are strongest. It can also spawn tornadoes. [14] X Research source Wait at least 30 minutes after the eye of the storm has passed before entering rooms with windows. Even then, you should be very careful––at this point, there is still a good chance of debris breaking glass. Be careful even after the all-clear. There will be lots of hazards like downed trees, wires, and power lines. Do not go near any of these lines or wires. Call the power company or emergency services to help you, instead. Stay away from flooded areas, as well. Use extreme caution if you have to enter a flooded area, as there may be hidden debris or other hazards."
    },
    {
      "title": "Take extra care when entering buildings.",
      "content": "Take extra care when entering buildings. [15] X Expert Source Steve Linton Custom Home Builder Expert Interview. 16 September 2020. The hurricane's high winds will damage many, if not most, structures. Do not enter any buildings after the storm unless you're sure they're structurally safe. Also, evacuate as fast as you safely can if a building shows signs of severe damage, in case it collapses. Stay away if you smell gas, see flood waters, or if the building has been damaged by fire. Use a flashlight rather than candles, matches, torches, or lanterns. There may be a gas leak and you could cause a fire or explosion. Open windows and doors to let any such gas escape. Do not try to turn on the electricity unless you are ABSOLUTELY sure it's safe. Check all electric and gas connections before turning them on. Be mindful of loose or slippery floorboards, falling debris, and cracked masonry when entering a structure."
    },
    {
      "title": "Take stock of the damage.",
      "content": "Take stock of the damage. Your first priority during a hurricane is to stay safe and keep your family and pets healthy. Only after this is done should you start to take stock. Check your house for structural damage. If anything is of concern, get the authorities to check it out as quickly as possible and don't go near the area until it has been fixed. [16] X Research source Clean and disinfect everything that might have come into contact with sewage, bacteria, or spilled chemicals. Throw out all spoiled food, as well. When in doubt, throw it out. Get your water system running and safe. Have damaged septic systems repaired, for example, and get your wells checked for chemical contamination. Start to remove and replace wet drywall and other paneling that can harbor mold."
    },
    {
      "title": "Pump out flooded basements.",
      "content": "Pump out flooded basements. You should never enter a flooded basement – apart from the risk of electrocution, flood waters can hide debris or harbor bacteria from things like raw sewage. [17] X Research source Instead, use a pump to gradually reduce the water level by about one third each day until it's gone. Plug a shop vac into a safe outlet upstairs and begin pumping down the water. Keep the cord clear of the water and wear rubber boots for safety. [18] X Research source If you have a heavy-duty gas pump, feed the hose into the basement through a window. If you can't drain the basement safely, call the fire department and ask them to do it for you."
    },
    {
      "title": "Report losses to your insurance company.",
      "content": "Report losses to your insurance company. [19] X Expert Source Steve Linton Custom Home Builder Expert Interview. 16 September 2020. You may be able to recoup some of the losses to your home and property if you have an insurance policy that covers flood, wind, and storm damage. Get in touch with your provider as soon as you can to file a report. [20] X Research source Start a list of damages for your claims. Take photos and videos, keep receipts for repairs, supplies, and even hotel costs. If you have to vacate the home, make sure your insurance company knows where to reach you. Try contacting them by phone. Many providers have toll-free, 24-hour 1-800 numbers. In a total loss, some people even paint their address and insurance provider's name on the house to attract the attention of an insurance adjuster. Try within reason to prevent further damage. Cover a damaged roof with a tarp, for example, and cover openings with plywood, plastic, or other materials."
    }
  ]
}