{
  "url": "https://www.wikihow.com/Turn-Off-Comments-on-Facebook-Post",
  "title": "4 Easy Ways to Disable Comments on Any Facebook Post",
  "steps": [
    {
      "title": "Sign in to Facebook on a computer.",
      "content": "Sign in to Facebook on a computer. If you want to block as many comments as possible on your personal Facebook posts, you can automatically hide comments that contain certain words. This won't affect existing comments, but it will drastically limit comments on new posts. [1] X Research source Comments that contain any of the keywords from your block list will remain hidden from people who view your profile. Only the comments that contain blocked keywords will be hidden. To hide as many comments as possible, block lots of simple keywords like \"the,\" \"and,\" \"an,\" \"hi,\" \"wow,\" \"cool,\" etc. You can block up to 1000 words (2 or more characters per word) and/or emojis. Comments containing blocked keywords will still be visible to you, the person who posted the comment, and any of their friends."
    },
    {
      "title": "Click the menu icon and select Settings & Privacy.",
      "content": "Click the menu icon and select Settings & Privacy . The menu icon is the upside-down triangle at the top-right corner of Facebook. [2] X Research source There's no option to add to your keyword block list unless you're using a computer."
    },
    {
      "title": "Click Settings on the menu.",
      "content": "Click Settings on the menu. It'll be on the right side of the screen. [3] X Research source"
    },
    {
      "title": "Click Profile and Tagging.",
      "content": "Click Profile and Tagging . It's in the left panel. If you don't see this option, click Privacy and then Profile and Tagging . [4] X Research source"
    },
    {
      "title": "Click Hide comments containing certain words from your profile.",
      "content": "Click Hide comments containing certain words from your profile . It's near the top of the right panel."
    },
    {
      "title": "Add the keywords you want to block.",
      "content": "Add the keywords you want to block. Separate each keyword or emoji by a comma, or copy and paste a list of keywords from a text file into the field. [5] X Research source Facebook will automatically block variations of keywords you enter as well. For example, if you block the word you, Facebook instantly blocks #you , y.o.u. , and y0u ."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . All future comments containing any of the keywords you enter will now be hidden automatically. [6] X Research source If a comment slips through your filter, you can easily hide it by clicking the three dots on the comment and selecting Hide comment . Or, select Delete to delete it entirely."
    },
    {
      "title": "Go to your Facebook Group.",
      "content": "Go to your Facebook Group. If you want to disable comments on a post in a Facebook Group , it's super easy. You can easily turn off comments for any post you've created in a group. Group admins and moderators can also turn off comments for any post in the group. [7] X Research source You can turn off comments on Group posts from a computer, as well as using the Android, iPhone, or iPad mobile app."
    },
    {
      "title": "Click or tap the three dots on the post ••• .",
      "content": "Click or tap the three dots on the post ••• . You'll see this icon at the post's top-right corner. [8] X Research source"
    },
    {
      "title": "Click or tap Turn off commenting.",
      "content": "Click or tap Turn off commenting . This instantly prevents anyone from commenting on the post. [9] X Research source"
    },
    {
      "title": "Go to your Facebook Page.",
      "content": "Go to your Facebook Page. If you have a Facebook Page (usually used for businesses, public figures, and organizations) instead of a personal account, there's an easy and extremely effective workaround for blocking comments on any post you've created. This only works on posts you've already shared. So, when you create a new post on your Page, just return to your Page and complete these steps to disable comments. If you don't have a Page, you can still use an easy workaround to turn off comments on your personal account posts ."
    },
    {
      "title": "Click or tap the three dots on a post ••• .",
      "content": "Click or tap the three dots on a post ••• . Scroll to the post on which you want to disable comments, then click or tap the three dots at its top-right corner to open the post menu. [10] X Research source"
    },
    {
      "title": "Select Who can comment on this post?.",
      "content": "Select Who can comment on this post? . A list of three options will expand. [11] X Research source"
    },
    {
      "title": "Choose Profiles and Pages you mention.",
      "content": "Choose Profiles and Pages you mention . Choosing this option removes the ability for people to comment on this post unless you specifically tag their account or Page . [12] X Research source Another option is to choose Pages you follow , which limits comments to only the other Pages that your Page follows. If your Page isn't following other Pages, nobody will be able to comment."
    },
    {
      "title": "Select Done.",
      "content": "Select Done . Now nobody can comment on this post unless you've specifically mentioned them in the comment. You will need to repeat these steps on any post where you want to disable comments.”"
    },
    {
      "title": "Go to your Facebook Page.",
      "content": "Go to your Facebook Page. If you want to block comments for all new posts on your Page, you can automatically hide comments that contain certain keywords. While this won't affect your existing comments, but new comments will be drastically limited with this workaround. [13] X Research source Comments containing any of the words in your word list will be invisible to everyone except for you (and other Page admins/moderators), the person who made the comment, and that person's friends. To use this workaround to its fullest potential, block as many simple keywords as possible, including \"the,\" \"and,\" \"an,\" \"hi,\" \"wow,\" \"cool,\" etc. You can block up to 1000 words (2 or more characters per word) and/or emojis. If someone posts a comment that doesn't contain any words on your block list, their comment will be visible to viewers. This is why it's so important to add as many words to your block list as possible."
    },
    {
      "title": "Open the Comment Moderation section of your Page.",
      "content": "Open the Comment Moderation section of your Page. The steps to get there are a little different depending on whether your Page has been upgraded to the new page layout: Classic layout: Click Settings in the left panel of your Page, then click Content Moderation in the center panel. New layout: Click your Page photo at the top-right, select Settings & Privacy , then click Settings . Now, click Privacy in the left panel, select Public Posts , choose Hide comments containing certain words from your Page , and then click Edit . [14] X Research source"
    },
    {
      "title": "Add keywords to block.",
      "content": "Add keywords to block. When you add keywords (or emojis) to the block list, comments containing these keywords will not be visible on your posts. Separate each word or emoji with a comma. [15] X Research source If you have a list of keywords in a text file, you can copy and paste the list into the field. If the keywords you want to block are in a CSV file , click Upload from .CSV (you might have to click three dots first) and then choose the file. Facebook automatically blocks variations of the keywords you enter as well. For example, if you block the word you, Facebook instantly blocks #you , y.o.u. , and y0u ."
    },
    {
      "title": "Click Add or Save.",
      "content": "Click Add or Save . Now that you've added keywords to block, comments containing these keywords will not appear on future posts. [16] X Research source Since some comments can still sneak past your keyword restrictions, it's a good idea to also disable comments from everyone you don't specifically tag after sharing a new post. You can also hide individual comments manually by clicking the three dots on the comment and choosing Hide comment . [17] X Research source"
    }
  ]
}