{
  "url": "https://www.wikihow.com/Tell-Your-Parents-You-Started-Your-Period",
  "title": "How to Tell Your Parent(s) About Your First Period",
  "steps": [
    {
      "title": "Start a conversation with your mom.",
      "content": "Start a conversation with your mom. Approach your mother and simply state, \"I started my period.\" This will open the door to an honest conversation. Your mother might be really happy and excited, or she might have a neutral reaction to try to make the situation less awkward for you. Regardless, your mom will never be angry or disappointed. Once the subject has been broached, your mom will likely take over the conversation and help you with all you need to know. [1] X Research source Choose an appropriate time. If it needs to be done immediately, feel free to do so. Otherwise, choose a time that allows for a lengthy conversation. Sometimes it helps to write out a script ahead of time so you can approach the subject with confidence. For example, start by asking her how old she was when she first got her period. This will open up the floor for further discussion, and you can ask her any questions you have. The hardest part is gathering the bravery to get started. Just remember that you'll feel less stress when the conversation is over."
    },
    {
      "title": "Let her know any concerns or questions you have.",
      "content": "Let her know any concerns or questions you have. Remember, your mom has gone through this too. In fact, she may still be getting her period monthly. The important thing to keep in mind is that she understands, and she is there to help. If there’s anything you don’t understand about your period or anything you’re worried isn’t normal, tell her. She’ll be able to reassure you. [2] X Research source Your mom has the \"hands-on\" experience to answer any questions you may have. More than likely, your mom will be prepared with pads or tampons and will be more than happy to explain their differences and demonstrate the proper use."
    },
    {
      "title": "Write a note or send her a text.",
      "content": "Write a note or send her a text. Write a simple note stating something like \"Mom, I started my period\" or \"Can you buy me some tampons/pads?\" Place the note in a place where only she will find it, such as in her purse, her makeup kit, or her underwear drawer. Make sure the note or text is short and to the point so that there is no confusion. Be prepared for the response. Once you let your mom know about your period , she'll want to have a face-to-face discussion regarding it."
    },
    {
      "title": "Show her your underwear if you can’t find the words to explain.",
      "content": "Show her your underwear if you can’t find the words to explain. Change your underwear but don't wash them. Instead, call your mom to your room and show her the underwear. Having had a period before, she'll immediately recognize it and initiate the conversation about what happens next. You should be looking for discharge that is slightly pink, brown, or red. Don't be embarrassed to show your mom your underwear. She won't be grossed out—she's been there before. Blood will stain your underwear so immediately wash or soak your underwear to avoid staining ."
    },
    {
      "title": "Wait until you’re certain your period has started.",
      "content": "Wait until you’re certain your period has started. If you only have brown discharge, then wait for your period. By the time your period comes, you may already have a plan for how to tell your parents. It's also possible that it was a false alarm and your body is just preparing itself for your period . [3] X Research source Brown discharge before a period is normal. This could be a layer of nutrients being discharged before the actual menstruation."
    },
    {
      "title": "Take a deep breath and remember this is normal.",
      "content": "Take a deep breath and remember this is normal. Again, feeling nervous is a perfectly normal feeling. Just imagine how nervous your mom must have been when she had the conversation with her mom years ago. Try deep breathing and positive thoughts to help you cope with your nerves. [4] X Expert Source Rebecca Levy-Gantt, MPT, DO Board Certified Obstetrician & Gynecologist Expert Interview. 3 April 2020. To overcome nervousness, breathe in slowly through your nose and out through your mouth. Focus on taking 30 slow, deep, breaths and you should feel more relaxed afterwards. [5] X Research source Ask yourself, \"What's the worst that can happen?\" Remind yourself that many people have gone through this and survived. Gaining this perspective can help you to relax."
    },
    {
      "title": "Talk to someone you can trust if you don’t want to tell your mom.",
      "content": "Talk to someone you can trust if you don’t want to tell your mom. In some situations, parents aren't as supportive or understanding as one would hope. If this is the case, try talking to someone with whom you feel comfortable. For example, a school nurse, a teacher, or a friend's parent. [6] X Research source"
    },
    {
      "title": "Don't be embarrassed to tell your dad about your period.",
      "content": "Don't be embarrassed to tell your dad about your period. Remember, menstruation happens to lots of people; in fact, it even happens to some female animals. The important thing to remember is that the apprehension you are feeling will lessen over time. [7] X Research source Know that your dad is mature enough to handle \"the period talk.\" As an adult male, your dad not only knows what a period is, but has probably been expecting to have this talk with you for some time. Your dad may be slightly embarrassed as well. Take comfort in knowing that you're not the only one trying to get a handle on your emotions. Understand that your reaction is a normal one. Starting your period can be both confusing and emotional."
    },
    {
      "title": "Keep it simple.",
      "content": "Keep it simple. Sometimes the easiest way to approach the situation is to just say, \"Dad, I got my period.\" Keeping it brief and to the point will help you to avoid becoming emotional. Instead of building up to a big sit down conversation, try approaching the subject during down time such as when watching television or eating dinner. [8] X Research source By being direct, you avoid confusion and open the lines of communication between you and your dad. Your openness may ease his discomfort and he may become a valuable resource for information."
    },
    {
      "title": "Try a pre-made note online.",
      "content": "Try a pre-made note online. Sometimes it's easier to write words than to speak them. But what happens if you can't find the right words to say or write? There are scripted notes online that can be addressed to anyone and that allow you to ease into the topic. With titles like \"guess what\" or \"we need to talk\" it sends a clear message to dad without the awkward talk. The great thing about this option is that it informs your parent but puts the responsibility of initiating the conversation on them. A similar method is to text your dad about it. Be sure to put the note in a place where your dad is sure to find it, and make sure he'll find it at an appropriate time. Giving the note to him when he's running out of the house for work isn't the best option."
    },
    {
      "title": "Ask to talk to a female you both trust.",
      "content": "Ask to talk to a female you both trust. Sometimes it's just easier to talk to a female about female problems. If you don't have a mother or older sister around, tell your dad that you need to speak to a female about \"female issues\" you are experiencing. [9] X Research source Your dad may become curious or worried at this point. You can ease his curiosity by simply stating \"I started my period and I would rather talk to a woman about it.\" You can make your dad feel like part of the process by asking for his advice about who to go to for help."
    },
    {
      "title": "Ask him to schedule a doctor's appointment for you.",
      "content": "Ask him to schedule a doctor's appointment for you. As someone who is in charge of your healthcare, your dad will probably ask why you need to visit the doctor. At this point you can inform him that you are having a personal issue. This will either open the door to further communication or give your dad a clue that something is going on. [10] X Research source Your doctor is not only a great source of information, but they can also assist you in telling your dad about your period. A close alternative is the school nurse. You can always get period products from your school nurse while you're figuring out how to tell your dad. But don't hide it from him for too long. It is definitely something for which you don't have to be ashamed."
    },
    {
      "title": "Talk to someone else.",
      "content": "Talk to someone else. What happens if your dad isn't someone you can trust or if he is embarrassed by the situation? You can always choose to confide in a trusted confidant like a family friend, relative, or a trusted neighbor. [11] X Research source"
    },
    {
      "title": "When you start your period, clean up as soon as possible.",
      "content": "When you start your period, clean up as soon as possible. If you started your period unexpectedly, chances are you've made somewhat of a mess. If you are at home, shower and change your underwear. If you are in public and can't get home immediately (for example at school), try cleaning yourself as best as possible with wet wipes and/or toilet paper. As you are getting used to your period, it might be a good idea to carry extra supplies (underwear, pads, wet wipes) in your backpack or purse. If you start your period at school , go to the bathroom as soon as possible. If you need supplies, ask a teacher, the school nurse, or a trusted friend. Don’t be embarrassed! Odds are, they’ve been in a similar situation at least once. Periods usually last anywhere from 2-7 days. While some individuals get their period every 28 days, others' cycles range anywhere from every 21-45 days."
    },
    {
      "title": "Determine your flow.",
      "content": "Determine your flow. Your flow refers to how light or heavy your blood flow is during your cycle. The number of pads and tampons used per day is in direct correlation to your flow. Over time, you should begin to recognize how light or heavy your flow is in order to be prepared for your cycle. [12] X Research source Light flow usually occurs at the beginning and end of your period. Heavy flow is identified as bleeding which requires you to change your pad or tampon hourly. Blood clotting is also common during a heavy flow. This is when you see \"blobs\" of blood that are darker in color. Knowing your flow will help you in purchasing the correct period products."
    },
    {
      "title": "Use a pad to absorb the blood and prevent leaks.",
      "content": "Use a pad to absorb the blood and prevent leaks. A pad is a thin pad that consists of absorbent material. Place the pad in the lining of your underwear to absorb the blood flow. It has an adhesive side to keep it in place. [13] X Expert Source Rebecca Levy-Gantt, MPT, DO Board Certified Obstetrician & Gynecologist Expert Interview. 3 April 2020. Pads come in various lengths to account for the direction of blood flow while doing different activities (working out, sleeping, etc.). Pads also come in various thicknesses to account for light through heavy flow. Some pads have \"wings\" to secure the pad in place and to stop accidental leaks."
    },
    {
      "title": "If you’re comfortable, use a tampon for a less messy option.",
      "content": "If you’re comfortable, use a tampon for a less messy option. Tampons are made of cylindrical shaped absorbent material that is inserted into your vagina to absorb blood flow. Most come with an \"applicator\" that assists in inserting the tampon into the vagina. They come in various forms that allow for different levels of comfort and absorption. [14] X Expert Source Rebecca Levy-Gantt, MPT, DO Board Certified Obstetrician & Gynecologist Expert Interview. 3 April 2020. If you're new to tampons, try a slender fit until you get the hang of it. They're not as effective against heavy flows but they may be more comfortable. Applicators come in both plastic and cardboard form. Some have rounded tips and some don't. As a beginner, a plastic applicator with a rounded tip may work best. It's best to try using a tampon for the first time when your flow is medium to heavy. This will allow the tampon to slide in more easily, and to be pulled out more easily later. [15] X Research source Some people prefer to use tampons for activities such as playing sports or swimming. You can be a virgin and still use a tampon. Using tampons has nothing to do with being sexually active."
    },
    {
      "title": "Choose a reusable period product.",
      "content": "Choose a reusable period product. These days, there are plenty of alternative period products in addition to traditional pads and tampons. Try period underwear , reusable pads , or menstrual cups for an eco-friendly option. [16] X Research source Period underwear and reusable pads are similar to regular pads. They’re made of absorbent material to avoid leaks, and can be washed in the washing machine with the rest of your clothes. Using menstrual cups is similar to using tampons. The cup is made of flexible material like rubber or latex, which you fold and insert into your vagina."
    },
    {
      "title": "Change your products every few hours.",
      "content": "Change your products every few hours. Once the period blood leaves the body, it is more likely to become contaminated. In addition, when these organisms remain in a warm, damp, place it's more likely to lead to infection or an unpleasant odor. [17] X Research source Be sure to pay especially close attention to your hygiene during your cycle by changing your pad/tampon often and showering daily. Even if your pad isn't \"full,\" try to avoid going the entire day without changing it. The standard for pads is once every 4-6 hours and once every 2 hours for tampons. Blood can often enter small spaces like the skin around your vagina or legs. Be sure to wash off excessive blood when possible to avoid build-up and odor. Discard your period products properly. Wrap your disposable pads in the pad wrapper or tissue paper before discarding in the trash. Check your tampon applicator to see if it is flushable or if you should wrap it and discard it in the trash."
    }
  ]
}