{
  "url": "https://www.wikihow.com/Win-a-Fight-in-Under-30-Seconds",
  "title": "How to Win a Fight in Under 30 Seconds",
  "steps": [
    {
      "title": "Take a few seconds to evaluate the situation.",
      "content": "Take a few seconds to evaluate the situation. This can make all the difference in winning. Thinking rationally, even for a few seconds, will help you to remain calm so that you can fight with your mind as well as your body. Determine whether your opponent seems to be angry (at you or just in general), looking for a fight, mentally ill, or drunk. This information can help you decide the best way to quickly end the fight. Before you decide how to fight (or flee), evaluate your opponent's size and strength. Keep in mind the old adage that \"The good big man beats the good little man.\" [1] X Research source This doesn't mean that you can't win a fight against an opponent who is larger and stronger than you, but it does mean that you should take these factors into account."
    },
    {
      "title": "De-escalate anger.",
      "content": "De-escalate anger. If your opponent is yelling, threatening you, or throwing things, but has not yet attacked you physically, you may be able to de-escalate the situation and avoid a fight altogether. You must remain calm yourself. Responding to anger with anger will only make the situation worse. Tell your opponent you want to hear what he has to say. Listen carefully. If your opponent is in pain or upset, listening quietly may calm them down."
    },
    {
      "title": "Be wary of unpredictable opponents.",
      "content": "Be wary of unpredictable opponents. If your opponent is acting irrationally and unpredictably - such as someone who is drunk or mentally ill - it will be more difficult to de-escalate, but it can be done. An opponent who is impaired might not really want to fight you once he's calmed down. This may influence your decision about whether to fight or to try to de-escalate the situation. To try to help someone who is impaired to calm down, listen to the person, agree with whatever he says, and then tell him what you want him to do (e.g. sit down, leave). The key is to repeat the loop as many times as it takes - even a dozen times. This technique fails if you give up too soon. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Avoid your opponent's first attack.",
      "content": "Avoid your opponent's first attack. If he is rushing at you or throwing a punch, move to the side, then push him down from behind when he has passed you. If the opponent is not a lot bigger than you, you can try sticking your leg in front of him and then pushing him to trip him. This technique uses the opponent's momentum against him. You must remain calm and move quickly to get out of the way. Your instincts to avoid a punch or kick should help, but be aware that you may also 'freeze'. When you push your opponent, try to thrust away from the ground with your legs and follow through with your arms to deliver the most force possible."
    },
    {
      "title": "Don't fight the way your opponent wants to.",
      "content": "Don't fight the way your opponent wants to. Most people will tend to use one style of fighting - punching, grappling, kicking, etc. Don't engage with the same technique. If your opponent punches, try to drag him to the ground. If your opponent seems to want to tackle you, try to stay on your feet."
    },
    {
      "title": "Fight dirty.",
      "content": "Fight dirty. Fighting techniques such as Krav Maga encourage explosive attacks against the opponent's weakest points. Hit soft, weak parts of your opponent's body (toes, groin, stomach, face, side of the neck) with hard, strong parts of your body (your heel, knee, elbow, heel of your hand, top of your head). [3] X Research source Stomp on your opponent's toes. Kick or punch his groin, the top of his stomach (solar plexus), or the belly button area (diaphragm). Gouge your opponent's eyes, or punch him in the nose, chin, or jaw as hard as you can. If you are being attacked and have access to anything that can be used as a weapon, use it. You can throw things, such as keys or sand, gravel, or dirt, as well as using things as weapons. [4] X Research source You have a right to defend yourself in any way you can. Just keep in mind this doesn't extend to attacking."
    },
    {
      "title": "Trick your opponent.",
      "content": "Trick your opponent. If you are good at bluffing or acting, you may be able to trick your opponent into making the fight easier for you. Adopt a martial-arts style stance and put your fists up in front of your face to encourage your opponent to do the same. If your opponent is not a trained fighter, he may mimic your stance, which puts you in control of the fight. Bluff a kick from the side. Make it look like you're going to kick your opponent in the shin. Instead, deliver a strong punch to his face, solar plexus, or diaphragm. Avoid the temptation to look down at your leg, which may telegraph your plan to your opponent. If your opponent does not mimic you, this may tell you that he has some training or practice as a fighter."
    },
    {
      "title": "Use the techniques of the ultimate fighters.",
      "content": "Use the techniques of the ultimate fighters. In the history of the Ultimate Fighting Championship, 8 fights have ended in 10 seconds or less. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You probably don't have the training that these fighters did, but that doesn't mean you can't try to copy or borrow their techniques. Professional mixed martial arts fighters train in multiple fighting techniques, including boxing, wrestling, and several types of martial arts. Professional fighters train full-time for years to be able to fight effectively."
    },
    {
      "title": "Begin with a sudden, strong punch.",
      "content": "Begin with a sudden, strong punch. This approach, popular among UFC fighters, can stun your opponent and knock him down. Knowing the proper way to punch can make the difference between you hurting your opponent and you hurting your hand. Make sure your thumb is on the outside of your fist. Punch with your knuckles - particularly those of your index and ring fingers - and keep your wrist straight. This will deliver a more effective punch and will also make it less likely that you will break any bones in your hand. [6] X Research source While UFC fighters like Gray Maynard, James Irvin, and Todd Duffee took out their opponents by throwing punches to the head [7] X Research source [8] X Research source [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source , less trained fighters may have better luck landing a strong punch by aiming for the throat, sides of the neck, or ribs. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Even though some fighters such as Ryan Jimmo have knocked opponents out with one blow [11] X Research source , keep in mind that single-punch knockouts are extremely rare, even in professional boxing and mixed martial arts (MMA)."
    },
    {
      "title": "Start with a kick.",
      "content": "Start with a kick. British kickboxer Mark Weir beat his opponent, Eugene Jackson, by kicking him and then following up with a perfectly timed punch to the mouth. Jackson fell, ending the fight in 10 seconds. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Don't copy Jackie Chan. A low, strong kick to the knee or shin is much faster and more effective than a high kick to the head. Aim the side of your foot toward the side of your opponent's knee - this will help you maintain your balance while doing maximum damage. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source One advantage to kicking is that it keeps you farther away from your opponent, thereby making it harder for him to hit you. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}