{
  "url": "https://www.wikihow.com/Write-a-Letter-of-Congratulations",
  "title": "How to Write Congratulation Letters: Personal & Professional Tips",
  "steps": [
    {
      "title": "Come up with an appropriate salutation to start your letter.",
      "content": "Come up with an appropriate salutation to start your letter. Start with “dear” followed by the recipient’s name and a comma for a standard opening. If you’re writing a formal letter of congratulations to a coworker or peer, you may want to simply start with their name alone. Feel free to play around with a short exclamation or intimate salutation if you’re writing a letter to a close friend or family member. [1] X Research source Always add a comma after your salutation, unless your salutation ends in an exclamation point. A good formal salutation may be, “Dear John,” or simply “John.” Creative salutations could be, “I’ve just heard the good news!” or “It’s been a long journey, but you’ve finally made it!”"
    },
    {
      "title": "Begin with a general statement of congratulations for a standard opening.",
      "content": "Begin with a general statement of congratulations for a standard opening. For a formal letter of congratulations, begin with some basic celebratory statements. Say, “I want to congratulate you on your recent promotion,” or “I was ecstatic when I heard the good news about the birth of your child.” [2] X Research source Another general statement of congratulations could be, “Job well done! You’ve worked hard and it has finally paid off,” or, “Cheers on the new job.”"
    },
    {
      "title": "Start with pride or encouragement if you know the addressee well.",
      "content": "Start with pride or encouragement if you know the addressee well. If you’re writing your letter to a close friend or family member, feel free to start by telling the addressee how proud you are of them. Be as direct and supportive as you can. Say something like, “I am so proud of you and everything that you have done to reach your goals.” Follow it up with an encouraging statement like, “I know that you’re going to go on to do big things in your new position.” [3] X Research source Say, “I want to take a moment to point out how proud I am of you,” or “I hope that you get everything you want in your new role.” Don’t use too many exclamation points. They will lessen the impact of your letter if you use them more than once or twice."
    },
    {
      "title": "Place the emphasis on the achievement if you’re not close to the addressee.",
      "content": "Place the emphasis on the achievement if you’re not close to the addressee. Avoid talking about your feelings about an achievement or event if you don’t know the addressee very well. Instead, focus on the achievement itself by speaking in slightly broader terms. [4] X Research source Say something along the lines of, “Becoming a father is a momentous event in life and you’re going to make an excellent dad,” or, “Graduating college is a big step towards becoming an adult, and you have a lot to look forward to.”"
    },
    {
      "title": "Focus on your feelings if you’ve known the recipient a long time.",
      "content": "Focus on your feelings if you’ve known the recipient a long time. If you have a deep connection with the person that you’re writing to, feel free to emphasize your feelings about an achievement or event. Your close friend of family member will feel a sense of pride knowing that they’re making their loved ones happy. [5] X Research source Say something like, “I am so happy to see how you’ve developed over the years and I can’t wait to see what you do with your new degree,” or, “I almost broke down in tears of joy when I heard about Danny’s birth.”"
    },
    {
      "title": "Talk about how the addressee has grown over time.",
      "content": "Talk about how the addressee has grown over time. If you’re sending a formal letter of congratulations, emphasize the person’s professional growth by commenting positively on how far they’ve come. Personal comments should emphasize your perspective to avoid being presumptuous. In a formal letter, comments could include details about their starting position at a company or general information about major milestones. [6] X Research source Formal examples include, “You started out as a mail clerk and now your talent and hard work is paying off. You’ll make an excellent the head of sales.” or, “Becoming a mother is one of the biggest milestones in a person’s life. You’re going to be great at it.” Personal examples include, “I remember when you were struggling through 4th grade math, and now you’ve got a degree in physics!” or, “I remember how my heart filled with love when I used to hold you as a baby. Now you’re going to get to experience all of that with your child.”"
    },
    {
      "title": "Include a personal anecdote if you want to offer advice.",
      "content": "Include a personal anecdote if you want to offer advice. If you’re older than the addressee and want to add a personal note of encouragement, include it as a short aside. This applies mainly to major life events that you’ve experienced, although you could do it if you’ve held a similar professional position. Say, “When I started out as a doctor, I wish someone would have told me to always thank the nurses,” or, “I know that becoming a father can be overwhelming, but you can’t let your fears guide your decision making.”"
    },
    {
      "title": "Close with a formal note of encouragement if it’s a professional letter.",
      "content": "Close with a formal note of encouragement if it’s a professional letter. If you don’t know the person that you’re congratulating particularly well, you should finish your letter with a general note of encouragement. If you get too personal, it could come off as presumptuous or unprofessional. [7] X Research source Simple statements like, “I wish you well at your new position,” or, “I hope that you enjoy your new career as a teacher” are appropriate for the end of your letter."
    },
    {
      "title": "Include a note of support and affection if you’re close to them.",
      "content": "Include a note of support and affection if you’re close to them. If you’re writing to a close friend or family member, finish your letter with an intimate note of support. Feel free to get a little sentimental and emotional, as this is the moment in the letter that you’ve been building up to with general statements, anecdotes, or memories. Say, “I feel so much joy knowing that you’re becoming the person that I always knew you could be,” or, “You have no idea how happy I am that you’re engaged. It means the world to know that you’ve found your special someone.”"
    },
    {
      "title": "Wish the addressee luck if they’re starting out on a new journey.",
      "content": "Wish the addressee luck if they’re starting out on a new journey. If the person that you’re writing to is starting something that will come with some challenges, like a big move or new career, wish them luck. They may need the encouragement if they’re apprehensive or nervous. Focus on the positive outcomes to reinforce the sense of joy that you’re trying to create in your letter. [8] X Research source Say, “There will be challenges ahead, but I’m sure that you’re up for the task,” or “I can’t wait to see what you do next. If you ever need anything, feel free to reach out to me.”"
    },
    {
      "title": "Choose an appropriate closing before signing your name.",
      "content": "Choose an appropriate closing before signing your name. If you’re writing a letter of congratulations to a coworker, teacher, or acquaintance, finish your letter by writing, “Sincerely” or, “Best wishes” before signing your name. Write, “With love” or, “Thinking of you always” If you know the addressee well or you’re related to them. [9] X Research source It’s appropriate to use the word “love” when closing a letter addressed to a relative, even if you don’t know them very well. If you’re writing a congratulatory note on behalf of a group of people, have all of them sign it."
    },
    {
      "title": "Send your letter as soon as you can.",
      "content": "Send your letter as soon as you can. If you wait too long to send your letter, it won’t have the same emotional impact on the reader. Try to send a congratulatory note within 1-3 days of the event or experience that you’re celebrating. [10] X Research source"
    },
    {
      "title": "Write personal letters by hand and email formal letters.",
      "content": "Write personal letters by hand and email formal letters. If it’s going out to a close friend or family member, write your letter out by hand to give a personal touch. If you’re sending a congratulatory letter to a coworker or professional associate, you probably want to email it to avoid crossing any professional boundaries. Use blue or black ink to handwrite a letter if you want it to give it a classic look, but feel free to play around with different color pens if you want to keep it light."
    },
    {
      "title": "Hand them your letter in person to add a personal touch.",
      "content": "Hand them your letter in person to add a personal touch. If you see the person that you’re writing regularly, consider handing them your letter in person. Tell them how proud and happy you are as you’re handing it to them. This will give your letter a more powerful impact and will make it more meaningful to the person reading it. [11] X Research source"
    },
    {
      "title": "Send the letter along with a gift to show appreciation.",
      "content": "Send the letter along with a gift to show appreciation. If the person that you’re writing to has helped you out in your career or personal life, consider sending your letter alongside a small gift. Chocolates, bottles of wine, or small mementos are excellent gifts that don’t cost a lot of money. The gesture may make your letter stand out a little more as well if they’re receiving multiple letters of congratulations. [12] X Research source If you’re sending a congratulations letter to someone who is getting married, it is customary to send them a gift or money. If you’re writing a congratulatory letter to someone that has just had a child, consider sending baby toys or clothes along with your letter."
    }
  ]
}