{
  "url": "https://www.wikihow.com/Treat-Dry-Gangrene",
  "title": "How to Treat Dry Gangrene",
  "steps": [
    {
      "title": "Stop smoking",
      "content": "Stop smoking . Kicking this habit can help prevent gangrene and its escalation as smoking contributes to the slow blockage of blood supply to the blood vessels. When the blood stops flowing, tissues die, and that's when gangrene can set in. Anything that cuts off circulation needs to be avoided, and this certainly includes smoking. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source The active ingredient in cigarettes, nicotine, is what greatly affects the blood vessels. It constricts the blood vessels, therefore resulting in less blood flow. If a body part has less blood flow, it will also have less oxygen. The prolonged lack of oxygen in body tissues causes it to become necrotic tissue (dead tissue), which can lead to gangrene formation. Smoking is also associated with a number of vascular disorders that can cause the narrowing and hardening of blood vessels. It is advisable to gradually stop smoking rather than suddenly all at once because it can result in intense withdrawal symptoms, which in turn make it difficult to stay committed to quitting. Ask your doctor to help you quit smoking."
    },
    {
      "title": "Modify your diet.",
      "content": "Modify your diet. With gangrene, tissue and muscle are damaged due to poor blood circulation. Therefore, it is advisable to eat foods high in protein and calories in order to aid in muscle and tissue repair. Protein can also help re-build damaged muscles, while nutrient-rich (rather than the empty calories of junk food) give your body energy to undertake the processes it needs to function. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Foods high in protein but low in fat, so as to avoid clogging up your arteries, include turkey, fish, cheese, lean pork, lean beef, tofu, beans, eggs, and peanuts. Avoid fatty foods like red meat, butter, lard, hard cheese, cakes and biscuits, and fried food. Try instead to incorporate more dark, leafy green vegetables into your diet. [4] X Research source"
    },
    {
      "title": "Include foods high in germanium and other antioxidants in your meal plan.",
      "content": "Include foods high in germanium and other antioxidants in your meal plan. Germanium is an antioxidant and is believed to increase oxygen function in the body, though much of the evidence at present remains anecdotal. It also enhances the immune system and has anti-cancer properties. Foods high in germanium include garlic, onions, shiitake mushrooms, whole wheat flour, bran, ginseng, green leafy vegetables, and aloe vera. Because of the lack of firm scientific evidence for germanium as a means of circulating oxygen to the tissues when a person has dry gangrene, there are no recommended dosages or amounts to ingest. Talk to your doctor to get his opinion on whether consuming more germanium might be helpful in your particular case."
    },
    {
      "title": "Watch your sugar intake.",
      "content": "Watch your sugar intake. Although watching how much sugar you consume is important for everyone, it's especially key for diabetics. People with diabetes should lessen their sugar consumption to keep their levels at the level based on their eating schedule, exercise routine, and time of day. They should also check their extremities for any signs of cuts, redness, swelling or infection on a regular basis. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Those with diabetic neuropathy should assess themselves daily for any symptoms of numbness in arms, legs, fingers and toes because these are signs of ineffective blood circulation. High sugar intake correlates with high blood pressure, which adversely affects normal blood flow in the blood vessels."
    },
    {
      "title": "Limit alcohol intake.",
      "content": "Limit alcohol intake. Heavy drinking beyond the recommended daily limits can cause a spike in blood pressure as well as increase the amount of cholesterol in your blood, which in turn can lead to blockages in blood flow. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Women should limit themselves to one drink per day and men to a maximum of two drinks per day. Be aware that a single drink is considered one beer (12 oz), one glass of wine (5 oz) or one mixed drink containing 1.5 oz of liquor. [7] X Research source"
    },
    {
      "title": "Get exercise.",
      "content": "Get exercise. Although the effects of exercise on developing and treating dry gangrene are not exactly known, exercise can alleviate some of the underlying conditions that lead to dry gangrene. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, one study found that an exercise program of supervised walking on a treadmill for 30 to 40 minutes three to four times a week improved symptoms of claudication, or painful cramping in the legs, due to the leg muscles not getting enough blood flow. [9] X Research source Jeffrey Berger MD, MS FAHA, William R Hiat MD. FAHA, Peripheral Arterial Disease: Medical Therapy in PAD Circulation 2012 126 491-500. Consider undertaking a moderate exercise regime at home, either walking on a treadmill or in your neighborhood as directed above. Keep a walking diary to log your workouts and any symptoms or feelings you may experience. Consult your physician before beginning any exercise regimen if you have any heart or other pre-existing conditions."
    },
    {
      "title": "Do limited limb-specific exercises.",
      "content": "Do limited limb-specific exercises. If you cannot move independently, do passive range-of-motion exercises. These exercises require someone to assist you in moving your joints in a full range of motion on a regular basis to prevent muscle contracture (permanent shortening of joints and muscles) and to improve blood supply in a specific body part. These exercises include: Head exercises, such as head turns, tilts and chin-to-chest movements. Shoulder and elbow exercises such as elbow bends, up and down, side to side movements. Forearm and wrist exercises, such as wrist bends, and rotation and up and down movements Hand and finger exercises, such as finger bends, finger spreads, and finger rotations. Hip and knee exercises, such as bending the hip and knee, side to side leg movements, and leg rotations. Ankle and foot exercises, such as ankle bends, rotations, side to side movements, toe bends, and toe spreads."
    },
    {
      "title": "Treat any wounds.",
      "content": "Treat any wounds. Sores or burns must be given attention immediately, especially when they occur on people with diabetes, as these can result in a non-healing wound. Regardless of whether you already have gangrene or are worried about developing it, the most important thing is to keep the wound clean and protected while the body attempts to build a capillary bed underneath the scab, or eschar. Follow these steps: [10] X Research source Clean the wound with betadine or peroxide and then apply prescribed antibiotic cream. After cleaning thoroughly, cover the wound with sterile gauze bandages and with a clean cotton sock. Cotton can remove moisture away from the wound by absorbing it and also promotes air circulation that can aid in healing."
    },
    {
      "title": "Apply cayenne, garlic, honey, or onions to wounded areas.",
      "content": "Apply cayenne, garlic, honey, or onions to wounded areas. A cayenne tincture, a liquid extract made of cayenne, will help alleviate the pain, increase the functioning of your circulation system, and reduce your risk of developing infection. You can buy cayenne tincture from any local pharmacy nearest you. Apply it to affected areas for two to three times daily or as advised by your doctor. You could also smash up a few cloves of garlic and apply it directly to the wound. This was a standard treatment during World Wars I and II as garlic has both antimicrobial properties to prevent or treat infection for gangrene and anti-platelet properties that help break up the blood clots that are causing the gangrene. [11] X Research source Singh, Papu, Singh Javier, Singh Sweta et al, Greener Journal of Agricultural Sciences, Volume 4 (6) pp 265-280) July 2014. Alternatively, apply a bandage of sliced onions in affected areas. To do this, you can slice one onion and bandage it to the affected area using a clean cloth. Let it stay for five to 10 minutes and do it several times in a day. This will improve circulation on the affected area. Try applying honey to the wound. Honey has long been used on burns, wounds, and ulcers. Research is ongoing, but honey has been shown to have antibacterial properties. Make sure you use a sterilized, laboratory-tested honey. Spread honey on a dressing or bandage and then apply it to directly the wound. You can also find pads pre-impregnated with honey. [12] X Trustworthy Source DermNet NZ Online clinical resource website written and run by dermatologists providing evidence-based information about dermatology and skin health Go to source"
    },
    {
      "title": "Undergo surgery to remove the dead tissue.",
      "content": "Undergo surgery to remove the dead tissue. Surgical procedures are done if gangrene has progressed severely and the dead tissue needs to be removed. How much dead tissue needs to be removed typically depends on how much blood is reaching the area and where. This is the standard treatment for dry gangrene. The surgical procedures that can help are the following: [13] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Skin debridement — This surgical procedure is done by removing the affected tissue rotted by the gangrene. Sometimes the skin is replaced it with other healthy skin tissue (called a skin graft). Amputation — If there is total tissue death and other medical and surgical procedures can no longer save the affected area, the limb or other body part may have to be amputated to prevent gangrene from spreading to nearby areas and other parts of the body. This surgical intervention is done when skin debridement can no longer help. Be aware that in most cases, unless your life is at risk, the decision to amputate will only be made after a full consultation with your doctor where you can get all the information you need to make an informed choice. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Consider maggot therapy.",
      "content": "Consider maggot therapy. As an alternative to surgery, maggot therapy is also an option that similarly works to remove dead tissue. In this non-surgical treatment, maggots from fly larvae are placed on top of the gangrene-affected area and then covered with gauze. The maggots feed on the dead tissue and, fortunately, ignore healthy tissue. Maggots are also useful in fighting infection because they release substances that kill bacteria. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source There is some research suggesting that this treatment with maggots may be more effective than surgical debridement. However, most people are too fearful or hesitant to try this non-surgical alternative because of its \"icky\" nature."
    },
    {
      "title": "Undergo hyperbaric oxygen therapy.",
      "content": "Undergo hyperbaric oxygen therapy. This is an alternative treatment wherein you are placed in a special chamber filled with pressurized air. Then, a plastic hood is placed over your head for you to inhale pure oxygen. Although it may sound a bit intimidating, it is an effective therapy that delivers high levels of oxygen into your blood, provides oxygen to the affected areas, and improves blood supply and flow. The blood will reach the gangrene-affected areas even among patients with poor blood supply. [16] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source When enough oxygen is supplied to affected areas, your risk of amputation is reduced. Research has indeed confirmed hyperbaric oxygen therapy to be effective in treating foot gangrene related to diabetes and in reducing the risk of amputation. Be sure to discuss whether hyperbaric oxygen therapy would be a good fit for you."
    },
    {
      "title": "Restore blood flow through surgery.",
      "content": "Restore blood flow through surgery. The main surgeries to restore blood flow are bypass surgery and angioplasty. Studies have suggested that both surgeries are equally effective in restoring blood flow and decreasing the need to amputate. Angioplasty does, however, have a shorter recovery time, although bypass seems to be more effective in the long-term. Consult your physician about which surgery would be best for your specific condition and medical history. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Bypass surgery - In this surgical operation, the surgeon redirects the flow of blood by \"bypassing\" the blockage. The surgeon will connect one of your veins to a healthy part of one of your arteries using a grafting technique. Angioplasty - An angioplasty involves a tiny balloon being placed into a very narrow or blocked artery. The small balloon is then inflated to widen and open the vessel up. In some cases, the surgeon may also place a metal tube, called a stent, into the artery to keep it open."
    },
    {
      "title": "Take medication to reduce blood clots.",
      "content": "Take medication to reduce blood clots. Your doctor may also want to prescribe you anticoagulants in order to reduce blood clotting and thereby improve blood flow. One such anticoagulant is warfarin, which is usually taken orally (2 to 5 mg) once a day (at the same time every day) in tablet form. Warfarin inhibits and interferes with vitamin K, which slows the clotting of the blood. This results in thinning of the blood, making the blood circulation more efficient. [18] X Research source Keep in mind that taking anticoagulants will make you more likely to bleed and that you may not be able to take these medications if you have a history of bleeding problems (such as hemophilia), cancer, kidney or liver disease, heart disease or high blood pressure, among others. Always consult your doctor before taking any medication that affects your blood's ability to flow and clot as normal."
    },
    {
      "title": "Treat any infection.",
      "content": "Treat any infection. Antibiotics are typically given to patients whose gangrene is caused by an infection or to those patients for whom the development of an infection is feared due to an open or poorly healing wound. Often, physicians prescribe antibiotics to a patient with dry gangrene post-tissue removal surgery so as to prevent infection of the remaining tissue. Common prescribed medicines include: [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Penicillin G — This was for a long time the antibiotic drug of choice for gangrene. Typically 10-24 million units per dose (usually every six to eight hours) are given through intravenous (vein access) or intramuscular (muscle access) injection. Penicillin G has bacteriostatic effect which inhibits or prevents the reproduction and growth of the bacteria. Injections are generally preferred for severe infection or for patients having surgery, because they enable larger doses to be administered and reach the affected region more quickly than oral variants. Now, a combination of penicillin and clindamycin, a protein inhibitor, is commonly prescribed. [20] X Research source Clindamycin — This drug treats and prevents infection through its bactericidal effect, which kills the bacteria by blocking the protein production process in the bacteria. Without these proteins, the bacteria cannot survive. The usual dose is 300-600 mg orally every six to eight hours or 1.2 grams intravenously twice a day. [21] X Research source"
    },
    {
      "title": "Start supportive care.",
      "content": "Start supportive care. Surgical wound care is usually provided by your patient program after surgery. It is essentially rehabilitation therapy to regain normal functioning of the affected finger, toe, arm or leg. Part of rehabilitation therapy is performing isotonic exercises in order to maintain function of the affected area. [22] X Research source These exercises move the joints together with the muscles in the arms and legs. Isotonic exercise includes: Brisk or leisure walking Cycling Dancing Skipping"
    },
    {
      "title": "Know the causes of dry gangrene.",
      "content": "Know the causes of dry gangrene. Dry gangrene may be the result of the following factors: [23] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Diabetes — This condition impedes blood flow, especially in the lower extremities, and can lead to a non-healing wound. [24] X Research source Vascular problems — Vascular problems, such as peripheral arterial disease (PAD), can reduce blood supply in the body. PAD, for example, occurs when the arteries of the heart or body narrow mainly due to atherosclerosis, which hardens the arteries and blood vessels. [25] X Research source Vasculitis — Vasculitis refers to a number of autoimmune conditions that cause the blood vessels to become inflamed, such as Raynaud's phenomenon. In this autoimmune disease, the blood vessels chiefly to the fingers and feet temporarily spasm (called a vasospasm), which in turn causes vasoconstriction, or a narrowing of the blood vessels. Triggers for Raynaud's include exposure to the cold and emotional stress. [26] X Research source HD Solomon MD Raynaud’s phenomenon, Cardiovascular Journal of Africa, 2011 Oct (5) 233. Tobacco addiction — It can cause blockage of arteries and thus impair blood flow. External injuries — Burns, accidents, wounds and surgeries can damage certain cells in the body which later on slows down blood supply. If the wounds are not treated appropriately and a major blood vessel is damaged or compromised, the vessel can no longer supply adequate blood to the surrounding tissues. This leads to inadequate oxygen supply to the affected body part and, as a result, the tissues surrounding it dies. Frostbite — Exposure of extremities to very cold temperatures may block usual blood flow. In temperatures of freezing weather frostbite can occur in as little as 15 minutes. Frostbite principally affects the fingers and toes. For prevention, you can wear appropriately lined gloves and shoes to provide warmth and protection from moisture. Infection — An untreated bacterial infection may consequently take over the affected tissue, resulting in its death and leading to gangrene. This is more common in wet gangrene."
    },
    {
      "title": "Understand the different types of gangrene.",
      "content": "Understand the different types of gangrene. Gangrene may be classified into different categories, including: [27] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Dry gangrene — This type is characterized by dry and withered skin with a brown to purplish-blue to black color. It usually grows slowly and the tissue eventually sloughs off. Dry gangrene can lead to wet gangrene if it becomes infected. Wet gangrene — Common features of wet gangrene include swelling, blistering and a wet look in the affected tissue due to the release of discharge. Wet gangrene develops after an infection in the affected tissues. This type of gangrene needs urgent treatment because it multiplies quickly and can be very harmful. Gas gangrene — This type of gangrene is a subtype of wet gangrene. In this condition, the surface of the skin of an affected individual primarily appears normal, but as the condition advances, it may turn pale, then gray to a purplish-red color. A bubbly appearance to the skin may also become noticeable and a crackling sound may be audible when the affected area is pressed. This is due to an infection by a gas producing organism, Clostridium perfringens , which causes tissue death via gas. Noma gangrene — This condition is a rapidly progressive form of gangrene that primarily affects the mouth and face. This type of gangrene develops mainly in malnourished children living in poor hygienic conditions. Internal gangrene — This occurs when blood flow to internal organs such as the intestines, gallbladder or appendix are clogged. It often results in fever and sharp, rigorous pain. If left untreated, this can be lethal. Fournier’s gangrene — This is very uncommon since it involves the genital organs and the urinary tract. It is more common in men than in women. [28] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Progressive bacterial synergistic gangrene or Meleney’s gangrene — This is a rare gangrene type that occurs after an operation and is accompanied by painful skin lesions that break out after one to two weeks following surgery. The pain is sharp and itching."
    },
    {
      "title": "Know the symptoms of dry gangrene.",
      "content": "Know the symptoms of dry gangrene. Dry gangrene is a serious condition that needs immediate and effective treatment. Any individual experiencing any of the following symptoms must see a doctor urgently to avoid further complications: [29] X Research source Numbness and coldness in the affected area and a shriveled appearance to skin Claudication, or cramping (such as in the legs while walking) \"Pins and needles\" sensation, a stinging, tingling or itching pain Discoloration of the affected area (the area may be red, pale, purple, and progress to black if not treated) Dryness of the affected area Pain Septic shock (low blood pressure, possible fever, confusion, lightheadedness, shortness of breath). Septic shock is considered a medical emergency and requires immediate medical attention. This is rare with dry gangrene, but could happen if not treated appropriately."
    },
    {
      "title": "Seek immediate medical treatment.",
      "content": "Seek immediate medical treatment. This is not a condition to wait out. If you don't seek treatment as soon as possible, you could be facing eventual amputation of the affected body part or limb. Visit your doctor immediately to begin alleviating the issue. [30] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Note that some people may not experience any pain accompanying their dry gangrene and thus do not consult their physicians until the extremity has already turned black. Be vigilant and notify your doctor the second you notice any of the above. Don't wait for the situation to become aggravated. While home remedies are all well and good, they will likely be insufficient to effectively treat the dry gangrene. Start treatment sooner rather than later to see your symptoms fade much more quickly."
    }
  ]
}