{
  "url": "https://www.wikihow.com/Stretch-Before-and-After-Running",
  "title": "How to Stretch Before and After Running",
  "steps": [
    {
      "title": "Minimize static stretches before exercise.",
      "content": "Minimize static stretches before exercise. Many people use the words “stretch\" and “warm up\" interchangeably, but they serve different purposes. Stretches involve holding your muscles in place in a lengthened position. This loosens and relaxes your muscle, which may reduce running efficiency. Instead, prepare for a workout by warming up with the exercises below, or anything that gets your muscles moving. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Many athletes refer to warm ups as \"dynamic stretches\" or \"active stretches,\" as opposed to \"static stretches\" where you hold a muscle still. [2] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Despite what you may have heard, static stretches probably do not help prevent injury. [3] X Research source Over-stretching with static stretches may even increase the risk of cramps and pulled muscles."
    },
    {
      "title": "Perform heel flicks.",
      "content": "Perform heel flicks. Jog forward at a slow pace. As you run, bring your knee up in line with your hips, and bring your foot back to touch your bottom. Repeat this motion with alternating legs. You may gradually increase your running speed, but don't go beyond a moderate pace. [4] X Research source This exercise — along with the high knees, power skips, and lunges below — warm up all the muscles of your lower body. This is useful for all runs, but put extra focus on them before a long-distance run, as cramps are a higher danger."
    },
    {
      "title": "Add high knees to your warm up.",
      "content": "Add high knees to your warm up. As you run at a slow to moderate pace, bring your knee up above your waistline. This is easier if you hold your hands and forearms out horizontally from your body."
    },
    {
      "title": "Learn power skips.",
      "content": "Learn power skips. While jogging forward, start to skip with the aim of jumping as high as you can on each skip. Drive one knee up as high as you can with each jump, and lift the arm opposite that knee up above your ahead as well. Try to keep the skipping smooth, and aim for height rather than forward speed."
    },
    {
      "title": "Practice your lunges",
      "content": "Practice your lunges . Stretch your leg out and plant in on the ground in front of you, with your knee behind your toes. Slowly lower your body until your can easily touch the ground with your hands. Hold this for three seconds and return to a standing position. Repeat on alternate sides. [5] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Lunges can be dynamic and static stretches depending on how quickly you lunge and how long you hold the position."
    },
    {
      "title": "Lie on your back and kick.",
      "content": "Lie on your back and kick. Straight-legged scissors kicks prepare your legs for explosive movement, while \"running\" or \"cycling\" in the air warm up the whole suite of leg muscles."
    },
    {
      "title": "\"Open the gate.",
      "content": "\"Open the gate. \" This stretch reduces tension in your groin and thighs, which is important for long-distance running but not too relevant for sprints. To do this, stand on one leg and lift your other knee to hip level. Rotate the raised leg out away from your body, feeling the stretch in your groin. Now \"close the gate\" by returning the knee in front of you before lowering your leg. [6] X Research source Repeat with alternating legs."
    },
    {
      "title": "Get your heart rate up.",
      "content": "Get your heart rate up. For any type of run, increasing your heart rate first will reduce lactic acid buildup, helping you run for longer with less pain. If you're blood's not pumping yet, finish up with some jumping jacks or jogging in place. This step is especially important for sprints. Before a sprinting race, try warming up with five 40 meter sprints back and forth."
    },
    {
      "title": "Slow down gradually after a run.",
      "content": "Slow down gradually after a run. If you've been running all-out, don't stop abruptly. Instead, slow down your running speed until you eventually reach a walking pace. This helps your muscles expel lactic acid, and helps prevent muscle cramps."
    },
    {
      "title": "Stretch your quads.",
      "content": "Stretch your quads. Now is the time for slow, deep static stretches to help your muscles relax. [7] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Begin with your legs, standing on one foot and holding your ankle back against your bottom with one hand. This stretches the quad (front thigh) muscle on the leg you're holding. Hold for twenty seconds, then repeat with the other leg. [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source In general, try to hold each static stretch below for roughly twenty seconds."
    },
    {
      "title": "Touch your toes to stretch your hamstring.",
      "content": "Touch your toes to stretch your hamstring. This is the muscle on the back of your thigh, which tends to get especially tense while running. Try to touch your toes while standing up or seated with your legs outstretched. Reach across your body to touch the foot with the opposite arm, then repeat on your other side. [9] X Research source Don't force this past mild discomfort, or you could tear something. Your flexibility will improve over time if you keep stretching. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Stretch your shoulders.",
      "content": "Stretch your shoulders. Although they aren't under as much stress as your legs, your shoulders do tend to tense up when you run. Bring one arm across your chest, holding it with the other hand. Hold twenty seconds, then repeat with the other arm."
    },
    {
      "title": "Stick to light exercise during next-day soreness.",
      "content": "Stick to light exercise during next-day soreness. If you're sore the next day, your muscles need a little time to repair before they're back in top condition. A light jog or other light exercise can speed this up. That said, this delayed soreness is not due to lactic acid, so vigorous exercise will not make it go away, and will likely make it worse. [11] X Research source Give yourself a rest if you're feeling pain."
    }
  ]
}