{
  "url": "https://www.wikihow.com/Treat-Chinch-Bugs-Without-Chemicals",
  "title": "How to Treat Chinch Bugs Without Chemicals",
  "steps": [
    {
      "title": "Check the chinch bug population.",
      "content": "Check the chinch bug population. Before you begin, get an idea of how bad the problem is, and whether chinch bugs are the ones responsible. Cut the base off a coffee can and push it two inches (5 cm) into the turf. Pour in soapy water until it stays filled. Repeat in several areas of your lawn, especially at the border of yellow patches. Return after ten minutes and count chinch bugs floating on the surface: [3] X Research source 5+ chinch bugs per can: a serious infestation. Continue to the next step for treatment. 2–4 chinch bugs per can: low-level infestation. Improve lawn health and test again later. Treat immediately if your lawn is in poor health. 0–1 chinch bug per can: no treatment necessary. If your lawn is in poor health, there is probably another cause. Alternatively, you might also take a close look at the lawn with a magnifying glass."
    },
    {
      "title": "Vacuum the lawn.",
      "content": "Vacuum the lawn. This can be effective if you catch the chinch bug infestation early, before they've spread throughout your lawn: [4] X Research source Rake the lawn vigorously for 2 ft (60 cm) on all sides of the damaged area, toward the center. Vacuum the damaged area and surroundings. Water thoroughly."
    },
    {
      "title": "Buy or make a soap treatment.",
      "content": "Buy or make a soap treatment. Insecticidal soaps are considered safe and appropriate for organic farming. A homemade soap treatment is actually more likely to damage your garden, but pure castille soap or mild Ivory or Dawn products (not extra-strength, grease-cutting, or anti-bacterial) are usually safe in a solution of 2½ tbsp dishwashing liquid per 1 gallon water (40 mL per 4 L). Mix in a clean sprayer, then shake or stir vigorously to combine. If using an insecticidal soap, dilute it following label instructions instead. This method also works best if you catch the infestation early and use it to target small areas of lawn. If you have hard water in your area, the soap may fail to mix in, leaving a scum on the surface after the water settles. If this happens, make a new mix using distilled or bottled water instead. [5] X Research source Using a commercial insecticidal soap for chinch bugs is not legal in Canada, although this may just be an oversight. Homemade soap treatments are allowed. [6] X Research source Any soap can cause damage to aquatic life. Do not apply it where the water could run off into a storm drain."
    },
    {
      "title": "Spray the soapy water onto your lawn.",
      "content": "Spray the soapy water onto your lawn. Drench the damaged area of your lawn using a spray bottle or hose attachment. For best results, do this on a cool, still morning or evening. In windy or hot weather (especially above 90ºF / 32ºC), there is a much higher chance of damaging your plants. [7] X Research source Try to avoid getting the soap in contact with nearby plants. Some trees and flowers are particularly vulnerable to soap damage, especially during times of drought. If you're concerned about potential damage, test a corner of your lawn first and check on it after 24 hours."
    },
    {
      "title": "Spread a flannel sheet over the soapy area.",
      "content": "Spread a flannel sheet over the soapy area. The chinch bugs will run for cover and get caught in the nap of the flannel. Return after ten or fifteen minutes to vacuum the pests off the sheet, or drown them by putting the sheet in a bucket of water. [8] X Research source"
    },
    {
      "title": "Repeat as needed.",
      "content": "Repeat as needed. Monitor your lawn to check for more chinch bugs or expanding damage. If necessary, repeat the soap treatment once a week, or once every three or four days for severe infestations. The soap breaks down quickly, so your lawn should be back to normal soon. [9] X Research source You may want to check your soil pH after treatment is finished, since soap is alkaline."
    },
    {
      "title": "Encourage big-eyed bugs.",
      "content": "Encourage big-eyed bugs. These predators are not available for purchase, but they often arrive during an infestation to feed on chinch bugs. Providing a variety of flowering plants encourages them by giving them places to hide and feed. [10] X Research source These predators look very similar to chinch bugs. They tend to be smaller and faster, with larger eyes. [11] X Research source If you're still seeing a lot of chinch bugs but your lawn seems healthy, you might be misidentifying this predator species."
    },
    {
      "title": "Use other predatory insects.",
      "content": "Use other predatory insects. Ladybugs, lacewings, and parasitic wasps all feed on chinch bugs or their eggs. While they do not target chinch bugs as effectively as big-eyed bugs, they are all widely available for purchase. [12] X Research source Beneficial nematodes (roundworms) may also help. These are proven to control grubs, though there aren’t yet studies on their effectiveness for chinch bugs. You can buy beneficial nematodes at many home and garden stores."
    },
    {
      "title": "Try natural oil treatments.",
      "content": "Try natural oil treatments. A neem oil product can control chinch bugs with little effect on plants and beneficial insects. Spray on the oil during cool, humid evenings, since it can break down or burn plants in direct sunlight. [13] X Research source Some essential oils such as rosemary, lemongrass, cinnamon, or citrus oils can also help, but have not been studied as thoroughly. [14] X Research source Dilute about 20 drops of oil in 1 gallon (3.8 L) of water, then spray onto your lawn. [15] X Research source"
    },
    {
      "title": "Sprinkle on diatomaceous earth.",
      "content": "Sprinkle on diatomaceous earth. This can kill beneficial insects and earthworms and can take weeks or months to solve the problem, so use it only as a last resort. Wear safety goggles and a dust mask to avoid irritation, and try not to create too much dust. Wash your hands after applying. [16] X Research source Use garden-grade or food-grade DE only. Swimming pool grade DE is a more significant respiratory hazard. Non-heated DE containing less than one percent crystalline silica is the safest option. [17] X Research source Try applying DE with a bulb applicator. This will reduce the risk of getting the dust in your eyes, nose, and mouth. Apply DE to wet grass, as well, either after it rains or you’ve watered the lawn. This ensures that the small particles stick to the grass."
    },
    {
      "title": "Water deeply but infrequently.",
      "content": "Water deeply but infrequently. Dry, sunny lawns are the chinch bugs' ideal home, and drought stress will make it harder for your turf to resist them. The ideal watering schedule depends on your climate and grass species, but start with 1 inch (2.5 cm) a week divided among one to three sessions. [18] X Research source A healthy lawn receiving enough moisture should bounce back after you step on it. Too much water can backfire and make the problem worse, especially with hair chinch bug infestations (found mostly in the northern US and Canada). If you think your lawn is too wet, delay watering until the grass edges just begin to curl. [19] X Research source Moist conditions also encourage naturally occurring Beauveria fungus, a parasite that kills chinch bugs."
    },
    {
      "title": "Provide shade.",
      "content": "Provide shade. Chinch bugs are not partial to shaded areas. Put up a shade cloth, or plant trees and bushes to reduce the amount of direct sunlight your lawn gets each day. If your lawn is a light-loving variety, consider shading just the most vulnerable areas: the green grass at the border of expanding yellow patches. St. Augustine grass, the southern chinch bug's favorite food, has excellent shade tolerance. It should thrive under a 30% shade cloth."
    },
    {
      "title": "Keep your grass tall.",
      "content": "Keep your grass tall. In general, grass is at its healthiest when allowed to grow to a height of 3–4 inches (7.5–10 cm). This is especially true during a chinch bug infestation, since tall grass will keep the ground dark and moist — two qualities this pest dislikes. If your lawn is in particularly bad shape, you could skip mowing entirely until it recovers. [20] X Research source To reduce stress on your grass, use a sharp lawn mower blade and remove no more than ⅓ of the grass blade each mowing. [21] X Research source"
    },
    {
      "title": "De-thatch your lawn.",
      "content": "De-thatch your lawn. Thatch is the spongy, brown layer of organic material that forms between grass blades and soil. Chinch bugs live in thatch and hibernate in it during cold winters. Aerate your yard once or twice a year to keep thatch levels to ½\" (1.25 cm) thick or less. If the thatch is more than an inch thick (2.5 cm), cut through it with a vertical mower or dethatching rake. This is especially important in fall, to reduce areas where chinch bugs can overwinter. [22] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source"
    },
    {
      "title": "Avoid over-fertilizing the lawn.",
      "content": "Avoid over-fertilizing the lawn. Chinch bugs and other sap-drinking insects thrive on plants with high levels of nitrogen. [23] X Research source Switch to an organic slow-release fertilizer, or a fertilizer with only 5 or 10% nitrogen (N). [24] X Research source You can probably add significantly less fertilizer than the label recommends without causing harm. Try this, and increase the amount again if the grass turns light green."
    },
    {
      "title": "Clear debris in winter.",
      "content": "Clear debris in winter. In cold climates, chinch bugs overwinter underneath leaf litter or debris. Some of them will likely survive under the thatch even on a clear lawn, but raking up leaves is an easy way to make it harder for them."
    },
    {
      "title": "Control weeds in spring",
      "content": "Control weeds in spring . If the bugs are grey-brown or blackish-brown and tiny (about ⅛\" or 4 mm long), you probably have \"false chinch bugs.\" These only swarm turf in the summer, after the weeds they prefer to feed on have died. [25] X Research source To keep their numbers down, keep your lawn and surrounding areas clear of weeds in spring, especially London rocket, other mustard plants, Russian thistle, and sagebrush. [26] X Research source False chinch bugs are most common west of the Mississippi in dry regions, but can be found throughout the United States, southern Canada, Mexico, and the West Indies. [27] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Adjust lawn pH",
      "content": "Adjust lawn pH . The ideal soil pH for most turf is between 6.5 and 7.0. Test your soil with a pH kit from a garden store, and get it within this range by adding lime (to raise pH) or sulfur (to lower it). [28] X Research source Keeping pH within this range will keep your lawn healthy and able to absorb nutrients, helping it survive pest damage. For best results, send a soil sample to a soil testing laboratory to find out the exact nutrients your soil is missing."
    }
  ]
}