{
  "url": "https://www.wikihow.com/Steam-Pending-Transaction",
  "title": "Steam Guide: Pending Transaction Causes and Fixes",
  "steps": [
    {
      "title": "Payment processing.",
      "content": "Payment processing. Sometimes, it takes a bit longer to process a Steam payment. This can happen if you purchased a game on the weekend or are adding a large amount of money to your Steam wallet."
    },
    {
      "title": "Bank issues.",
      "content": "Bank issues. If your bank or credit card issuer is having issues on their backend, it can sometimes cause Steam payments to not go through right away. If this is the case, it is unfortunately up to the bank to fix the problem—which could take a little time."
    },
    {
      "title": "Connection problems.",
      "content": "Connection problems. If your internet connection glitched when you were making a Steam purchase, it can sometimes result in that purchase being listed as \"pending.\" Sometimes these issues will sort themselves out, but other times you may have to cancel the charge and try again."
    },
    {
      "title": "Wait it out.",
      "content": "Wait it out. Sometimes, all you can do is wait for your Steam purchase to go through. If you made the purchase on a weekend or you're making a large purchase, wait a few hours to see if the payment finishes processing. If not, try canceling the purchase and trying again."
    },
    {
      "title": "Check your balance.",
      "content": "Check your balance. Make sure you have enough money to cover the purchase in your account. Usually, if you don't have the balance to make a purchase, the purchase will decline, but that is not always the case. If you see that you don't have enough money to cover your purchase in your account, transfer more money to that account or cancel the purchase and try it again with a different card or account."
    },
    {
      "title": "Cancel the purchase and try again.",
      "content": "Cancel the purchase and try again. If the purchase isn't going through, you can try canceling it and making it again. [1] X Research source To do this, follow these steps: Go to your Steam store transactions page. Click on your purchase history. Click on the pending purchase. Cancel the pending purchase. Go back to the Steam store and repurchase the item."
    },
    {
      "title": "Submit a Steam ticket.",
      "content": "Submit a Steam ticket. If nothing else works, you can try submitting a Steam ticket for further assistance. To do so, go to this Steam page and choose what type of purchase you're trying to make. Then, sign in and follow the on-screen instructions to submit a ticket. A Steam support agent will get back to you as soon as possible to help you with your issue."
    },
    {
      "title": "Contact your bank.",
      "content": "Contact your bank. If the payment issue is with your bank or credit card issuer, you'll need to contact them. They may be able to cancel the charge so you can try again, or you may need to give confirmation that you're actually trying to make the purchase (especially if you're spending a lot of money, which can be flagged by banks for fraud prevention)."
    }
  ]
}