{
  "url": "https://www.wikihow.com/Victorian-Slang",
  "title": "Victorian Slang: 90+ Words & Phrases From the 19th Century",
  "steps": [
    {
      "title": "",
      "content": "You might’ve heard terms like “balderdash,” “lollygag,” or “scuttlebutt” before, and it turns out they come from Victorian-era slang! Explore those words, their meanings, and more in this collection of general Victorian slang words: [1] X Research source Academy headache - A headache acquired at an art gallery (or somewhere similar) Balderdash - Something preposterous or untrue Batty-fang - To thrash thoroughly (a London phrase, though possibly originating from “ battre à fin ” in French) Benjo - A noisy, riotous holiday Collie shangles - Arguments and quarrels Daddles - Hands (originating from boxing terms) Drumsticks - A person’s legs Evening wheezes - False or made-up news Fake a poke - Pickpocketing Kruger-spoof - Lying Lollygag - Wasting time or dawdling Major Macfluffer - A theater phrase for a lapse of memory Mouth-pie - Scolding, usually by a woman Nanty narking - A tavern term that means having almost too much fun; it may originate from the Welsh word “nant,” or stream, and the term “narking,” which means annoying Parish pick-axe - A large or pronounced nose Powdering hair - A tavern term for getting drunk Rain napper - An umbrella Sauce box - The mouth Scuttlebutt - Exchanging news and gossip; the term originates from sailors who’d “scuttle” (cut a hole) in a “butt,” or cask, of water and chat while doing so Tickety-boo - In good order or condition"
    },
    {
      "title": "",
      "content": "Are you looking for some funny new words to insult your friends with playfully? Or maybe you want something new to say in place of modern-day curses. Either way, you’ll find them here; people in Victorian times used some colorful slang to swear and insult one another! [2] X Research source Blazes - A curse meaning “hell” or referring to the Devil Bubble around - Any kind of verbal attack Damfino - A contraction of “damned if I know” Dratted - A Victorian swear used the way “damn” is today Foozler - Someone who messes things up or is clumsy Gorblimey - A contraction of “God blind me” Meater - A street term for someone cowardly Muffin-walloper - Someone sitting at home eating cakes instead of cooking Mutton shunter - A rude term for a police officer Skilamalink - Someone dishonest, underhanded, or resourceful Tarnation - A Victorian alternative to saying “damnation”"
    },
    {
      "title": "",
      "content": "Victorian slang features a number of different terms that describe specific kinds of people, from people with a penchant for gossip to people who just don’t have great singing skills! See if you recognize any of these terms: [3] X Research source Basket of oranges - A pretty woman Beer bottle - A stout, red-faced man Chuckaboo - A close friend Church bell - A chatty woman (who talks so much her voice is reminiscent of church bells) Coffee-sisters - Gossipy people Dancing dogs - A satirical term for men dancing Dollymop - A woman dabbling in sex work Escop - A cockney term for a police officer Gal-sneaker - A man who tries to seduce every woman he meets Jammiest bits of jam - Perfect, gorgeous young ladies Mollisher - The female companion of a criminal or villain Revolveress - A woman with excellent shooting skills Whooperups - Noisy (and poor) singers Wooden spoon - Someone not very smart or self-aware"
    },
    {
      "title": "",
      "content": "Unsurprisingly, Victorian slang has many whimsical sayings—some fairly straightforward and others a little more obscure. Luckily, we’ll explain all of them in our list of phrases and expressions below: [4] X Research source Bang up to the elephant - Perfect, complete, or unapproachable Barking at a knot - Doing something pointless or wasting your time Butter upon bacon - Over-the-top extravagance Can’t you feel the shrimps? - Cockney for “smell the sea” Cheese and crust - Lower-class alternative to “Jesus Christ” Cop a mouse - Getting a black eye Cut a finger - To cause (or be the source of) a bad odor Do a stamp - Take a walk Do tell - A phrase meaning “you don’t say” or inviting someone to share their news Don’t sell me a dog - A slang phrase meaning “don’t lie to me” Foot and mouth disease - Swearing followed by kicking Grinning at the daisy roots - Indicates that someone has died and been buried Got the morbs - Feeling melancholy or miserable Keep that dry - A request to keep something secret Kill the canary - Finding an excuse to skip work (like pretending to be sick) Make a stuffed bird laugh - Doing something absolutely absurd Mind the grease - A phrase meaning “Let me pass, please” when walking around people Not up to dick - Not feeling well Nursing the hoe-handle - Being lazy Raked fore and aft - A mariner’s term for someone desperately in love Shake a flannin - A slang expression for going to fight Shoot into the brown - To fail at something (referring to missing the target while shooting a rifle) Shoot your cuff - Having the best possible personal appearance Sponge it out - Forget it Take the egg - To win at something"
    },
    {
      "title": "",
      "content": "If you’re looking for an unusual term to describe something (or someone), there might just be a colorful piece of Victorian slang that’ll fit what you’re looking for. Check out this list of descriptive Victorian slang words, from “bricky” to “gigglemug.” [5] X Research source Afternoonified - Anything posh (Referring to the “posh” practice of tea time in the afternoons) Arfarfan'arf - A figure of speech meaning drunk Bricky - Someone brave and fearless Champagne weather - Bad, rainy weather Cheek-ache - Blushing or turning red due to someone else’s rudeness Crushed - Being in love or besotted with someone (like having a crush in modern terms) Dizzy age - Elderly Doing the bear - A style of courting that involved hugging Door-knocker - A beard style with shaved cheeks and chin, leaving hair under the chin and on each side of the mouth connected by a mustache Eat vinegar with a fork - Someone extremely well-spoken who has a sharp way with words Enthuzimuzzy - A sarcastic word for “enthusiasm” Firkytoodling - Kissing and cuddling Fly rink - A polished, bald head Gas pipes - Very tight pants Gigglemug - A perpetually smiling face Half rats - Being partially intoxicated Mad as hops - Someone very excitable Mafficking - Getting rowdy out in the streets Orf chump - Having no appetite Poked up - Feeling embarrassed Some pumpkins - Something really awesome or impressive Up the pole - Being so drunk you have to hold onto a pole to stay upright Worry the dog - A bully, someone so off-putting they even upset the house dog"
    },
    {
      "title": "",
      "content": "Victorian slang also features a few terms specifically referring to food and drink, particularly meat (like sausages) and tea, coffee, or alcoholic beverages. Here’s a short list of Victorian food and drink terms: [6] X Research source Bags o’ mystery - Sausages Bow wow mutton - Extremely bad meat Cat lap - Tea and coffee (used scornfully by London beer and liquor drinkers) Smothering a parrot - Drinking a glass of absinthe neat Powdering hair - Getting drunk"
    },
    {
      "title": "Victorian slang comes from the era of Queen Victoria's reign (1837–1901).",
      "content": "Victorian slang comes from the era of Queen Victoria's reign (1837–1901). That's why so many Victorian slang words are British, or even specifically originated in 19th-century London. It also comes from vastly different sources, from lower-class Londoner and cockney terms to mariner vocabulary, tavern slang, popular literature and music at the time, current fashion trends, and other local figures of speech. [7] X Research source In Victorian London (and beyond), slang terms let people chat about their lives and easily reference very particular situations or descriptions. It was almost like a sort of code that people could speak in! Naturally, Victorian slang evolved over the years, with different phrases coming in and out of style—just like they do today. In 1909, a book was even published about Victorian slang called Passing English of the Victorian Era: A Dictionary of Heterodox English, Slang, and Phrase by J. Redding Ware. In the book, J. Redding Ware describes Victorian slang as \"a river of new language which has its tide and its ebb,\" and \"often very seasonably local.\" [8] X Research source"
    }
  ]
}