{
  "url": "https://www.wikihow.com/Use-Your-Samsung-Galaxy-Tab-As-a-Phone",
  "title": "How to Use Your Samsung Galaxy Tab As a Phone",
  "steps": [
    {
      "title": "Check for SIM card support.",
      "content": "Check for SIM card support. Galaxy Tablets have two versions: one that supports a SIM card and one that doesn’t. Refer to the tablet’s user manual to see whether the Android device you have supports the said feature or not. You can also look around the sides of the tablet or behind its battery for any slot that a SIM card might fit in. It’s a small slot only a little larger than that of a memory card, and is very easy to find."
    },
    {
      "title": "Get a SIM card.",
      "content": "Get a SIM card. There are two ways you can get a SIM card: the first is by purchasing a prepaid type SIM from your local gadget store. You can get these SIMs for under $5, depending on the provider it’s from. You also don’t have to pay any monthly bill, just top-up from your local store or carrier outlet before you use it. The second way is by getting a postpaid SIM directly from a mobile carrier. Unlike prepaid SIMs, you can get a postpaid SIM card for free, but you have to pay a monthly phone bill to keep it working."
    },
    {
      "title": "Insert the SIM card in to your Galaxy Tab.",
      "content": "Insert the SIM card in to your Galaxy Tab. Remove the SIM card from the package and insert it into the SIM slot of the Galaxy Tab. For tablets with the SIM slot located along the sides, you no longer need to turn off the device first before you put the SIM card in. For the other models, switching off your tablet may be necessary before inserting the SIM card. After inserting the SIM card, you should see the signal icon on the upper right-hand corner of the screen go up, telling you that it’s now connected and receiving signals from the SIM card provider."
    },
    {
      "title": "Make calls.",
      "content": "Make calls. To start making calls, tap the phone icon from your tablet’s screen to bring up its on-screen numeric keypad. Here, type in the phone number you want to contact and press the green phone icon to place the call. To end the call, simply tap the red phone icon and the call should terminate at once, leading you back to the home screen."
    },
    {
      "title": "Send out text messages.",
      "content": "Send out text messages. To start messaging, tap the message icon from your tablet’s screen to bring up its dedicated messaging app. To send a text message, just type in your message on the text box using the on-screen keyboard. Tap the “Recipient” field found at the top of the app screen and type in the phone number where you want to send the message to. If you already have contacts saved on your Galaxy Tab, suggested names will appear as you type in the number."
    },
    {
      "title": "Surf the net.",
      "content": "Surf the net. Once you inserted a SIM card, you can now start browsing the Internet even without connecting to a Wi-Fi network. All you need to do is the following: Enable mobile data. Open the notification tray by sliding your fingers from top to bottom of the tab’s screen. Once the notification tray has been expanded, tap the “Mobile Data” quick setting button (the arrows point up and down) found on the upper portion of the tray to enable this feature. Start surfing. Tap the “Internet” application from the home screen to open the tablet’s native web browser. Type in the address of the website you want to visit and press the “Go” button on the keyboard to start surfing."
    }
  ]
}