{
  "url": "https://www.wikihow.com/Tell-Crystal-from-Glass",
  "title": "Crystal vs. Glass: How to Tell the Difference",
  "steps": [
    {
      "title": "Test the clarity of the object.",
      "content": "Test the clarity of the object. Hold the object up to a light source and look through it. True crystal is clear and brilliant with no cloudiness, whereas glass has a duller cast. [1] X Research source Crystal with a higher lead content also provides a clearer view of anything inside or behind it. For example, the liquid inside a normal drinking glass might look slightly cloudy and have less definition. The liquid in a crystal glass looks sharper, almost as if there's no glass holding it at all. [2] X Research source The exception is if the crystal is frosted or has a lot of carved details. Normal glass can also have a greenish cast to it, whereas crystal is completely translucent. According to glassblowing expert Douglass Brown, \"it's the iron inside the glass that gives it that green cast.\""
    },
    {
      "title": "See if the object sparkles in the light.",
      "content": "See if the object sparkles in the light. Crystal often looks extremely sparkly when you hold it up to a light source. The more lead in the glass, the more it will sparkle (especially after you clean it ). It can also look shinier if it has many fine, sharp cuts carved onto the sides. Glass objects will still shine and reflect light, of course, but they don't have the same pizzazz as crystal. [3] X Research source Crystal with 35% or more lead is the sparkliest variety of all!"
    },
    {
      "title": "Hold the object up to the sun and look for prisms.",
      "content": "Hold the object up to the sun and look for prisms. Another fun trick you can do to identify crystal is to put it in sunlight and look for the prism effect. Crystal refracts, or splits up, waves of light into their separate wavelengths and creates rainbows. You can often see these rainbows inside the crystal or projected onto a nearby surface, like a wall. Non-lead glass doesn't make as noticeable of a prism effect. [4] X Research source"
    },
    {
      "title": "Feel the object's details for sharp edges.",
      "content": "Feel the object's details for sharp edges. Crystal objects are sculpted by hand rather than molded and mass-produced by machines, like glass objects are. For that reason, the carved details on crystal are sharper and more defined than the ones produced in a factory. [5] X Research source"
    },
    {
      "title": "Flick the object to test its sound.",
      "content": "Flick the object to test its sound. Flick the object with your finger or tap it against something solid (gently!). If it's crystal, it will make a ringing sound that can sometimes linger for several seconds. This is known as the crystal's resonance quality. If it's glass, it will make a dull thud. [6] X Research source This test works best on drinking glasses, bowls, and vases. It doesn't work for more closed, heavy objects like crystal chandeliers, decanters, or picture frames. Another sound test you can do is pour water into the crystal object, then wet your finger and rub it around the rim. Crystal will produce a musical tone, but glass won’t."
    },
    {
      "title": "Assess the object’s thickness.",
      "content": "Assess the object’s thickness. Crystal is sculpted over a longer period at a lower temperature than glass. Because of this, the lead inside the crystal can be shaped into thinner, more intricate designs. On a wine glass, for instance, look for a thinner rim with less of a lip. That's a hint it may be made of crystal! [7] X Research source"
    },
    {
      "title": "Test the object’s weight in your hand.",
      "content": "Test the object’s weight in your hand. If you compared 2 glass objects of similar size, the crystal one would probably always weigh more than the one made of normal glass (even if the glass one is thicker). The extra heft is due to the crystal's lead content. When you're trying to determine if a glass object is crystal, pick it up and test its weight. If it feels heavy, it might be made of crystal. If it's lightweight, that may mean it's made of glass instead. Weight alone doesn't identify crystal, but it's a good clue when you combine it with the other characteristics listed in this article. [8] X Research source Lead-free crystal also feels lighter than real crystal, but is still heavier than normal glass. [9] X Research source"
    },
    {
      "title": "Check the base of the object for a maker's mark.",
      "content": "Check the base of the object for a maker's mark. If you can identify the manufacturer that produced the object, you can sometimes identify the material pretty easily. Look on the base of the object for an etching, an engraving, a stamp, a mold, or a sticker. Read the name on the mark (if it's visible), then search for it on Google. You may be able to find a listing for the object on the maker's website. In that case, it will tell you exactly what it's made of. Common crystal makers include: Baccarat Waterford Daum Lalique Steuben Swarovski Tiffany"
    },
    {
      "title": "Check the price of the object.",
      "content": "Check the price of the object. Because of its finer quality and craftsmanship, crystal is usually higher priced than regular glass. A single crystal wine glass can cost as much as $100, whereas a normal wine glass might cost as little as $5. [10] X Research source If you're buying the object from a secondhand store or an antique shop, however, don't just go by the price! The owner of the store might have mistakenly grouped it together with other crystal objects without realizing it's glass. They might also purposely say it's crystal when it's not, so they can charge more money for it."
    },
    {
      "title": "Send it to a certified antique or collectibles appraiser.",
      "content": "Send it to a certified antique or collectibles appraiser. If you're still in doubt, consult a professional appraiser. They can always tell the difference between a crystal and a glass object. Sometimes they don't even have to view it in person. They can just look at a picture or watch a video of it and identify the material immediately. To find one in your area, search the American Society of Appraisers (ASA) directory or the International Society of Appraisers (ISA) directory ."
    },
    {
      "title": "Crystal is a type of glass with lead added to it.",
      "content": "Crystal is a type of glass with lead added to it. The biggest difference between crystal and glass is the minerals they're made out of. Crystal is made of sand, soda ash, and limestone, just like normal glass. [11] X Research source But it has one extra ingredient: lead oxide. [12] X Research source Lead makes the crystal clearer, easier to cut, and gives it that signature ringing sound when you flick or tap it. Lead is also what can make crystal more hazardous to human health. The US Food and Drug Administration (FDA) recommends only using crystal to eat off of or drink out of occasionally. Pregnant women and children should avoid it completely for safety. [13] X Research source Glass is considered genuine crystal if it contains at least 24% lead."
    },
    {
      "title": "Lead-free crystal is a brilliant glass made with other minerals instead of lead.",
      "content": "Lead-free crystal is a brilliant glass made with other minerals instead of lead. Because of the dangers of lead, many glass companies now make \"lead-free crystal\" by replacing lead oxide with barium oxide, zinc oxide, or potassium oxide. These minerals provide the signature clarity of regular crystal. But you can tell when an object is made of lead-free crystal, even if it looks clear, because it weighs less and is less sparkly. [14] X Research source"
    },
    {
      "title": "Crystal glassware makers.",
      "content": "Crystal glassware makers. If you're willing to splurge, then purchasing crystal directly through a reputable glassware maker is the way to go. Find crystal stemware, vases, jewelry, light fixtures, and much more with brands like Baccarat , Daum , Lalique , and Tiffany ."
    },
    {
      "title": "Antique stores and flea markets.",
      "content": "Antique stores and flea markets. The next best place to find crystal objects is at antique stores and flea markets. Use the tips we shared above to make sure you're buying real crystal. At the same time, remember to be respectful of the seller's wares, as well as of other shoppers. It's not polite, for example, to go around flicking all the glassware in the store to check if it rings!"
    },
    {
      "title": "Secondhand stores and websites.",
      "content": "Secondhand stores and websites. Don't overlook secondhand stores and online marketplaces! People sometimes donate valuable and high-quality crystal to places like Goodwill because they don't realize what a treasure they have. eBay is also a great online resource to shop for crystal if you don't want to leave your home. Just remember to check the item images carefully for signs that it's real crystal, like a maker's mark on the bottom and sharp, intricately carved details. It's also a good idea to only bid on or buy items from sellers with a high rating."
    },
    {
      "title": "Crystal is clearer, thinner, more detailed, and contains more lead than glass.",
      "content": "Crystal is clearer, thinner, more detailed, and contains more lead than glass. Even though crystal is a type of glass, glassmakers classify it as its own material because it contains lead. The lead makes the crystal sparkle and produce rainbows in the sunlight. Crystal also makes a beautiful ringing sound when you flick it with your finger. When you're looking for crystal glassware to buy, check the maker's mark for popular crystal makers."
    }
  ]
}