{
  "url": "https://www.wikihow.com/Use-an-Abacus",
  "title": "How to Use an Abacus",
  "steps": [
    {
      "title": "Orient your abacus properly.",
      "content": "Orient your abacus properly. Each column in the top row should have one or two beads per row, while each column in the bottom row should have four. When you start, all of the beads should be up in the top row, and down in the bottom row. The beads in the top row represent the number value 5 and each bead in the bottom row represents the number value 1. [1] X Research source"
    },
    {
      "title": "Assign each column a place value.",
      "content": "Assign each column a place value. As on a modern calculator , each column of beads represents a \"place\" value from which you build a numeral. So, the farthest column on the right would be the \"ones\" place (1-9), the second farthest the \"tens\" place (10-99), the third farthest the hundreds (100-999), and so on. [2] X Research source You can also assign some columns to be decimal places if necessary. For example, if you are representing a number like 10.5, then the furthest right column would be the tenths place (the first decimal place), the second column would be the ones place, and the third column the tens place. Likewise, to represent a number like 10.25, the furthest right column would be the hundredths place, the second column would be the tenths place, the third the ones place, and the fourth the tens place."
    },
    {
      "title": "Start counting with the beads in the lower row.",
      "content": "Start counting with the beads in the lower row. To count a digit, push one bead to the \"up\" position. \"One\" would be represented by pushing a single bead from the bottom row in the farthest column on the right to the \"up\" position, \"two\" by pushing two, etc. [3] X Research source You'll find it easiest to use your thumb to move the beads in the bottom row, and your index finger to move the beads in the top row."
    },
    {
      "title": "Complete the \"4/5 exchange.”",
      "content": "Complete the \"4/5 exchange.” Since there are only four beads on the bottom row, to go from \"four\" to \"five,\" you push the bead on the top row to the \"down\" position and push all four beads from the bottom row down. The abacus at this position is correctly read \"five.\" To count \"six,\" push one bead from the bottom row up, so the bead in the top row is down (representing a value of 5) and one bead from the bottom row is up. [4] X Research source"
    },
    {
      "title": "Repeat the pattern for higher numbers.",
      "content": "Repeat the pattern for higher numbers. The process is essentially the same across the abacus. Go from \"nine,\" in which all the beads in the ones place are pushed up and the bead in the top row is pushed down, to \"ten,\" in which a single bead from the bottom row of the tens place is pushed up (while the beads in the ones place are pushed back to their starting or \"0\" position). For example, 11 would have one bead in the second column pushed up, and another in the first column pushed up, all on the bottom row. Twelve would have one in the second column and two in the first column, all pushed up, and all on the bottom row. Two hundred and twenty six would have two in the third column pushed up in the bottom row, and two in the second column pushed up in the bottom row. In the first column, one bead on the bottom row would be pushed up, and the bead on the top row would be pushed down."
    },
    {
      "title": "Input your first number.",
      "content": "Input your first number. Say you've got to add 1234 and 5678. Enter 1234 on the abacus by pushing up four beads in the ones place, three in the tens place, two in the hundreds place, and one in the thousands place. [5] X Research source"
    },
    {
      "title": "Start adding from the left.",
      "content": "Start adding from the left. The first numbers you'll add are the 1 and the 5 from the thousands place, in this case moving the single bead from the top row of that column down to add the 5, and leaving the lower bead up for a total of 6. Likewise, to add 6 in the hundreds place, move the top bead in the hundreds place down and one bead from the bottom row up to get a total of 8. [6] X Research source"
    },
    {
      "title": "Complete an exchange.",
      "content": "Complete an exchange. Since adding the two numbers in the tens place will result in 10, you'll carry over a 1 to the hundred place, making it a 9 in that column. Next, put all the beads down in the tens place, leaving it zero. In the ones column, you'll do essentially the same thing. Eight plus 4 equals 12, so you'll carry the one over to the tens place, making it 1. This leaves you with 2 in the ones place."
    },
    {
      "title": "Count your beads to get the answer.",
      "content": "Count your beads to get the answer. You're left with a 6 in the thousands column, a 9 in the hundreds, a 1 in the tens, and a 2 in the ones: 1,234 + 5,678 = 6,912."
    },
    {
      "title": "Subtract",
      "content": "Subtract by doing the addition process in reverse. Borrow digits from the previous column instead of carrying them over. Say you're subtracting 867 from 932. After entering 932 into the abacus, start subtracting column-by-column starting on your left. [7] X Research source Eight from nine is one, so you'll leave a single bead up in the hundreds place. In the tens place, you can't subtract 6 from 3, so you'll borrow the 1 in the hundreds place (leaving it zero) and subtract 6 from 13, making it 7 in the tens place (the upper bead up and two lower beads). Do the same thing in the ones place, \"borrowing\" a bead from the tens place (making it 6) to subtract 7 from 12 instead of 2. There should be a 5 in the ones column: 932 - 867 = 65."
    },
    {
      "title": "Record the problem on the abacus.",
      "content": "Record the problem on the abacus. Start at the farthest left column of the abacus. Say you're multiplying 34 and 12. You need to assign columns to \"3\", \"4\", \"X\", \"1\", \"2\", and \"=\". Leave the rest of the columns to the right open for your product. [8] X Research source The “X” and “=” will be represented by blank columns. The abacus should have 3 beads up in the farthest column left, four up in the next farthest, a blank column, a column with one bead up, two beads up in the next, and another blank column. The rest of the columns are open."
    },
    {
      "title": "Multiply by alternating columns.",
      "content": "Multiply by alternating columns. The order here is critical. You need to multiply the first column by the first column after the break, then the first column by the second column after the break. Next, you'll multiply the second column before the break by the first column after the break, then the second column before the break by the second column after the break. [9] X Research source If you are multiplying larger numbers , keep the same pattern: start with the leftmost digits, and work to the right."
    },
    {
      "title": "Record the products in the correct order.",
      "content": "Record the products in the correct order. Start recording in the first answer column, after the blank one for the “=” sign. You will keep moving beads on the right hand portion of the abacus as you multiply the individual digits. For the problem 34 x 12: [10] X Research source First, multiply 3 and 1, recording their product in the first answer column. Push three beads up in that seventh column. Next, multiply the 3 and the 2, recording their product in the eighth column. Push one bead from the upper section down, and one bead from the lower section up. When you multiply the 4 and the 1, add that product (4) to the eighth column, the second of the answer columns. Since you're adding a 4 to a 6 in that column, carry one bead over to the first answer column, making a 4 in the seventh column (four beads from the bottom section pushed up to center bar) and a 0 in the eighth (all beads in their original starting position: the top section bead pushed up, bottom section beads pushed down). Record the product of the last two digits 4 and 2 (8), in the last of the answer columns. They should now read 4, blank, and 8, making your answer 408."
    },
    {
      "title": "Leave space for your answer to the right of the divisor and the dividend.",
      "content": "Leave space for your answer to the right of the divisor and the dividend. When dividing on an abacus, you will put the divisor in the left-most column(s). Leave a couple blank columns to the right, then put the dividend in the columns next to those. The remaining columns to the right will be used to do the work leading to the answer. Leave those blank for now. [11] X Research source For example, to divide 34 by 2, count 2 in the left-most column, leave two blank columns, then put 34 over to the right. Leave the other columns blank for the answer section. To do this, push two lower beads from the bottom portion up in the left-most column. Leave the next two columns alone. In the fourth column, push three beads from the bottom portion up. In the fifth column from the left, push four beads from the bottom portion up. The blank columns between the divisor and the dividend are just to visually separate the numbers so you don't lose track of what's what."
    },
    {
      "title": "Record the quotient.",
      "content": "Record the quotient. Divide the first number in the dividend (3) by the divisor (2), and put it in the first blank column in the answer section. Two goes into 3 once, so record a 1 there. [12] X Research source To do this, push one bead from the bottom portion up in the first column of the answer section. If you like, you can skip a column (leave it blank) between the dividend and the columns you want to use for the answer section. This can help you distinguish between the dividend and the work you do as you calculate."
    },
    {
      "title": "Determine the remainder.",
      "content": "Determine the remainder. Next, you need to multiply the quotient in the first answer section column (1) by the dividend in column one (2) to determine the remainder. This product (2) needs to be subtracted from the first column of the dividend. The dividend should now read 14. To make the dividend read 14, push two of the bottom portion beads currently pushed up to the center bar at the fifth column back down to their starting position. Only one bead in the lower portion of the fifth column should remain pushed up to the center bar."
    },
    {
      "title": "Repeat the process.",
      "content": "Repeat the process. Record the next digit of the quotient in the next blank column of the answer section, subtracting the product from the dividend (here, eliminating it). Your board should now read 2, followed by blank columns, then 1, 7, showing your divisor and the quotient, 17. Two beads from the bottom portion of the left most column will be pushed up to the center bar. This will be followed by several blank columns. One bead from the bottom portion of the first answer section column will be pushed to the center bar. In the next answer section column, two beads from the bottom portion will be pushed up to the center bar, and the bead from the top portion will be pushed down to it."
    }
  ]
}