{
  "url": "https://www.wikihow.com/Use-Antiperspirant",
  "title": "How to Properly Apply Antiperspirant",
  "steps": [
    {
      "title": "Select a stick antiperspirant, which is the most common choice.",
      "content": "Select a stick antiperspirant, which is the most common choice. Most people use antiperspirant that comes in a stick form, since it’s easy to apply and widely available. Like other antiperspirant types, it contains aluminum salts that plug your sweat glands. You’ll have the best results if you find a brand that contains at least 10% aluminum chloride. [1] X Research source Many antiperspirant sticks contain dimethicone, which can soothe skin—a plus if you shave your armpits. If you notice that your stick is clumping when you apply it to your underarm, it may contain too much powder or zinc."
    },
    {
      "title": "Purchase a cream if you have sensitive skin.",
      "content": "Purchase a cream if you have sensitive skin. Some antiperspirants come in cream form and are packaged in a tube or a jar. These formulas often include skin hydrators alongside the aluminum salts, making them a great choice for sensitive skin. [2] X Research source You may be able to find these products in your local drugstore or in a department store with a section for specialty skincare or cosmetics. Avoid formulas containing alcohol, aluminum, fragrances, or parabens. All of these ingredients can cause irritation for sensitive skin. [3] X Research source"
    },
    {
      "title": "Choose a gel formula to avoid getting white marks on your clothes.",
      "content": "Choose a gel formula to avoid getting white marks on your clothes. If you don’t wait long enough for your antiperspirant to dry before putting on your shirt, you’re likely to end up with white marks along the sides. Clear gels will prevent these white smears (although you should still wait to let them dry before you put on your shirt). [4] X Research source Gels do have some downsides—they can be sticky and dry out your skin a bit."
    },
    {
      "title": "Go for a spray if you have a lot of underarm hair.",
      "content": "Go for a spray if you have a lot of underarm hair. Antiperspirant sprays can be great for those who are having trouble swiping the product directly onto their skin. Simply mist the spray into your underarm area. [5] X Research source Consider choosing a different alternative if you shave your armpits, since sprays can irritate freshly-shaved skin. If you still plan to use a spray antiperspirant, wait 24 to 48 hours after shaving before applying it to your underarms."
    },
    {
      "title": "Buy clinical strength antiperspirant for heavy sweating.",
      "content": "Buy clinical strength antiperspirant for heavy sweating. If you find yourself sweating even after correctly applying regular antiperspirant products, you may want to try a clinical strength version. Look for labels marked \"clinical strength.\" [6] X Research source Clinical strength products must plug the sweat duct by at least 30%, while regular products only need to block it by 20%."
    },
    {
      "title": "Switch brands every 6 months to keep from building up immunity.",
      "content": "Switch brands every 6 months to keep from building up immunity. Your armpits smell because of bacteria on your skin that break down the proteins in your sweat—not the sweat itself. These bacteria can build up immunity to your particular formula of antiperspirant over time. Make sure to change brands every 6 months or so to keep your antiperspirant effective. [7] X Research source"
    },
    {
      "title": "Wash your underarms with an antibacterial soap.",
      "content": "Wash your underarms with an antibacterial soap. It’s probably easiest to do this while taking a shower or a bath. Make sure you wash your armpits thoroughly—antiperspirants work best when applied to clean skin. [8] X Research source Experts recommend applying your antiperspirants before you go to bed, which means it would be best to take your shower or bath in the evening. If you’ve shaved your armpits while in the shower, you should wait 24-48 hours before applying antiperspirant to avoid rashes or irritation."
    },
    {
      "title": "Fully dry your underarms with a towel.",
      "content": "Fully dry your underarms with a towel. Use a soft towel and pat your skin dry to keep from irritating your underarms. Antiperspirant works best when it is applied to totally dry skin. [9] X Research source You may even want to wait 15 or 20 minutes to allow your skin to completely air dry. [10] X Research source"
    },
    {
      "title": "Apply a thin, even layer of antiperspirant to your underarms.",
      "content": "Apply a thin, even layer of antiperspirant to your underarms. A good rule of thumb is to apply 2 downward strokes and 2 upwards strokes for each armpit. A thick layer of antiperspirant won’t work any better than a thin layer, so don’t overdo it. [11] X Research source If you have armpit hair, you may need to apply additional pressure to the tube to get through to the skin underneath. [12] X Research source Make sure you’re shirtless while applying antiperspirant to avoid staining your clothes. If you’re using spray antiperspirant, give the bottle several shakes and spray it for 2-3 seconds at a distance of at least 6 inches (15 cm). If you’re using a cream, scoop about 2 peas’ worth out with your fingers and gently rub it into your armpit until it’s fully absorbed. [13] X Research source"
    },
    {
      "title": "Wait several minutes until the antiperspirant is completely dry.",
      "content": "Wait several minutes until the antiperspirant is completely dry. You can allow the product to air-dry in your armpits. Or, to speed up the process, you can even use a hairdryer on its cool setting. [14] X Research source Once it’s dry, you can put on your shirt."
    },
    {
      "title": "Allow the antiperspirant to absorb fully overnight.",
      "content": "Allow the antiperspirant to absorb fully overnight. If there’s any residue in your armpits the next morning, you can rinse it off with water and soap. This will not ruin the effectiveness of the antiperspirant—once it has set, it should last anywhere from 24 to 48 hours even if you rinse out your armpits. [15] X Research source If you apply antiperspirant in the morning, generally the product doesn’t have enough time to fully plug the sweat glands before you start sweating."
    },
    {
      "title": "Reapply based on your brands’ instructions.",
      "content": "Reapply based on your brands’ instructions. Antiperspirants can last up to 48 hours, depending on their formulas. Check the label on your particular brand to see how long it lasts. When you reach the end of that period, repeat this process with a new layer of antiperspirant. [16] X Research source"
    }
  ]
}