{
  "url": "https://www.wikihow.com/Write-a-Motion-to-a-Judge",
  "title": "How to Write a Motion to a Judge",
  "steps": [
    {
      "title": "Check if a motion is available.",
      "content": "Check if a motion is available. One common motion is a motion for summary judgment. You can bring the motion in certain circumstances and only at specific points in the law suit. To file a motion for summary judgment, there must be no issues of material fact in dispute. If there is, then the case must go to trial so that the jury can decide the factual dispute. [2] X Research source An issue is “material” if it would make a difference in the lawsuit. For example, if you are suing because someone ran a red light and hit your car, then whether the light was red or green is an issue of material fact. [3] X Research source A non-material fact would be whether the car was colored red or green. You can bring the motion for summary judgment after you and the other party have finished swapping documents during the “discovery” phase of the lawsuit."
    },
    {
      "title": "Get a sample.",
      "content": "Get a sample. You should try to find a sample motion to use when drafting your own. This will make it easier to assure that the motion looks right. You can get a sample motion from the court clerk or by looking in a CD or book of legal forms. You should also search on the Internet. For example, if you are filing a Motion to Dismiss in California, then type “California motion to dismiss” in your favorite search engine. By searching for the specific type of motion that you want to bring, you can also get tips on what to say in the motion."
    },
    {
      "title": "Open a word processing document.",
      "content": "Open a word processing document. To begin, open a blank word processing document. Set the font to a size and style that looks comfortable. For ease, you should make the font the same as the font used in other documents filed in your case, such as the complaint or answer. Based on your sample, check to see if you need to use special paper. Some courts require that you use numbered paper, which is called “pleading paper.” With this paper, each line is assigned a number in the left-hand column. Other courts will simply request that you number your paragraphs. If you need to use numbered pleading paper, then you can purchase this paper from a stationery store. You may also be able to find pleading paper offered by a law library, such as the LA Law Library."
    },
    {
      "title": "Insert the caption.",
      "content": "Insert the caption. The caption is the information that appears at the top of the page on the first page of every document you file in court. The caption generally includes the name of the court, the names of the parties, the case number, and possibly the name of the judge. [4] X Research source You can find the caption on any prior motion or complaint filed in the court case. Take out your copy and find this information. Then plug it into your word processing document."
    },
    {
      "title": "Title your motion.",
      "content": "Title your motion. You should give the motion a title based on what you want the court to do. You can bring a motion for almost anything: Compel a witness to give a deposition. In this situation, title the motion, “Motion to Compel Witness Testimony.” Have the case dismissed. Title the motion “Motion to Dismiss.” Ask for more time. Title the motion “Motion for Continuance” or “Motion for Extension of Time.”"
    },
    {
      "title": "Introduce yourself.",
      "content": "Introduce yourself. In the first paragraph of the motion, you should introduce who you are and what you are asking for. [5] X Research source For example, if you are asking for a continuance, then the opening paragraph might read: “COMES NOW the Defendant, Sherry Adams, in the above captioned case, and respectfully requests that the court continue the matter set for June 22, 2016.”"
    },
    {
      "title": "Research the law.",
      "content": "Research the law. In the second paragraph you need to give the judge a legal reason to grant the motion. Judges are limited in what they can do. It is your responsibility to tell the judge the law or rule which allows the judge to grant your motion. For example, if you want the case dismissed, then you need to research the state’s “Rules of Civil Procedure” or “Rules of Criminal Procedure” and find the rule number which authorizes motions to dismiss. Type “Rules of Civil Procedure” and “your state” into your favorite web browser. Often, states publish their rules on the Internet. You can also visit your nearest law library. It should be either at the courthouse or at a nearby law school. Tell the librarian the motion you are bringing and what law you are researching. Check any sample motion to see what law is cited. If you have a sample Motion to Dismiss, then you might be able to cite the same legal rules and cases in the sample, if the sample is also a Motion to Dismiss for your state. You can also meet with a lawyer . Many lawyers will perform discrete tasks, such as legal research, for a flat fee."
    },
    {
      "title": "Explain supporting facts.",
      "content": "Explain supporting facts. After telling the judge the legal basis for your request, you should explain supporting facts. Try to be as concise as possible. [6] X Research source There is no reason to drown the judge in irrelevant facts. For example, if you need a continuance, then you should state the factual reasons why you need the continuance. Irrelevant information would be the difficulty you are having with the other side’s lawyer or general complaints about how busy your life is. You can state, “In support of this request, Defendant states the following….” Then list the facts that support your motion."
    },
    {
      "title": "Redact sensitive information.",
      "content": "Redact sensitive information. Because motions are public documents, you should be careful about the information you include in them. For example, you should not include social security numbers, dates of birth, financial account information, or the full names of minor children. [7] X Research source If you need to include a social security number, then include only the last four digits: XXX-XX-9912. Also represent birthdates only by the year: xx-xx-1966. Should you need to identify minor children, then use initials: S.P. instead of Sandra Price."
    },
    {
      "title": "Add a conclusion.",
      "content": "Add a conclusion. The conclusion is basic. You simply need to repeat your request for the judge to grant the motion. For example, you can state, “WHEREFORE, the plaintiff requests that the Court grant her request for a continuance.”"
    },
    {
      "title": "Insert a signature block.",
      "content": "Insert a signature block. Every motion must be signed. You should insert “Respectfully submitted” and then insert a line below for your signature. Underneath the signature line, you should add your address and telephone number. Also put your email address if you have one."
    },
    {
      "title": "Add a certificate of service, if necessary.",
      "content": "Add a certificate of service, if necessary. You need to send a copy of the motion to the other party. You also need to certify to the court that you have sent a copy of the motion. In your certification, you should state the date you sent it and the method you used. Use a separate piece of paper. At the top, insert the title “Certificate of Service.” Then explain how you made service. For example, you could state, “I, Sherry Adams, hereby certify that a copy of the above ‘Motion for Continuance’ was served on counsel for Plaintiff by first class mail, postage prepaid at 100 Main Street USA, Big City, KY 00000 on June 12, 2016.” [8] X Research source Before typing up a certificate of service, you should first find out how you can serve a copy of the motion. You should call up the court clerk and ask."
    },
    {
      "title": "Complete an order.",
      "content": "Complete an order. Some courts require that you submit a proposed order along with the motion. The order is the document which summarizes the court’s judgment. It should be on a separate sheet of paper. It should be set up as follows: Insert the caption. Use the same caption information as you did for the motion. Title the document “Order.” Make the title bold and in all caps. Type the substance of the order: “Now on this [insert date of your hearing] this matter comes on for hearing on Defendant’s pro se Motion for Continuance. After being duly and fully advised and hearing the position of the Plaintiff, the Court finds that….” Insert two options with a check box beside each: “The motion is denied” or “The Motion is granted and the hearing is rescheduled for [insert blank line].” Add “IT IS SO ORDERED” and put a signature line under the words. Under the signature line, type the judge’s name, such as “Mable Jones, District Judge.”"
    },
    {
      "title": "Attach affidavits.",
      "content": "Attach affidavits. If you make factual allegations in the motion, then you need to attach an affidavit in support. An affidavit is a sworn statement. If you can’t attend your trial in two weeks because you have been diagnosed with cancer and need to attend chemotherapy on that date, then get an affidavit from your doctor. For more information, see Write an Affidavit ."
    },
    {
      "title": "Stop into the court.",
      "content": "Stop into the court. Many courts now have “fill in the blank” motion forms that you can use. These forms are helpful if you are representing yourself and don’t have a lawyer. [9] X Research source You can stop into the clerk’s office and ask. Also, you can check the court’s website. Often, court forms are hosted on the state supreme court’s website."
    },
    {
      "title": "Fill in the caption information.",
      "content": "Fill in the caption information. At the top of the motion is the caption information. A caption includes the name of the court, the names of the parties, the case number, and sometimes either the judge’s name or the courtroom number. [10] X Research source Take out another motion or court document filed in your case and copy the caption information from that document. The caption should be the same throughout the entire case."
    },
    {
      "title": "Decide what you are asking for.",
      "content": "Decide what you are asking for. On the motion form, you need to tell the judge what you are asking for. There should be a paragraph or two for you to state the following: [11] X Research source The applicable law. Find out what law authorizes the court to do what you want it to do. If you are representing yourself, then you generally will be given some leeway in this area. However, you should stop into a law library and ask to see the law that authorizes the motion. What you are asking the judge to do. For example, you may be requesting a continuance so that you can prepare for an upcoming trial. You should make that request in the appropriate space on the motion form."
    },
    {
      "title": "Fill out the form neatly.",
      "content": "Fill out the form neatly. You should either type or print the information on the motion. If you print, then make sure you print legibly using black ink. Some forms can be filled in as a PDF on your computer. You can then save the motion form and print it off."
    },
    {
      "title": "Sign the motion.",
      "content": "Sign the motion. All motions must be signed. Fill in information about your phone number and address. [12] X Research source Some motion forms might need to be notarized. The form should state whether it needs to be notarized. Usually, there is a notary in the courthouse you can use. If not, then visit the locator page at the website for the American Society of Notaries. [13] X Trustworthy Source American Society of Notaries Non-profit organization providing education, training, and supplies to notaries in the United States. Go to source Enter your address and find the nearest notary."
    },
    {
      "title": "Make copies.",
      "content": "Make copies. You will need to send a copy of your motion to the other side. You should also keep a copy for your own records. Accordingly, make a few copies and take them with you when you go to court to file. Be sure that the copies are clear and legible. The other party needs to be able to read your motion in order to respond to it."
    },
    {
      "title": "File with the court clerk.",
      "content": "File with the court clerk. Ask the court clerk to file. You should file the original motion, which has your original signature. [14] X Research source The clerk should stamp all of your copies with the date. You may have to pay a filing fee, depending on the motion and the court. Ask the court clerk. If you can’t afford the fee, then ask for a fee waiver form and fill it out."
    },
    {
      "title": "Schedule a hearing.",
      "content": "Schedule a hearing. Courts differ a little about how they schedule hearings. If you need a hearing date, then some courts will have you fill out a Notice of Hearing form. You then will get a hearing date from the clerk and insert that information on the form. You must then send a copy of the notice to the other party along with a copy of your motion. However, some courts might not schedule hearings until later. The clerk will then notify all parties of the day and time for the hearing. You should ask the court clerk what process they use at the courthouse. Not every motion will require a hearing. It is up to the judge to decide whether a hearing is necessary. When no hearing is required, the judge will decide the motion based on the documents submitted. [15] X Research source"
    },
    {
      "title": "Serve a copy on the other party.",
      "content": "Serve a copy on the other party. You should serve a copy of the motion using whatever method you state that you used in your certificate of service. If the other party has an attorney, remember to send the copy of the motion to the lawyer. [16] X Research source Always keep a copy of the motion for your records."
    }
  ]
}