{
  "url": "https://www.wikihow.com/Treat-a-Pinched-Nerve",
  "title": "How to Treat a Pinched Nerve",
  "steps": [
    {
      "title": "Recognize a pinched nerve.",
      "content": "Recognize a pinched nerve. A pinched nerve occurs when a nerve is damaged in some way and unable to fully send its signals. It is caused when a nerve gets compressed, which can be due to a herniated disc, arthritis, or bone spurs. You can also get a pinched nerve from other situations and activities such as injury, poor posture, repetitive motions, sports, hobbies, and obesity. Pinched nerves can occur all over the body, although they are most common in the spine, neck, wrists, and elbows. These conditions cause inflammation, which constricts your nerves and causes them to become pinched. Poor nutrition and general health can worsen a pinched nerve. This condition can be reversible or irreversible, depending on the severity of the case. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Notice the symptoms.",
      "content": "Notice the symptoms. A pinched nerve is essentially a physical obstruction of body’s wiring system. The symptoms of a pinched nerve usually include numbness, minor swelling, sharp pain, tingling, muscle spasms, and muscle weakness. [3] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020. A pinched nerve is typically associated with shooting pains in the affected area. These symptoms happen because the nerves are not effectively sending signals through the body due to the compression or obstruction to your nerve. [4] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.)."
    },
    {
      "title": "Avoid overuse.",
      "content": "Avoid overuse. Once you diagnose your pinched nerve, you need to start taking care of yourself. You should stay off of the affected body part or use it less. Repetitive use of muscles, joints, and tendons that have caused the compressed nerves will make it worse. [5] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020. This is because the surrounding areas continue to swell and constrict the nerve. The easiest way to get a bit of immediate pain relief from any compressed nerve is to rest the pinched nerve and the surrounding area until the swelling and compression completely subsides. You should avoid flexing and moving the area of the pinched nerve so you don't pinch the nerve even further. There are certain movements that cause your symptoms to immediately get worse, and these movements should be avoided if at all possible. If a certain movement or position causes increased symptoms and pain, isolate the injured area and avoid doing that movement. In the case of carpal tunnel, a common injury that is caused by a pinched nerve, keeping the wrist straight during sleep and avoiding any bending of the joint will provide the most relief from any compression. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get some sleep.",
      "content": "Get some sleep. Sleeping extra hours is the natural way for your body to repair damage. If necessary, take the time to sleep extra hours each night until you feel better or the pain subsides. A couple hours of extra rest for your body and the injured area should help decrease the symptoms significantly. This works directly with limiting overuse. If you sleep more, you are moving less. Not only will you not overuse the affected area, your body will have more time to heal itself as you sleep."
    },
    {
      "title": "Use a brace or splint.",
      "content": "Use a brace or splint. There may be times where you cannot rest the affected nerve as much as you want because of work, school, or other obligations. If this is the case, you can wear a brace or splint to immobilize the injured area. This will allow you to do some basic work like usual. For example, if the pinched nerve is in your neck, use a neck brace to help hold the muscles still throughout your day. If your pinched nerve is the result of carpal tunnel syndrome, use a wrist or elbow brace, also known as a volar carpal splint, to avoid an unnecessary movement. [7] X Research source Agabegi, S. (2013). Step-up to medicine (3rd ed.). Philadelphia: Wolters Kluwer/Lippincott Williams &amp; Wilkins. Braces can be found at most retail drug stores. Follow the instructions provided with the brace. If you have any questions or concerns, consult your doctor for additional help."
    },
    {
      "title": "Apply ice and heat.",
      "content": "Apply ice and heat. A pinched nerve is often accompanied by swelling, and swelling can compress the nerve even further. To help reduce swelling and increase circulation, rotate between periods of using ice and heat on the area of the pinched nerve, which is a method called hydrotherapy. Apply ice for 15 minutes 3-4 times a day to help reduce inflammation. After that, apply a heat pad to the affected area for 1 hour for 4-5 nights a week until your symptoms get better. Place an ice pack, either a store bought one or a homemade one, over the affected area with light pressure. The pressure will help to cool the affected area. Keep a soft cloth between the ice pack and your skin to prevent any burns from the cold. Do not use for more than 15 minutes because it slows blood flow, which stalls healing. Use a hot water bottle or a heat pad after icing to encourage blood flow, which can help to speed up the healing process. Do not heat for over an hour because it can increase inflammation. You can also take a hot bath or soak the pinched nerve in hot water to relax the muscles in the area and increase blood flow."
    },
    {
      "title": "Get a massage.",
      "content": "Get a massage. Applying pressure to the pinched nerve can help to relieve tension and reduce pain. Get a full body massage to help induce relaxation in all your muscles, relaxing the affected area as well. You can also get a gentle, targeted massage of the area near the pinched nerve. This will offer more specific relief and help the nerve to heal. You can also massage the affected area yourself to get some relief. Gently knead the area with your fingers to increase blood flow and loosen any muscles that may be contributing to the compression of your nerve. Avoid intense deep-tissue massage or heavy pressure because this could apply unnecessary pressure and worsen the pinched nerve. [8] X Research source"
    },
    {
      "title": "Take pain relieving medication.",
      "content": "Take pain relieving medication. Many over-the-counter pain relievers are great for treating a pinched nerve. Try taking non-steroidal anti inflammatory drugs (NSAIDs) such as ibuprofen and aspirin to reduce any swelling and pain. Follow the instructions provided with your medication and review all warnings. Consult a doctor if you are unsure about dosing or side effects, especially if you have other medical problems or take other medications."
    },
    {
      "title": "See a doctor.",
      "content": "See a doctor. If the symptoms and pain subside but continue to come back over the course of several weeks or months, consult your doctor for help. [9] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020. Even if the suggested methods to alleviate symptoms were originally helpful, if they no longer provide relief, you need to get the area checked. You should also see a doctor if you feel constant numbness or pain in the area despite minimal use or if the muscles in the affected area feel weaker over time. Seek immediate treatment if the symptoms are severe or the area feels cold or appears very pale or blue."
    },
    {
      "title": "Perform low-impact exercise.",
      "content": "Perform low-impact exercise. [10] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020. You can rest your pinched nerve and still keep your blood pumping. Good blood and oxygen circulation and toned muscles can actually help heal the pinched nerve. Daily activity should be done conservatively and only when it is comfortable for you. Try going swimming or for walks. These will help to move your muscles naturally while placing a minimal amount of stress on the joints and tendons where the pinched nerve is. Inactivity can lead to a loss of muscle strength and cause the healing process of the pinched nerve to take much more time. [11] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.). [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Keep good posture when exercising or resting. This will help to ease tension at the location of the pinched nerve. Maintaining a healthy weight can help prevent a pinched nerve."
    },
    {
      "title": "Increase calcium intake.",
      "content": "Increase calcium intake. One of the underlying factors of a pinched nerve is a calcium deficiency. You should start eating more calcium rich foods such as dairy products like milk, cheese, and yogurt and leafy greens like spinach and kale. This can help the nerve and also improve your overall health. You can also take calcium as a supplement. You can buy these from many health food stores, general stores, or pharmacies to take on a daily basis. Follow the directions or consult your doctor if you are unsure of how much calcium to take. Never take more than the recommended dose. Check labels of packaged foods to see if they are calcium fortified. Many brands offer a calcium enriched product in addition to their usual products."
    },
    {
      "title": "Eat more foods with potassium.",
      "content": "Eat more foods with potassium. Potassium is a key ion involved in cell metabolism. Because it causes weaker connections between nerves, a lack of potassium can sometimes contribute to symptoms of a pinched nerve. Increasing potassium in the diet may help to restore proper balance to your nerve function and alleviate your symptoms. Foods rich in potassium include apricots, bananas, avocados, and nuts. Drinking fluids like skim milk and orange juice can help to increase potassium absorption. Potassium supplements, similar to calcium supplements, can be taken on a regular basis in addition to a healthy diet. Talk to your doctor before taking potassium supplements, especially if you have other medical problems (especially problems with your kidneys) or take other medications. Your doctor may want to check your blood for potassium levels before recommending supplements. Potassium deficiency is diagnosed by a doctor. To help rectify a potassium deficiency, your doctor may recommend a diet with increased potassium intake after assessing the underlying cause. Consult your doctor if you suspect this could be an issue. [13] X Research source [14] X Research source"
    },
    {
      "title": "See a physical therapist.",
      "content": "See a physical therapist. If you are having problems and no method has worked, you might consider seeing a physical therapist. She can give you specialized stretches and exercises that aid in healing a pinched nerve. Certain exercises relieve the pressure on the pinched nerve, helping to reduce pain. Many of the stretches used in this healing process must be done with a trained professional or partner, so don't do them on your own. As time goes on, your physical therapist may give you additional exercises that can be done on your own. Don't do any of the exercises alone unless she tells you to do so."
    },
    {
      "title": "Consider epidural steroid injection.",
      "content": "Consider epidural steroid injection. This treatment, used mainly in treating a pinched sciatic nerve, can alleviate pain and help to heal the nerve. It involves a steroid shot to the spine and can only be injected by a doctor. After being evaluated by your doctor for the degree and type of pinched nerve you have, she may discuss this option with you. [15] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.). Epidural steroid injections can be a quick and effective means of getting relief from your pain. When this procedure is performed by a trained medical professional, any side effects and dangers are considered remote. However, rare side effects may include nausea, vomiting, diarrhea, backache, and bleeding from the site of injection. [16] X Research source"
    },
    {
      "title": "Talk to your doctor about surgery.",
      "content": "Talk to your doctor about surgery. For significant pain or symptoms that are not improved with other treatments, surgery on the pinched nerve may be the best treatment. The surgery may be to relieve pressure or to remove the part of the area that is pinching the nerve. Surgery usually provides relief after recovery. Recurrence of the pinched nerve may occur but is typically rare. A pinched nerve in the wrist may involve cutting muscle tissue to alleviate pressure in the area. Pinched nerves caused by a herniated disc may be corrected by removing part or all of the disc, followed by spinal stabilization. [17] X Research source Agabegi, S. (2013). Step-up to medicine (3rd ed.). Philadelphia: Wolters Kluwer/Lippincott Williams &amp; Wilkins. [18] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.)."
    },
    {
      "title": "Strive for continued relief.",
      "content": "Strive for continued relief. Even after symptoms have subsided, it is important to continue to properly exercise, maintain proper body mechanics and good posture, and avoid previously discussed risk factors. Recovery from pinched nerves will depend on a number of factors including the degree of nerve impingement, maintenance of a treatment regimen, and any underlying disease processes. Full recovery is common in pinched nerves in the back. Acute low back pain caused by pinched nerves usually subsides within about 6 weeks of targeted care in 90% of individuals. [19] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.)."
    },
    {
      "title": "Avoid future pinched nerves.",
      "content": "Avoid future pinched nerves. Most pinched nerves will recover completely and, in most individuals, symptoms will be get better with proper treatment. To prevent re-injury, avoid any repetitive motions that have previously caused pinched nerves. [20] X Expert Source Joshua Grahlman, PT, DPT, FAFS Physical Therapist & Entrepreneur Expert Interview. 8 September 2020. The most important thing you can do is to listen to your body. If a movement begins to cause discomfort or symptoms of a pinched nerve appear, stop what you are doing at the time and allow the affected area to recover. Talk with your doctor about a plan and regimen to properly care for and balance the use, rest, and isolation of your previously affected nerve. The use of a brace as a preventive measure before a nerve is pinched can help."
    }
  ]
}