{
  "url": "https://www.wikihow.com/Survive-a-Car-Accident-as-a-Pedestrian",
  "title": "How to Survive a Car Accident as a Pedestrian",
  "steps": [
    {
      "title": "Seek to protect your head.",
      "content": "Seek to protect your head. Broken bones and internal bleeding can be serious, but head injuries are commonly life-threatening. Doing what you can to avoid sustaining a head injury could save your life. Cover your head with your arms immediately, so that your forehead is in the crook of your elbows and your palms are at the back of your head. Try to position your body so that the impact of the crash doesn't come near your head. Above all, try to avoid having your head anywhere near the wheels of the car."
    },
    {
      "title": "Aim for the safety glass.",
      "content": "Aim for the safety glass. The safety glass in all newer (post-1970s) cars is shatter-proof and can act as a \"cushion\", absorbing the energy of the impact, and hopefully breaking the glass and not you. If you can, try to roll into a ball with your back or bottom to the glass, while keeping your head tucked between your elbows."
    },
    {
      "title": "Try to get on top of the hood.",
      "content": "Try to get on top of the hood. Rolling on top of the car is still dangerous and will probably cause injury, but it's better than ending up on the ground and having the car roll over you. Jump a bit as the car comes at you. At lower speeds, you can attempt go onto the hood and over the cab on foot. This is probably the best way if your are expecting it––or if you are being targeted by the driver. Note that this will be less successful on larger vehicles."
    },
    {
      "title": "Stay on designated walkways.",
      "content": "Stay on designated walkways. Sidewalks and crosswalks are generally safe havens for pedestrians on the road, so try to use them whenever possible. [1] X Research source If you can't walk on a sidewalk, walk so that you're facing oncoming traffic. That is, if drivers stay to the right side of the road, you should be walking on the left side of the road."
    },
    {
      "title": "Watch for traffic.",
      "content": "Watch for traffic. Look right and left before crossing the street, even if you're in a crosswalk and the signal is green. Be aware that having the right of way won't prevent you from being hit. An incapacitated or drowsy driver won't notice that you're on the sidewalk, or that you have a crosswalk signal. Pay attention to erratic driving and get well out of the way, quickly. Stay alert . Keep your eyes and your attention on your surroundings. If you're walking through a high-traffic area, consider putting away your phone and not listening to music so you can devote your attention to staying safe."
    },
    {
      "title": "Make yourself visible to drivers.",
      "content": "Make yourself visible to drivers. Ensure that motorists can see you well enough in advance to steer away from a potential accident. Here's what you can do: Wear bright clothing. Or, if you'll be walking at night, wear clothing with reflective strips (or place them on your backpack) or carry a flashlight. Stay out of the blind spot. If you can't see the driver's face in his or her driver's side mirror, you're in the blind spot. Be aware that the driver might not know you're there. This should include when the driver making a right turn is so intent on checking cars coming from the left, that even if it's your walk signal, the driver neglects to check for pedestrians when making the right turn. Make eye contact [2] X Research source . If you're going to cross the road in front of a car that is stopped or in the process of stopping, try to make eye contact with the driver. This verifies to both of you that the other is there."
    },
    {
      "title": "When in doubt, don't cross.",
      "content": "When in doubt, don't cross. If you suspect that the driver can't see you, or that you might not be able to make it across the street in time to avoid traffic, wait it out. Traffic moves in cycles, and a better opportunity might open up in a minute or two. You might get a few minutes behind, but you'll potentially save yourself from a risky crossing. Find an alternate route. If you're having trouble getting across a busy road, consider walking a few blocks away to another crosswalk. Again, it's better to spend a few more minutes getting across the road than crossing dangerously."
    }
  ]
}