{
  "url": "https://www.wikihow.com/Use-AllShare",
  "title": "How to Use AllShare",
  "steps": [
    {
      "title": "Verify that your Samsung devices are connected to the same wireless network.",
      "content": "Verify that your Samsung devices are connected to the same wireless network. SmartThings will only work if your Samsung phones and TVs are connected to the same network. Samsung SmartThings only works with Samsung TVs. If your smartTV is a different brand, you can check the Google Play Store to see if there is a separate app you can use for your TV's brand."
    },
    {
      "title": "Turn on your Samsung TV.",
      "content": "Turn on your Samsung TV. Use the remote or panel buttons to turn on your Samsung SmartTV. Make sure it is connected to your wireless network."
    },
    {
      "title": "Open the SmartThings app on your phone or tablet.",
      "content": "Open the SmartThings app on your phone or tablet. The SmartThings app comes pre-installed on most Samsung smartphones and tablets. It has an icon with 6 blue circles in the shape of a star. Tap the icon in your Apps menu to open the SmartThings app. You may need to create a new Samsung account . If you do not have the SmartThings app installed on your Smartphone, you can download it from the Google Play Store or the App Store on iPhone and iPad. Alternatively, SmartView can be used to view media files on your TV. SmartView will not be available for download after October 2020. However, it will continue to work if you still have it installed on your phone or tablet."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . It's the plus (+) icon to the right on the SmartThings Home screen. This option allows you to add new devices and services to SmartThings."
    },
    {
      "title": "Tap Devices.",
      "content": "Tap Devices . This allows you to add a new device to your Samsung phone."
    },
    {
      "title": "Tap TV.",
      "content": "Tap TV . It has an icon that resembles a TV screen. In addition to TVs, SmartThings allows you to add other smart devices like kitchen appliances and smart lights to your SmartThings app."
    },
    {
      "title": "Tap Samsung or Kiot.",
      "content": "Tap Samsung or Kiot . Samsung and Kiot are currently the only brands supported by SmartThings. Tap whichever brand your TV is."
    },
    {
      "title": "Tap TV.",
      "content": "Tap TV . It's the only option at the top of the menu. If you need to check to see if your TV is supported, tap Supported devices at the bottom to see a list of Samsung TV models that are supported."
    },
    {
      "title": "Tap Start.",
      "content": "Tap Start . It's the blue button at the bottom."
    },
    {
      "title": "Select a location and room and tap Next.",
      "content": "Select a location and room and tap Next . \"Home\" is the default location. Use the following steps to change your location and select a room: Tap the drop-down menu to the right of Location . Tap Add new location . Type the name of your location. Tap Done . Tap the drop-down menu next to Room . Tap Add new room . Tap a room from the list of options. Tap Save . Tap Next ."
    },
    {
      "title": "Tap your TV.",
      "content": "Tap your TV. If your TV is connected to your wireless network, it will appear in the list of available devices. This will update your TV with the latest features. Once it is done, a PIN will appear on the TV."
    },
    {
      "title": "Enter the PIN and tap Done.",
      "content": "Enter the PIN and tap Done . Once the PIN appears on your TV screen, enter the PIN on your Phone and tap Done ."
    },
    {
      "title": "Enter your wi-fi password and tap Next.",
      "content": "Enter your wi-fi password and tap Next . If this is the first time adding a device to SmartThings, you will be required to enter your Wi-Fi password."
    },
    {
      "title": "Agree to the terms and conditions and tap Ok.",
      "content": "Agree to the terms and conditions and tap Ok . Read the terms and conditions and tap the radio button that says I agree to all at the bottom. Then tap Ok ."
    },
    {
      "title": "Give the TV a name and tap Next.",
      "content": "Give the TV a name and tap Next . By default, your TV name is the make and model of your Samsung TV. You can either leave it as is or give your TV a different name. Tap Next when you are ready to continue."
    },
    {
      "title": "Tap Back up my data (optional) and tap Next.",
      "content": "Tap Back up my data (optional) and tap Next . If you want to back up your TV settings to the cloud, tap the radio option next to Back up my data , and tap Next ."
    },
    {
      "title": "Turn on any devices that have ARC control and tap Next.",
      "content": "Turn on any devices that have ARC control and tap Next . If you have any game consoles or cable boxes that are connected to your Samsung TV via the HDMI ARC input, turn them on so the SmartThings app can connect to them as well. When you are ready to continue, tap Next ."
    },
    {
      "title": "Tap Next.",
      "content": "Tap Next . This saves your TV setup. You can now access the remote options for your Samsung TV in the Home screen of the SmartThings app. The options will vary depending on your TV model. You will have the option to change channels, control the volume, turn the TV on and off. You may also have other options like the ability to mirror your phone screen or audio to your TV.."
    },
    {
      "title": "Ensure your smartphone or tablet and TV are connected to the same wireless network.",
      "content": "Ensure your smartphone or tablet and TV are connected to the same wireless network. Casting allows you to play streaming media on your phone and then cast it to your TV. You can control the playback from your phone. In order for this to work, both your smartphone and your smartTV must be connected to the same wireless network. This works with any smart TV that supports SmartCast. It does not have to be a Samsung TV."
    },
    {
      "title": "Open a media streaming app on your smartphone or tablet.",
      "content": "Open a media streaming app on your smartphone or tablet. Most popular media streaming apps, including Netflix, YouTube, Amazon Prime Video, Hulu, Spotify, Pandora, and more support Smartcast."
    },
    {
      "title": "Play a video you want to cast.",
      "content": "Play a video you want to cast. It can any video that is available on a media streaming app."
    },
    {
      "title": "Tap the cast button.",
      "content": "Tap the cast button. It's typically found in the upper-right corner of the video playback. This will search for available devices to cast to."
    },
    {
      "title": "Tap your TV.",
      "content": "Tap your TV. If your TV is powered on and connected to your wireless network, it will appear in the list of available devices. Tap your TV to cast the video playback on your phone or tablet to your TV."
    },
    {
      "title": "Create a Samsung account",
      "content": "Create a Samsung account . Signing up for a Samsung account gives you access to services such as the Samsung Cloud Drive. You can use Samsung Cloud Drive to backup your files and transfer them from your phone or tablet to your PC. Use the following steps to create a new Samsung account. Open the Settings app. Tap Accounts and backup . Tap Accounts . Scroll down and tap Add account Tap Samsung account Fill out the form and tap Next . Agree to the terms and conditions."
    },
    {
      "title": "Locate a file you want to transfer to your computer.",
      "content": "Locate a file you want to transfer to your computer. This can be an image for video from your Gallery or a file in the My Files app."
    },
    {
      "title": "Long press the file you want to share.",
      "content": "Long press the file you want to share. This displays a circle with a checkmark next to the file. If you want to transfer more than one file, click the checkbox next to any other files you want to transfer."
    },
    {
      "title": "Click the share icon.",
      "content": "Click the share icon. It's at the bottom of the screen. It has an icon that resembles three dots connected by two lines. This displays apps you can use to share your files."
    },
    {
      "title": "Tap Samsung Galaxy Drive.",
      "content": "Tap Samsung Galaxy Drive . It has a blue icon with a cloud in the middle."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . This saves the file to Samsung Cloud Drive. You can also tap a folder to save it to in Samsung Cloud Drive, or tap Create folder to create a new folder."
    },
    {
      "title": "Go to https://support.samsungcloud.com/#/login in a web browser.",
      "content": "Go to https://support.samsungcloud.com/#/login in a web browser. You can use any web browser on PC or Mac. This is the website where you can access files saved to Samsung Cloud Drive and download them."
    },
    {
      "title": "Sign in to your Samsung account.",
      "content": "Sign in to your Samsung account. Use the following steps to sign in to your Samsung account: Click Sign In in the middle of the screen. Enter the email address and password associated with your Samsung account. Click the checkbox next to I'm not a robot . Click Sign In . Check your text messages for the verification code. Enter the verification code and click Verify ."
    },
    {
      "title": "Click Samsung Cloud Drive.",
      "content": "Click Samsung Cloud Drive . It's in the menu bar to the left. This displays all the files in your Samsung Cloud Drive. You may be asked to verify your account. If so, unlock your mobile phone or tablet and tap Allow ."
    },
    {
      "title": "Check all the files you want to download to your computer.",
      "content": "Check all the files you want to download to your computer. Place the mouse cursor over a file to display the check circle to the left. Click the circle to check an item."
    },
    {
      "title": "Click the download icon.",
      "content": "Click the download icon. It's the icon that resembles a square with an arrow in the middle. This downloads all checked items to your computer. By default, you can find your downloaded files in your Downloads folder."
    }
  ]
}