{
  "url": "https://www.wikihow.com/Turn-a-Breech-Baby",
  "title": "How to Turn a Breech Baby",
  "steps": [
    {
      "title": "Try the breech tilt.",
      "content": "Try the breech tilt. The breech tilt is the most commonly used exercise for turning breech babies. It can help the baby to tuck their chin (known as flexion), which is the first step in flipping over. [2] X Research source To perform the breech tilt, you need to elevate your hips between 9 and 12 inches (23-30 cm) above your head. There are several ways of doing this. The easiest way is simply to lie on the ground and prop your hips up with pillows. Alternatively, get a broad plank of wood (or even an ironing board) and prop it up against a bed or a couch with a non-slip yoga or floor mat underneath. Lie on the board so your head is at the base (supported by a pillow) and your feet are at the raised end. Have a spotter nearby for safety. Do this 3 times a day for 10 to 15 minutes each time, on an empty stomach, and during times when the baby is active. Try to relax and breathe deeply as you perform the exercise, and avoid tensing the abdominal muscles. For added benefit, you can combine the breech tilt with the application of heat and ice, or sound."
    },
    {
      "title": "Do the knee-to-chest exercise.",
      "content": "Do the knee-to-chest exercise. This exercise uses gravity to potentially encourage the baby to somersault into the correct birthing position. [3] X Research source Get down on your knees on the floor or bed and rest your forearms on the ground. Stick your butt into the air and tuck your chin. This allows the lower part of your uterus to expand, making room for the baby's head. [4] X Research source Hold this position for 5 to 15 minutes, twice a day. Try to do it on an empty stomach, otherwise, you might feel slightly ill afterward. If you can feel the baby's position, it may be possible to help the turning process along. While leaning on one elbow, use the opposite hand to exert gentle upward pressure on the baby’s rear end, which is located just above your pubic bone."
    },
    {
      "title": "Do a forward-leaning inversion.",
      "content": "Do a forward-leaning inversion. The forward-leaning inversion is similar to the knee-to-chest exercise, but a little more extreme. [5] X Research source Start in the knee-to-chest position on your bed or the couch. Carefully, place your palms on the floor. Remember to tuck your chin, as this helps to relax your pelvic muscles. Be very careful when performing this exercise, as you don't want your hands to slip. An exercise mat or non-slip carpet pad can give you traction. Have your partner help you into position and use their hands to support your shoulders throughout the exercise. Hold this position for up to 30 seconds. Keep in mind that it's better to repeat the exercise frequently (3 to 4 times per day) than to hold the position for a longer period of time."
    },
    {
      "title": "Get in the pool.",
      "content": "Get in the pool. Swimming and doing crouches and flips in the pool can help a baby turn into the vertex position on their own. Try the following pool exercises with a spotter nearby: [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Crouch on the bottom of the pool in deep water, and then push off and reach your hands up as you break the surface of the water. Just swimming around the pool can encourage the baby to move (plus, it can feel really good during the final weeks of pregnancy). [7] X Research source The front crawl and the breaststroke are thought to be particularly effective for this. Do front and back flips in deep water. This can help relax your muscles and make it easier for the baby to roll over on their own. If you have good balance, you can also try doing an underwater handstand and holding it for as long as you can hold your breath. Dive in. Dive into the pool while gently holding the baby’s head out of the pelvis. The weightlessness and rushing water is thought to help the baby roll over on their own."
    },
    {
      "title": "Pay close attention to your posture.",
      "content": "Pay close attention to your posture . Aside from doing specific exercises to encourage your baby to turn, it's important to pay attention to your posture in your day-to-day life, as this can affect the baby's movement. [8] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source More specifically, good posture can help ensure the maximum amount of room is available in the uterus so the baby can turn into the correct position on their own. For perfect posture, use the following guidelines: [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Stand straight with your chin level to the ground. Allow your shoulders to drop naturally. If you are standing up straight with your chin in the proper position, your shoulders will drop and align naturally. Avoid throwing them back. Pull in your abdomen. Do not stand with your belly pouched out. Pull in your butt. Your center of gravity should be over your hips. Position your feet properly. Put your feet shoulder-width apart and spread your weight evenly over your feet."
    },
    {
      "title": "Use hot and cold packs.",
      "content": "Use hot and cold packs. Applying something cold to the top of the uterus and/or something warm to the bottom of the uterus may encourage your baby to move away from the cold sensation and towards the warm one, flipping into the correct position. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To do this, place an ice pack or a packet of frozen veggies on top of your belly, near the baby's head. Hopefully, the baby will shy away from the cold and turn in order to find a warmer, more comfortable position. Using the ice pack in a bathtub, with the lower half of your belly submerged in hot water, is a good way to use this technique, as the baby may gravitate towards the warmth. Alternatively, you can place a warm pack or hot water bottle on the lower half of your belly. This hot and cold technique is completely safe, so it can be done for as long and as often as you like. Many people choose to use hot and cold packs on their bellies while performing the breech tilt."
    },
    {
      "title": "Use sound to encourage your baby to turn.",
      "content": "Use sound to encourage your baby to turn. There are a couple of different methods of sound use, both relying on the baby turning towards the sound and thus into the proper position. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source One popular option is to play music for the baby by positioning headphones on the lower part of your belly. You can download music made especially for unborn and newborn babies online—whether it's soft classical music or lullaby versions of your favorite lullaby tunes. Alternatively, have your partner place their mouth on your lower abdomen and talk to the baby, encouraging him or her to move towards the sound of his voice. This is also a good way for your partner to bond with the baby."
    },
    {
      "title": "Visit a chiropractor experienced in the use of Webster’s technique.",
      "content": "Visit a chiropractor experienced in the use of Webster’s technique. Webster In-Utero Constraint technique—or simply Webster's technique—was developed to restore proper pelvic balance and function, and is thought to help encourage the baby to roll into the proper position on their own. [12] X Research source Webster's technique involves two things—firstly, it helps ensure that the sacrum and pelvic bones are balanced and in proper alignment. If these bones remain misaligned, it can impede the baby's movement into the vertex position. Secondly, this technique can help to reduce stress on the round ligaments that support the uterus by loosening and relaxing them. Once these ligaments are loosened, the baby may have more space to move around, allowing him or her to get into the correct position before birth. Bear in mind that Webster's technique is a process, so you will need to attend appointments at least 3 times a week during the final weeks of pregnancy. Make sure you are receiving treatment from a licensed chiropractor who has experience in treating those pregnant with breech babies. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Look into moxibustion.",
      "content": "Look into moxibustion. Moxibustion is a traditional Chinese technique that uses burning herbs to stimulate acupressure points. [14] X Research source To turn a breech baby, an herb known as mugwort is burned beside the pressure point BL 67, located beside the outer corner of the fifth toenail (baby toe). This technique is thought to increase the baby’s activity level, thereby encouraging him or her to flip into the vertex position by themselves. [15] X Research source Moxibustion is usually performed by an acupuncturist (sometimes in addition to traditional acupuncture) or a licensed practitioner of Chinese medicine. However, moxibustion sticks can also be purchased for those who wish to try this method at home."
    },
    {
      "title": "Try hypnosis.",
      "content": "Try hypnosis. Some people have successfully turned a breech baby with the aid of a licensed hypnotherapist. [16] X Research source Hypnotherapy usually takes a two-pronged approach to turning the baby. Firstly, the mother is hypnotized into a state of deep relaxation. This can help her pelvic muscles to relax and her lower uterus to expand, encouraging the baby to turn. Secondly, the mother is encouraged to use visualization techniques to imagine the baby turning the right way around. Ask your healthcare provider for the name and number of a reputable hypnotherapist in your area."
    },
    {
      "title": "Schedule an ECV.",
      "content": "Schedule an ECV. Once you pass the 37-week mark, it is unlikely that your breech baby will change position on its own. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Therefore, consider scheduling an appointment with your doctor so that he or she may attempt to turn the baby using the external cephalic version procedure (“ECV”). This is a non-surgical procedure, used by a doctor, in a hospital. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source During the procedure, the doctor uses medication to relax the uterus so that he or she can push the baby, externally, into the vertex position. This is done by applying downward pressure to the lower abdomen (which some find very uncomfortable). Some hospitals may offer hypnotherapy to ease any potential discomfort. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Throughout the procedure, the doctor will use an ultrasound to monitor the position of the baby and placenta, along with the amount of amniotic fluid. The baby's heart rate will also be monitored throughout the procedure—if it drops too low, an immediate emergency delivery may be necessary. [20] X Research source The ECV procedure is successful in approximately 58% of breech pregnancies. It has a higher rate of success in subsequent (rather than first-time) pregnancies. However, in some cases, ECV is not possible due to complications—such as bleeding or lower-than-normal levels of amniotic fluid. It is also impossible to perform when the mother is carrying twins. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Talk to your doctor about having a Cesarean section.",
      "content": "Talk to your doctor about having a Cesarean section . In some cases, a c-section will be necessary whether your baby is breech or not—like if you have a placenta previa, are carrying triplets, or have previously had a c-section. [22] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, if your baby is breech but all other factors are normal, you will need to decide if you want to deliver your baby vaginally or undergo a c-section. A large majority of breech babies are delivered by c-section, as it is believed that this option is generally safer. [23] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Planned c-sections are normally scheduled no earlier than the 39th week of pregnancy. An ultrasound will be performed just before the surgery to ensure that the baby hasn't changed position before the last check-up. However, if you go into labor before the scheduled c-section and it progresses too quickly, you may need to deliver the baby vaginally irrespective of your plans."
    },
    {
      "title": "Consider a vaginal breech birth.",
      "content": "Consider a vaginal breech birth. Delivering breech babies through vaginal birth is no longer considered to be as dangerous as it once was. However, it still comes with certain risks that you should discuss with your doctor. [24] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source In fact, in 2006 the American College of Obstetricians and Gynecologists (ACOG) stated that delivering breech babies vaginally is safe and reasonable in certain patients under specific conditions. [25] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source For example, vaginal breech birth may be a valid option if the mother's pelvis is large enough; the mother hasn’t experienced any pregnancy problems (such as pre-eclampsia); the baby is carried to full term and the labor starts and progresses normally; ultrasounds of the baby indicate that he or she is a healthy weight with no abnormalities (other than its breech position); the primary caregiver is experienced in the vaginal delivery of breech babies. [26] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you think you may meet these criteria and are interested in having a traditional birth rather than a c-section, speak to your doctor to explore your options and decide whether a vaginal birth is safe for both you and your baby."
    }
  ]
}