{
  "url": "https://www.wikihow.com/What-to-Do-with-Dried-Flowers",
  "title": "20 Creative Things to Do with Dried Flowers & How to Preserve Them",
  "steps": [
    {
      "title": "Flower wreath",
      "content": "Flower wreath For this cool crafting project, you’ll need a plain grapevine wreath and some floral wire or twine. Create bunches of dried flowers (leaving a few inches of stem with each bud) and tie them to the wreath base with your wire. Keep doing this around the whole wreath until there’s no more empty space or gaps between flowers. [1] X Research source"
    },
    {
      "title": "Flower garland",
      "content": "Flower garland A flower garland is essentially a lovely braid or chain of flowers, and you can use them to add some floral flair to your home. To make a garland, you’ll need floral wire (or string) and, of course, dried flowers. Tie the stems of your dried flowers together using the floral wire until they form a chain, and make it as long as you like. Voila! [2] X Research source When the garland is complete, you can hang it anywhere; for example, it could go over a door, across a wall, or along any stair railings in your home."
    },
    {
      "title": "Bouquet or everlasting arrangement",
      "content": "Bouquet or everlasting arrangement There’s no wrong way to put a bouquet together ! If you want a few tips, try starting with any bigger dried flowers (so you can make them the highlight of your bouquet). Then, add smaller flowers to fill the space until you have a bouquet you’re satisfied with—and display it in a vase or jar. Don’t be afraid to experiment and play with different dried flowers until you find a combination you like. If you need extra space in the vase, remove the leaves from each flower stem and cut the stems to different lengths."
    },
    {
      "title": "Pressed flower frame",
      "content": "Pressed flower frame You can make a work of art with a picture frame and some dried flowers! Take a piece of card paper (one that’s the right size to fit inside the frame you plan to use). Glue your dried flowers to the card paper, arranging them as you like. Then, place the card paper (and flowers) in the picture frame and display it somewhere!"
    },
    {
      "title": "Scented bath salts",
      "content": "Scented bath salts For bath salts, the ideal dried flowers would be scented and have relaxing properties—like lavender, chamomile, jasmine, or rosemary. All you have to do is buy scented bath salts and mix in the dried flowers, then store them in a glass jar or canister until you’re ready to use them. Add a scoop of floral bath salts to the water when you take a bath! [3] X Research source There’s also the fully DIY method of making bath salts: combine equal parts Epsom salt , sea salt, and baking soda—1 cup (4.5 oz) each. Then, add the dried flowers and roughly 10 drops of essential oil (if you want)."
    },
    {
      "title": "Scented room spray",
      "content": "Scented room spray That’s right, you can make DIY room spray! You’ll need distilled water, essential oil , and unscented witch hazel . Pour about 30 drops of essential oil into a spray bottle. Then, fill the rest of the spray bottle with half unscented witch hazel and half distilled water (meaning you should have equal parts of each). For a finishing touch, add your dried flowers to the bottle! [4] X Research source Try matching the essential oil’s scent to the dried flowers you’re using, so they smell great together! Remember, essential oils can be potent, so handle undiluted essential oil carefully when making your room spray."
    },
    {
      "title": "Resin coasters",
      "content": "Resin coasters Resin is easy to use, it’ll perfectly preserve your dried flowers, and you can do so much with it, including making resin coasters. However, you don’t have to stop there; if you have the right silicone mold , you can make any resin craft you want: jewelry, picture frames, buttons, paper weights, and much more. To make resin coasters with dried flowers: [5] X Research source Remove the leaves from your flowers (and stems, if you want) and arrange them in a coaster mold. Combine equal parts resin with hardener and stir them together. Pour the resin mixture into your mold, keeping the flowers in place. Let the resin cure for at least 24 hours, then remove the new coaster from the mold."
    },
    {
      "title": "Candles with dried flowers",
      "content": "Candles with dried flowers Want to make your own candles —and put some dried flowers (or flower petals) in them? It’s easier than you think! Melt down your candle wax using a double boiler. Then, when it’s ready to pour into your candle mold (or heat-proof glass), take the wax off the heat and stir your dried flower petals in. Once the flowers are added, complete your candle as usual (pour the wax mixture into a mold with a wick and let it cool). You can also add essential oil to the candle wax to get a stronger scent for your finished candle."
    },
    {
      "title": "Dried flower potpourri",
      "content": "Dried flower potpourri Potpourri smells great, it’s decorative, and it’s easy to make yourself using dried flowers ! For this, you’ll need a variety of dried flowers; remove their stems and leaves (if needed) and put the flowers in a bowl or drawstring bag—along with any other foliage or herbs you want to use. Then, just place your potpourri somewhere cool and dry! For a stronger scent, you can also add a few drops of essential oil (your choice of scent) to the potpourri."
    },
    {
      "title": "Drawer sachets",
      "content": "Drawer sachets Sachets are little bags of herbs or flowers that keep your drawers (and everything inside them) smelling nice. To make one with dried flowers , place a variety of dried blooms in a sachet bag and either sew the bag shut or just tie it with string. Then, store the sachet in a drawer, box, chest, or closet—wherever you like!"
    },
    {
      "title": "Flower confetti",
      "content": "Flower confetti Turning dried flowers into confetti is a much more eco-friendly option than buying paper or mylar ones, and you can do it cheaply if you get your dried flowers from home! Just pluck the petals of your dried flowers to use them as confetti—you can also cut or shred them into smaller pieces if you like. It’s that easy!"
    },
    {
      "title": "Shadow box",
      "content": "Shadow box Shadow boxes are basically deep frames that let you display three-dimensional images or items—which makes them great for putting dried flowers on display! Get a shadow box and then place your dried flowers inside it; you can create a scene or arrange them in a way you like. When you’re done, hang the shadow box on a wall or display it on a shelf. Try removing the leaves from each flower’s stem before putting it in the shadow box. You can also cut the flower stems to different lengths (so they’re easier to display)."
    },
    {
      "title": "Floral smudge stick",
      "content": "Floral smudge stick Sage smudge sticks are a popular way to cleanse a space and make the air nicer—and you can do the same with a DIY floral smudge stick. Simply bundle any dried herbs and flowers you want to use into a rough rod shape. Then, wrap the bundle together securely with cotton twine . [6] X Research source Any flowers you use must be completely dry because they won’t burn if there’s any lingering moisture."
    },
    {
      "title": "Gift-wrapping accents",
      "content": "Gift-wrapping accents Make a tiny bouquet of dried flowers (ideally using smaller, more delicate blooms) and wrap it in craft paper . Then, you can tuck your miniature bouquet into the ribbon wrapping around a gift—and just like that, you’ve got a beautiful and thoughtful gift topper that’s sure to set your gifts apart from any others."
    },
    {
      "title": "Floral phone case",
      "content": "Floral phone case To do this, you’ll just need a clear phone case (that fits your phone, obviously). Arrange your dried flowers inside the phone case in any position you like. Then, when you’re satisfied, put your phone in the case, which, in turn, will secure the flowers in place between the case and your phone. That’s all it takes!"
    },
    {
      "title": "Flowers in journals, cards, and letters",
      "content": "Flowers in journals, cards, and letters While this isn’t as much of a DIY arts and crafts project, it’s still a lovely way to decorate your journal or any letters or cards you send. Just tape the dried flowers in your journal as you like. Alternatively, tape them inside a card before sending it off to someone or slip them into an envelope with a letter."
    },
    {
      "title": "Japanese herbarium bottles",
      "content": "Japanese herbarium bottles Japanese herbarium bottles are comprised of dried flowers suspended in oil. You’ll need a clear glass bottle (with an accompanying lid or cork) and baby oil or mineral oil . Take your glass bottle and arrange the dried flowers inside in a way you like; you can use a wooden skewer if it’s difficult to reach into the bottle. Then, just fill the bottle with oil and seal it! [7] X Research source"
    },
    {
      "title": "Floral soap bars",
      "content": "Floral soap bars You don’t have to buy artisan soap—you can make it yourself. For this, you’ll need about 2 lbs (.9 kg) clear glycerine soap base , essential oil, and silicone molds for soap (they can be ovals or rectangles, for example) in addition to dried flowers. Follow these instructions: [8] X Research source Cut the clear glycerine soap base into roughly 1 in (2.5 cm) cubes and melt them in a double boiler or microwave using a glass measuring cup. Add 1 tsp (5 mL) of essential oil to the melted soap. Pour the soap into your molds, filling each mold about halfway. Add your dried flowers to each mold; use a toothpick to move them around if needed. Let the flowers sit for a few minutes, then fill each mold the rest of the way with the soap. Once the soap is completely dry, remove it from the molds and use it!"
    },
    {
      "title": "Glass floral ornaments",
      "content": "Glass floral ornaments Turn your dried flowers into holiday (or year-round) keepsakes! All you need are clear glass ornaments (that open) and dried flowers. Place your flowers of choice in the glass ornaments, then find a place to display them—whether you hang them on a holiday tree or place them somewhere you can always see them, like a centerpiece bowl."
    },
    {
      "title": "Pressed flower bookmarks",
      "content": "Pressed flower bookmarks Are you a big reader? Make a beautiful bookmark using dried flowers. For this, you’ll just need clear contact paper and scissors! Follow these instructions: [9] X Research source Cut a strip of contact paper in the shape of a bookmark (rectangular, unless you have another shape in mind). Remove the backing and lay the contact paper flat, sticky side up. Arrange your dried flowers on the sticky paper. Cut another strip of contact paper that’s a little bigger and sandwich the dried flowers between the two pieces. Trim the sides of the contact paper (and any floral pieces sticking out) until your new bookmark is even on all sides."
    },
    {
      "title": "Choose one of several different drying methods.",
      "content": "Choose one of several different drying methods. The odds are you have everything you need to dry flowers right at home . After all, there’s more than one way to do it! Before picking a method, think about which might work best with the craft project you have in mind for your dried flowers afterward. Then, try one of the following methods: [10] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Book press - Place your flowers between the pages of books (ideally thick and heavy ones) and close them, then weigh the flowers down with other books for a few weeks. Hanging - Hang your flowers upside down in a dry, dark space for two to three weeks. Ironing - Press the flowers between parchment paper, then go over them with a hot, dry iron. Microwaving - Press the flowers between two ceramic tiles and rubber band the tiles together. Then microwave them a few times until the flowers dry. Drying crystals - Place your flowers in silica gel crystals for 3 days to 1 week. Flower press - Get a flower press (pieces of wood screwed together at the corners) and press flowers tightly between the wood."
    },
    {
      "title": "The best flowers for drying tend to be thin or more petit.",
      "content": "The best flowers for drying tend to be thin or more petit. That’s because they dry easier than bigger flowers. Certified floral designer Lana Starr adds that ideal flowers to dry include “Roses, peony, hydrangeas, and other flowers that tend to shrink a little bit when they dry out.” Before choosing flowers, consider how you plan to use them and what colors or textures you want for your project. Generally speaking, flowers ideal for drying include: [11] X Research source Amaranth Baby’s breath Celosia Daisies Floss flower Goldenrod Hydrangea Larkspur Lavender Marigold Pansy Peony Rose Strawflower Tea roses Yarrow"
    },
    {
      "title": "How long do dried flowers last?",
      "content": "How long do dried flowers last? Dried flowers can last for a year or more, especially if they’re kept in the right conditions."
    },
    {
      "title": "Where should you store dried flowers?",
      "content": "Where should you store dried flowers? They should be kept out of direct sunlight and away from sources of heat or moisture. A cool, dry spot is best."
    },
    {
      "title": "Can dried flowers attract bugs?",
      "content": "Can dried flowers attract bugs? Yes, if they aren’t stored property. As mentioned above, dried flowers should be kept in cool, dry places; continued exposure to sunlight and moisture can attract bugs. Applying a few drops of essential oil can help keep bugs away."
    },
    {
      "title": "Do dried flowers get moldy?",
      "content": "Do dried flowers get moldy? It’s possible, but it really only happens if the flowers aren’t dried entirely or don’t have enough air circulation wherever they’re stored."
    },
    {
      "title": "How can you keep dried flowers from falling apart?",
      "content": "How can you keep dried flowers from falling apart? You can use a flower sealant to keep blooms from crumbling or losing leaves and petals. Proper storage (away from direct sunlight and moisture) can also help preserve them."
    }
  ]
}