{
  "url": "https://www.wikihow.com/Treat-Cheek-Abscesses-in-Hamsters",
  "title": "How to Treat Cheek Abscesses in Hamsters",
  "steps": [
    {
      "title": "Determine whether your hamster has a cheek abscess.",
      "content": "Determine whether your hamster has a cheek abscess. Before beginning treatment, it will be important to determine whether your hamster’s swollen cheeks are due to an abscess or food storage. Because your hamster’s cheek pouches are so large, your hamster can stuff a lot of food into them and make them look swollen. If the swelling goes down after your hamster empties the pouch, then there is no abscess. If the swelling doesn’t go down, then your hamster likely has a cheek abscess. An abscess would make your hamster feel sick. Your hamster may eat less and look unwell in general (e.g., scruffy fur, low energy level). A cheek pouch stuffed with food wouldn’t make your hamster feel sick."
    },
    {
      "title": "Take your hamster to your vet.",
      "content": "Take your hamster to your vet. If you think your hamster has an abscess, take your hamster to your vet for treatment. Your vet will examine the swollen cheek pouches carefully to verify that an abscess is present. Your vet may need to sedate your hamster to look inside its mouth. During the appointment, give the vet as much information as you can about your hamster and the cheek abscess. Tell your vet what types of food your hamster eats, as well as the type of bedding in its cage. Also, tell your vet when you first noticed the cheek swelling."
    },
    {
      "title": "Allow your vet to treat the abscess.",
      "content": "Allow your vet to treat the abscess. To treat the abscess, your vet will open the abscess and allow it to drain. Opening the abscess is a surgical procedure, so your vet will anesthetize your hamster. Once your hamster is anesthetized, your vet will open the abscess with a sharp surgical instrument. To drain the abscess, your vet will use a surgical drain. This drain will prevent the abscess’s contents from entering your hamster’s mouth and spreading through its body. After the abscess is empty, your vet will clean the empty pocket and flush it with an antiseptic solution that will kill any remaining bacteria. You should be able to take your hamster home on the same day as the surgery, provided your hamster recovers well from the procedure."
    },
    {
      "title": "Give your hamster antibiotics as prescribed.",
      "content": "Give your hamster antibiotics as prescribed. To prevent infection after the surgery, your vet will probably prescribe an antibiotic for you to give your hamster. Follow the prescription instructions carefully and give the entire course of antibiotics. If you stop the antibiotic treatment early, the remaining bacteria could become resistant to antibiotics, making future treatment very challenging. The antibiotic will likely be in liquid form. To administer the antibiotic, draw up the prescribed amount of antibiotic into a small syringe ( without the needle attached). Hold your hamster snugly, open his mouth, and gently push the syringe's contents into the mouth. Your vet can give you the syringes. If you are unsure about how to use the syringe, ask your vet to demonstrate how to use it. Contact your vet if you have trouble giving your hamster the antibiotic."
    },
    {
      "title": "Have your vet trim your hamster’s teeth.",
      "content": "Have your vet trim your hamster’s teeth. Overgrown incisors (curved middle teeth) can damage the cheek pouches and are the most likely cause of an abscess. If your hamster’s incisors are overgrown, your vet will need to trim them down with specialized dental tools. Do not trim the teeth yourself! You could damage the teeth and create even sharper tooth edges. Your hamster will need to be anesthetized for the teeth trimming. Your vet may want you to schedule regular teeth trimmings."
    },
    {
      "title": "Feed your hamster soft, smooth food while he is healing.",
      "content": "Feed your hamster soft, smooth food while he is healing. If your hamster eats something sharp, that food could scratch the linings of the cheek pouches. Soft foods like cereal and rice would be good to feed your hamster as his abscess heals. [1] X Research source If your hamster eats pellets, you could soften them by adding a little bit of water to them (not so much that the pellets become soggy). Other soft foods include: [2] X Research source Scrambled eggs Cooked oatmeal Yogurt Talk with your vet about how much of the soft food to feed your hamster."
    },
    {
      "title": "Make sure your hamster gets enough fiber.",
      "content": "Make sure your hamster gets enough fiber. You may be worried that hay or chew toys (e.g., hard dog biscuits, wooden sticks) might harm your hamster's cheek and cause another abscess, but this is unlikely. By depriving your hamster of these things, you may actually be increasing his chances of getting another abscess, as his teeth may become overgrown without fiber and things to gnaw on. If you use wooden sticks, make sure the wood is not pine or cedar—pine and cedar are toxic to hamsters."
    },
    {
      "title": "Consider using only soft bedding in your hamster’s cage.",
      "content": "Consider using only soft bedding in your hamster’s cage. Once your hamster has been treated for a cheek abscess, it will be important to prevent future cheek abscesses. Using soft bedding is a great prevention strategy, since soft bedding will not scratch the lining of your hamster’s cheek pouches. Shredded paper is ideal soft bedding for your hamster. You do not have to buy shredded paper—simply tear unscented toilet paper or paper towels into strips. You may wish to provide soft bedding while your hamster recovers, but it is likely not necessary to make a permanent switch. Carefresh® and Yesterday’s News are soft beddings that you can purchase. Wood shavings, hay, and straw have sharp edges. [3] X Research source Do not use them in your hamster’s cage. Create a thick layer of bedding on the cage floor. Replace the bedding when it becomes dirty or wet."
    }
  ]
}