{
  "url": "https://www.wikihow.com/Track-Friend-Requests-You%27ve-Sent-on-Facebook",
  "title": "How to Track Friend Requests You've Sent on Facebook",
  "steps": [
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. It's a dark-blue app with a white \"f\" on it. This will open your Facebook News Feed if you're already logged into Facebook on your phone or tablet. If you aren't logged into Facebook, enter your email address (or phone number) and password to continue."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's in the bottom-right corner of the screen."
    },
    {
      "title": "Tap Friends.",
      "content": "Tap Friends . This option is near the top of the menu."
    },
    {
      "title": "Tap Outgoing.",
      "content": "Tap Outgoing . It's a tab at the top of the screen. You may first have to swipe the row of tabs here to the left."
    },
    {
      "title": "View your sent friend requests.",
      "content": "View your sent friend requests. Any pending friend requests you've sent will appear here. Keep in mind that accepted friend requests will not be here. You can tap Undo below a friend request to revoke it."
    },
    {
      "title": "Go to Facebook's website.",
      "content": "Go to Facebook's website. Do so by entering https://www.facebook.com into your browser's URL box. This will load your News Feed if you're already logged into Facebook. If you aren't already logged into Facebook, enter your email address (or phone number) and password before continuing."
    },
    {
      "title": "Click the \"Friends\" icon.",
      "content": "Click the \"Friends\" icon. It's the icon resembling two people's silhouettes in the upper-right side of the Facebook page. Clicking this icon prompts a drop-down menu."
    },
    {
      "title": "Click Find Friends.",
      "content": "Click Find Friends . This link is at the top of the Friends drop-down menu."
    },
    {
      "title": "Click View Sent Requests.",
      "content": "Click View Sent Requests . You'll see this link below any pending friend requests that other users have sent to you. You may have to scroll down to find this option."
    },
    {
      "title": "View your sent friend requests.",
      "content": "View your sent friend requests. Any friend request beneath the \"Friend Requests Sent\" heading at the top of the page is pending acceptance or rejection from the recipient. If you want to revoke a friend request, select the Friend Request Sent button below a person's name and then click Cancel Request ."
    }
  ]
}