{
  "url": "https://www.wikihow.com/Water-Indoor-Plants",
  "title": "How to Water Indoor Plants",
  "steps": [
    {
      "title": "Research your specific plants’ needs.",
      "content": "Research your specific plants’ needs. Not every type of houseplant has the same watering needs, so educate yourself on the plants you have or are thinking of buying. Don’t assume that every plant wants 1 quart of water every two days because all of your plants won’t thrive like that. [1] X Research source Some may prefer to have their soil fairly dry most of the time, while others need it moist. Some may need the soil to dry out in between waterings."
    },
    {
      "title": "Let the plant determine when you water it.",
      "content": "Let the plant determine when you water it. Although it may be easiest to water on a set routine that you have decided, plants are not likely to thrive when watered this way. So rather than watering every two days, get a feel for how often your plant needs water. Check the soil consistently and learn how often it tends to dry out and water on that schedule. [2] X Research source Even indoor plants tend to have a dormant stage during the winter, so it is likely they will not need to be watered as often during this time. Morning tends to be a good time to water your plants. Watering at night can cause your plants to develop diseases more easily because the plant does not have time to dry before the temperature cools."
    },
    {
      "title": "Perform the finger test.",
      "content": "Perform the finger test. Stick a finger in the soil up to your first knuckle and notice if the soil is moist enough. If you finger can’t even enter the soil, it definitely needs to be watered. If you reach an inch or so deep but your finger is completely dry, it probably needs water. If the top inch feels fairly moist, and some of the dirt sticks to your finger, it probably has enough water. Again, this is not a guarantee for every plant. But most of the time if the top portion of soil is dried out, the plant could use some more water. You can buy a moisture meter that sticks in the soil and tells you when the plant needs water, which might be helpful and save guesswork."
    },
    {
      "title": "Watch the leaves.",
      "content": "Watch the leaves. Leaves can be a good indication of both under and overwatering. If the leaves seem to be hanging limp, this often means the plant needs water. If they are brown, dry, or some have fallen out, this usually means the plant needs water. [3] X Research source These signs mean that something is very wrong. Do not wait until your plant develops these signs before you water them. If the plant is dried out, water it slowly. Giving it too much water all at once might kill it. These same signs can sometimes mean the plant has been overwatered, so use this in conjunction with checking the soil. If you know you just watered it that day, give the plant time to absorb and use that water before watering it again."
    },
    {
      "title": "Learn the weight of your well-watered plant.",
      "content": "Learn the weight of your well-watered plant. You can test if your plant has enough water by lifting it after you have just watered it and noticing how heavy it feels. Lift it periodically, and when it doesn’t feel heavy enough, you’ll know it needs some water. It’s more of an art than a science, but this can be good trick to master. [4] X Research source This is only a good test for plants that are light enough to pick up and if you have the strength to do so. It’s not worth straining yourself just to check."
    },
    {
      "title": "Pay attention to the type of water you use.",
      "content": "Pay attention to the type of water you use. You might assume that water from your faucet is just fine, but you may be wrong. City water can have chlorine and fluoride which not all plants can handle. Soft water may have too much salt. Tap water may be too alkaline. If you use a certain water for a while and it doesn’t seem to be keeping your plants healthy, it’s probably time to switch. [5] X Research source If you can store a container outside to catch rainwater, this is a great option since it’s what the plants would get naturally. If you happen to live somewhere that has acid rain, this won’t work. Melted snow is also a good option if you live in colder climates with little rain. Bottled water can also be a good option, although this may be too costly. For city water, you can fill an open container and let the water sit for a day or so, which allows the chemicals to evaporate before you use it on your plants."
    },
    {
      "title": "Use room temperature water.",
      "content": "Use room temperature water. After each watering, refill your watering container and let it sit until the next time you water. This way, the water can warm up to a standard temperature rather than whatever temperature it would be from the tap or from rainwater. Most plants tend to prefer tepid water over cold water. [6] X Research source If you have multiple plants and need a lot of water, consider keeping a few jugs, or watering cans, stored somewhere that you can keep filled and ready for when you need them."
    },
    {
      "title": "Pour water evenly across the surface of the soil.",
      "content": "Pour water evenly across the surface of the soil. You want to err on the side of giving you plants less than enough water, because you can easily add a little more. Once you water plants too much, it is a lot of work to fix it. Keep track of how much water you use from one time to the next so you can get an idea how much is the right amount. Some plants can also benefit from misting the leaves, since watering mainly affects the roots. It is important to know your plant, however. Some leaves actually won’t benefit from misting, and some plants may even be harmed from getting their leaves wet."
    },
    {
      "title": "Correct overwatering.",
      "content": "Correct overwatering. If you do overwater your plant, and it isn’t draining, you can do a couple things to help stabilize it. Gently tip the pot on its side and allow the excess water to drain out for a while. Or place paper towels on the surface of the soil and let them absorb some of the water. [7] X Research source If it becomes a real problem, consider repotting in a new container that has better drainage. Try moving the pot to a warmer location so that it will dry more quickly. Avoid watering the plant for a while. Wait until the soil has dried out again."
    },
    {
      "title": "Pot plants in properly sized containers.",
      "content": "Pot plants in properly sized containers. Plants should be matched to a container of the right size to ensure that water is distributed efficiently. Plants in containers that are too small can become “root bound,” meaning the roots take up all the space. Plants in containers that are too big may not hold water in the soil and so will become dried out. [8] X Research source If you check the roots and you can tell there is more root than soil, this is a good indication that it’s time to get a bigger pot. You only want to move plants up one pot size at a time so you don’t end up with too much extra room. If the leaves of the plant seem disproportionate in size to the bottom, you should move up a pot size. If the pot has ever tipped over because of being top heavy, this is a definite indication you need a bigger pot. As with many aspects of tending indoor plants, there is no hard and fast rule that always applies. You need to occasionally take stock of your plant and judge if you feel a bigger pot would benefit it."
    },
    {
      "title": "Place plants in a pot with drainage holes.",
      "content": "Place plants in a pot with drainage holes. Since overwatering is often what kills plants, pots that allow plants to drain are very important. These pots will either have a hole in the center of the bottom or may have some kind of thin slits on the bottom. Pots with a solid bottom can cause water to pool and the roots can rot if soaked for too long. [9] X Research source If pots without drainage holes are your only option, it works well to put a layer of stones at the bottom of the pot. Extra water can pool there and won’t be in direct contact with the soil and roots. The stone layer should be an inch or so deep. Be extra careful not to overwater your plants. If you can only find plastic pots without holes, you can drill your own holes into the bottom."
    },
    {
      "title": "Place a drainage pan under the pot.",
      "content": "Place a drainage pan under the pot. If your pot is going to drain water, you most definitely don’t want it draining out onto your floors. You can purchase plastic pans specifically for this, or you can improvise and use a plate or saucer. You could even cut up a milk jug or 2 liter bottle if the pot is small enough and you aren’t overly concerned with the appearance of it. [10] X Research source Always empty this drainage pan within a half hour or so after watering, rather than allowing the plant to sit in it. If you don’t drain the pan, it’s basically the same as having a pot with no holes, as the plant will still be soaking in too much water."
    },
    {
      "title": "Repot when necessary.",
      "content": "Repot when necessary. If you have had a plant for a while and you can tell it is growing bigger, it may be best to replant it in a bigger pot. If the soil of the plant has shrunk away from the edges, it may need a smaller pot. To check if a plant has become root bound, you can carefully pull it out of the pot and check if there is still plenty of soil or if it seems to be mostly roots."
    }
  ]
}