{
  "url": "https://www.wikihow.com/Spoiler-on-Discord",
  "title": "Discord Spoiler Tags: Easy Tricks to Hide Text, Images, & More",
  "steps": [
    {
      "title": "Type something on Discord.",
      "content": "Type something on Discord. You can use markdown to spoiler your text on Discord. Markdown is a simple text formatting language that is embedded into Discord."
    },
    {
      "title": "Put || on either side of the text you want to spoiler.",
      "content": "Put || on either side of the text you want to spoiler. Anything surrounded by these symbols will be hidden with a black overlay that you must click on to see what's underneath. [1] X Research source Example: ||Spoiler here!||"
    },
    {
      "title": "Type something on Discord.",
      "content": "Type something on Discord. Discord now has some text formatting options as buttons that show up when you highlight your text."
    },
    {
      "title": "Highlight the portion of text you want to spoiler.",
      "content": "Highlight the portion of text you want to spoiler. This can be all of your message, or just part of it."
    },
    {
      "title": "Click the eye button in the contextual menu.",
      "content": "Click the eye button in the contextual menu. When you highlight text in your Discord message, a contextual menu will pop up with formatting options. To spoiler your text, click the button with an eye icon."
    },
    {
      "title": "Add an image to a Discord message.",
      "content": "Add an image to a Discord message. You can do this by uploading the image, or copying and pasting it."
    },
    {
      "title": "Click the eye icon.",
      "content": "Click the eye icon. In the image preview, the eye icon will be in the upper right-hand corner. The image won't look spoilered in the preview, but it will be spoilered when you post it. On mobile, long press on the image and tap Mark as spoiler to spoiler tag the image."
    },
    {
      "title": "Paste a link into your Discord message.",
      "content": "Paste a link into your Discord message. Just like text, you can spoiler a link using markdown as well."
    },
    {
      "title": "Put || on either side of the link you want to spoiler.",
      "content": "Put || on either side of the link you want to spoiler. When you send the message, the link will be spoilered with a black overlay, just like text. The link embed will also be blurred out, like when you spoiler tag an image. Example: ||https://www.google.com||"
    },
    {
      "title": "Paste a link into your Discord message.",
      "content": "Paste a link into your Discord message. If you don't need to spoiler the link text but you don't want the embed to give away what the link is about, you can remove the embed before you send the link."
    },
    {
      "title": "Put < > around your link.",
      "content": "Put < > around your link. Adding brackets around your link on Discord will remove the embed. The link will still be visible and clickable, but there won't be any image embed that previews what the link is about. Example: <https://www.google.com>"
    }
  ]
}