{
  "url": "https://www.wikihow.com/Untrap-a-Nerve-in-Your-Lower-Back",
  "title": "How to Untrap a Nerve in Your Lower Back",
  "steps": [
    {
      "title": "Rest your back.",
      "content": "Rest your back. To help untrap the nerve in your back, rest it. Avoid too much movement and overtaxing it. Don't sit or stand for too long. Instead, try walking around more than usual.<r Try not to bend, twist, or do any movements that will hurt your back."
    },
    {
      "title": "Ice the area.",
      "content": "Ice the area. Trapped nerves cause pain, and can also cause swelling. Try using ice packs on the painful area to alleviate pain and reduce inflammation. Ice works best when the pain first starts, so use it for the first 7 days. Leave the ice pack on for 10 to 15 minutes, then take it off. Leave it off for at least 15 minutes before reapplying. You can do this multiple times each day. You can use commercial ice packs or wrap ice cubes in a towel. Don't place ice directly on your skin."
    },
    {
      "title": "Try compression.",
      "content": "Try compression. Compression can also help with the pain. Use a lumbar support belt or a corset to add compression to the area. These items also help with stability of the core, which can reduce the strain on the nerve. You can wear these support belts as long as you want, and should use them when doing a lot of activity or lifting. You shouldn't use them for more than 3 days without talking to your doctor."
    },
    {
      "title": "Elevate your legs.",
      "content": "Elevate your legs. Elevating your legs can relieve a pinched nerve in your lower back. Bend both your hips and your knees at 90 degrees. Place a pillow, wedge, or ottoman beneath your legs to hold them up. Or, lay on the floor and put your legs on the couch. [1] X Research source"
    },
    {
      "title": "Use lumbar supports.",
      "content": "Use lumbar supports. Lumbar supports are important to untrap nerves in your back. You need to add lumbar chair supports to all of your seats, including your car . You can use a seat wedge, a small pillow, or a rolled up towel positioned at your lower back."
    },
    {
      "title": "Use an infrared heating pad.",
      "content": "Use an infrared heating pad. A natural way to relieve the pain and promote healing is by using an infrared heating pad on the affected area. These heating pads use infrared rays that go into your tissues and bones to improve circulation and promote healing. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source A typical session with an infrared heating pad is 30 minutes, followed by a rest period then a gentle massage . You can also do 30 minutes on one spot, then move the heating pad to a different place for 30 minutes at that angle. You can do this multiple times each day. You can purchase these heating pads online or at drug stores."
    },
    {
      "title": "Squeeze your glutes.",
      "content": "Squeeze your glutes. You can use your glutes, aka your buttock muscles, to support your spine and reduce nerve pain. Before you bend over or stand up when seated, squeeze your glutes. This helps stabilize your back and lessen abnormal movements that may cause more pain on your trapped nerve."
    },
    {
      "title": "Sleep with a pillow between your knees.",
      "content": "Sleep with a pillow between your knees. If your trapped nerve is making it difficult to sleep, put a pillow between your knees when you're going to sleep. Lie on your side with the pillow resting between your knees. You should be able to find the neutral pelvic position which will reduce the pain."
    },
    {
      "title": "Open up your hips.",
      "content": "Open up your hips. Stretching your hip flexors can be beneficial for a pinched nerve in the lower back. Begin in a standing position, take a step backward with 1 foot, and kneel down on your back knee. You should feel your weight shift to your back hip, which is where you will feel the stretch. Hold for 10-20 seconds, then switch to the opposite side."
    },
    {
      "title": "Try the 90/90 position.",
      "content": "Try the 90/90 position. This position can give relief to your lower back. Lie on the floor with a pillow supporting your head. If you need to, use a lumbar support cushion under your back. Lift your calves and place them on a chair or sofa. Make sure your hips and knees are bent at a 90 degree angle. You can stay in this position for as long as you feel comfortable, but make sure to try for at least 30 to 60 seconds. This position should not cause you any pain."
    },
    {
      "title": "Stretch your core area.",
      "content": "Stretch your core area. Stretching some of the muscles around your back can help untrap the nerve and relieve pain. Start with a core stretch. Sit down with your legs straight out in front of you. Twist your core as you place your hand on the opposite knee. Lean forward to stretch your back muscles as you twist. Hold for around 5 seconds, then stretch the other side. Stretch your sides by standing and leaning to one side to gently stretch out those muscles. Hold for a few seconds, and then stretch the opposite side. Go back and forth five to six times."
    },
    {
      "title": "Loosen up your hamstrings.",
      "content": "Loosen up your hamstrings. Hamstring stretches can also help with back pain. Sit with your legs out. Lean forward, folding your body over your legs, and touch your toes. If you can't touch your toes, touch your ankles, shoes, or any other part you can. Hold for a few seconds, then straighten and repeat. Lie flat on your back with a pillow under your head. Bend your knees. Bring one knee towards your chest. Grab the hamstring, or the back of the leg, with both of your hands. Straighten the knee as much as you can slowly and pull your leg towards you. Hold for around 30 seconds. Bend the knee, then return to start."
    },
    {
      "title": "Perform lower back stretches.",
      "content": "Perform lower back stretches. Stretching your lower back can help with trapped nerves. Lie down on your back with a pillow under your head, and bend your knees. Bring one knee up towards your chest. Grab your knee with both of your hands and gently stretch the knee towards your chest. If it hurts, loosen it just a bit. Hold for around 30 seconds. Lie down on your stomach, and prop yourself up on your elbows. Keep your neck long and lifted as you push down with your hands to stretch your chest away from the floor. Your back should arch, and you should feel a stretch in your back and stomach. Hold for around 10 seconds."
    },
    {
      "title": "Take over-the-counter medication.",
      "content": "Take over-the-counter medication. Over-the-counter medication is a way you can help pain with a trapped nerve if you don't have a prescription medication. NSAIDs like ibuprofen and aspirin can help reduce swelling and help with pain. Make sure to read and follow the instructions carefully. Do not provide children or teenagers with aspirin because of the risk of Reye's syndrome. [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Rub on a pain cream.",
      "content": "Rub on a pain cream. You may choose to use a pain-relieving cream or ointment on the area of your back that is hurting. Spread the cream over the sore spot and wait a few minutes for it to start working. Read the instructions and follow them carefully. You can get these creams at supercenters, supermarkets, or drug stores."
    },
    {
      "title": "Consider seeing a chiropractor.",
      "content": "Consider seeing a chiropractor. If you think you have a trapped nerve in your back, you should consider seeing a chiropractor. They will give you a physical exam, evaluate your symptoms, and determine the cause of your pain."
    },
    {
      "title": "Take prescribed medication.",
      "content": "Take prescribed medication. Your doctor may prescribe you medication as the first treatment for a trapped nerve. You will be prescribed anti-inflammatory drugs, which may include steroids. You may also be prescribed painkillers like opioids. These pain relievers often help reduce pain associated with a trapped nerve. You may also be prescribed muscle relaxants or anticonvulsants. You may also get spinal injections of pain relievers."
    },
    {
      "title": "Get physical therapy.",
      "content": "Get physical therapy. If your pain doesn't go away, you can try physical therapy. A physical therapist can give you specific stretches and exercises that will help heal and untrap the nerve in your back. You can perform certain exercises with the aid of a physical therapist that you cannot do on your own."
    },
    {
      "title": "Undergo surgery.",
      "content": "Undergo surgery. If your trapped nerve doesn't improve, your doctor may decide to do the least invasive surgery possible. The benefits of the surgery may include reduced pain and increased mobility. Discuss with your doctor which procedure is best for your particular case. [4] X Research source In a certain procedure, a surgeon will shave off part of the bone to create an opening for the nerve, which untraps it. Another surgery will completely remove the bone, and another can remove the disc that traps the nerve. Most back nerve surgeries are minimally invasive and you can go home the same day if you have the proper care in place at home. Generally, you'll need to return the next day for a follow-up. As with any surgery involving the nerves, there are risks for neurological damage that can generally be immediately detected."
    }
  ]
}