{
  "url": "https://www.wikihow.com/Stop-Taking-Citalopram",
  "title": "How to Stop Taking Citalopram",
  "steps": [
    {
      "title": "Ask your doctor if you’re ready to stop taking citalopram.",
      "content": "Ask your doctor if you’re ready to stop taking citalopram. In most cases, your doctor will want to make sure you are no longer dealing with the condition the citalopram is treating. It’s best to wait until you’ve felt better for at least 6 months and the situation that caused your depression has been resolved or stabilized. Additionally, don’t try to quit your medication if you’re dealing with a major life stressor, such as a divorce. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For instance, let’s say the citalopram is treating depression. It’s best to continue taking your medication until you haven’t had any symptoms of depression for at least 6 months. This reduces your risk of relapse. Major life stressors that can make it harder to stop your medication include separation, divorce, job loss, moving, illness, or grief."
    },
    {
      "title": "Lower your dosage slowly over time rather than stopping abruptly.",
      "content": "Lower your dosage slowly over time rather than stopping abruptly. Weaning yourself off the medication allows your body time to adjust to not having it in your system. This limits the risk of you experiencing withdrawal symptoms because your body won’t experience a shock to your system. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Don’t stop your medication without your doctor’s approval. Everyone responds differently to stopping a medication. Work closely with your doctor to monitor your response and develop a schedule that works for you. Be patient while you are tapering off your medication. Getting off of citalopram or any other antidepressant too quickly can make you sick, set back your treatment progress, or put you at risk of developing suicidal thoughts."
    },
    {
      "title": "Work with your doctor to create a tapering schedule.",
      "content": "Work with your doctor to create a tapering schedule. Expect to taper off of your medication for about 6-8 weeks or a few months, depending on how long you’ve been taking citalopram and how high your dosage was. [3] X Research source Your doctor will reduce the amount of citalopram you’re taking in small increments. Usually, you’ll drop your dose every 2 weeks until you’re taking so little medication that your doctor thinks you’re ready to stop. In some cases, your doctor may recommend alternating between your current dose and a lower dose. For example, if you’ve been taking 40 mg of citalopram per day, they might have you alternate between 40 mg and 20 mg doses every day for 2 weeks (which would be equivalent to taking 30 mg daily). [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Your doctor may have you halve the pills you already take, or they might prescribe you citalopram in liquid form to make it easier to take. If you have only been taking the citalopram for a short period of time, such as less than 2 months, you may only need 1-2 weeks of tapering. [5] X Research source"
    },
    {
      "title": "Talk to your doctor before making changes to your tapering schedule.",
      "content": "Talk to your doctor before making changes to your tapering schedule. It’s very important to follow your doctor’s instructions, even if you’re feeling good. Unfortunately, withdrawal symptoms can take days to develop, so it’s hard to predict how your body will react to decreasing your dose too quickly. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you have any questions about your tapering schedule, talk to your doctor. Remember, your schedule is designed to meet your needs, so don’t switch to someone else’s plan just because it worked for them."
    },
    {
      "title": "Look for symptoms of withdrawal.",
      "content": "Look for symptoms of withdrawal. Only about 20% of people who take citalopram will experience withdrawal symptoms, so you might not have any. However, you’re more likely to experience withdrawal if you’ve been taking the medication for a while. If you do experience withdrawal symptoms, they’ll likely start a few days after you stop taking citalopram or reduce your dose. The typical withdrawal symptoms for citalopram include the following: [7] X Research source Agitation Anxiety Dizziness Headaches Confusion Heart palpitations Sweating Nausea Vomiting Insomnia Nightmares Tingling or numbness in your hands or feet Shaking"
    },
    {
      "title": "Record how you feel daily as you taper off to watch for patterns.",
      "content": "Record how you feel daily as you taper off to watch for patterns. Write down your mood, as well as any issues you’re having that might be symptoms of withdrawal. This way, you’ll be able to tell if you’re experiencing withdrawal or are just having an occasional bad day. [8] X Research source For example, you might write, “Today I felt really stressed, and I had a headache most of the morning.” In this case, your headache might not be related to the citalopram. However, you might talk to your doctor about withdrawal if you experienced a headache several days in a row."
    },
    {
      "title": "Recognize if symptoms of your original condition are returning.",
      "content": "Recognize if symptoms of your original condition are returning. As you taper off of your citalopram, it’s possible you will relapse with your depression, anxiety, or whatever condition your doctor is treating. This means your symptoms might start to return, which you can easily mistake for withdrawal. Your doctor can help you determine if this is the case. [9] X Research source Keep in mind that withdrawal often includes physical symptoms that aren’t typically part of depression or anxiety. For example, you might experience body aches, tingling of your hands and feet, or tremors. If you have physical symptoms, it's more likely that you are experiencing withdrawal. [10] X Research source"
    },
    {
      "title": "Boost your mood by being active 30 minutes every day.",
      "content": "Boost your mood by being active 30 minutes every day. Moderate exercise causes your body to release natural chemicals that make you feel good, so it’s a great way to improve how you feel. Choose a fun activity that you can easily incorporate into your day so it’s not difficult to stick to your exercise goals. You might try one of the following: [11] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Walk during your lunch hour or after dinner. Spend more time outdoors. Join a recreational sports team. Take a dance class. Try a fitness streaming service or DVD. Join a group fitness class at the gym. Swim laps in a pool."
    },
    {
      "title": "Eat well",
      "content": "Eat well . Getting enough to eat and choosing a variety of high-quality, nutritious foods can help you feel better both physically and emotionally. [12] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Pay attention to your body and eat when you are hungry. While different people have varying dietary needs, you will probably benefit from: Eating a diet rich in whole grains, fiber, lean protein (such as poultry breast or fish), fruits and vegetables, and healthy sources of fat (such as seeds, nuts, and vegetable oils). Cutting out sugary, greasy, and processed foods."
    },
    {
      "title": "Get 20 minutes of sunlight each day.",
      "content": "Get 20 minutes of sunlight each day. Spending time in the sun helps your body metabolize vitamin D more effectively, which can improve your mood. Try to walk in the sun for 20 minutes a day, at least 5 days a week. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you’re planning to spend more than 20 minutes in the sun, protect your skin with sunscreen and appropriate clothing (such as a hat, long-sleeved shirt, and sunglasses). Talk to your doctor about whether you might have a vitamin D deficiency. If so, they may recommend taking a supplement. If you live in an area where you don’t get a lot of natural sunlight, ask your doctor or psychiatrist about trying light therapy."
    },
    {
      "title": "Manage your stress",
      "content": "Manage your stress by taking care of your body and mind. Dealing with stress can make it harder to withdraw from your medicine. Plus, stress can trigger a relapse. Fortunately, there are easy ways you can reduce stress in your life and take good care of yourself. For example, you might incorporate the following into your day: [14] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Sleep well every night by following a bedtime routine. Relax every day by taking time for yourself, engaging in a hobby, or expressing yourself creatively. Spend time with people you care about. Eat healthy meals based around fresh produce and lean protein. Spend time in nature."
    },
    {
      "title": "Build a support network out of friends and family.",
      "content": "Build a support network out of friends and family. Reach out to your closest family and friends so you have a safety net while you’re stopping your medication. Additionally, they can help you cope if you start to relapse into depression or anxiety. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Let people know you might need help. Say, “I’m going to stop taking citalopram, so I might need more help around the house for a few days,” or “Right now I’m struggling with my emotions because I just stopped taking citalopram. Is it okay if I call you when I need support?”"
    },
    {
      "title": "Talk to a counselor for added support, if necessary.",
      "content": "Talk to a counselor for added support, if necessary. Working with a counselor can help you come off your medication safely. Additionally, they’ll help you process your emotions and learn better ways to cope with any symptoms you’re experiencing. [16] X Research source If you already going to therapy, continue going to your appointments as you transition off of the citalopram. If you don’t go to therapy, ask your doctor for a recommendation or look for a therapist online."
    },
    {
      "title": "Ask your doctor if taking fluoxetine (Prozac) is a good short-term option for you.",
      "content": "Ask your doctor if taking fluoxetine (Prozac) is a good short-term option for you. Unlike citalopram, fluoxetine stays in your system for several weeks because it slowly leaves your body. That means it’s easier to taper off of it when you’re ready to quit. Sometimes, your doctor will decide that a long-acting antidepressant like fluoxetine is the best option for stopping a short-acting antidepressant like citalopram, as it reduces the risk of withdrawal. [17] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Switching to a long-acting antidepressant isn’t right for everyone, so follow your doctor’s advice. They’re more likely to prescribe it if you have been taking the citalopram for several years."
    },
    {
      "title": "Talk to your doctor about treating your withdrawal symptoms, if necessary.",
      "content": "Talk to your doctor about treating your withdrawal symptoms, if necessary. If your withdrawal symptoms start to interfere with your life, your doctor may be able to prescribe a medication to directly address your symptoms. For example, they may be able to give you anti-nausea medication or a sleep aid. [18] X Research source Keep in mind that most people don’t need these medications, so your doctor might decide they aren’t right for you."
    }
  ]
}