{
  "url": "https://www.wikihow.com/Swaddle-a-Baby",
  "title": "How to Wrap a Swaddle: Simple Folding Tips!",
  "steps": [
    {
      "title": "Lay out the blanket in a diamond shape on a flat surface.",
      "content": "Lay out the blanket in a diamond shape on a flat surface. Spread a swaddling blanket out on a secure, flat surface, such as your bed or a padded floor. Arrange it in a diamond shape. [1] X Research source The blanket should be at least 40 by 40 inches (100 cm × 100 cm). If you can buy a blanket specifically for swaddling, this is best. What type of blanket is best? Ideally, the blanket should be made of a light, breathable material, such as muslin cotton . This will help prevent your baby from becoming overheated, especially if you live in a warm area. For easy swaddling, you can purchase a specially designed swaddler with Velcro fasteners that hold the flaps in place. Make sure to choose one that’s appropriate for your baby’s size and age."
    },
    {
      "title": "Fold down the top corner of the blanket so the tip reaches the center.",
      "content": "Fold down the top corner of the blanket so the tip reaches the center. Once you’ve spread out the blanket, fold over the top corner so it makes a triangle. Start the fold about halfway down the top corner of the blanket so the top, flat side of the triangle will be wider than your baby’s shoulders. [2] X Research source The folded corner will help guide your placement of the baby. Your blanket should now resemble the outline of a cartoon drawing of a gem or the Superman symbol, with 3 corners on the sides and bottom and a flat area on top. The folded corner should be on top of the blanket, not underneath it."
    },
    {
      "title": "Place the baby face-up on the blanket.",
      "content": "Place the baby face-up on the blanket. Lay down the baby on the blanket on their back so that their head is above the folded top edge of the blanket and their shoulders are below the fold. Try to keep the baby centered on the blanket. If your baby is very young, be sure their head and body are properly supported while you do this. [3] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source It’s very important to keep your baby face up and make sure they are positioned so that their face will not be covered by the blanket after you swaddle them."
    },
    {
      "title": "Place your baby’s left arm at their side.",
      "content": "Place your baby’s left arm at their side. Take your baby’s left arm and carefully place it alongside. Leave their elbow slightly bent so they’ll be comfortable. [4] X Research source Alternatively, you can fold the arm across their chest, like they are in the womb. [5] X Research source However, this may make it easier for your baby to wriggle free."
    },
    {
      "title": "Pull the left side of the wrap fully across the baby’s chest.",
      "content": "Pull the left side of the wrap fully across the baby’s chest. Fold the corner of the blanket on the baby’s left side (your right) across their body, and tuck it under their back on their right side, just below their right armpit. [6] X Research source The blanket should be tucked snugly enough to hold the baby's left arm in place at their side but loose enough that you can comfortably fit 2 or 3 fingers under the edge of the blanket."
    },
    {
      "title": "Hold the baby's right arm at their side.",
      "content": "Hold the baby's right arm at their side. Gently place the baby's right arm at their side and hold it in place, just like you did with the left arm. The corner of the blanket that you folded over will now be trapped between the right side of the baby’s body and their right arm. You can also fold their right arm across their chest if you wish, but remember that this will make it easier for the baby to break free of the swaddle."
    },
    {
      "title": "Fold the right corner of the blanket over to the baby’s left side.",
      "content": "Fold the right corner of the blanket over to the baby’s left side. Take the corner of the blanket on the baby’s right (your left) and pull it across their body. Tuck it underneath the baby’s body on their left side. [7] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Your baby’s entire upper body should now be gently but firmly wrapped, with both arms held securely in place. Make sure you can fit 2 or 3 fingers between the baby’s chest and the blanket. If not, it’s too tight—undo the swaddle and rewrap it a little more loosely."
    },
    {
      "title": "Fold up the bottom of the swaddle.",
      "content": "Fold up the bottom of the swaddle. Loosely fold up or twist the bottom of the blanket to cover the baby’s feet. Take the loose end and tuck it underneath the baby’s legs on one side or the other. [8] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Alternatively, you can fold up the bottom corner of the blanket over the baby’s feet before you pull the other side of the blanket across the baby’s body. Important: Leave plenty of room for the baby's legs and feet to move within the swaddle. This will prevent overheating and, over the long term, hip dysplasia."
    },
    {
      "title": "Always place your baby on their back to sleep.",
      "content": "Always place your baby on their back to sleep. Babies who sleep on their sides or stomachs are at greater risk of developing SIDS (or Sudden Infant Death Syndrome). It’s especially important to keep swaddled babies on their backs since they are less mobile than un-swaddled babies and have a higher risk of suffocating if they are placed face-down. [9] X Research source There’s no evidence that swaddling can prevent or reduce the risk of SIDS. However, if done correctly, this practice can be safe and beneficial for your baby. [10] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Stop swaddling your baby by 2 months of age.",
      "content": "Stop swaddling your baby by 2 months of age. According to pediatrician Dr. Corey Fish, once your baby is old enough to roll over on their own, it’s time to stop swaddling them. [11] X Expert Source Corey Fish, MD Pediatrician & Chief Medical Officer, BraveCare Expert Interview. 17 March 2020. It can be very dangerous for your baby if they manage to roll over onto their stomach while swaddled. Even before babies are able to roll over intentionally, they can sometimes accidentally flip themselves over by arching their backs or flailing around when they are upset or excited. Never leave your baby unattended on an elevated surface, such as a changing table, even if you don’t think they’re able to roll over yet. [12] X Research source Not all babies are able to roll over by the time they’re 2 months old, but it’s safest to stop swaddling before they develop that ability. If you notice that your baby is able to roll over before the age of 2 months, stop swaddling them right away. Once your baby is too old for swaddling, consider trying an alternative like a sleep sack (which loosely covers the legs but leaves the arms free) or footie pajamas ."
    },
    {
      "title": "Avoid swaddling too tightly.",
      "content": "Avoid swaddling too tightly. If you swaddle the baby too tightly, especially if the baby is very young, they may have trouble filling their lungs with air. The swaddle should be tight enough to hold their arms in place, but you should still be able to fit 2 to 3 fingers between their chest and the blanket. Additionally, keep the wrapping around their legs loose enough so that the legs can bend up and out. Dr. Fish says that if the swaddling is wrapped too tightly around the baby’s legs, it could prevent their hips from developing correctly, but if the swaddle is wrapped too loosely, it could come undone and cover the baby’s face, creating a risk of suffocation. [13] X Expert Source Corey Fish, MD Pediatrician & Chief Medical Officer, BraveCare Expert Interview. 17 March 2020."
    },
    {
      "title": "Dress your baby lightly and choose a light blanket to prevent overheating.",
      "content": "Dress your baby lightly and choose a light blanket to prevent overheating. Overheating can also put your baby at risk of developing SIDS. Always choose a light, breathable blanket or wrap when swaddling your baby. If the weather is warm, dress your baby in light clothes or just a diaper under the swaddling wrap. Unwrap your baby if you see signs of overheating, such as: [14] X Research source Rapid breathing Damp hair or sweating Flushed skin A heat rash"
    },
    {
      "title": "Use a firm mattress in the baby's crib to prevent suffocation.",
      "content": "Use a firm mattress in the baby's crib to prevent suffocation. A mattress that is too soft can suffocate a baby if they do manage to end up face-down in the crib. A firm mattress will let your baby sleep and keep them safe. [15] X Research source Cover the mattress with a fitted sheet that’s designed to fit the mattress. Make sure the mattress also fits well in your baby’s crib or bassinet. Check for any gaps between the mattress and the sides of the crib since your baby could potentially roll into one of these and get stuck."
    },
    {
      "title": "Keep loose blankets, pillows, and stuffed animals out of the crib.",
      "content": "Keep loose blankets, pillows, and stuffed animals out of the crib. Having a lot of loose items in the crib puts your baby at risk of suffocation. Don’t give your baby a pillow or a loose sheet or blanket. Keep them warm using a swaddle, sleep sack, or appropriate clothes. [16] X Research source Most babies can start safely using a pillow by the time they’re 1 ½ years old. Your baby can probably start using loose blankets by the time they’re 1 year old. Check with your pediatrician if you’re not sure whether your child is ready."
    },
    {
      "title": "Consider a sleep sack instead of a blanket for swaddling.",
      "content": "Consider a sleep sack instead of a blanket for swaddling. A newborn sleep sack is a special kind of blanket designed specifically for swaddling. It has armholes, which can help keep the sleep sack from riding up and covering the baby’s face while they’re asleep. [17] X Research source Sleep sacks also fit more loosely, which can help keep your baby from getting too hot. You can also purchase larger sleep sacks without wings for babies who are too old for traditional swaddles."
    },
    {
      "title": "Swaddling involves wrapping a baby snugly in a blanket or cloth.",
      "content": "Swaddling involves wrapping a baby snugly in a blanket or cloth. When it’s done correctly, swaddling can help newborn babies feel secure—it helps mimic the limited movement they had in the womb. Swaddling can sometimes help babies sleep better or calm them when they’re fussy. [18] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Swaddling is considered safe when it’s done correctly.",
      "content": "Swaddling is considered safe when it’s done correctly. However, swaddling can be dangerous if it’s done incorrectly. If the blankets are too loose, they can cover the baby’s mouth and nose, which can lead to suffocation. And babies can easily overheat when they’re swaddled, which could increase their risk of SIDS. There’s also a risk of hip dysplasia if the baby’s hips are swaddled too tightly. [19] X Research source Always follow the proper steps to swaddle safely, and avoid using weighted blankets or swaddles, as these may increase the risk of suffocation."
    },
    {
      "title": "How do you swaddle with a baby’s arms out?",
      "content": "How do you swaddle with a baby’s arms out? Lay a blanket in a diamond shape and fold down the top corner about 1/3 of the way down the blanket. Place the baby on the blanket so the top fold is level with their armpits. Fold the left side of the swaddle over to the baby’s left side and tuck it underneath them, then do the same on the right side. Finally, fold the bottom of the blanket up to the baby’s chest and wrap it around their back. [20] X Research source Bring any excess fabric back to the front and tuck it into the top of the swaddle."
    },
    {
      "title": "How do you swaddle a baby with one arm out?",
      "content": "How do you swaddle a baby with one arm out? Fold the first side of the swaddle normally, with the baby’s arm tucked against their side. But when you fold the other side, lift the baby’s free arm and fold the blanket under their armpit. This can be a good way to help a baby transition out of swaddling."
    },
    {
      "title": "How long can you swaddle a baby at night?",
      "content": "How long can you swaddle a baby at night? You can swaddle your baby at night until they’re about two months old, or until they start showing signs that they’re beginning to roll over. [21] X Research source"
    },
    {
      "title": "Can you breastfeed a swaddled baby?",
      "content": "Can you breastfeed a swaddled baby? Swaddling is intended for babies who are sleeping. Once your baby is awake, unwrap the swaddle. [22] X Research source"
    },
    {
      "title": "What if my baby doesn’t like to be swaddled?",
      "content": "What if my baby doesn’t like to be swaddled? That’s normal! Some babies love to be swaddled, and others don’t. If you want to, you can try an arms-free swaddle to see if your baby prefers that, or you might try a sleep sack ."
    }
  ]
}