{
  "url": "https://www.wikihow.com/Stop-Self-Harming",
  "title": "How to Stop Self Harming",
  "steps": [
    {
      "title": "Find people to be around.",
      "content": "Find people to be around. If you are feeling the urge to self-harm, consider going somewhere to be around people. This could be as simple as going into the living room to be with your family or roommates. You might choose to go to a public place, like a coffee shop or a public park. Whatever you're doing, wherever you are, decide to stop before you harm yourself. Make sure to surround yourself with people."
    },
    {
      "title": "Call someone.",
      "content": "Call someone. If you're alone in your house or are unable to leave, call someone to talk with. This could be a family member, trusted friend, or a hotline. Many hotlines are available featuring information for people struggling with self-harm, and resources for help. It is helpful to create a phone list of people you can call. Make sure these numbers are in your phone: 988 (in the United States and Canada): This is a 24-hour crisis lifeline if you’re about to self-harm or are in an emergency situation. 1-800-334-HELP (in the United States only): This number is the Self Injury Foundation’s 24-hour national crisis line. 1-800-DON’T-CUT (in the United States only): This number provides information about self-harm. You can even try talking to an inanimate object, a pet, a photograph, or a poster. These objects can give you somewhere to aim your voice and won’t judge you for your actions. Remember that different helplines are available in different countries, and calling a helpline abroad may result in additional charges."
    },
    {
      "title": "Get help if there is the risk of suicide.",
      "content": "Get help if there is the risk of suicide. If you are thinking about suicide, get help immediately. Call or text 988 or your local emergency response (call 911). The following are some signs to look for: Talking about wanting to die or to kill yourself. Looking for a way to kill yourself. Making statements about being hopeless. Talking about having no reason to live."
    },
    {
      "title": "Draw on your body with a marker.",
      "content": "Draw on your body with a marker. If you find your thoughts continually drifting back to harming yourself, one alternative is to draw on your body with a marker. Draw on the place where you are thinking of harming yourself. Ink won’t leave a scar. [1] X Research source"
    },
    {
      "title": "Distract yourself",
      "content": "Distract yourself . Distraction is a way to prevent self-harm once you feel the urge or stop self-harming once recognize you are self-harming. It is important to figure out what kinds of distractions work for you in each situation. Sometimes the trigger or urge is different depending on the feeling or situation, meaning that our response to prevent or stop harm is different too. Color your hair . Make a cup of tea . Count up to 500 or 1000. Work on a puzzle or mind game. Go \"people watching.\" Play a musical instrument . Watch TV or a movie. Paint your nails . Organize something like books , your closet , etc. Make origami to occupy your hands. Play a sport. Take a walk . Make your own dance routine. Do an art project or color in a picture. Reader Poll: We asked 222 wikiHow readers what form of creative expression best distracts them from negative thoughts, and 44% of them said writing, drawing, or painting to channel emotions into art. [Take Poll]"
    },
    {
      "title": "Wait it out.",
      "content": "Wait it out. Delaying self-harm once you feel the urge is another way to break the self-harm cycle. Start with waiting just 10 minutes. See if the urge passes. If you still feel the urge to self-harm, wait another 10 minutes."
    },
    {
      "title": "Give yourself reminders about your actions.",
      "content": "Give yourself reminders about your actions. If you are faced with the urge to self-harm, talk to yourself. Give yourself reminders about the choices that you have. Tell yourself that you don’t want scars. Remember that you don’t have to hurt yourself just because you're thinking about self-harm. Repeat to yourself, “I don’t deserve to be hurt,” even if you don’t believe it. Remember that you always have the choice not to cut. It’s up to you what you do."
    },
    {
      "title": "Remove self-harming tools from your house.",
      "content": "Remove self-harming tools from your house. Remove anything you use to self-harm from your house. Knives, lighters, and whatever else you use – even the hidden things – need to be thrown out. Just throwing stuff in the garbage might not be enough. Make sure you do not have access to them even in the trash can. Give it up to someone else to dispose of them for good. You could even have a symbolic \"funeral\" for your harmful objects, burning them, throwing them away, or burying them. Say out loud: \"I don't need you anymore.\""
    },
    {
      "title": "Understand different forms of self-harm.",
      "content": "Understand different forms of self-harm. There are many forms of self-harm. Self-harm can vary from physically harming yourself (cutting) to placing yourself in risky or dangerous situations (driving under the influence of substances), or neglecting your own needs (not taking prescribed medication). Self-harm can be with or without intent of suicide. [2] X Research source Additionally, self-harm might be a symptom of another issue such as depression, anxiety, or other psychological disorder."
    },
    {
      "title": "Understand that self-harm is an addictive behavior.",
      "content": "Understand that self-harm is an addictive behavior. The act of self-harm has been found to be an addictive behavior. When you or someone you know self-harms, it releases the “feel-good” chemical in the brain called endorphins, [3] X Research source It is hard to change the cycle of self-harm especially while trying to find an alternative that releases the same “feel good” chemical. It might take some trial and error to find the right solution or combination of solutions that work for you."
    },
    {
      "title": "Discover your reasons for self-harm.",
      "content": "Discover your reasons for self-harm. The reason you or a loved one might self-harm varies depending on the person. Common reasons include gaining a sense of relief from intense feelings such as anger, guilt, anxiety, isolation, grief, or hopelessness. It can also be seen as an expression of those feelings. Other reasons include control over one's body especially when one feels out of control. Some people self-harm to feel something when feeling numb, and some reasons include a response to trauma or other issues like anxiety and depression. [4] X Research source Identifying triggers is one of the first steps for healing yourself. If the underlying triggers and causes are not addressed, the need for coping will remain. [5] X Research source"
    },
    {
      "title": "Acknowledge your thoughts.",
      "content": "Acknowledge your thoughts. To understand the thought patterns that lead you to self-harm, you first need to acknowledge your thoughts. Your thought process is a habit that you have. To break the habit of thinking negative thoughts, you need to become aware of these thoughts."
    },
    {
      "title": "Write in a journal.",
      "content": "Write in a journal. One tool to help understand your triggers and thought patterns is journaling. Writing down your feelings will help identify patterns that lead to self-harm. Also, journaling provides an outlet to share your feelings and process your thoughts. Write down when you feel the urge to self-harm, or when you actually do harm yourself. Try to write down the situation, thought, feeling or emotion that you experienced. You may have also experienced physical sensations such as energy, tightening of the stomach, or other actions. Write down what happened just before the self-harming. Journaling might reveal that you are experiencing certain situations that create the urge to self-harm. Some of these situations might be: problems with peers (including bullying or cyber-bullying), pressure at school, feeling socially isolated, abuse, confusion around sexuality, or issues in your family. [6] X Research source The goal is to become aware of your thoughts and not passively acting on negative thoughts that lead to self-harming behaviors."
    },
    {
      "title": "Assess your thought process.",
      "content": "Assess your thought process. The next step in combating negative thinking is to assess your thought process. Are your thoughts true? Look at your thought record and assess what similar situation you were in, did you learn anything and what were the long-term consequences? Did you handle any situations differently? A good way to assess negative thoughts is to look for words like “should,” “ought,” or “must.” These types of statements are usually negative and critical of yourself. Ask a friend or trusted family member if you are unsure if thoughts are true."
    },
    {
      "title": "Interrupt your negative thoughts.",
      "content": "Interrupt your negative thoughts. Another technique is to interrupt your negative thoughts. Imagine a stop light or noise that stops the thought. Your goals here are to interrupt the negative thought and to remind yourself of your thought patterns. Then, you will experience a sense of control and a sense of awareness to the pattern of thoughts. Thought stopping can be a physical change, such as doing an activity. Take a walk, talk with a friend, read a book, or work on a chore."
    },
    {
      "title": "Replace negative thoughts with positive ones.",
      "content": "Replace negative thoughts with positive ones. When you have negative thoughts, you need to counteract these with positive statements. Look through your thoughts journal and write down alternative, positive statements. For example, if you think, “I always ruin dinner parties because I arrive too late,” you can counter this thought with something positive, such as: “I am a caring person because I like to bring some flowers for the host.”"
    },
    {
      "title": "Use a cognitive behavioral therapy thought record worksheet.",
      "content": "Use a cognitive behavioral therapy thought record worksheet. This type of worksheet takes you through various steps to acknowledge negative thinking and understand how to replace them with positive thoughts. A thought record reminds you about questions to ask yourself about your thought process, including describing the situation, identifying what you’re reacting to, looking at the situation from an outside perspective, assessing whether the statement or situation is true, and how you can respond to the situation. [7] X Research source There are many cognitive behavioral therapy thought record templates available online, including here and here ."
    },
    {
      "title": "Try positive self-talk.",
      "content": "Try positive self-talk. Positive self-talk refers to your inner voice and the way that you talk to yourself. This inner voice impacts your motivation, outlook, self-esteem, and overall well-being. Positive self-talk is a way to talk to yourself to gain confidence, build a healthier lifestyle and reduce negative thoughts. [8] X Research source Examples of positive self-talk include: I am lovable. I am special. I am confident. I can achieve my goals. I am beautiful. Harming myself does not solve my problems. I can overcome my anger, sadness, and anxiety without harming. I can trust someone with my feelings right now. I can seek support. Remind yourself by using post-it notes or leaving messages on your mirror. If you have trouble believing abstract statements such as “I am special” or “I am confident,” you don’t have to use them just yet. Instead, use positive statements that focus on the behavior you want to achieve. These might give you more specific guidance, such as “I can trust someone with my feelings right now,” and “Harming myself does not solve my problems.” Positive self-talk should not be mandated by others. Instead, it should be used when you feel like it is helpful."
    },
    {
      "title": "Create a coping skill box.",
      "content": "Create a coping skill box. A coping skills box or kit is a container that you fill with supplies to help stop the urge to self-harm. These supplies will remind you of what you have. They may also help you redirect your energy into something positive, such as creating art. Some supplies for this box might include: Pictures of friends, family, or pets Journal Art supplies Inspiring quotes Music or lyrics"
    },
    {
      "title": "Talk to trusted loved ones.",
      "content": "Talk to trusted loved ones. You don't have to wait until you feel an urge to talk. Share the ups and downs with your close friends and relatives. Surround yourself with their support. When you feel the urge to self-harm, the best thing you can do is tell someone you feel that way. It is hard to verbalize our feelings and sometimes it is easier to act out our feelings of sadness, anger, or lonely in the form of self-harm. But for long-term success, it is important to address the underlying stress. If you self-harm, it might be embarrassing and hard to talk about. You might worry that the other person will judge you or pressure you to talk about it. But it is important to share your worries about your life with your loved ones. They want to help you."
    },
    {
      "title": "Write a note.",
      "content": "Write a note. If you are struggling with expressing yourself verbally, write a note or text to a friend or family member. This might help you communicate your thoughts without saying them out loud."
    },
    {
      "title": "Try the five senses technique as a self-soothing practice.",
      "content": "Try the five senses technique as a self-soothing practice. Part of the recovery process is learning new skills to help release feel-good chemicals in your brain that you may experience when you self-harm. Self-soothing techniques are a way to take care of yourself and focus on the here and now. The benefit of the five senses technique is to provide a way to get in a state of mind that allows you to address painful or extreme feelings leading to self-harm. [9] X Research source Start in a comfortable position. You can sit on the floor with legs crossed, or in a chair with your feet planted flat on the ground. Start to become aware of your breath. Focus on each part of your breath (inhale, hold, and exhale). You do not need to breathe in any particular way. Next, start to bring awareness to each of your 5 senses (sight, hearing, taste, smell, and touch). Spend about one minute focusing on only one sense: Hear: What sounds do you hear around you? Focus on external sounds (do you hear cars going by, people talking, birds chirping?). Focus on internal sounds (can you hear your breathing or digestion?). As you focus on hearing, did you notice anything you did not before? Smell: What do you smell? Is there food near you? You might notice smells you did not before, like the smell of paper in the books. Try closing your eyes. Sometimes this helps decrease visual distractions and sharpen other senses. Sight: What do you see? It is easy to see the couch or desk. Take notice of details such as colors, patterns, shapes and textures. Taste: What do you taste? Even if you do not have food in your mouth, you can still taste. Notice any aftertaste of a previous drink or meal. Run your tongue over your teeth and cheeks to help you become more aware. Touch: What do you feel without moving from your seated position? Feel the sensation of your skin being touched by clothing, seating in your chair, and feet on the floor. Feel the texture of your clothes or the chair."
    },
    {
      "title": "Try meditation or prayer.",
      "content": "Try meditation or prayer. Meditating has shown to improve positive emotions, satisfaction, health and happiness. Also, it decreases anxiety, stress and depression. There are many different types of mediation but the goal of all mediation is about calming the mind. The example below is a simple mediation to help start the process of calming one’s mind. Start in a comfortable seat position. Have a single point to focus on. This could be something visual such a candle flame, a sound such as a repeating single word or prayer, or something physical such as counting beads on a rosary. Keep your focus on this one thing. While you are focusing, your mind will wander. When you notice your thoughts wandering, let the thought go, and bring your concentration back to your focus point. This might sound easy, but focusing the mind is challenging. Don’t be disappointed if you can only focus for a few minutes at first. [10] X Research source"
    },
    {
      "title": "Try breathing exercises.",
      "content": "Try breathing exercises. Breathing is a natural response that we can control. Research shows that practicing breathing has a positive impact on our stress response or “fight or flight” response. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source The same stress response can be triggered when we feel the need to self-harm. Learning this skill can help us take control of our triggers. Try this breathing exercise: Count to 5 while inhaling, hold for 5 counts, and take 5 counts to exhale. Focus on each part of your breath as you count. Another way to focus on your breath is to use a deflated balloon. Blow up the balloon and watch it deflate."
    },
    {
      "title": "Use visual imagery to create an imaginary “safe place.”",
      "content": "Use visual imagery to create an imaginary “safe place.” Imagery refers to a picture in your mind. The image is peaceful or reminds you of a happy memory. Sometimes it is easier to have the picture printed out. Then you can focus on it. [12] X Research source"
    },
    {
      "title": "Try progressive muscle relaxation.",
      "content": "Try progressive muscle relaxation. Progressive muscle relaxation (PMR) is a type of coping skill that focuses on tensing and relaxing different muscle groups. The benefit of progressive muscle relaxation includes helping you become more aware of physical sensations in your body. Start in a comfortable position that allows you to focus on different muscle groups. Most people find sitting or lying down the easiest to start. Focus on one group of muscles that you can tense and then relax. Common areas include face, hands and arms, stomach/ middle section, and legs/feet. To start with your face, imagine eating a lemon. Feel the tension in your lips, cheeks, jaw, forehead, and eyes when you bite into the lemon. Your face gets all wrinkled around your nose, yours eye close, and your lips pucker. Then focus on relaxing all those muscles. It might help to think about eating something sweet and how your face feels relaxed/calm when you are eating something you enjoy. [13] X Research source To work on your shoulders and back, imagine that you are a cat. Think about how a cat arches its back and spreads its paws. Make your body copy the cat. Roll your shoulders up to your ears and arch your back. You can even get on your hands and knees to really arch your back. Then relax and go back to your normal sitting position. For your middle, it might be easiest to lay on your back. Imagine a heavy ball sitting on your stomach. Take a really deep breath, and relax those muscles. Tense and relax your feet. This can be done anywhere, even when wearing shoes. Curl your toes. Then stretch them out as wide as they can go. Relax your toes."
    },
    {
      "title": "Take a mindfulness walk.",
      "content": "Take a mindfulness walk. A mindful walk is mindfulness in movement. Benefits of a mindfulness walk include learning awareness in daily life. Additionally, sitting still and doing a “traditional” mediation might be hard for some people. Walking is more active form of meditation. You can also get the added health benefits of walking. [14] X Research source While walking, take notice of each step. How do your feet feel on ground? How do your feet feel in your shoes? Focus on your breath. Take notice of the environment: Stop and smell the roses, as the saying goes. [15] X Research source"
    },
    {
      "title": "Get help if there is the risk of suicide.",
      "content": "Get help if there is the risk of suicide . If you or someone you are thinking about suicide, get help immediately. Call 1-800-273-TALK (8255) or your local emergency response (911). The following are some signs to look for if you are concerned about a loved one: Talking about wanting to die or to kill themselves. Looking for a way to kill themselves. Making statements about being hopeless. Talking about having no reason to live."
    },
    {
      "title": "Seek professional help.",
      "content": "Seek professional help. A psychologist or counselor can help you understand difficult emotions and overcome trauma. This person has the education, training, and experience to help you overcome issues that are driving your behaviors. Ask your doctor for a referral to a counselor or psychologist who specializes in self-harm. Schedule an appointment to talk. If you have trouble being honest with a close friend or family member, you may find it freeing and comforting to share with someone who doesn't know you. If you have some really difficult life situations, such as abuse or a traumatic incident, or your feelings are so overwhelming that they drive you to cut or harm yourself, the most productive place for you to express those feelings is in a safe, neutral, and nonjudgmental environment."
    },
    {
      "title": "Find a support group.",
      "content": "Find a support group. Your community may have a self-injury support group. This group can be helpful in identifying, verbalizing and coping with feelings associated with self-harm. [16] X Research source Look on the S.A.F.E. Alternatives website for listings of support groups near you."
    },
    {
      "title": "Talk to your doctor about other conditions.",
      "content": "Talk to your doctor about other conditions. Some people who self-harm may be experiencing other mental health issues, such as depression, [17] X Research source , substance abuse, eating disorders, [18] X Research source schizophrenia, or personality disorders. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source , If you feel that you may have another disorder that is contributing to your self-harm, talk with your doctor or counselor."
    },
    {
      "title": "Be honest.",
      "content": "Be honest. Be truthful with your therapist about what you feel or what's been going on. Remember that he is there to help you. If you aren't honest, you might not get the treatment you really need. It's important to tell the truth. Remember, therapy is confidential, so anything you say to your therapist will not be repeated unless you are planning to hurt yourself or another."
    },
    {
      "title": "Celebrate milestones.",
      "content": "Celebrate milestones. With an addiction, it's important to take the time to celebrate your achievements. Each day you go without harming yourself should be celebrated as a victory. At the end of your first week, celebrate by treating yourself to something or going out with friends. Start extending the length of your milestones, celebrating at first with days, and then weeks, months, and years. You may struggle with these thoughts for a while, but celebrating your milestones can help celebrate your efforts, looking forward and looking back."
    },
    {
      "title": "Believe in yourself",
      "content": "Believe in yourself . In the end, it's up to you: If you think positive and have faith in yourself, your addiction will become a distant memory that may have left you with a few scars. Once you stop self-harming, you'll feel and think much more clearly and honestly about the world, and about yourself. Believe that others care about you, and care about yourself. You can stop."
    },
    {
      "title": "Understand that relapses might happen.",
      "content": "Understand that relapses might happen. Sometimes you will start to think about self-harm or actually harm yourself. This is called a relapse. You can't beat yourself up over this; everyone relapses at one point or another. Remember that self-harm is an addiction, and relapses often happen during recovery. There may be times where you can't help yourself, but that only means you must continue to work hard. Just because you take one step back doesn't mean you can't take three steps forward next."
    }
  ]
}