{
  "url": "https://www.wikihow.com/Unlock-Mario-Kart-Cups-and-Characters",
  "title": "How to Unlock Mario Kart Cups and Characters",
  "steps": [
    {
      "title": "Unlock Gold Mario (Mario Kart 8 Deluxe only).",
      "content": "Unlock Gold Mario (Mario Kart 8 Deluxe only). Unlike in the Wii U version of Mario Kart 8, all characters and cups in Mario Kart 8 Deluxe for Nintendo Switch are unlocked by default. All characters, that is, except for Gold Mario. To unlock Gold Mario, you'll have to win all Grand Prix cups at the fastest/hardest difficulty level, which is 200cc. [1] X Research source Since Gold Mario is a skin for Metal Mario, Metal Mario will be replaced with Gold Mario on the character screen once unlocked."
    },
    {
      "title": "Unlock characters by getting 1st place in Grand Prix Cups (Mario Kart 8 for Wii U only).",
      "content": "Unlock characters by getting 1st place in Grand Prix Cups (Mario Kart 8 for Wii U only). You will unlock a new, randomly-selected character each time you win a cup. The 8th character you unlock will always be Mii. [2] X Research source Unlockable characters on Mario Kart 8 for Wii U: Heavy: Rosalina, Metal Mario, Pink Gold Peach, Roy, Morton. Medium: Iggy, Ludwig. Light: Baby Rosalina, Lakitu, Toadette, Lemmy, Larry, Wendy. Winning the same cup more than once won't unlock a new character, but different engine classes count as different cups. For example, you'll unlock a new character by winning the 50cc Mushroom Cup, and another new character by winning the 100cc Mushroom Cup."
    },
    {
      "title": "Unlock new cups (Mario Kart 8 for Wii U only).",
      "content": "Unlock new cups (Mario Kart 8 for Wii U only). To unlock a cup on the Wii U version, you have to win the cup that comes before it. [3] X Research source Once a cup is unlocked, you can play it in any engine class. Original Courses You'll start with the Mushroom Cup. Flower Cup: Complete Mario Kart Stadium, Water Park, Sweet Sweet Canyon, and Thwomp Ruins. Star Cup: Complete Mario Circuit, Toad Harbor, Twisted Mansion, and Shy Guy Falls. Special Cup: Complete Cloudtop Cruise, Bone Dry Dunes, Bowser's Castle, and Rainbow Road. (These tracks are of the Cup itself, not those needed to unlock the Cup.) Retro Courses You'll start with Shell Cup. Banana Cup: Complete Dry Dry Desert, Donut Plains 3, Royal Raceway, and DK Jungle. Leaf Cup: Complete Wario Stadium, Sherbet Land, Music Park, and Yoshi Valley. (These tracks are of the Cup itself, not those needed to unlock the Cup.) Lightning Cup: Complete Tick-Tock Clock, Piranha Plant Slide, Grumble Volcano, and Rainbow Road. (These tracks are of the Cup itself, not those needed to unlock the Cup.)"
    },
    {
      "title": "Purchase additional characters and cups.",
      "content": "Purchase additional characters and cups. If you're playing Mario Kart Deluxe on a Switch, there are no additional cups and characters to download—in fact, all of the available DLCs for the Wii U version of Mario Kart 8 are available in Mario Kart 8 Deluxe from the beginning. [4] X Research source But if you're playing on your Wii U, you can buy DLC packs for more characters, cups, and other content. [5] X Research source DLC Pack 1: Characters: Tanooki Mario, Link, Cat Peach Cups: Egg Cup, Triforce Cup DLC Pack 2: Characters: Isabelle, Dry Bowser, Villager (male and female) Cups: Crossing Cup and Bell Cup"
    },
    {
      "title": "Unlock cups by getting 3rd place or better in available cups.",
      "content": "Unlock cups by getting 3rd place or better in available cups. Each Grand Prix Cup can be unlocked by getting a trophy (bronze or better) in an earlier cup. It does not matter which engine class (50cc etc.) you use. [6] X Research source Star Cup: Finish 3rd+ in the Mushroom Cup and the Flower Cup. Special Cup: Finish 3rd+ in the Star Cup. Leaf Cup: Finish 3rd+ in the Banana Cup and the Shell Cup. Lightning Cup: Finish 3rd+ in the Leaf Cup. You can also unlock \"Mirror Mode\" for all cups, reversing the tracks left-to-right, by getting first place in all cups at 150cc difficulty — quite a challenge!"
    },
    {
      "title": "Unlock characters by winning 50cc races.",
      "content": "Unlock characters by winning 50cc races. Here are the characters you can unlock in the easiest mode, so go for these first: King Boo: Win the 50cc Star Cup. [7] X Research source Diddy Kong: Win the 50cc Lightning Cup. Baby Daisy: Earn one star or better on all 50cc Wii cups (Mushroom, Flower, Star, and Special)."
    },
    {
      "title": "Unlock characters in 100cc.",
      "content": "Unlock characters in 100cc. Go for these next, playing on harder difficulties: Dry Bones (a Koopa skeleton) : Win the 100cc Leaf Cup. [8] X Research source Mii Outfit: Win the 100cc Special Cup. Bowser Jr.: Earn one star or better on all 100cc Retro cups (Shell, Banana, Leaf, Lightning)."
    },
    {
      "title": "Unlock characters in 150cc.",
      "content": "Unlock characters in 150cc. Prove your skill by earning these characters on the hardest difficulty: Daisy: Win the 150cc Special Cup. Dry Browser ( skeleton bowser ): Earn one star or better on all 150cc Wii cups (Mushroom, Flower, Star, and Special)."
    },
    {
      "title": "Unlock characters through Time Trials.",
      "content": "Unlock characters through Time Trials. In Time Trial mode, you race alone, with a \"ghost\" racer you can't interact with demonstrating the time you need to beat. If you beat the ghost by a significant amount (sometimes 2 seconds, sometimes more), you'll get an announcement that you've unlocked a new (faster) \"Expert Staff Ghost.\" You do not need to beat these expert ghosts, but unlocking enough of them by beating normal ghosts will unlock characters. [9] X Research source Funky Kong: Unlock four expert ghosts. Baby Luigi: Unlock eight expert ghosts. Birdo: Unlock sixteen expert ghosts ( or play online until you've beat 250 players.) Toadette: Play all 32 Time Trial tracks (you don't need to beat them). Mii Outfit B (Mario/Peach Outfit): Unlock all 32 expert ghosts. This character has identical stats to the Mii unlocked by winning the 100cc Special Cup. Instead of your normal Mii outfit, this Mii will wear an outfit like Mario (male Miis) or Peach (female Miis). [10] X Research source"
    },
    {
      "title": "Unlock Rosalina.",
      "content": "Unlock Rosalina. There are two ways you can unlock Rosalina, the NPC from Super Mario Galaxy. Complete one of these tasks: Get first place in all 150cc cups to unlock Mirror Mode, then get 1 star in Mirror Mode on all eight cups. Or play Super Mario Galaxy on your Wii, load a new file and save it, then play any races in Mario Kart Wii until Rosalina appears."
    },
    {
      "title": "Learn advanced strategies for tough unlocks.",
      "content": "Learn advanced strategies for tough unlocks. Whether you're going for Time Trials or 150cc courses, knowing advanced strategy can save hours of effort. Check out this expert driving guide for all of these challenges, plus these tips: [11] X Research source Use Heavy vehicles for Time Trials, since they have the highest max speed. Acceleration doesn't matter as much when there are no opponents to disrupt you. Look for hidden shortcuts. There are many of these in the game, from a dirt path near the start of Maple Treeway, to a passageway under a minecart in Wario's Goldmine. If you're having trouble on a track, search for online videos and you might discover a new shortcut."
    }
  ]
}