{
  "url": "https://www.wikihow.com/Tree-Pulley-Bird-Feeders",
  "title": "How to Tree Pulley Bird Feeders",
  "steps": [
    {
      "title": "Choose a bird feeder that doesn’t weigh more than 10 pounds (4.5 kg).",
      "content": "Choose a bird feeder that doesn’t weigh more than 10 pounds (4.5 kg). The bird feeder doesn’t have to be very small or light, but too heavy of a bird feeder may fall down—unless you have a strong rope and pulley. Most standard bird feeders should be fine to hang up. [1] X Research source"
    },
    {
      "title": "Find a tree with a sturdy branch.",
      "content": "Find a tree with a sturdy branch. A weak, thin branch won’t support the weight of the rope, pulley, and bird feeder. Find a fairly thick and secure branch. A branch that has the width of an average adult arm should be thick enough. Make sure the tree is healthy as well and isn’t likely to fall over in a storm. [2] X Research source"
    },
    {
      "title": "Set up a ladder under the branch.",
      "content": "Set up a ladder under the branch. Put a ladder underneath the area of the tree where you plan to hang up the pulley. The ladder should be sturdy and tall enough so that you won’t have to reach far for the branch. Ask someone to hold the ladder for you while you are on it to be safe. [3] X Research source"
    },
    {
      "title": "Clamp the loop together.",
      "content": "Clamp the loop together. Many bird feeders already come with a loop. If this is the case, clamp the loop together to create a smaller loop. A smaller loop will be more secure when attached to the pulley. Use a 1/2” (1.3 cm) clamp to create the smaller loop. [4] X Research source If your bird feeder doesn’t have a loop, you can create one with a metal wire. If your bird feeder has a hook, you do not need to do anything. It is ready for the pulley."
    },
    {
      "title": "Use an eye hook.",
      "content": "Use an eye hook. If you don’t want to use a loop, you can also attach an eye hook to your bird feeder. Make sure the eye hook is big enough to fit around the pulley. Drill a small hole into the top of the bird feeder. Then, screw in the eye hook. [5] X Research source Make sure the eye hook is secure so that it won’t fall out when attached to the pulley."
    },
    {
      "title": "Test the hook or loop to make sure the bird feeder will hold.",
      "content": "Test the hook or loop to make sure the bird feeder will hold. When you’re done creating the loop or attaching the hook, hold up the bird feeder. Move it around a little bit. Make sure that the bird feeder will stay attached to the loop or hook. [6] X Research source"
    },
    {
      "title": "Put an S-hook over the chosen branch.",
      "content": "Put an S-hook over the chosen branch. Make sure the S-hook is large enough to fit over the tree branch. If the S-hook isn’t wide enough, you can loop a chain or rope around the tree branch. If you are using a rope, make sure it is tied very tightly around the branch. [7] X Research source"
    },
    {
      "title": "Hang the pulley from the S-hook.",
      "content": "Hang the pulley from the S-hook. The pulley should have a hook. Put the hook of the pulley over the bottom hook of the S-hook. If you’re not using an S-hook, tie the rope or chain around the pulley hook. [8] X Research source If you’re using a rope or chain, you can pull it through the hook and tie it around the tree again—creating a large loop out of the rope or chain."
    },
    {
      "title": "Thread a rope through the pulley.",
      "content": "Thread a rope through the pulley. First, make sure the rope you’re using is long enough to reach from the ground to the pulley and back down to the ground. To thread the rope through the pulley, you just need to put one side of the rope over the top of the pulley and pull it down towards you. There should be two sides of the rope hanging towards the ground if you’ve done it correctly. [9] X Research source"
    },
    {
      "title": "Attach one end of the rope to the bird feeder.",
      "content": "Attach one end of the rope to the bird feeder. If the top of your bird feeder has a loop, thread the rope through the loop and tie a secure knot. If your feeder has a hook, tie the rope around the hook. Make sure the rope is securely attached to the feeder. [10] X Research source"
    },
    {
      "title": "Tie the rope around the base of the tree.",
      "content": "Tie the rope around the base of the tree. Once the rope is attached to the feeder, you should still have a free end of the rope. You can tie this end of the rope around the base of the tree. Or, you can hammer a hook into the tree and tie the the rope around the hook. Untie the rope anytime you need to use the pulley. [11] X Research source You can also pound a stake into the ground, and tie the rope around the stake."
    }
  ]
}