{
  "url": "https://www.wikihow.com/Style-2a-Hair",
  "title": "How to Style 2a Hair",
  "steps": [
    {
      "title": "2a hair is neither straight nor curly but naturally wavy.",
      "content": "2a hair is neither straight nor curly but naturally wavy. If you have 2a hair, you've got the best of both worlds! This hair type is the happy medium between completely straight and densely curly hair, meaning that it can be straightened and hold waves or curls with the right methods. Typically, 2a hair has an “s” pattern. It’s usually straight on top, has a slight curve towards the middle of the strand, and then straightens back out at the end. [1] X Research source 2a hair is the most common hair type, but there is also 2b and 2c hair. If you have even the slightest S-shaped bend in your hair , you have 2a hair. If you have large, loose S-shaped waves , you have 2b hair. If you have very defined S-shaped waves , you have 2c hair."
    },
    {
      "title": "Add a diffuser to your hairdryer for bolder waves.",
      "content": "Add a diffuser to your hairdryer for bolder waves. This is a great trick if you don’t have time to let your hair air-dry or are looking for a little more volume. Simply twist a diffuser attachment onto your hairdryer, flip your head upside down, and scrunch your hair upward using the diffuser. [2] X Research source Put product in your hair before scrunching. This will help define your waves and keep them in place. Keep your hairdryer on a medium, cool setting to avoid frizz."
    },
    {
      "title": "Braids and twists tame and style natural waves.",
      "content": "Braids and twists tame and style natural waves. If your 2a hair is being especially difficult, try pulling it back into a half up half down braid or twist . If you’re looking to wake up with voluminous waves, sleep in two french braids to bring out your hair’s gorgeous texture. [3] X Research source"
    },
    {
      "title": "Accentuate your natural waves with a beach wave look.",
      "content": "Accentuate your natural waves with a beach wave look . Your 2a hair is a bit curly already, so all you have to do is spray, scrunch, and ruffle! On damp hair, spritz the sea salt spray all over your hair. Scrunch your hair starting at the ends until your hair is nice and textured. You can also spritz your hair with sea salt spray before braiding or twisting for extra hold and texture."
    },
    {
      "title": "Create voluminous curls with a curling iron.",
      "content": "Create voluminous curls with a curling iron. If you're looking for a more bouncy, defined curl, style your hair with a curling iron. Curl your hair away from your face until all of your hair is curled. Using a smaller barreled curling iron or wand will create tighter curls, and a large barreled iron or wand will make large, loose curls. Try curling around your existing waves for a more natural look. Only curl a few sections of your hair and then loosen the curls by separating them with your fingers."
    },
    {
      "title": "Try baloney curls for a heatless curl.",
      "content": "Try baloney curls for a heatless curl. This is a great way to get big beachy waves without a curling iron! Separate your hair into 2 to 4 sections while it's wet. Then, twist each section with your fingers. Leave the wraps to draw, shake the twisted sections out, add a spritz of hairspray, and voila!"
    },
    {
      "title": "Part your hair to the side for extra volume.",
      "content": "Part your hair to the side for extra volume. If your 2a hair is curlier near your scalp, try switching around your part to show off those luscious waves! Use your finger or a comb to part your hair above the arch of your eyebrow. Flip the hair to the opposite side and scrunch."
    },
    {
      "title": "Tease your hair at the root for extra volume.",
      "content": "Tease your hair at the root for extra volume. This hairstyle can be for a casual trip to the grocery store or a night on the town. Simply ruffle your hair and divide it into two sections, a top and bottom. Next, tease the bottom section by scrapping them upwards with a comb. Finally, release the top section of hair over what you’ve teased. Add some hair spray, and you’re ready for anything! Do this hairstyle on completely dried hair. Curl the top section of hair for a more glamorous look."
    },
    {
      "title": "To combat frizz, apply hair oil or serum.",
      "content": "To combat frizz, apply hair oil or serum. These moisturizing products will calm any fly aways and leave behind glossy waves. Adding some oil or serum to your hair once a week can even help damaged hair look healthier, support hair growth, and protect for humidity. [4] X Research source"
    },
    {
      "title": "To enhance natural waves, use sea salt spray.",
      "content": "To enhance natural waves, use sea salt spray. This is the product for you if you’re looking for that tousled beach wave look. A spritz of sea salt spray and a few hair scrunches can get you effortless-looking waves in no time! [5] X Research source Sea salt can be a bit drying, so use sparingly if you have dry or finer hair."
    },
    {
      "title": "To add volume, give dry shampoo a try.",
      "content": "To add volume, give dry shampoo a try. Paired with other wavy hair products, dry shampoo can give you effortless voluminous waves and a shine-free scalp. Put a little powder or spray dry shampoo on oily patches on your scalp to lessen shine or give your hair some extra height. [6] X Research source Dry shampoo may not be the best option if you have a dry scalp. The powder and moisture-evaporating properties of the product could irritate an already dry, sensitive scalp."
    },
    {
      "title": "To ease knots, try a detangling spray.",
      "content": "To ease knots, try a detangling spray. Prepping 2a hair can be a hassle as it can tangle rather easily. Having a leave-in-conditioner or detangler on hand is a great way to get through stubborn knots. Plus, most detanglers have a frizz protectant built in to tame and define your waves. [7] X Research source"
    },
    {
      "title": "To add extra bounce and hold to curls, use hair gel or mousse.",
      "content": "To add extra bounce and hold to curls, use hair gel or mousse. [8] X Expert Source Nick Arrojo Master Hair Stylist Expert Interview. 9 September 2021. A non-sticky and lightweight styling gel, mousse, or foam can do wonders to your 2a hair by defining even the smallest of curls. Rub a small amount between your palms and scrunch into wet or damp hair. [9] X Research source Look for silicone- and sulfate-free products to give your hair the best bounce possible. Sulfates and silicones can lead to dry, flat, and straw-like hair. [10] X Research source"
    },
    {
      "title": "Try the curly girl method.",
      "content": "Try the curly girl method . If you have 2a hair, your hair is most likely more straight than it is curly. Because of this, you may not know what your natural waves look like. This is where the curl girl method comes in. Trying out this hair care routine is a great way to see how your hair naturally curls. Who knows? You may find some new favorite hair care methods and products in the process!"
    },
    {
      "title": "Use sulfate-free shampoo and conditioner.",
      "content": "Use sulfate-free shampoo and conditioner. Sulfate strips hair of natural oils and moisture, and your 2a hair needs moisture to create effortless-looking waves. Washing your hair with moisturizing and hydrating products will cater to your natural waves. Plus, many sulfate-free products feature frizz protection, which is a plus for wavy hair. [11] X Research source Avoid putting conditioner on your scalp. Focusing hair serums and conditioners on the ends of your hair will help your hair look fresh until its next wash. [12] X Research source"
    },
    {
      "title": "Try a leave-in conditioner treatment.",
      "content": "Try a leave-in conditioner treatment. Knots are a daily occurrence if you have 2a hair. [13] X Research source Hydrating your hair with a leave-in treatment or hair mask once a week can soften your locks, help control frizz, and keep the tangles away. [14] X Expert Source Nick Arrojo Master Hair Stylist Expert Interview. 9 September 2021. Check your local beauty store for treatment options, or make a de-frizz hair mask at home. You can even buy a defrizz serum. [15] X Expert Source Nick Arrojo Master Hair Stylist Expert Interview. 9 September 2021."
    },
    {
      "title": "Use microfiber towels.",
      "content": "Use microfiber towels. The bath towels you find in the store are most likely made of terry cloth. Although soft, these towels create friction when drying, which results in frizzy, damaged hair. A microfiber towel has absorbent, fast-drying fibers that don’t separate or heat your hair. [16] X Research source Read the labels on your towels to see if they’re made of microfiber. If you don’t have a microfiber towel on hand, try drying your hair by scrunching it with a cotton T-shirt. [17] X Research source You can find microfiber towels at your local drug store or online."
    },
    {
      "title": "Sleep on silk or satin pillowcases.",
      "content": "Sleep on silk or satin pillowcases. These smooth, breathable fabrics provide a cool place for your hair to rest at night. The slip-like material helps maintain frizz and tangles, so you wake up with natural waves rather than a poof! Try switching your cotton pillowcase with a silk or satin one to see the difference. [18] X Research source"
    },
    {
      "title": "Always scrunch your hair.",
      "content": "Always scrunch your hair. When caring for wavy hair, patting and smoothing products down your hair is a big no-no. To get the most out of your 2a hair, apply gels and mousses in upward scrunching motions starting at the ends. Follow the same motion when drying your hair with a towel or diffuser. [19] X Research source"
    },
    {
      "title": "Try using as little heat as possible.",
      "content": "Try using as little heat as possible. Consider heatless hairstyles first before reaching for the straightener or curling iron. The less damage on your 2a hair, the healthier and wavy-er it’ll be! [20] X Research source"
    }
  ]
}