{
  "url": "https://www.wikihow.com/Wash-a-North-Face-Jacket",
  "title": "Quick & Easy Guide to Cleaning Any North Face Jacket",
  "steps": [
    {
      "title": "Put the jacket in a washing machine on a cool, delicate, double-rinse cycle.",
      "content": "Put the jacket in a washing machine on a cool, delicate, double-rinse cycle. If you’re washing a waterproof North Face jacket, like a GORE-TEX®, make sure all pockets are zipped up and all hook-and-loop fastener straps are fastened. Pour in a small amount of mild detergent —you can even find detergents that are designed specifically for cleaning technical waterproof fabrics. [1] X Research source Use a double-rinse cycle to ensure there’s no residue left from the detergent–residue can damage the GORE-TEX® fabric. If your washer doesn’t have an option for a double-rinse cycle, just run a separate rinse-only cycle after the first cycle is finished. If you can, use a front-loading washer or a top-loader without an agitator—these will be gentler on your jacket than a top-loader with an agitator. If you don’t have a machine without an agitator, Flournoy recommends that you either wash your rain jacket “ by hand with a mild detergent or take it to a dry cleaner.” Do not use fabric softener or bleach on your jacket as these can damage or discolor the material."
    },
    {
      "title": "Move the jacket to a tumble dryer on a low setting.",
      "content": "Move the jacket to a tumble dryer on a low setting. Flournoy says to “dry a rain jacket on low heat. Avoid using high dryer heat, and avoid ironing it.” This will help maintain the integrity of the DWR (Durable Waterproof Repellant) coating. Flournoy says that it’s also fine to let the jacket air dry if you prefer. Either hang the jacket to dry or lay it out flat on a drying rack."
    },
    {
      "title": "Every few washes, use a water repellent to revive the waterproof coating.",
      "content": "Every few washes, use a water repellent to revive the waterproof coating . You can purchase spray-on waterproofing or wash-in waterproofing , and both options are pretty easy to use. Just be sure to carefully follow the application instructions on the product label. [2] X Research source If you’re using a spray-on product, you’ll usually apply it to clean, damp fabric. If you’re using a wash-in product, either pour it into your detergent dispenser or add it to a top-loading washer after it’s filled with water."
    },
    {
      "title": "Secure all pockets and turn the jacket inside-out.",
      "content": "Secure all pockets and turn the jacket inside-out. Washing a fleece jacket inside-out will help prevent “pilling,” or the balling up of lint, on the jacket. And closing all of the zippers and velcro fasteners will help prevent the fleece from getting snagged during the wash cycle. [3] X Research source If you notice \"pills\" beginning to form, you can take a razor and gently scrape them off the exterior of the jacket."
    },
    {
      "title": "Wash the jacket on a low-spin, cold water cycle.",
      "content": "Wash the jacket on a low-spin, cold water cycle. Mirjan says that the best way to wash fleece is “in the washer on the delicate cycle, with a small amount of mild detergent.” If possible, place the jacket in a front-loading washing machine or a top-loading machine without an agitator. Using a low-spin setting, wash the jacket in cold water, as fleece should cannot handle high heat. [4] X Research source You can use mild liquid or powder detergent on fleece, but fabric softeners and bleach are still advised against, as they may damage the material. [5] X Research source"
    },
    {
      "title": "Hang the jacket to air dry.",
      "content": "Hang the jacket to air dry. Fleece can shrink or be damaged in high temperatures, so it’s better to hang your jacket or lay it flat to dry. If you do decide to put it in the dryer, use the lowest possible heat setting—but keep in mind that this could still damage the jacket. [6] X Research source To prevent mildew, make sure your North Face fleece is completely dry before you place it in your closet."
    },
    {
      "title": "Place the jacket in the washing machine on a warm, gentle cycle.",
      "content": "Place the jacket in the washing machine on a warm, gentle cycle. Mirjan says that “it’s best to wash a down jacket in a washing machine with a natural detergent to ensure it gets clean.” Like other North Face jackets, putting a down jacket in a top-loading machine with an agitator will likely damage it, so it’s best to use a front-loading machine or a top-loading machine without an agitator. But unlike other styles of jacket, it’s best to wash these with warm water, not cold. For best results, repeat the rinse and spin cycles to help remove all soap residue. Make sure all pockets are emptied out and zipped up."
    },
    {
      "title": "Tumble-dry the jacket on low with dryer balls in 10 minute increments.",
      "content": "Tumble-dry the jacket on low with dryer balls in 10 minute increments. Place the jacket in the dryer with dryer balls or new, clean tennis balls . Check it every 10–15 minutes and give the jacket a good shake to ensure no clumps of down are forming. Repeat this process until the jacket is completely dry—this can take up to 2 hours, or more in some cases. [7] X Research source Using laundry balls and shaking the jacket periodically will help prevent the down from forming clumps, which would ruin the jacket. Mirjan says that if you want to lay the down jacket flat to dry, “be sure to fluff it back up to keep the down from sticking together.”"
    },
    {
      "title": "Can I put a North Face jacket in the washing machine?",
      "content": "Can I put a North Face jacket in the washing machine? Yes, most North Face jackets can be washed in the washing machine. However, avoid washing your TNF jacket in a top-loading washing machine with an agitator—the friction from the agitator can damage the fabric."
    },
    {
      "title": "How do you make a North Face jacket puffy after washing it?",
      "content": "How do you make a North Face jacket puffy after washing it? Put it in the dryer on low heat. Add dryer balls to the dryer, and every 10–15 minutes, take the jacket out and shake it. Keep doing this for 1–2 hours or until you don’t feel any clumps and the jacket is completely dry."
    },
    {
      "title": "Do North Face jackets shrink in the dryer?",
      "content": "Do North Face jackets shrink in the dryer? If you put a fleece jacket in the dryer on high heat, it could shrink. Be sure to carefully follow the care instructions on the garment to avoid damaging your North Face jacket."
    },
    {
      "title": "How often should I wash my North Face jacket?",
      "content": "How often should I wash my North Face jacket? To prolong the life of your jacket, wash it whenever it’s visibly dirty or has picked up odors from being outdoors."
    },
    {
      "title": "Can I use bleach on my North Face jacket?",
      "content": "Can I use bleach on my North Face jacket? No, you shouldn’t use bleach on any North Face jackets as it could damage them."
    },
    {
      "title": "What temperature should I use to wash a North Face jacket?",
      "content": "What temperature should I use to wash a North Face jacket? Waterproof and fleece jackets should only be washed in cold water. If you have a down jacket, wash it in warm—not hot—water."
    },
    {
      "title": "How do I get stains off of my North Face jacket?",
      "content": "How do I get stains off of my North Face jacket? Treat stains as soon as you see them by rubbing the area with a little bit of mild detergent. Let that sit for a few minutes, then wash the jacket as you normally would. Repeat if needed—don’t put the jacket in the dryer until the stain is gone."
    }
  ]
}