{
  "url": "https://www.wikihow.com/Treat-a-Cyst",
  "title": "How to Treat a Cyst: Pain Relief and Home Remedies",
  "steps": [
    {
      "title": "Distinguish between a sebaceous cyst and epidermoid cyst.",
      "content": "Distinguish between a sebaceous cyst and epidermoid cyst. An epidermoid cyst is more common than a sebaceous cyst. [1] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Each will have slightly different symptoms and will be treated just a little differently. Therefore, it is important that the cyst you have on your skin is diagnosed appropriately for effective treatment. Both types of cysts are flesh-colored or white-yellow and have a smooth surface. [2] X Research source Epidermoid cysts are more common. These are slow growing and often painless. They don’t usually require treatment, unless they are causing pain or become infected. Pilar cysts are composed primarily of keratin (the protein that makes up hair and nails) and form from the outer hair root sheath, typically on the head. A pilar cyst is often thought to be another term for a sebaceous cysts, but they are in fact different. [3] X Trustworthy Source DermNet NZ Online clinical resource website written and run by dermatologists providing evidence-based information about dermatology and skin health Go to source Sebaceous cysts are commonly found in the hair follicles on the head. They form inside the glands that secrete sebum, an oily substance that coats the hair. When these normal secretions are trapped, they develop into a pouch containing a cheese-like substance. They are commonly found in areas near the neck, upper back, and on the scalp. [4] X Research source Sebaceous cysts are often confused with pilar or epidermoid cysts."
    },
    {
      "title": "Distinguish between cysts in the breast and tumors.",
      "content": "Distinguish between cysts in the breast and tumors. Cysts can be in one or both breasts. Without a mammogram or needle biopsy it is almost impossible to distinguish between the two different types of lumps in the breast. Symptoms of a breast cyst will include: [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Smooth, easily movable lump with distinct edges Pain or tenderness over the lump Size and tenderness will increase just before your period starts Size and tenderness will decrease when your period ends"
    },
    {
      "title": "Understand cystic acne.",
      "content": "Understand cystic acne. Acne is a general term that describes a variety of different types of pimples, blackheads, pustules, whiteheads and cysts. Cystic acne are nodules that are red, raised, often 2–4 mm in size and nodular and are the most severe form of acne. The infection in a cystic acne is deeper than that in other pustules or whiteheads. Cystic acne is painful. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Identify a ganglion cyst.",
      "content": "Identify a ganglion cyst. These are the most common types of lumps found on the hand and wrist. They are not cancerous and often harmless. Filled with fluid, they can quickly appear, disappear or change in size. They do not require treatment unless they interfere with function or are unacceptable in appearance. [7] X Research source"
    },
    {
      "title": "Determine if pain is from a pilonidal cyst.",
      "content": "Determine if pain is from a pilonidal cyst. In this condition there is a cyst, abscess or dimple that forms in the crease between the buttocks that runs from the lower end of the spine to the anus. It can be caused from wearing tight clothing, excess body hair, sitting for long periods of time or obesity. Symptoms can include pus from the area, tenderness over the cyst, or the skin may be warm, tender or swollen near the tailbone. Or there may not be any symptoms beside a pit or dimple at the base of the spine. [8] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source"
    },
    {
      "title": "Distinguish a Bartholin gland cyst.",
      "content": "Distinguish a Bartholin gland cyst. These glands are located on either side of the vaginal opening to lubricate the vagina. When the gland becomes obstructed, a relatively painless swelling forms called a Bartholin's cyst. If the cyst is not infected you may not notice it. An infection can occur in a matter of days causing tenderness, fever, discomfort walking, pain with intercourse, and a tender, painful lump near the vaginal opening. [9] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source"
    },
    {
      "title": "See a doctor for swelling in the testicles.",
      "content": "See a doctor for swelling in the testicles. All testicular swelling must be diagnosed by a physician to determine the differences between a cyst, cancerous growth, hydrocele or infection in the testicles. [10] X Research source A testicular cysts, also called a spermatocele or epididymal cyst, is typically a painless, fluid-filled, noncancerous sac in the scrotum above the testicles. [11] X Research source"
    },
    {
      "title": "Consider getting a second opinion if you are not satisfied with your physician’s diagnosis and treatment.",
      "content": "Consider getting a second opinion if you are not satisfied with your physician’s diagnosis and treatment. Although most epidermoid and pilar cysts do not require treatment from a physician, if you do seek medical advice and are not satisfied with the results seek a second opinion. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Most sebaceous and epidermoid cysts are straightforward, but there are other conditions that may mimic these cysts. In a case study written in the Royal College of Surgeons of England, the authors presented two cases in which melanoma and a deep oral cavity were originally mistaken for a sebaceous cyst. There are a variety of other infectious processes that may be mistaken for a sebaceous cyst, including boils, furuncles and carbuncles. [13] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Treat uninfected epidermoid and sebaceous cysts at home.",
      "content": "Treat uninfected epidermoid and sebaceous cysts at home. Signs of infection include the area becoming swollen, red, tender, or red and warm. If your home treatment for these cysts is not effective or if you experience symptoms, which indicate an infection, you should seek medical care from your physician. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If the cyst causes pain or discomfort with walking or intercourse, medical care is needed to treat the cyst."
    },
    {
      "title": "Use a wet, warm compress over an epidermoid cyst to encourage it to drain and heal.",
      "content": "Use a wet, warm compress over an epidermoid cyst to encourage it to drain and heal. The washcloth should be hot but not so hot that it burns the skin. Place it over the cyst two to three times a day. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Cystic acne responds better to ice than it does to heat. Bartholin gland cysts can be treated at home using warm water sitz baths. This involves sitting in several inches of warm water to encourage the cyst to drain."
    },
    {
      "title": "Refrain from picking, squeezing, or trying to pop either an epidermoid cyst or sebaceous cyst.",
      "content": "Refrain from picking, squeezing, or trying to pop either an epidermoid cyst or sebaceous cyst. This can increase the risk of infection and scarring. Also, never pick, squeeze or attempt to pop a cystic acne. This drives the infection deeper and increases the risk of scar tissue. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Allow an epidermoid cyst to drain naturally.",
      "content": "Allow an epidermoid cyst to drain naturally. Once it begins to drain, cover it with a sterile dressing, which you can change twice a day. [17] X Research source If a large amount of pus begins to drain from the cyst, the skin surrounding the cyst turns red, the area becomes warm and tender, or blood begins to drain from the cyst, it is time to seek medical care. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Keep the area clean.",
      "content": "Keep the area clean. To prevent an infection, keep the cyst and the area surrounding it clean. Wash it daily using an antibacterial soap or cream. [19] X Research source"
    },
    {
      "title": "Know when to call a doctor.",
      "content": "Know when to call a doctor. Most cysts are completely harmless and will go away on their own, while others may require medical attention. Call your doctor if the cyst is painful or swollen, or if the skin around the affected area becomes warm, as these are signs of an infection. [20] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Ask your doctor about removal.",
      "content": "Ask your doctor about removal. If the cyst is interfering with your everyday life, don't attempt to pop it yourself. Talk to your doctor to determine whether it would be safe and advisable to have it surgically removed. [21] X Research source"
    },
    {
      "title": "Evaluate your surgical options.",
      "content": "Evaluate your surgical options. These will vary depending upon the location, the size, and how the cyst may be interfering with bodily functions. There are three options for the removal of cysts in the body. You and your physician should discuss each to determine which is the best option for your circumstances and the type of cyst you have. Incision and drainage (I & D) is a simple procedure where the physician makes a 2-3 mm cut in the cyst and gently expresses the contents of the cyst. This can be done in the office for skin cysts, such as epidermoid and sebaceous cysts and surface pilonidal cysts which are not deep or infected if necessary. I & D can be used for breast cysts, ganglion cysts, testicular or bartholin gland cysts on an outpatient basis using either general or local anesthesia. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source However, there is a higher incidence of recurrence when the cyst wall is not removed. In an incision and drainage the wall cannot be removed. A minimal excision technique will remove the wall of the cyst and the cheesy center material. [23] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source The cyst is opened and drained before the cyst wall is pulled out. Sutures may or may not be necessary, depending upon the size of the incision. This technique will be the treatment of choice for breast cysts, testicular cysts, bartholin gland cysts, and ganglion cysts. Surgical excisions are very rarely done for cystic acne. Surgical excision is generally done under local anesthesia and often as an outpatient procedure, while general anesthesia is used for children. Laser removal is an option for only epidermoid cysts when they are large or are in an area where the skin is thick. It entails opening the cyst with a laser and gently expressing the fluid inside. One month later a minimal incision is made to pull out the cyst wall. This gives good cosmetic results in cases where the cyst is not inflamed or infected. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Determine if removal of a skin cyst is necessary.",
      "content": "Determine if removal of a skin cyst is necessary. There are treatments that can be done at home to encourage drainage and healing of sebaceous and epidermoid cysts. However, it is important to seek medical care if the area appears infected, if the cyst grows rapidly, if the cyst is in a spot that is constantly irritated, or if you are bothered for cosmetic reasons. [25] X Research source"
    },
    {
      "title": "Determine if removal of a cyst on the breast is necessary.",
      "content": "Determine if removal of a cyst on the breast is necessary. No treatment is necessary for a simple fluid filled cyst on the breast. If you haven’t reached menopause, your doctor will ask that you monitor the cyst each month. Your physician may do a fine needle aspiration to drain the cyst. [26] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you notice a cyst through two or three menstrual periods that does not resolve spontaneously, or increases in size, your doctor may order an ultrasound. Your physician may recommend oral contraception to regulate your menstrual cycle hormones. [27] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This treatment is only used in women with severe symptoms. Surgical removal is necessary only when the cysts are uncomfortable, have blood-tinged or green-colored fluid on aspiration, or the physician believes there may be a non-benign growth pattern. In this case the entire cyst will be removed with anesthesia as an incision and drainage technique would leave the capsule and increase the risk the cyst will reappear. [28] X Research source"
    },
    {
      "title": "Consult with a dermatologist for treatment of cystic acne.",
      "content": "Consult with a dermatologist for treatment of cystic acne. They will first prescribe medications used to treat other types of acne. If you do not receive good results, the doctor may recommend the use of isotretinoin or Accutane. [29] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Accutane is an effective medication that helps manage acne. However, may cause serious side effects, such as birth defects, can increase the risk of depression and suicide, and can affect your lipid levels, liver function, blood sugar, and white blood cell count. You will need to have blood tests done once monthly to monitor your response to the medication. [30] X Research source Women must be on two forms of contraception to take Accutane."
    },
    {
      "title": "Seek treatment for a ganglion cyst.",
      "content": "Seek treatment for a ganglion cyst. Treatment for this type of cyst is usually nonsurgical and will include observation. The area can be immobilized if activity increases the size, pressure or pain to the area. [31] X Research source Aspiration of the fluid in the ganglion cyst might be done if it is causing pain or limiting activity. In this procedure the physician takes the fluid out of the cyst with a fine needle, in the office under sterile conditions. If symptoms are not relieved through nonsurgical methods (needle aspiration or immobilization), or the cyst returns after aspiration, your doctor may recommend a surgical excision of the cyst also known as total ganglionectomy. During excision part of the involved tendon or joint capsule will also be removed. There is a small chance that the cyst will return even after complete removal. This is a surgical procedure done under local anesthesia and is often an outpatient procedure."
    },
    {
      "title": "Treat a Bartholin gland cyst.",
      "content": "Treat a Bartholin gland cyst. The type of treatment is dependent upon the size of the cyst, your discomfort, and whether or not it’s infected. Warm sitz baths (sitting in several inches of warm water) several times a day can help the gland to drain on its own. [32] X Research source Surgical incision and drainage will be used if the gland is very large or infected and sitz baths are not effective. Local anesthesia or sedation will be used. A catheter will remain in the gland to keep it open for up to six weeks to allow for complete drainage. [33] X Research source Antibiotics may be prescribed to treat the infection."
    },
    {
      "title": "Understand treatment of a testicular cyst.",
      "content": "Understand treatment of a testicular cyst. First a physician must determine that the growth is non-cancerous. [34] X Research source If the cyst is large enough to trigger a feeling of heaviness or dragging in the testicle, surgical excision will be discussed. [35] X Research source Children’s Hospital of Philadelphia does not initially recommend surgery for their adolescents. Instead, they recommend that the young men learn to do self-examinations and report any changes or increases in size which may indicate the need for surgical treatment. Cysts in children often resolve on their own. Percutaneous sclerotherapy is an option that reduces the risks of surgery to the scrotum and has had good results in research. [36] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Using ultrasound to guide the injection of a sclerosing agent, 84% of the men used in the study were symptom free in six month. The sclerosing agent will reduce the size and symptoms of a testicular cyst. This procedure has significantly less physical risk and less risk of recurrence of the cyst."
    },
    {
      "title": "Understand which cysts are not preventable.",
      "content": "Understand which cysts are not preventable. Pilar cysts develop after puberty and have an autosomal dominant inheritance. This means that they occur in both sexes and if one parent carries the gene for a pilar cyst then it increases the risk that the children will experience these cysts. Seventy percent of people who get them will have multiple cysts over their lifetime. [37] X Research source There is no known cause at this time for cysts that develop in the breast tissue. Doctors do not have a clear answer about the risk factors and prevention for Cystic acne but it is believed to be related to increasing hormonal levels in puberty and pregnancy and deep infections from hair follicles plugged by sebum (oil on the skin). [38] X Research source"
    },
    {
      "title": "Understand which cysts are preventable.",
      "content": "Understand which cysts are preventable. Most cysts are not but some are. For instance, prevention for a pilonidal cyst includes wearing clothing that is not tight, maintaining normal weight limits, and getting up from a seated position every 30 minutes throughout the day. [39] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source According to the American Academy of Dermatology, there is no effective means of preventing an epidermoid cyst from forming. [40] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source However, there are groups of people who appear to be at greater risk for developing them: more men than women, acne sufferers, and people who spend a long time in the sun. [41] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source People who have suffered hand injury are more likely to experience an epidermoid or ganglion cyst on the hand. Bartholin gland cysts can occur after injury to the area at the opening to the vagina."
    },
    {
      "title": "Lower your chances of developing cysts.",
      "content": "Lower your chances of developing cysts. While most cysts are not preventable, you can lower your risks of getting the ones that are. Use oil-free skin products and avoiding excessive sun exposure. Shaving and waxing may also be responsible for cyst formation. Avoid excessive shaving and waxing in areas where you have already gotten cysts to prevent reformation or new cysts."
    }
  ]
}