{
  "url": "https://www.wikihow.com/Stop-Thinking-About-an-Abusive-Ex",
  "title": "How to Stop Thinking About an Abusive Ex",
  "steps": [
    {
      "title": "You’re not alone if you’re struggling to stop thinking about an abusive ex.",
      "content": "You’re not alone if you’re struggling to stop thinking about an abusive ex. Letting go of any relationship makes us experience intense grief—it’s part of being human. But when you make the courageous choice to let go of an abusive ex, you’re working through normal feelings of loss and trying to regain your own identity at the same time. Abusers train you to believe that their perspective and experience matter more than anything else. [2] X Research source It’s only natural that after you leave, you might find it hard to recognize that you matter too. Because your ex was likely controlling and made decisions for you, you might’ve lost confidence in yourself. It’s normal to feel anxious or unsure about being in the driver’s seat of your life again. Think back to who you were and how you felt before the abuse started. That person isn’t gone, and the abuse doesn’t get to define who you are. [3] X Research source"
    },
    {
      "title": "Give yourself time to grieve so you can process what happened.",
      "content": "Give yourself time to grieve so you can process what happened. [4] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. After leaving an abusive partner, it’s normal to first feel denial, and then to feel hurt, ashamed, and afraid. Fortunately, people who’ve been in your shoes can tell you those feelings don’t last forever. Yes, abuse can shake your ability to trust your own feelings, but know that the hurt you feel is valid. It’s not all in your head, and you didn’t deserve the abuse or cause it. [5] X Research source Try journaling to explore your feelings. [6] X Expert Source Samantha Fox, MS, LMFT Marriage & Family Therapist Expert Interview. 19 January 2021. You can try a prompt like, “How am I feeling today?” or “What kind of life do I want to lead?” Let out intense emotions by exercising, crying, and even screaming if it feels right. [7] X Expert Source Samantha Fox, MS, LMFT Marriage & Family Therapist Expert Interview. 19 January 2021. Join a support group or talk to friends and family about how you’re feeling. [8] X Expert Source Samantha Fox, MS, LMFT Marriage & Family Therapist Expert Interview. 19 January 2021."
    },
    {
      "title": "It’s normal to miss your ex, but you made the right choice to leave.",
      "content": "It’s normal to miss your ex, but you made the right choice to leave. When we look back at relationships, we often see them through rose-colored glasses. Try asking yourself, “Was it a good relationship? Or was I just attached to my ex?” [9] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. Then, write out a list of the reasons you left and the goals you have in your future. For instance, did you feel like you were always walking on eggshells around your partner? Did you feel like you couldn’t be yourself? When you catch yourself missing your partner or thinking about going back to them, ask yourself, “How do these thoughts improve my life? Can I see any ways these thoughts might hold me back?” [10] X Research source"
    },
    {
      "title": "Abuse is never your fault.",
      "content": "Abuse is never your fault. Whenever you start to feel guilty, ask yourself if you’d blame a friend or loved one for going through the same things. If you’re having thoughts like “If only I’d been more loving” or “If only I’d done things differently,” know that those thoughts are common but don’t reflect reality. You did nothing wrong—the only person responsible for abuse is the abuser. The next time you start to blame yourself, walk through this series of questions: “What evidence do I have to support this belief?” “What’s the evidence against this belief?” “Does this belief come from someone else or does it come from the facts?” “What’s a different belief that might be more correct?”"
    },
    {
      "title": "Your future is full of hope, and you can train your thoughts to reflect that.",
      "content": "Your future is full of hope, and you can train your thoughts to reflect that. When a negative thought passes through your head, acknowledge it. [11] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. Check whether you’re using any words like “always,” “never,” “should,” or “must,” which can be signs you’re being hard on yourself. Then, try and spin the thought into an encouraging statement. After all, you deserve love and have an incredible life ahead of you. [12] X Research source Spin an intrusive thought like “He was right that I can’t do anything on my own” into an affirmation like “I’m capable of more than I think, even if I still have room to grow.” Try challenging a negative thought with a positive mantra like “I’m a strong, kind person, and I deserve respect.” Focus on what you’ve learned from the past rather than what you’d do differently. For instance, “I won’t let anyone make me feel like I’m not good enough in the future.” Celebrate positive changes you make in your life with statements like, “I made time for myself today and got to do the things I love.”"
    },
    {
      "title": "Stopping contact with an abuser takes away some of their power.",
      "content": "Stopping contact with an abuser takes away some of their power. It’s common for abusers to try and make amends with apologies or gifts, but unless your ex makes a personal commitment to receive treatment and therapy, their behavior likely won’t change. Give yourself space to heal by blocking your ex’s number and unfollowing them on social media. [13] X Research source It might also help to delete old photos of your ex and box up or donate any mementos. If you need to stay in contact with an abusive ex because you co-parent with them, try to have a supportive third-party present (like a close friend) when you meet with your ex. If you and your abusive ex need to work out a parenting plan or custody, you can contact your state’s Family Court Services to get assigned a free mediator. [14] X Research source"
    },
    {
      "title": "You need to feel safe in order to stop thinking about an abusive ex.",
      "content": "You need to feel safe in order to stop thinking about an abusive ex. For both emotional and physical abuse, you can contact your local county courthouse to fill out an application for a restraining order. [15] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source To stay safe at school or work, let a trusted friend, coworker, or supervisor know not to allow your ex into the building. In extreme cases, consider moving to another city for a fresh start. [16] X Research source"
    },
    {
      "title": "You’re not alone, and other people can help lift you up.",
      "content": "You’re not alone, and other people can help lift you up. Abuse can shake your sense of self and your sense of independence, especially if your abuser kept you cut off from other people. By reconnecting with other people in your life, you can start to develop the support system you deserve. When you feel lonely, try calling an old friend or reaching out to someone you’d like to get to know better. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you feel like you don’t have anyone to talk to, you can join a peer-lead online support group for survivors of abuse like https://www.peaceoverviolence.org/counseling ."
    },
    {
      "title": "Developing stability in your life will help you detach from an abusive ex.",
      "content": "Developing stability in your life will help you detach from an abusive ex. After any breakup, it's normal to feel uprooted. Refocusing on taking care of your body and health can give you a sense of control and boost your self-confidence. Start small by getting your sleep schedule on track and working in a bit of exercise. [18] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. Set a consistent time to wake up and go to bed every day and aim to get in 30 minutes of movement every day. [19] X Research source Eat a healthy diet with fresh fruit and vegetables and reduce your intake of processed foods. Try out mindfulness activities like meditation or breathing exercises ."
    },
    {
      "title": "Reconnect with what you love to rebuild your self-esteem.",
      "content": "Reconnect with what you love to rebuild your self-esteem. Are there any old hobbies you used to love? What’s something you’ve always wanted to try? Whether you want to get involved in your community through volunteering or master vegetarian cooking, take a chance to reinvent yourself and explore new opportunities for self-growth. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Not sure where to start? Here are a few ideas: Get active and boost your confidence by learning a new skill like yoga, self-defense, or dancing. Express your emotions and exercise your creativity through photography, painting, and writing."
    },
    {
      "title": "Waiting before you date again can help you form healthier future relationships.",
      "content": "Waiting before you date again can help you form healthier future relationships. It takes time to process heartbreak and abuse, so jumping into a new relationship can make it harder to get closure. [21] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. Sit with however you’re feeling, and use this time to identify what you need in a future relationship and partner. [22] X Research source Learn about the signs of a healthy relationship , which include respect, trust, honesty, and empathy. Trust your gut when it comes to dating someone new. You shouldn’t ever feel uncomfortable or pressured in a good relationship."
    },
    {
      "title": "A mental health professional can help you recover from abuse and trauma.",
      "content": "A mental health professional can help you recover from abuse and trauma. It’s okay to reach out for extra support, and there are people out there who can and want to help you. You can talk to your primary care physician to get a referral to a therapist or check out an online counseling service like BetterHelp or Talkspace. Most therapists or counselors should let you book a free consultation so you can make sure you feel safe and comfortable talking to them. [23] X Expert Source Ken Breniman, LCSW, C-IAYT Licensed Clinical Social Worker & Certified Yoga Therapist Expert Interview. 24 April 2020. If you can’t afford therapy, visit https://www.thehotline.org/get-help/domestic-violence-local-resources/ to find local resources and organizations."
    }
  ]
}