{
  "url": "https://www.wikihow.com/Start-a-Jellyfish-Tank",
  "title": "How to Start a Jellyfish Tank",
  "steps": [
    {
      "title": "Look for a small to medium sized aquarium tank.",
      "content": "Look for a small to medium sized aquarium tank. You can house your jellyfish in an aquarium tank that is clean and sterile. You may decide to have only one to three small jellyfish in a small tank that you can fit on your desk at work or at home. Or, you may go for a medium sized aquarium tank that can fit a larger number of jellyfish. Look for a tank that is circular in shape or tall and narrow. A tank that is circular, with a flat base, is ideal as the shape can allow your jellyfish to float in the tank water. This is essential for the health and happiness of your jellyfish."
    },
    {
      "title": "Buy a jellyfish tank kit.",
      "content": "Buy a jellyfish tank kit. The other option is to buy a tank kit that is made specifically to house jellyfish. These tanks come in a small size, which is usually circular in shape to house one to three small jellyfish. You can also get tall, narrow tanks for a larger number of jellyfish. You can purchase jellyfish tank kits online or at your local pet store. [1] X Research source Keep in mind jellyfish tank kits are not cheap, ranging from $350 - $600. You may want to try using an aquarium tank instead to save money on your set up. [2] X Research source"
    },
    {
      "title": "Get the other necessary supplies.",
      "content": "Get the other necessary supplies. Most jellyfish tank kits come with the supplies necessary for setting up the tank. If you are using a fish aquarium to house your jellyfish, you will need to purchase several other supplies, including: An air pump An undergravel filter plate An air tube Airline tubing Substrate for the bottom of the tank, such as glass beads An LED light An LED remote control (optional)"
    },
    {
      "title": "Find a flat, raised spot that does not get direct sunlight.",
      "content": "Find a flat, raised spot that does not get direct sunlight. Jellyfish do well in dark environments. Make sure you place the tank on a flat, raised spot in your home or office that does not get direct sunlight and is not near any heat sources or electrical equipment. [3] X Research source A low table in your home in a dark spot or the top of a desk would work. You could also get a small raised wooden stand for your home or office and place the tank on top of that."
    },
    {
      "title": "Set up the filter plate and air tube.",
      "content": "Set up the filter plate and air tube. Connect the filter plates together and place the air tube in the center of the filter plates. Depending on which filter plates you buy, they may come in several small parts or one to two larger parts. You want the air tube to be in the middle of the tank so it can circulate air throughout the tank. You may need to trim off one side of one of the plates to make it fit with the rest of the plates. You can do this using scissors or an X-ACTO knife. Place the filter plate and the air tube in the tank. The plates should cover the bottom of the tank and fit snugly when you slide it into the tank."
    },
    {
      "title": "Put in the substrate.",
      "content": "Put in the substrate. Substrate is going to help to hide the filter plates in the tank. You should use glass beads, rather than sand or gravel. Gravel can be a hazard for your jellyfish. Place the beads into the tank by hand so they do not break or nick the tank. Look for glass beads at your local dollar store or online. Glass beads that are the size of jelly beans are ideal substrate for your tank. You should fill the tank with at least one layer of substrate, or 2 inches of glass beads for a medium sized tank."
    },
    {
      "title": "Connect the air tube to the air pump.",
      "content": "Connect the air tube to the air pump. Once the substrate is in the tank, you can connect the air tube to the air pump. Do this by using the airline tubing. Place the airline tubing into the air tube so it is dangling a few inches into the tube. Then, connect the airline tubing to the air pump. This will allow you to cycle through air into the tank using the air pump."
    },
    {
      "title": "Add salt water to the tank.",
      "content": "Add salt water to the tank. Jellyfish are salt water animals so you will need to use salt water only in the tank. You can make your own salt water using marine salt or buy pre-mixed salt water at your local pet store. Do not use sea salt or salt for consumption! [4] X Research source To make salt water for your tank, you can use aquarium salt or ionic salt. You should dissolve the salt crystals in reverse-osmosis filtered water or distilled water, making sure there are no big chunks of salt in the water. Do not use tap water as it contains elements that could be harmful for your jellyfish. Once you add the salt water, smooth over the glass beads with your hand so they are even at the bottom of the tank."
    },
    {
      "title": "Plug in the air pump and the LED light.",
      "content": "Plug in the air pump and the LED light. Once you do this, you should let the tank run for at least 12 hours. During this time, the water should turn from cloudy to clear. [5] X Research source Some jellyfish tank owners will add in the jellyfish to the tank right away and then do daily water changes. The water changes help to control the ammonia levels down in the tank. However, letting the tank cycle through before adding the jellyfish will ensure your new pets stay healthy in their tank."
    },
    {
      "title": "Test the ammonia, nitrite, and nitrate levels.",
      "content": "Test the ammonia, nitrite, and nitrate levels. You can get test kits for aquariums that will allow you to test the tank water for these elements. You should do this once the tank water has cycled through and appears clear in the tank. The test should show a built up of ammonia, followed by a rise in nitrite as the ammonia level goes down. Nitrate will then start to appear as the nitrite level falls. Ideally, you should have ammonia and nitrate at 0.0ppm in the tank. You may have lower nitrate levels, at around 20ppm. Once these substances are at these levels, you are clear to add jellyfish into your tank."
    },
    {
      "title": "Buy jellyfish from a reliable pet supply store.",
      "content": "Buy jellyfish from a reliable pet supply store. You should search for online pet supply stores that specialize in jellyfish and offer a money back guarantee. Most jellyfish supply stores offer moon jellyfish or blue blubber jellyfish, though you can find other varieties for your tank. The jellyfish will be shipped to you alive in plastic bags. Alternatively, you can buy jellyfish in person at a pet supply store. Talk to a sales associate to ensure they are knowledgeable about the jellyfish they are selling. You want to buy jellyfish that are floating and moving in a tank already, with bright, healthy looking tentacles. Often, pet supply stores will have a specialty area for jellyfish and other sea animals. A species of jellyfish called moon jellyfish do best in home aquariums. Moon jellyfish are seasonal animals and usually live between 6 to 12 months. [6] X Research source"
    },
    {
      "title": "Look for jellyfish that are around the same diameter and size.",
      "content": "Look for jellyfish that are around the same diameter and size. Your jellyfish tank is a closed system, so you do not want to crowd the tank with too many jellyfish or jellyfish that are various sizes. The larger jellyfish will end up outgrowing the smaller jellies and over power them. The smaller jellies will then shrink in size and not fare as well as the bigger jellies. [7] X Research source You should also only buy one species of jellyfish for your tank. For example, you may decide to have only moon jellyfish in your tank or only blue blubber jellyfish in your tank. Most jellyfish species do better with the same species in one tank."
    },
    {
      "title": "Acclimate your jellyfish to your tank slowly.",
      "content": "Acclimate your jellyfish to your tank slowly. Your jellyfish will come in clear plastic bags. You should start by making sure the tank has been cycled completely and has healthy nitrate levels. You will then need about 15-30 minutes per bag of jellyfish to acclimate your new pets to their tank. [8] X Expert Source Craig Morton Fish & Aquarium Specialist Expert Interview. 21 July 2020. Place the sealed bag of jellies on the surface of your tank for 10 minutes. This will help bring the water in the bag to the same temperature as the tank water. After 10 minutes, open the bag and remove half of the water with a clean cup. Then, add tank water to the bag, making sure the amount of tank water is equal to the bag water you removed. After another 10 minutes, you can slowly release your jelly into your tank. Use an aquarium net to gently release them. Do not pour them out into the tank as this can shock them."
    },
    {
      "title": "Check that your jellyfish are pulsing and moving in the tank.",
      "content": "Check that your jellyfish are pulsing and moving in the tank. It may take your jellyfish a few hours to acclimate to their new home. Once they are comfortable, they will pulse and move in the tank, usually about three to four times every minute. [9] X Research source You should observe your jellyfish over the next few days to ensure they appear to be moving and pulsing comfortably in your tank. If your jellyfish appears to have turned inside, a process known as eversion, your water temperature may be off. Jellyfish should be kept in water temperatures of 24 degrees Celsius to 28 degrees Celsius. You may need to adjust your water temperature and test your water again to ensure it has the proper ammonia, nitrite, and nitrate levels. [10] X Research source"
    },
    {
      "title": "Feed the jellyfish live or frozen baby brine shrimp twice a day.",
      "content": "Feed the jellyfish live or frozen baby brine shrimp twice a day. You can get live or frozen baby brine shrimp at your local pet store or online. You should feed your jellies twice a day, once in the morning and once at night. [11] X Research source Live shrimp brine will keep in the refrigerator for up to two weeks. You can feed the jellyfish through a small opening in the tank to prevent getting stung by their tentacles. The jellyfish should catch and ingest the food on their own. Do not overfeed your jellies, as this could compromise the water quality in the tank. If you have smaller and bigger jellyfish in the tank, you may not be able to encourage the smaller ones to grow and stay healthy by overfeeding them, anyway."
    },
    {
      "title": "Do a weekly 10% water change.",
      "content": "Do a weekly 10% water change. To maintain healthy water quality in your tank, you should do a 10% water change once a week. This means that you will change out 10% of the water and replace it with new salt water. Remember to test the water quality after each water change. The salinity level should be 34-55 ppt, which is closest to natural seawater. You should also confirm the ammonia, nitrite, and nitrate levels are correct in the tank."
    },
    {
      "title": "Remove jellyfish that become too big for the tank.",
      "content": "Remove jellyfish that become too big for the tank. With the right care, your jellyfish should grow to a healthy size. You can prevent overcrowding by only having a few jellyfish in your tank at a time. If your jellyfish appear to outgrow your tank or if you feel your tank is overcrowded, you may need to remove one of your jellyfish. To do this, do not release the jellyfish into the wild via the ocean or a body of water. It is illegal to do this and puts the jellyfish’s life at risk. [12] X Research source Instead, you should contact the seller you bought the jellyfish from to then arrange for a new home or caretaker for the jellyfish."
    }
  ]
}