{
  "url": "https://www.wikihow.com/Tell-if-Yogurt-Is-Bad",
  "title": "How Can I Tell If My Yogurt Is Bad? 7 Signs & What to Do If You Eat It",
  "steps": [
    {
      "title": "There’s a lot of water on the surface.",
      "content": "There’s a lot of water on the surface. It’s normal for the whey to separate a little, so if you see a thin layer of liquid on top, it’s probably fine—just stir the liquid in (or pour it out) before you eat the yogurt. If there’s a puddle or a thick layer of liquid, it’s more likely that your yogurt is bad. [1] X Research source Don’t toss it just yet—check for other signs of spoilage first. It doesn’t matter what kind of yogurt you’re eating—regular, nonfat, or Greek. The signs of spoilage are the same. [2] X Research source"
    },
    {
      "title": "The texture is lumpy instead of smooth.",
      "content": "The texture is lumpy instead of smooth. Stir the yogurt with a spoon and check out the texture. If you notice lumps or chunks, or if the texture seems gelatinous and the yogurt is hard to stir, it’s past its prime and starting to go bad. [3] X Research source"
    },
    {
      "title": "The yogurt smells sour, weird, or gross.",
      "content": "The yogurt smells sour, weird, or gross. Put your nose close to the yogurt and breathe in slowly. Good yogurt will smell fresh, or barely have a smell at all. Spoiled yogurt will smell sour, rancid, yeasty, or just plain wrong. [4] X Research source Maybe you aren’t sure if the yogurt smells weird or not. If you see other signs of spoilage, throw it out."
    },
    {
      "title": "There’s mold or discoloration on the surface.",
      "content": "There’s mold or discoloration on the surface. This may seem like a no-brainer, but take a closer look anyway—sometimes moldy spots are really small! If you see any pink, gray, or fuzzy-looking patches on your yogurt, throw it out. You definitely don't want to eat mold—it can make you sick. [5] X Research source"
    },
    {
      "title": "It has a sour, stale, or unusual taste.",
      "content": "It has a sour, stale, or unusual taste. We don’t recommend taste-testing it, but what if you accidentally ate a spoonful before noticing something was off? Or maybe it looked and smelled it okay, so you went for it. The flavor will give it away immediately—spoiled yogurt will taste sour and unpleasant. [6] X Trustworthy Source US Department of Agriculture U.S. agency responsible for promoting good agricultural practices and protecting consumers Go to source Eating a spoonful is unlikely to make you sick, so don’t worry if you accidentally ate a little bit."
    },
    {
      "title": "The container looks bloated or swollen.",
      "content": "The container looks bloated or swollen. If the plastic container looks warped, the yogurt may have been exposed to heat or humidity—so it’s almost certainly bad. If the airtight seal is broken, definitely toss the yogurt out—it could be contaminated. [7] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source"
    },
    {
      "title": "The yogurt has been sitting out for more than 2 hours.",
      "content": "The yogurt has been sitting out for more than 2 hours. Maybe you accidentally left your groceries sitting on the counter—it happens! If it's been 2 hours or less, just stick the yogurt in the fridge immediately. Sitting out at room temperature may have shortened its shelf life, though, so eat it sooner rather than later. [8] X Research source It's difficult to know just how much shorter the shelf life will be if you leave yogurt out at room temperature, so be sure to evaluate it for signs of spoilage before you dig in. That said, the warmer the temperature, the faster it will spoil. For example, if you left yogurt out in the heat (90 °F (32 °C) and up) for more than an hour, throw it away."
    },
    {
      "title": "Opened yogurt will stay good in the fridge for 7 days.",
      "content": "Opened yogurt will stay good in the fridge for 7 days. Be sure to store opened yogurt in a sealed or airtight container to keep out moisture and contaminants. Avoid eating yogurt that's been open for more than a week—the taste goes downhill fast and bacteria can grow quickly. Even if the yogurt looks and smells fine, just toss it. Better to be safe than sorry! [9] X Research source"
    },
    {
      "title": "Greek yogurt usually lasts 1-2 weeks if properly stored in the fridge.",
      "content": "Greek yogurt usually lasts 1-2 weeks if properly stored in the fridge. Typically, the storage rules, shelf life, and signs of spoilage are the same for regular and Greek yogurt. According to the USDA, all types of yogurt will stay fresh for 1-2 weeks as long as it's stored in the refrigerator at 40 °F (4 °C). [10] X Research source Greek yogurt is just regular yogurt with the whey removed, which results in a thicker consistency. Strained yogurt was popularized by a Greek brand, but it didn't actually originate in Greece. [11] X Research source"
    },
    {
      "title": "Eat unopened yogurt within 15 days of the date on the container.",
      "content": "Eat unopened yogurt within 15 days of the date on the container. The date printed on the container is usually a \"sell by\" or \"use by\" date (rather than an expiration date). That's the date when the quality of the yogurt begins to deteriorate. As long as the yogurt looks and smells normal, it’s safe to consume. [12] X Research source Always store yogurt in the refrigerator at 40 °F (4 °C) to prevent spoilage. You can also freeze yogurt for 1-2 months, although the texture may change. [13] X Research source"
    },
    {
      "title": "You may experience symptoms of food poisoning if you eat spoiled yogurt.",
      "content": "You may experience symptoms of food poisoning if you eat spoiled yogurt. Mild symptoms include stomach cramps, nausea, and vomiting. Typically, if you're going to develop symptoms at all (some people don't), they'll begin within a few hours of eating the spoiled food. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source How sick you get depends on the type of bacteria you consumed, how much you ate, and whether you’re immuno-compromised or not. Symptoms may last for a few hours to a couple of days. You don't need to seek medical attention for mild symptoms. To recover quickly , be sure to rest and stay hydrated . Seek medical attention if you experience severe symptoms like: Bloody vomit or stools Extreme abdominal pain Diarrhea that lasts longer than 3 days Severe weakness, dizziness, or lightheadedness Blurry vision or muscle weakness"
    }
  ]
}