{
  "url": "https://www.wikihow.com/Stay-in-Shape",
  "title": "How to Stay in Shape",
  "steps": [
    {
      "title": "Aim for 150 minutes of moderate cardio per week.",
      "content": "Aim for 150 minutes of moderate cardio per week. To stay healthy and fit, try to spend at least 150 minutes a week doing something that gets your heart pumping, whether it’s jogging, biking, swimming, or dancing. That means working out for at least 30 minutes a day, 5 days a week. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If that sounds overwhelming, remember that it’s totally okay to work up to this level of exercise at your own pace. If you’re pressed for time or prefer a more challenging workout, go for at least 75 minutes of high-intensity exercise per day instead. At a moderate level of intensity, you should be able to talk easily, but not sing. At high intensity, you’ll be breathing hard enough that saying more than a few words is difficult. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Do strength training at least 2 times a week.",
      "content": "Do strength training at least 2 times a week. Strength training is any exercise that focuses on toning or building your muscles. Aim to work your muscles at least twice a week, and switch between muscle groups with every workout. Do a single set of 12-15 reps of each exercise (that is, repeat the same exercise 12-15 times in a row, then briefly rest before moving on to something else). [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If that sounds like a lot, don’t worry! Start slow and work up to more repetitions over time. If you’re lifting weights or using an exercise machine, use enough weight so that your muscles start to feel tired after a single set. However, don’t use so much that you’re in pain or struggling to do even 1 or 2 repetitions. In addition to lifting weights, you can also use resistance bands or your own body weight to build strength. Some good body weight exercises include pushups, planks, burpees, lunges, and squats. [4] X Research source Always give your muscles a chance to rest between strength training workouts. For example, you could work your legs and core one day, then focus on your chest and arms the next time you work out."
    },
    {
      "title": "Switch between different exercises to maximize your benefits.",
      "content": "Switch between different exercises to maximize your benefits. Doing the same workout all the time can get boring. Plus, it puts you at greater risk of developing overuse injuries and muscle imbalances. To get the most out of your exercise routine, alternate between different types of exercise every day, or even within a single workout! [5] X Research source For example, you might jog one day, then go biking or rowing the next. Try to target different muscle groups with each workout. Or, start your workout with 10 minutes of jumping rope, then hop on a stationary bike for 10 minutes, and finish up with a 10-minute walk on the treadmill."
    },
    {
      "title": "Start slowly if you’re not used to exercising.",
      "content": "Start slowly if you’re not used to exercising. If you’re not already in great shape, doing a lot of exercise can seem daunting. But don’t sweat it—there’s no need to sign up for a marathon if you’re not ready! Take it easy on yourself and start out slow, then gradually work up to longer or more intense workouts. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For example, you might start by taking a 10-minute walk at an easy pace once a day, then gradually work your way up to a daily 30-minute jog. As your fitness level increases, you can start challenging yourself more. For instance, if lifting a 20 lb (9.1 kg) dumbbell starts to feel easy, try adding 5 pounds (2.3 kg)."
    },
    {
      "title": "Take care not to overdo the exercise.",
      "content": "Take care not to overdo the exercise. Want to do more than 150 minutes a week? Go for it! Just make sure you don’t overdo it, since too much exercise can wear you out and make you prone to injuries. Give it a rest if you find yourself frequently feeling exhausted, unusually sore, irritable, depressed, or weak after exercise. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Exercising too much can put you at risk of hurting yourself. Always stop exercising if you’re feeling pain, since powering through the pain could make things worse."
    },
    {
      "title": "Ask your doctor if you’re not sure how to work out safely.",
      "content": "Ask your doctor if you’re not sure how to work out safely. If you’ve been injured or have a chronic health issue, staying in shape can be a challenge. Fortunately, there are still things you can do to keep active and improve your strength and stamina. Talk to your doctor about designing a workout plan that’s safe, effective, and realistic for you. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For instance, if you have trouble with your joints, your doctor might recommend a low-impact form of cardio, such as water aerobics. Your doctor may refer you to a physical therapist or a personal trainer who has experience working with injuries or your specific health condition. If you have an injury, a physical therapist can work with you on rebuilding strength and range of motion in the injured area. They can also recommend alternative workouts you can do while your injury is healing."
    },
    {
      "title": "Make exercise a social activity to keep it fun.",
      "content": "Make exercise a social activity to keep it fun. If you’re not the type who enjoys exercise for its own sake, getting a workout buddy can make a world of difference! Ask around among your friends, family, classmates, or coworkers to see if anyone is interested in exercising with you. Not only will it make your workouts more fun, but you can also cheer each other on and hold each other accountable. [9] X Research source Look for someone at a similar fitness level, whose goals are similar to yours. That way, nobody will get left in the dust or feel like they’re being held back. Get creative and look for things you both enjoy. For example, you might sign up for a martial arts class, play squash, or go on nature walks together once a week."
    },
    {
      "title": "Find excuses to walk throughout the day.",
      "content": "Find excuses to walk throughout the day. It may not seem as flashy as rowing or hitting the elliptical, but plain old walking is a very beneficial exercise that can help you stay in shape, feel more energetic, and get healthy. Not all exercise has to involve aching muscles and lots of sweat! Look for ways to fit walking into your basic daily activities. [10] X Expert Source Julian Arana, M.S.eD., NCSF-CPT Certified Personal Trainer Expert Interview. 19 March 2020. For example: Next time you go to the store, park at the far end of the lot. That way, you’ll have to put in some extra walking on the way to and from your car. If you have a choice between hopping on an elevator or taking the stairs, choose the stairs. When you’re at school or work, volunteer to do tasks that involve walking. For example, you might offer to make a run to the bank or carry some paperwork to the front office. Or, if you’re on a break, take the opportunity to just walk around or even do some pushups!"
    },
    {
      "title": "Set specific goals for your fitness journey.",
      "content": "Set specific goals for your fitness journey. Goals can help you stay focused when you’re trying to stay in shape. Before you start working out, ask yourself what your goals are. Make your goals specific, realistic, and immediate, since setting goals that are too vague, big, or long-term can set you up for frustration. [11] X Research source For example, instead of setting a goal like “I’m going to get fit this summer,” aim for something more short-term and specific, such as, “I’m going to work up to walking 2 miles a day by the end of this month.” Don’t forget to reward yourself when you meet a goal! This could be something as simple as eating a favorite snack or putting a gold star sticker next to your goal in a fitness planner."
    },
    {
      "title": "Split up your exercise time if your schedule is busy.",
      "content": "Split up your exercise time if your schedule is busy. Don’t have time to do cardio for 30 minutes straight? Don’t worry. You can still get the same benefits from doing 3 separate 10-minute workouts throughout the day—plus, you’ll be more likely to stick to your workout routine if you can make it fit your schedule! [12] X Research source Split up your time getting active in whatever way works best for you. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For instance, you might do a quick 15-minute jog first thing in the morning, and another one during your lunch break. If your schedule is really packed, you could even do a series of 5-minute mini-workouts throughout the day."
    },
    {
      "title": "Work up a sweat doing daily chores.",
      "content": "Work up a sweat doing daily chores. If you feel like you don’t have time to both exercise and get all your housework done, you’re in luck! A lot of work you can do around the house and yard every day is actually pretty strenuous. If you’re having trouble finding time for a workout, kill two birds with one stone by knocking out a few physically demanding tasks, such as: [14] X Research source Vacuuming. Get the most out of it by doing lunges while you push the vacuum around. Picking up clutter. Combine it with squats to get an extra workout for your legs and core! Scrubbing surfaces like windows, counters, or even the floor. Pulling weeds. Mowing the lawn with a push mower. Shoveling snow."
    },
    {
      "title": "Eat a healthy, balanced diet to maximize your workout benefits.",
      "content": "Eat a healthy, balanced diet to maximize your workout benefits. To stay at your fittest and healthiest, combine regular physical activity with a balanced, nutritious diet. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Eat a diet rich in fruits and vegetables, whole grains, lean proteins (such chicken breast, tofu, or beans), and healthy sources of fat (such as fatty fish, avocado, olive oil, and nuts and seeds). [16] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Not only will eating healthy help you maintain a healthy weight, but it can also help protect you from health problems such as diabetes, heart disease, and even some types of cancer. [17] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Your dietary needs may vary depending on factors like your age, fitness goals, and overall health. Talk to your doctor or a dietitian about what—and how much—you should be eating."
    },
    {
      "title": "Keep junk food to a minimum.",
      "content": "Keep junk food to a minimum. Aim for the majority of the foods you eat to be high in nutritional value. It's totally fine to eat things like junk food, salty snacks, and baked goods sometimes, but those things shouldn't be the focus of your meals. They don't have a lot of nutritional value and you probably won't feel your best if you eat them a lot. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Try not too eat too many foods that are high in added sugar, refined carbs (like white bread or potatoes), or salt. Avoid eating lots of ultra-fatty or greasy, overly processed foods, like hot dogs, pizza, and fast-food hamburgers."
    },
    {
      "title": "Drink plenty of water throughout the day to stay hydrated.",
      "content": "Drink plenty of water throughout the day to stay hydrated. Getting enough fluids is a crucial part of staying healthy and fit, and it’s even more important when you’re breaking a sweat! Throughout the day, drink enough water so that your urine looks pale yellow and clear. If it looks dark, that means you’re dehydrated. [19] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Your hydration needs during exercise may vary, but in general: [20] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Aim to drink 17–20 fluid ounces (500–590 mL) of water 2-3 hours before you work out, and 8 fluid ounces (240 mL) within 20-30 minutes of when you start exercising. During exercise, drink 7–10 fluid ounces (210–300 mL) of water for every 10-20 minutes of exercise. Don’t wait until you feel thirsty, since this means you’re already dehydrated! If you’re exercising for more than an hour, sip a sports drink. Drink 8 fluid ounces (240 mL) of water within 30 minutes after you finish exercising."
    },
    {
      "title": "Get 7-9 hours of sleep to help you stay energized.",
      "content": "Get 7-9 hours of sleep to help you stay energized. Getting exercise can help you sleep better. In turn, getting enough sleep boosts your energy levels and helps your body recover after a big workout! [21] X Research source Plan to go to bed early enough so you can get at least 7-9 hours of sleep a night (or 8-10 if you’re a teen). [22] X Research source Since exercise can energize you, aim to do any intense exercise at least 3 hours before bedtime. If you have trouble falling asleep, make sure you turn off all bright screens at least half an hour before you go to bed. Unwind with some relaxing activities, like a bit of light stretching, a few minutes of meditation, or a warm shower."
    },
    {
      "title": "Drink alcohol only in moderation to avoid losing muscle mass.",
      "content": "Drink alcohol only in moderation to avoid losing muscle mass. It’s totally okay to have a glass of wine now and then, but drinking too much alcohol can do a number on your body. To avoid putting on extra weight, weakening your muscles, and damaging your liver, keep any drinking in the light to moderate zone. That means no more than 1 drink per day if you’re biologically female, or 2 drinks per day if you’re biologically male. [23] X Research source The National Institute on Alcohol Abuse and Alcoholism in the U.S. defines 1 drink as 12 fluid ounces (350 mL) of beer, 5 fluid ounces (150 mL) of wine, or 1.5 fluid ounces (44 mL) of distilled spirits. If you’re dependent on alcohol or worried that you might be drinking too much, reach out to your doctor. They can help you cut back or quit safely."
    },
    {
      "title": "Steer clear of cigarettes and tobacco to avoid damaging your body.",
      "content": "Steer clear of cigarettes and tobacco to avoid damaging your body. You probably already know that smoking is terrible for your lungs, but it can also harm your body in a huge variety of other ways. In fact, it can reduce your muscle mass and sap your strength, making it much harder to keep in shape! [24] X Research source If you smoke, make a plan to quit for the sake of your health. It can be extremely difficult to quit smoking. If you’re struggling, reach out to your doctor for help. They can recommend effective quitting strategies or even prescribe medications that can help."
    },
    {
      "title": "Keep sitting to a minimum.",
      "content": "Keep sitting to a minimum. Whether you’re working a desk job, driving for long hours, or just unwinding in front of the TV, it’s easy to spend way too much time sitting around. Unfortunately, spending many hours a day sitting can put you at risk of developing health problems, so look for excuses to get up and move as often as possible—even if it’s just a 5-minute walk around the room every hour or so. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Even if you can’t (or don’t want to) go anywhere, try to stand up whenever you can. For instance, you might try using a standing desk at work, have breakfast standing at your kitchen counter, or stand up and stretch your legs while you watch TV."
    }
  ]
}