{
  "url": "https://www.wikihow.com/Win-a-Street-Fight",
  "title": "How to Win a Street Fight",
  "steps": [
    {
      "title": "Stand with your feet apart and knees slightly bent.",
      "content": "Stand with your feet apart and knees slightly bent. Stand with one leg slightly behind you and one leg in front with your knees slightly bent. From here, you can easily wind up for a punch or crouch to defend yourself. [1] X Research source A fighting stance is much safer than just standing with your feet hip-width apart. When you stand normally, you have much less range and mobility than if you take a fighting stance."
    },
    {
      "title": "Keep 1 hand up to protect your face.",
      "content": "Keep 1 hand up to protect your face. When most people pick a fight with a stranger on the street, they’re going to aim for the face when they punch. Throughout the fight, no matter what you’re doing, keep your non-dominant hand up near your face to protect your head. Bend your arm to create a triangle with your elbow to protect your throat as well. [2] X Research source If your attacker is punching you, you can use both hands to protect your face. However, usually you want to keep 1 hand free so you can punch back."
    },
    {
      "title": "Stand an arm’s length away from your attacker.",
      "content": "Stand an arm’s length away from your attacker. The closer you stand to your opponent, the more opportunities they have to hit you. If someone comes at you, try to stay away from them, at least an arm’s length away, so they have a harder time reaching you. [3] X Research source Be aware of your surroundings, too. If you get backed into a corner and you can’t escape or move backwards, it’s very likely that your opponent will win this fight."
    },
    {
      "title": "Use your free hand to swing a punch.",
      "content": "Use your free hand to swing a punch . To disable your opponent , keep 1 hand up by your face to protect yourself. With your free hand, swing a wide punch toward your opponent, aiming for wherever you can hit them. Keep in mind that they will most likely still be punching at you, so keep your defenses up the entire time. [4] X Research source As you punch, keep your hand in a tight fist with your thumb on the outside of your fingers. That way, you’ll hit your opponent with your knuckles without hurting your fingers too much."
    },
    {
      "title": "Aim for soft spots on your opponent’s body.",
      "content": "Aim for soft spots on your opponent’s body. The eyes, groin, solar plexus, and throat are all ideal spots to punch your attacker. [5] X Expert Source Adrian Tandez Self Defense Trainer Expert Interview. 24 July 2019. These spots are soft, so they won’t hurt your hand, but they’re super painful when hit, and may disable whoever you’re fighting. [6] X Research source Stay away from any hard areas on your opponent’s body, like their skull or their jaw. These likely won’t hurt your opponent enough to stop them, and they could hurt your hand pretty badly."
    },
    {
      "title": "Kick at their knees and shins to make them collapse.",
      "content": "Kick at their knees and shins to make them collapse. If you can’t land a solid punch to your opponent’s upper body, move onto their lower body. Aim your foot at their knees or their shins to distract them and make them fall down. [7] X Research source Even kicking your opponent’s groin is acceptable in a street fight. The goal is to get away as fast as possible, and a swift kick to the groin can stop someone in their tracks. You can disable your opponent even faster by punching their upper body, then quickly kicking at their lower body. It’s pretty hard to defend your entire body at once, and they may not have enough time to recover to defend themselves properly."
    },
    {
      "title": "Twist their arm if they grab you.",
      "content": "Twist their arm if they grab you. If your opponent steps forward to grab your shirt or your neck, switch strategies. Grab their hand and quickly twist their arm downwards to make them lean over. Then you can let go and run away. [8] X Research source"
    },
    {
      "title": "Run away once your opponent is immobile.",
      "content": "Run away once your opponent is immobile. “Winning” a street fight is all about getting away from your attacker as quickly as possible. Once your opponent is no longer actively attacking you, it’s time to get out of there. Sprint away from the fight as quickly as you can, and head toward a populated area with other people around. [9] X Research source If your attacker starts following you, yell for help and call the authorities as fast as you can."
    },
    {
      "title": "Apologize if the person feels slighted by you.",
      "content": "Apologize if the person feels slighted by you. Maybe you accidentally bumped into someone at the bar, or maybe you spilled your drink on someone’s shirt. If a person is getting aggressive with you because they think you insulted them, just say you’re sorry and quickly walk away. [10] X Research source “Hey, sorry about that. I really didn’t mean to. Can I grab you some napkins?”"
    },
    {
      "title": "Defuse the situation with a compliment.",
      "content": "Defuse the situation with a compliment. A quick way to get out of a fight is to pay someone a compliment. If someone’s getting super angry or mad at you, tell them something you like about them. Make sure you sound sincere so they don’t think you’re being sarcastic or trying to rile them up. [11] X Research source For instance, you might say, “Hey man, we’re cool. By the way, I like that shirt you’ve got on. Where’d you get it?” If you go this route, watch your tone so that the other person doesn’t think you’re making fun of them. Stay lighthearted and sincere without laughing or smiling."
    },
    {
      "title": "Yell for help from others.",
      "content": "Yell for help from others. Other people can help protect you from an aggressive attacker. If the person is still coming at you and they aren’t backing down, it’s time to yell for help. Call out for other people, either strangers or your friends, to come help you out. [12] X Research source Fighting a stranger shouldn’t be taken lightly. You never know if a stranger has a weapon on them, and you could get seriously hurt during a fight."
    },
    {
      "title": "Walk away from the fight",
      "content": "Walk away from the fight if you can. The best way to avoid an angry person is to get out of their sight. Head as far away as you possibly can, and get around a large group of people. The faster you can leave the situation, the safer you’ll be. [13] X Research source Never head to a secluded area without other people around. If your attacker is persistent, they may follow you."
    }
  ]
}