{
  "url": "https://www.wikihow.com/Use-a-Glycolic-Acid-Peel",
  "title": "How to Use a Glycolic Acid Peel",
  "steps": [
    {
      "title": "Schedule some downtime.",
      "content": "Schedule some downtime. This is especially important if you’ve never done a peel before. Your skin might be red and sensitive after the peel, so plan to do it when you have a few days when you don't have to go to work or any social functions. For example, you could plan on applying the peel to your skin on a Friday afternoon after you get home from work. This gives your skin the rest of the night Friday and all day Saturday and Sunday to heal."
    },
    {
      "title": "Stop using prescription products on your skin.",
      "content": "Stop using prescription products on your skin. If you use prescription anti-acne products on your skin, stop using them two to three days before you plan to do your peel. The chemicals in those medications can make your skin hypersensitive. If you're not sure if you should stop using your anti-acne products, check the ingredients list. If the list includes ingredients like benzoyl peroxide, retinoids, or salicylic acid, discontinue using that medicine two to three days before you plan on doing your peel. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Use a soap-free cleanser.",
      "content": "Use a soap-free cleanser. A soap-free cleanser won’t include sodium lauryl sulfate in it. Look for a cleanser with cocamidopropyl betaine in it instead. It's a natural cleanser made from coconuts. Use this cleanser like you would normally, one to two days before you plan on doing your peel. If you have very sensitive skin, you can use micellar water alone in place of your regular soap-based cleansers. [2] X Research source You can also use oil-based cleansers—just make sure you rinse really well!"
    },
    {
      "title": "Gather your post-peel care products.",
      "content": "Gather your post-peel care products. Once you apply the peel, you won’t have much time to gather the stuff you need for post-peel care. Make sure you have it all together, near where you'll be applying the peel. You'll need a mild cleanser (you can use your soap-free substitute), a cloth dipped in cold water, aloe vera, or cooling masks, and a light moisturizer and sunscreen."
    },
    {
      "title": "Purchase your peel from a reputable source.",
      "content": "Purchase your peel from a reputable source. Because glycolic acid is, well, an acid, you want to be really careful about where you purchase it from. You can often get glycolic acid peels from a dermatologist’s office, or you can ask for a full kit from beauty stores. If you've never applied an acid peel before it's probably best to ask a dermatologist for the peel. They can also give you some tips for applying it."
    },
    {
      "title": "Apply a prep solution.",
      "content": "Apply a prep solution. Prep solutions usually come with a peel kit, but you can also make your own. Witch hazel or diluted rubbing alcohol work just as well as what comes in a kit to prepare your skin. Pour the solution you're using on a cotton ball and swab your entire face. You might need to use more than one cotton ball to cover your face completely, and that's okay. It's better to over-prepare your skin than under prepare it."
    },
    {
      "title": "Let your skin dry.",
      "content": "Let your skin dry. Your skin should be completely dry from the prep solution before you apply the peel. Regardless of what type of prep solution you use, you should let your face dry for at least ten minutes. Once your skin is dry, you can apply petroleum jelly to the sensitive areas of your face – around your eyes, the corners of your lips and your nostrils – to protect sensitive skin from the acid."
    },
    {
      "title": "Use a fan brush to apply the peel.",
      "content": "Use a fan brush to apply the peel. This brush should be clean and should not have any makeup on it. It’s probably best to keep a brush reserved just for applying peels. Drop a few drops of the acid on the brush and then brush it all over your face. [3] X Research source You might need to reload the brush one or two times in order to get the glycolic acid over your whole face. Avoid really sensitive areas of your face like your nostrils, the corners of your lips, and the thin skin around your eyes."
    },
    {
      "title": "Leave the acid on for one minute.",
      "content": "Leave the acid on for one minute. Don’t go longer than a minute, especially if you’ve never done a peel before, since the acid can damage to your skin. Your skin might tingle a little bit while the peel is on your face. That’s normal, but if your skin starts to burn, remove the acid immediately by rinsing your face with clear water."
    },
    {
      "title": "Use a neutralizing solution.",
      "content": "Use a neutralizing solution. This prevents the acid from continuing to work into your skin after the minute is up. Peel kits often include a neutralizing solution. You can also use a regular cleanser or plain water to neutralize and remove the acid. Splash the neutralizing solution your face and then rinse it off. Try not to rub the solution in, as this may be irritating."
    },
    {
      "title": "Use a cooling product.",
      "content": "Use a cooling product. Glycolic acid can cause your skin to feel a bit like you've been sunburned. You can get some relief by using a cooling product like aloe vera or even just a cold cloth. Spread the aloe vera over the areas of your face that feel uncomfortable, or lay a cold cloth over your whole face."
    },
    {
      "title": "Apply a moisturizer.",
      "content": "Apply a moisturizer. Glycolic acid can cause your skin to dry out, and you don't want that! Using a moisturizer can put some moisture back in your skin. It can also help prevent peeling. Feel free to spread the moisturizer you've chosen over your whole face - you can't over-moisturize! If your skin does start to peel, don’t peel the dead skin off. Put more moisturizer on the flaky areas and let it heal on its own. Pulling the dead skin off can cause serious damage to your skin."
    },
    {
      "title": "Stay out of the sun.",
      "content": "Stay out of the sun. For a few days after your peel, you should stay out of direct sunlight, since your skin will be very sensitive. If you have to go into the sun, use a very strong SPF – at least a 30 – on your face. [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Using protective hats and clothing can also protect your skin, as well as staying out of the most intense rays between 10:00 AM-2:00 PM."
    }
  ]
}