{
  "url": "https://www.wikihow.com/Tell-if-a-Guy-Is-Interested-in-You-or-Just-Being-Friendly",
  "title": "Flirty or Just Nice? 15+ Ways to Tell if a Guy Is Interested in You or Just Being Friendly",
  "steps": [
    {
      "title": "Some of these signals are really obvious, so this is a good place to start.",
      "content": "Some of these signals are really obvious, so this is a good place to start. There are a few dead giveaways that indicate he’s interested. If he holds a hug for a super long time or he “accidentally” brushes your shoulder or touches you, he’s probably into you . If he’s just being friendly, he may smile and make eye contact, but he won’t go out of his way to touch you. [1] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. The classic “brush your hair away with his finger” move is common in movies, but it rarely comes up in real life. If he pulls this one, he’s almost 100% romantically interested."
    },
    {
      "title": "If he often steals glances from across the room, he may like you.",
      "content": "If he often steals glances from across the room, he may like you. A friendly guy will definitely make eye contact during conversation—it’s only the polite thing to do, after all—but if he looks at you randomly from afar, he’s interested. If you ever catch him trying to sneak a peek at a part of your body other than your eyes while you do talk, he’s definitely interested. The next time you’re around him, track where his eyes go! [2] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. His eyes may even dilate a bit when he looks at you. This is a common response to looking at someone you find attractive! [3] X Research source"
    },
    {
      "title": "Bring up an obscure interest of yours and see how he acts.",
      "content": "Bring up an obscure interest of yours and see how he acts. If he isn’t romantically interested in you, he won’t reflect your excitement. If he is, he’ll ask a bunch of questions or say “That’s always something I’ve been interested in!” Playing along and expressing interest in something he doesn’t actually enjoy is a sign that he’d do anything if it means he gets to be around you, which points towards romantic interest! [4] X Research source It’s got to be an interest most people don’t have, though. If you say “I love travelling,” the odds are very high that it’s actually something he’s fond of. Bring up an obscure movie you love, or a hobby that’s unique to you. For example, you might say something like, “You ever see Sabrina ? It’s an old Humphrey Bogart film. I rewatched it the other day—it’s so good!” If he says, “No, I really don’t enjoy old movies,” he probably isn’t into you. If he says, “No, but I’d love to see it sometime!” he’s definitely in. You could also say, “I cannot wait for the weekend. I haven’t been able to go out dancing in a while.” If he says “Oh, I suck at dancing,” it’s a sign he’s probably just a friendly guy. If he goes, “I’ve got two left feet, but that does sound fun!” he might be into you."
    },
    {
      "title": "If he invites you over and his friends are there, he’s just a social guy.",
      "content": "If he invites you over and his friends are there, he’s just a social guy. However, if he invites you to meet him at the local bar and he’s all alone, it’s a pretty big sign he’s got the hots for you. Friendly people go out of their way to invite as many people as they can to events or hangout sessions, while a guy with a crush will do whatever he can to get to know you one-on-one. [5] X Research source If you’re hanging out talking to people at a social event and he tries to pull you aside to talk to you separately, that could be a big sign he’s interested. If he looks a little bummed out or he changes his behavior when your one-on-one conversations get interrupted, that could be another signal he has got feelings for you."
    },
    {
      "title": "If he’s nicer to you than he is to everyone else, he’s into you.",
      "content": "If he’s nicer to you than he is to everyone else, he’s into you. A friendly fella is going to go out of his way to be friendly with everyone. They might slap everyone’s back when they congratulate them, or throw hugs and smiles around like they’re trying to campaign for president. But if it feels like he’s especially kind or sweet with you, it might be a sign that he’s got deeper, stronger feelings for you. [6] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. If he lights up with a smile when you walk in the room but he doesn’t greet his friends the same way, it’s a huge giveaway he likes you."
    },
    {
      "title": "Try making a bit of a raunchy or sexy “joke” to see what he does.",
      "content": "Try making a bit of a raunchy or sexy “joke” to see what he does. If he doesn’t play along with it, he’s probably not all that interested. Just play it off like you were joking and didn’t mean it if he gets weird about it. If he does lean into it though, it’s a huge indication that he’s got a thing for you. Be careful, though; if you don’t know him really well or you work together or something, this can really backfire. [7] X Research source For example, you could joke about him being your “history class husband.” If he leans into it and jokes back about how you’re his “history class wife/husband” too, he’s probably into you. You could say something like, “Wow, you’ve got this real Chris Pratt cool hot guy thing going on today! I’d pick you up at the bar no question!” If he chuckles and goes, “I’d enjoy that. We could go on a Guardians of the Galaxy adventure together,” you’re in. If he says, “Oh, thanks! Anyways…” he’s just a nice guy."
    },
    {
      "title": "If he brings up a partner or spouse, he’s signaling he’s off limits.",
      "content": "If he brings up a partner or spouse, he’s signaling he’s off limits. Constantly mentioning how he doesn’t have anything going on romantically though, he’s probably dropping the hint that he’s available and open to going out. Pay attention whenever he drops some background info about his love life to learn more! [8] X Research source If he ever brings up an interest in another guy or girl who isn’t you, it’s probably not going happen. Guys will avoid mentioning other crushes if they’re into you like that."
    },
    {
      "title": "If you like this guy and he asks if you’re single, it’s a big sign.",
      "content": "If you like this guy and he asks if you’re single, it’s a big sign. Men will rarely go out of their way to pry into someone’s love life unless they’ve got a vested interest in it. [9] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. In fact, if he’s just a friendly guy, he would probably go out of his way to avoid this topic, since it might cross an imagined social boundary. If he asks, “So, you seeing anyone?” it’s a massive sign he’s interested . [10] X Research source The one exception here is if you were already casually talking about someone else’s love life, or there’s some sort of reasonable trigger for the conversation and it’s natural for him to ask. In these rare situations, it may not mean that much."
    },
    {
      "title": "If your knees touch on accident, does he pull away or stay there?",
      "content": "If your knees touch on accident, does he pull away or stay there? If you brush against him in a hallway or something and he leans away from you, the odds are he’s just exceptionally friendly. However, if he smiles or blushes when you brush against him—or even better, he touches you back—go ahead and call it. He’s into you. [11] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. A friendly guy might even apologize if you touch him and he’s not interested."
    },
    {
      "title": "Tell him you like his hair and watch how he responds.",
      "content": "Tell him you like his hair and watch how he responds. If he starts talking about how great his stylist is or how he just learned a new brushing technique, he may be nice but he’s probably uninterested. But if he blushes, smiles, and says something like, “Aw thanks, I really appreciate that. Your hair looks lovely today as well,” then he’s likely got a romantic interest in you. [12] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. Try to pick something physical to compliment him on. While it’s generally safer to stick to non-physical compliments, you kind of want to see his reaction here. Don’t say, “I like your tie,” say something like, “That tie really brings out your eyes. They’re so seductive!”"
    },
    {
      "title": "Guys tend to try hard to be cool when they’re into someone.",
      "content": "Guys tend to try hard to be cool when they’re into someone. He might be braggadocious to the point of parody, or get flustered and start making bad jokes. He might stumble, or stutter. He could even try to impress you by doing something really dumb, like showing you how far he can throw a football, or how he can backflip into a pool. If you pay close attention, he may even try to pump out his chest and tuck his tummy in when you’re around. [13] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. All of this goofy nonsense is just a sweet guy trying to amaze you. [14] X Research source If he’s only doing this kind of stuff in front of you and he seems like a pretty tame, normal guy everywhere else, it’s another signal he’s interested. Constant fidgeting with his hair or clothes could also mean he wants to look good for you."
    },
    {
      "title": "This one little phrase is actually a huge giveaway he likes you.",
      "content": "This one little phrase is actually a huge giveaway he likes you. A friendly guy might say “it’s good to see you,” but “missing” is romantic. This is one of those subtle tip-offs that a lot of people don’t pick up on. If you see this guy regularly, pay attention to what he says the next time there’s a large gap between seeing one another. [15] X Research source A lot of guys get skittish about saying so-called “cute” things like, “I miss you.” If he isn’t a particularly open guy but he still throws out an “I miss you,” you can call it right there—he’s super interested. Did he hit you with “I’m happy to see you!” or, “Hey! It’s you!” If so, he’s probably just really friendly."
    },
    {
      "title": "If he seems to remember things you do or say, that’s more than being nice.",
      "content": "If he seems to remember things you do or say, that’s more than being nice. It’s true that friendly people will try to remember names, hobbies, and fun facts about people they interact with, but if he seems to remember your best friend’s name or he recalls that you really love Katy Perry—it could be a sign he’s into you. [16] X Research source This is especially true if he seems to recall things specific to your tastes that have nothing to do with him, like your favorite ice cream flavor, or the name of the perfume you wear."
    },
    {
      "title": "Seeking your approval is a huge sign he likes you.",
      "content": "Seeking your approval is a huge sign he likes you. If he turns to look at you after he tells a joke in front of other people, it’s a sign that he really cares if you personally found it funny. If he solicits your advice, asks what you think, or tracks your reactions, it usually means that he really wants to know how you feel about him! [17] X Research source A friendly guy may not necessarily care about how you feel about things they do or say. Being friendly doesn’t automatically mean they’re interested in your opinion. A question like, “Think I got an A on that presentation?” may not mean much, but asking, “How did I look up there?” is a little bit of a sign."
    },
    {
      "title": "A fella with a crush will go out of their way to defend you.",
      "content": "A fella with a crush will go out of their way to defend you. If someone pushes against something you say or disagrees with you, a guy who likes you is going to come to your defense—even if he doesn’t necessarily think you’re right. If you know he’s not really a fan of rock music, but someone else mentions how they hate your favorite band and he steps up to defend them, he’s probably into you. [18] X Research source If he like you, he may even try to “protect” you. For example, if you’re out for drinks with friends, he may position himself in between you and other guys. [19] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. A friendly guy is very likely to stand up for you if you’re being straight up bullied, but during a disagreement, they won’t automatically take your side."
    },
    {
      "title": "If you still can’t tell, ask a mutual friend if he talks about you.",
      "content": "If you still can’t tell, ask a mutual friend if he talks about you. This is a huge giveaway a lot of the time since a lot of guys can’t help but talk about people they’re crushing on. Pull a close friend aside and just casually ask them, “Hey, does he ever talk about me when I’m not around?” If he does bring you up often, it’s a super promising sign he’s interested. [20] X Expert Source John Keegan Dating Coach Expert Interview. 10 June 2021. If you’re worried about how this will look, you can always play it off like you’re worried he’s gossiping about you or something like that. Make sure that you’re asking a trustworthy friend who won’t go spilling the beans if you’re worried about him finding out. Reader Poll: We asked 1601 wikiHow readers who they go to when they need advice, and 61% said that they reach out to their best friend. [Take Poll] So your bestie may be able to help you understand if this guy likes you!"
    }
  ]
}