{
  "url": "https://www.wikihow.com/Make-Molasses",
  "title": "How to Make Molasses",
  "steps": [
    {
      "title": "Prepare the beets.",
      "content": "Prepare the beets. You should use at least eight pounds of sugar beets if you want at least one cup of molasses. Take a sharp knife and cut the top off of the beets. You can discard the leafy bits, or save them for later to eat as a green. Next, wash the beets under warm, running water. Use a vegetable or clean, plastic scrubber to make sure that all of the dirt is removed. [2] X Research source Store the leafy greens in a sealed container in the refrigerator if you plan on eating them later."
    },
    {
      "title": "Cut your clean beets into thin slices.",
      "content": "Cut your clean beets into thin slices. Use a sharp knife to cut the sugar beats into thin slices. Any sharp knife, like a chef's knife or serrated knife will do. If you have a food processor, you can use that to shred them instead. [3] X Research source Make sure to cut the beets on a cutting board, or you risk cutting into the counter or table top."
    },
    {
      "title": "Cook the beets.",
      "content": "Cook the beets. Put the sliced beets into a saucepan and cover them with water. Turn the heat to medium and cook the beets until tender. You can poke them with a fork to make sure they are tender enough. You should stir the beets about every five minutes to prevent them from sticking to the pan. [4] X Research source You should use a large or medium saucepan."
    },
    {
      "title": "Separate the water from the beets.",
      "content": "Separate the water from the beets. Once your beets are tender, pour them through a colander. You should have a container, like a large bowl, underneath to hold the beet water. You can use the sugar beets however you want after you separate them from the water. You can use them in a recipe immediately after, or you can store them in the refrigerator to be used later. [5] X Research source You should store the beets in an airtight container. Try to use them as soon as possible."
    },
    {
      "title": "Boil the water.",
      "content": "Boil the water. Pour the beet water in a medium saucepan and bring it to a boil. You should boil it until the beet water turns into a thick syrup. Once it has turned into a syrup, turn the heat off and allow the molasses to cool. [6] X Research source Allow the molasses to cool for at least thirty minutes. Use a spoon to check the consistency of the syrup."
    },
    {
      "title": "Store the molasses.",
      "content": "Store the molasses. Once it has cooled, put the molasses into an airtight container. Store the container in a place that maintains a room temperature. It should last for up to 18 months. Once the container is opened, you can store it in the refrigerator, but it often grows thick and harder to pour once refrigerated. As it ages, the top layer will begin to crystallize and become what is known as beet sugar. You will need to remove this top layer. [7] X Research source You can crush the beet sugar and store it in another air tight container for use. Write the date that the molasses was prepared on the container it is stored in. The molasses has gone bad if it becomes moldy or fermented."
    },
    {
      "title": "Choose sorghum or sugarcane.",
      "content": "Choose sorghum or sugarcane. Sugarcane is the most common source of molasses, but sorghum can be used as well. Sorghum is often used as an alternative to sugarcane since sugarcane only grows in tropical and sub-tropical location. Sorghum grows in a temperate climate and is often more accessible than sugarcane. Sorghum canes are typically harvested in late fall, like late September or early October, before the first frost hits. You can tell the canes are ready for harvesting when the cluster of seeds at the top of the canes have turned yellow or brown. Sugarcane is ready to be harvested when leaves have dried up and become yellow or brown. The plant core structure should be weak. [8] X Research source"
    },
    {
      "title": "Purchase or prepare the cane.",
      "content": "Purchase or prepare the cane. If you do not purchase prepared sorghum or sugarcane, you will need to prepare it from harvest. First, strip all of the leaves from the cane with a sharp knife or by hand. Then, cut the seeds off with a sharp knife or machete. Next, cut the stalk as close to the ground as possible. Leave the stalks up against a rack for a week and then run them through a mill. Keep a container under the mill to collect the liquid. It is better to purchase if you do not have access to a harvest or mill. You will probably have to cut the stalks about five or six inches from the ground to avoid soil contamination. The debris, stalk, and pulp can be composted or kept to be used for other process later on."
    },
    {
      "title": "Strain the juice.",
      "content": "Strain the juice. Take the liquid that you have collected in a container and strain it through a cheese cloth or fine sack. This will remove any large particles. Once the juice has been strained, pour it into a large boiler pan. The size of the pot depends on how much juice you have. Typically, the pot should be at least 6 inches deep."
    },
    {
      "title": "Place the pot over a heat source.",
      "content": "Place the pot over a heat source. Put the pot over a stove top or other heat source. Bring it to a boil. Once it is boiling, bring the heat to a low and constant temperature that is just high enough for a steady boil. Allow the juice to boil for six hours. Skim off any green substance that forms at the top of the molasses. Stir regularly during the six hours to prevent sugar from sticking to the bottom of the pot. Skim the green substance off with a large spoon of molasses strainer."
    },
    {
      "title": "Turn the heat off.",
      "content": "Turn the heat off. You can turn off the heat when the molasses has turned from green to yellow, or when it gets thick and small strands appear as you stir. Turn the heat off and remove the pot from the heat source. At this point, you can allow it cool and boil it again two or three more times for thicker, darker molasses. Light molasses is made from the first boil. It is thinner and sweeter than molasses that has been boiled two or three times. [9] X Research source Dark molasses is the product of the second boil. It is darker, thicker, less sweet, and stronger in flavor than light molasses. Blackstrap molasses is the product of the third and final boil. It is the thickest, darkest, and least sweet type of molasses."
    },
    {
      "title": "Bottle the molasses.",
      "content": "Bottle the molasses. Once you are satisfied with the color and consistency, pour the molasses into a container while it is hot. It is easier to handle while it is hot. Make sure to use an airtight container. If using glass, heat it before pouring hot molasses into it or the glass may crack. Store in a room temperature (or colder) area for up to 18 months. The top layer will crystallize and turn into sugar after a while. You will to remove this top layer. You can crush it and store it in another container."
    },
    {
      "title": "Choose pomegranates or pomegranate juice.",
      "content": "Choose pomegranates or pomegranate juice. Molasses can be made by starting with pomegranate fruit, or by starting with pomegranate juice. It is easier to start with pomegranate juice because you will need to take apart and juice the fruit anyway. Either way, you will end up with the same result. [10] X Research source Any type of pomegranate juice will do. Just make sure it is actually made from pomegranates, instead of artificial flavoring."
    },
    {
      "title": "Take apart the pomegranates.",
      "content": "Take apart the pomegranates . You will need 6-7 pomegranates. If you are starting with the actual fruit, you will need to take it apart in order to juice it. First, find the crown of the pomegranate. Then, take a paring knife and make a circular incision into the crown. Score the pomegranate. Next, tear the pomegranate into sections. Remove the arils (seed pods) by prying them loose. Once you have opened it, you should be removing the arils over a medium-sized bowl filled with water. Repeat this step for each of the 6-7 pomegranates. [11] X Research source Put a newspaper or paper towels underneath the pomegranate while you are opening it."
    },
    {
      "title": "Make pomegranate juice.",
      "content": "Make pomegranate juice. You do not need to worry about this step if you are starting with pomegranate juice. At this point, most of the seeds should be floating in water in your bowl. Remove membrane from the bowl and drain the water. Then, pour the arils into a high-speed blender and blend it until it looks like a smoothie. Next, strain the juice through a fine-mesh strainer. Pour the juice in a container. [12] X Research source You should have enough for 4 cups of juice."
    },
    {
      "title": "Create a mixture.",
      "content": "Create a mixture. Add lemon and sugar to the juice to create a mixture. You will need ½ cup, or 100 grams (3.5 oz), of sugar and ¼ cup (50ml) of lemon juice, which is equal to about one medium-sized lemon. Stir the mixture thoroughly. [13] X Research source Adding sugar and lemon keeps the molasses fresher for longer, as well as making the molasses have a sweet and tart flavor. [14] X Research source"
    },
    {
      "title": "Pour the mixture into a saucepan.",
      "content": "Pour the mixture into a saucepan. Put the saucepan onto stove on medium-high heat. Bring it to a boil. Reduce the heat to medium-low when the juice begins to boil. The mixture should be bubbling slightly at this point. Allow it to simmer for one hour. [15] X Research source Stir the mixture occasionally during the hour it is simmering. Stirring it prevents the sugar from sticking to the bottom of the saucepan."
    },
    {
      "title": "Check on the mixture after an hour.",
      "content": "Check on the mixture after an hour. Most of the liquids should have burned off at this point. It's okay if the mixture is still slightly runny because it will thicken once it cools down. Remove the saucepan from the heat. Allow it to cool. [16] X Research source Allow the mixture at least 30 minutes to cool. Check on it every so often to see if it has cooled down."
    },
    {
      "title": "Store the molasses.",
      "content": "Store the molasses. Pour the molasses into a jar. Make sure it is a jar that can be sealed tightly. Store the jar in the refrigerator. The molasses should last for up to fix months. [17] X Research source Pomegranate molasses is great as salad dresses, in sauces, as a meat marinade, and as a topping on desserts. [18] X Research source"
    }
  ]
}