{
  "url": "https://www.wikihow.com/Harmonize",
  "title": "How to Harmonize",
  "steps": [
    {
      "title": "Sing a C major triad to get a feel for intervals.",
      "content": "Sing a C major triad to get a feel for intervals. A triad is a chord created by 3 notes; the C major chord is made of the notes C-E-G. Sing or hum along as you play the notes on a piano (or a virtual keyboard app) one at a time. Then play all 3 notes on the piano at the same time, and notice how the notes blend and agree with each other. [1] X Research source The root note in this chord is C, and the distances between C and the other notes in the chord are called intervals. Different intervals create harmonies with distinct tones. In relation to C, E is a major third and G is a perfect fifth. These intervals blend well with the root note, creating a pleasing harmony."
    },
    {
      "title": "Practice finding a root note’s major third.",
      "content": "Practice finding a root note’s major third. Find the C key on your keyboard. If you count the 4 black and white keys to the right, you’ll land on E. For any root note, a note that’s 4 half-steps away will always be a major third. On a piano, a half-step is the distance between 2 keys that are right next to each other. For a white key that's next to a black key, the black key counts as a half-step and the next white key over is a full step. However, white keys like E and F, which aren't separated by a black key, are a half-step apart. Sing or hum along as you play root notes and major thirds on the keyboard. Play a note, then count 4 half-steps and play that note. Singing a root note and its major third will help you learn how to find a good harmony note by ear any time you hear a melody."
    },
    {
      "title": "Move onto minor intervals after getting a feel for major chords.",
      "content": "Move onto minor intervals after getting a feel for major chords. Instead of playing C-E-G, play C-E♭-G (E♭ is the black key to the left of E) to create a C minor chord. Sing or hum along as you play each note one at a time, then play all 3 notes together. Note how a minor interval sounds darker or more unstable than a major chord. Count 3 half-steps to find a root note’s minor third. Sing or hum along as you play a root note and its minor third. While there are countless exceptions, in Western music, composers often use minor thirds to evoke sadness and major chords to convey happiness. Understanding major and minor thirds is key, whether you want to write harmonies or sing a harmony by ear when you hear a tune."
    },
    {
      "title": "Try holding and moving the harmony note as the melody note changes.",
      "content": "Try holding and moving the harmony note as the melody note changes. As the notes in a melody change, you don’t necessarily have to move the harmony note with it. Try keeping the harmony note the same as you play a melody on the keyboard. Pay attention to how the note combinations blend, convey feelings, or clash with each other. For instance, the harmony note doesn’t need to change with the melody to maintain a major third interval. It may stay the same until the melody moves to a note that clashes with it. Experiment with note combinations to get a feel for coming up with your own harmonies. If notes clash or sound bad together, try moving the harmony note the same number of steps as the melody."
    },
    {
      "title": "Continue practicing with a piano.",
      "content": "Continue practicing with a piano. From kids’ tunes like “Row, Row, Row Your Boat” to contemporary pop hits, play basic melodies on the piano and practice singing along. To focus on hitting the right notes, hum or sing “La” instead of singing a song’s lyrics. [2] X Research source A piano or virtual keyboard app can help you visualize the relationships between notes, which is the foundation of harmonizing."
    },
    {
      "title": "Listen closely for harmonies in your favorite songs.",
      "content": "Listen closely for harmonies in your favorite songs. Now that you know more about creating harmonies, listen closely to your favorite songs. See if you can identify relationships between melodies and harmonies. As you listen, ask yourself what kind of intervals a harmony employs, if it blends seamlessly with the melody, and if there are dissonant, or tense, note combinations. As you listen to a song, work on memorizing the harmony. To make things easier, look online for harmony-only tracks of the song."
    },
    {
      "title": "Practice with a sing-a-long harmony app.",
      "content": "Practice with a sing-a-long harmony app. Useful apps include Sing Harmonies and Harmony Voices. Download an app, learn a song’s harmony, then practice singing your part as you play the melody. When you first practice singing the harmony, lower the volume of the melody so you won’t get drawn away from your part."
    },
    {
      "title": "Harmonize with recordings of yourself singing melodies.",
      "content": "Harmonize with recordings of yourself singing melodies. Record a track of yourself singing a melody, then play it while you sing the harmony. Gradually increase the volume of the recording each time you practice. This will help you learn how to stay on your part without getting distracted by other singers. Additionally, note any rough spots when you listen to recordings of yourself singing. If necessary, spend extra time practicing those sections of the song to improve your pitch and timing."
    },
    {
      "title": "Practice singing chords with 1 to 2 partners.",
      "content": "Practice singing chords with 1 to 2 partners. Using a piano or virtual keyboard app as a guide, start by practicing a simple C major chord. For the note C, sing “one;” sing “three” for E and “five” for G. Sing “one” together at C, then have one person sing “three” at E while the other 2 hold the C. Then, have someone sing “five” at G while the other 2 hold a C and E, respectively. After practicing C-E-G, try other combinations, such as G-B-D and F-A-C. If you’re practicing with 1 other person, just work on 2-part harmonies."
    },
    {
      "title": "Learn your part",
      "content": "Learn your part perfectly to avoid getting distracted by other singers. It’s easy to get distracted by other singers when you’re harmonizing. The key to sticking to the harmony is to learn your part inside and out. Work measure by measure to commit each of your part’s notes to memory. [4] X Research source If you’re in a choir, don’t rely on others in your section (such as other altos or baritones) to stay on track. Additionally, don’t assume that you’ll always be surrounded by other members of your section when you perform. If you have trouble sticking to your part, practice singing with a recording of the melody. Play it softly at first, then gradually increase the volume. [5] X Research source"
    },
    {
      "title": "Join a choir to put your harmonizing skills to the test.",
      "content": "Join a choir to put your harmonizing skills to the test. The best way to learn how to harmonize is to sing with others in a group. Look for a choir or chorus group at your school or place of worship, or look online for one in your community. [6] X Research source If you’re a soprano and want to harmonize better, try to join a choir as an alto. Sopranos usually sing the melody, while alto, tenor, and baritone sections sing harmonies."
    },
    {
      "title": "Take lessons from a voice teacher.",
      "content": "Take lessons from a voice teacher . While apps and other resources can be super helpful, nothing beats working one-on-one with an experienced voice teacher. In addition to harmonizing, a voice teacher can help you with other singing techniques, such as breath control and vocal health. [7] X Research source Additionally, consider taking classes in music theory to learn more about how harmonizing works."
    }
  ]
}