{
  "url": "https://www.wikihow.com/Italian-Slang",
  "title": "70+ Italian and Italian-American Slang Words and Phrases",
  "steps": [
    {
      "title": "Alzare il gomito",
      "content": "Alzare il gomito (ahl-zah-reh eel goh-mee-toh) The literal meaning of this phrase is \"bend the elbow.\" But it's also used as slang to refer to someone who's been drinking too much alcohol . [1] X Research source If you bend your elbow and raise your arm to pantomime drinking, you'll understand how this phrase took on that meaning."
    },
    {
      "title": "Amore a prima vista",
      "content": "Amore a prima vista (ah-moh-reh a pree-mah vee-stah) This phrase means love at first sight . [2] X Research source In a slang context, used as an exclamation toward something you like. For example, when the server brings out your pizza, you might proclaim \"Amore a prima vista!\""
    },
    {
      "title": "Avere culo",
      "content": "Avere culo (ah-veh-reh coo-loh) The verb phrase literally means \"to have ass,\" but Italians use it to mean that someone is lucky . It's typically used to describe someone who has a knack for lucking out whenever they get into a tight situation."
    },
    {
      "title": "Avere la mani in pasta",
      "content": "Avere la mani in pasta (ah-veh-reh lah mah-nee een pah-stah) The verb phrase literally means \"to have the hands in the pasta.\" Italians use it to refer to the person in charge —and also, slangily, to refer to the person who only thinks they're in charge. [3] X Research source"
    },
    {
      "title": "Avere la testa tra le nuvole",
      "content": "Avere la testa tra le nuvole (ah-veh-reh lah teh-strah leh noo-voh-leh) The verb phrase literally means \"to have the head in the clouds.\" Just like the similar phrase in English, Italians use this phrase to talk about someone who is daydreaming , off in lala land, or lost in their thoughts."
    },
    {
      "title": "A fagiolo",
      "content": "A fagiolo (ah fah-joh-loh) \"Fagiolo\" is the Italian word for a single kidney bean. But when Italians say \"A fagiolo!\" they are rejoicing the fact that something has come at just the right time . You can also use this sarcastically if someone is late, similarly to how you might say \"right on time\" sarcastically in English"
    },
    {
      "title": "Avoglia",
      "content": "Avoglia (ah-voh-lya) Means something similar to \"Absolutely!\" Essentially, it's an emphatic and enthusiastic way to say yes . It can also be used to mean \"of course.\""
    },
    {
      "title": "Bada bing",
      "content": "Bada bing (bah-dah beeng) Perhaps \"bada bing\" isn't real Italian, but it's Italian-American, and it's associated with Italians. It means that something you're talking about is going to be simple or easy, or happen in an almost automatic or effortless way. [4] X Research source \"Bada bing\" can also be expanded (presumably for more emphasis) by adding \"bada bang,\" \"bada bong,\" \"bada bing,\" \"bada boom,\" or any combination thereof."
    },
    {
      "title": "Basta",
      "content": "Basta (bah-stah) It means enough , and it's one of the most well-known Italian slang words out there. Even better, it's extremely simple to add into your everyday speech—just use it any time you would ordinarily say \"cut it out\" or \"that's enough\" or \"stop.\""
    },
    {
      "title": "Bella lì",
      "content": "Bella lì (bell-lah lee) Literally \"beautiful there,\" it's an interjection used similarly to the way you would say sweet or awesome in English. Just a phrase to talk about something you think is cool."
    },
    {
      "title": "Bella storia",
      "content": "Bella storia (bell-lah stoh-ryah) Literally \"beautiful story.\" Italians use this phrase similarly to the way you might say good job or way to go in English."
    },
    {
      "title": "Boh",
      "content": "Boh (boh) Americans have \"meh\" and Italians have \"boh.\" It sort of means I don't know and it also sort of means I don't care . It's definitely a word you'll use a lot if you're an easygoing person. [5] X Research source You can also use it to show indifference about something that happened, similar to how you might say \"no worries\" in English."
    },
    {
      "title": "Bon/va bon",
      "content": "Bon/va bon (bohn/vah bohn) \"Bon\" is a word that means \"good\" in French, so this literally means \"good,\" or \"going good.\". It's not Italian, but the Italians have borrowed it and are using it here in a more casual way, similar to how you'd say ok or sure in English."
    },
    {
      "title": "Bordello",
      "content": "Bordello (bohr-dell-oh) It literally means \"brothel,\" but in Italian slang it can describe any place that's extremely messy or chaotic . If your mother ever described your room as a pig's sty, she might've called it a bordello if she was Italian. [6] X Research source"
    },
    {
      "title": "Capisce",
      "content": "Capisce (kah-peesh) This question is typically used at the end of a sentence to ask if you understand what the person is saying. Due to its frequent use in Italian-American mafia movies, this is a word that's pretty well known. [7] X Research source The slang comes from the Italian verb capisci , which means \"to understand.\" [8] X Research source"
    },
    {
      "title": "Cavolo/col cavolo",
      "content": "Cavolo/col cavolo (kah-voh-loh/cohl kah-voh-loh) Literally \"cabbage\" and \"with cabbage,\" but it's unlikely that cabbage has anything to do with what was said. This phrase is typically used the way you might say \" crap \" or \"no way\" in English."
    },
    {
      "title": "Cazzeggiare",
      "content": "Cazzeggiare (kats-eh-jah-reh) Vulgar. Be careful who you use this one around. It means roughly to screw around , but more emphatic—similar to \"effing around.\""
    },
    {
      "title": "Cazzo",
      "content": "Cazzo (kats-oh) Vulgar. As you can probably guess from the way this word starts, it's essentially like using the f-word in English."
    },
    {
      "title": "Che casino",
      "content": "Che casino (keh kah-see-noh) The word casino in Italian means the same thing it means in English, but in Italian slang, it is also used to mean a mess . You might say \"che casino\" if you were looking at a pile of unsorted bills and receipts."
    },
    {
      "title": "Che cosa",
      "content": "Che cosa (keh koh-sah) Literally means \"what thing.\" Italians typically use it to talk about someone who pretty clearly doesn't know what they're doing or doesn't understand something."
    },
    {
      "title": "Che culo",
      "content": "Che culo (keh koo-loh) Literally \"what ass.\" In Italian slang, though, this phrase means what luck! Use it when you want to talk about someone who was very lucky, or a situation that's fortuitous. Avere culo refers more to a character trait (as in a lucky person ), while che culo refers to a single instance of luck."
    },
    {
      "title": "Che figata",
      "content": "Che figata (keh fee-gah-tah) This phrase means how cool , and is used as an interjection when you're excited about something."
    },
    {
      "title": "Che palle",
      "content": "Che palle (keh pahl-leh) This phrase means what a drag and is used as an interjection when you're dreading something."
    },
    {
      "title": "Che schifo",
      "content": "Che schifo (keh shee-foh) This phrase means how disgusting or \"how gross.\" In English, you might also say, \"ewww.\" Use it when you're talking about anything that slightly turns your stomach—edible or not. [9] X Research source"
    },
    {
      "title": "Che si dice",
      "content": "Che si dice (keh see dee-cheh) Literally \"what they say,\" this phrase is used in Italian slang similarly to what's up in English. It's a super-casual greeting, so be careful about who you say it to."
    },
    {
      "title": "Che top",
      "content": "Che top (keh tohp) Literally \"what a top.\" Use this Italian slang when you would normally say super or awesome in English. It's a pretty easy term to just slide into your everyday speech."
    },
    {
      "title": "Chooch",
      "content": "Chooch (chooch) This one's Italian-American, and if you've ever watched Jersey Shore , you might've heard it. It's basically the same as calling someone an idiot or a moron , derived from the Italian word for a baby's pacifier, ciuccio . [10] X Research source"
    },
    {
      "title": "Coatto",
      "content": "Coatto (koh-ah-toh) This word describes someone who's a little rough around the edges . Someone who's on the fringe, has bad manners, and might be a little loud or rude or make a scene."
    },
    {
      "title": "Come il cacio sui maccheroni",
      "content": "Come il cacio sui maccheroni (koh-meh eel kah-chee-oh soo-ee mah-keh-roh-nee) When Italians say \"like cheese on macaroni,\" they're saying that something has just come together perfectly or that it represents a perfect combination . In English, you might say it was \"like icing on the cake\" or \"like peanut butter and jelly\" (depending on which sense you're using)."
    },
    {
      "title": "Come stai",
      "content": "Come stai (koh-meh stah-ee) It means how are you and is pretty easy to remember because it sounds a lot like the Spanish \"como estas.\" While this is still considered casual slang, it's older slang that's appropriate to use pretty much anywhere (except on the most formal occasions)."
    },
    {
      "title": "Come te la passi",
      "content": "Come te la passi (koh-meh teh lah pah-see) It literally means \"how do you pass it (yourself),\" which could be really confusing if you heard it for the first time and didn't know that it was an idiom similar to how's it going or \"how are you getting along\" or \"how goes it\" in English."
    },
    {
      "title": "Come va",
      "content": "Come va (koh-meh vah) Literally \"how goes,\" this is a really common way to say \"how are you\" or how's it going in Italian. It's casual and still considered slang, but like come stai it's more generally acceptable."
    },
    {
      "title": "Dai",
      "content": "Dai (dah-eeh) This versatile word generally means come on or let's go and it can be used in a variety of different circumstances. It's perfectly at home cheering on your favorite team, encouraging a slow dog to come inside out of the rain, or expressing disbelief at something someone's just told you."
    },
    {
      "title": "Essere alla frutta",
      "content": "Essere alla frutta (eh-seh-reh ah-lah froo-tah) This phrase literally means \"to be fruity,\" but Italians use it to mean that you're at rock bottom . It can also be used, somewhat ironically, to say that you've reached the end of something (as when you've just finished a pint of ice cream by yourself)."
    },
    {
      "title": "Essere del gatto",
      "content": "Essere del gatto (eh-seh-reh dell gah-toh) The literal meaning, \"to be of the cat,\" implies that someone is sneaking around or being shady. The implication is that they're up to no good or acting sus."
    },
    {
      "title": "Essere gasato",
      "content": "Essere gasato (eh-seh-reh gah-sah-toh) This verb phrase literally means \"to be gassy,\" but Italians use it in a slang sense to refer to someone who's conceited —just as you might describe them as \"full of hot air\" in English."
    },
    {
      "title": "Essere in canna",
      "content": "Essere in canna (eh-seh-reh een cah-nah) Literally \"to be in the weeds,\" this phrase is used when you're very poor or completely broke. It can also be used if you're in a bad situation in general—it doesn't have to be financial in nature."
    },
    {
      "title": "Essere nelle nuvole",
      "content": "Essere nelle nuvole (eh-seh-reh neh-lleh noo-voh-leh) This verb phrase literally means \"to be in the clouds,\" and it's used to describe someone who's daydreaming or lost in thought—just like you would say someone's head was in the clouds in English."
    },
    {
      "title": "Fare un after",
      "content": "Fare un after (fah-reh oon ah-ftehr) The verb fare means \"to do,\" so this mashup of Italian and English means \"to do an after,\" referring to after-parties. Basically, it means you're planning on staying out all night and partying until the break of dawn."
    },
    {
      "title": "Ferro",
      "content": "Ferro (feh-roh) The word literally means \"iron,\" but in Italian slang it means gun . Italian-Americans might be associated with mobsters, but the truth is that slang typically comes from people in the underworld and on the fringes of society who need to hide what they're doing. [11] X Research source"
    },
    {
      "title": "Figo",
      "content": "Figo (fee-goh) This little word means cool and you use it just like you'd use the word \"cool\" in English slang. That also makes it a pretty easy one to just slip into your daily speech to sound more Italian ."
    },
    {
      "title": "Figurati",
      "content": "Figurati (fee-goo-rah-tee) When you find out that this word means forget about it , you'll instantly understand \"fuhgeddaboudit.\" This is a great example of how languages affect accents and dialects."
    },
    {
      "title": "Fugazi",
      "content": "Fugazi (foo-gah-zee/foo-gay-zee) It means that something is false, fake , bogus, inauthentic, a sham, a scam, an imposter. Its origin is unclear, and it's not Italian, although it's probably Italian-American. [12] X Research source"
    },
    {
      "title": "Gabagool",
      "content": "Gabagool (gah-bah-gool) Popularized by The Sopranos , this is an Italian-American word for a type of cold cut from southern Italy. In Italian it's called capocollo , but the Italian-American dialect rounds the c sounds into g sounds. [13] X Research source"
    },
    {
      "title": "Goomar",
      "content": "Goomar (goo-mahr) It literally means \"godmother,\" but this slang term refers to someone's side piece or mistress . It's Italian-American mobster slang, popularized in The Sopranos . [14] X Research source You might jokingly refer to your partner as your \"goomar,\" just make sure they know that you're joking."
    },
    {
      "title": "In bocca al lupo",
      "content": "In bocca al lupo (een boh-cah ahl loo-poh) This phrase means good luck , and is used similarly to how you'd tell someone to break a leg in English. The traditional response to this is \"Crepi\" (kreh-pee) , which literally means, \"May you burst!\" But in this context, it just means \"thank you.\" [15] X Research source"
    },
    {
      "title": "Madone",
      "content": "Madone (mah-doh-neh) This interjection is a slang form of Madonna , which refers to Mother Mary. Italians use it the same way you might say \"God!\" in English."
    },
    {
      "title": "Magari",
      "content": "Magari (mah-gah-ree) This wonderful word doesn't have a direct English translation, but it means something close to maybe with a touch of hopefulness. Use it when you're talking about something uncertain that you're cautiously optimistic about. [16] X Research source You can also use it to express regret about something that didn't happen, similar to the way you'd say \"if only\" in English. On the flip side, if you say it with the right tone, it emphasizes what you've said, turning that \"maybe\" into an enthusiastic \"Yes!\""
    },
    {
      "title": "Mamma mia",
      "content": "Mamma mia (mah-mah mee-ah) The phrase literally means my mother , but most people understand that it's used in a different sense. This interjection is quite possibly the most widely-known Italian slang, and is used to express shock or sudden, intense pleasure. [17] X Research source"
    },
    {
      "title": "Marone",
      "content": "Marone '('mah-roh-neh) This is an Italian slang shortening of Madonna , used the same way as any of the other slang interjections that reference Mary. Remember, because Italy is a very Catholic country, Catholic imagery figures prominently in Italian slang. [18] X Research source"
    },
    {
      "title": "Meno male",
      "content": "Meno male (meh-noh mah-leh) The literal translation is \"less bad,\" but it's used to express relief or gratitude. Kind of like how you might let out a sigh of relief or say \"whew\" after something went off without a hitch."
    },
    {
      "title": "Mettere la paglia vicino al fuoco",
      "content": "Mettere la paglia vicino al fuoco (meh-teh-reh lah pah-lee-ah vee-chee-noh ahl foo-oh-ko) This verb phrase literally means \"to put straw near the fire.\" As you can probably see from this vivid image, it's used in slang to mean that someone is tempting fate or doing something really risky."
    },
    {
      "title": "Mi fa cagare",
      "content": "Mi fa cagare (mee fah cah-gah-reh) This phrase literally translates to \"it makes me poop.\" Used as an expression of extreme disgust , it's a great little phrase to use when you want to add a little childish humor to every day life. [19] X Research source"
    },
    {
      "title": "Mitico",
      "content": "Mitico (mee-tee-coh) If something is even greater than great, you might use this Italian slang word instead. It means something similar to fantastic or amazing in English, and it's used for something truly epic or legendary. Naturally, just like similar English words, it can also be used sarcastically to mean the exact opposite."
    },
    {
      "title": "Paisan",
      "content": "Paisan (peh-sahn) Countryman. While paisan might have gained popularity with Italian-American mobster shows and movies, it's actually a really old Italian word meaning countryman . In the slang sense, it's used the same way you might say \"brother,\" \"sister,\" or \"comrade\" in English. [20] X Research source"
    },
    {
      "title": "Prego",
      "content": "Prego (preh-goh) It means \"you're welcome,\" but when used in the slang sense, it means something more like I beg you . Use it similarly to the way you might say, \"oh, please\" in English. [21] X Research source"
    },
    {
      "title": "Raga",
      "content": "Raga (rah-gah) This Italian slang word generally means guys or \"dudes.\" It can be used in that literal sense, or it can also be used to refer vaguely to a group of people regardless of their gender. The word itself has taken on something of a gender-neutral sense among a lot of people, just like \"guys\" has for many English speakers. [22] X Research source"
    },
    {
      "title": "Sbirro",
      "content": "Sbirro (sbee-roh) This is a derogatory Italian slang term for \"police officer.\" A little stronger than cop , this would be similar to using the word \"pig\" in English. Don't use this word in the presence of law enforcement officers. [23] X Research source"
    },
    {
      "title": "Sbronzarsi",
      "content": "Sbronzarsi (sbrohn-dzahr-see) This is a verb that means to get very drunk . Appropriately, when you say it, it sounds like you're slurring your words. People will have a hard time checking your pronunciation, especially if you're using it to refer to yourself."
    },
    {
      "title": "Sei scemo",
      "content": "Sei scemo (seh sheh-moh) This phrase literally means \"you're shrinking\" in English, but the slang usage is more nuanced. The word scemo has taken on the meaning of someone who is stupid or an idiot. When someone says this, they usually mean that someone is being a jerk . [24] X Research source If someone is being mean to you, say this back to them to let them know that what they said made them look bad."
    },
    {
      "title": "Sciallo",
      "content": "Sciallo (shah-loh) Another versatile word that can be used in many different ways, much like the English word chill . You can use it to tell really boisterous people to calm down, to describe your relaxed mental state, or to invite some friends over to hang in a low-key way."
    },
    {
      "title": "Sciallarsi",
      "content": "Sciallarsi (shahl-lahr-see) This verb means \"to chill out\" and is basically the verb form of the word sciallo (chill). Italians use it in slang the same ways you might use the verb chill in English slang."
    },
    {
      "title": "Scumbari",
      "content": "Scumbari (skoo-mbah-ree) This Italian-American slang word refers to someone who is disheveled , worn down, or shabby in appearance. If you tell someone not to make you scumbari, you're pleading with them not to embarrass you."
    },
    {
      "title": "Sfacime",
      "content": "Sfacime (sfah-chee-meh) Vulgar. It literally translates to sperm of the devil in English. Use this one to talk about someone you really hate. You can shorten it as \"fah-cheem.\" [25] X Research source"
    },
    {
      "title": "Sfigato",
      "content": "Sfigato (sfee-gah-toh) This word means loser and is basically the least offensive way to insult someone in Italian slang. Italians typically use this word to refer to someone who's not cool, a little dorky, or maybe just always seems to be in the wrong place at the wrong time. [26] X Research source"
    },
    {
      "title": "Spaccare",
      "content": "Spaccare (spah-kah-reh) This verb literally means \"to break,\" but in the slang sense, Italians use it to talk about something that's really cool . Use it the same way you might say that something \"rocks\" in English."
    },
    {
      "title": "Tranqui",
      "content": "Tranqui (trahn-kwee) A shortened, less formal version of the Italian word for relax, this word also simply means relax . It's used in the slang sense as an interjection to urge someone not to worry about something, the same way you might say \"stay calm\" or \"don't worry\" in English."
    },
    {
      "title": "Un botto",
      "content": "Un botto (oon boh-toh) While the phrase literally means \"a shot,\" Italians use it as a vague amount any time they're talking about a lot of something. This is similar to how you might say you have a ton of something in English (not meaning that you have a literal ton)."
    },
    {
      "title": "Una cifra",
      "content": "Una cifra (ooh-nah chee-frah) This phrase literally means \"a number,\" but like un botto , Italians use it when they want to talk about having a really large amount of something. You can also use it as an adjective, the same as you would use \"great\" in English."
    },
    {
      "title": "Una paglia",
      "content": "Una paglia (ooh-nah pah-lee-ah) The literal translation to English would be \"a straw,\" but Italians use this in slang to refer to a cigarette . You can also have a tail of straw, avere la coda di paglia , which means you have a guilty conscience. [27] X Research source"
    },
    {
      "title": "Va fa Napoli",
      "content": "Va fa Napoli (vah fah neh-poh-lee) This phrase would literally translate to \"go to Naples,\" which sounds lovely unless the person who says this is someone who hates Naples. And that's exactly where this slang expression came from, because it's used to mean go to hell ."
    },
    {
      "title": "Zitto",
      "content": "Zitto (zee-toh) If you want to tell someone to shut up in Italian , this word, which means silence , is a great way to do it. Just keep in mind this is a casual, slang term, so probably not appropriate in a lot of situations."
    },
    {
      "title": "Your speech will sound more natural.",
      "content": "Your speech will sound more natural. Ordinary people tend to incorporate slang into their everyday speech—sometimes without even realizing it—so learning slang will help you sound more fluent. Speaking the way you're taught in textbooks can make you sound stiff and formal. [28] X Research source Keep in mind that most slang terms are best used in casual environments around friends and people your age. When in doubt, revert to your textbook Italian."
    },
    {
      "title": "You'll understand native speakers from different areas.",
      "content": "You'll understand native speakers from different areas. Slang is often attached to a particular region or group of people, which means that a word might mean one thing in one context and something totally different in another. Learning slang gives you a deeper understanding of the nuances of language and how different people use it to communicate. [29] X Research source Each region's slang can give you particular insight into what it's like to live in that region and the issues commonly faced by people who live there."
    },
    {
      "title": "You get insight into the Italian mindset and culture.",
      "content": "You get insight into the Italian mindset and culture. Slang reflects the attitudes and moods of the people speaking the language as well as what's going on in the culture at the time. In this way, learning and keeping up to date with slang can be like taking the pulse of the culture. [30] X Research source Because slang typically originates in fringe communities, it's a way of giving a voice to people who often don't have much of a voice in the culture as a whole. Italian-American slang also gives you insight into what it's like to be part of a diaspora community and how living in the US has shaped their Italian language and traditions."
    },
    {
      "title": "Watch Italian or Italian-American TV shows and movies.",
      "content": "Watch Italian or Italian-American TV shows and movies. Research shows watching TV shows and movies in a foreign language is a great way to learn that language . [31] X Research source Even if you watch Italian-American shows that are mostly in English, you'll also pick up a lot of the Italian slang that's sprinkled in. Keep in mind that TV shows and movies are typically written and produced by older people, so they might not necessarily have the most up-to-date slang. You can also watch how people speak—Italian is a very expressive language and the hand gestures can be just as important as the words! Listening to Italian pop music is another way to learn some of the more recent slang, since those words and phrases tend to make their way into pop music even more quickly than they do film and television."
    },
    {
      "title": "Follow native speakers on social media.",
      "content": "Follow native speakers on social media. Look for comedians and other content creators who speak and perform skits with original audio. These accounts will give you more exposure to native speech as well as native culture and trends. Scrolling through comments in Italian can help you pick up new slang as well, even if you can't read all of the comments very well yet."
    },
    {
      "title": "Have conversations with native speakers.",
      "content": "Have conversations with native speakers. The best way to become conversational in any language is to have conversations. With native speakers, you'll get a better understanding of the tone and rhythm of the language as well as how it's naturally spoken. [32] X Research source If you're in an immersive situation where you can't reach back to your native language if you get stuck, you'll really start to pick up the words and phrases you need quickly. If a native speaker uses a word that you don't understand (or uses a word you understand in a way you don't understand, which frequently happens with slang), just ask them to explain! Then you'll have a new word to add to your growing vocabulary."
    }
  ]
}