{
  "url": "https://www.wikihow.com/Hang-an-Unframed-Canvas",
  "title": "How to Hang an Unframed Canvas",
  "steps": [
    {
      "title": "Install wire on the stretched canvas to hang larger pieces.",
      "content": "Install wire on the stretched canvas to hang larger pieces. This isn’t required to hang your canvas, but it’s a popular option for art that’s larger than 1 foot (0.30 m) squared. You'll place the wire between the left and right stretcher bars so the nail catches on it. Screw 2 eye hooks onto the back of the painting, positioning them on the inside of each canvas stretcher bar, roughly a third of the way down, so that they’re pointing towards one another. Attach a piece of wire to the hooks to hang the canvas from the wire. [1] X Research source The stretcher bars are what the canvas is stretched across to keep it taut and in place. Make sure the hooks are level with one another so the wire is even. Look for eye hooks and wire for hanging canvas at your local hardware store or art store. Check to be sure the piece of wire isn’t too long by pulling up on it when it’s tied to the hooks. If it reaches above the top of the canvas, it’s too long."
    },
    {
      "title": "Mark where you want to hang the canvas on the wall.",
      "content": "Mark where you want to hang the canvas on the wall. Make a mark just below the center of the top stretcher bar if you're not using wire to hang the canvas. If you've attached a wire, hold the canvas up by the wire and place it against the wall where you'd like it to hang. Make a mark where your finger is holding the wire so you know where to place the nail. [2] X Expert Source Jason Phillip Handyman Expert Interview. 2 July 2020. For heavier canvases or canvases larger than 1 foot (0.30 m) wide, consider using 2 nails to hold the stretched canvas in place more securely. [3] X Research source If the canvas is large or heavy, use 2 nails. Make 2 marks on the wall and use a level to ensure they're even. [4] X Research source"
    },
    {
      "title": "Hammer the nail(s) partway into the wall.",
      "content": "Hammer the nail(s) partway into the wall. Hold the nail on top of the pencil mark you made on the wall. Use a hammer to softly hit the nail into the wall, leaving at least 1 centimetre (0.39 in) exposed where the canvas will hang. [5] X Research source Repeat with the second nail, if applicable. If you’re hanging a large canvas with thicker stretcher bars, such as 1 inch (2.5 cm) thick, leave more of the nail exposed to ensure the canvas is secure. If you're nailing between the studs or securing the canvas on concrete, install anchor screws first so the canvas doesn't fall off of the wall. [6] X Expert Source Jason Phillip Handyman Expert Interview. 2 July 2020. Visit the hardware store to find nails long enough to go into the wall and hold the stretched canvas."
    },
    {
      "title": "Hang the canvas using the nail(s).",
      "content": "Hang the canvas using the nail(s). If you installed a wire to hang the canvas, hang the wire on the nail so that the canvas is centered⁠—you may need to slide the canvas to the left or right a little bit until it’s perfectly centered on the wire. If you didn’t install a wire, place the edge of the top stretcher bar on the nail(s) so it’s resting securely, centering it how you’d like it to appear on the wall. [7] X Research source"
    },
    {
      "title": "Use metal hinge clips to hold a large piece of canvas.",
      "content": "Use metal hinge clips to hold a large piece of canvas. Place a metal clip on the top of the canvas in each corner. If your canvas is large, use 3 or more clips to hold it up adequately, or look for extra large metal hinge clips that are able to hold the extra weight. [8] X Research source Use nails or thumb tacks to hold the clips in place, inserting them into the hole at the top of each clip. Purchase clips with a magnet on the back to hold loose canvas up on a magnetic surface like the fridge. Metal clips can be found at your local big box store or online. Use a level to make sure you hang your clips evenly."
    },
    {
      "title": "Tack a small canvas directly onto the wall using thumb tacks.",
      "content": "Tack a small canvas directly onto the wall using thumb tacks. If your piece of canvas is lightweight and thin, consider attaching it to the wall using thumb tacks or pushpins. Use a level to mark a straight line with pencil where you'd like to tack the canvas. Place a tack in each corner of the canvas, pushing through the canvas with the pin to ensure it’s secure. [9] X Research source If you don’t want to push the tack through your canvas, place the tack right on the edge of the canvas and use the tack head to hold it in place."
    },
    {
      "title": "Apply washi tape to light canvas to hold it on the wall.",
      "content": "Apply washi tape to light canvas to hold it on the wall. Washi tape is a fun way to attach art to a wall, though the canvas needs to be lightweight and thin for the tape to be able to hold it in place. Choose washi tape in a color or design of your choice before taping it along each edge of the canvas so it’s attached to the wall. [10] X Research source Use a level to form an even line where the canvas and washi tape will go on the wall. Create a frame out of washi tape by making a design along the edges of the canvas, forming a unique border. If you’re worried about the canvas falling off of the wall, attach painter’s tape or a stronger tape that won’t damage the wall to the back of the canvas before using the washi tape."
    },
    {
      "title": "Attach a dowel to the canvas to hang it on the wall using rope or thread.",
      "content": "Attach a dowel to the canvas to hang it on the wall using rope or thread. Use hot glue to attach the top and bottom side of the canvas to dowels. Tie a piece of yarn, string, or rope to the top dowel on either end so you can hang it on the wall. Hammer a nail into the wall or pin a tack to hang the canvas evenly. [11] X Research source Attaching a dowel to the bottom end as well as the top is important so that the canvas falls flat against the wall."
    }
  ]
}