{
  "url": "https://www.wikihow.com/Make-a-TNT-Cannon-in-Minecraft",
  "title": "How to Make a TNT Cannon in Minecraft",
  "steps": [
    {
      "title": "Open the Creative menu.",
      "content": "Open the Creative menu. To do so: Computer - Press the E key. Pocket Edition - Tap ⋯ Console Edition - Press the X (Xbox) or square (PlayStation) button."
    },
    {
      "title": "Place the cannon's building materials in your inventory.",
      "content": "Place the cannon's building materials in your inventory. Move the following items from the creative inventory to your equip bar: [1] X Research source [2] X Research source 16 blocks - These can be anything from wool to diamond, but iron or obsidian is preferred. 1 slab - This can be any material. The best material to use is quartz. 11 redstone 1 bucket of water 2 levers 5 TNT blocks"
    },
    {
      "title": "Place a seven-block-long row of blocks.",
      "content": "Place a seven-block-long row of blocks. Make sure that at least one end of this row is facing the direction in which you want to shoot. [3] X Research source"
    },
    {
      "title": "Place a block on the left side of the last block.",
      "content": "Place a block on the left side of the last block. You should now have a seven-block-long row with a reverse \"L\" shape."
    },
    {
      "title": "Place another seven-block-long row of blocks.",
      "content": "Place another seven-block-long row of blocks. This row should run parallel to the first row, starting on the left side of the last block you placed. Doing so will create a \"U\" shape that is seven blocks long and three blocks wide. [4] X Research source"
    },
    {
      "title": "Place your last block on top of the front-left block.",
      "content": "Place your last block on top of the front-left block. This block is the top-left block in the \"U\" shape."
    },
    {
      "title": "Place the slab at the mouth of the \"U\".",
      "content": "Place the slab at the mouth of the \"U\". The slab should fit directly in between the front-left and front-right blocks."
    },
    {
      "title": "Pour water into the back of the cannon.",
      "content": "Pour water into the back of the cannon. At the bottom of the \"U\" shape, place the water to form a channel from the back of the cannon all the way up to the slab. [5] X Research source This is what will move your TNT forward when you place it later. [6] X Research source"
    },
    {
      "title": "Place a switch on the back-left and back-right blocks.",
      "content": "Place a switch on the back-left and back-right blocks. These switches will function as your cannon's triggers. [7] X Research source Leave the middle block blank. You won't put anything here, especially not redstone."
    },
    {
      "title": "Place a line of redstone from the left switch to the end of the left fork.",
      "content": "Place a line of redstone from the left switch to the end of the left fork. The line of redstone should go all the way up to the last block, including the one you placed on top of the final block on the left side. [8] X Research source [9] X Research source"
    },
    {
      "title": "Place a line of redstone from the right switch up to the second-to-last block.",
      "content": "Place a line of redstone from the right switch up to the second-to-last block. The line of redstone must go all the way up to the block that comes before the block that's touching the slab. [10] X Research source The redstone line should essentially extend the length of the water channel."
    },
    {
      "title": "Place a TNT block on the slab.",
      "content": "Place a TNT block on the slab. This will be your projectile. [11] X Research source [12] X Research source"
    },
    {
      "title": "Place up to four TNT blocks in a line behind the slab.",
      "content": "Place up to four TNT blocks in a line behind the slab. These TNT blocks can go all the way back to the second-to-last block of water, but the source water block must remain."
    },
    {
      "title": "Fire your cannon.",
      "content": "Fire your cannon. When you're ready, flick the right switch, then immediately hit the left one. The front piece of TNT will drop onto the slab as the four TNT blocks move toward it; when the TNT blocks explode, the front one will be propelled forward. [13] X Research source This TNT's height will vary depending on how quickly you hit the left switch. If you do very quickly, the TNT will fly straight. Delay it 2-3 seconds, and the TNT will fly much higher. If you wait too long, however, the first block of TNT will just fly upward and explode. Don't hit the left switch first, or your cannon might explode."
    }
  ]
}