{
  "url": "https://www.wikihow.com/Is-Roblox-on-PS4",
  "title": "Can You Play Roblox on PS4 or PS5?",
  "steps": [
    {
      "title": "No—There is no Roblox app for PS4 or PS5.",
      "content": "No—There is no Roblox app for PS4 or PS5. Most games you play on PS4 or PS5 must be purchased and/or downloaded from the PlayStation Store . Currently, Roblox does not have an app available in the PlayStation Store. Therefore, you cannot play Roblox on a PS4 or PS5."
    },
    {
      "title": "You used to be able to, but not anymore.",
      "content": "You used to be able to, but not anymore. There are many reports that players used to be able to play Roblox inside the web browser that comes pre-installed on the PS4. However, as of April 21, 2020, this is no longer the case. [1] X Research source When you play Roblox in a web browser on your PC, you are prompted to download and install the Roblox Player . Since there is no Roblox Player app for PlayStation, you cannot play using the web browser."
    },
    {
      "title": "While nothing has been announced, it's possible Roblox will come to PlayStation.",
      "content": "While nothing has been announced, it's possible Roblox will come to PlayStation. There have long been rumors circulating that an official Roblox app for PlayStation is in the works. There have even been job postings on the official Roblox website for software engineers with experience developing software for PlayStation consoles. So, it is possible that Roblox may come to PlayStation 4 or PlayStation 5 at some point. However, nothing official has been announced."
    },
    {
      "title": "There are many platforms you can play Roblox on.",
      "content": "There are many platforms you can play Roblox on. If you were really hoping to play Roblox on PS4 or PS5, don't worry. You can play Roblox on the following platforms: [2] X Research source Windows: Roblox is available on 64-bit versions of Windows 7, Windows 8.1, Windows 10, and Windows 11. Mac: Roblox is available on macOS 10.10 (Yosemite) and higher. You need macOS 10.13 (High Sierra) or higher to run Roblox Studio . Chromebook: Roblox is available on Chromebooks running Chrome OS version 53 or higher. You must enable the Google Play Store on your Chromebook. Android: Roblox is available on Android 5.0 or higher. It can be downloaded from the Google Play Store . iPhone/iPad: Roblox is available from the App Store on iPhone or iPad. It requires iOS 11 or higher, an iPad Air or higher, iPad Mini 2 or higher, or iPhone 5s or higher. Amazon Fire Tablet: Roblox is available on Kindle Fire HDX 7 & 8.9 (3rd & 4th Gen), Fire HD 6, 7, 8, and 9 (4th & 5th Gen), and Fire (5th Gen). Roblox is not available on Fire HD 2013. [3] X Research source"
    }
  ]
}