{
  "url": "https://www.wikihow.com/Glue-Acrylic",
  "title": "How to Glue Acrylic",
  "steps": [
    {
      "title": "Find an appropriate workspace.",
      "content": "Find an appropriate workspace. Since you'll be working with an adhesive that can cause fumes, you want to first make sure you are in a well-ventilated area. For example, working outdoors or in a room with more than one window. [1] X Research source Position your work area between windows or between a window and open doorway. You should also set up a box fan or two to blow air away from you. A room that has an exhaust fan works well, too."
    },
    {
      "title": "Take the appropriate safety precautions.",
      "content": "Take the appropriate safety precautions. This means wearing safety goggles, gloves, and a facemask. Outside of the potential vapors from the acrylic cement, you also want to make sure that any refuse from cutting or sanding the acrylic doesn't get in your lungs or eyes. Make sure you are also following the directions on the acrylic cement closely to avoid any mishaps."
    },
    {
      "title": "Select your work surface.",
      "content": "Select your work surface. Whether you are planning to glue in a workroom, a garage, or even your kitchen, you want to make sure that the surface area you’re using is compatible with acrylic cement. Try to stick to an area that’s concrete, metal or wood. Do not glue acrylic on a surface containing glass or paper."
    },
    {
      "title": "Examine the edges of the acrylic.",
      "content": "Examine the edges of the acrylic. Make sure that the borders of the acrylic you want to join are flat and free of bumps or cuts. Acrylic cement will not adhere or sink into grooves and crevices like regular glue does on wood or paper. Instead, it softens the acrylic and chemically bonds the pieces together, so it's important they are as flat as possible. [2] X Research source If you notice any rough areas, use a router (a power tool with a shaped cutter) or light sandpaper to ensure that the edges are perfectly smooth and square. However, do not sand the edges so that they become round. Make sure that any surfaces being bonded together are lightly sanded and not shiny, as a very smooth surface is tough to bond together."
    },
    {
      "title": "Clean the acrylic with isopropyl alcohol.",
      "content": "Clean the acrylic with isopropyl alcohol. Once you have sanded and smoothed the sides of your acrylic, wipe over it with a clean cloth and alcohol. Using Isopropyl alcohol will help guarantee that all dirt, dust, and other fragments have been removed. It will also remove any residual oils left by your hands, which can interfere with gluing. Be sure that your surfaces are totally dust-free – this is really important to the process."
    },
    {
      "title": "Prepare your acrylic cement/glue.",
      "content": "Prepare your acrylic cement/glue. The most common glue for acrylics is a solvent-based glue like Weld-On 4, which can be found on Amazon for under $15. This glue should also come with its own applicator bottle and needle. To use, simply fill the applicator bottle, via a funnel, until the bottle is about 75% full. Once filled, squeeze the bottle gently to allow some of the air inside to escape."
    },
    {
      "title": "Join the acrylic pieces.",
      "content": "Join the acrylic pieces. Place the pieces of acrylic together as you want them to be joined. They should meet at a 90-degree angle. You can then use a combination square to guarantee that the pieces are angled correctly. Once set up, use your hands or a clamp to hold the sections together. Always do a dry run first, making sure the pieces fit before applying any glue. It helps to assemble the object together with adhesive tape. Then the adhesive can be placed accurately without juggling the parts."
    },
    {
      "title": "Position the applicator bottle and apply glue.",
      "content": "Position the applicator bottle and apply glue. Turn the bottle upside down and place the needle above the edge where the two pieces of acrylic meet. Squeeze the bottle with mild pressure as you move along the joined edges. You want to pull the bottle towards you. The acrylic cement should run in between the joined edges and fill in any seams or spaces as you move it along. [3] X Research source Try to lightly squeeze the bottle and move it without stopping, this will ensure you don't over-glue the acrylic. If you are gluing for a box corner joint, apply the acrylic cement to the inside edge of the sheeting. However, if you are gluing for flat joints, apply the cement to both sides of the sheeting. [4] X Research source Do not allow the acrylic cement to touch any piece of the acrylic you do not want to be glued. Acrylic cement will permanently damage any surface it touches. If you do drip acrylic cement onto the acrylic, allow the cement to evaporate. Do not wipe it off."
    },
    {
      "title": "Allow the acrylic cement to set.",
      "content": "Allow the acrylic cement to set. Most acrylic cement will take around 10-15 minutes to set initially. During this time you can use your hands or a clamp to hold the edges together. Once they are secure, they should take 24-48 hours to cure to full-strength. [5] X Research source If the pieces have been adhered well, the dried acrylic cement will be clear. Before this time, the acrylic should appear as a cloudy white."
    },
    {
      "title": "Trim the acrylic.",
      "content": "Trim the acrylic. If there are any excess or overlapping pieces of acrylic, you can cut these off with a router (a power tool with a shaped cutter). However, be careful of heat generation, which could melt the acrylic. You should also make sure the acrylic is properly set before you try to manipulate it in any way."
    }
  ]
}