{
  "url": "https://www.wikihow.com/Handle-Insecurity-After-Your-Spouse-Cheats",
  "title": "How to Handle Insecurity After Your Spouse Cheats",
  "steps": [
    {
      "title": "Work on your self-esteem.",
      "content": "Work on your self-esteem. Realize that your spouse's infidelity does not mean you deserve to be cheated on or disrespected. You deserve dignity and fairness in your relationships, and it's not your fault that your spouse decided to stray behind your back. Build yourself back up by reminding yourself of your positive qualities and achievements. Try making a list of all of your positive qualities. These can be anything from being a loyal friend to knowing how to play the guitar to graduating from college. Write down all of your positive qualities and review this list often. If you are having trouble thinking of things to add, then ask a trusted friend or family member to help you."
    },
    {
      "title": "Deal with intrusive thoughts",
      "content": "Deal with intrusive thoughts . You may sometimes find yourself dwelling on worries about whether or not your spouse is going to cheat again. These thoughts can be disruptive, so it is important to learn how to recognize them and redirect your attention when they occur. Try to replace an intrusive thought about your spouse cheating with a positive one. For example, if you find yourself thinking, “I know my spouse is going to cheat on me again and there's nothing I can do to stop it!” then you might replace this thought with something like, “I am doing everything I can to recover from my spouse's infidelity and I am proud of all of my hard work and progress.” [1] X Research source"
    },
    {
      "title": "Take care of your health.",
      "content": "Take care of your health. Focus on the basics of good nutrition, sleep, and exercise. Dealing with a difficult issue like infidelity is more manageable when your physical needs are taken care of. [2] X Research source Self-care activities like meditation and writing in a journal can be good for your emotional health. Avoid turning to alcohol, drugs, or other unhealthy coping mechanisms for comfort. You might feel better temporarily, but these substances will make your long-term problems worse."
    },
    {
      "title": "Cultivate hobbies that are unrelated to your relationship.",
      "content": "Cultivate hobbies that are unrelated to your relationship. Carve out a few hours a week to devote to an activity you enjoy, or pick up a new hobby you've always wanted to try. Spending time developing a skill or exercising your creativity can help you feel more emotionally self-sufficient. [3] X Research source Try starting a reading habit, learning a craft like knitting, or taking a class on something that interests you."
    },
    {
      "title": "Avoid letting your happiness depend entirely on others.",
      "content": "Avoid letting your happiness depend entirely on others. When you share your life with someone, it can be easy to let them dictate your emotions. Remember that you're a whole person on your own, and you're capable of finding happiness outside of your relationships. Try using visual imagery to put this into perspective. For example, when your spouse becomes depressed or angry, imagine that they have just gotten on a roller coaster and you are standing on the side watching them ride. The roller coaster represents the emotions they are feeling, but you do not have to ride this ride with them."
    },
    {
      "title": "Seek individual counseling.",
      "content": "Seek individual counseling. Self-esteem and trust issues may arise after learning that your spouse was unfaithful. Just as it can be helpful to seek help as a couple, you may also benefit from talking to a professional on your own. [4] X Research source You might choose individual counseling as a tool to help you restore your confidence and heal after being cheated on if you do not want to work on the marriage. Your therapist can serve as a source of support and guidance as you navigate the decision to divorce. [5] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 20 March 2024. It may also help to join a support group for spouses who have experienced infidelity. Sharing your story and hearing that of others can ultimately help you heal."
    },
    {
      "title": "Move on, if you choose.",
      "content": "Move on, if you choose. It is entirely up to you how you choose to move forward after suffering from infidelity in your marriage. Perhaps if your spouse appears to be a serial cheater, or your trust cannot be mended, you might choose to divorce. Divorce is never an easy choice; yet, it is one that you should make only after discussing the ordeal with your spouse and various supportive loved ones. A therapist can help you decide what is best for your future (and your children's, if you have any). This professional may also assist you in having the discussion with your spouse, family members, and children. [6] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 20 March 2024. Take plenty of time to think through your options and make your decision. Even if other people advise you to act quickly, take as much time as you need to make this decision."
    },
    {
      "title": "Commit to forgiving your spouse.",
      "content": "Commit to forgiving your spouse. If you are planning to stay together, forgiveness is a must. Holding on to resentment and bitterness will only poison your relationship in the future. Make a conscious decision to forgive your spouse and move forward. [7] X Research source It may be difficult to forgive your spouse all at once, especially if the betrayal happened recently. Instead, work towards a goal of forgiveness as you rebuild your relationship. Try saying something like \"I forgive you,\" or \"I am working on forgiveness\" out loud to yourself, your spouse, and to other people. Even if you don't feel ready to forgive just yet, saying your intentions out loud may help you to move towards feeling ready to forgive. Reader Poll: We asked 847 wikiHow readers who've been cheated on, and 57% of them agreed the best way to practice forgiveness is by praying for their spouse. [Take Poll]"
    },
    {
      "title": "Seek marital counseling.",
      "content": "Seek marital counseling. Counseling can be an invaluable tool in rebuilding your relationship with your spouse. [8] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 20 March 2024. A counselor will help you figure out why the infidelity happened. They can also help you find ways to work through your emotions and teach you to communicate better with each other. Counseling can also help you and your spouse decide whether continuing the relationship is the right choice for you."
    },
    {
      "title": "Take your share of the responsibility for problems in the relationship.",
      "content": "Take your share of the responsibility for problems in the relationship. Many people who have affairs do so because their needs are not being met at home. If this contributed to your spouse cheating, it's important to address that issue and take steps to fix it, if possible. [9] X Research source Lack of emotional intimacy and sexual fulfillment are among the most common reasons people stray. Taking responsibility for relationship problems doesn't mean excusing your spouse's infidelity."
    },
    {
      "title": "Communicate often and openly.",
      "content": "Communicate often and openly. [10] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. Designate regular times to check in with your spouse. Don't just talk about their affair – discuss your current feelings, what each of you needs from the other, and your goals for the relationship as you move forward. [11] X Research source Talk about things that are not related to your relationships as well, such as your passions, goals, and dreams. This can help to restore some of the excitement in your relationship. Re-opening channels of communication with your spouse helps to restore your relationship after living with the secrecy and lies of infidelity. If you find that you spend too much time discussing the affair itself, try setting aside 15 minutes a day to talk about it. Stick to other topics the rest of the time."
    },
    {
      "title": "Tell your partner whenever you're feeling angry, anxious, or sad, and encourage them to do the same.",
      "content": "Tell your partner whenever you're feeling angry, anxious, or sad, and encourage them to do the same. [12] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. Being vulnerable will make it easier to process and heal after infidelity. It will also give your partner the chance to support you and prove they can do better in the future."
    },
    {
      "title": "Rebuild physical intimacy.",
      "content": "Rebuild physical intimacy. After your trust has been compromised with an affair, it can be difficult to reconnect with your spouse on a physical level. However, if you choose to rebuild your marriage, this is a step you must take to fully recover and move on. You can restore intimacy in your marriage by making an effort to communicate your deepest desires with your spouse—your inner thoughts and feelings. In addition, dating each other again may also help. Go on a romantic trip with your spouse. Return to your earlier days when you lovingly traded massages, cuddled on the couch most evenings, and discussed your days during dinner rather than eating in silence. Marriage counseling can also be helpful in allowing you and your spouse to cross the bridge back to sexual intimacy. This may take time as you may have built up walls after the infidelity, and it may be the last thing that you work on. Try to focus one rebuilding your relationship and this should follow in time. It's important for you to both be honest with yourselves and fully grieve the betrayal to become physical partners again. [13] X Research source You can also make an effort to be physically affectionate with each other until you are ready to have an intimate relationship again. Simple things like holding hands, kissing each other goodbye, and giving each other hugs may help to improve your emotional and physical intimacy."
    },
    {
      "title": "Avoid clingy behavior.",
      "content": "Avoid clingy behavior. Don't call your spouse constantly to check up on where they are or insist that they spend all their free time with you. While this behavior is understandable, it's likely to make your spouse feel smothered, which could drive a wedge between you. [14] X Research source It is reasonable to ask for some accountability from your spouse after a betrayal. Just be careful not to cross the line into unhealthily jealous or controlling behavior."
    },
    {
      "title": "Seek out positive experiences with your spouse.",
      "content": "Seek out positive experiences with your spouse. Doing new things can help you move past the affair together. Find things to do that will bring you closer and help you make new memories. [15] X Research source Consider taking a weekend trip together, picking up a new hobby as a couple, or just making an effort to spend more time running errands and doing chores together."
    },
    {
      "title": "Accept that you cannot control your spouse.",
      "content": "Accept that you cannot control your spouse. Whether your spouse stays faithful in the future is entirely up to them. No matter how carefully you check up on them, if your spouse wants to cheat again, they will find a way. Likewise, if they are committed to fixing their mistake, you won't have to try to control them. Remind yourself that you have proven through this process that you can take care of yourself and survive no matter what happens."
    },
    {
      "title": "Set goals for your relationship together.",
      "content": "Set goals for your relationship together. Sit down with your spouse and think about what you want your relationship to look like in the future. Make some step-by-step plans for turning your goals into reality. [16] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 20 March 2024. Working towards a common target puts you and your spouse on the same team, helping you to rebuild camaraderie and trust. [17] X Research source"
    },
    {
      "title": "Discuss issues of privacy.",
      "content": "Discuss issues of privacy. It's valid for you to request access to your spouse's phone and online activity after they cheat on you. However, they still have a right to privacy. Talk with your spouse about how you will balance privacy and accountability in the future. [18] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source If your spouse remains secretive about their online or phone activity, consider whether they are really committed to helping you trust them again."
    },
    {
      "title": "Don't assume you know what your spouse is thinking.",
      "content": "Don't assume you know what your spouse is thinking. No one is a mind reader, and it's easy to imagine problems where there are none. Focus on the facts. Don't let yourself get caught up in fears that your spouse is planning to cheat on you again unless there's a concrete reason. [19] X Research source Do a reality check with yourself when your imagination runs away with you. Stop and ask yourself, “Why am I thinking this? Is there a more likely explanation?” Also, remind yourself that if they are cheating, then they will likely mess up and get caught again. You don't have to constantly be on the lookout, so allow yourself to let go of this responsibility."
    }
  ]
}