{
  "url": "https://www.wikihow.com/Improve-Your-Grades-Without-Studying",
  "title": "How to Improve Your Grades Without Studying",
  "steps": [
    {
      "title": "Attend all your classes.",
      "content": "Attend all your classes. It can be really easy to skip a class or two, but attending every class can help ensure two things: you get participation marks (if the instructor is giving them); and you're more likely to remember something taught in class."
    },
    {
      "title": "Sit at the front of the class.",
      "content": "Sit at the front of the class. Sitting at the front of the class isn't so you can suck up to the instructor, it's to increase your chances of paying attention and remembering what is being taught. You're less likely to be distracted by other students if you sit at the front of the class. [1] X Research source"
    },
    {
      "title": "Resist using your computer for non-class related items.",
      "content": "Resist using your computer for non-class related items. If your class is being held in a computer lab, or if you bring your own laptop (or tablet) to class, resist the temptation to use it for non-class related stuff. Close all your email and social media programs while in class. If you're only using your computer to take notes or view presentation slides, disconnect from the internet. By disconnecting yourself from the internet (and email and social media) you are giving yourself a chance to resist the temptation to pay more attention to your computer than your teacher. Any activity that is not class-related should be avoided while in class. Use your in class time to pay attention."
    },
    {
      "title": "Put your hand up.",
      "content": "Put your hand up. If you have a question in class, ask it. If you think you know the answer to a question the instructor asks, answer it. If class participation is part of your class grade, asking and answering questions in class will help you get those points. [2] X Research source Being verbal in class will also draw the attention of your instructor, who may then get to know you and consider you a student who is interested in learning."
    },
    {
      "title": "Speak to your instructor.",
      "content": "Speak to your instructor. The best person to help you get better grades is the person who gives out those grades. Make an appointment to speak with your instructor about your performance. Let your instructor know that you aren't satisfied with your grades and you want to improve. Ask your instructor where you might be going wrong. Ask if there are any specific areas where you should focus."
    },
    {
      "title": "Finish your assignments by the due dates.",
      "content": "Finish your assignments by the due dates. Many instructors will allow assignments to be handed in late, but they'll deduct points automatically for late assignments. Therefore, work it into your schedule to submit your assignments on time to ensure you can get the most possible points for your hard work. [3] X Research source"
    },
    {
      "title": "Enroll in classes you actually enjoy.",
      "content": "Enroll in classes you actually enjoy. Chances are, not all your classes are required or mandatory. For your elective classes, select topics that you actually like and want to study. Liking and enjoying the subject matter not only makes attending class easier, it makes remembering the material easier. [4] X Research source"
    },
    {
      "title": "Get lots of sleep.",
      "content": "Get lots of sleep. Scientific studies have actually shown that cramming for an exam or test the night before doesn't actually work. You are actually more likely to do better on the test if you stop studying and get some sleep, than if you spend the whole night attempting to remember everything for the test. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Teenagers need at least 8 to 10 hours of sleep every night to be able to function effectively the next day. [6] X Research source Children between the ages of 6 and 13 need 9 to 11 hours of sleep every night in order to be able to function well the next day. [7] X Research source While it may seem like a good idea to grab an extra cup of coffee or drink that can of Red Bull, the more caffeine you consume in the afternoon means you'll have a harder time sleeping that night. Try to keep drink caffeinated beverages only in the morning. [8] X Research source"
    },
    {
      "title": "Reduce your stress levels.",
      "content": "Reduce your stress levels. Learning and studying shouldn't be stressful. Being stressed out can actually make it harder to learn and remember things. Think about the reasons why you're stressed out and try to resolve those reasons (remove them from your life). [9] X Research source For example, if you get stressed out about assignments because you leave them to the last minute to finish, create yourself a study schedule. Build enough time into the study schedule so that you finish your assignments well enough in advance of the due dates to eliminate any of the stress you were feeling."
    },
    {
      "title": "Keep a positive attitude.",
      "content": "Keep a positive attitude. If the grades you're receiving aren't that great it can be easy to let negativity take over. Bad grades are disappointing, but the mere fact that you're looking for ways to improve your grades means you're trying to think positively. Acknowledge to yourself that your grades aren't that good, but you're going to do something about it. Start thinking about how you're going to make things better, rather than concentrating on where you are right now."
    },
    {
      "title": "Figure out where you're going wrong.",
      "content": "Figure out where you're going wrong. If your grades are lower than you want or are expecting, chances are you're not doing something you should, or you're doing something you shouldn't. The best way you can fix whatever is wrong is to first figure out what is wrong. If you already know what you might be doing wrong — great, you're on the right track! If you aren't sure what you're doing wrong, take a ‘deep dive' into your study history and grades. Look for a pattern or a sudden change. Were your grades always not-so-good, or did they start to decline after a specific time period? Is there a specific subject or task that you seem to have the most trouble with, or does it seem to be an overall problem? Are there any reasons, other than school, that might be the cause of your problems? Is there anything else going on in your life that may be impacting your grades?"
    },
    {
      "title": "Pay attention to the signals from your body.",
      "content": "Pay attention to the signals from your body. Learning may not seem like a physical process, but it can take a physical toll on your body. If your body and your brain are telling you to take a break, then take a break. Restart whatever you were doing once you feel better. [10] X Research source If you're tired and find you can't concentrate on what you're learning, take a nap. Taking a 10-45 minute nap can actually improve your ability to learn. [11] X Research source"
    },
    {
      "title": "Work to improve your note-taking skills.",
      "content": "Work to improve your note-taking skills. Depending on the type of course you're taking, being able to take good notes may be vital to your success. Take a look at your current notes and see where you might be able to improve. Make sure your notes are legible. If you can't read your own notes, you're not going to be able to use them. If you take your notes by hand, type them out after class both to help you remember what you learned and to help make them more legible. Make sure your notes are organized. Have a separate notebook or binder for each subject. Includes titles and dates where a new class starts so you can keep them in order. Use headings and subheadings throughout so you can skim your notes to find what you're looking for quickly. Use coloured pens or pencils or highlighters to make certain points stand out."
    },
    {
      "title": "Use a metaphor or an analogy.",
      "content": "Use a metaphor or an analogy. When trying to memorize complex concepts and ideas, don't try to memorize the concepts and ideas as they are, use metaphors and analogies to remember them. [12] X Research source A metaphor is a word or phrase that has one meaning but it is used to describe something else in order to show how the two things are similar. In other words, a metaphor is an object, activity or idea that is used as a symbol. [13] X Research source An analogy is the comparison of two things based on the fact that they are alike in some way. [14] X Research source An example of a metaphor is “the test was a breeze.\" An example of an analogy is “life is like a box of chocolates.\""
    },
    {
      "title": "Combine visualization with something visceral.",
      "content": "Combine visualization with something visceral. Visualizing something isn't always enough. Instead add some additional items associated with your other senses like sounds, textures, feelings and smells. When trying to remember something important, don't just visualize it, add these visceral items as well. [15] X Research source An example might be a pie chart you need to remember that shows some important information. Visualize the pie chart like various pieces of pie. Maybe the larger pieces of pie are your favourite types of pie (e.g. strawberry), while the smaller pieces are your least favourite types of pie (e.g. pecan)."
    },
    {
      "title": "Pretend you have to explain something to a kid.",
      "content": "Pretend you have to explain something to a kid. Simplifying an idea or concept to its lowest and most basic elements can help you remember them. When trying to remember a particular difficult concept or idea, pretend you need to explain that concept or idea to a 5 year old. [16] X Research source"
    },
    {
      "title": "Draw a diagram or mind map.",
      "content": "Draw a diagram or mind map. This method starts off similar to a visualization, but instead of just making the one idea visual, connect that first idea to other ideas and concepts using a mind map. The multiple ideas in the mind map can be pictures or diagrams of the concepts. [17] X Research source"
    },
    {
      "title": "Create a story.",
      "content": "Create a story. Strict memorization can make it difficult to remember a lot of information all at once. Instead of simply memorizing everything, turn it into a story. Create a story that goes along with the concept or idea you're trying to remember. Instead of a story you can also try acronyms. If you need to remember a list of things, use the first letters in each of the items to create a word that's easier to remember than the actual list."
    },
    {
      "title": "Break your work down into smaller pieces.",
      "content": "Break your work down into smaller pieces. One of the best ways to learn a complex idea or concept is to break it down into smaller, more manageable pieces. Don't try to tackle an entire complex concept or idea as a whole, break the material into smaller pieces you can review and learn separately. [18] X Research source"
    }
  ]
}