{
  "url": "https://www.wikihow.com/Make-a-Simple-Fabric-Box",
  "title": "How to Make a Simple Fabric Box",
  "steps": [
    {
      "title": "Cut a square out of batting, linen, and cotton fabric.",
      "content": "Cut a square out of batting, linen, and cotton fabric. Use a square cut out of thin cardboard to trace your pattern onto your fabric and batting first. This will ensure that all of the squares are the same size. Cut the squares out using a sharp pair of fabric scissors. The linen fabric will be on the inside of your box. Consider a solid color for this. The cotton fabric will be on the outside. Consider a coordinating pattern for this. Use thin batting. If you can't find any, iron fusible interfacing to the wrong side of your cotton fabric."
    },
    {
      "title": "Layer your fabric.",
      "content": "Layer your fabric. Set the batting down first. Place the linen fabric on top, right side up. Set the cotton fabric down last, wrong side up. It may look weird now, but it will look fine once you turn everything inside out. [1] X Research source"
    },
    {
      "title": "Stitch the fabric together, but leave a small gap around one of the edges.",
      "content": "Stitch the fabric together, but leave a small gap around one of the edges. Sew around all four edges using a ¼-inch (0.64-centimeter) seam allowance. Leave a 1 ½ to 2-inch (3.81 to 5.08-centimeter) gap along one of the edges so that you can turn the square inside out. [2] X Research source Pin the fabric and batting together with sewing pins first, if necessary. Be sure to remove the pins when you are done."
    },
    {
      "title": "Clip the corners.",
      "content": "Clip the corners. This ensures that your box will have nice, sharp corners. Start by cutting straight across the corners, close to the stitching. Then, cut the seams to either side of the corner at angles to make it narrower. This will help further reduce bulk."
    },
    {
      "title": "Turn the fabric square inside out.",
      "content": "Turn the fabric square inside out. Keep the linen and batting together as you turn the fabric. This way, you will have the linen fabric on one side and the cotton on the other. The batting will be sandwiched in between. Use something long and slender, like a knitting needle, to push the corners out."
    },
    {
      "title": "Press the square using an iron.",
      "content": "Press the square using an iron. Use the cotton setting on the cotton side. Flip the fabric over, and iron it again. This time, use the linen setting, if your iron has one. Ironing the square will get rid of any wrinkles and make the next step easier. Be sure to tuck in the seams from the gap nicely. Use sewing pins to keep the gap closed, if necessary."
    },
    {
      "title": "Topstitch around the square.",
      "content": "Topstitch around the square. Use a ⅛-inch (0.32-centimeter) seam allowance. Be sure to go over the gap that you left earlier. [3] X Research source Backstitch at the start and end of your sewing a few times so that the stitching doesn't come undone. Use a thread color that matches your cotton, and a bobbin color that matches your linen. Consider using a contrasting thread and bobbin color. This will make the top stitching part of the design!"
    },
    {
      "title": "Draw a square in the middle of your fabric using a dressmaker's chalk or pen.",
      "content": "Draw a square in the middle of your fabric using a dressmaker's chalk or pen. The square will make the base of your box. The larger your square is, the shorter your box will be. The smaller your square is, the taller you box will be. For a perfect cube, measure your fabric, and divide it by three. Draw a square in the center according to those measurements."
    },
    {
      "title": "Topstitch around the square at you drew.",
      "content": "Topstitch around the square at you drew. [4] X Research source You can use a matching thread color or a contrasting one. The stitching will help the box \"fold\" properly. Remember to backstitch at the start and end of your sewing! Remove the ink or chalk by gently wiping it with a damp cloth."
    },
    {
      "title": "Fold and stitch the corners.",
      "content": "Fold and stitch the corners. Take the two bottom left edges and fold them together so that they touch. Use an embroidery needle and some embroidery thread to stitch the edges together, ½ inch (1.27 centimeters) from the corner. Repeat this step for the remaining three corners. [5] X Research source You can also glue the corners together with a drop of hot glue or fabric glue. If you use fabric glue, secure the corners with clothespins until the glue dries. You can match the embroidery thread to your fabric, or use a contrasting color for a hint of design."
    },
    {
      "title": "Cut your fabric and interfacing into 15-inch (38.1-centimeter) squares.",
      "content": "Cut your fabric and interfacing into 15-inch (38.1-centimeter) squares. Choose two different colors or patterns of cotton fabric. You can use solid colors, patterns, or a combination of the two. Stack everything together, and cut a 15-inch (38.1-centimeter) square out. Make sure that the two fabrics go well together. One of them will be your main fabric and the other will be your lining."
    },
    {
      "title": "Iron the interfacing to the wrong side of your main fabric.",
      "content": "Iron the interfacing to the wrong side of your main fabric. Follow the instructions that came with your interfacing as each brand will be different. In general, you will need to: pin the interfacing to the wrong side of the fabric, cover it with an ironing cloth, and iron it for 10 to 15 seconds with an iron. Use the coolest setting you can and no steam."
    },
    {
      "title": "Cut a 4½-inch (11.43-centimeter) square from each corner.",
      "content": "Cut a 4½-inch (11.43-centimeter) square from each corner. Stack your main fabric and lining together. Trace a 4½-inch (11.43-centimeter) square into each corner. Cut the squares out using a pair of fabric scissors. You will end up with something that looks like a + sign. To ensure that each square is the same size, use a template cut out of thin cardboard. Discard the squares that you cut out, or save them for another project."
    },
    {
      "title": "Fold the main fabric into a box.",
      "content": "Fold the main fabric into a box. Place the main fabric down with the right side facing you. Bring the left and bottom flaps together, and pin them along the edge. Repeat with the remaining flaps until you have a box. Repeat this step with the lining fabric."
    },
    {
      "title": "Stitch the box together using a ¼-inch (0.64-centimeter) seam allowance.",
      "content": "Stitch the box together using a ¼-inch (0.64-centimeter) seam allowance. Sew the main fabric first, then the lining. Do not stitch the two boxes together just yet."
    },
    {
      "title": "Clip the corners.",
      "content": "Clip the corners. Turn your main fabric box so that the bottom is facing you. Snip the hems at the bottom of each corner. Be careful not to cut through the stitching. Repeat with step with the lining."
    },
    {
      "title": "Place the main fabric box inside the lining box.",
      "content": "Place the main fabric box inside the lining box. Turn the main fabric box right side out. Tuck it inside the lining box. The right sides of both boxes should be touching. You should only see the interfacing and the wrong side of the lining."
    },
    {
      "title": "Sew along the top edge, but leave a small gap for turning.",
      "content": "Sew along the top edge, but leave a small gap for turning. Pin the box together along the top edge. Sew along the top edge using a ¼-inch (0.64-centimeter) seam allowance. Leave a few inch/centimeter wide gap for turning."
    },
    {
      "title": "Turn the fabric inside out through the gap.",
      "content": "Turn the fabric inside out through the gap. When you are done, push the box back into shape. Tuck the lining into the main box, and push out the corners."
    },
    {
      "title": "Press along top edge.",
      "content": "Press along top edge. Set the box down on its side on the ironing board. Press the top hem with an iron. Turn the box onto its other side, and iron it again. Keep doing this until you have ironed all four sides. Tuck the hem in at the gap neatly. Keep the opening shut with sewing pins if you need to."
    },
    {
      "title": "Topstitch along top edge using a ⅛-inch (0.32-centimeter) seam allowance.",
      "content": "Topstitch along top edge using a ⅛-inch (0.32-centimeter) seam allowance. Be sure to backstitch at the start and end of your sewing so that the stitching doesn't come undone. Be sure that you match your thread and bobbin colors to your main and lining fabric colors. Consider using a contrasting thread color for the top stitching. This will make it part of the design!"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}