{
  "url": "https://www.wikihow.com/If-You-Block-Someone-on-Instagram-Will-They-Know",
  "title": "What Happens When You Block Someone on IG: Will They Know?",
  "steps": [
    {
      "title": "Your profile won't appear in search results.",
      "content": "Your profile won't appear in search results. While they can still see your profile, they won't see it in their search results. The person you blocked will still be able to see likes and comments you leave on posts from people they follow and on public posts. [1] X Research source"
    },
    {
      "title": "Their notifications from you will disappear.",
      "content": "Their notifications from you will disappear. For example, if they commented on one of your posts, and you replied to their comment before blocking them, they will have a notification that you replied to their comment. Once you block them, that notification goes away. All that person's comments and likes also disappear from your posts! So, if they are a sleuth and look at all your posts to find their comments from another account, they can figure out that they have been restricted or blocked. Even if you unblock someone that you accidentally blocked, the removed comments and likes will not come back."
    },
    {
      "title": "They can't mention or tag you.",
      "content": "They can't mention or tag you. The person you blocked will no longer be able to \"@\" mention you or tag you anywhere. If they try to tag you and aren't able to do so, they may guess that they've been blocked."
    },
    {
      "title": "They won't be following you anymore.",
      "content": "They won't be following you anymore. When you block someone, they are also removed from your Followers list. So, if they see that they're suddenly not following you, they might know you've blocked them. Do you think you've been blocked? There are some signs that you can look out for ."
    },
    {
      "title": "You can't exchange new messages, but you'll still see old ones.",
      "content": "You can't exchange new messages, but you'll still see old ones. Blocking someone on Instagram makes it so you can no longer send messages to each other. However, if the person you blocked has sent you messages in the past, they'll still be available in your inbox. However, you cannot send or receive new messages from the user while blocked. If you unblock someone later, you won't receive any messages they may have sent you while they were blocked. If you're in a group chat with that blocked user, you will get a pop-up the next time you open that chat that asks you if you want to stay in that group or leave. If you decide to stay, you and the blocked user will be able to see new messages from each other."
    },
    {
      "title": "Their likes and comments will be removed.",
      "content": "Their likes and comments will be removed. Any of their comments or likes on your posts, photos, Stories, or anything that you've shared will disappear. Unblocking that user will not restore those comments and likes. Any comments or likes that you or the blocked user leave on posts by mutual friends or pages will be visible to the other party."
    },
    {
      "title": "You may still hear from them on Facebook.",
      "content": "You may still hear from them on Facebook. If you don't have your Facebook and Instagram accounts linked in Account Center , the blocked person can still call or chat with you on Facebook. In this case, block them on Facebook too. [2] X Research source"
    }
  ]
}