{
  "url": "https://www.wikihow.com/Make-Weather-Instruments",
  "title": "How to Make Weather Instruments",
  "steps": [
    {
      "title": "Be aware of the purpose of a barometer.",
      "content": "Be aware of the purpose of a barometer. A barometer measures changes in air pressure to help forecast the weather, using millibars (mb) or inches of mercury. Air pressure is a very important component of forecasting the weather, but air is microscopic and difficult to read with the naked eye. Air pressure occurs when the weight of tiny particles of air, known as air molecules, pushes down on an area. When air is compressed, it is placed under high pressure and indicates a change in the weather. [2] X Research source When the mercury or needle in a barometer rises, it means the weather is sunny and dry. When the mercury or needle in a barometer falls, this means the weather will be stormy and wet. [3] X Research source"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To make a barometer at home, you will need the following supplies: [4] X Research source A small, empty coffee can Plastic wrap A pair of scissors Tape A straw An index card A rubber band"
    },
    {
      "title": "Cover the top of the coffee can with plastic wrap.",
      "content": "Cover the top of the coffee can with plastic wrap. Then, secure the plastic wrap with a rubber band around the top so it forms an airtight seal over the coffee can. [5] X Research source"
    },
    {
      "title": "Place the straw horizontally on the top of the can.",
      "content": "Place the straw horizontally on the top of the can. One end of the straw should be in the center of the can while the other end extends out over 1 side. [6] X Research source"
    },
    {
      "title": "Write high pressure and low pressure on the index card.",
      "content": "Write high pressure and low pressure on the index card. Divide the card in 2 and write “high pressure” on the top portion of the card. Then, write “low pressure” on the bottom portion of the card."
    },
    {
      "title": "Prop the index card next to the can.",
      "content": "Prop the index card next to the can. The card should sit next to the can with the center line dividing “high pressure” from “low pressure” even with the straw. Once you bring the barometer outside, the straw will indicate whether the pressure is high or low as it rises and falls. You may want to tape the card to a rock or something else to keep it stable. [7] X Research source"
    },
    {
      "title": "Record when the straw rises and falls.",
      "content": "Record when the straw rises and falls. Note where the straw sits on the index card, in “high pressure” or “low pressure” when you first attach it to the can. Place the can outside and note when it rises or falls. [8] X Research source High pressure will cause the plastic wrap to dip, leading to a rise in the straw. Low pressure will cause the plastic wrap to puff up, leading to a drop in the straw."
    },
    {
      "title": "Recognize the purpose of an anemometer.",
      "content": "Recognize the purpose of an anemometer. An anemometer helps weather scientists to measure wind speed. This instrument rotates at the same speed as the wind and provides a direct measurement of the speed of the wind. [9] X Research source Wind speeds are typically measured using the Beaufort Wind Scale, with a 0-12 scale based on visual cues. You can learn to identify calm, gentle, moderate, and strong breezes with your homemade anemometer."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To make an anemometer, you will need the following supplies: [10] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source 4 plastic cups of the same color, such as Dixie or Solo cups 1 plastic cup of a different color 2 long strips of stiff cardboard A pen A pencil with an eraser on one end A ruler A stapler A push pin A watch with a second hand or timer A small fan A calculator"
    },
    {
      "title": "Place the cardboard strips on top of each other to form a plus sign.",
      "content": "Place the cardboard strips on top of each other to form a plus sign. Then, use the stapler to staple them together. Staple them in the center of the plus sign so they hold their shape."
    },
    {
      "title": "Attach 4 cups to the ends of the cardboard pieces.",
      "content": "Attach 4 cups to the ends of the cardboard pieces. Use the different colored cup as one of the 4 cups. Staple the cups onto the cardboard so they are on their sides, facing the same direction in relation to the cardboard pieces. [11] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source"
    },
    {
      "title": "Place the pushpin through the center of the cardboard pieces.",
      "content": "Place the pushpin through the center of the cardboard pieces. Then, push the eraser part of the pencil into the pin sticking out of the center of the cardboard pieces. Use the scissors to poke a small hole in the bottom of the remaining cup. Slide the pencil into this cup. The anemometer should now stand upright, supported by the pencil in the cup. There should be 4 cups on the ends of the cardboard pieces, all on their sides and facing the same way."
    },
    {
      "title": "Set up the fan a few feet away from the anemometer.",
      "content": "Set up the fan a few feet away from the anemometer. Then, turn it on at low speed. Use the stopwatch to count the number of rotations that occur in 15 seconds. Multiply this number by 4 to determine the number of rotations per minute. [12] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source Use the different colored cup as a marker for 1 rotation, where 1 rotation is every time the different colored cup comes all the way around. This will help you to count the rotations accurately. You can also test the anemometer outside to get an air pressure reading. Make a chart that has 2 columns, 1 for the time interval and 1 for the number of spins. You can then record the time interval and the number of spins within that time interval."
    },
    {
      "title": "Be aware of the purpose of a sling psychrometer.",
      "content": "Be aware of the purpose of a sling psychrometer. This instrument measures how much moisture is in the air or the relative humidity in an environment. It uses the cooling effect of evaporation to determine the relative humidity. [13] X Research source Relative humidity is the ratio of water vapor in the air relative to the amount that could possibly be there, at a certain temperature. When you walk through fog, for example, you are experiencing 100% humidity. If you walk through a desert, you are experiencing around 10% humidity. [14] X Research source"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To make your own sling psychrometer at home, you will need: [15] X Research source Cotton gauze, in pads rather than balls A pair of scissors A small rubber band A ½ liter empty plastic soda bottle Clear plastic tape 2 red alcohol Celsius thermometers Water An 18 in (46 cm) piece of string"
    },
    {
      "title": "Wet a double layer of cotton gauze.",
      "content": "Wet a double layer of cotton gauze. Use the water to moisten the gauze. This will help you capture moisture in your sling psychrometer. Cover 1 bulb of the thermometers with the wet gauze using a rubber band."
    },
    {
      "title": "Attach the thermometers to the plastic bottle.",
      "content": "Attach the thermometers to the plastic bottle. Take the thermometer covered in gauze and place it on 1 side of the plastic bottle. Then, secure it there with tape. [16] X Research source Take the other thermometer and attach it to the other side of the bottle using tape. Make sure you can still see the numbers and the red alcohol in the thermometers."
    },
    {
      "title": "Tie the string to the top of the bottle.",
      "content": "Tie the string to the top of the bottle. Make sure the string is tied well on the top of the bottle, as you will be holding it and spinning it to get a reading on your sling psychrometer. [17] X Research source Hold tightly to the end of the string and spin the bottle in a circle in an open-air space. Do this for 1 minute. Then, record the temperatures on both thermometers."
    },
    {
      "title": "Determine the difference between the 2 temperatures.",
      "content": "Determine the difference between the 2 temperatures. Record the 2 temperatures and then subtract the lower temperature from the higher temperature to determine the temperature difference. You will likely find that the thermometer with the wet gauze will always have a lower temperature than the thermometer with the dry bulb. [18] X Research source The wet bulb temperature will always be lower than the dry bulb because water evaporates from the wet bulb when you spin the 2 thermometers. The evaporation then cools the wet bulb. The drier the air is, the more water will evaporate from the wet bulb, leading to a higher temperature difference between the wet and dry bulb. For example, you spin the sling psychrometer outside and the dry thermometer has a temperature of 22 degrees Celsius. You get a wet bulb temperature reading of 12 degrees Celsius. If the weather is very humid one day, you may get a dry bulb temperature of 22 degrees Celsius and a wet bulb temperature of 21 degrees Celsius. Because there is very little water evaporation on the wet bulb, this indicates that there is high humidity outside."
    },
    {
      "title": "Recognize the purpose of a wind vane.",
      "content": "Recognize the purpose of a wind vane. This instrument will help you determine the direction from which the wind is blowing. The direction of the wind is an important element of predicting the weather, as the wind brings the weather to a certain area. [19] X Research source The wind vane works by spinning and pointing in the direction from which the wind is blowing. This instrument has 2 parts or ends, 1 that is shaped like an arrow and turns into the wind and 1 wide end that catches the breeze. The arrowed end will indicate which direction the wind is blowing, for example, North, South, East, or West. You must be aware of where North, South, East, and West are relative to your location to use a wind vane properly."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To make a wind vane at home, you will need the following supplies: [20] X Research source A manila file folder A pin A pair of scissors Glue A pencil with an eraser A straw Modeling clay A paper plate"
    },
    {
      "title": "Make the arrow.",
      "content": "Make the arrow. Use the manila folder to cut out an arrow point that is 5 centimetres (2.0 in) long and 5 centimetres (2.0 in) wide at the base. Then, cut out a tail for the arrow that is 7 centimetres (2.8 in) long and 7 centimetres (2.8 in) wide. [21] X Research source Take the straw and make 1 centimetre (0.39 in) cuts on each end of the straw. Form the arrow by sliding the arrow point on 1 end of the straw and the arrow tail on the other end of the straw."
    },
    {
      "title": "Create the base of the wind vane.",
      "content": "Create the base of the wind vane. Do this by pushing the pin through the middle of the straw and then into the eraser on the pencil. [22] X Research source Push the sharp end of the pencil into a small lump of modeling clay to form the base of the wind vane."
    },
    {
      "title": "Note the 4 wind directions on the paper plate.",
      "content": "Note the 4 wind directions on the paper plate. Take the paper plate and write the 4 directions, North, South, East, and West on each end of the plate. Place the clay base, with the arrow attached, in the center of the paper plate."
    },
    {
      "title": "Try out the wind vane.",
      "content": "Try out the wind vane. You can do this by blowing directly on the wind vane and noting if the arrow spins freely when you blow on it. You can also use a compass to determine the wind direction outside. Do this by placing the wind vane and the plate outside on a flat surface. Then, use the compass to determine where North is and set the plate so it faces the correct direction. Observe the wind vane. If it becomes very windy, hold down the paper plate so the vane does not blow away. Note the direction the arrow points to as the wind blows and check the direction on the paper plate to determine the wind direction outside. For example, if the arrow is pointing west, the wind is blowing from the west."
    },
    {
      "title": "Recognize the purpose of a rain gauge.",
      "content": "Recognize the purpose of a rain gauge. This instrument will help you determine the amount of rainfall within a specific period of time. The amount of rainfall is important in meteorology because it lets weather scientists know how much rainfall there was for a specific day or period of time and provides information on changes in rainfall from year to year or season to season. [23] X Research source"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To make a rain gauge at home, you will need the following supplies: [24] X Research source An empty, cylindrical jar that is clear, such as an olive jar A clear plastic ruler A rubber band A plastic funnel Clear tape"
    },
    {
      "title": "Attach the ruler to the jar.",
      "content": "Attach the ruler to the jar. You can do this by attaching it to the outside of the jar with a rubber band. Check to ensure the bottom edge of the ruler is flush with the bottom of the jar and you can read the ruler measurements clearly. [25] X Research source Another option is to tape the ruler inside the jar so it stands vertically, with the end at the bottom of the jar. Make sure you can read the numbers on the outside of the jar."
    },
    {
      "title": "Put the funnel in the jar.",
      "content": "Put the funnel in the jar. The funnel should sit in the top of the jar so the funnel covers the entire mouth of the jar. This will ensure water goes through the funnel and does not spill on either side of the jar. [26] X Research source"
    },
    {
      "title": "Test the rain gauge.",
      "content": "Test the rain gauge. If you do not have access to a climate that has heavy rainfall throughout the year, you can test the rain gauge by using tap water. You can run tap water through the rain gauge and take down a measurement of the water. If it is going to be a rainy day, leave the rain gauge outside in a safe spot that is not covered by trees or other obstructions that can block the rain. Take a reading after each rainfall. Make sure you empty the rain gauge after every reading to ensure your measurements are accurate."
    }
  ]
}