{
  "url": "https://www.wikihow.com/Kill-Fleas-With-Dawn-Dishsoap",
  "title": "How to Kill Fleas With Dawn Dishsoap",
  "steps": [
    {
      "title": "Fill the bathtub with lukewarm water around 70 °F (21 °C).",
      "content": "Fill the bathtub with lukewarm water around 70 °F (21 °C). This temperature will be warm enough to keep your pet comfortable without shocking it. Fill the bathtub so that the water only comes up to around your pet’s stomach. [1] X Research source For example, if the bottom of your pet’s belly is about 1 foot (0.30 m) off the ground, then you should fill the tub with about 1 foot (0.30 m) of water. If you’re washing a smaller animal, such as a ferret , fill a large bucket with lukewarm water instead of a bathtub."
    },
    {
      "title": "Soak your pet in the bath so that all of its fur is wet.",
      "content": "Soak your pet in the bath so that all of its fur is wet. Avoid getting any water in your pet’s eyes or ears, since it may irritate them. Make sure all of the fur is completely soaked through before proceeding. [2] X Research source This is especially important for pets with thick fur, since it will take more water for them to get completely soaked."
    },
    {
      "title": "Apply the soap to your pet’s fur until it’s completely lathered.",
      "content": "Apply the soap to your pet’s fur until it’s completely lathered. The amount of soap you use will depend on how large your pet is, as well as how badly it’s infested with fleas . Start with a small quantity of dish soap (e.g., around 2 to 3 teaspoons (9.9 to 14.8 mL)) and add additional dish soap as needed. Start applying the soap at the neck and work your way down towards the tail. [3] X Research source Avoid getting any of the soap in your pet’s eyes or ears. Be gentle while scrubbing, but make sure you scrub deeply enough to get to the skin where the fleas will hide. If the pet cries, you're scrubbing too roughly. If your pet’s coat is particularly thick, try using a pet brush to get the soap deep down into its fur."
    },
    {
      "title": "Wait 5 minutes, then rinse all of the soap off of your pet’s fur.",
      "content": "Wait 5 minutes, then rinse all of the soap off of your pet’s fur. Allow about 5 minutes for the dish soap to completely kill the fleas before you begin rinsing. Use a cup of water or a handheld shower head to wash the soap off. Start from the top of your pet’s body and work your way down towards the tail. For best results, use a flea comb to brush your pet’s fur as you rinse off the soap to make sure you’re removing as many fleas as possible. You may need to spray a lot of water in a single area in order to completely rinse off all of the dish soap. Be very cautious when washing around the eyes. If contact with the eyes occurs, rinse them with cool water and dry them with a towel."
    },
    {
      "title": "Empty the bathtub and dry off your pet with a towel when you’re done.",
      "content": "Empty the bathtub and dry off your pet with a towel when you’re done. Once you stop seeing live fleas in your pet’s fur, drain the water out of the tub. Gently rub your pet with a towel until it’s completely dry. [4] X Research source You can also use a hair dryer on low heat to dry your pet, although it’s much safer to simply use a towel. To be extra safe, run a flea comb over your pet’s fur once they’re completely dry to check for any fleas you may have missed during the bath. A cat will likely be very tense from this experience and will probably run away from you immediately. Be careful as you dry it off to avoid getting scratched."
    },
    {
      "title": "Repeat this process if you still see fleas on your pet.",
      "content": "Repeat this process if you still see fleas on your pet. Some fleas may have escaped your initial washing or simply survived exposure to the dish soap. Keep in mind that fleas will run to the head and face to hide. This means you will probably have to add a tiny drop of detergent to your pet’s head on your second washing. [5] X Research source You may need to wash your pet 1 or 2 extra times, depending on the severity of their flea infestation. If you notice more fleas within a couple of days after bathing, simply repeat the process every couple of days, then use a flea medication to finish them off. You can either give your pet a flea collar or apply a topical flea solution like Frontline Plus to your furry friend. To make sure your home is completely rid of fleas , vacuum your flooring and upholstery frequently (at least once a day) to kill any fleas and flea eggs that survived your pet’s bath."
    },
    {
      "title": "Fill a spray bottle with lukewarm water around 70 °F (21 °C).",
      "content": "Fill a spray bottle with lukewarm water around 70 °F (21 °C). This temperature will help keep your pet from being shocked or scalded by the water. If you don’t have a thermometer, aim to use water that is around room temperature to keep your pet as comfortable as possible. [6] X Research source This method is particularly useful for cats , rabbits, or any other animals that generally don’t like being given baths. If you don’t have a spray bottle , you can also simply mix warm water with some dish soap and use a flea comb dipped in this mixture to keep your pet’s fleas. However, this won’t be as effective as using a spray bottle to apply the mix."
    },
    {
      "title": "Hold your pet down and use the spray bottle to get its fur wet.",
      "content": "Hold your pet down and use the spray bottle to get its fur wet. You can either wrap your pet in a towel to keep it from moving or gently hold it down by its neck. Be very gentle when holding your pet down; remember that this might be very stressful for them! [7] X Research source Make sure your pet’s fur is completely soaked through before moving on to the next step. Be sure to avoid getting water in your pet’s eyes or ears, since this will irritate them."
    },
    {
      "title": "Rub the dish soap into your pet’s fur until it’s completely lathered.",
      "content": "Rub the dish soap into your pet’s fur until it’s completely lathered. Use around 2 to 3 teaspoons (9.9 to 14.8 mL) of dish soap to begin with and add more as needed. Start applying the soap at the neck and work your way down towards the tail. Make sure to rub the soap deep enough into the fur so that it reaches your pet’s skin. [8] X Research source Fleas typically live and lay their eggs close to an animal’s skin, so it’s important that you make sure the dish soap reaches all the way down to your pet’s skin to kill all of the fleas. If your pet has really thick fur, you may need to apply a bit more dish soap to make sure you’re reaching down to the skin."
    },
    {
      "title": "Wait 5 minutes, then use the spray bottle to wash the soap off your pet.",
      "content": "Wait 5 minutes, then use the spray bottle to wash the soap off your pet. Start from the top of your pet’s body and work your way down toward the tail. For best results, use a flea comb to brush your furry friend’s hair as you rinse off the soap to make sure you’re removing as many fleas as possible. Note that you may need to spray a lot of water on a single area in order to get all the soap off."
    },
    {
      "title": "Dry off your pet with a towel and carefully release it from your grasp.",
      "content": "Dry off your pet with a towel and carefully release it from your grasp. Your pet may be especially tense after this process, especially if it’s a cat. It may even run away from you after you release it. Be careful as you release your pet to avoid being scratched or otherwise injured. [9] X Research source Don’t take this behavior personally; your furry friend will be back to normal soon, especially when the food gets put out!"
    }
  ]
}