{
  "url": "https://www.wikihow.com/Make-a-Bun-for-Short-Hair",
  "title": "How to Make a Bun for Short Hair",
  "steps": [
    {
      "title": "Gather your hair into a high ponytail.",
      "content": "Gather your hair into a high ponytail. Use a comb to gather your hair high on your head, either right on top or slightly lower down, according to what you enjoy. Secure your hair with a hair elastic. Make sure it is tightly secured, so your hair won't fall out. [1] X Research source You might want to use some bobby pins or hair spray to keep your hair in place at the top of your head. If you really need the bun to stay firm, make sure to do a secure ponytail, but know that there's no need to make it overly tight. This works well for hair that is long enough to be secured at the top of your head. If your hair is too short, choose a low bun or a side bun instead."
    },
    {
      "title": "Tease your ponytail with a comb.",
      "content": "Tease your ponytail with a comb. This will add some volume and texture to your bun. Take a section of your ponytail and hold it out straight. Place a comb near the tips and backcomb toward your head, gently teasing your hair. Repeat with a new section until your whole ponytail has been teased. Use a fine-toothed comb instead of a brush, since it's less damaging to hair. You can skip this step if you prefer a sleek, glossy bun; however, it will be smaller with less volume."
    },
    {
      "title": "Divide your ponytail into two sections.",
      "content": "Divide your ponytail into two sections. Simply gather it into two equal sections, so that your ponytail resembles a fishtail. You want each one to have the same amount of hair."
    },
    {
      "title": "Twist one section down and pin the ends.",
      "content": "Twist one section down and pin the ends. Twist it downward and tuck it under the ponytail, so that it curves around like a crescent moon. Pin the ends under using several bobby pins. This creates the first half of the bun shape. Don't twist your hair too tightly, or it might spring out of the bobby pins. Just do one or two gentle twists to give the appearance of a ballerina-style bun. Make sure the ends are tightly secured and tucked up under the ponytail, so they won't show."
    },
    {
      "title": "Twist the other section up and pin the ends.",
      "content": "Twist the other section up and pin the ends. Take the remaining section and twist it up and over the ponytail, then tuck in the ends and secure them in place with several bobby pins. Now the other half of your bun has been created. Again, just do a gentle twist, rather than twisting so tightly that your bun might spring out of place. Check the ends in the mirror to make sure they're secured out of view."
    },
    {
      "title": "Tuck in loose ends and spray the bun with hairspray.",
      "content": "Tuck in loose ends and spray the bun with hairspray. Check the back of your hair in a mirror to see if there are any loose spots that need to be tucked in, and use more bobby pins if necessary. Finish the look with plenty of hairspray so it won't come loose. [2] X Research source For a fuller look, use your fingers to poof out the bun a little so it has more volume. It's pretty to pull out a few pieces toward the front of your hair to frame your face."
    },
    {
      "title": "Gather your hair at the nape of your neck.",
      "content": "Gather your hair at the nape of your neck. Use a ponytail holder to secure it tightly in place. This type of bun works very well with even very short styles, as long as you can gather it all into a ponytail holder. If you want a side bun, gather your hair to the right or the left instead of right in the center. A side bun is a pretty look for a dance, party or elegant dinner. [3] X Research source"
    },
    {
      "title": "Tease your ponytail with a comb.",
      "content": "Tease your ponytail with a comb. Hold out your ponytail and tease it with a comb by backcombing it section by section. This will add volume to your bun and create a classic \"messy\" appearance. If you'd prefer not to go with a messy look, you can skip this step."
    },
    {
      "title": "Pin your hair next to the ponytail holder.",
      "content": "Pin your hair next to the ponytail holder. Take a small section of hair and curl it under, then use a bobby pin to secure the ends right next to your ponytail holder. Continue taking sections of hair and pinning them under until all of your hair has been pinned under and the ends are tightly secured. [4] X Research source Leave a few strands loose if you want the look to be messier. For a neater appearance, divide the ponytail into two equal sections, twist each section, and pin the ends under. This will create a low ballerina-style bun."
    },
    {
      "title": "Use hairspray to keep your hair in place.",
      "content": "Use hairspray to keep your hair in place. Spray it over the bun and the rest of your hair so your low bun doesn't come undone."
    },
    {
      "title": "Prep your hair with gel or mousse.",
      "content": "Prep your hair with gel or mousse. Applying gel or mousse will give your hair a slightly wet, glossy appearance as well as helping it stay in place. Rub a dime-sized amount of gel or mousse between your palms and apply it from the roots to the tips, making sure it's evenly distributed. If you prefer a matte appearance, you can skip this step."
    },
    {
      "title": "Gather your hair low on your head.",
      "content": "Gather your hair low on your head. Use a comb to comb your hair back tightly to create a smooth appearance. Secure it in a ponytail either at the nape of your neck or slightly higher up, depending on where you want your bun to sit,"
    },
    {
      "title": "Cinch your ponytail and use a second holder to secure it.",
      "content": "Cinch your ponytail and use a second holder to secure it. Hold your ponytail straight and then fold it in half, cinching it so that it forms a small loop-shaped bun. Secure the bun with a second ponytail. The ends of the bun will be sticking out close to the nape of your neck."
    },
    {
      "title": "Use hairspray to hold the style in place.",
      "content": "Use hairspray to hold the style in place. Spray the bun and the rest of your hair liberally so it won't fall out of place. [5] X Research source"
    }
  ]
}