{
  "url": "https://www.wikihow.com/Make-a-Baby-Laugh",
  "title": "How to Make a Baby Laugh",
  "steps": [
    {
      "title": "Play up the absurd.",
      "content": "Play up the absurd. Babies as young as 9 months know when something's amiss. [1] X Research source For instance, if you put a pan on your head, your kid will realize something's wrong and will likely find it funny. Try funny faces. Pull funny faces by making your eyes wider and pulling out your lips or sticking out your tongue. Your kid will find it silly and funny. [2] X Research source Babies that are 6 months will find this especially hilarious because they think anything silly or out of the ordinary is funny. Try different noises to see what your baby finds funny. [3] X Research source If you want your baby to keep laughing, change your facial expression to something else. Laugh in response."
    },
    {
      "title": "Make funny movements.",
      "content": "Make funny movements. You can do things such as dancing, clapping, or other gestures to make your baby laugh. Use a hand puppet. Making a hand puppet dance and sing for your baby will make him giggle. Making funny hand gestures isn't usual, and your baby will notice. It's funny because your baby doesn't expect it to happen."
    },
    {
      "title": "Try making funny noises or singing songs.",
      "content": "Try making funny noises or singing songs. Babies love unusual sounds. They will get your baby's attention. [4] X Research source Sing a song. Any song that has hand or body gestures will make your baby giggle. Try the \"Itsy-Bitsy Spider\" or even the \"Hokey Pokey.\" Play a funny sound. Kids like sounds that are odd or silly, such as farting noises. You may have to try different noises to see what your baby finds funny. Kids also love animal sounds, so try copying the family cat or dog. Try not to make these sounds too loud or startling. This might scare the baby!"
    },
    {
      "title": "Try physical games with lots of touch and fun noises.",
      "content": "Try physical games with lots of touch and fun noises. These kinds of games help to build a physical bond between you and your baby, and serve to make him laugh and be happy. [5] X Research source Tickle your baby. Babies often find tickles funny, but keep them to a minimum. Too much can be annoying to your baby. Chase your baby. If your baby is crawling, get down on the floor and crawl after her. Make sure you're smiling so that your baby knows it's a game. [6] X Research source Kiss your baby, and make raspberries. By blowing bubbles on his tummy or face, you'll get a laugh out of your baby. You can also try kissing her toes or fingers. [7] X Research source Capture his nose. Pretend you're stealing his nose, and show him your thumb between your fingers (his \"nose\"). He'll giggle at the thought."
    },
    {
      "title": "Start playing when your baby is happy.",
      "content": "Start playing when your baby is happy. Make sure you are in a good mood yourself. [8] X Research source Babies can mimic laughter even at an early age. Many babies laugh out loud for the first time at 3-4 months of age. Babies will laugh in response to bright colors, toys, and other people's laughter."
    },
    {
      "title": "Recognize that even younger infants will smile and laugh at simple game.",
      "content": "Recognize that even younger infants will smile and laugh at simple game. Peekaboo can be important for object permanence development in infants six months and older. Object permanence is when the baby recognizes that objects and events still exist even when they can't be seen or heard. Playing peekaboo is a great way to exercise this cognitive development. It can also be a great way for younger kids to play with a younger sibling or relative."
    },
    {
      "title": "Show the baby an object.",
      "content": "Show the baby an object. It should be one of their toys such as a teething ring or a ball they can grab. Allow the baby to examine the toy for a minute or two. Let them touch it and grab at it to explore. After a few minutes, cover the object with a cloth. If a baby has object permanence, they will be able to pull the cloth off and find the object. Pull the cloth off and smile. This will often make the baby laugh or giggle, as you have made the object re-appear."
    },
    {
      "title": "Do the same with faces.",
      "content": "Do the same with faces. Start by smiling at your baby and talking to him in a sweet voice. Cover your face with your hands and say \"Where's Mommy?\" or \"Where's _____? Pop back out and say \"Peekaboo! I see you!\" Keep your voice happy and stay smiling. Remember, the goal is to get the baby to laugh and not scare the baby."
    },
    {
      "title": "Get other children to join in the game.",
      "content": "Get other children to join in the game. This is a great way for a brother or sister to connect with a younger sibling. This is one of the games that older children love to play with babies. Both the baby and the older child get automatic feedback from one another. The baby enjoys the game and this allows the older child to establish a bond with the baby."
    },
    {
      "title": "Be aware that this is a rhyming game that has hand motions that go along with a short poem.",
      "content": "Be aware that this is a rhyming game that has hand motions that go along with a short poem. This may be better for older babies that can mimic your body movements and some simple words. [9] X Research source Even younger babies may get a huge kick out of this game. Babies tend to like sounds that rhyme. Babies will unconsciously begin to mimic your smile and laughter at 3 months. Playing games such pat a cake using happy sounds can bring out a laugh from baby."
    },
    {
      "title": "Start the game by saying the first line.",
      "content": "Start the game by saying the first line. As you say the line, you will need to do the right hand movements. [10] X Research source The first line of the poem is \"Pat a cake, pat a cake, baker's man.\" As you say the line you will want to clap your hands. You can alternate by patting your palms on your thighs. With older babies, you can gently help your child clap along with the rhyme."
    },
    {
      "title": "Continue with the poem.",
      "content": "Continue with the poem. The second line reads \"Bake me a cake as fast as you can\". [11] X Research source Continue to clap and pat your thighs as you say the second line. Alternatively, you can gently help an older baby to follow along with the hand motions. Keep your tone bright and enthusiastic with a big smile on your face. As your baby laughs, respond with laughter. This will just increase the fun! [12] X Research source"
    },
    {
      "title": "Finish the poem.",
      "content": "Finish the poem. The last lines are as follows: [13] X Research source \"Roll it. Pat it. And mark it with a B. And put it in the oven for baby and me!\" When you say \"roll it\", roll your arms in a circle. When you say \"pat it\", pat your hands on your lap. When you say \"Mark it with a B\", draw a B in the air with your finger. When you say \"put it in the oven\", mimic the action of putting a cake in the oven."
    },
    {
      "title": "Repeat as many times as your baby is amused.",
      "content": "Repeat as many times as your baby is amused. Children love repetitive games. [14] X Research source Many babies will find this amusing over and over again. It can be a good way to distract an unhappy child. As your child gets older, try to make them do the hand motions with you. This can help them to learn ordered play and coordination."
    },
    {
      "title": "Know that this little piggy can amuse younger and older babies.",
      "content": "Know that this little piggy can amuse younger and older babies. In this game, you touch each toe as you say a line about a different little pig. [15] X Research source Younger babies will enjoy the sound of the rhyming and the touching of the toes. Older children, as they begin to understand words and animals, will be able to relate to the words of the rhyme. This can help you introduce some vocabulary words and body parts to a toddler or older baby (12-15 months)."
    },
    {
      "title": "Start by touching one of your baby's big toes.",
      "content": "Start by touching one of your baby's big toes. Say the first line of the rhyme. [16] X Research source It is \"This little piggy went to market\". Wiggle his/her big toe as you say the line. Laugh and smile after say the line, this might get a reaction from your baby."
    },
    {
      "title": "Continue to the second, third, and fourth lines of the poem.",
      "content": "Continue to the second, third, and fourth lines of the poem. These are as follows: [17] X Research source \"This little piggy stayed home\". \"This little piggy had roast beef.\" \"This little piggy had none.\" As you say each line progress to the next toe and wiggle it. As you wiggle the toes, this might tickle the baby a little and cause him to laugh."
    },
    {
      "title": "Say the last line of the poem.",
      "content": "Say the last line of the poem. You should land on the pinky toe as you say this line. The last line of the poem is \"And this little piggy went wee, wee, wee, wee all the way home!\" As you say the last line wiggle your baby's pinky toe. Then tickle all the way up to his tummy. For older children, you can build their vocabulary by adding new verses and effects. “This little piggy made his house of cotton, this little piggy made his house of string, This little piggy used a little of everything...” Describing all the materials of shoes or socks. You can be inventive in adding new endings. “Then all the little piggies got eaten by a great big wolf, Om nom nom nom!” - nibbling the child’s toes. Or you can just extend the last line itself. “And this little piggy—that’s right, this one, no, not that one, not that one either, but this very tiny little piggy right here on the end, oh yes, this little piggy—went wee, wee, wee all the way home!”"
    }
  ]
}