{
  "url": "https://www.wikihow.com/How-Long-Does-a-Twitter-Suspension-Last",
  "title": "How Long Does a Twitter Suspension Last? What to Do When You Get Suspended from Twitter",
  "steps": [
    {
      "title": "X uses read-only mode to put users in “time-out”.",
      "content": "X uses read-only mode to put users in “time-out”. This might happen if you’ve gotten into a heated argument with another user and things get out of hand. If this happens, you’ll still be allowed to log in and browse X, but you won’t be able to post, reply, or like anything until the read-only period ends. [1] X Research source If X has put you in read-only mode, there’s not much you can do except wait it out. However, you can always contact X support to get answers or make a case for lifting the restriction early: https://help.x.com/en/forms . Many users who have experienced this kind of suspension report that it usually lasts around 48 hours. However, the length of time varies based on the reason for the suspension and how many times you’ve been suspended before."
    },
    {
      "title": "X might ask for verification if they suspect you’re a bot.",
      "content": "X might ask for verification if they suspect you’re a bot. This can also happen in cases where your account has been flagged as a spam bot, if X seems to think you’re lying about who you are, or if X wants to confirm you’re a real person. If this happens, you’ll see a prompt to provide your phone number or confirm your email address when you log in. Follow the prompts to verify who you are. [2] X Research source When you log in, you’ll see a message saying that your account has been locked for security reasons. Click “Start” to begin the verification process and unlock your account. [3] X Research source After you enter your phone number, you’ll get a text or a phone call a few minutes later with a verification code. Enter the code on the X platform app or website in the account verification window to unlock your account. You should be able to start using X again right away once you verify your info. If not, no sweat—you can always contact the X support team for help. [4] X Research source"
    },
    {
      "title": "X might temporarily lock your account if you break the rules.",
      "content": "X might temporarily lock your account if you break the rules. In these cases, X may prompt you to take certain actions in order to get full access to your account again. When you log in on the X website or app, look for a notification saying, “We’ve temporarily limited some of your account features.” The message may also list the reasons your account was locked and give instructions about how to unlock it. Click “Start” on the notification and follow the prompts. For instance, you might need to: [5] X Research source Provide your phone number or verify your email address. Delete or edit the rule-breaking tweet that caused X to lock your account. In some cases, you’ll only be given the option to wait a certain amount of time until your account is restored."
    },
    {
      "title": "Notices and restrictions aren’t suspensions, but they do limit you.",
      "content": "Notices and restrictions aren’t suspensions, but they do limit you. In the old days of Twitter, you were either banned, suspended, or free to use the platform like anyone else. Now, there are a few “in-between” conditions that can be permanently placed on your account. [6] X Research source These types of restrictions include: Media policy restrictions. These accounts either pretend to be official news sources or they post false news repeatedly. Sensitive/mature content. Aka NSFW accounts, these notices will automatically blur photos you post and may keep your account invisible if certain users search for you. State-based media affiliates. This is a new X feature; any account with an affiliation to another country’s media apparatus will have a special warning on their page. Spam accounts. These are probably the most common notices. If your account is flagged as spam, your comments and posts will be hidden behind a spam filter. You can tell if your account is flagged as spam by viewing any post you’ve commented on from another account. If your comment is hidden behind a “see probable spam” button at the bottom of a thread, your account is flagged as spam. This is not functionally different from a shadowban, but Twitter does not have an official shadowban policy."
    },
    {
      "title": "This will happen if you repeatedly break the rules.",
      "content": "This will happen if you repeatedly break the rules. Breaking certain rules for the first time can also result in an immediate, permanent suspension—for example, this could happen if you post threatening or illegal content. [7] X Research source In these cases, your account won’t come back unless you can convince the X moderation team that they made a mistake. [8] X Research source If this happens, you’ll see a notice that your account is suspended next time you log into X, along with an explanation of why the suspension happened. [9] X Research source You’ll also get an email explaining the source of your ban, too. Other users will also see a notice that your account is suspended if they try to view your tweets."
    },
    {
      "title": "You may be able to convince X support to lift the suspension.",
      "content": "You may be able to convince X support to lift the suspension. To appeal your suspension, log in with the username and password for your suspended account. You may see an option to contact the support team and appeal their decision. If not, you can also visit the X contact page and submit an appeal using this form . Describe the issue in as much detail as possible, and explain why you think the suspension was a mistake. All appeals are reviewed by X’s support staff, so it might take a few days to several weeks for you to get an answer. [10] X Research source Try to be patient—this could take a while if they’re especially busy. You’ll need to provide your name and an email address where the X support team can contact you about their decision. You can also provide a phone number if you like, but this is optional."
    },
    {
      "title": "Some of the rules are more obvious than others.",
      "content": "Some of the rules are more obvious than others. If you’re not sure what you’re allowed to post on X, check out the list of rules here: https://help.x.com/en/rules-and-policies/x-rules . Be careful to follow X’s rules and community guidelines to keep your account from getting locked or even permanently suspended in the future. For example, in addition to the obvious rules (like not posting anything threatening, illegal, or abusive), X also requires that you: [11] X Research source Don’t disclose other people’s private information without permission (aka doxing people). Are honest about who you are. You cannot pretend to be someone else in order to intentionally deceive other users. Avoid posting misinformation or media that has been manipulated in a misleading way. Respect the intellectual property of others. Don’t repost copyrighted or trademarked material without permission."
    }
  ]
}