{
  "url": "https://www.wikihow.com/Lose-Weight-if-You-Dislike-Vegetables",
  "title": "How to Lose Weight if You Dislike Vegetables",
  "steps": [
    {
      "title": "Talk to your doctor.",
      "content": "Talk to your doctor. Speaking to a doctor prior to a new diet or weight loss plan is a good idea. They may be able to give you alternative diets or suggest vitamin or minerals to supplement your diet with since you'll be avoiding or minimizing your vegetable intake. Review your current weight, weight goals, medications and health history with your doctor. Your doctor also may be able to refer you to a local dietitian for additional help."
    },
    {
      "title": "Meet with a registered dietitian.",
      "content": "Meet with a registered dietitian. These nutrition experts will be able to guide you on your weight loss diet. They'll also be able to help provide you with different alternatives for vegetables. Ask your dietitian for help designing a meal or eating plan that doesn't focus heavily on vegetables but that could still produce weight loss. To find a dietitian in your area, visit the EatRight website and click on the orange \"Find an Expert\" button on the top right."
    },
    {
      "title": "Write down and track your goals.",
      "content": "Write down and track your goals. Setting goals for yourself with a weight loss plan can help you keep you on track and help you stay motivated. Be specific with your goals. You want to set goals that are specific and realistic for you. Also give yourself an end date. Remember, a large amount of weight loss in a short period of time is not realistic or healthy. Focus on losing smaller amounts of weight over longer periods of time. Realize that with a lack of vegetable consumption (and subsequent fiber consumption), weight loss may be slower. Set smaller goals before your long-term goals. For example, if you want to lose 20 pounds in five months, a smaller goal would be to lose four pounds within the first month."
    },
    {
      "title": "Write your weight-loss meal plan.",
      "content": "Write your weight-loss meal plan. Meal plans can help making dieting and weight loss a bit easier. You'll have your own plan to follow throughout the week. Having all your meals and snacks planned can help keep you organized and focused. Spend some free time writing up an entire week's meals and snacks. It's much easier to stick to a diet when you have a plan in place. Although you may be avoiding or minimizing the amount of vegetables that you include in your meal plan, make sure you're including all the other food groups: fruits, protein, dairy and whole grains. Be sure to plan for quick meals, easy-to-cook items, or meals that require little cooking if necessary. You want to be realistic with your meal plan. If a scratch-made dinner isn't realistic each night, make sure to account for that."
    },
    {
      "title": "Measure your portion sizes.",
      "content": "Measure your portion sizes. With any weight loss plan, it's important to measure your portion sizes. If you overeat, even relatively healthy foods, you can gain weight. Decreasing your portion sizes can be a fairly simple way of decreasing your overall calorie intake, which can result in weight loss. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When planning and serving your meals and snacks, follow these standard portion sizes: 1 serving of fruit is 1/2 cup or 1 small whole fruit, 1 serving of grains is 1 oz or 1/2 of a cup, 1 serving of lean protein is 3 oz, and 1 serving of low-fat dairy is 1 cup (milk and yogurt) or 2 oz of cheese. If you do eat some vegetables, 1 serving of vegetables is 1 cup or 2 cups of leafy vegetables."
    },
    {
      "title": "Count your calories.",
      "content": "Count your calories. Counting calories is another fairly simple way to lose weight. Cutting out a few calories from each meal and snack may help you lose weight. You can also try swapping out higher calorie foods for lower calorie foods to help decrease your total calorie intake each day. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Losing weight safely means only dropping one to two pounds per week. In terms of calories, that equates to eating about 500 calories less each day. If you cut out more than 500 calories daily or are eating less than 1200 calories daily, you could be at risk for nutrient deficiencies. Weight loss achieved with very low calorie diets is generally not sustainable long-term."
    },
    {
      "title": "Eat two to three servings of fruit daily.",
      "content": "Eat two to three servings of fruit daily. Fruits and vegetables are one of the main sources of vitamins, minerals, and antioxidants in your diet. Avoiding or minimizing the amount of vegetables you consume can minimize how many nutrients you get through the foods you choose. Focus on consuming adequate fruit daily to maximize the nutrition content of your diet. It's recommended to consume about two servings of fruit daily. This equates to two pieces or two cups of fruit. [4] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source Each color fruit offers you a different nutrient. Choose a variety of fruit and different colored fruits each day to maximize your intake of different nutrients. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Also, eat nutrient-dense fruits. Although all fruit is a healthy choice, some fruits offer more nutrients than others. For example, try these: oranges, grapefruits, blackberries and strawberries. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Make or purchase your own juices.",
      "content": "Make or purchase your own juices. Juicing has recently become a more popular way for people to consume fruits and vegetables. If you're not a fan of raw or cooked vegetables, adding them to a juice might make them more palatable. Vegetable juice is available at grocery stores. Try a few brands to see if any of them are tasty. If so, add one to two servings of vegetable juice to your meal plan. If buying a fruit/vegetable juice combo from the store, make sure to buy 100% juice. Do not purchase juice mix cocktails, juice concentrate, or any products with added sugar. Try making your own juice at home. You can purchase a juicer and make a variety of combinations yourself. Many times, vegetable juice is completely masked when mixed with sweet fruit like pineapple or apples."
    },
    {
      "title": "Make smoothies.",
      "content": "Make smoothies. Like juices, smoothies are another method of getting in a few servings of vegetables. Many vegetables, like spinach, are almost tasteless when mixed with frozen fruit and other flavorings. Try different combinations of fruits, vegetables and mixing liquids to see if there is a combination that strikes your fancy. Vegetables that mix well with fruit smoothies include: spinach, beets, and carrots. These vegetables are slightly sweet and blend well with sweet fruit. Another benefit of smoothies is that you're keeping the entire fruit or vegetable whole, which means you're consuming the fiber from these foods."
    },
    {
      "title": "Consume lean protein and whole grains.",
      "content": "Consume lean protein and whole grains. With any weight-loss program, it's important to eat a balanced diet. Although you may be avoiding vegetables, consuming foods from the protein, dairy, and grain group is important to a well-balanced and healthy diet. Choose lean protein if possible. Items like these are considered lean protein: poultry, lean red meat, pork, seafood, lentils/beans and eggs. Dairy foods are excellent sources of protein, calcium and Vitamin D. These should be low-fat if possible. Choose from: low-fat milk, yogurt, cottage cheese, and cheese. 100% whole grains contain fiber and vitamins that will support your weight loss. [7] X Research source Choose items like these whole grains: brown rice, quinoa, barley, 100% whole wheat pasta or millet."
    },
    {
      "title": "Take a supplement.",
      "content": "Take a supplement. Vitamin and mineral supplements may be a good idea to take when you're following a diet and especially when you're following a diet with limited vegetable intake. There are a variety of nutrients found in vegetables that will need to be replaced by other foods or supplements. Vegetables provide high amounts of potassium, magnesium, vitamin A, vitamin C, folate, and antioxidants. Take a 100% complete multi-vitamin/multi-mineral each day. Note that supplements are not meant to fully replace foods or entire food groups in your diet. Think of a supplement more as a \"back up\" then a full replacement."
    },
    {
      "title": "Try new vegetables.",
      "content": "Try new vegetables. Even though you may not like vegetables or want to minimize them in your diet, it's important to understand they are a valuable and nutritious food group that should be included daily. If you're having trouble finding a vegetable that you enjoy, work on finding new ones to try or different recipes that you might enjoy. Try, try, and try again. There may be a vegetable that you don't particularly enjoy, but haven't tried it in a while. Give it another go. You might be surprised your taste buds have changed. Buy a vegetable you've never tried before. Maybe there's an exotic or interesting item you'd be willing to try. Bring it home and prepare it to see if it's something you'd be willing to eat more regularly. Try preparing vegetables with different cooking methods. A steamed brussels sprout might not be appetizing, but when they're roasted, they're nutty and delicious! Try vegetables that you're more willing to like. Many vegetables are slightly sweet and don't have a strong or bitter flavor. Consider trying: peas, green beans, carrots, tomatoes, and bell peppers. Try to avoid putting a lot of sauce, gravy or dressings on vegetables. Although a cheese sauce makes broccoli tasty, it's generally higher in fat, calories and sodium. Overdoing it with sauces like these can work against your weight loss. A great option is to purchase kale or spinach, puree it until it is in small pieces, freeze it and add it to recipes."
    },
    {
      "title": "Add vegetables to your recipes.",
      "content": "Add vegetables to your recipes. You may not enjoy a side of steamed vegetables, but there are some tricks to sneak in a few vegetables into different meals and recipes. Puree extra vegetables in soups or sauces. This works great for tomato sauce. You can also add pureed carrots or butternut squash to your mac and cheese. Vegetables are also well-hidden in baked goods. Try adding pureed vegetables to items like meatloaf or meatballs. You can also add shredded zucchini, summer squash, or carrots to foods like muffins and cakes."
    },
    {
      "title": "Weigh yourself weekly.",
      "content": "Weigh yourself weekly. Whenever you're trying to lose weight, it's important to weigh yourself regularly. You'll be able to see your progress and determine how well your diet is working. Weigh yourself about one to two times per week. Hopping on the scale each day doesn't show you the most accurate progress overall. Daily fluctuations in weight (either a gain or loss) are normal and might not reflect your true overall progress. [8] X Research source For the most accurate trend, weigh yourself at the same time of day, on the same day of the week and wear the same clothes (or wear no clothing). Regular weigh-ins have also been shown to help prevent weight-gain. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Track your meals and snacks with a food journal.",
      "content": "Track your meals and snacks with a food journal. Keeping a food journal has been shown to help people succeed with weight loss. Jot down all your meals and snacks. It's harder to fall off track if you know you you'll need to document everything. You can purchase a journal or food journaling app. Track as many days as you can. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Reevaluate your progress.",
      "content": "Reevaluate your progress. Check in with yourself every month or two to reevaluate your progress. Consider how much weight you've lost and how this diet has worked for you. Again, a diet low in vegetables may be cause for slower weight loss. If you're doing well, losing weight and enjoying the diet you've adopted, keep going until your goal weight. If you notice your weight loss has slowed or stopped, take a step back and reevaluate your lifestyle. Being more diligent with your food journal can help see if there's any areas where you've slipped up or are eating more than you should."
    }
  ]
}