{
  "url": "https://www.wikihow.com/Load-eBooks-Into-Your-Nook",
  "title": "How to Load eBooks Into Your Nook",
  "steps": [
    {
      "title": "Connect your Nook to your computer.",
      "content": "Connect your Nook to your computer. To do so, get your Nook’s data cable, connect it to the micro USB port on your Nook, and plug the other end to a USB port on your computer. Nook generally supports ePub, CBZ, and PDF eBook file types. Loading such files to your reader requires only a basic copying process."
    },
    {
      "title": "Access your Nook’s file storage on your computer.",
      "content": "Access your Nook’s file storage on your computer. The procedure for doing so will slightly vary depending on whether you’re using Windows or Mac: For Windows computers, open “My Computer” from your desktop. Click on “Removable Disk” on the left menu panel of the My Computer window to access your Nook’s contents and to open it on a separate window. For Mac computers, a Nook shortcut icon will appear on your desktop once your gadgets are connected. Double-click on this icon to access your Nook and to open its contents on a new window."
    },
    {
      "title": "Select the ePub, CBZ, or PDF files you want to load into your Nook.",
      "content": "Select the ePub, CBZ, or PDF files you want to load into your Nook. Afterwards, drag them to the open Nook window. This will copy the files to the storage media of your Nook."
    },
    {
      "title": "Disconnect your Nook from your computer.",
      "content": "Disconnect your Nook from your computer. Do so once the transfer is done, so you can start reading the eBooks you’ve just loaded."
    },
    {
      "title": "Download Calibre.",
      "content": "Download Calibre. You can use eBook-loading third-party software to load eBooks with file formats not supported by Nook. Calibre is one such application. It is a free eBook management program you can use to transfer and organize the eBooks on your reader. Get Calibre by heading to http://calibre-ebook.com/ ; on the home page, click the blue \"Download Calibre\" button, and once the installer has finished downloading, double-click on the installer file to install it onto your computer."
    },
    {
      "title": "Launch Calibre.",
      "content": "Launch Calibre. Once it’s installed, launch Calibre from your desktop, and click the “Add Books” button on the upper-left corner of the Calibre window to start adding eBooks to the Calibre library (similar to the iTunes library)."
    },
    {
      "title": "Go to the location of the eBooks you want to copy to select the files.",
      "content": "Go to the location of the eBooks you want to copy to select the files. After selecting the eBook files you want, click “Open,” and the eBooks you’ve selected will automatically be added to the Calibre library."
    },
    {
      "title": "Connect your Nook to your computer.",
      "content": "Connect your Nook to your computer. To do so, get your Nook’s data cable, connect it to the micro USB port on your Nook, and plug the other end to a USB port on your computer. Wait for Calibre to detect your Nook. You'll know that Calibre has detected Nook when you see the \"Send to device\" button on the menu bar."
    },
    {
      "title": "Select the eBooks you want to load from the Calibre library.",
      "content": "Select the eBooks you want to load from the Calibre library. Afterwards, click the “Send to device” button on the menu bar. Calibre will begin copying, and once the process is done, the loading animation on the lower-right corner of the window will stop. Once loading animation stops, you can disconnect your Nook from the computer, and start reading the eBooks."
    }
  ]
}