{
  "url": "https://www.wikihow.com/Make-Blue-Food-Colouring",
  "title": "How to Make Blue Food Coloring Naturally",
  "steps": [
    {
      "title": "A rough chop of the cabbage allows you to access its rich color.",
      "content": "A rough chop of the cabbage allows you to access its rich color. Place an entire head of red cabbage onto a cutting board. Cut off the stem and discard it. Hold the cabbage steady with one hand, and with a large chef’s knife, roughly chop the cabbage into small chunks. [1] X Research source Don’t worry about being too precise with your cuts, but smaller pieces are better, since you'll be able to get more color from the cabbage. Red cabbage contains anthocyanin. These are natural dyes that are a great alternative to artificial colors. [2] X Research source"
    },
    {
      "title": "Boiling the cabbage releases its color into the water.",
      "content": "Boiling the cabbage releases its color into the water. Transfer the cabbage to a large saucepan. Fill this saucepan with enough water to cover the cabbage, which should be about 8 cups (1.9 L). Put on the lid and bring the water to a boil over medium-high heat. When the water comes to a boil, reduce the heat to medium, and continue simmering for 20 minutes. [3] X Research source As the cabbage boils, the anthocyanin will leach into the water, turning it purple."
    },
    {
      "title": "The colored water is the base for your dye, so separate it from the cabbage.",
      "content": "The colored water is the base for your dye, so separate it from the cabbage. Remove the pot from the heat. Place a colander over a large glass or metal mixing bowl. Pour the cabbage and the purple water into the colander. The colander will catch the cabbage, and the purple water will drain into the bowl below. [4] X Research source As a bonus, you now have a cooked and ready-to-eat cabbage. Set it aside to cool, and then use it in soups, stews, stir fries, and other dishes. [5] X Research source"
    },
    {
      "title": "Boiling away excess water creates a more vibrant dye.",
      "content": "Boiling away excess water creates a more vibrant dye. Pour the collected purple water into a medium saucepan. Bring the water to a boil over high heat, and then reduce the heat to medium-high. Continue simmering the water with the lid off for about 30 minutes to reduce the purple water. Cook the mixture until most of the water has evaporated and there's only ½ cup (118 ml) of liquid left. [6] X Research source As the liquid cooks, the water will evaporate and the liquid will reduce, leaving behind a more concentrated and more vibrant purple water."
    },
    {
      "title": "Give the mixture a chance to cool off before you experiment with it.",
      "content": "Give the mixture a chance to cool off before you experiment with it. When the water has reduced, remove the saucepan from the heat. Set the pan aside to cool to room temperature. This could take another 30 minutes. When the purple concentrate has cooled, pour it into a clean mason jar or other clear container. [7] X Research source"
    },
    {
      "title": "Add the baking soda in small quantities so you can control the color.",
      "content": "Add the baking soda in small quantities so you can control the color. Measure ⅛ teaspoon (0.6 g) of baking soda and pour it into the jar with the purple concentrate. Stir the mixture to dissolve the baking soda in the water, and allow the bubbles to subside if necessary. [8] X Research source Use a clear jar so you can see the color change when you add the baking soda. When you mix the anthocyanin with an alkaline ingredient like baking soda, it becomes blue. In an acidic environment, the anthocyanin will become redder. You can even make a red dye by adding lemon juice."
    },
    {
      "title": "A clear glass filled with white liquid shows you how blue your dye is.",
      "content": "A clear glass filled with white liquid shows you how blue your dye is. Measure ¼ cup (59 ml) of a white liquid, such as milk, soy milk, or coconut milk, into a clear glass. You can also test the color on a small amount of frosting before dyeing the entire batch. [9] X Research source Add a few drops of the food coloring and stir to incorporate the dye into the liquid. The color will be pale, but it will give you a good idea of the blue shade you’ve achieved. [10] X Research source If the color isn’t blue enough for you, continue to stir in a small amount of baking soda, no more than ⅛-teaspoon (0.6-g) at a time. Too much baking soda will affect the taste of your food coloring, so be careful not to overdo it. [11] X Research source"
    },
    {
      "title": "This dye provides you with a rich pastel hue.",
      "content": "This dye provides you with a rich pastel hue. There are all kinds of places you can apply this dye, and you can always find your favorite uses for it through experimentation. We’ve got some great suggestions for you here if you’re looking for a place to start: [12] X Research source Blue frosting: Make a batch of vanilla buttercream or your favorite white frosting. Before icing your treats, add several drops of food coloring and stir to combine. If you want a richer blue, take a portion of the buttercream and microwave it with the food coloring, then mix it with the rest. Blue ice cream: Homemade ice cream is a fun and tasty project. Transfer the ice cream base to the ice cream maker, turn on the machine, and add the blue food coloring a few drops at a time until you achieve the desired intensity. You can also use this dye in store-bought ice cream. Blue Easter eggs: Dyeing eggs is a fun tradition to celebrate Easter. Hard boil the eggs first to help prevent cracking, and when the eggs are dry, dip them into a jar of the blue food coloring for several minutes."
    },
    {
      "title": "Try to use natural food coloring right away, but leftovers will keep for 2 days.",
      "content": "Try to use natural food coloring right away, but leftovers will keep for 2 days. If you have any leftover blue food coloring, transfer it to an airtight container and keep it chilled in the refrigerator. The food coloring will last for a couple of days, but it’s generally best to use this food coloring the same day you make it. [13] X Research source"
    }
  ]
}