{
  "url": "https://www.wikihow.com/Lose-5-Pounds-in-a-Week",
  "title": "How to Lose 5 Pounds in a Week",
  "steps": [
    {
      "title": "Replace all liquid drinks with water.",
      "content": "Replace all liquid drinks with water. This includes milky coffee drinks, alcohol and sodas. You should drink at least eight glasses of water a day. Drinking water before every meal can aid with weight loss. [1] X Research source Cutting out sugary drinks can help you lose 5 pounds in a week if you are a soda drinker. [2] X Research source You can drink zero-calorie drinks such as lemon water, hot or iced tea, and black coffee. Just make sure that you do not add sugar or milk."
    },
    {
      "title": "Cut out sugar.",
      "content": "Cut out sugar. On average, people eat up to 350 excess calories a day from sugar alone. While you cannot avoid sugar entirely, you can avoid foods that are high in added sugar. If you’re craving sweets, try eating dried fruit, baked apples with cinnamon or a bowl of berries. There are several ways you can avoid eating too much sugar: [3] X Research source Eat plain oatmeal for breakfast instead of breakfast cereals or pastries. Avoid packaged foods that list sugar, high fructose corn syrup, honey, or corn sugar as the first or second ingredient. Stop adding sugar to coffee and tea. Skip dessert."
    },
    {
      "title": "Avoid processed carbs.",
      "content": "Avoid processed carbs. If you love white bread and pasta, you can lose weight by cutting out these simple, processed grains. These foods are high in calories, and they may leave you feeling hungry. [4] X Research source Eliminate processed carbs entirely from your diet for the week. If you must have bread, choose 100% whole wheat, which is high in fiber. Products to avoid include: Bread products Pasta Crackers Baked goods including muffins and cookies Potato chips"
    },
    {
      "title": "Reduce salt in your diet.",
      "content": "Reduce salt in your diet. Salt makes you retain water. You can lose between 1 and 4 pounds (.5 to 1.8 kg) of water weight by flushing the salt from your system. Buy low-sodium prepackaged foods and fresh, unseasoned meats. Do not add table salt to any of your meals. [5] X Research source"
    },
    {
      "title": "Calculate your daily calorie allowance",
      "content": "Calculate your daily calorie allowance . [6] X Expert Source Kevin Richardson Celebrity Personal Trainer Expert Interview. 19 February 2021. This will tell you how many calories you can eat every day. Aim to hit an area between 1,200 and 1,800. Smaller women should aim for between 1,200 and 1,500, and men should aim for 1,600 to 1,800. [7] X Research source"
    },
    {
      "title": "Record what you eat in a journal.",
      "content": "Record what you eat in a journal . As you progress through the week, write down everything you eat and drink throughout the day. Note how much of it you ate and how many calories were in the meal. Add these up at the end of the day to see if you are within your calorie allowance. You may also want to record all of your physical activity so that you know how many calories you are burning. There are many apps for your smartphone that can help you track diet and exercise. Some even have a database of common meals and foods with the nutritional information and calorie count available to make it easier to watch your calorie intake."
    },
    {
      "title": "Shop ahead for your week of meals.",
      "content": "Shop ahead for your week of meals. Buy all of your food at one time to avoid buying junk food later in the week when you might be having cravings. Shop along the perimeter of the supermarket where the whole foods and produce are located. Don’t forget to pick up berries, green, leafy veggies, whole grains and low-fat yogurt."
    },
    {
      "title": "Find a weight loss buddy.",
      "content": "Find a weight loss buddy. Whether it’s your husband, best friend, mom or co-worker, morale helps boost weight loss results. Workout buddies can help motivate you to exercise longer. They can also help spot you on weights or split the cost of a personal trainer."
    },
    {
      "title": "Go to sleep early.",
      "content": "Go to sleep early. Set a bedtime for every night of the week to make sure that you get plenty of rest. Sleep is one of the secret ingredients in achieving any weight loss goal. When you are low on sleep, your body releases cortisol, a hormone that makes you store weight. [8] X Research source When setting your bedtime, be aware that you may have to wake up earlier than usual to exercise."
    },
    {
      "title": "Weigh yourself in the morning.",
      "content": "Weigh yourself in the morning. Weight can fluctuate throughout the day, so you should try to weigh yourself right after you wake up for consistent results. Aim to have lost 2 pounds (.91 kg) by Wednesday. If you do not see the results you want, check back over your activities and food journal to make sure that you were burning more calories than you were eating."
    },
    {
      "title": "Identify your current habits.",
      "content": "Identify your current habits. Losing 5 pounds may be accomplished by fixing weak spots in your diet and exercise regime. Create a list of everything you ate in the past week. Include your daily schedule so that you can see how much activity you do. You can start recording this a week before your diet, or you can recall it from memory. How much soda and juice do you drink? How much sugar do you eat every day? How much white bread and pasta do you eat? How much do you exercise every week? Do you sit for long periods for work? How often do you eat out?"
    },
    {
      "title": "Consume several small meals throughout the day.",
      "content": "Consume several small meals throughout the day. Instead of three large meals, try eating 4 or 5 small meals. These smaller meals should be 300 – 400 calories each. Smaller, more frequent meals can cut down on cravings, and they will reduce your need to snack. [9] X Research source"
    },
    {
      "title": "Create a meal plan for every day of the week.",
      "content": "Create a meal plan for every day of the week. Knowing what you will eat at every meal will reduce the risk of cheating on your diet. You should focus on eating whole foods at home during the week with small portions of low-calorie snacks in between meals. Measure out each portion carefully. Always read the food nutrition labels for calories per serving, protein per serving, etc. This goes for all packaged foods. Make sure you are always doing the math for each meal."
    },
    {
      "title": "Start the day with a protein-filled breakfast.",
      "content": "Start the day with a protein-filled breakfast. Aim for 300 calories in this meal. Protein is a great source of energy to begin your day with as it keeps you full and gives you energy for other activities. [10] X Research source Try one of the following: A boiled egg with a piece of whole grain toast and half an apple. A slice of whole grain toast with 1 tablespoon peanut butter, served with an orange. A 16 oz. smoothie (437 mL) with 4 oz. (118 mL) low-fat Greek yogurt, 4-oz (118 mL) water, 8 oz. (237 mL) of almond milk and blueberries."
    },
    {
      "title": "Prepare small midday meals.",
      "content": "Prepare small midday meals. You want to keep up your energy in the middle of the day, when you're likely to start feeling tired. Make lunch the night before, and choose meals that are easy to take to work. Some options include: Roasted vegetable salad with 1 cup sweet potato, 1 cup eggplant, 1 cup peppers, 3 cups mixed greens, and 3 tablespoons lite honey mustard dressing [11] X Research source 6 oz. (177 mL) of low-fat yogurt with berries and a handful of almonds (about 23) Low-sodium lentil soup with labels indicating 300 – 400 calories and 20 – 30 grams protein per serving"
    },
    {
      "title": "Cook filling dinners.",
      "content": "Cook filling dinners. Dinner should keep you feeling full all night long. You want a meal that has a good source of protein as well as plenty of fiber to prevent snacking. Try including a lean cut of meat and steamed vegetables. Avoid high-calorie fillers like pasta. Instead, you can try: One 6 oz. (170 g) slice of grilled chicken and 1 cup of green beans 1 cup grilled eggplant slices and 10 spears of asparagus [12] X Research source 6 oz. (170 g) broiled white fish, like tilapia or salmon, plus 1 cup mashed potatoes and 1/2 cup green peas [13] X Research source"
    },
    {
      "title": "Make sure half of each meal is made up of fruits and vegetables.",
      "content": "Make sure half of each meal is made up of fruits and vegetables. Fruits and vegetables can help keep you full even when you have eaten less. Avoid starchy vegetables like corn. Instead, good foods include the following: [14] X Trustworthy Source PLOS ONE Online peer-reviewed, open access scientific research journal Go to source Cauliflower Spinach Kale Broccoli Berries Apples Pears"
    },
    {
      "title": "Avoid sedentary activity.",
      "content": "Avoid sedentary activity. Don’t watch TV, and reduce your time on the computer. Organize an entire day out with friends or family. Plan activities with friends instead of meals. There are a number of fun activities you can do over the weekend that will encourage your weight loss: Mini-golf Hiking Dancing at a club Walking at the mall Swimming at the beach or pool"
    },
    {
      "title": "Walk for 10 to 20 minutes after lunch and dinner.",
      "content": "Walk for 10 to 20 minutes after lunch and dinner. Keep this up for the whole week, increasing to 30 minutes when possible. This habit will add extra exercise to your routine while helping you burn the calories you just ate. You should also try to walk or bike during instead of driving for short distances. Plan ahead for your walking trips so that you can still reach your destination in time."
    },
    {
      "title": "Book exercise classes ahead of time.",
      "content": "Book exercise classes ahead of time. Pay for three one-hour cardio classes. Committing financially beforehand will encourage you to go even if you are tired. You want to find a class that will boost your heart rate and challenge your body. Some options include: Zumba Oula Boot camp Barre method Step aerobics Interval training"
    },
    {
      "title": "Work out in the morning.",
      "content": "Work out in the morning. Do one fitness class or 45 minutes of cardio right after you wake up. Morning exercise can help you stay on track for the rest of the day. Morning exercisers also sleep better and lose more weight. [15] X Research source Good exercises to do in the morning include: Running Swimming"
    },
    {
      "title": "Add weight training to your exercise regime.",
      "content": "Add weight training to your exercise regime. [16] X Expert Source Kevin Richardson Celebrity Personal Trainer Expert Interview. 19 February 2021. Include two or three sessions during the week in addition to your cardio. Strength training can boost your metabolism. Furthermore, the more muscle you have, the more calories you will burn while exercising. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have never done weight training before, start on the machines. Read the directions or ask a trainer. You should choose a specific group of muscles to train, such as arms, legs, or abs. Do three sets of 12 repetitions on each machine. If you are doing free-weights, bring an exercise buddy as a spotter."
    },
    {
      "title": "Practice yoga.",
      "content": "Practice yoga. Stress can also encourage your body to produce hormones that signal your body to store fat, such as cortisol and adrenaline. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Try a 60 to 90-minute flow yoga class. You can also watch a video online if you want to do it at home. Yoga promotes relaxation, and it increases awareness of your body, which helps you lose weight. Pilates is another relaxing form of exercise that will also help you to tone your muscles."
    }
  ]
}