{
  "url": "https://www.wikihow.com/Handle-Fights-Between-Your-Friend-and-Significant-Other",
  "title": "How to Handle Fights Between Your Friend and Significant Other",
  "steps": [
    {
      "title": "Remain calm.",
      "content": "Remain calm. Though you may find it overwhelming to deal with fights between a friend and your partner, you should avoid getting upset yourself. Instead, focus on staying calm and acting as the voice of reason. Avoid the temptation to also yell, argue, or get frustrated with your friend or your partner. [1] X Research source You may try to take a few deep, calming breaths when your friend and your significant other are fighting. You may also leave the room for a moment to calm down and then re-enter the room when you feel more relaxed and ready to address the conflict."
    },
    {
      "title": "Ask your friend and significant other to sit down and talk.",
      "content": "Ask your friend and significant other to sit down and talk. You should then approach your friend and your partner to find out if they are willing to talk about their conflict. You may do this separately, talking first to your friend and then to your partner about having a discussion together, acknowledging that a difficult situation exists. [2] X Research source Try to get both parties to agree to an open, friendly discussion to address their issues with each other. By approaching both your friend and your partner separately, they would be more inclined to share with you in private, than when they are confronted together. When you talk to them, you may note that the fights between your friend and your partner are starting to really bother you and you are finding it difficult to handle the arguments. You may ask your friend and your partner to agree to work through their issues so that you can all hang out together without conflict. For example, you may say, \"I am feeling uncomfortable around both of you and it makes me stressed out when you both fight with each other. Can we sit down and work this out so we can all hang out together in peace?\" It's better to make a plan which allows all parties to have a complete discussion. For instance, avoid this conversation if one of the involved people is in a rush. [3] X Research source"
    },
    {
      "title": "Establish ground rules for the discussion.",
      "content": "Establish ground rules for the discussion. If your partner and your friend agree to having a discussion, you should all sit down in a quiet, private space. Then, you should establish ground rules for the discussion so it does not get out of hand. Having ground rules set will ensure everyone in the discussion treats each other with respect. [4] X Research source For example, you may all agree to not interrupt each other when you are speaking to each other. You may make a rule to avoid name calling or swearing during the discussion, as this may make it harder to understand the complaints or the overall discussion. [5] X Research source You may also agree to having time outs if the discussion gets heated or out of hand. You may decide to act as the mediator in the discussion, where you help your friend and your partner communicate with each other. As the mediator, you should be given the right to enforce the ground rules so the discussion stays civil. For example, you may say, \"As the mediator, I will enforce the ground rules of the discussion so it stays civil and productive.\" Both parties have to be in a space where they're not overwhelmed, and they need to have the willingness to take turns and hear each other's perspectives. If that is not established, nothing else can occur. Unfortunately, there probably won't be a resolution."
    },
    {
      "title": "Ask each of them to write down their main concerns.",
      "content": "Ask each of them to write down their main concerns. To ensure that the discussion is productive and rational, encourage them both to make a list of what bothers them most so that they are able to stay focused on the discussion. Tell them to be specific so that once they start talking to each other, they are less likely to get emotional and off-topic."
    },
    {
      "title": "Speak to each of them individually.",
      "content": "Speak to each of them individually. When your friend and significant other have an issue with each other, it almost always centers around their relationship with you, so you are not just a mediator. They are more likely to share their issues and the deeper reasons behind them with you than with the other person, so talking to them beforehand can help you resolve the issue faster. You may need to resolve the issues with them individually before coming together as a group. For example, the issue could be caused by your friend feeling like you two don't spend enough time together. On the other hand, your significant other might not like having your friend as a third wheel. They may not feel comfortable revealing the truth to each other, but they will likely tell you."
    },
    {
      "title": "Ask your friend and significant other to identify their issues with each other.",
      "content": "Ask your friend and significant other to identify their issues with each other. You can all work together to resolve the conflict by being honest about the issues between your friend and your partner. Your friend should take a turn explaining their issues with your significant other, and your significant other should take a turn explaining their issues with your friend. As the mediator, you should make sure your friend and your partner both avoid blaming each other or mocking each other. [6] X Research source Each person should have a turn to express how they are feeling and why they believe they do not get along with the other. Make sure everyone else listens patiently while one person speaks so everyone has a chance to talk and be heard."
    },
    {
      "title": "Have them use “I” statements.",
      "content": "Have them use “I” statements. Encourage your friend and your partner to use “I” statements when they talk about their issues with each other. You may tell them to express themselves using “I” statements and to avoid using “you” or “we” when they speak. This will help them avoid making assumptions or accusations against each other. [7] X Research source For example, your friend may say, “I do not like how your partner treats you. I think they are disrespectful towards you and have a poor attitude.” Your partner may say, “I have difficulty with how protective your friend is around you. I feel like they are always trying to sabotage our relationship and I am uncomfortable with this.” Make sure that you take part in the discussion as well, using \"I\" statements for how you feel about the situation."
    },
    {
      "title": "Come up with a solution to the conflict together.",
      "content": "Come up with a solution to the conflict together. Once your friend and your partner have discussed their issues with each other, you should all try to come up with a solution or a compromise together. This may mean that both parties will need to apologize and compromise so everyone can get along. You may encourage your friend and your partner to agree to a solution so you can all move on and be friendly with one another. [8] X Research source For example, you may tell your friend, “I appreciate your concern about my relationship. But I need you to respect my decision to be with them and try to be civil with them, as my friend.” You may tell your partner, “I understand why you may feel uncomfortable. But I need you to be supportive of my friendship and accept that my friend is in my life.” Remember that sometimes the best solution is not asking the two of them to spend time together. It's okay if they don't want to be friends with each other. You can still maintain your relationship with each of them."
    },
    {
      "title": "Leave the conversation on good terms.",
      "content": "Leave the conversation on good terms. You should then end the conversation on terms that feel positive and productive. You all may end up agreeing to disagree, as long as all parties feel less hostile to one another and willing to work on their relationships moving forward. You should all leave the conversation feeling more optimistic and less angry at one another. For example, your friend may agree to try to be more accepting and supportive of your romantic relationship moving forward. Your partner may agree to work on being okay with your relationship with your friend and getting along with your friend."
    },
    {
      "title": "Encourage your friend and your significant other to communicate.",
      "content": "Encourage your friend and your significant other to communicate. Your friend and your partner can avoid fights moving forward by working on their ability to communicate with each other. You should encourage them both to try to have friendly, open conversations with each other. Over time, this could even lead to a platonic relationship between them, making your hang outs together much smoother. [9] X Research source For example, if your partner gets irritated by something your friend does, you may encourage your partner to talk to your friend about the issue and work it out with them. You may advise your friend to do the same if they find something your partner does annoying or frustrating. You may say, \"Maybe you should talk to them about how you feel. It's better than getting annoyed or upset at them in silence.\""
    },
    {
      "title": "Defuse issues with humor.",
      "content": "Defuse issues with humor. If your partner and your friend start to bicker, you may try defusing the situation by making a joke or a funny remark. Using humor can help everyone involved to pause and assess their emotions. It can also allow your friend and your partner to brush off the issue and move forward. [10] X Research source For example, you may make a joke if your partner starts to argue with your friend over who pays the bill for a meal. You may say, “Why don’t we settle this with a game of rock, paper, scissors? Or flip a coin?”"
    },
    {
      "title": "Hang out with your friend and your partner separately.",
      "content": "Hang out with your friend and your partner separately. If your friend and your significant other just can’t seem to get along, no matter how hard you try, you may decide to hang out with each person separately. This may be an easier option, as you can then avoid any fighting or bickering between your friend and your partner. It may also put less stress on you, as you will not have to act as the mediator all the time. You may also be conscious of hanging out separately with your friend and your partner when you are in a group setting. You may draw your friend away from the group for a quick chat and then join the group and hang out with your partner."
    }
  ]
}