{
  "url": "https://www.wikihow.com/Look-Rich",
  "title": "How to Look Rich",
  "steps": [
    {
      "title": "Buy clothes that fit your body well",
      "content": "Buy clothes that fit your body well . The most obvious sign of wealth isn't bling, specific brands, fabric, or a particular style—it's tailored clothes. If you want to look rich, you need to make sure your clothes fit like they were made for your body. Clothes need to fit your form and flatter your figure, whether you're talking about casual or formal wear. Department store sizes are widely variable because of the way fabric is machine cut. Two pairs of pants that are labeled the same size might be fairly different. Try on at least three pairs at your size to find the best fit. Spend extra time shopping to make sure every item fits your body perfectly. Even if you like a shirt, skirt, or a pair of pants, don't buy it if it doesn't fit your body perfectly."
    },
    {
      "title": "Buy a few quality pieces but fill out your wardrobe with affordable items.",
      "content": "Buy a few quality pieces but fill out your wardrobe with affordable items. If you're trying to save money on clothes but want to look like you're spending a lot, a little smart shopping will go a long way. Most of your wardrobe can be mixed and matched from sensible, affordable pieces, then dressed up with a few expensive items. When you're looking for investment pieces, make sure they're tailored, versatile, and classic enough that they won't go out of style any time soon. And, of course, they should make you feel amazing! [1] X Expert Source Nejla Renee Fashion Stylist & Image Consultant Expert Interview. 18 May 2020. It's worth spending the money to invest in a great pair of jeans that fit you perfectly and that are versatile enough to be dressed up or down. [2] X Expert Source Nejla Renee Fashion Stylist & Image Consultant Expert Interview. 18 May 2020. A pair of well-fitting black pants is a good investment for the office, depending on your work environment. [3] X Expert Source Nejla Renee Fashion Stylist & Image Consultant Expert Interview. 18 May 2020. If you want to splurge on a nice bag, make sure it's a versatile color, that it's big enough to suit your needs, and that it's a style that you really like. [4] X Expert Source Nejla Renee Fashion Stylist & Image Consultant Expert Interview. 18 May 2020. It's also obviously a good idea to look for sales whenever possible. If you can get designer jeans for a discount, you can spend more on some valuable items to round out your wardrobe."
    },
    {
      "title": "Remove brand names and logos from your clothes.",
      "content": "Remove brand names and logos from your clothes. Expensive designer clothes don't feature brands prominently. If you want to look like you've got a serious bank account, don't make yourself a walking billboard for brand names. Go for clean, sophisticated apparel. Even trendy brands like Coach, Fendi, Dolce & Gabbana, and others may have prominently-placed emblems or brands. Even though these might be pricey brands, this isn't a sign of wealth. It's better to have a big wardrobe of beautiful form-fitting items of mysterious origin than one expensive Coach bag that broke the bank."
    },
    {
      "title": "Dress up when you can.",
      "content": "Dress up when you can. If you're just playing at looking wealthy, you want to look like you've got somewhere important to be. A board meeting? An exclusive dance club? A yacht club? A red carpet? Every day should be an excuse to dress up and look rich. You should always have at least one nice outfit that you can wear for special occasions. For instance, this black dress, a suit, or a well-tailored pair of pants and a button-down shirt. [5] X Expert Source Nejla Renee Fashion Stylist & Image Consultant Expert Interview. 18 May 2020. Things like cardigans in pastel colors, pressed cotton shirts, form-fitting slacks, and slim-fitting jackets should be worn by men whenever possible. No shorts, under any circumstances. It's appropriate for women to wear skirts, dresses, and pumps, whenever possible, if you're going for that \"old-money\" look, but it's also good to rock a trendy pair of designer jeans, a scarf, and a printed tee in some cases to look movie-star-chic. Just avoid going out in sweatpants."
    },
    {
      "title": "Buy clothes with natural fabrics.",
      "content": "Buy clothes with natural fabrics. Fabrics should be all-natural, whenever possible. Look at the tags when you buy clothes and pick out cotton, cashmere, silk, linen, and wool over any kind of synthetic blend. If you go with blended fabric, make sure that it's a blend of these natural fibers. Or better yet, buy a combination of expensive fabrics and make your own clothes!"
    },
    {
      "title": "Make sure your clothes are always well-pressed and clean.",
      "content": "Make sure your clothes are always well-pressed and clean. It's important to have good clothes, but it's even more important to have clothes that look good and are well-kept. Wash your clothes according to the directions included, always, and air-dry them to retain the life of the items. Dry-clean fine fabrics and press your clothes before wearing them. The more you wash certain items, the more they'll age. Press your clothes and fold them neatly between wearings, so you won't need to wash them more frequently. Wool, velvet and silk need to be dry-cleaned. Cotton and cashmere can be washed fine at home."
    },
    {
      "title": "Be ready for the weather.",
      "content": "Be ready for the weather. Not only do you want to make sure that you're dressed smartly, but that you're dressed appropriately for the weather. Don't get caught out in the rain in inappropriate clothes, and always be prepared for abrupt changes in weather, given the season that you're dressing for. Pay attention to fashion magazines to find out about new seasonal fashions and trends as well, so you can be prepared for what's coming up next. The old money crowd loves to layer, so sweaters, overcoats, and similar garb are handy for cooler conditions."
    },
    {
      "title": "Spend money on shoes.",
      "content": "Spend money on shoes. The shoes make the outfit, and you can get a lot of use out of them, so it's one good place to spend a little extra when you're trying to get an outfit together. Acquire at least one pair of really decent well-made shoes and some other value options for heavier use. For men, some very conservative and understated oxfords or loafers are a good idea. Higher-ankle Beatle boots can also be stylish and appear expensive. Leather is key. For women, a conservative pump, like the classic Chanel would be a good choice. Keep your shoes very clean at all times. Take them off when you're indoors and polish them regularly to keep them looking out-of-the-box. Keep the box and store them inside it."
    },
    {
      "title": "Wear some discreet bling.",
      "content": "Wear some discreet bling. Jewelry can be a trap. A little of it cries out \"rich,\" but too much of it cries out \"poseur.\" Think Jay-Z more so than Trinidad James, and Queen Elizabeth more than Snooki. A few pieces of stylish jewelry can give your look rich elegance. [6] X Research source If you can't afford the real thing, keep it classic. In lieu of a genuine Cartier \"Tank\" watch, do what lots of the wealthy do and get the cheapest, simplest Timex with a basic black leather band, small and discreet. Fake pearls are difficult to identify, making them an excellent way to save a little if you can't afford a diamond necklace."
    },
    {
      "title": "Find trendy or unusual accessories.",
      "content": "Find trendy or unusual accessories. An authentic designer bag or wallet is nice but go for something a bit bland or obsolete. Something that is the \"latest fashion\" is by definition a trend, which is anathema to the old money crowd. It must be well made and leather even if not designer, go for simple designs. The LL Bean Boat & Tote or a classic black quilted Chanel are good options. Nothing avant-garde, and nothing that looks like the Balenciaga Lariat, or the Chloe Paddington. However, if you're impressing the nouveau riche, \"trendy\" is pretty much mandatory. Rent designer accessories from places like Le Tote, Leading Luxury, or Rent the Runway, to help yourself save some money and appear super-rich. [7] X Research source"
    },
    {
      "title": "Bathe yourself every day.",
      "content": "Bathe yourself every day. Bathing regularly helps to communicate that you're well-taken-care-of and that you've got the time and resources to devote to your looks. Wash yourself thoroughly every day and take the time to get clean. Use a loofah to exfoliate while you're in the shower. Get rid of dead skin cells to deep clean your skin and keep it healthy. Bathe twice if you work out. Once in the morning and once after you finish on the squash court. Don't let the sweat stick. Use moisturizing lotion and soap your skin to keep it glowing and healthy after you take a shower."
    },
    {
      "title": "Cut your hair every 2-3 weeks at least.",
      "content": "Cut your hair every 2-3 weeks at least. When you're strapped for cash, paying for a hair cut is one of the first things that goes out of the window. Get good-quality hair cuts from a beautician or barber you trust, about 1-2 times a month. Get rid of those split ends and keep your style current and flattering to your face. Men should have precise haircuts and well-shaven facial hair. Beards or mustaches should be trimmed extremely finely, and precisely, to a razor-like edge. Women should have tasteful and trendy cuts, color, and shine in their hair. Hair color should look natural and highlights and lowlights must be natural as if obtained on a visit to the beach house. Learn to cut your hair , if you want to save some expense."
    },
    {
      "title": "Use natural makeup colors",
      "content": "Use natural makeup colors . A wealthy woman's makeup should be natural, making use of neutral colors and gentle foundation. No over-the-top cat eye-liner, or false lashes. Keep it tasteful. Take good care of your skin. Perfect skin is a rich woman must. Natural skin color looks much better. No sunspots, so keep on sporting sunscreen, though everyone looks better with a healthy glow. Some makeup looks commonly worn by the upper class include red lipstick. It's always tasteful."
    },
    {
      "title": "Take care of your nails.",
      "content": "Take care of your nails. Manicures don't have to cost a lot of money to make a big difference in your appearance. Clean your nails regularly and get manicures at inexpensive nail salons. Short tips can be classy and rich-looking, but longer nails tend to look a little cheaper and faker. Go for a basic French tip for the perfect look. Men should also invest in manicures regularly, to keep their nails and cuticles in good shape. Taking the time to trip nails and keep them strong and healthy is a sign of money. Learn to clean your nails yourself and trim your cuticles to save."
    },
    {
      "title": "Use whitening toothpaste.",
      "content": "Use whitening toothpaste. Dental care is expensive. The more you take care of your teeth on your own, the classier you'll look and the less you'll have to spend to achieve it. Floss every day, use non-alcoholic mouthwash to keep your breath fresh and brush daily using toothpaste with whitening properties. Make your smile look like a couple million bucks. White teeth aren't necessarily a sign of healthy teeth, but they always look better than stained or yellow ones. Avoid drinking too much coffee and tea, and tobacco products, to keep your teeth as white as possible."
    },
    {
      "title": "Smell like money.",
      "content": "Smell like money. Men and women should wear a small amount of a subtle and sophisticated scent. Woodsy, floral scents are always classy, while sugary scents tend to scream out \"young\" or \"bought at the mall.\" You don't usually have to break the bank to buy reasonable perfumes that smell expensive, although the high-end perfumes are quite pricey. Wait for deals at your favorite department stores and save up for something that smells good to you. Generally, you want to avoid super-new celebrity-endorsed fragrances. Men should wear cologne on the inner wrist and underneath the jawline. Women should wear perfumes on the inner wrist, inner elbows, and underneath the jawline or behind the ears."
    },
    {
      "title": "Go out and be seen.",
      "content": "Go out and be seen. New restaurants, new clubs, and other hot spots around town should always be on your to-do list. The rich like to go out to the newest and trendiest places to be seen, just as much as to experience those places. If you want to give the impression that you're rich, try to stay on top of new openings and get your reservations ahead of time. Sign up for mailing lists for hot restaurants or follow them on social networking so you can stay ahead of the game on specialties and trends. Opening night should be your night. You want to make sure you get in when something is hot, not afterward when everybody else finds out about it. Be the first."
    },
    {
      "title": "Practice basic etiquette",
      "content": "Practice basic etiquette . Wealth comes with elegance. If you want to act like you've got money, you need to practice good manners at all times. Even if you're waiting in line at the DMV, you need to be elegant in your behavior. Eat more slowly and chew with your mouth closed. Take your time and enjoy your food instead of wolfing it down. Stay calm and avoid raising your voice when you're upset. Learn to speak calmly and evenly, even if someone is pushing your buttons. Stand up straight and hold your chin up. Excellent posture, both when sitting or standing, are signs of wealth."
    },
    {
      "title": "Learn about expensive brands.",
      "content": "Learn about expensive brands. A knowledge of upscale brands can communicate that you're rich, even if you don't own any of the expensive gear that you're talking about. Rich people might have a lot of thoughts about the following brands: Clothing designers like Gucci, Dior, Burberry, Chanel, Dolce & Gabbana, Fendi, Coach, and Louis Vuitton. Car companies like Lamborghini, Alfa Romeo, Aston Martin, Audi, Bentley, BMW, Bugatti, Cadillac, Jaguar, Maserati, and Ferrari. Other local upscale brands, like restaurants and chefs, designers, artists, and architects. Rich people should be familiar with the notables in their area. Enunciate your words. Slow down your speech, and lower your voice volume to speak clearly and articulately about what you're talking about."
    },
    {
      "title": "Get some upper-class hobbies.",
      "content": "Get some upper-class hobbies. The rich have their attendant hobbies. While some of these activities can be kind of expensive, if you want people to think you're rich without spending the money or participating, you can learn about the following upper-class hobbies with the following upper-class wikiHows, to sound like you're a pro: Golf Tennis Skiing Fine dining Sailing Travelling Riding horses Playing polo"
    },
    {
      "title": "Get informed.",
      "content": "Get informed. Wealthy people frequently receive private schooling, so getting informed about the world around you is important. Brush up on general knowledge, but don't flaunt your education or claim to be an expert. [8] X Research source Get informed by checking out the following periodicals of the wealthy: Forbes Barron's Wall Street Journal The Robb Report Affluent Traveler The New Yorker The Economist"
    },
    {
      "title": "Travel.",
      "content": "Travel. Wealth comes with the opportunity to spend money on travel. In general, the very wealthiest people are worldly and well-traveled, making the time to visit new and exotic locations as often as possible. If you want to act rich, act worldly and earn your frequent flyer miles. Try to travel to places off-the-beaten-path. Visiting Cabo is what tourists do. Visit Oaxaca instead. If going on holidays to European vistas isn't in your budget, fake it till you make it. Just search for exotic locations online and repost the pics. Even Kim Kardashian used Google image search instead of taking her own vacation pics not too long ago."
    },
    {
      "title": "Act rich online",
      "content": "Act rich online . Richness sometimes has a very particular presence online. Cruise around websites like \"White Whine\" for good examples of how the 1% conduct themselves on Facebook and Twitter. Secret: It's not always that great. Complain about the service regularly: \"This restaurant is THE WORST. I mean, how hard is it to get a savory watermelon gazpacho right?\" Embrace the humblebrag: \"Today has been tough. The to-go cups at the new coffee place don't fit the cup holders in my BMW, so I had to drink my latte too fast.\" Put up pictures of exotic brands and locations, as if you were buying them or heading there on your next vacation, even if you're not."
    },
    {
      "title": "Don't flaunt it.",
      "content": "Don't flaunt it. Rich people, really rich people, don't feel the need to talk about how much they have. Rich people are probably the least interested in their wealth. If you want to give the impression that you're well-off, it's important to pull back a little and let other people guess. Don't push your \"wealth\" on people. If the topic of money comes up, brush it off. If you're pushed, you can say something like, \"I don't like to talk about it,\" or \"I'm pretty comfortable.\""
    }
  ]
}