{
  "url": "https://www.wikihow.com/Knit-Fingerless-Gloves",
  "title": "Easy Knitting Instructions for Fingerless Gloves",
  "steps": [
    {
      "title": "Cast on about 40 stitches.",
      "content": "Cast on about 40 stitches. This will be the length of your glove. The finished glove will extend from the top of your palm/knuckles, down past your wrist, and onto your forearm. If you want a shorter glove, cast on fewer stitches. If you want a longer glove, cast on more stitches. [1] X Research source Leave a long tail on your yarn. You'll be using it to stitch the glove together in the end. Use medium worsted weight yarn (size 4) and size 8 knitting needles. [2] X Research source"
    },
    {
      "title": "Knit every row until the glove is wide enough to wrap around your palm or forearm.",
      "content": "Knit every row until the glove is wide enough to wrap around your palm or forearm. This will create a bumpy, purl pattern on both sides of you work. How many rows you knit depends on how wide your palm/forearm is. For most people, however, this will be about 48 rows. [3] X Research source Do not alternate between knitting and purling. You want to knit on every row. This will allow the glove to stretch both ways"
    },
    {
      "title": "Cast off, then tie the yarn off.",
      "content": "Cast off, then tie the yarn off. Cast off your work first. Cut the yarn, and pull the tail end through the last loop. Gently tug on the tail end to tighten the loop. Do not cut the tail end off."
    },
    {
      "title": "Fold your work in half, lengthwise.",
      "content": "Fold your work in half, lengthwise. The cast on and cast off stitches should run up the side of your arm and palm. The side edges of the piece are now the top and bottom of your glove. Place your hand over the folded piece, with the top of your palm against the top edge. Take note where you thumb starts."
    },
    {
      "title": "Sew down the first 2 inches (5 centimeters) of so of your glove.",
      "content": "Sew down the first 2 inches (5 centimeters) of so of your glove. Thread the tail end onto a yarn needle. Keeping your work folded in half, whipstitch down the long, side edge until you reach your thumb. [4] X Research source Pass the needle through both of the edges of the piece."
    },
    {
      "title": "Tie the tail off, then weave it back up the seam.",
      "content": "Tie the tail off, then weave it back up the seam. Once the top part of your glove is long enough to reach your thumb, tie the yarn to itself. Weave the tail end back up the seam, then trim the excess off."
    },
    {
      "title": "Sew up the bottom edge of your glove.",
      "content": "Sew up the bottom edge of your glove. Place your hand against the glove, and note where your wrist is/the base of your thumb is. This will be about 5 inches (12 centimeters). Thread the bottom tail end of your work, and sew up the side of your glove using a whipstitch. Stop when you reach the wrist area/base of your thumb. [5] X Research source"
    },
    {
      "title": "Tie the tail off and weave it down the seam.",
      "content": "Tie the tail off and weave it down the seam. When the glove is sewn together, you'll have a hole in the side seam for your thumb. If you are happy with the size of the hole, tie the yarn to itself. Weave the tail end back down a few inches/centimeters, then cut the excess off."
    },
    {
      "title": "Repeat the process for the other glove.",
      "content": "Repeat the process for the other glove. These gloves are reversible. There is no left or right glove, so you can measure the second glove against the same hand."
    },
    {
      "title": "Cast",
      "content": "Cast on 24 stitches. This will be the bottom of your glove, so it needs to be wide enough to wrap around your palm or forearm. Make sure that you leave a tail at the start of your work."
    },
    {
      "title": "Start a rib stitch.",
      "content": "Start a rib stitch . You want to make this rib stitch a little wider than usual, so alternate between doing 2 knits and 2 purls for the entire row. This will make the bottom, wider cuff of your glove."
    },
    {
      "title": "Rib stitch for 14 more rows.",
      "content": "Rib stitch for 14 more rows. Remember to alternate the stitches on each row. If you started with 2 knits on one row, then you should start with 2 purls on the next row. Keep doing this until you have 15 rows total of rib stitching."
    },
    {
      "title": "Start a stockinette stitch.",
      "content": "Start a stockinette stitch. The stockinette stitch is where you alternate knit and purl rows. Knit one row, then purl the next one. This will make the body of your glove."
    },
    {
      "title": "Continue with a stockinette stitch until the glove is almost the length you want it to be.",
      "content": "Continue with a stockinette stitch until the glove is almost the length you want it to be. You will still have four more rows to knit, so keep this in mind. You want to end on a purl row, regardless."
    },
    {
      "title": "Rib stitch for 4 rows.",
      "content": "Rib stitch for 4 rows. As before, alternate between 2 knits and 2 purls. This will make the narrower, top cuff of your glove."
    },
    {
      "title": "Cast off",
      "content": "Cast off . Cut the yarn, and pull the tail through the loop. Gently tug on the tail to tighten the loop. Do not trim the tail."
    },
    {
      "title": "Fold the piece in half so that the rib stitches are on the top and bottom edges.",
      "content": "Fold the piece in half so that the rib stitches are on the top and bottom edges. Place your arm down on the piece, so that the top of your palm/knuckles are aligned with the top edge of your work. Note where your thumb is on the side edge. Make sure that the knit stitch is on the outside."
    },
    {
      "title": "Sew down the top edge of your piece.",
      "content": "Sew down the top edge of your piece. Thread a yarn needle, then, keeping the piece folded, sew down the top side edge using a whipstitch . Keep doing until you reach the base of you thumb area—about 2 inches (5 centimeters). Remember to start sewing from the narrower rib stitch."
    },
    {
      "title": "Tie off the tail and weave it back up the seam.",
      "content": "Tie off the tail and weave it back up the seam. Tie the yarn to itself, then weave it back up the side seam all the way to the top. Snip off any excess yarn."
    },
    {
      "title": "Sew up the bottom side edge.",
      "content": "Sew up the bottom side edge. Thread your yarn needle with the other tail end of your work. Use a whipstitch to sew up the bottom side edge. Stop when you reach the base of your thumb/wrist. You will be left with a gap in your glove. This is the thumb hole."
    },
    {
      "title": "Tie the tail off and weave it down the seam.",
      "content": "Tie the tail off and weave it down the seam. Once you are happy with the size of the thumb hole, tie the yarn to itself. Weave it back down the side seam a few inches/centimeters, then snip off any excess."
    },
    {
      "title": "Repeat this method for the other glove.",
      "content": "Repeat this method for the other glove. Both gloves are identical, so you do not need to flip or reverse the pattern."
    }
  ]
}