{
  "url": "https://www.wikihow.com/Highlight-in-Pages",
  "title": "How to Highlight Text in Pages",
  "steps": [
    {
      "title": "Open your document in Pages.",
      "content": "Open your document in Pages. If you're using Pages' document review features to track changes and/or want to temporarily highlight text for attention, you can use this method to highlight any text passage in your document. [1] X Research source If you want to highlight text and keep the highlighting visible in your final document, you'll need to add a background color to that text instead. If you're working on a shared Pages document with multiple people, each person's highlights will have a different color. You can change your author color in the View menu under Comments & Changes > Author Color . [2] X Research source"
    },
    {
      "title": "Select the text you want to highlight.",
      "content": "Select the text you want to highlight. You can do this by clicking and dragging your mouse over the text you want to highlight."
    },
    {
      "title": "Press ⇧ Shift+⌘ Command+H on your keyboard.",
      "content": "Press ⇧ Shift + ⌘ Command + H on your keyboard. This instantly highlights the selected text. You can also highlight the text by clicking the Insert menu and selecting Highlight . To remove a highlight, hover the cursor over the highlighted area and click Delete . If you'd like to attach a comment, hover the mouse cursor over the highlighted text and click Add a comment . When you're finished typing your comment, click Done to close the comment window."
    },
    {
      "title": "Open your document in Pages.",
      "content": "Open your document in Pages. If you want to highlight text and keep the highlighting in your final document, you can add a background color to any selected text. To get started, double-click a Pages document to open it in Pages , or launch Pages first and select the document from the File > Open menu. Pages has an orange icon with a pen, and you'll find it on your Launchpad. Alternatively, you can open Pages using any web browser at https://www.icloud.com/pages . You can use the browser application to edit any Pages documents you have saved to your iCloud account."
    },
    {
      "title": "Select the text you want to highlight.",
      "content": "Select the text you want to highlight. To do so, simply click and drag over the text that you want to highlight. This will temporarily highlight the text. If the text is in a text box or a shape, click the text box or shape instead."
    },
    {
      "title": "Click the Format tab.",
      "content": "Click the Format tab. It's the paintbrush icon in the upper-right corner. This displays the Format panel to the right."
    },
    {
      "title": "Click Style.",
      "content": "Click Style . You'll see this near the top of the Format sidebar. [3] X Research source"
    },
    {
      "title": "Click the gear icon in the Font section.",
      "content": "Click the gear icon in the Font section. It's next to the bold (\" B \"), italic (\" I \"), underline (\" U \"), and strikethrough (\" S \") buttons in the Format menu to the right. This opens the Advanced Options menu."
    },
    {
      "title": "Select a color from the \"Text Background\" area.",
      "content": "Select a color from the \"Text Background\" area. You'll see a black and white button at the bottom of the window, and a color wheel icon next to it. You can click this button to choose from a few colored swatches for a quick change, or select a custom color by clicking the color wheel icon. Once selected, the background of the selected text will change to give the selected text a highlight effect. If you're using Pages in your web browser, check the box next to \"Text Background,\" then click the color picker. [4] X Research source If you have a text box or shape selected, click the colored box next to \"Fill\" in the Format panel to the right to select a color for the entire text box or shape. To remove the background color, click the swatch icon that resembles a white square with a red line through it."
    },
    {
      "title": "Open Pages.",
      "content": "Open Pages. If you just want to bring attention to a sentence or passage but don't want the highlighting to appear in your final document, you can use Pages' document review features to temporarily highlight text. Pages has an orange icon with a white pen. This tool is great for working on shared documents on which you need to leave comments or call attention to specific text. Pages is available for free from the App Store. If you haven't already done so, go ahead and download Pages from the Apps Store."
    },
    {
      "title": "Open a document.",
      "content": "Open a document. Tap any document on the Documents page to open it. By default, documents that you save on your Mac are automatically saved to your iCloud account. Alternatively, you can tap Create Document to create a new document."
    },
    {
      "title": "Select the text you want to highlight.",
      "content": "Select the text you want to highlight. Tap a word to select it, then tap and drag the text marker (which is a blue dot with a line) on either side of the highlighted word to select additional text. Once you've selected some text, a black menu bar will pop up. If the text is in a text box or shape, tap the text box or shape instead."
    },
    {
      "title": "Tap Highlight on the black menu bar.",
      "content": "Tap Highlight on the black menu bar. If you don't see this option, tap the right-arrow on the right side of the menu bar to view additional options. Once selected, the text will be highlighted. Tapping the highlighted text gives you the opportunity to add a comment for your reference. If you want to delete the highlight, just select the text and tap Delete at the bottom below your name."
    },
    {
      "title": "Open Pages.",
      "content": "Open Pages. If you want to highlight text and keep the highlighting in your final document, you can add a background color to any selected text. Pages has an orange icon with a white pen. Pages is available for free from the App Store. If you haven't already done so, go ahead and download Pages from the Apps Store."
    },
    {
      "title": "Open a document.",
      "content": "Open a document. Tap any document on the Documents page to open it. By default, documents that you save on your Mac are automatically saved to your iCloud account. Alternatively, you can tap Create Document to create a new document."
    },
    {
      "title": "Select the text you want to highlight.",
      "content": "Select the text you want to highlight. To do so, tap and hold a word to select it. Then tap and drag the text markers on either side of the text to highlight the entire section you want to highlight. If the text is in a text box or shape, tap the text box or shape instead."
    },
    {
      "title": "Tap the Paintbrush icon.",
      "content": "Tap the Paintbrush icon. It's at the top of the page. This opens the Format menu."
    },
    {
      "title": "Tap ⋯.",
      "content": "Tap ⋯ . It's the button with three dots next to the bold (\" B \"), italic (\" I \"), underline (\" U \"), and strikethrough (\" S \") buttons in the Format menu. This opens the Advanced Options menu. If you have a text box or a shape selected, tap the colored box next to \"Fill\" instead."
    },
    {
      "title": "Scroll down and tap Text Background.",
      "content": "Scroll down and tap Text Background . It's at the bottom of the Advanced Options menu. This opens a pop-up with colored swatches you can select."
    },
    {
      "title": "Tap Preset or Color.",
      "content": "Tap Preset or Color . These are the two tabs at the top of the Text Background color pop-up. Preset allows you to select a color that matches the template you are using. Color gives you a wider range of colors to select from."
    },
    {
      "title": "Tap a color.",
      "content": "Tap a color. Tap any one of the colored swatches to select a background color for your text. This changes the background color for the text you have selected and creates a highlight effect. You can swipe right on the color swatches to display more color options. To remove a background, open the Text Background color options, and tap the Preset tab. Then swipe right and tap the No Fill option"
    }
  ]
}