{
  "url": "https://www.wikihow.com/Know-when-People-Are-Taking-Advantage-of-You",
  "title": "How to Know when People Are Taking Advantage of You",
  "steps": [
    {
      "title": "Recognize that if you suspect a problem, then a problem probably exists.",
      "content": "Recognize that if you suspect a problem, then a problem probably exists. Even if the person isn't actually trying to take advantage of you, something is wrong, because you don't feel happy with how the relationship is going right now. If you don't feel appreciated or cared about, that's a real problem, and it's worth looking for a solution. Even if misbehavior isn't malicious, it's still misbehavior. You have the right to say that they're upsetting you, and ask them to stop. Sometimes, two good people run into relationship problems. It's okay to talk about them, and to want things to change."
    },
    {
      "title": "Keep in mind that intent can be hard to judge.",
      "content": "Keep in mind that intent can be hard to judge. Sometimes people do bad things for sinister reasons, but other times, good people can do bad or unwise things by mistake. It's possible that this is a misunderstanding, and nobody is trying to hurt you. This can be very difficult to tease out, because you can't read minds. A few questions that may clarify things a little include: Have I ever talked to this person about how their behavior makes me feel? If I did try talking to them, did I express myself clearly? Or is it possible that they didn't understand me? Do they have a habit of dismissing my feelings, or do they often listen when I speak up? Is this behavior uncharacteristic of them? Do they usually show caring and consideration to me, or do they have a history of being a jerk? Does this person treat other people this way too? Does the presence of authority figures change their behavior? Do they only do this when they think there won't be witnesses, or do they do it regardless of who's around? (This can help you tease out whether they're malicious or oblivious.)"
    },
    {
      "title": "Take a moment to consider the person's limitations.",
      "content": "Take a moment to consider the person's limitations. Is their behavior reasonable, given their age and abilities? Does it make sense when you consider these things? Is it possible that you need to adjust your own behavior (like being a little more patient or a little more clear) to help make up for this? Use this information to adjust your expectations, or figure out the best way to handle the problem. Age and maturity: Kids are needy by nature. They also may struggle to communicate clearly. A young or immature person may need more coaching on how to handle things. If you're a parent or caregiver, your kid is going to ask for a lot of things, and the relationship may feel somewhat one-sided at times. Social skills: Some mental illnesses and conditions can cause people to struggle with social skills. For example, a person with social anxiety might ask you to do \"trivial\" things like ordering for them at a restaurant because it's really hard for them, and a person with borderline personality disorder might not realize when they're crossing a boundary. Cluelessness: Not everyone can take a hint. Some people, especially kids and people with disabilities like autism, may not catch subtle signs that you're upset. You may have to explain it to them in order for them to be aware there's a problem. Mental illness: People with anxiety, depression, and other mental illnesses may sometimes seem to be overreacting or \"playing the victim,\" when in truth they are suffering from an illness that distorts their sense of reality. This isn't healthy, but it usually isn't on purpose."
    },
    {
      "title": "Think about how much effort you're willing to put into this situation.",
      "content": "Think about how much effort you're willing to put into this situation. Are you very invested in this relationship, or do you think you'd rather just let it fade? There isn't necessarily a right or wrong answer here. Think about whether you want to put in the work to help fix it."
    },
    {
      "title": "Know when taking your money or things is a problem.",
      "content": "Know when taking your money or things is a problem. Friends and relatives will sometimes borrow things, from books to money. But when it's a loan and not a gift, they'll make a good-faith effort to return it. Do they act offended or make repeated excuses when you ask for your thing(s) back? Does it feel like you have to endlessly pester them just to get something back? Does the amount they owe you keep growing and growing? If they borrowed money, are they working towards paying you back? Or do you notice them buying lots of trivial things without offering installments? If they lose or break an item they borrowed, do they replace it for you?"
    },
    {
      "title": "Recognize mooching.",
      "content": "Recognize mooching . A moocher will rely on you continuously providing help or resources while offering nothing in return and taking you for granted. They will ignore or make halfhearted \"attempts\" to meet your expectations (e.g. staying in your house in exchange for help with cleaning). Unlike well-meaning people in need, a moocher isn't a good listener and has no desire for a reciprocal relationship. A moocher tries to extend their free ride while expending the minimum effort. They show little gratitude. They won't try to \"pay you back\" by helping out how they can. In fact, they may just create more work for you. They'll agree to change if they think their mooching situation is at risk, then slide back into their old habits before long."
    },
    {
      "title": "Recognize the expectation to work for free.",
      "content": "Recognize the expectation to work for free. Friends may occasionally volunteer to give something for free, from a quick website fix to a baby blanket. But someone shouldn't push you to give hours of your time and skilled labor with nothing in return. Here are some examples: Job opportunities that say \"you could earn as much as...\" (without mentioning that the minimum is $0 and you'll work many unpaid hours) Someone asking for your art or work for free so you can \"be paid in exposure\" Pressing you to offer free work, especially if you already said no"
    },
    {
      "title": "Ask if they're asking your help to get away with something wrong.",
      "content": "Ask if they're asking your help to get away with something wrong. From copying your homework to asking you to be an alibi while they cheat on their partner, it's wrong for people to use you to do something wrong. Do they ask to copy your work and pass it off as their own? Do they ask you to tell serious lies for them? Are they asking you to do things you could get in trouble for?"
    },
    {
      "title": "Identify digital exploitation.",
      "content": "Identify digital exploitation. Some people will try to use your work, photos, or videos to earn popularity or money without regard for reciprocity or your personal boundaries. Using you to make lots of content with nothing in return Posting embarrassing or harmful things about you, from showing you drunk at a party to talking about how you were potty trained, and refusing to take them down Demanding free promotional posts or marketing help, without offering anything in return"
    },
    {
      "title": "Know that misunderstandings or personal differences turn into exploitation when someone refuses to listen to your \"no\" so they can benefit.",
      "content": "Know that misunderstandings or personal differences turn into exploitation when someone refuses to listen to your \"no\" so they can benefit. Innocent misunderstandings or different preferences can happen. But if you clearly assert your needs and get blown off, something more serious is happening. If you haven't been clear yet, try using I language or the nonviolent communication style. A good person will listen and adjust their behavior. Someone who doesn't mean well will make excuses or blow you off."
    },
    {
      "title": "Notice if they listen when you talk about your own life and problems.",
      "content": "Notice if they listen when you talk about your own life and problems. Do they show interest? Do they stay on-topic, or do they get bored or steer the conversation back to themselves? Is it frustrating to try to be heard? Some people are more self-centered than others, but a good friend will usually make an effort to listen and show that they care."
    },
    {
      "title": "Pay attention to whether your interactions are centered around them wanting favors.",
      "content": "Pay attention to whether your interactions are centered around them wanting favors. Do they only strike up conversations when they need something, or do they like chatting too? [1] X Research source Does the conversation end shortly after you give them what they want, or do they continue spending time with you? [2] X Expert Source Hyungbum Kang, MA, MSW, LCSW, MAC Licensed Clinical Social Worker Expert Interview. 22 July 2021. A good friend may ask for favors sometimes. They'll want to spend time with you just for fun too, and they'll also be willing to do reasonable favors for you if you ask."
    },
    {
      "title": "Ask yourself if the things they request of you are reasonable and harmless.",
      "content": "Ask yourself if the things they request of you are reasonable and harmless. Good people are willing to put themselves in your shoes for a moment, and ask themselves if the favor is reasonable and fair. They wouldn't expect you to do something too stressful, harmful, or humiliating. Would you be willing to ask someone else for the same favor? Are they asking you to break rules or get in trouble? Are they encouraging you to do something too dangerous? Are they saying you should do something that seems undignified? Are they giggling about it, or wanting to take photos or video? If you express reservations, do they take you seriously, or do they keep pushing?"
    },
    {
      "title": "Notice what happens when you set a boundary.",
      "content": "Notice what happens when you set a boundary. No means no. If you say something like \"No thanks\" or \"I need to think about it first,\" do they accept that answer, or push back? A good friend is willing to take \"no\" for an answer, because they recognize that you may have valid reasons to feel the way you do. A bad friend is only interested in what they want, so they may steamroll, guilt, or manipulate you into doing something you said \"no\" to. They may blackmail or bribe you, in order to get you to do what they want."
    },
    {
      "title": "Consider if you're always giving and they're always receiving.",
      "content": "Consider if you're always giving and they're always receiving. Healthy relationships involve a little give-and-take, with you being a giver sometimes, and sometimes the other person giving things to you. If you're constantly giving and they aren't putting in any effort to give back, then they may not be invested in the relationship. [3] X Expert Source Hyungbum Kang, MA, MSW, LCSW, MAC Licensed Clinical Social Worker Expert Interview. 22 July 2021. Consider emotional labor too. Are you always comforting and supporting them, without them ever doing the same for you when you need them? If you are both reasonably healthy adults, then there is no excuse for them not to put effort into the relationship or treat you as an equal."
    },
    {
      "title": "Notice if spending time with them tends to make you feel drained.",
      "content": "Notice if spending time with them tends to make you feel drained. A positive relationship usually makes you feel positive, and you tend to smile (not frown) when you think of them. If they exhaust you, that's a sign that the relationship is one-sided. [4] X Research source"
    },
    {
      "title": "Recognize excessive or goal-driven flattery.",
      "content": "Recognize excessive or goal-driven flattery. Good relationships do involve compliments and praise. But if someone praises you a lot, or praises you mostly before they need something and after you say yes, it might be that they're using praise as a tool to get what they want. Beware praise that sounds insincere, or related to hidden motives. [5] X Research source \"You're so smart and generous. I bet you'd have an easy time figuring out my homework.\" \"You're just so good at laundry! You fold it so beautifully, and you're so reliable.\" \"I knew I could count on you to finish our presentation! You're so organized and good at writing. You do it way better than me!\""
    },
    {
      "title": "Notice attempts to pressure you into a quick decision.",
      "content": "Notice attempts to pressure you into a quick decision. Manipulative people may try to force you to choose quickly, so that you don't have time to fully think things through, or put yourself together enough to say no. \"There's no time! In or out?\" \"This is your only chance. Say yes now, or regret it forever.\" \"Tickets are going to run out any second now! Hurry if you want one!\""
    },
    {
      "title": "Pay attention to guilt trips.",
      "content": "Pay attention to guilt trips . People may manipulate you by painting you as cold, ungrateful, or other unflattering things, and then imply that the only way to show you aren't is to do whatever they want. Thus, you fall into the trap of either being \"bad\" or being completely obedient. Or they may start a self-pitying speech, expecting you to comfort them and agree to do what they want. \"I raised you, fed you, and clothed you! I am your father! You owe me!\" \"Sure, I guess I can handle being alone. All by myself. Without anyone or anything to comfort me or distract me from my tears.\" \"You're mad at me, I know it. I never do anything right. I'm so stupid and worthless. I don't know why you bother with me at all.\" \"I should have expected this. Nobody ever takes me seriously or listens to my ideas.\" \"All the popular girls at school have designer shoes! It's humiliating. Every night, I think about the shoes that you won't buy me, because you don't love me enough.\" \"People tell me that you are ungrateful. I tell them that's ridiculous. Of course you will come visit your mother for the holidays. You're a good daughter.\""
    },
    {
      "title": "Recognize if they punish you for saying no.",
      "content": "Recognize if they punish you for saying no. A good person is willing to recognize and respect your boundaries, even if they're a little disappointed. But a manipulative person won't take no for an answer, and may \"punish\" you if you dare to defy them. If you say no, they may use tactics like... The silent treatment Acting cold to you Withholding affection Refusing to invite or include you"
    },
    {
      "title": "Beware gaslighting.",
      "content": "Beware gaslighting . Gaslighting is a manipulation tactic in which someone tells you lies or judges you in order to make you doubt yourself. They want to make you feel confused and unable to trust yourself or your memory, so that you will believe whatever they say (even when it's completely false or unfair). \"I never said that. You're making things up.\" \"You're being too sensitive. It wasn't that bad.\" \"That's not what happened. You were the one who was calling names.\" \"I'm abusing you? No, YOU'RE abusing ME!\""
    },
    {
      "title": "Pay attention to other manipulative behavior.",
      "content": "Pay attention to other manipulative behavior . There are many ways that someone can manipulate you, and this list isn't all-inclusive. If you think that someone may be manipulative, try asking a trusted friend or mentor for advice and an opinion on the other person's behavior. You can also read more about types of manipulative behavior, and see if something sounds familiar."
    },
    {
      "title": "Recognize what is fair to yourself.",
      "content": "Recognize what is fair to yourself. Especially if you have self-esteem issues or grew up in a manipulative environment, you may have a hard time standing up for yourself. Respecting yourself, and not putting up with a bad situation in silence, is an important part of having healthy and mature relationships. [6] X Expert Source Hyungbum Kang, MA, MSW, LCSW, MAC Licensed Clinical Social Worker Expert Interview. 22 July 2021. Tell yourself: \"I have the right to decline a request if it's too much for me.\" \"I do not exist for the convenience of others. I'm allowed to make my own plans, and do my own thing with my time.\" \"I'm allowed to be upset with people.\" \"I should be able to assertively express myself if something is bothering me.\" \"I don't have to put up with people who manipulate me.\" \"I can leave a conversation if someone is mistreating me.\""
    },
    {
      "title": "Start with the most generous assumption, and adjust from there as needed.",
      "content": "Start with the most generous assumption, and adjust from there as needed. It's possible that the other person didn't realize that they were upsetting you, and may not have the best social skills or social awareness. Give them a real chance to understand the problem, and change their behavior. If they refuse, then adjust your expectations from there. For example, it's possible that your pushy sister is trying to manipulate you so that she can make fun of you behind your back... but it's also possible that she thinks she's being a good sister, and doesn't realize that she needs to let things go when you say \"no\" to her. For example, perhaps your friend has been blowing you off lately, and you have been wanting his help with a big problem. Start with the assumption that maybe your friend is really busy or dealing with a problem of his own and didn't know you needed him. Talk to him about it with the assumption that he means well, and then adjust your assumptions if he gives you evidence that he's been ignoring you on purpose."
    },
    {
      "title": "Take the person aside, and make \"I\" statements to describe how their behavior makes you feel.",
      "content": "Take the person aside, and make \"I\" statements to describe how their behavior makes you feel. A reasonable, kind person will care about how their behavior impacts you. Give it a try, and see if the person responds well to it. Here are some examples of talking about your feelings in an assertive, nonjudgmental way: \"When you ask me to make a fast decision, I can't think. I need time to think things over. Please give me more time before asking me to make a choice.\" \"Recently, you've often called me because you needed something, and ended the call shortly after I said yes. It makes me wonder if something has happened that harmed our relationship. I miss chatting with you.\" \"Sometimes, I feel uncomfortable when you push me to buy a revealing outfit at the mall. I know that you love showing off a little, and there's nothing wrong with that. I'm just not super comfortable doing that myself. I'd appreciate it if you wouldn't make a big deal of it if I say no to certain outfits sometimes.\""
    },
    {
      "title": "Set boundaries if the \"I\" language doesn't work.",
      "content": "Set boundaries if the \"I\" language doesn't work. Talking about your feelings can be very effective, but only if the other person actually cares about your feelings. If the person continues doing something after you've asked them to stop, be clear and direct with them. Here are some examples of direct communication: \"I need you to stop calling me that name. I don't like it, and it's not okay.\" \"I have asked you twice now to stop that. If you do it again, I will leave.\" \"If you are going to use me as a ride, then I need a contribution for gas money. And if you catcall women from my car, you will find yourself walking the rest of the way.\" \"Stop touching me. I said no.\" \"No. I can't drive you. I have plans. Call a cab or a ride sharing service.\""
    },
    {
      "title": "Re-evaluate your relationship with a person who ignores your feelings.",
      "content": "Re-evaluate your relationship with a person who ignores your feelings. In a healthy relationship, people care about whether they are hurting each other. If someone knowingly disregards your feelings, especially if they do it repeatedly, it might be time to reconsider whether you want to spend time with them. Reader Poll: We asked 695 wikiHow readers, and 53% agreed that the most effective way to deal with a manipulator is to cut ties and end the relationship . [Take Poll]"
    },
    {
      "title": "Consider counseling if you're in a bad situation, struggling with assertiveness, or dealing with people repeatedly taking advantage of you.",
      "content": "Consider counseling if you're in a bad situation, struggling with assertiveness, or dealing with people repeatedly taking advantage of you. It's okay needing help figuring out what's going on or how to respond. A good counselor or therapist will help you gain skills and plan what to do."
    },
    {
      "title": "Get emotional support, if needed.",
      "content": "Get emotional support, if needed. It's okay to be stressed about interpersonal conflicts. This is especially true if you aren't experienced with them, or if you struggle with your confidence. Reach out to people who are supportive and good at listening. Tell them what you're going through, and accept their help if you'd like. To avoid being seen as a gossip, talk to people who aren't in the same social circle as the person who is mistreating you. For example, if it's a work problem, then tell your family or friends from somewhere else, and if it's a family problem, talk to your friends. Talk to an authority figure if the person is making you feel unsafe, or interfering with your work. Explain the situation and how it's affecting you, say what you've tried doing, and ask for help."
    }
  ]
}