{
  "url": "https://www.wikihow.com/Get-a-Sick-Day-off-from-School-Without-Going-to-the-Doctor",
  "title": "How to “Get Sick” to Stay Home From School (& Avoid a Trip to the Doctor)",
  "steps": [
    {
      "title": "Pick a sickness and stick with it.",
      "content": "Pick a sickness and stick with it. If you want to stay home while avoiding a trip to the doctor, choose an illness that isn’t too severe. A cold, 24-hour stomach bug, or migraine are popular options that are easy to fake, but feel free to pick any illness that resolves naturally with rest. No matter what illness you choose, be sure to look up all the symptoms so you don’t overdo your performance. [1] X Research source A stomach virus is an excellent choice because most people get better on their own without medical attention. You can simply fake symptoms like cramping, nausea, or a fever. [2] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source A fever is another foolproof excuse to stay home (without going to the doctor) because you don’t need medication; treatment typically involves rest and hydration. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source A migraine is an excellent choice because it can hit you out of nowhere, and the symptoms aren’t as physical as other illnesses. [4] X Research source Reader Poll: We asked 978 wikiHow readers if they’d ever taken a fake sick day, and 76% of them said yes. [Take Poll] So, you're definitely not alone."
    },
    {
      "title": "Complain about feeling sick the day before you want to miss class.",
      "content": "Complain about feeling sick the day before you want to miss class. People don't generally get sick all of a sudden, so start mentioning your symptoms the day before to make your act seem more convincing. If you want to stay home from school on Friday, for example, tell your parents about your symptoms on Thursday. [5] X Research source You can slowly bring up your “illness” by saying things like: “My head has been hurting all day.” “I haven't been feeling too well since I ate the hot lunch at school.” “My entire body aches, and I am SO exhausted. I could barely walk to class earlier.” “A lot of my classmates have been coughing in class, and my throat feels really weird now.”"
    },
    {
      "title": "Seem disinterested in the activities that you normally enjoy.",
      "content": "Seem disinterested in the activities that you normally enjoy. To convince your parents that you’re sick, decline to participate in your favorite activities. You might skip out on shopping, watching a movie, or playing video games. Or, you could even cancel plans with your friends. By changing up your behavior, your parents might suspect that something’s wrong with you. If you want to take it a step further, zone out in the middle of conversation so you seem super tired, or go to sleep way earlier than usual. If your parents ask you if you’re okay, emphasize that you need to rest (instead of directly stating that you may miss school). You could say, “I’m going to bed early because I don’t feel well. Can you pop into my room in the morning to make sure that I wake up on time?”"
    },
    {
      "title": "Pick at your food to make it seem like you have no appetite.",
      "content": "Pick at your food to make it seem like you have no appetite. A common symptom of many illnesses is a loss of appetite or a stomach ache. To look like you’re having stomach issues, act disinterested in your food and try to eat less than you normally would. You can always hide snacks in your bedroom to eat later on (so you don’t get hungry at night). [6] X Research source In the middle of your meal, excuse yourself to use the bathroom and stay in there for 10 minutes. This gives the impression that you’re not feeling well, without having to fake any physical symptoms. When you return to the table, let your parents \"know\" that your stomach hurts by saying things like: “Sorry I was gone for so long, my stomach feels weird.” “I'm not sure if I can finish dinner, I don’t feel very well.” “Can I be excused? My stomach is hurting and I think I want to lay down for a moment.” Respiratory diseases can also produce a loss of appetite without any stomach issues. To fake that, simply pick at your food, but don't go to the bathroom. Say something like \"I'm not very hungry and my throat hurts\"."
    },
    {
      "title": "Wake up your parents in the middle of the night.",
      "content": "Wake up your parents in the middle of the night. Set an alarm around 2 or 3 AM so you can tell your parents that you’re not feeling well. Be sure to set your alarm on a low volume (or vibrate) so they don’t hear it go off, and rub your face with your hands to appear flushed. Walk into your parents’ room and ask them to feel your forehead because you think you might be sick."
    },
    {
      "title": "Increase your temperature if you’re faking a fever.",
      "content": "Increase your temperature if you’re faking a fever. Before telling your parents that you have a fever, soak a towel in hot water and place it over your forehead. Remove the towel, then immediately ask your parents to check if you feel warmer than usual. If your parents take your temperature with a thermometer, try to drink something warm right before, or rub the tip of the thermometer with your fingers before handing it to them. [7] X Research source You can also put on a few layers of heavy clothing, then do jumping jacks, high-knees, or mountain climbers for one minute. Exercising elevates your body temperature, so your parents are more likely to believe that you’re ill. Remember, you have a fever when your temperature rises above its normal range, which is about 98.6 °F (37.0 °C). To avoid a trip to the doctor, practice taking your temperature after drinking something warm or rubbing your fingers over the tip of the thermometer. Aim for a temperature between 98.6 °F (37.0 °C) and 103 °F (39 °C). [8] X Research source"
    },
    {
      "title": "Slow down your movements to fake exhaustion.",
      "content": "Slow down your movements to fake exhaustion. Since your body works overtime to fight off viruses and other fever-causing ailments, being sick can make you feel extremely tired. To show your parents that you have absolutely no energy, slow down your movements when you wake up and act like you’re struggling to get ready for school. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Lay down on the couch or rest your head on the table at breakfast. Walk out of your bedroom at a slower pace, and rub your eyes to look extra tired. When you’re putting on your clothes, you could even miss a few buttons on your shirt, wear mismatched socks, or forget to tie your shoelaces. If you don't fake any other symptoms, this may lead your parents to believe that you're sleep deprived instead of sick. However, they might then decide to let you stay home anyway, so you can catch up on sleep."
    },
    {
      "title": "Act sensitive to light, sound, and noises if you’re faking a migraine.",
      "content": "Act sensitive to light, sound, and noises if you’re faking a migraine. A migraine is an intense headache that usually occurs on one side of your head. It can last between 4-72 hours, and there isn’t a method that your parents can use to check if you have one. Just describe a severe throbbing pain or pulsing sensation on one side of your head, and squint your eyes to appear sensitive to light. [10] X Research source Along with head pain and sensitivity to stimuli, other symptoms of migraines include: nausea, vomiting, upset stomach, loss of appetite, pale skin, chills or sweats, tiredness, dizziness and blurred vision, and tender scalp. [11] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source You can fake dizziness or blurred vision by walking hesitantly and squinting a lot."
    },
    {
      "title": "Act nauseous if you’re faking a stomach virus.",
      "content": "Act nauseous if you’re faking a stomach virus. Tell your parents that you think you’re about to throw up, and ask them to gently pat your back to ease your symptoms. You can rub your hand over your stomach throughout the day to act out additional symptoms like abdominal cramps and pain. [12] X Research source You can also try fake gagging or dry heaving if you want to act nauseous: think about something that grosses you out (like unclogging the drain in your shower or watching blackhead removal videos), then start groaning and making retching sounds. Other symptoms of a stomach virus include: diarrhea, vomiting, muscle aches or headaches, and low-grade fever. [13] X Research source"
    },
    {
      "title": "Pretend like you have the chills if you’re faking the flu.",
      "content": "Pretend like you have the chills if you’re faking the flu. To imitate having the chills, shake your entire body and chatter your teeth. Wear several layers of clothing, or cover yourself in a thick blanket if you’re sitting down. You could even sneak in an ice cold shower in the morning to make your skin feel cool to the touch. Other symptoms of the flu include cough, sore throat, runny or stuffy nose, muscle or body aches, headaches, and fatigue. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Plant the idea that you might need to stay home.",
      "content": "Plant the idea that you might need to stay home. Instead of directly stating that you need to skip school, think about what happened the last time you were legitimately sick (and your parents let you stay home). Did you complain about being sick loudly? Or, did you have a specific symptom that your parents were concerned about? Try to recreate your behavior from a real experience, and drop subtle hints that your condition is truly terrible: “I hope I feel better after eating breakfast because my sinuses are killing me.” “I don’t know how I’m going to make it through class today. I feel absolutely terrible.” “I didn’t think it was possible, but my head hurts even worse than the last time I had the flu.” “Instead of having orange juice for breakfast, can you please make me a cup of tea? My throat still feels super sore from yesterday.”"
    },
    {
      "title": "Ask your parents if they can wake you up at a later time.",
      "content": "Ask your parents if they can wake you up at a later time. On the morning that you want to miss class, stay in bed a little longer than usual. If your parents enter your room, tell them that you didn’t get any sleep, and ask if they can wake you up in 10-15 minutes. Making it seem like you can’t get out of bed makes your performance more believable. You might say: “I kept waking up in the middle of the night, so I didn’t get any sleep. Can you wake me up in 15 minutes?” “I’m so exhausted. Please let me stay in bed for just 10 more minutes. I just can’t get up right now.” “I’ve never felt so tired in my entire life. I promise I’ll get up in 10 minutes, but I just need to rest for a little longer.”"
    },
    {
      "title": "Emphasize your symptoms at breakfast.",
      "content": "Emphasize your symptoms at breakfast. To convince your parents that you’re sick, pick at your food so it looks like you have no appetite. They’ll be especially worried if you normally dig in, or if they make your favorite breakfast. [15] X Research source"
    },
    {
      "title": "Ask your parents for favors.",
      "content": "Ask your parents for favors. To really sell that you’re feeling unwell, ask your parents for small favors since you don’t have any energy to do them yourself. You might request a cup of tea to soothe your throat, or ask them to bring you some fuzzy socks or an extra blanket because you have the chills."
    },
    {
      "title": "Don't overly stress your performance.",
      "content": "Don't overly stress your performance. If you want to stay home without going to the doctor, you have to convey that you're sick but not sick enough to need medical care. Avoid suddenly showing all of your symptoms at once, and try to fake symptoms that cannot be treated with OTC medication."
    },
    {
      "title": "Tell your parents that you couldn’t finish your homework.",
      "content": "Tell your parents that you couldn’t finish your homework. If your symptoms aren’t convincing your parents, mention that you aren’t prepared for class because you didn’t get to finish an assignment. Stress that your symptoms were too severe so you couldn’t focus on completing it the day before, and tell them that you can try to work on it later in the day: “I couldn’t finish my math homework because my head was hurting so much yesterday. Can I please stay home and try to finish it when I’m feeling better? I don’t want to get an F.” “I can’t go to class today. I didn’t get to finish my project because I felt terrible and went to sleep early. I can work on it later today when I’m feeling better.” “Please don’t make me go to school today. I didn’t get to work on my assignment because I felt sick, and I don’t want to get a bad grade. I can finish it later today.”"
    },
    {
      "title": "Let your parents know that you’re not missing anything important in class.",
      "content": "Let your parents know that you’re not missing anything important in class. If your parents still don’t suggest that you can stay home, tell them that you’re not missing any lessons or exams. Highlight that you don’t want to be around other students in your current condition, and/or offer to make up any work you miss. “I promise to make up anything that I miss in class over the weekend.” “We’re having a substitute today, so we’re not learning anything important in class.” “We just had an exam on Friday, so we’re just having a movie day today. I won’t be missing anything important.” Don’t make it too obvious that there's nothing going on in school that day. It might clue your parents in that you want to skip school."
    },
    {
      "title": "Make school seem like your priority.",
      "content": "Make school seem like your priority. If your parents let you skip school, make sure to protest a little bit so it doesn’t seem like you’re faking an illness. Mention a specific event at school that you don’t want to miss, or ask your parents if they’re really okay with you staying home. [16] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source You could say, “Man, I was really looking forward to pizza day today!” or “But, what about band practice?!” If your parents rarely let you miss school, only bring up events that don’t involve your grades. For instance, you might want to steer clear of saying you have a big exam or that you’ll fall behind in class."
    },
    {
      "title": "Show signs of improvement as the day goes on.",
      "content": "Show signs of improvement as the day goes on. If your parents let you stay home, stay in bed for most of the day so you can gradually start to “feel better.” Call your parents right before they come home from work to tell them that you’re okay. Or, call them in the middle of the day to let them know you don’t have certain symptoms anymore. If you aren’t better by the end of the day, your parents might try to take you to the doctor. If this happens, point out that you feel much better than before, or tell them that you’ll go if you don’t feel better by the next morning. Be warned that if you refuse to go to the doctor after your parents suggest it, they might then know you’re faking it."
    }
  ]
}