{
  "url": "https://www.wikihow.com/Kill-Mold",
  "title": "How to Kill Mold",
  "steps": [
    {
      "title": "Open a window and turn on a vent or fan to ventilate the room.",
      "content": "Open a window and turn on a vent or fan to ventilate the room. Both mold and the products you’ll use to clean it can irritate your eyes, throat, and respiratory system. Opening your windows will allow the air to circulate around the room so you aren’t exposed to the fumes for too long. If you have vents in the room where you're cleaning, turn those on, as well. Additionally, angle a fan so it blows the fumes away from you and toward the window. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If it’s cold outside, you still need to open at least 1 window to allow the air to circulate in the room."
    },
    {
      "title": "Put on a facemask, gloves, and protective eyewear.",
      "content": "Put on a facemask, gloves, and protective eyewear. Mold can cause an upper respiratory if you breathe in the spores. Similarly, fumes from the cleaning products can irritate your airways, eyes, and skin. Make sure you’re wearing your protective gear during the entire time you’re cleaning up the mold. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source It’s also a good idea to wear long pants, a long-sleeved shirt, and rubber boots, if you have them. This will protect your skin while you clean."
    },
    {
      "title": "Read all of the instructions for using your cleaning product.",
      "content": "Read all of the instructions for using your cleaning product. Some cleaning products contain harsh ingredients, and using them incorrectly can be harmful to your health. Additionally, you could accidentally damage the surface you’re cleaning. It’s best to read and follow the instructions carefully. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Read the precautions and warnings provided by the manufacturer."
    },
    {
      "title": "Avoid mixing bleach with ammonia.",
      "content": "Avoid mixing bleach with ammonia. If mixed together, bleach and ammonia create toxic fumes that can be very hazardous to your health. It’s very important that you avoid combining them. Read the labels on the products you’re using so you know if they contain bleach or ammonia. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source In general, it’s best to just avoid combining cleaning products all together."
    },
    {
      "title": "Throw away absorbent or porous items that are moldy.",
      "content": "Throw away absorbent or porous items that are moldy. These items include things like drywall, upholstered furniture, carpet, rugs, ceiling tiles, and art, which either have holes in the surface of them or absorb liquids. Unfortunately, the mold spores can get into the pores of the material and continue to grow, even after you clean the item. Since those spores also reproduce and continue to spread the mold, it’s best to get them out of your home. [7] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If an item can be laundered, then you may be able to salvage it. For instance, you may be able to wash a blanket or curtains in a washing machine."
    },
    {
      "title": "Use bleach to effectively kill mold on surfaces.",
      "content": "Use bleach to effectively kill mold on surfaces. [8] X Expert Source Mike Kapur Certified Mold Assessor & Home Inspector, Sonic Home Inspections Expert Interview. 19 August 2020. Make a bleach solution by adding 1 cup (240 mL) of bleach to 1 gallon (3.8 L) of water. Put the solution in a bucket or spray bottle. Then, apply it directly onto the mold when you’re ready to use it. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Be very careful when cleaning with bleach. It can irritate both your lungs and your skin. Additionally, it may stain fabrics or carpet if you splash or spill it. Don’t ever combine bleach with ammonia or a cleaning product that contains ammonia."
    },
    {
      "title": "Opt for hydrogen peroxide as an effective bleach alternative.",
      "content": "Opt for hydrogen peroxide as an effective bleach alternative. Get a bottle of 3% concentration hydrogen peroxide, and don’t dilute it. Pour the hydrogen peroxide into a spray bottle or a bucket. Then, spray or sponge the hydrogen peroxide directly onto the mold. [10] X Research source Hydrogen peroxide is both antibacterial and antifungal. Additionally, it cleans about as effectively as bleach, and it doesn’t create harsh fumes. However, it may stain fabric or carpet, so be careful not to spill or splash it."
    },
    {
      "title": "Use white vinegar to kill the mold",
      "content": "Use white vinegar to kill the mold if you want a natural treatment. [11] X Expert Source Mike Kapur Certified Mold Assessor & Home Inspector, Sonic Home Inspections Expert Interview. 19 August 2020. Don’t dilute the vinegar before you use it. Instead, spray or sponge it directly onto the mold. [12] X Expert Source Susan Stocker Professional Cleaner Expert Interview. 8 November 2019. Vinegar has a very strong smell that you may not like. However, it will fade away over time. As another option, you can add your favorite essential oil to the vinegar to reduce the smell."
    },
    {
      "title": "Use baking soda for a natural option that also removes odor.",
      "content": "Use baking soda for a natural option that also removes odor. Fill a spray bottle with warm water, then add .25 tbsp (5 g) of baking soda. Shake the bottle to mix the 2 ingredients. Then, spray the baking soda onto the mold when you’re ready to use it. [13] X Expert Source Susan Stocker Professional Cleaner Expert Interview. 8 November 2019. Baking soda is a very effective natural cleaner. Plus, it’s odor absorbent, so it may help you get rid of the musty mold smell."
    },
    {
      "title": "Try borax for a natural mold treatment.",
      "content": "Try borax for a natural mold treatment. Add 1 cup (204 g) of borax to 1 gallon (3.8 L) of water in bucket. Stir the solution to combine the ingredients, and transfer some of the solution to a spray bottle, if you have one. Then, apply the cleaner to the wall by spraying it or sponging it over the mold. [14] X Research source You can find borax near the laundry supplies at your local department store or online."
    },
    {
      "title": "Use tea tree oil if enjoy cleaning with essential oils.",
      "content": "Use tea tree oil if enjoy cleaning with essential oils. Add 1 teaspoon (4.9 mL) of tea tree oil to 1 cup (240 mL) of warm water in a spray bottle or bowl. Then, apply the treatment directly onto the mold. It’s best not to rinse tea tree oil after you apply it, as it’s nontoxic and will prevent the mold from coming back. [15] X Research source Tea tree oil is antifungal and antibacterial, and it may be the most effective natural cleaner for mold. Additionally, it’s not harmful to people or pets. However, it can be a bit expensive, but you don’t need very much to treat mold. Make sure the tea tree oil you choose is labeled as coming from Melaleuca Alternifolia, which is the technical name for tea trees."
    },
    {
      "title": "Make a 1:1 solution of clear ammonia and water for a strong cleaner.",
      "content": "Make a 1:1 solution of clear ammonia and water for a strong cleaner. [16] X Expert Source Mike Kapur Certified Mold Assessor & Home Inspector, Sonic Home Inspections Expert Interview. 19 August 2020. Add the ingredients to a spray bottle or bucket, then shake or stir to mix them together. Next, apply the ammonia-water solution directly onto the mold with your spray bottle or a sponge. [17] X Research source You can find clear ammonia in your cleaning aisle. Don’t use a product that isn't labeled as “clear” to clean mold. Never, ever combine ammonia with bleach or a product that contains bleach. Ammonia may need to set longer than other mold treatments, so you may want to give it up to 3 hours to treat the mold."
    },
    {
      "title": "Purchase a commercial bleach cleaner for an easy option.",
      "content": "Purchase a commercial bleach cleaner for an easy option. You can find several mold treatments available for purchase, or you can just get a cleaner that contains bleach. Check the label to make sure that the product you choose says it will kill mold. [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You can find these products on the cleaning aisle at your local department store or online."
    },
    {
      "title": "Scrub the mold with soap and water to clean the surface.",
      "content": "Scrub the mold with soap and water to clean the surface. Add about 2 tablespoons (30 mL) of a mild dish detergent to a bucket of warm water, then stir to mix them. Dip a stiff-bristled brush into the soapy water, then scrub the affected area. Rinse the brush in the bucket often to keep the brush clean as you scrub away the mold. Remove as much of the mold as you can. [19] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source The root of the mold will likely remain on the surface, even if you don’t see it. However, scrubbing the area with soap and water will make it easier for the cleaning product you use to penetrate to the root of the mold and kill it."
    },
    {
      "title": "Apply your cleaning solution to the mold to kill it.",
      "content": "Apply your cleaning solution to the mold to kill it. Use a spray bottle or sponge to apply the solution to the moldy area. Go over the area several times to make sure it’s fully saturated. You want the cleaning solution to penetrate the mold to effectively kill it. [20] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source You don’t need to scrub the area at this time."
    },
    {
      "title": "Allow the cleaner to sit for 15 minutes to 1 hour so it penetrates the root.",
      "content": "Allow the cleaner to sit for 15 minutes to 1 hour so it penetrates the root. This gives the treatment time to work. Harsh treatments like bleach, hydrogen peroxide, and ammonia typically work quickly. Alternatively, natural treatments like white vinegar, baking soda, borax, and tea tree oil often require longer to work. [21] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source You may want to periodically apply more cleaner, depending on the surface you’re treating. If the liquid cleaner seems to be pooling below the mold-affected area, you may want to add more cleaner and soak up the excess liquid."
    },
    {
      "title": "Scrub the surface with a stiff-bristled brush, if necessary.",
      "content": "Scrub the surface with a stiff-bristled brush, if necessary. If you removed all of the mold when you scrubbed the area with soap and water, then you don’t need to scrub. However, it’s best to scrub if you have lingering mold or a mold stain. Use your stiff-bristled brush to work the cleaner into the mold. Rinse your brush often to keep it clean. [22] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If necessary, you can apply more of the cleaning solution you’re using as you scrub the area. However, don’t switch cleaners, even if you’re unhappy with the results."
    },
    {
      "title": "Rinse and dry the area.",
      "content": "Rinse and dry the area. You don't need to rinse the area unless you prefer not to leave a residue. However, you do need to dry it. If you want to rinse the area, use clean water to remove the remnants of the cleaning solution. Then, pat the area dry with a clean towel. To speed up the drying process, blow the area with a fan. [23] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If you are unhappy with the results of your cleaning process, you can try again. However, before you try a different cleaner, thoroughly rinse the affected area to remove any remaining residue from your cleaning solution. Then, let the area fully dry before you try again."
    }
  ]
}