{
  "url": "https://www.wikihow.com/Make-Your-Leather-Jacket-Softer",
  "title": "How to Make Your Leather Jacket Softer",
  "steps": [
    {
      "title": "Wear your jacket to loosen it up.",
      "content": "Wear your jacket to loosen it up. This might sound too simple to be true, but it’s not! Leather can get stiff if it’s stored away for a long time. Wearing the jacket regularly might be all you need to soften it up a bit, so take it out once in a while to break it in. [1] X Research source Try to move around a bit while you’re wearing your jacket. Bend your elbows, raise your arms, twist back and forth, and do some other motions to soften up the leather. There’s no firm rule on how often you should wear your jacket to soften it. Every few weeks is a good goal."
    },
    {
      "title": "Crumple and roll around your jacket a little.",
      "content": "Crumple and roll around your jacket a little. Roughing up your jacket a little can help a too. Try rolling it in a ball, tossing it around, and bending it back and forth. This can work out stiffness and make your jacket more comfortable to wear. [2] X Research source Wear your jacket for a while after softening it up so it forms to your body."
    },
    {
      "title": "Wet your jacket to soften it.",
      "content": "Wet your jacket to soften it. This might sound weird, but water actually helps soften leather. If you have to go out and it’s raining lightly, wear your jacket and let it get wet. [3] X Expert Source Mallika Sharma Certified Leather Care Technician Expert Interview. 14 May 2021. If you live in a dry area, or just don’t feel like walking around in the rain, you could get similar results with a spritz bottle. Lightly spray the jacket to moisten it. The leather will soften and contour to your body better. This is only meant for light rain, not a heavy storm. If you do go out in heavy rain, remember to dry the jacket before putting it away. You can also condition your jacket by wearing it out in all kinds of different weather, like snow or sun. All these different conditions will give your jacket a cool, worn look. [4] X Research source"
    },
    {
      "title": "Move your arms around to help the wet jacket mold to you.",
      "content": "Move your arms around to help the wet jacket mold to you. While the jacket is wet, this is the perfect time to break it in a little. Move your arms, bend your elbows, twist around, wave, and make any other normal arm motions. As the jacket dries, it’ll naturally form around these movements, and should be less stiff in the future. [5] X Expert Source Mallika Sharma Certified Leather Care Technician Expert Interview. 14 May 2021."
    },
    {
      "title": "Keep the jacket on until it dries.",
      "content": "Keep the jacket on until it dries. Whether you took your jacket out in the rain or spritzed it with a spray bottle, put it on and leave it on until it dries. This way, it’ll mold to your body while it’s soft. If you got soaked in heavier rain than you expected, you can wipe the jacket down a little so you don’t get too wet."
    },
    {
      "title": "Wipe the jacket with a dry cloth to get rid of excess water.",
      "content": "Wipe the jacket with a dry cloth to get rid of excess water. Even if you wear the jacket until it's dry, there could still be some water droplets hiding. While some moisture is good for softening leather, storing your jacket while it’s still wet is bad for it. Always wipe the jacket down with a dry cloth or towel to get rid of any excess moisture before putting it away. [6] X Research source You might always want to hang your jacket to dry completely before putting it away if you got soaked in the rain. Always dry your jacket at room temperature. Don’t use a heat source like a radiator, or you could make it stiffen again."
    },
    {
      "title": "Clean your jacket",
      "content": "Clean your jacket before any conditioning treatments. No matter what conditioning you use, you don’t want any dust or dirt on the surface of the jacket. [7] X Research source You can wipe the jacket down with water and a mild detergent, or use a specialized leather cleaner. Either way, always clean the jacket before conditioning it. Remember to dry the jacket as well. Wipe it off with a towel and hang it to dry at room temperature. If you aren’t sure how to clean your jacket, then it’s best to bring it to a dry-cleaner to take care of."
    },
    {
      "title": "Apply a specialized leather conditioner to your jacket.",
      "content": "Apply a specialized leather conditioner to your jacket. Pour a bit of conditioner onto a clean rag and rub the conditioner into your jacket. Make sure you don't miss any spots. [8] X Research source When you're done, hang it up to dry. After a good conditioning, it should be nice and soft again. Instead of storing the jacket, you could also wear it right after. This will help it contour to your shape while it's soft. In general, a conditioning treatment will last about 6-12 months. You might have to reapply it once or twice a year to keep your jacket soft. [9] X Research source"
    },
    {
      "title": "Try castor oil for a cheaper solution.",
      "content": "Try castor oil for a cheaper solution. Instead of leather conditioner, castor oil can also work to soften leather. Pour some oil onto a clean sponge and wipe it all over the jacket. Leave the jacket for a few hours and let the oil soak in, then store it away normally. [10] X Research source You can get castor oil at most pharmacies. If the jacket is still too stiff, you can do this treatment more than once."
    },
    {
      "title": "Rub petroleum jelly onto the jacket for another option.",
      "content": "Rub petroleum jelly onto the jacket for another option. This can also help soften your leather jacket. Rub a small amount of petroleum jelly onto the jacket and let it soak in for a few hours. When you’re done, you can store the jacket normally. [11] X Research source If there is still jelly left on the jacket, you can wipe it off before putting it away."
    }
  ]
}