{
  "url": "https://www.wikihow.com/Look-Kawaii",
  "title": "How to Look Kawaii",
  "steps": [
    {
      "title": "Wear t-shirts or over-sized sweaters with soft prints and pastel colors.",
      "content": "Wear t-shirts or over-sized sweaters with soft prints and pastel colors. Dressing kawaii is a personal process, but you want to make sure you have at least one statement piece in every outfit that you create. Find your personal balance between comfort and fashion. Graphic t-shirts and sweatshirts make great statement pieces that are comfortable and cute. These can range from anime-inspired t-shirts with characters printed on them to sweatshirts with animal themes. For example, you might want an entire sweatshirt made into the face of a panda bear. One kawaii theme could be inspired by Sanrio! Pick pastels. Kawaii style often offsets bold designs with soft colors. Try creating an outfit base with creams, baby pink, lavender, light green, and baby blue, and sage green. Update classic styles with cute prints. For example, take a plain pair of cream Converse shoes and decorate them with stickers or painting them with pictures of characters you love! If you make your own clothing adjustments, you’ll have one-of-a-kind pieces! Add frills. The sweet baby doll look is an important part of kawaii styling. Try wearing blouses, dresses, and socks with lots of ruffles or pleats. You'll know when you have Enough! Another style of kawaii is Lolita(ぉぃた). Where the baby doll look is everywhere!"
    },
    {
      "title": "Follow kawaii blogs, and create a style board.",
      "content": "Follow kawaii blogs, and create a style board. Like any style, kawaii changes all the time. Unless you live in Japan, you're not going to see a lot of kawaii around you on the streets, so looking online can help you update your kawaii wardrobe. For example, current trends in kawaii include pleated, school-girl style skirts, anime girl school uniform, and chunky sweater layers in the classic kawaii pastel tones, like pink, purple, yellow, white, and blue! Search words like “kawaii outfits” and “Japanese fashion” on Tumblr or Pinterest to see pages of current images from the kawaii style. Look up certain companies like Sanrio and Rilakumma for more things to see. Follow blogs that strike your eye, and use these as inspiration for creating new outfits with clothes you already have. You can also buy clothes. Make a kawaii mood board online. Use sites like Pinterest or Polyvore to keep track of trends you like and to save your own ideal outfit combinations."
    },
    {
      "title": "Choose clothing that doesn't reveal too much.",
      "content": "Choose clothing that doesn't reveal too much. Kawaii clothing fits well but still leaves something to the imagination. It retains a kind of playful innocence. Kawaii is about balance and style. Frogs, pandas, cats, and Hello Kitty are very kawaii styles. They work for all genders, so try clothes and styles like that! For example, if you want to wear a short skirt, try pairing it with thigh-high socks, that maybe have paws on the bottom! The an oversized Sweater with a cute simple style and chunky platform shoes or just some converse!"
    },
    {
      "title": "Layer well.",
      "content": "Layer well. Layering is apart of kawaii fashion, no matter what specific style within kawaii you want to achieve. [1] X Research source Mix and match sweet patterns with bright colors. Wear bright leggings or tights underneath ruffled skirts or dresses. Pair a white long sleeve top with a colorful sleeveless dress."
    },
    {
      "title": "Add kawaii accessories.",
      "content": "Add kawaii accessories. Cute, fuzzy accessories are a staple of kawaii. You can try to let your accessories match your outfit, with either the colors being the same or having a matching print. Also popular are brightly colored accessories and accessories adorned with 'chibi,’ meaning small, adorable depictions of manga or anime characters, often with larger-than-life heads. [2] X Research source Keep a cute Tamagotchi or stuffed animal with you all the time. Small Tamagotchi toys can be attached to key chains or necklaces, and stuffed animals can peep out of bags. Some stuffed animals even have Velcro pads on the end of long limbs, enabling them to hang around your shoulder."
    },
    {
      "title": "Always carry a bag.",
      "content": "Always carry a bag. This is a practical way to carry your stuff, and it’s another way to show off your unique style. Use a messenger bag. You can get a plain one and decorate it with kawaii pins and patches, or try painting it with fabric paints. Messenger bags give you plenty of room to carry around your laptop, a notebook, or games. Find a unique cross-body bag. Many purses exist to fit your personal kawaii style. For example, you can find ones with large bows, bags made to look like animals, purses shaped like clouds, and purses with lots of frills. Try looking on auction sites like eBay or crafter sites like Etsy to find interesting, affordable bags that others won’t have."
    },
    {
      "title": "Curate your possessions.",
      "content": "Curate your possessions. Having cute everyday things that match your style is a large part of kawaii fashion. For example, if you're using a plain blue binder and yellow pencils at school, this doesn’t fit your aesthetic. Invest in some cute stationery, bento boxes, and bags. You can always order online if things like this aren’t available where you live. If you can’t buy them yourself, ask for kawaii gifts for your birthday and major holidays. or simply save up money of diy a fluffy ball with cute eyes and things like that."
    },
    {
      "title": "Wear base makeup sparingly.",
      "content": "Wear base makeup sparingly. Use a light-coverage foundation that looks natural. Avoid foundations that look thick or caked. Keep blush to a minimum."
    },
    {
      "title": "Focus on the eyes.",
      "content": "Focus on the eyes. In kawaii style, you want your eyes to look round and wide. [3] X Research source Use plenty of black mascara on both your top and bottom lashes. If you use eyeliner, use a black liquid liner close to your lash line. Don’t bring it out into a cat eye. Use colorful eyeshadow. Keep your eyeshadows colorful and light. Try a light pink, green, or blue. Avoid a smoky eye look, as this is more of a sexy style than kawaii. Use a white or skin-toned pencil to line your waterline. This will make your eyes appear brighter and wider."
    },
    {
      "title": "Wear nude lipsticks.",
      "content": "Wear nude lipsticks. In the kawaii style, lipstick should always be pink or coral, never dark. Apply lip gloss sparingly. If your skin is darker, you may want a slightly darker pink tone or even purple."
    },
    {
      "title": "Keep your nails neat and painted.",
      "content": "Keep your nails neat and painted. You’ll want to use a clear or soft pink polish to accentuate the innocence of your look. The kawaii style doesn’t use neon or dark colors. You should keep your nails short and rounded."
    },
    {
      "title": "Add perfume.",
      "content": "Add perfume. The perfume will add just hint of some extra to your stylized but still demur kawaii look. Go for a perfume that is mild and slightly sweet or floral. Spritz the perfume on your wrists and neck sparingly."
    },
    {
      "title": "Try out fringe or bangs.",
      "content": "Try out fringe or bangs. The classic kawaii hairstyle is medium to long hair with thick, straight across bangs. If you’re uncertain about cutting your bangs, try using a faux fringe hair clip."
    },
    {
      "title": "Consider color.",
      "content": "Consider color. If you want to go all out with your kawaii look, you might dye your hair. Classic kawaii hair colors include light pink, lavender, or white-blonde."
    },
    {
      "title": "Accessorize your hair.",
      "content": "Accessorize your hair. In kawaii style, hair accessories can help you to stand out even more. Look for unique headbands or make some yourself. Think pom poms, hearts, stars, animal ears, and glitter. Try wearing huge bows as these will give off a childish look. Style your hair into pigtails, and add in hair clips for more creativity."
    },
    {
      "title": "Smile and giggle frequently.",
      "content": "Smile and giggle frequently. This will accentuate the facial look you’ve created through your kawaii hair and make up. Nothing says kawaii like an adorable giggle. You should come across like a child who is genuinely amused about something."
    }
  ]
}