{
  "url": "https://www.wikihow.com/Heal-Facial-Skin-Fast",
  "title": "How to Heal Facial Skin Fast",
  "steps": [
    {
      "title": "Use cool water and mild soap to clean any open wounds.",
      "content": "Use cool water and mild soap to clean any open wounds. If you have an open cut on your face, hot water can make it worse. Cool water, on the other hand, will calm inflammation and help the cut close on its own so it can heal more quickly. Add gentle soap and dab at the wound to clean it. Then rinse it with cool water. Don't scrub it or rub it roughly, as this will likely increase inflammation. Use a mild soap that’s free of ingredients such as dyes and perfumes, since these can irritate the wound."
    },
    {
      "title": "Apply a thin layer of petroleum jelly or antibiotic ointment to open wounds.",
      "content": "Apply a thin layer of petroleum jelly or antibiotic ointment to open wounds. Antibiotic ointment thoroughly cleans the wound and keeps it from getting infected. You only need a small dab. Pat it on the wound, rather than trying to rub it in. [1] X Research source Alternatively, you can protect the wound and promote faster healing by adding a petroleum jelly. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Don't use hydrogen peroxide. Although it does clean the wound, it can also injure or kill skin cells, which will make it take even longer for the wound to heal."
    },
    {
      "title": "Cover the wound after cleaning to avoid infection.",
      "content": "Cover the wound after cleaning to avoid infection. If a cut becomes infected, it can take several weeks for it to heal. Unfortunately, using adhesive bandages on your face can be difficult because of the curves of the skin. Try to use the smallest bandage possible that completely covers the wound. If you can't find an adequate adhesive bandage, use non-stick dressing instead. [3] X Research source Avoid using gauze on facial wounds because the fiber can get into the wound and lead to infection."
    },
    {
      "title": "Seek medical treatment immediately if you have a deeper cut.",
      "content": "Seek medical treatment immediately if you have a deeper cut. If you can pull the edges of a deep cut or laceration apart, you'll likely need stitches to close the wound. Go to an emergency clinic to get it taken care of as soon as possible. [4] X Research source You should also seek immediate medical attention if the cut was caused by a dirty or rusty object, or if it's contaminated with dirt, gravel, or other debris. Apply pressure to the cut to stop the bleeding and keep your head elevated above your heart until you're able to get medical treatment."
    },
    {
      "title": "Eat a balanced diet to promote faster wound healing.",
      "content": "Eat a balanced diet to promote faster wound healing. When you have a wound, getting the right nutrients can make a difference. Eat a diet rich in whole grains, vegetables and fruits, lean protein (like beans and peas, soy, white meat poultry, and fish), and low-fat dairy. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid sugary foods and drinks, greasy junk foods, and beverages containing alcohol or caffeine. [6] X Research source Some vitamins and supplements, such as amino acids, vitamin C, and zinc, may help wounds heal more quickly. Talk to your doctor about whether you might benefit from taking vitamins or dietary supplements. There’s some evidence that short-term fasting (e.g., fasting overnight for 16 hours) can promote faster wound healing. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have any health conditions, such as diabetes or pregnancy, consult your doctor before fasting."
    },
    {
      "title": "Practice stress-relieving activities to help wounds heal faster.",
      "content": "Practice stress-relieving activities to help wounds heal faster. Stress can impact your body in all sorts of ways, including making it harder for your wounds to heal. If you’re feeling stressed, take time to do things that help you relax, like meditating, doing yoga, working on creative projects, or spending time with friends and family. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source When you’re stressed, your body produces higher amounts of a hormone called cortisol. Having too much cortisol in your system can interfere with the natural healing process."
    },
    {
      "title": "Steam your face before washing it to remove impurities.",
      "content": "Steam your face before washing it to remove impurities. The blemishes you have will heal more quickly if you keep your face as clean as possible. Steaming your face opens up your pores to release a lot of the dirt and oil that collects there and can cause additional blemishes. [9] X Research source Simply holding your face over a bowl of hot water for a minute or two enables you to clean your facial skin gently yet thoroughly. Avoid washing your face with hot water or applying heat directly to your face. This will increase blood flow to the surface of the skin and cause any blemishes to appear brighter and more inflamed."
    },
    {
      "title": "Avoid popping pimples or breaking the skin.",
      "content": "Avoid popping pimples or breaking the skin. While it can be tempting to pop a pimple, it won't make it go away any faster and might make it worse — especially if your hands are dirty. Popping a pimple can cause the bacteria in the pimple to spread to other parts of your face, leading to a larger breakout. [10] X Research source If you have an important event coming up and you want to have a pimple extracted, contact a dermatologist who can do this safely. Don't attempt a home extraction, as you could make the problem worse."
    },
    {
      "title": "Use aloe vera gel to hydrate and reduce inflammation.",
      "content": "Use aloe vera gel to hydrate and reduce inflammation. The same aloe vera gel that you use to calm your skin after a sunburn or other irritation can also minimize the appearance of pimples and other blemishes. By hydrating and reducing inflammation, the gel also helps your skin heal faster. Since aloe vera gel keeps your skin moist, it also protects against the over-drying effects of some anti-acne products, which can cause your skin to crack and bleed, making it take longer to heal."
    },
    {
      "title": "Give any new acne treatments at least 4 weeks to take effect.",
      "content": "Give any new acne treatments at least 4 weeks to take effect. Over-the-counter acne products can potentially heal your skin faster than it would heal on its own. However, a new acne product typically takes at least a month of regular usage before you'll start seeing noticeable results. Switching treatments too quickly can irritate your skin and make your acne worse. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Follow the ingredients on the package exactly. Do not apply an acne treatment more often than the package indicates. Most acne treatments make your skin more sensitive to light. For this reason, it's often better to apply acne treatments before going to bed rather than first thing in the morning. If you're using an acne treatment during the day, make sure you wear an oil-free sunscreen. With some treatments, you'll feel like your skin is getting worse when you first start using it, rather than better. Typically, this is because the medication is pulling all the bacteria to the surface of your skin."
    },
    {
      "title": "Add a second acne-fighting treatment if your skin isn't clear after 4 to 6 weeks.",
      "content": "Add a second acne-fighting treatment if your skin isn't clear after 4 to 6 weeks. If you don't notice a change in your skin after 4 to 6 weeks, use a different acne treatment that attacks a different cause of acne. At the same time, continue using the original treatment as directed. [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Choose a product with a different active ingredient. Products with benzoyl peroxide dry up and decrease the bacteria that cause acne. Retinoids unclog pores and reduce oiliness. Salicylic acid reduces inflammation and also unclogs pores. For example, you might start with a product containing benzoyl peroxide. After 4 weeks, if your acne doesn't clear, you might add a product containing salicylic acid to your routine. Your skin can become over-dry if you use products in combination, especially if you have sensitive skin. Use an oil-free moisturizer to keep your skin hydrated."
    },
    {
      "title": "Try a green clay mask to calm redness and irritation.",
      "content": "Try a green clay mask to calm redness and irritation. Clay masks are great for soothing and refreshing your skin. Green clay may also help heal blemishes due to its antibacterial properties. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Purchase a DIY clay mask online or from a beauty supply store, or ask for a green clay mask treatment at your favorite spa. If you like, you can mix in 1-2 drops of a healing essential oil, such as tea tree or chamomile oil. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Dilute it in a small amount of a carrier oil, such as jojoba or argan oil, to prevent irritation."
    },
    {
      "title": "Limit sun exposure to avoid additional inflammation.",
      "content": "Limit sun exposure to avoid additional inflammation. If your skin becomes more inflamed, it will take longer for it to heal. Wear sunscreen any time you're going to be outside, even if only for a few minutes. If you're going to be out in the sun for a longer period of time, shield your face with a hat or visor to protect it from the sun. [15] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source If you're sweating in the sun, reapply the sunscreen on your face every hour or two, even if you're wearing a waterproof or \"sport\" variety of sunscreen."
    },
    {
      "title": "Talk to a dermatologist if you have acne that won't clear.",
      "content": "Talk to a dermatologist if you have acne that won't clear. Over-the-counter acne treatments work for some, but not all, acne breakouts. If you're using an over-the-counter regimen, following the directions precisely, and still don't notice any difference in your skin, get a dermatologist to look at it. [16] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Explain to the dermatologist how long you've had a problem with acne and what you've done to attempt to clear your skin. They can evaluate the condition of your skin and prescribe a treatment to help remedy the problem."
    },
    {
      "title": "Wash your face twice a day and after you sweat to keep the skin clean.",
      "content": "Wash your face twice a day and after you sweat to keep the skin clean. Your facial skin will heal faster if it is as clean as possible. Wash your face in the morning when you wake up and then again at night before you go to bed. Try to avoid wearing makeup when you work out as it will mix with your sweat and can further clog your pores. [17] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Use warm water and a light facial cleanser to minimize inflammation. Regular soaps can be overly drying, which causes your skin to produce more oil and can lead to more breakouts."
    },
    {
      "title": "Avoid scrubbing or exfoliating irritated skin.",
      "content": "Avoid scrubbing or exfoliating irritated skin. Scrubbing your skin can damage it further and increase inflammation. If you have blemishes or open wounds on your skin, you should also avoid harsh facial scrubs or exfoliating products. [18] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Exfoliators can remove new skin from cuts or blemishes, making it take longer for them to heal. Tiny particles in facial scrubs can embed themselves into your skin, leading to further breakouts."
    },
    {
      "title": "Change your pillowcase every other day.",
      "content": "Change your pillowcase every other day. Because your pillowcases touch your face every night, they build up bacteria and dead facial skin. This can cause the skin on your face to break out if you don't change them frequently. [19] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Your pillowcases should generally be changed more often because they touch your face at night. The rest of your sheets, on the other hand, can be washed once a week or so."
    },
    {
      "title": "Keep your hair out of your face.",
      "content": "Keep your hair out of your face. Hair in your face traps dirt, oil, and bacteria, which can lead to breakouts — especially if you use a lot of hair products. If you have longer hair, put on a bandanna or hairband before bed to keep your hair off your face as you sleep. [20] X Research source Avoid wearing bangs if it leads to frequent forehead breakouts. Although you may have bangs in part to cover the blemishes on your forehead, the hair actually makes it more difficult for those breakouts to heal and can cause new blemishes to form."
    },
    {
      "title": "Use cosmetics that don't clog pores to avoid further inflammation.",
      "content": "Use cosmetics that don't clog pores to avoid further inflammation. If you regularly wear makeup, use products that are designed for sensitive skin and that carry the label \"noncomedogenic.\" These products will be less likely to clog your pores. Lightweight products also allow your skin to breathe. [21] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Look for products that have natural ingredients and don't have dyes or fragrances, which can irritate your skin. While it's tempting to layer on makeup to cover up blemishes, this typically will only make them worse."
    },
    {
      "title": "Clean your makeup tools or use disposable applicators.",
      "content": "Clean your makeup tools or use disposable applicators. Makeup brushes harbor bacteria and flakes of dry skin that can build up over time. When you use the same brush on your face, you're essentially brushing bacteria on your face, which will end up causing new breakouts or inflame the breakouts you already have. [22] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you use disposable applicators, throw them away after every use. Avoid using them for several days."
    },
    {
      "title": "Drink plenty of water to keep your skin well-hydrated.",
      "content": "Drink plenty of water to keep your skin well-hydrated. Healthy, well-hydrated skin is able to heal itself faster. When your skin is dry, on the other hand, it produces oil, which can clog your pores and lead to breakouts. If you stay well-hydrated, your skin will be healthier and generally less likely to break out. [23] X Research source Generally, if your urine is colorless and you rarely feel thirsty, you're getting enough water. If you feel thirsty, you're already dehydrated."
    }
  ]
}