{
  "url": "https://www.wikihow.com/Kiss-Someone-Who-Has-Never-Been-Kissed",
  "title": "How to Kiss Someone Who Has Never Been Kissed",
  "steps": [
    {
      "title": "Touch your partner to show them you’re feeling affectionate.",
      "content": "Touch your partner to show them you’re feeling affectionate. [1] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. Lightly tap your partner’s arm or lay your hand on theirs. If they smile, lean closer to you, or touch you back, this may indicate that they’re interested in kissing you. If they move away from you or brush your hand away, back off a little bit and give them some space. [2] X Research source Keep your touch light and playful so that the other person doesn’t get creeped out or feel like you’re pressuring them. Try quick touches in safe areas, like the person’s arm or knee. Just because the other person doesn’t seem interested in a kiss right then doesn’t necessarily mean they don’t like you. They might be having a bad day, feeling stressed about a test, or just thinking about something else. If you're thinking of kissing somebody during the COVID-19 pandemic, you might want to be upfront and honest at the beginning of your date about how comfortable people feel about how much physicality. [3] X Expert Source Cristina Morara Dating Coach Expert Interview. 29 September 2020."
    },
    {
      "title": "Ask for a kiss in a playful or flirty way if you’re not sure they’re ready.",
      "content": "Ask for a kiss in a playful or flirty way if you’re not sure they’re ready. It’s always important to make sure the other person feels comfortable with the idea of you kissing them, but it can sometimes be hard to tell. Someone who has never been kissed may be feeling nervous and might not know how to show you they’re interested, so it may be easier to just directly ask. [4] X Research source Try giving your partner a compliment, and then directly asking for a kiss. [5] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. Let them know you appreciate what they're doing or saying, or how they look in that moment. For example, you could say something like, “You look really beautiful right now. Is it okay if I kiss you?” You could also keep it simple by leaning close and saying something like, “Can I kiss you?”"
    },
    {
      "title": "Lean in slowly and kiss your partner on the lips.",
      "content": "Lean in slowly and kiss your partner on the lips. Put your hand on their face, neck, or arm, and move in for a light peck. After you do that, pull away slightly to look your partner in the eyes and give them a small smile. If they smile back, or if they at least look happy and comfortable, lean in and give them another kiss, if you’d like. [6] X Research source It can be easy to rush into a kiss if you’re feeling nervous, but that can be awkward. Instead, try to keep things more relaxed by waiting until you and your partner lock eyes, then lean forward slowly. [7] X Research source"
    },
    {
      "title": "Close your eyes during the actual kiss.",
      "content": "Close your eyes during the actual kiss. While you might want to make sure the other person is enjoying the kiss, you might end up making them uncomfortable if they notice your eyes are open. You don’t have to squeeze your eyes shut, but you should probably keep them closed. If it’s a short kiss, just close your eyes briefly right before your lips meet, then open them as you pull away [8] X Research source Don’t close your eyes too early, or you might accidentally miss!"
    },
    {
      "title": "Deepen the kiss only if your partner is comfortable and enthusiastic.",
      "content": "Deepen the kiss only if your partner is comfortable and enthusiastic. If your partner is leaning forward and touching you, it’s likely that they want to keep kissing you. In that case, you can give them a longer kiss, opening your mouth slightly. However, if they are pulling back, are not moving, or are very stiff and uncomfortable, they may not be interested, and you should break off the kiss. [9] X Research source It’s usually better to keep kisses lighter the first time. Since this is the other person’s first kiss, they may become overwhelmed if it’s too intense. Keep your kiss soft and light, and avoid using your tongue unless they do it first. [10] X Research source Both you and your partner should be kissing each other with the same amount of pressure. If you knock your teeth into theirs, you’re probably pushing too hard, so lighten your kiss a little. [11] X Research source Move your hands a couple of times during the kiss. Run your fingers through the other person’s hair, touch the back of their neck, trail your fingers down their arm, or hold their hand. [12] X Research source"
    },
    {
      "title": "Pull back slightly and give your partner a compliment.",
      "content": "Pull back slightly and give your partner a compliment. They may be feeling very nervous after their first kiss, so reassure them by telling them they look cute or that you really liked kissing them. You can also reassure them with a hug. [13] X Research source It’s a good idea to save the kiss for the end of the night. After you kiss, walk away, but end things on a positive note. For instance, you could try saying, \"I had a really good time with you tonight. Is it okay if I call you tomorrow?\""
    },
    {
      "title": "Cut your partner some slack if the kiss wasn’t perfect.",
      "content": "Cut your partner some slack if the kiss wasn’t perfect. [14] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. First kisses can sometimes be a little awkward, even between people who have experience kissing. When you’re kissing someone who’s never been kissed before, keep in mind that any first kiss is a special moment, and give your partner another chance if it didn't go exactly how you imagined. [15] X Research source If you have an especially awkward moment, such as bumping heads or stepping on your partner's foot, smile and ask them if you can have another chance. You could say something like, “Okay, I messed that up! Can we try that again?”"
    },
    {
      "title": "Give the other person some space right after the kiss.",
      "content": "Give the other person some space right after the kiss. Some people have a lot of mixed emotions about a first kiss experience, and your partner may need time to sort out how they feel about you and about the kiss. Let them have some time to process the experience, especially if they seem unsure how they felt about it. [16] X Research source Make sure your partner doesn't think you're running away or feeling disappointed while you give them space. Let them know that you’re interested in following up with them later, even though you have to leave. For instance you might say, “I’m really having fun, but I have to go. Can I text you later?” If your partner is clearly very enthusiastic about your kiss, and enjoying spending time with you, giving them space may not be necessary! Feel free to prolong your time together if you are both obviously enjoying each others' company."
    },
    {
      "title": "Follow up with your partner within a day or two.",
      "content": "Follow up with your partner within a day or two. A first kiss is a big deal, so your partner will probably be thinking about you. They may also feel really close to you, so it’s important for you to let them know how you feel about the kiss. Don’t make them wait too long before they hear from you. If you’re interested in spending more time with the person, let them know sooner rather than later. Call or text them and say something like, “That was fun! Do you want to hang out again tomorrow?” Be gracious if the person doesn’t feel the same way as you. There could be a lot of reasons that they’re not interested, even if they seemed to enjoy the kiss at the time."
    },
    {
      "title": "Be upfront if you don’t want to continue a romantic relationship.",
      "content": "Be upfront if you don’t want to continue a romantic relationship. Sometimes you don’t know how you feel about someone until you kiss them. If the kiss fell completely flat for you and you aren’t willing to give the other person another chance, be completely open about it. Don’t blame your partner, and don’t give them a false reason for wanting to end things, as this will only hurt them more. [17] X Research source Try to share something positive, but don’t lead the other person on. You could try saying, “I’m glad I got to spend time with you the other day, but I’m not sure I have those kinds of feelings for you. You didn’t do anything wrong, and I just wanted to be honest with you.”"
    }
  ]
}