{
  "url": "https://www.wikihow.com/Make-a-Coke-Float",
  "title": "How to Make a Coke Float",
  "steps": [
    {
      "title": "Fill 3/4 of a glass with cola.",
      "content": "Fill 3/4 of a glass with cola. Set the glass on small plates so you can catch the overflow from the fizz. Pour the soda slowly to keep it from overflowing. For best results, start with chilled soda. You can also chill your glass by setting it in the freezer for about 10 minutes beforehand. Pouring the soda first and then adding the ice cream will result in a small amount of foam. If you prefer a float with more foam, add the ice cream to the cup before the soda."
    },
    {
      "title": "Add the ice cream.",
      "content": "Add the ice cream. Slowly add one scoop of vanilla ice cream into each glass. If you have more room, and you prefer more ice cream, add another scoop. For best results, make sure your ice cream is very cold. If it gets too hard to scoop, you can leave it on the counter for a few minutes to soften. If the ice cream sticks, use a spoon to push it off the scooper into the cup."
    },
    {
      "title": "Top off your float.",
      "content": "Top off your float. Drizzle a small amount of cola on top of the ice cream. This will turn to foam. Keep pouring until your glass is full. Tilt your glass slightly and pour the cola slowly to reduce foam. Fill your cup until the coke is just higher than the ice cream."
    },
    {
      "title": "Mix it up (optional).",
      "content": "Mix it up (optional). Let your float sit a while. Give it about 5-10 minutes for the ice cream to melt but not too long, or it won't be cold enough. Stir until it reaches a consistency somewhere between \"ice cream soup\" and a milkshake. Add cola to thin it or ice cream to thicken it as you desire."
    },
    {
      "title": "Serve.",
      "content": "Serve. Dip a spoon in your cup and top it off with a straw. Eat your float slowly, starting with the cold frozen foam on top, scooping ice cream and cola together with your spoon. Use the straw to sip the remainder of creamy cola left in the glass."
    },
    {
      "title": "Cook the bacon.",
      "content": "Cook the bacon. Yes, bacon! Line strips of bacon on an oven pan and place into a preheated oven (350 degrees) until crispy (about 10 minutes). Use 1-pound of sliced bacon. You can also cook your bacon in a frying pan. Try this experimental cola float for a fun twist. [1] X Research source"
    },
    {
      "title": "Mix your bacon with 1 quart cream.",
      "content": "Mix your bacon with 1 quart cream. Once the bacon is cooked, lift each piece into a medium bowl and pour your cream on top of it. Seal and refrigerate overnight. Avoid pouring all of the bacon grease over the cream."
    },
    {
      "title": "Mix the sweets.",
      "content": "Mix the sweets. In a medium bowl, add 6 egg yolks, 1 cup sugar (you can also use honey), 1 teaspoon salt and 1 teaspoon vanilla extract. Whisk until smooth. If you desire a stronger vanilla flavor, add 2 teaspoons of vanilla extract."
    },
    {
      "title": "Add it all together.",
      "content": "Add it all together. Remove your cream and bacon mixture from the refrigerator and heat it in a pan on the stove until softened. Add the yolk mixture one cup at the time. Don’t pour the yolk mixture into the pan all at once. Scoop it in one cup at a time and mix in-between. This way, the eggs won't curdle. Slowly stir until your mixture has a custard texture."
    },
    {
      "title": "Let it cool.",
      "content": "Let it cool. Remove the pan from heat and strain the custard mixture. Cool on the counter or in the fridge until room temperature or cooler."
    },
    {
      "title": "Mix your ice cream.",
      "content": "Mix your ice cream. Add your custard to your ice cream machine and spin to the manufacture’s instructions. Once thickened, place your ice cream into the freezer to set. For best results, let your ice cream harden in the freezer overnight."
    },
    {
      "title": "Fill a glass 3/4 with cola.",
      "content": "Fill a glass 3/4 with cola. Set the glass on small plates so you can catch the overflow from the fizz. Pour the soda slowly so keep from overflowing. For best results, start with chilled soda. Pouring the soda first and then adding the ice cream will result in a small amount of foam. If you prefer a float with more foam, add the ice cream to the cup before the soda. You can also chill your glass by setting it in the freezer for about 10 minutes beforehand."
    },
    {
      "title": "Add the ice cream.",
      "content": "Add the ice cream. Slowly add one scoop of vanilla ice cream into each glass. If you have more room, and you prefer more ice cream, add another scoop. For best results, make sure your ice cream is very cold. If it gets too hard to scoop, you can leave it on the counter for a few minutes to soften. If the ice cream sticks, use a spoon to push it off the scooper unto the cup."
    },
    {
      "title": "Top off your float.",
      "content": "Top off your float. Drizzle a small amount of cola on top of the ice cream. This will turn to foam. Keep pouring until your glass is full. Tilt your glass slightly and pour the cola slowly to reduce foam, or add the ice cream first and pour the soda quicker for more foam. Fill your cup into the cola is just higher than the ice cream."
    },
    {
      "title": "Mix it up (optional).",
      "content": "Mix it up (optional). Let your float sit a while. Give it about 5-10 minutes for the ice cream to melt but not too long, or it won't be cold enough. Stir until it reaches a consistency somewhere between \"ice cream soup\" and a milkshake. Add cola to thin it or ice cream to thicken it as you desire."
    },
    {
      "title": "Serve.",
      "content": "Serve. Dip a spoon in your cup and top it off with a straw. Eat your float slowly, starting with the cold frozen foam on top, scooping ice cream and cola together with your spoon. Use the straw to sip the remainder of creamy cola left in the glass."
    },
    {
      "title": "Fill a tall glass with ice.",
      "content": "Fill a tall glass with ice. You can chill your glass in the freezer for about 10 minutes if you prefer. When the cola and the whipping cream combine, they form a reaction to foam up just like a traditional cola and ice cream float. [2] X Research source This is a fun drink to serve at parties with friends. Remember to always drink responsibly!"
    },
    {
      "title": "Add your cream.",
      "content": "Add your cream. Pour 2 tablespoons heavy whipping cream, 1 1/2 ounces of whipped cream flavored vodka, and 1/4 teaspoon vanilla extract over the ice. Pour slowly and one at a time. If you prefer more of a vanilla tasting float, use 1/2 teaspoon of vanilla extract. Make your float stronger or weaker by adding more or less vodka."
    },
    {
      "title": "Add the cola.",
      "content": "Add the cola. Carefully pour the cola over the mixture. This will cause a bit of foam. Stir well. You can also add a scoop of vanilla ice cream to make your float creamier. If you desire more foam, drip a scoop of ice cream into your cup over the ice, and add the cola on top."
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! Top it off with a straw and stir frequently to keep it well mixed. Always drink responsibly."
    },
    {
      "title": "Try different flavors of ice cream.",
      "content": "Try different flavors of ice cream. Vanilla has been a classic for years. But, that doesn’t mean you can't change it up. Try your float with rocky-road, cookie dough, or any ice cream you like! You can get as creative as you want! You can even use more than one flavor in your float."
    },
    {
      "title": "Try different sodas!",
      "content": "Try different sodas! Root beer has been a classic float flavor for years. You can also try fruity sodas like key lime or strawberry. You can make a float with virtually any kind of carbonated water, so if you are trying to avoid soda, try sparkling fruit juice! Try mixing fruity soda with fruit ice cream or sherbert."
    },
    {
      "title": "Add a topping or garnish!",
      "content": "Add a topping or garnish! Try topping your float off with a dash of whipped cream, a cherry, or some powdered cinnamon or sugar."
    }
  ]
}