{
  "url": "https://www.wikihow.com/Make-a-Drip-Irrigator-from-a-Plastic-Bottle",
  "title": "How to Make a Drip Irrigator from a Plastic Bottle",
  "steps": [
    {
      "title": "Get a plastic bottle.",
      "content": "Get a plastic bottle. A 2-liter bottle will work the best, but you can use a smaller one for a smaller plant. Clean the bottle thoroughly with water, and remove the label."
    },
    {
      "title": "Poke 4 to 5 holes in the cap.",
      "content": "Poke 4 to 5 holes in the cap. Remove the cap and set it down on a piece of scrap wood. Use a drill or a nail and hammer to poke several holes into it. The more holes you poke, the faster the water will flow out. Place the cap back onto the bottle when you are done. [1] X Research source Avoid making the holes too small, or they may get clogged up by the soil. [2] X Research source"
    },
    {
      "title": "Cut the bottom off of the bottle.",
      "content": "Cut the bottom off of the bottle. You can do this with a serrated knife or a pair of sharp scissors. Plan on cutting the bottom inch (2.54 centimeters) off of the bottle. [3] X Research source If your soda bottle has a molded line around the bottom, you can use that as a guide instead."
    },
    {
      "title": "Dig a hole into the soil.",
      "content": "Dig a hole into the soil. It needs to be deep enough so that you can fit your bottle halfway into it. [4] X Research source Plan on making the hole about 4 to 6 inches (10.16 to 15.24 centimeters) away from the plant's stem. If you are digging next to an established plant, be careful not to cut through the roots. [5] X Research source"
    },
    {
      "title": "Place the bottle into the hole, cap-side-down.",
      "content": "Place the bottle into the hole, cap-side-down. If you have not already, screw the cap back onto the bottle. Flip the bottle upside down, and insert it cap-side-down into the hole. Gently pat the soil down around the bottle. You can insert the bottle deeper into the soil, but you will need at least 1 inch (2.54 centimeters) sticking out of the soil. This will prevent soil from getting into the water. [6] X Research source"
    },
    {
      "title": "Fill the bottle with water, and invert the bottom of the bottle so it rests on the water, ready to catch any debris that would otherwise sink and clog the system.",
      "content": "Fill the bottle with water, and invert the bottom of the bottle so it rests on the water, ready to catch any debris that would otherwise sink and clog the system. Leave your drip irrigation to do its work. Make as many drip irrigation as you need for all of your plants."
    },
    {
      "title": "Get a plastic bottle.",
      "content": "Get a plastic bottle. A 2-liter soda bottle will work the best, but if you are only watering a small plant, you may be able to use a smaller one. Clean the bottle thoroughly inside-out with water and remove the label."
    },
    {
      "title": "Poke holes in the sides of the bottle.",
      "content": "Poke holes in the sides of the bottle. Focus on making the holes in the bottom two-thirds of the bottle. You can make as many or as few holes as you want; the more you make, the faster the water will flow. If you are only going to be watering one plant, place the holes on the same side of the bottle. Make the holes using a nail or a metal skewer. You may have to heat the nail or skewer up over a flame first."
    },
    {
      "title": "Poke holes in the bottom of the bottle.",
      "content": "Poke holes in the bottom of the bottle. This is very important as it will allow the water from collecting in the bottom and growing stagnant. If your bottle has a segmented bottom (ie: most 2-liter soda bottles), you will need to poke a hole in each segment. The bottom of most bottles is typically made from thicker plastic. You will need to use a drill or a hot nail to do this."
    },
    {
      "title": "Dig a hole into the soil next to the plant.",
      "content": "Dig a hole into the soil next to the plant. The hole needs to be deep enough to insert the bottle about two-thirds of the way, or where the straight walls start to curve into a dome."
    },
    {
      "title": "Insert the bottle into the soil.",
      "content": "Insert the bottle into the soil. If you places the holes on one side of the bottle, rotate the bottle until the holes face the plant. Gently pat the soil around the bottle."
    },
    {
      "title": "Fill the bottle with water.",
      "content": "Fill the bottle with water. Remove the cap first, then use a hose to fill the bottle with water; you can also insert a funnel into the neck to make filling easier. Leave the cap off, otherwise the water won't flow out. If the water is flowing out too fast, you can put the cap on loosely. The tighter you close it, the slower the water will flow out. You can also cut the top, domed portion of the bottle off, invert it, and use it like a funnel."
    },
    {
      "title": "Create a hole in the side of your bottle.",
      "content": "Create a hole in the side of your bottle. The hole needs to be big enough to fit the rubber gasket and the flexible aquarium tubing. You can create the hole using a drill and drill bit or with a nail. [7] X Research source The hole needs to be about 2 to 3 inches (5.08 to 7.62 centimeters) up from the bottom of the bottle. If you are using a nail, heat it up over a flame first, then make the hole. Widen the hole with a craft blade."
    },
    {
      "title": "Cut off a short piece of flexible aquarium tubing.",
      "content": "Cut off a short piece of flexible aquarium tubing. The tubing needs to be only 2 to 3 inches (5.08 to 7.62 centimeters) long. You will be using this to attach the aquarium fitting to the bottle. [8] X Research source"
    },
    {
      "title": "Fit a small rubber gasket around the tubing.",
      "content": "Fit a small rubber gasket around the tubing. The gasket needs to be big enough to fit into the hole, but small enough to fit around the tubing. If the gasket is too big for the tubing, you can cut a segment out of it to make it smaller, then wrap it around the tubing. [9] X Research source"
    },
    {
      "title": "Insert the gasket into the hole, then adjust the tubing.",
      "content": "Insert the gasket into the hole, then adjust the tubing. Push the assembled gasket and tubing into the hole. Next, push the tubing into the hole that that about 1 inch (2.54 centimeters) of it is inside the bottle. The rest of the tubing should be sticking out of the bottle. [10] X Research source"
    },
    {
      "title": "Seal the area",
      "content": "Seal the area around the gasket and tubing. Purchase a small tube of sealant meant for fixing aquariums, or other leaks. Pipe a thin band around the joint between the gasket and the bottle. If you need to, use a popsicle stick or a toothpick to smooth the sealant down. Allow the sealant to cure. [11] X Research source You may need to seal the area between the gasket and the tubing itself."
    },
    {
      "title": "Insert an aquarium fitting into the other end of the tubing.",
      "content": "Insert an aquarium fitting into the other end of the tubing. You can purchase aquarium fittings in aquarium supply stores and online. They look a little like a faucet, with an opening on each end, and a knob on top. One of the opens is usually pointed. You want to insert the non-pointed opening into the tubing. [12] X Research source"
    },
    {
      "title": "Cut the top part off of the bottle, if desired.",
      "content": "Cut the top part off of the bottle, if desired. You don't really have to do this, but it will make filling the bottle easier. You can also cut it off only partway so that it's still attached to the rest of the bottle by a \"hinge.\" This will allow you to partially close the opening. [13] X Research source"
    },
    {
      "title": "Add some hanging holes to the top, cut edge.",
      "content": "Add some hanging holes to the top, cut edge. Use a hole puncher to punch 3 to 4 holes along the top, cut edge of the bottle. Make the holes straight across from each other so that they form a triangle (for three holes) or a square (for four holes). [14] X Research source If you want to stand the irrigator on a table above your plant, fill the bottom inch (2.54 centimeters) or so with pebbles. This will help keep it stable. [15] X Research source"
    },
    {
      "title": "Thread wire or sturdy string through each of the holes.",
      "content": "Thread wire or sturdy string through each of the holes. Cut 3 to 4 long pieces of thin wire or strong string. Thread and tie each string to a punched hole. Gather all of the strings together, then tie them into a knot at the other end. [16] X Research source Skip this step if you are standing the irrigator up."
    },
    {
      "title": "Set the irrigator up an fill the bottle with water.",
      "content": "Set the irrigator up an fill the bottle with water. Hang the irrigator from a hook above your plant. Close the knob on the aquarium fitting first so that no water leaks out. Fill the bottle with water. You can also stand the irrigator on a table or wall above your plant instead."
    },
    {
      "title": "Open the knob and make any adjustments, if needed.",
      "content": "Open the knob and make any adjustments, if needed. If the water won't reach the plant because something is in the way, cut another piece of aquarium tubing. Secure one end to the pointed tip of the aquarium fitting, and set the other end on top of the soil, right next to the plant. [17] X Research source The more you unscrew the knot, the faster the water will flow. The tighter you screw the knob, the slower the water will flow. Drip irrigation puts your water exactly at the root ball. It helps to minimize water usage. Usually, a professional company puts a jute mat or a soil stabilizer mat on the hill plants to provide drip irrigation to each one of the plants."
    }
  ]
}