{
  "url": "https://www.wikihow.com/Make-DIY-Office-Weapons",
  "title": "How to Make DIY Office Weapons",
  "steps": [
    {
      "title": "You are going to need.",
      "content": "You are going to need. Seven pencils A bunch of rubber bands A plastic spoon A binder clip"
    },
    {
      "title": "Attach three of the pencils so that it forms a square with a hole at the top.",
      "content": "Attach three of the pencils so that it forms a square with a hole at the top."
    },
    {
      "title": "Attach the last pencil with the binder clip going through it.",
      "content": "Attach the last pencil with the binder clip going through it."
    },
    {
      "title": "Attach two more pencils at the rear in a slight triangular shape.",
      "content": "Attach two more pencils at the rear in a slight triangular shape. This is a base to keep it from flinging forward when you shoot."
    },
    {
      "title": "Attach the spoon to the final pencil with rubber bands or tape and put it in the clip with a little piece of pencil sticking out.",
      "content": "Attach the spoon to the final pencil with rubber bands or tape and put it in the clip with a little piece of pencil sticking out."
    },
    {
      "title": "Attach many rubber bands to the end of the clip to the pencils in front.",
      "content": "Attach many rubber bands to the end of the clip to the pencils in front."
    },
    {
      "title": "And there we go.",
      "content": "And there we go. A catapult. You can shoot coins, paper, and marbles but also many other things."
    },
    {
      "title": "You will need",
      "content": "You will need A party popper A pen"
    },
    {
      "title": "Carefully remove the bottom of the party popper and remove all of the insides.",
      "content": "Carefully remove the bottom of the party popper and remove all of the insides. This can be done by adding pressure on the sides of the popper."
    },
    {
      "title": "Now unscrew the bottom and the top so that there is only the body of the pen left.",
      "content": "Now unscrew the bottom and the top so that there is only the body of the pen left."
    },
    {
      "title": "Thread the string of the party popper through the part which you write from.",
      "content": "Thread the string of the party popper through the part which you write from."
    },
    {
      "title": "Re screw the pen tip on the body.",
      "content": "Re screw the pen tip on the body."
    },
    {
      "title": "Add your ammunition in the body of the pen and pull the string.",
      "content": "Add your ammunition in the body of the pen and pull the string."
    }
  ]
}