{
  "url": "https://www.wikihow.com/Make-a-Friend-Laugh",
  "title": "12 Hysterical Ways to Make Someone Laugh",
  "steps": [
    {
      "title": "Pick a pun so dumb that your friend will have to laugh.",
      "content": "Pick a pun so dumb that your friend will have to laugh. The more groan-inducing, the better! Look through a joke book to find a silly play on words, or make up a pun of your own. Try something like: [1] X Research source “What do you call a fake noodle? An impasta!” “What does a nosey pepper do? Gets jalapeño business.” “What do you call an alligator in a vest? An investigator.” “Making mirrors is a job I can really see myself doing.” “I’m afraid of speed bumps, but I’m slowly getting over it.” “I once asked an alpaca for a favor. It was no probllama.” “Why can’t you trust an atom? Because they make up everything.” “How does the man on the moon get his haircut? Eclipse it.” “What do fish say when they hit a concrete wall? Dam!” “I have a pun about the wind, but it blows.”"
    },
    {
      "title": "Get your friend involved with a joke that needs an answer.",
      "content": "Get your friend involved with a joke that needs an answer. Stick with a classic joke to stay zany or write and deliver a knock-knock routine of your own. Because knock-knock jokes are so well-known, make your punchline unexpected. The more surprised they are, the more your friend will be amused. Try: [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source “Knock knock.” “Who’s there?” “Tank.” “Tank who?” “You’re welcome.” “Knock knock.” “Who’s there?” “Interrupting cow.” “Interrupting cow wh–” “MOO!” “Knock knock.” “Who’s there?” “Dejav.” “Dejav who?” “Knock knock.” “Knock knock.” “Who’s there?” “Control freak.” “Con–” “Okay, now you say ‘control freak who?’” “Knock knock.” “Who’s there?” “Me.” “Me who?” “Having an identity crisis, are you?” “Knock knock.” “Who’s there?” “Who.” “Who who?” “I didn’t know you were an owl!” “Knock knock.” “Who’s there?” “To.” “To who?” “It’s ‘to whom.’” “Knock knock.” “Who's there?” “Mike Snifferpippets.” “Mike Snifferpippets who?” “Oh come on, how many Mike Snifferpippets do you know?”"
    },
    {
      "title": "Say something funny that you know will make your friend chuckle.",
      "content": "Say something funny that you know will make your friend chuckle. Find the humor in one of your many common interests. You could joke about going back to school together, a classmate that annoys you both, or your parents. Try: [3] X Research source “I invented a new word: plagiarism!” “What’s orange and sounds like a parrot? A carrot.” “What did the pirate say when he turned 80? Aye matey.” “The problem with getting to work on time is that it makes the day so long.” “I have an inferiority complex, but it’s not a very good one.” “Our teacher told me I’m condescending. That means I talk down to people. Understand?” “I had a fake plant that died, because I pretended not to water it.” “My little sister has a lot of willpower. And even more won’t-power.” “I’ve spent 2 years looking for my boss’ killer…but nobody will do it.” “Never discuss infinity with our math teacher. He can go on forever.”"
    },
    {
      "title": "Say a list of 3 things, but make the 3rd wacky and ridiculous.",
      "content": "Say a list of 3 things, but make the 3rd wacky and ridiculous. Comedy comes from inconsistency. By establishing a pattern of 2 normal situations, you set your friend’s expectations for something ordinary and serious. That makes it all the more absurd and hilarious when you break this pattern. You can use anything for a rule of 3, like: [4] X Research source ”Are you trying too hard to get people to like you? By having a lot of money, an attractive appearance, or wearing deodorant?” ”If you want to be seen: stand up! If you want to be heard: speak up! If you want to be appreciated: shut up!” “I went on a blind date with this guy last week. He’s loud. He’s rude. I’m in love.” “Can I get you anything? Coffee? Tea? Arsenic?” “Success is 1% inspiration, 98% perspiration, and 2% attention to detail.”"
    },
    {
      "title": "Tell a short joke that’s simple and to the point.",
      "content": "Tell a short joke that’s simple and to the point. Use irony to create a punchline or make a brief observation about something silly. One-liners work especially well if your friend isn’t super into your long-form jokes: [5] X Research source “I’d kill for a Nobel Peace Prize.” “I own the world’s worst thesaurus. Not only is it awful, it’s awful.” “What’s the difference between a good joke and a bad joke timing.” “If we shouldn’t eat at night, why did they put a light in the fridge?” “The easiest time to add insult to injury is when you’re signing someone’s cast.” “Moles ask an interesting question: ‘what if a freckle had an ugly cousin?” “I never knew what happiness was until I got married. And then it was too late.” “I’m against protesting, but I don’t know how to show it.” “I’d kill for a Nobel Peace Prize.” “My brother got burned when he went to Burning Man. The irony stung, but not as much as the burning.”"
    },
    {
      "title": "Try a little self-deprecating humor.",
      "content": "Try a little self-deprecating humor. Make fun of a silly habit you have, something you’re wearing, or something embarrassing that happened to you recently. Your friend will appreciate that you don’t take life too seriously and laugh because they probably have similar quirks. You could say: [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source “I’m in shape. Round is a shape, right?” “This shirt is so colorful, you can probably see it from space.” “I got so distracted by my phone the other day that I walked right into a pole!” “I got my IQ test results. They were negative.” “I question my sanity a lot. Every now and then, it answers.” “Not to brag, but I haven’t had a breakdown in, like, 7 minutes.” “My clear conscience is just a sign of bad memory.” “Together I can heal my dissociative identity.” “Yesterday, I got job offers by not 1, not 2, but 0 companies.” “I used to be a terrible person. I still am, but I used to be too.”"
    },
    {
      "title": "Perform a lighthearted practical joke.",
      "content": "Perform a lighthearted practical joke. If your friend has a good sense of humor, they’ll appreciate your sense of playful mischief. Perform pranks that are funny for both of you, and don’t go out of your way to cause damage. [7] X Research source Make your friend a silly meal when they say they’re hungry, like green eggs and ham or a sandwich cut out in the shape of an animal. Place confetti on the blades of a ceiling fan so they fall into the air when the fan is turned on. Hide bubble wrap under a rug so your friend is surprised by the popping noises. Adjust their clock forward, so they think they’re late for something when they’re early."
    },
    {
      "title": "If you’re close with your friend, try a little teasing.",
      "content": "If you’re close with your friend, try a little teasing. Try making fun of them for a word they say a lot or a guilty pleasure TV show. Just steer clear of topics that they’re sensitive about, and don’t go overboard with your comments. If your friend gets offended, quickly apologize and find another way to make them laugh. [8] X Research source Use a friendly delivery and a kind smile when teasing so your body language conveys that your jokes are meant to be good-natured and playful. Be aware of power dynamics when teasing. Only tease in situations where you’re physically and socially equal. For example, if your friend is a co-worker in a lower-ranking position, teasing them at work can feel like an abuse of authority. If you’re teasing in a group setting, spread your teasing around so your friend doesn’t feel ganged up on."
    },
    {
      "title": "Relay a shocking or embarrassing moment to your friend.",
      "content": "Relay a shocking or embarrassing moment to your friend. Talk about something that happened to you in person, a news story you read about, or something funny from your childhood. If it makes you laugh, it will probably make your friend laugh, too. [9] X Expert Source Kendall Payne Writer, Director, & Stand-up Comedian Expert Interview. 3 April 2020. Maybe you saw a bird poop on someone’s head, a dog wearing a funny sweater, or maybe you have a memory of your dad starting the blender without the lid on and making a huge mess. When telling a funny story , try to keep the set-up under 30 seconds and end on your funniest punchline."
    },
    {
      "title": "Let the characters on the screen do the talking for you.",
      "content": "Let the characters on the screen do the talking for you. Pick out a movie or TV show that you and your friend both like or try a new comedy that you’re both interested in. Then, chill out with some snacks and enjoy it. [10] X Research source You could try “The Office,” “Superbad,” “Friends,” “Dumb and Dumber,” or “The Good Place.” If you’re out of ideas, type in “comedies” or “funny” to search for movies and TV shows."
    },
    {
      "title": "Find a comedian on YouTube or Netflix.",
      "content": "Find a comedian on YouTube or Netflix. Start by watching clips and trailers of their material to see if you like their jokes. Then, look for their popular specials to binge with your friend. Josie Long, Mindy Kaling, Hannibal Buress, and Trevor Noah are all good comedians to choose from. Who knows? Maybe they’ll inspire you and your friend to try doing some stand-up comedy of your own! [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You could also head to a comedy club to see comedians in-person."
    },
    {
      "title": "If you’re not with your friend, send them a funny pic to make them smile.",
      "content": "If you’re not with your friend, send them a funny pic to make them smile. Screenshot or save your favorite memes when you’re scrolling through social media. Then, pick the one you think your friend will find the funniest and forward it to them. [12] X Research source Instagram and Twitter are great places to look for memes. If they aren’t into memes, a cute kitten video works too!"
    }
  ]
}