{
  "url": "https://www.wikihow.com/Make-a-Squirrel-Snare",
  "title": "How to Make a Squirrel Snare",
  "steps": [
    {
      "title": "Check your local laws on trapping and using snares.",
      "content": "Check your local laws on trapping and using snares. It may not be legal where you live to use snares on animals because of the risk to wildlife, pets and people. If this is the case, you should only use a snare in a survival situation. Always be careful, and make intelligent decisions when considering whether to trap any animal. Check your state or country's wildlife, environmental or hunting and trapping department for trapping regulations. You can also ask at your local humane society or animal control department."
    },
    {
      "title": "Find an area with squirrel activity.",
      "content": "Find an area with squirrel activity. Check for trees where you regularly see squirrels or, even better, a squirrel nest. If you don’t actually see squirrels, check for signs of squirrel activity on the ground, such as pine cone shreds or nut shells."
    },
    {
      "title": "Look for a place to set up your snare.",
      "content": "Look for a place to set up your snare. Keep an eye out for an area to set up your trap with ample materials for you to use. You need branches and a small tree if you are going to make a trigger spring snare. You will want to use the natural layout of the area to drive the squirrel through your trap rather than around it. They will usually follow the path that they think requires less energy to get through."
    },
    {
      "title": "Get noose material.",
      "content": "Get noose material. All snares require a noose. Ideally, you will want .22 or .24 gauge wire of about 1-2' length but you can use many types of material. It should be flexible, strong and thin enough so that when it is looped into a noose it can tighten easily when pulled. If you need to, you can use stripped wire from inside electronics, power cords, vehicle electrical systems, picture hanging or craft wire, spiral notebooks, springs or underwire bras. [1] X Research source If you can’t find any wire, consider using string or cord strong enough to hold up to an 8lb animal. Test its strength by jerking the cord between your fists. Try parachute cord, shoe strings, dental floss or fishing line. [2] X Research source In a pinch, you can use natural plant or tree bark fibers, such as milkweed, dogbane, stinging nettle, inner tree bark, palm or cattail. You will probably need to wrap or braid the fibers to create a strong enough cord. [3] X Research source"
    },
    {
      "title": "Decide which snare to make.",
      "content": "Decide which snare to make. You might choose the squirrel noose, which is basically a portable, reusable trap made of a wooden pole with some wire. You could also choose to make a trigger spring snare, which is a little more complex than the squirrel noose alone. It consists of the noose, a wooden trigger with two parts, a leader line and an object to serve as an engine, such as a bent sapling."
    },
    {
      "title": "Create a squirrel noose.",
      "content": "Create a squirrel noose. A noose can be a very effective snare when the tag end is secured to a branch, stake or tree. It often does not need a trigger mechanism to catch an animal. Be aware that while these snares can catch a squirrel, they may not kill it. Use at least one foot of wire. Make a loop smaller than 3\" in diameter. Pinch the tag end of the wire together with some needle nose pliers. Use your free hand to twist the loop clockwise. Get some more wire of about the same length and cut it with pliers. Repeat the loop twist again until this loop is small enough to fit through the other loop. Fit the smaller loop through the bigger one. Make a fist and slide the loop over your hand until it fits snugly on your fist."
    },
    {
      "title": "Find a pole.",
      "content": "Find a pole. A rough, natural-looking branch with the bark still on works best. A fork at the end that allows the pole to stay in place when you stick it in the ground or pin it against a tree is especially helpful. Ideally, your pole should be 4-6' and about as thick as your arm."
    },
    {
      "title": "Attach the noose and pole.",
      "content": "Attach the noose and pole. Zig -zag the wire between the pole and noose, twisting the loops around the pole. You can create more loops to attach—up to about a dozen—on the pole’s top and sides to enhance your chances of snaring a squirrel."
    },
    {
      "title": "Place the squirrel pole against a tree near the area you scouted out prior.",
      "content": "Place the squirrel pole against a tree near the area you scouted out prior. Secure it against the tree. Turn the natural branches and forks on the pole so they form a sort of funnel to encourage the squirrel to go through instead of around the loop."
    },
    {
      "title": "Create a noose modification.",
      "content": "Create a noose modification. If you want, you can create a slight modification of the squirrel noose. This adds a bit more spring to the wire when it is triggered. Twist a 1/4\" size loop in the wire into a figure 8. Now you will have 2 loops about 1/8\" in size. Run the other end of the wire through the 1/8\" loops. Put an indentation or bump in the wire to hold the loop at about 2-3 fingers in diameter or the size of the squirrels you want to catch. It will snap back to the 1/8\" diameter when the squirrel’s head goes through the loop."
    },
    {
      "title": "Wait.",
      "content": "Wait. At first, the squirrels may be cautious and not go near your trap. After a while, they will get used to it. Check the trap every day or more often from afar with binoculars. You don’t want to be around too often and spook your prey."
    },
    {
      "title": "Create the noose.",
      "content": "Create the noose. Use your 2' long wire or cord to create a noose with a tag end that can be tied to a trigger. To do this, you will want to create a hook and loop. The wire needs to be able to tighten when an animal is caught in it. Make a small, pencil width sized loop in the end of your wire or cord. It should be about ¼\" long. Twist the wire onto itself or if you’re using cord, tie a knot, to secure the loop. Do this several times before running the other end through the loop."
    },
    {
      "title": "Build the trigger.",
      "content": "Build the trigger. You will need a hook (top stick) and base (bottom stick) to create the trigger. The leader line (the cord that connects the engine to the hook) can be tied to the top of the hook and the noose tied to the lower part of the hook. The hook is then secured under the snare base, while the object serving as the engine will provide tension. When an animal pulls on the noose, the hook and leader line will disengage. You can create a trigger from 2 sticks that are branched or that you carve the way you want and then stake into the ground. You can also secure the hook onto a nail in a nearby log or tree. Consider baiting your trigger with something like a raisin. To do this, you will need to stick the raisin near the hook so the animal has to go through the noose to get to the bait. Once the bait is moved, the hook disengages. Remember, you can improvise based on what you have available."
    },
    {
      "title": "Find something to use as the engine.",
      "content": "Find something to use as the engine. It needs to be strong enough to suspend the squirrel in the air. This way the squirrel is killed quickly and is protected from predators. Usually, this will be a young, flexible sapling but there are other options as well. If you aren’t near any small trees, bring a sapling or branch from somewhere else and stake it into the ground to set up your trap. You can also use a weight like a rock added to your leader line to add tension to the trigger. you can test to see if your snare will work with a rock or log that is about the same weight as a squirrel."
    },
    {
      "title": "Put out multiple snares.",
      "content": "Put out multiple snares. You can try different snare types, depending on what you have available. Put them in various places near high traffic game areas. The more you lay out to catch squirrels, the greater your chances are of success."
    },
    {
      "title": "Check on your snares.",
      "content": "Check on your snares. Try to check your snares every 6-8 hours. These snares likely kill, so you don’t want a dead squirrel out in the elements too long or attracting other predators."
    }
  ]
}