{
  "url": "https://www.wikihow.com/Goosestep",
  "title": "How to Goosestep",
  "steps": [
    {
      "title": "Kick up your left foot without bending your knee.",
      "content": "Kick up your left foot without bending your knee. Start by standing with both of your feet together. Then, try to kick your left foot high enough that it is at about a 45 degree angle to the ground. You will need to balance on your right foot, which can take practice. Be gentle as you first start learning, and understand that it may take some practice before you can comfortably bring your leg all the way up to the correct height. [2] X Research source Both knees should be as straight as possible as you kick."
    },
    {
      "title": "Bring your left foot back down on the ground.",
      "content": "Bring your left foot back down on the ground. Firmly plant it flat on the ground so the whole foot makes contact at once; do not let the heel hit before the rest of the foot. Planting your foot does not mean slamming it on the ground. Simply make sure that you have secure footing, with the toe pointed forward. For most versions of the goose step, it is incorrect to bring the foot down with excessive force."
    },
    {
      "title": "Kick up with your right foot immediately.",
      "content": "Kick up with your right foot immediately. Keep both knees straight, and kick your right foot up. The goal is to get it at about a 45 degree angle from the ground for most goose steps; however, when you are just beginning, kicking that high may cause you to hurt yourself. Don’t push beyond what you’re capable of. Certain countries, such as North Korea, use a goose step that has a higher kick than most other countries. [3] X Research source"
    },
    {
      "title": "Repeat kicking up your left and right feet.",
      "content": "Repeat kicking up your left and right feet. Make sure you march with a deliberate, even rhythm. Try going outside or into a long hallway to practice to be sure that you have enough space to practice repetitions of the kicks."
    },
    {
      "title": "Hold your arms straight, or pretend to hold a rifle.",
      "content": "Hold your arms straight, or pretend to hold a rifle. For example, you may wish to simply tilt your rifle forward 45 degrees (at a 135 degree angle with the ground) while marching. Otherwise, hold your arms at your sides. Different countries have different arm movements for their goose step, so there may be a unique movement depending on the country whose goose step you want to imitate. The best way to imitate the arm movements of your country of interest is to do a YouTube search and watch a video of the soldiers marching."
    },
    {
      "title": "Wear the proper boots for goose stepping.",
      "content": "Wear the proper boots for goose stepping. Goose stepping boots should have some weight, and should cover your ankles. This is to allow the ankles to turn with the boot, instead of the top of the boot getting in the way of the turning ankle. The hobnailed jackboot is one type of boot that you could try. Germans call this book “Marschstiefel,” which means “marching boot.” These boots come to your mid-calf or higher, have no laces, and have a leather sole."
    },
    {
      "title": "Play marching music while you are practicing.",
      "content": "Play marching music while you are practicing. It will help you coordinate your moves as you march to the beat of the music. Try searching some of these terms on YouTube to find music: Königgrätzer Marsch, Preußenmarsch (translates to \"Prussian March\"), Tannenberg Marsch, Unsere Garde Marsch, Yorckscher Marsch."
    },
    {
      "title": "Learn more difficult versions of the goose step.",
      "content": "Learn more difficult versions of the goose step. After learning a slow, ceremonial step, you may want to practice faster, more difficult versions of the march. You can familiarize yourself with the march you wish to learn by watching videos of soldiers performing it. Pay close attention to the angles of the legs, the way the feet are planted on the ground, and the movement of the arms."
    },
    {
      "title": "Try the North Korean goose step.",
      "content": "Try the North Korean goose step. North Korea’s version of the goose step is bouncy, forceful, and very difficult to do. To try this goose step, you must keep your head straight, and lock your arms at a 90 degree angle. When kicking, try to raise your leg to almost horizontal to the ground. Then, slam your foot down to the ground with force. As you do, the other foot should erupt into the air, creating a bouncing or trotting effect. [4] X Research source"
    },
    {
      "title": "Be mindful of the cultural stigma.",
      "content": "Be mindful of the cultural stigma. In English-speaking countries, the goose step is often associated with dictatorship, blind obedience, or with the Nazi regime of World War II. With that being said, the goose step is still used in many countries around the world. If you practice your goose step in public, be aware that people may ask you questions and some may seem offended. [5] X Research source"
    }
  ]
}