{
  "url": "https://www.wikihow.com/Know-if-a-Gerbil-is-Ill",
  "title": "How to Know if a Gerbil is Ill",
  "steps": [
    {
      "title": "Check your gerbil's scent glands.",
      "content": "Check your gerbil's scent glands. If you're worried your gerbil isn't acting like itself, check its scent glands. Early signs of sickness can often be detected here. Scent gland tumors are a common cause of illness, although they are more frequently found in older gerbils. Scent glands are found on your gerbil's belly. You will notice a hard lump forming around the scent gland if your gerbil is sick. Tumors will continue to grow without treatment. Take your gerbil to the vet right away if it has a scent gland tumor. Scent gland tumors are more common in male gerbils, but can occasionally be found in females."
    },
    {
      "title": "Look at your gerbil's eyes.",
      "content": "Look at your gerbil's eyes. A gerbil's eyes can be an indicator of health. Mild allergies and eye injury can be spotted by examining your gerbil's eyes. If a gerbil's eyes look puffy and red, and are emitting any mucus-like discharge, your gerbil may be sick. [1] X Research source"
    },
    {
      "title": "Check your gerbil's hair and coat.",
      "content": "Check your gerbil's hair and coat. A gerbil should have a strong coat free of any bald spots. If a gerbil is sick, illness may affect the appearance of a gerbil's coat. The appearance of a rough, patchy coat can indicate a variety of medical ailments. It should be evaluated by a doctor, especially if your gerbil has not had skin problems in the past. [2] X Research source"
    },
    {
      "title": "Pay attention to your gerbil's nose.",
      "content": "Pay attention to your gerbil's nose. Respiratory problems and allergies can be identified by looking at your gerbil's nose. If your gerbil has a runny nose, you should take it to the vet for evaluation. If your gerbil is having an allergic reaction, you may have to change the bedding in your cage. [3] X Research source Keep in mind that a gerbil's mucus is red. Therefore, a runny nose can be mistaken for a bleeding nose. If your gerbil appears to have a reddish nose, its nose is likely running and it may need treatment for an allergic reaction or respiratory issue."
    },
    {
      "title": "Look for unusual bowel movements.",
      "content": "Look for unusual bowel movements. A change in bowel movements can be an indication a gerbil is sick. If you clean your gerbil's cage regularly, you should have a sense of what's normal for your gerbil. If your gerbil is suddenly eliminating less or more, it may be sick. Diarrhea in particular is generally a warning sign that something is wrong. [4] X Research source"
    },
    {
      "title": "Watch for signs of a seizure disorder.",
      "content": "Watch for signs of a seizure disorder. Seizure disorders are very common in gerbils. For the most part, seizures are not life threatening or dangerous. They can be concerning, however, and should be evaluated by a vet to make sure your gerbil is otherwise healthy. [5] X Research source Seizures usually begin a gerbil when a gerbil is 2 to 3 months old. You may notice your gerbil twitches, goes into a mild trance, or has some muscle convulsions. Usually, seizures last several minutes. Seizures are fairly common. About 20% of gerbils will develop seizures. They can be scary, but are usually not a sign of another illness."
    },
    {
      "title": "Evaluate changes in appetite.",
      "content": "Evaluate changes in appetite. A sudden loss of appetite can be a sign of sickness. If you suddenly notice you're filling your gerbil's bowl less often, this can be an indicator your gerbil is sick. A healthy gerbil will have a good appetite."
    },
    {
      "title": "Keep alert for any changes in energy.",
      "content": "Keep alert for any changes in energy. Lethargy is a common early sign of sickness. If you notice your gerbil suddenly seems tired and disinterested in toys and activities, it may be sick. Any changes in your pet's energy level should be evaluated by a veterinarian."
    },
    {
      "title": "Watch out for allergic reactions.",
      "content": "Watch out for allergic reactions. Allergic reactions are a common cause of illness in a gerbil. Usually, an allergic reaction is marked by a runny nose. A gerbil may also lose hair around its nose due to rubbing it vigorously. [6] X Research source Try switching your gerbil's bedding if it appears to be having an allergic reaction. Cedar pine bedding can be particularly irritating for gerbils. Try removing all your current bedding and swapping it with another kind. You may notice symptoms change. If your gerbil remains sick after a change of bedding, take it to the vet. Your gerbil's health issues may not have been caused by allergies."
    },
    {
      "title": "Pay attention to symptoms of respiratory infections.",
      "content": "Pay attention to symptoms of respiratory infections. Respiratory infections are a common affliction in gerbils. Respiratory problems can also be caused by bedding, particularly cedar pine bedding. If your gerbil's coat is rumpled and it makes a clicking noise and lacks energy, it may have a respiratory infection. In addition to changing the bedding, take your gerbil to the vet if it has a respiratory infection. Gerbils are small and their health can decline quickly if they're ill. A respiratory infection should be addressed by a vet."
    },
    {
      "title": "Be wary of intestinal parasites.",
      "content": "Be wary of intestinal parasites. If you just got your gerbil from a pet store, it may have parasites. These are a common health concern that require veterinary treatment. Some parasites may not cause symptoms, and therefore a new gerbil's droppings should be tested by a vet. Other types of parasites can cause diarrhea and dehydration. [7] X Research source Take your gerbil to the vet to get specific instructions on treatment if you suspect your gerbil has a parasite. Clean and disinfect your gerbil's cage thoroughly. If you suspect an infestation of bugs like cockroaches or fleas may have caused the parasites, you should make an effort to eliminate these pests."
    },
    {
      "title": "Take your gerbil to the vet if you suspect it is ill.",
      "content": "Take your gerbil to the vet if you suspect it is ill. Any signs of illness should be evaluated by a vet, especially if they don't appear to be clearing up. Gerbils can easily die from illness if it's left untreated. Any unusual signs or symptoms warrant a trip to your vet's office. [8] X Research source"
    }
  ]
}