{
  "url": "https://www.wikihow.com/Make-Caramel",
  "title": "How to Make Caramel",
  "steps": [
    {
      "title": "Prep your pot.",
      "content": "Prep your pot. You do not need any special equipment to make caramel, but the saucepan or skillet you use should be completely clean. Make sure the pot is heavy, solid, and light-colored so you can monitor the caramelization process. If you plan on adding cream to your caramel, be sure the pot you choose can accommodate the caramel's expansion. [1] X Research source Any impurities in your pot or on your cooking utensil (spoon, spatula) can cause an unwanted reaction called recrystallization . Recrystallization is a chemical process by which impurities and a compound (sugar) are dissolved in a solvent (water) and either the impurities or the compound can be coaxed out of the solution, leaving the other behind [2] X Research source . For our purposes, this means the formation of awful sugar clumps."
    },
    {
      "title": "Take safety precautions.",
      "content": "Take safety precautions. Heated sugar can splatter, and burn you very badly. Wear long-sleeves, an apron, and an oven mitt. If you have glasses, wear them. Keep a deep bowl of cold water nearby to plunge your hand in if caramel lands on it."
    },
    {
      "title": "Mix your sugar and water.",
      "content": "Mix your sugar and water. Sprinkle the sugar in a thin layer at the bottom of your saucepan or skillet. Pour your water over the sugar slowly and evenly so all of the sugar is covered. Be sure there are no dry spots. Only use granulated sugar. Brown sugar and powdered sugars contain too many impurities and will not caramelize. Raw sugar is not recommended."
    },
    {
      "title": "Heat the sugar.",
      "content": "Heat the sugar. Cook the sugar and water on medium heat until the sugar dissolves. Watch the mix closely and swirl the pot if you notice any sugar clumps forming. Most clumps will melt during cooking. To prohibit recrystallization, you can keep the pot covered until the sugar is completely melted. Any sugar crystals hanging on to the sides of the pot will be forced to the bottom by the condensation created. Another trick to prevent recrystallization is to add a tiny amount (a drop or two) of lemon juice or cream of tartar to the sugar water mix right at the moment it begins to dissolve. These recrystallization \"agents\" prevents large crystal lumps from forming by coating the smaller crystals. Some people also use a pastry brush dipped in water to wipe any sugar crystals off the sides of the pot during the heating process. While effective, the bristles can come off the brush and wind up in your beautiful caramel confection."
    },
    {
      "title": "Brown the sugar.",
      "content": "Brown the sugar. Watch the sugar as it darkens. When it has reached the point of almost being burnt and when it is gently foaming and smoking, immediately remove it from the heat. Because cookware and stoves do not always distribute heat evenly, it is important that you stand over the caramel during the entire process. Browning occurs quickly and caramel can burn quickly if left unattended. [3] X Research source"
    },
    {
      "title": "Cool it down.",
      "content": "Cool it down. Add in the cream and butter to cool the pot and stop the cooking process. [4] X Expert Source Jessica Banh Pastry Chef Expert Interview. 6 April 2022. Stir with a whisk on low heat. Any lumps that remain can be strained out. Cool the caramel and store in an airtight container. To make a salted caramel sauce, stir in 1/4 teaspoon of Kosher salt once the caramel mixture cools to room temperature. To make a vanilla caramel sauce, stir in 1 teaspoon of vanilla extract when you remove the caramel from the heat."
    },
    {
      "title": "Clean up.",
      "content": "Clean up. Cleaning up your sticky pan may seem daunting, but it is fairly simple. Either soak your pan in warm water or fill the pan with water and bring it to a boil. Boiling will melt all of the caramel."
    },
    {
      "title": "Put the sugar in a pan.",
      "content": "Put the sugar in a pan. Sprinkle an even layer of sugar in the bottom of a heavy skillet or saucepan. Be sure the pan is large enough to accommodate the sugar's expansion."
    },
    {
      "title": "Heat the sugar.",
      "content": "Heat the sugar. Cook the sugar on medium heat. You will notice the edges of the sugar will begin to brown and cook first. With a clean heatproof utensil, push the liquefied sugar towards the middle of the pan. You want to make sure to move the liquefied sugar so it doesn't begin to burn. Once burnt, it cannot be saved. If lumps begin to form, turn down the heat slightly and stir slowly. The lumps should melt by the time you are done. [5] X Research source"
    },
    {
      "title": "Brown the sugar.",
      "content": "Brown the sugar. The process here will begin to speed up, so don't leave the stove. Watch as the sugar deepens in color to a rich amber. If a recipe you are using calls for the addition of a liquid (like cream), add it in now to cool the pan and slow the cooking process. Use caution when adding liquid to the pan as it will bubble up. If you are using the caramel in a mold (for flan or crème caramel) pour it into the mold now. To make pralines, add a cup of toasted, chopped nuts to the pan. Stir them slightly with a couple pinches of salt, and pour the mixture onto a wax-paper lined baking sheet to cool. [6] X Research source"
    },
    {
      "title": "Cool it down.",
      "content": "Cool it down. If you are not adding liquid to your caramel, another way to cool it down (and stop the cooking process) is to set the base of the pan in a large bowl of cold water. Clean the pan by soaking or boiling water in the pan until all of the caramel has melted away."
    },
    {
      "title": "Now you have your caramel sauce!",
      "content": "Now you have your caramel sauce! Enjoy!"
    }
  ]
}