{
  "url": "https://www.wikihow.com/Identify-Shark-Teeth",
  "title": "How to Identify Shark Teeth",
  "steps": [
    {
      "title": "Search for teeth at the tide line and the shoreline.",
      "content": "Search for teeth at the tide line and the shoreline. Go to the beach at low tide and look for the line of debris in the sand. Walk slowly along this tide line as you keep your eyes peeled for teeth. If the beach is busy, you might have more luck looking right where the waves are crashing into the shoreline so that you can snag teeth before others see them. [1] X Trustworthy Source National Geographic Website of the National Geographic Society Go to source Every now and then, dig up some of the sand along the tide line and/or shoreline and search through it for teeth. While teeth can be found on the surface of the sand, they’re also often found underneath."
    },
    {
      "title": "Sift through shells and sand to find shark teeth.",
      "content": "Sift through shells and sand to find shark teeth. If there are a lot of shells in the areas where you search, it might be a good idea to grab a big pile of shells and sort through them. Scoop up some shells and dig up a little bit of sand that’s underneath. Put the shells and sand into a sifter and shake it. Then, take one object out at a time and observe it to see if it’s a tooth, a shell, or something else. [2] X Trustworthy Source National Geographic Website of the National Geographic Society Go to source While it’s possible to find teeth where there aren’t a lot of shells and/or debris, you may have more luck in areas where shells and debris have collected."
    },
    {
      "title": "Look for dark triangular shapes.",
      "content": "Look for dark triangular shapes. While shark teeth are subtly unique to each other, the teeth that you might find will most likely be black, or another similar dark color. They will also probably be smaller, between about 0.5 inches (1.3 cm) and 2 inches (5.1 cm) in length, and in the shape of a triangle. Focus on these physical characteristics as you scan the sand and sift through shells. [3] X Research source"
    },
    {
      "title": "Identify teeth by their glossy quality.",
      "content": "Identify teeth by their glossy quality. Shark teeth and seashells can sometimes look very similar to each other. If you pick up an object and can’t quite tell which one it is, hold it up to the sunlight. If it’s a shell, the object will likely have ripples and some iridescence, while nearly all shark teeth tend to appear glossy in the light. [4] X Research source"
    },
    {
      "title": "Recognize white shark teeth by their broad, triangular shape.",
      "content": "Recognize white shark teeth by their broad, triangular shape. If you have a shark tooth that’s flat and in the shape of a wide triangle, then you may have a white shark tooth on your hands.There should be coarse serrations along the blade of the tooth and it should also be about 1.5–2.5 inches (3.8–6.4 cm) long."
    },
    {
      "title": "Identify tiger shark teeth by their short blades.",
      "content": "Identify tiger shark teeth by their short blades. Tiger shark teeth blades are only about as long as their roots. They can also be identified by the sharp serrations on the shoulders of their blades and also by how deeply-notched their blades typically are.Tiger shark teeth are typically about 1 inch (2.5 cm) long, but they can sometimes be as long as 1.5–2 inches (3.8–5.1 cm)."
    },
    {
      "title": "Recognize bull shark teeth by their tapering serrations.",
      "content": "Recognize bull shark teeth by their tapering serrations. Bull shark teeth have blades that are flat and broad with a narrow apex. These teeth are usually 1 inch (2.5 cm) long or slightly shorter. While there are serrations along the entire blade, they get smaller and smaller further down the blade."
    },
    {
      "title": "Identify a lemon shark tooth by its slightly angled blade.",
      "content": "Identify a lemon shark tooth by its slightly angled blade. Lemon shark teeth have no serrations and the blade is angled to the side very slightly. Lemon shark teeth blades are also flat and narrow. The average length for lemon shark teeth is about 0.75 inches (1.9 cm). [5] X Research source"
    },
    {
      "title": "Spot a sand tiger shark’s tooth by its narrowness.",
      "content": "Spot a sand tiger shark’s tooth by its narrowness. Sand tiger shark teeth have extremely narrow blades that are free of serrations and typically measure about 1 inch (2.5 cm) in length. [6] X Research source This makes them relatively easy to identify. They also have very high cusps. [7] X Research source"
    },
    {
      "title": "Identify megalodon teeth by their large size.",
      "content": "Identify megalodon teeth by their large size. A megalodon is a type of shark that has been extinct for thousands of years, but it’s remembered for its massive size. You can typically identify this type of tooth by its size alone because it’s so much bigger than other shark teeth, as megalodon teeth typically range from 3.5–7 inches (8.9–17.8 cm) long. You can also identify these by their finely serrated blades and the thin black line that’s located between the blade and the root of the tooth. [8] X Research source"
    },
    {
      "title": "Identify other shark teeth species by their shapes and sizes.",
      "content": "Identify other shark teeth species by their shapes and sizes. Shark teeth from different species tend to stand apart from each other in these ways. The shape of the tooth is often the most telling, as most species have a uniquely angled blade, shaped cusp, or serration quality that identifies it as that particular species. If you think a tooth could’ve come from 1 of 2 possible species, measure its length and see if it fits more with the size of 1 species or the other. [9] X Research source For example, great hammerhead shark teeth stand out because they have a uniquely square root and serrations from the top to the bottom of the blade that are a consistent size."
    },
    {
      "title": "Identify fossilized teeth by their dark coloring.",
      "content": "Identify fossilized teeth by their dark coloring. Shark teeth contain oxygen, which can react with surrounding minerals to create colors over time. Fossilized shark teeth have had at least 10,000 years for this oxidation to take effect, so they’re often black, deep red, brown, grey, or another similar dark color. This varies based on the environment that the tooth has fossilized in, because different sediments contain minerals that create different colors through oxidization. [10] X Research source Shark teeth that are found in areas that contain iron oxide, such as parts of New Jersey, tend to have an orange or red coloring. Shark teeth found in areas that contain a lot of phosphate, such as Venice Beach, Florida, tend to be black, as phosphate is a dense, black mineral. [11] X Research source"
    },
    {
      "title": "Identify modern teeth by their lighter color.",
      "content": "Identify modern teeth by their lighter color. Modern teeth haven’t yet been exposed to the minerals in surrounding sediments for the 10,000 years that it takes to cause oxidation. As a result, these teeth are typically white, and usually appear much like they did when they were in the mouth of the shark they came from. [12] X Research source"
    },
    {
      "title": "Find out the species and see if it’s extinct.",
      "content": "Find out the species and see if it’s extinct. Try determining the general age of the tooth by observing its anatomy and finding out what kind of species it came from. While many shark teeth that you may find can come from sharks like tiger sharks and great white sharks that exist today, you could find one that comes from an extinct species. If you notice that the anatomy of a tooth matches that of an extinct species, the tooth is extremely old. [13] X Research source The megalolamna paradoxodon is one example of an extinct shark species that you could possibly find the teeth of. [14] X Research source ."
    },
    {
      "title": "Recognize teeth that are found inland as old.",
      "content": "Recognize teeth that are found inland as old. While you can certainly find fossilized shark teeth at the beach, both modern and fossilized teeth are frequently found in this location. If you find a tooth significantly inland, then there’s a high chance that it’s very old because it would take a long time for the tooth to be moved far away from the ocean by the elements. [15] X Research source For instance, if you find a shark tooth in a creek that’s 50 miles (80.5 kilometers) inland, it’s probably a fossilized tooth."
    }
  ]
}