{
  "url": "https://www.wikihow.com/Make-Taylor-Swift-Friendship-Bracelets",
  "title": "How to Make Taylor Swift Bracelets: A Guide for Swifties",
  "steps": [
    {
      "title": "Gather your beads, elastic, tape, and glue.",
      "content": "Gather your beads, elastic, tape, and glue. To make friendship bracelets for the Eras Tour, you’ll need some stretchy elastic , colorful beads of your choice, letter beads , tape, and possibly some hot glue or super glue. It’s usually a good idea to buy separate containers of colorful beads and letter beads rather than friendship bracelet kits, as those kits often don’t have enough letter beads. Find all of your supplies at your local craft store or online. [1] X Research source Practically any beads will work as long as they have a hole running through them so you can string them on the elastic. Plastic and metal beads are popular, as are clay beads . It’s a good idea to choose a variety of colors and styles so you can make a bunch of unique bracelet designs. If you’d like, feel free to get some charms to add to your bracelets as well."
    },
    {
      "title": "Plan out your bracelet's design.",
      "content": "Plan out your bracelet's design. Before you actually begin stringing your beads, decide how you want each friendship bracelet to look. Line the beads you plan to use next to each other so you can see what the bracelet would look like. This is especially important if you plan on making a pattern with your beads. Plus, this allows you to keep all your beads in one place so you don’t have to search for them later on. [2] X Research source Many Swifties base their bracelet designs around Taylor Swift’s albums, songs, or lyrics. Use your letter beads to map out what you want your bracelets to say. For example, if your favorite song is “Fearless,” make a bracelet that says “Fearless.” Then, because the album Fearless is associated with the color yellow, make a pattern with white and yellow beads to complete the design. Or, if reputation is your favorite album, choose a lyric from one of your favorite songs and use black and metallic beads to complete the bracelet. Feel free to use beads shaped like different designs, too. For example, heart-shaped beads would work well for a “Love Story” or Lover themed bracelet."
    },
    {
      "title": "Cut a piece of elastic approximately 18 inches (45 cm) long.",
      "content": "Cut a piece of elastic approximately 18 inches (45 cm) long. Don’t worry—your finished bracelet won’t be that long. This just ensures you have plenty of room to work with and makes it easier to tie the knot at the end. It also allows you to make friendship bracelets of different sizes. In general, most adult-sized bracelets will be about 7.25-7.5 inches (18.5-19 cm) long, while child-sized bracelets will be about 6 inches (15 cm) long. [3] X Research source Give the elastic a stretch after you cut it so it’s less likely to break. It’s also possible to make friendship bracelets with thread rather than elastic. In this case, cut about 60 inches of thread. Tie knots throughout the thread, then add or remove them as needed to adjust the length."
    },
    {
      "title": "Tape down one end of the elastic and thread your beads.",
      "content": "Tape down one end of the elastic and thread your beads. Taping one end of the elastic to a flat surface will help prevent the beads from falling off as you string them. Then, simply put the other end of the elastic through the beads to string them. Follow the bead pattern you created earlier to make the process easier. It may be helpful to stop and measure the bracelet as you work to make sure it’s your desired length. [4] X Research source It’s possible to make friendship bracelets without taping the elastic. If you don’t have anything to hold it in place, leave enough room at the end while you’re stringing the beads to make sure they don’t fall off, or tie a knot at one end to keep the beads in place. To make sure your bracelet will fit, hold your wrist against the elastic. Take the loose end and carefully wrap it around your wrist to see if you need to add or remove beads. Make sure to hold the loose end of the elastic tightly so your beads don’t fall off!"
    },
    {
      "title": "Tie a knot to finish the bracelet.",
      "content": "Tie a knot to finish the bracelet. Once you’re done stringing your beads and like how the bracelet fits, take both ends of the elastic and tie a double-knot as close to the beads as possible. Pull each end of the elastic tightly and make sure there are no gaps in the bracelet. For extra security, dot the knot with a bit of hot glue or super glue. Trim off any excess elastic, and you’re done! Repeat the process for the rest of your Taylor Swift friendship bracelets. [5] X Research source It’s a good idea to make your bracelets at least a few days before your concert so you’re not stressed trying to finish them at the last minute. Store them in a ziplock bag or plastic container so you don’t lose them before the big day."
    },
    {
      "title": "Taylor Swift album titles",
      "content": "Taylor Swift album titles Trying to think of what to include on your friendship bracelets can be overwhelming, so it may help to start simple. Make bracelets for your favorite Taylor Swift album or for all of her albums by using your letter beads to spell out the album titles. Swifties have assigned colors to each album, as well, so consider using those colors for your beads. Here are each of the albums and their associated colors: [6] X Research source Taylor Swift/Debut: green Fearless: yellow Speak Now: purple Red: red 1989: light blue Reputation: black Lover: pink Folklore: gray Evermore: brown Midnights: dark blue The Tortured Poets Department (TTPD): white"
    },
    {
      "title": "Fandom inside jokes",
      "content": "Fandom inside jokes Swifties have developed a number of inside jokes over the years, so this can be a great way to show off your fandom knowledge. Many of the jokes are references to funny things Taylor Swift has said or done or to when fans were wrong about new album theories. Here are some examples: [7] X Research source 5 holes in the fence No, it’s Becky Starbucks lovers My mind is alive Still swift af boi Seemingly ranch Clowning Woodvale truther Macavity Oh my God, she’s insane Clownelia Street Where’s the scarf, Jake? Sydney! Stars, do u like dem RIP me! I died dead This dang deer mskingbean1989 Dibbles Get out of my house RATATATATATA"
    },
    {
      "title": "Your favorite songs",
      "content": "Your favorite songs Taylor Swift has released hundreds of songs in her almost twenty-year career, so there are plenty to choose from! Make bracelets with the titles of your favorite songs, or try to include a few from each album. If you feel stuck, look up Swift’s entire song catalog online, but here are a couple from each album to get you started: [8] X Research source Our Song Teardrops on My Guitar Fearless Love Story Long Live Sparks Fly All Too Well I Bet You Think About Me Blank Space Shake It Off King of My Heart Look What You Made Me Do Lover The Archer August Mirrorball Champagne Problems No Body, No Crime Lavender Haze Mastermind So High School Fortnight"
    },
    {
      "title": "Songs without the letter ‘E’",
      "content": "Songs without the letter ‘E’ Since the Eras Tour began, many Swifties have complained that they quickly ran out of ‘E’ beads when making friendship bracelets. Luckily, Taylor Swift has a ton of song titles without the letter ‘E,’ so there’s no need to stress! Here are some ideas: Mad Woman Cardigan Gold Rush Last Kiss Hoax Illicit Affair Call It What You Want I Almost Do Starlight Labyrinth Glitch Ivy Long Story Short London Boy Karma Paris Stay Stay Stay Run 22 Mary’s Song"
    },
    {
      "title": "Your favorite lyrics",
      "content": "Your favorite lyrics Many Swifties choose to reference their favorite lyrics when making friendship bracelets. These can be deep, inspiring lyrics or funny ones—the choice is up to you! Think of some iconic lyrics or look up your favorite songs online if you need some help. Here are some examples: [9] X Research source Meet me at midnight It was rare, I was there Devils roll the dice Angels roll their eyes Dressing for revenge For the hope of it all Spelling is fun Sexy baby Cause she’s dead Like a secret/like an oath Still bejeweled Enchanted to meet you Head first, fearless X marks the spot Stupid old pickup truck Drop everything now Twin fire signs 300 takeout coffees later Stolen kisses, pretty lies It was maroon"
    },
    {
      "title": "Song acronyms",
      "content": "Song acronyms Some of Taylor Swift’s song titles are pretty long, so many Swifties shorten them to acronyms, especially when discussing them online. A lot of these acronyms are well-known within the fandom, but some can be a bit confusing if you’ve never seen them before. Either way, song acronyms are a great option if you’re running out of letter beads and still want to make more bracelets. Here are some common acronyms and what they stand for: [10] X Research source ATW10MVTVFTV (All Too Well 10 Minute Version, Taylor’s Version, From the Vault) IKYWT (I Knew You Were Trouble) OOTW (Out of the Woods) BTD (Back to December) BTR (Better than Revenge) LWYMMD (Look What You Made Me Do) RWYLM (Right Where You Left Me) NTWDT (Now That We Don’t Talk) WTNY (Welcome to New York) YBWM (You Belong With Me) NBNC (No Body, No Crime) CBBH (Come Back, Be Here) YOYOK (You’re On Your Own, Kid) DWOHT (Dancing with Our Hands Tied) DBATC (Death by a Thousand Cuts) HYGTG (How You Get the Girl) IOMWIWY (I’m Only Me When I’m with You) KOMH (King of My Heart) SOTB (Snow on the Beach) TWILY (The Way I Loved You)"
    },
    {
      "title": "Eras Tour references",
      "content": "Eras Tour references The Eras Tour began in March 2023 and is set to run until December 2024, so there are plenty of references Swifties have made based on things that have happened on the tour. This includes things like chants for certain songs, mishaps that happened on stage, and the struggle to get tickets. Here are some great friendship bracelet ideas that encompass the Eras Tour experience: [11] X Research source 123LGB (or 123 Let’s Go B*tch) She wasn’t doing anything! Eras Tour *insert city here* (ex: Eras Tour Miami) In my Eras era Eras Tour 2023/2024 I survived the Great War The Great Ticketmaster War Ticketmaster Survivor Eras Tour *City* *Night* (ex: Eras Tour Nashville Night 2) Eras Tour *Date* (ex: Eras Tour May 6, 2023) Summon the demons, b*tch Take us to church, Taylor The Errors Tour Taylor, you’ll be fine YFYFBYNLIG (You forgive, you forget, but you never let it go) Your stadium name (ex: MetLife Stadium)"
    },
    {
      "title": "Other Taylor Swift references",
      "content": "Other Taylor Swift references Swifties have learned a lot about Taylor Swift throughout the years, including the names of her cats, her favorite number , her love for leaving easter eggs, and her relationships. If you don’t want to directly reference a song or lyric, check out the following Taylor Swift references you can use for your bracelets: [12] X Research source Meredith Gray Olivia Benson Benjamin Button Tayvis (Taylor and Travis) From the Vault Swiftie Taylor’s Version I (heart) Taylor Swift 13 Junior Jewels TS Easter eggs Mother is mothering Karma is the guy on the Chiefs"
    },
    {
      "title": "Wear the bracelets you want to trade.",
      "content": "Wear the bracelets you want to trade. One of the easiest ways to indicate that you want to trade friendship bracelets is to wear them where others can see them. Typically, Swifties wear all the bracelets they want to trade on one arm and all the bracelets they want to keep on the other so they don’t get mixed up. This invites others to come up and ask if you want to trade, and it can make it a lot less nerve-wracking than having to ask yourself! [13] X Research source If you don’t want to wear all your bracelets or have too many to wear, consider putting them on a keyring or carrying them in a ziplock bag. Some venues have policies about how you can carry your friendship bracelets, though, so make sure you know what’s allowed beforehand. Wearing the friendship bracelets is also a great way to add some color to your outfit!"
    },
    {
      "title": "Ask people if they want to trade.",
      "content": "Ask people if they want to trade. It can be scary to go up to people you don’t know, but as Taylor Swift says, “You’ve got no reason to be afraid.” In most cases, if other concert-goers are wearing friendship bracelets, they probably want to trade. Don’t be afraid to talk to people while you’re waiting in line, getting merch or food, or sitting in your seat before the concert starts. This is a great way to get awesome friendship bracelets and meet fellow Swifties! [14] X Research source Say something like “Hey, I see that you have friendship bracelets. Do you want to trade?” Or, “I love your outfit! Are you trading bracelets?” If you see someone who doesn’t have any bracelets, especially little kids, ask if they’d like to have one of yours. This could make them really happy, and it’s nice to do things without expecting something in return."
    },
    {
      "title": "Be kind.",
      "content": "Be kind. Remember, everyone is at the Eras Tour to have a good time. When it comes to bracelets, not everyone has the same resources or ability to make them. Don’t judge someone for having bracelets that don’t fit your personal tastes. Be grateful for any that you receive, and if you turn down an offer to trade, be polite and thank them for the offer. Don’t get upset if someone turns down your offer to trade, either. There are all kinds of reasons someone may decline. They may want to keep the bracelets they made, or they may have run out of ones they want to trade, for example. Simply wish them a fun time at the concert and look for someone else to trade with."
    },
    {
      "title": "Clean up after yourself.",
      "content": "Clean up after yourself. Accidents happen, and sometimes bracelets may break while trading. If this happens, do your best to pick up all the beads and string and dispose of them properly. Not only is this courteous to your fellow concert-goers, but it’s a big help for the workers who have to clean up once the show is over. To avoid having your bracelets break, try dabbing some hot glue or superglue onto the knot. Be careful not to get it on your hands or on the beads!"
    },
    {
      "title": "Put them in a shadow box.",
      "content": "Put them in a shadow box. Shadow boxes are display cases that you can hang on the wall or store on a flat surface to show off all your Eras Tour goodies. Decorate your shadow box by adding your friendship bracelets, photos from the Eras Tour, and confetti. If you have beads left over, glue them onto the frame of the shadow box for more personalization. The possibilities are endless. [15] X Research source"
    },
    {
      "title": "Make them into Christmas ornaments.",
      "content": "Make them into Christmas ornaments. Whether you celebrate Christmas or not, this is a unique way to display your friendship bracelets. Buy some round, transparent Christmas ornaments and pry them open. Arrange your bracelets inside, then close them. Consider adding acrylic paint, stickers, or other decorations to personalize your ornaments even further. [16] X Research source If you have a lot of bracelets, consider making an ornament for each era, then using ribbons of the corresponding color to hang them. Some Swifties also loop their bracelets on the limbs of their Christmas trees, instead!"
    },
    {
      "title": "Make a light-up mason jar.",
      "content": "Make a light-up mason jar. If you want to get creative, put your friendship bracelets into a small mason jar or transparent cup, then place that container inside a larger mason jar. Loop battery-operated fairy lights around the inner jar, then close the lid of the larger jar, and tie a ribbon around the top for decoration. In addition to storing your bracelets, this craft makes a great night light! [17] X Research source"
    },
    {
      "title": "Put them on a bracelet holder.",
      "content": "Put them on a bracelet holder. Keep your bracelets from getting tangled by storing them on a bracelet holder. This way, you can also admire all the different designs you received. There are all kinds of bracelet holders to choose from, including one shaped like Taylor Swift’s famous heart hands . Some Swifties have also found bracelet holders shaped like the Eras Tour stage , which is a great way to add to the memories. [18] X Research source"
    },
    {
      "title": "The idea started with Swift’s song “You’re on Your Own, Kid.”",
      "content": "The idea started with Swift’s song “You’re on Your Own, Kid.” On October 21, 2022, Taylor Swift released her 10th album, Midnights , which features the song “You’re on Your Own, Kid.” The song contains the lyrics “So make the friendship bracelets / Take the moment and taste it,” which is the main inspiration for the friendship bracelet trend. The album was released right before Swift announced the Eras Tour, and fans quickly began sharing fan project ideas on social media sites like TikTok. The friendship bracelet idea is the one that stuck. [19] X Research source Since then, trading friendship bracelets has taken on a life of its own, and even celebrities get involved at the shows. Famously, Swift’s current boyfriend Travis Kelce made a friendship bracelet with his phone number that he intended to give to her at the show he attended."
    }
  ]
}