{
  "url": "https://www.wikihow.com/Housebreak-Shih-Tzu-Puppies",
  "title": "How to Housebreak Shih Tzu Puppies",
  "steps": [
    {
      "title": "Take time off work to train your puppy.",
      "content": "Take time off work to train your puppy. From housebreaking to socialization, puppies require lots of training time. Take as much time off from work as you can when you first bring your new puppy home. [1] X Research source Plan to take 1-2 weeks off work. If you can't take off, ask a relative, friend, or neighbor to take the dog out. You could also hire a dog sitter or walker. In addition to needing training and supervision, young puppies have small bladders and haven’t fully developed the muscles that control when it goes to the bathroom. In order to prevent accidents, it’s best to take your puppy out every 1-2 hours."
    },
    {
      "title": "Start crate training as soon as you bring your pup home.",
      "content": "Start crate training as soon as you bring your pup home. Dogs are den animals, so they find enclosed spaces comforting. Start crate training your pup the day you bring it home. It’ll be less likely to go to the bathroom in the crate, but do your best not to leave your puppy crated for more than a couple hours. [2] X Research source Choose a crate that’s just a bit larger than a full grown Shih Tzu. Your dog should be able to turn around, but a crate any larger won’t offer a sense of security. To determine crate size, you should measure the dog from its nose to its tail for the length and width measurements, and from the floor to the top of its head for the height measurement. Add 4 to 6 inches (10 to 15 cm) to get your crate dimensions. [3] X Research source Place toys and objects that smell like you in the crate so your dog develops positive associations with it. Avoid using a crate as a punishment. It should be a source of safety and comfort, not a means of punishing your dog."
    },
    {
      "title": "Offer meals at the same times each day.",
      "content": "Offer meals at the same times each day. Sticking to regular mealtimes will help you potty train your puppy and avoid accidents as it matures. In general, you should choose a brand of food marked for small breed puppies and offer morning and evening servings of 1/4 to 1/2 a cup (60 to 120 g). Your puppy’s vet will help you decide how much food to feed your puppy, as well as how often. [4] X Research source Sometimes smaller dogs need 3-4 small meals a day to manage their blood sugar levels, so check with your vet."
    },
    {
      "title": "Take your puppy out fifteen minutes after any activity.",
      "content": "Take your puppy out fifteen minutes after any activity. Puppies need to be let out frequently, especially smaller breed pups. Follow a fifteen minute rule when scheduling times to take your puppy out to potty. Take it to its potty area fifteen minutes after each meal, after playing, or after waking up from naps. [5] X Research source In addition to following the fifteen minute rule, you should make sure your pup gets to its potty area every couple hours during the daytime."
    },
    {
      "title": "Take your puppy out at night.",
      "content": "Take your puppy out at night. You’ll need to take your puppy out at least once or twice at night in order to avoid accidents. Set your alarm, get out of bed, and take your pup to its potty spot. [6] X Research source Try to avoid playing or making overnight potty trips exciting in any way. Make it matter of fact and calm so your pup doesn’t think it’s playtime. [7] X Research source"
    },
    {
      "title": "Choose a consistent potty area.",
      "content": "Choose a consistent potty area. Dogs instinctively like to mark one spot consistently. Designate one potty area when you start training so your pup understands where it’s appropriate to go to the bathroom. [8] X Research source Your designated area could be an indoor potty pad or spot outside, but try to use pads in combination with outdoor training . Relying on pads alone makes it difficult to get your dog to go to the bathroom in unfamiliar locations in the future, for example when you’re at a friend’s home or on a trip. [9] X Research source"
    },
    {
      "title": "Consider paper training your puppy.",
      "content": "Consider paper training your puppy. Training your puppy to use a potty pad or newspaper can be helpful if you live in a high rise or cold, snowy environment. However, keep in mind pads typically make the housebreaking process more complicated. You can start your puppy out by taking it to its pad to potty, but you should gradually incorporate outdoor training. [10] X Research source When you want to start getting your pup used to going to the bathroom outside, start bringing the potty pad closer to your home’s exit. Then, if possible, position the pad just outside of your door or in a designated potty area outside. Once your pup gets used to pottying on the pad outside, remove it. Give it a “Go potty!” command when you take it outside and want it to go to the bathroom."
    },
    {
      "title": "Praise your puppy as soon as it potties correctly.",
      "content": "Praise your puppy as soon as it potties correctly. Rewarding your puppy with exaggerated praise and food treats will help it form a positive association with correct bathroom behavior. You must offer rewards immediately when it starts to go to the bathroom so it makes the connection between the reward and going to the bathroom. [11] X Research source Keep tiny pieces of a treat less than the size of a pea on hand when you take your puppy out to potty. If you wait to treat it when you’re back inside, it won’t understand that the reward was for going to the bathroom correctly."
    },
    {
      "title": "Incorporate a verbal command.",
      "content": "Incorporate a verbal command. As your puppy starts getting used to pottying in the appropriate area, start to incorporate a “Go potty!” command. Say the command when you arrive at the potty spot, and be sure to reward it when it potties. Over time, your puppy will associate the command with pottying and being rewarded. A “Go Potty” command will help you get your dog to use the bathroom in unfamiliar locations in the future. Other than giving a verbal potty command, avoid unnecessary distractions, like games or talking. [12] X Research source"
    },
    {
      "title": "Supervise your dog closely for at least four to eight weeks.",
      "content": "Supervise your dog closely for at least four to eight weeks. You should keep a close eye on your pup when it’s indoors during potty training until it’s gone four to eight weeks without an accident. That way, you’ll have the best chance of interrupting an accident the moment it happens. [13] X Research source Keeping your puppy in a particular area instead of allowing it to access your entire home will help you keep an eye on it. When it’s not in its crate, keep doors closed or try using sturdy baby gates keep areas off limits."
    },
    {
      "title": "Interrupt accidents immediately.",
      "content": "Interrupt accidents immediately. Be patient with housebreaking and expect your puppy to have accidents. If you see an accident in progress, get your pup’s attention by saying “Oops!” or No, no!” Pick the puppy up, and take it to a designated potty area, whether it’s a paper pad or spot outside. [14] X Research source Try not to yell or scare your puppy when you interrupt an accident. It might become afraid to go to the bathroom in front of people, making the housebreaking process much more difficult."
    },
    {
      "title": "Avoid punishing your puppy after an accident you didn’t catch.",
      "content": "Avoid punishing your puppy after an accident you didn’t catch. If you come home to find an accident or didn’t see the accident happen, don’t rub your dog’s nose in it or otherwise punish it. Even if only a couple minutes have passed, just clean it up without any fuss. Dogs, especially puppies with short attention spans, can’t understand the connection between a punishment and the accident."
    },
    {
      "title": "Clean up accidents as soon as possible.",
      "content": "Clean up accidents as soon as possible. Use an enzymatic cleaner that removes pet odors to deal with accident spots. You can find a cleaner at your local pet store. If you don’t remove scent traces, your dog will smell previous accidents and want to mark there again. [15] X Research source"
    },
    {
      "title": "Try not to let your puppy lay in an accident.",
      "content": "Try not to let your puppy lay in an accident. It’s vital that your puppy doesn’t get used to being around its mess. Dogs are instinctively clean and don’t like to be around their excrement. However, if you leave a puppy in its crate for too long, it’ll have to go inside and, over time, might become accustomed to unsanitary conditions. [16] X Research source It if gets used to being in its mess, you’ll have a lot more trouble housebreaking it effectively. Be sure not to leave your puppy in its crate for more than two hours, and clean up any accidents as soon as you see them."
    }
  ]
}