{
  "url": "https://www.wikihow.com/Iron-Silk",
  "title": "How to Iron Silk",
  "steps": [
    {
      "title": "Spritz the silk down with water so it’s damp.",
      "content": "Spritz the silk down with water so it’s damp. Silk is a tricky material to work with, especially since it’s more delicate than other fabrics. To prevent burning, spray down the surface of the material with tap water, which will help the ironing process go a lot more smoothly. If you iron dry silk, you may mess up the texture. It’s best to iron your silk right after you’ve washed it. Wait until the item is mostly dry but still slightly damp—this way, you may not have to spritz it down ahead of time."
    },
    {
      "title": "Turn the clothing item inside-out to protect the silk.",
      "content": "Turn the clothing item inside-out to protect the silk. Since silk is so delicate, try to limit any contact the iron makes with the actual material. With this in mind, flip the item so it’s inside-out, which offers extra protection to the silk. [1] X Research source For instance, if you’re ironing a silk shirt, both the sleeves and the body need to be turned inside-out."
    },
    {
      "title": "Smooth out the silk so it’s flat on your ironing board.",
      "content": "Smooth out the silk so it’s flat on your ironing board. Flatten any obvious wrinkles with your hands, so the fabric is as smooth as possible. If your silk item is really large, like a dress or dress shirt, you may have to work in segments. [2] X Research source For instance, if you’re ironing a dress shirt, you may start by flattening and ironing the chest portion before moving on to the sleeves."
    },
    {
      "title": "Arrange a press cloth on top of the silk.",
      "content": "Arrange a press cloth on top of the silk. Don’t iron silk directly—since it’s really delicate, you need to have a “buffer” of sorts between the iron and the actual fabric. This is known as a “press cloth,” but it can really be any lint-free material that covers your silk. A small square of cloth will work just fine. Use a white or light-colored press cloth so no color transfers to your silk. Go with a lint-free cloth so nothing transfers while you iron."
    },
    {
      "title": "Adjust your iron to the lowest heat setting.",
      "content": "Adjust your iron to the lowest heat setting. Turn your iron way down, so you don’t risk damaging your silk in any way. A lot of modern irons come with special fabric settings—if your iron has this, set it to the “silk” setting instead. [3] X Research source Your silk may yellow if your iron is set to a high temperature. [4] X Research source Feel free to use the steam function on your iron, if you have one. [5] X Research source"
    },
    {
      "title": "Center the iron on the press cloth and press it down for a few seconds.",
      "content": "Center the iron on the press cloth and press it down for a few seconds. Don’t worry about moving your iron from side to side—just focus on holding it one place. Press down for a few seconds. Don't go any longer than that or you might accidentally burn or damage the material. [6] X Research source Depending on what you’re ironing, it may help to work in a specific direction. For instance, if you’re ironing a silk tie, start at the bottom and work your way to the top. [7] X Research source"
    },
    {
      "title": "Lift the iron straight up and give the silk a few seconds to cool off.",
      "content": "Lift the iron straight up and give the silk a few seconds to cool off. Raise the iron straight up off the silk's surface before moving onto the next section of silk. Wait a few seconds so the material isn't super hot, then move onto another section of material. [8] X Research source"
    },
    {
      "title": "Repeat this pressing and lifting pattern along your silk.",
      "content": "Repeat this pressing and lifting pattern along your silk. Move the press cloth to another section of your silk item. Press the iron down for a few seconds before lifting it up again, moving the press cloth as you go. Continue this process until you’ve ironed the entire thing. [9] X Research source If you’re using a large press cloth that covers all of your silk, you don’t need to worry about shifting it around."
    },
    {
      "title": "Wear, display, or hang up your silk once you’re done ironing it.",
      "content": "Wear, display, or hang up your silk once you’re done ironing it. Wait for the silk to dry and cool off completely before taking it off the ironing board. [10] X Research source Turn the item right-side-out again before wearing or displaying the item. If you don’t plan on using the silk right away, hang it up in a dry, dark area, away from natural or fluorescent lighting. [11] X Research source If possible, keep mothballs or other moth deterrents near your silk, since moths are very attracted to silk."
    }
  ]
}