{
  "url": "https://www.wikihow.com/Loc-Styles-for-Men",
  "title": "50+ Loc Styles for Men and How Long They Last",
  "steps": [
    {
      "title": "Rope twists are a clean style that look fresh in any setting.",
      "content": "Rope twists are a clean style that look fresh in any setting. The tight, sleek texture and simple overhang make them a great choice for formal and casual moments. You can wear thick rope twists for a chunkier look or thin rope twists for a lowkey look. Thin rope twists last about two weeks. Thick rope twists, also known as Senegalese twists , last anywhere from eight to 16 weeks depending on how well you take care of them. [1] X Research source Briefly wear rope twists to add a curl to your locs once you take them out. Moisturize your roots and wrap your hair in a silk bonnet to preserve your rope twists."
    },
    {
      "title": "Classic locs are a timeless look that have been worn throughout history.",
      "content": "Classic locs are a timeless look that have been worn throughout history. They are a casual look that sport a lot of length. This protective style is a great way to embrace your culture and practice variety, as you can style them in a bunch of ways. Wear them in a ponytail if you want to move your length back. Wear them in a tall bun to move your locs up to your head. Locs date as far back as 2500 B.C. and have been seen on mummified bodies from Ancient Egypt. [2] X Research source With proper maintenance, locs can last for years. To take care of your locs, wash them once a week using a natural shampoo that doesn’t leave residue. Condition from root to tip after washing to keep your locs from becoming brittle. [3] X Research source"
    },
    {
      "title": "This voluminous look adds dimension to your locs.",
      "content": "This voluminous look adds dimension to your locs. It involves wrapping your locs around each other to create large barrels that go down the back of the head. The number of barrels varies depending on how much volume you want and how much tension your hair can handle. Since the hair is twisted, it’s best to take this style out after six weeks. The locs will begin to unravel and tangle around each other if you leave them in for longer. [4] X Research source"
    },
    {
      "title": "Braiding your locs gives a cornrow-esque look with more length.",
      "content": "Braiding your locs gives a cornrow-esque look with more length. While cornrows gather the hair more towards the scalp, braided locs take locs from around the head and braids them back into sections. These sections let the locs flow, making braided locs a great way to let your locs breathe with a braided look."
    },
    {
      "title": "These chunky locs are full of texture and depth.",
      "content": "These chunky locs are full of texture and depth. Styling jumbo loc braids involves sectioning your hair into different parts and braiding them into thick loc braids. They look good when left down, but style them in a low ponytail for a back-heavy look that pulls the hair off of your neck. [5] X Research source Take this style out after two to eight weeks, depending on how much you want to show each individual loc, as they will start to tangle together once your hair grows. [6] X Research source"
    },
    {
      "title": "This intricate loc style is great if you want to switch up your look.",
      "content": "This intricate loc style is great if you want to switch up your look. Basket weave locs are styled by weaving your locs in an chunky, over-under pattern, much like a wicker basket. You can wear basket weave locs if you have mid-length or long locs, as you need enough hair for the basket pattern. For long locs, get your basket weaved into a ponytail or bun to keep them together and off of your neck. [7] X Research source The amount of time you can keep basket weave locs in depends on preference. To keep your basket weave locs fresh and healthy, take them out after 4-6 weeks and get a retwist."
    },
    {
      "title": "Wick locs are a thick, creative style.",
      "content": "Wick locs are a thick, creative style. These locs are made by crocheting sections of hair together into thick, protruding locs that resemble cylinders. Wick locs cause less damage to your hair than traditional locs and have more of a natural look. They are a permanent type of loc that’s difficult to undo if you decide you don’t like it, so make sure you’re sure before committing to wick locs. [8] X Research source"
    },
    {
      "title": "This style combines two classic looks into a sharp, unique look.",
      "content": "This style combines two classic looks into a sharp, unique look. Cornrow locs are bulky and move towards the back of the head in sections. The sections allow the base of the locs to stand out on the head, which contrasts well with the overlapping locs on top. To avoid tension and breakage, take your cornrow locs out after two to eight weeks. [9] X Research source"
    },
    {
      "title": "This creative look involves letting your hair naturally loc up.",
      "content": "This creative look involves letting your hair naturally loc up. To grow freeforms , leave your hair alone and let it knot up. After three to five weeks, your locs will begin to form, though they may take one to two years to fully mature. As your locs freeform, they will sometimes tangle together and create a larger loc. To prevent this, find the base of the two strands that are forming together and slowly pull them apart from the scalp upward. [10] X Research source The coarser your hair is, the faster the locs will take shape. Everyone’s freeforms are different from each other’s, as everyone’s hair is different. If you want a look that is unique to you, rock freeform locs."
    },
    {
      "title": "Freeform afro locs are a dynamic way to express creativity.",
      "content": "Freeform afro locs are a dynamic way to express creativity. This look mixes flowing locs with a voluminous afro, which allows you to get really creative. Use a scrunchy or a scarf to put your locs up into a pineapple look. Growing afro freeforms involves letting your hair naturally loc up. As with regular freeforms, it takes three to five weeks to start seeing locs and 1-2 years for them to mature depending on your hair type and how well you take care of them. [11] X Research source [12] X Research source Get a fade on the afro for a crisp look that leads into the locs."
    },
    {
      "title": "Mix your mature locs into a chunky look.",
      "content": "Mix your mature locs into a chunky look. If your locs are long and mature, you can switch up your look in various ways. Get chunky locs by letting them grow out and not getting a retwist. Or go to the loctician and ask for them to put your locs together for a thicker look. If you want to clean up your look, wait six weeks to get a retwist instead of the standard four to six. When wearing styles with chunky locs, make sure they aren’t restrictive and have minimal tension so that your locs remain healthy. [13] X Research source"
    },
    {
      "title": "Draw extra attention to your hair with this style.",
      "content": "Draw extra attention to your hair with this style. Pairing a fade with locs creates a strong contrast between the lower half of your head and the upper half, especially if you have long locs. This is great if you’re proud of your fade and want to show it off. To draw extra attention to the fade, wear your locs in a high bun or ponytail. Getting a fade with your locs lets you experiment with the length of your sides, lending versatility to this hairstyle."
    },
    {
      "title": "An undercut gives the locs room to shine.",
      "content": "An undercut gives the locs room to shine. The undercut starts at the temple and buzzes all the way down to the ear. This creates a look similar to mohawk locs, but the long locs help them stand apart. For a relaxed, kicked back vibe, rock locs with an undercut."
    },
    {
      "title": "Skytop locs are a unique style that bring attention to the top.",
      "content": "Skytop locs are a unique style that bring attention to the top. Just like locs with an undercut or fade, skytop locs involve cutting the sides to let the top shine. The key difference is that the sides are usually cut into a high fade that only leaves hair at the top head, with the locs appearing above the crown. Wear skytop locs long to give the appearance of long hair with less layers. Put your skytop locs in a high ponytail for a smooth look that flows upward."
    },
    {
      "title": "For a relaxed, sophisticated look, wear your locs in a low pony.",
      "content": "For a relaxed, sophisticated look, wear your locs in a low pony. A low pony keeps your hair out of your eyes and provides a contrast between the front and back of your head. Having your locs in a low pony helps show off your face, too, since it leaves room for your jawline and neck to show."
    },
    {
      "title": "Get your hair out of your face with this style.",
      "content": "Get your hair out of your face with this style. A high pony can alleviate irritation by getting your locs out of your face. It can also give the illusion of height and draw attention upward since your hair is sitting on top of your head."
    },
    {
      "title": "For easy-to-manage locs, rock mid-length locs.",
      "content": "For easy-to-manage locs, rock mid-length locs. You can style them into a high ponytail or a top knot bun to give the illusion of extra height. You can pair them with a fade for a crispy look that makes your locs look fresh."
    },
    {
      "title": "Don’t be afraid to start your locs.",
      "content": "Don’t be afraid to start your locs. If you want to get into the loc game early, get short locs. Although short locs don’t boast many styles, they are a great way to see what your hair looks like when it is in locs. Grow short locs if you want a dynamic texture covering your head without overwhelming length. Put your short locs into small space buns to keep them out of your face."
    },
    {
      "title": "This look is fresh and dynamic.",
      "content": "This look is fresh and dynamic. Short locs with a taper give you a crispy look while showing off dynamic texture. You can get a taper on the sides to help shape your hair and create a clean finish that helps balance out the short locs. As your hair continues to grow, you can keep tapering the sides or switch to an undercut."
    },
    {
      "title": "Rock pigtail locs for a fun, playful look.",
      "content": "Rock pigtail locs for a fun, playful look. To put your hair into pigtails, take two rubber bands or hair ties and section your hair into two tails, one on each side of your head. Then, wrap the two sections with the rubber bands or hair tie. Since they’re just your regular locs in rubber bands, you can wear them for however long you want. Be careful, though, as this can encourage your hair to grow into permanent pigtail sections."
    },
    {
      "title": "Curly locs are a great way to enhance your shape.",
      "content": "Curly locs are a great way to enhance your shape. Get curly locs by wearing rollers or perm rods and shaping your locs around them. Once you take them out, they will be curly thanks to being stuck in place for an extended period of time. If you don’t want to wear rollers or perm rods, put your locs into two strand twists and take them out to encourage a curly look. Depending on how tight you curl them, curly locs will last until your next wash. [14] X Research source"
    },
    {
      "title": "For a less curly look, rock wavy locs.",
      "content": "For a less curly look, rock wavy locs. Wavy locs are a great style that look good no matter what. The soft curl is a sight for sore eyes, and they aren’t hard to achieve. To get wavy locs, use rollers or perm rods and loosely wrap your locs around them. For a wavy look without rollers or perm rods, put in two strand twists when your hair is wet and take them out after two days. [15] X Research source"
    },
    {
      "title": "These locs give you a bold, tough look.",
      "content": "These locs give you a bold, tough look. Viking locs, which are similar to Viking braids , are thin to mid-width locs that are pulled back into a ponytail or braid. They are called Viking locs because the look is thought to have been worn by Celts and Vikings, who had hair that looked like roped braids. [16] X Research source"
    },
    {
      "title": "Bring some texture to your hair with spiked locs.",
      "content": "Bring some texture to your hair with spiked locs. This look is especially good if you are trying to develop your locs and skip the “awkward stage.” Rock an afro with protruding locs to achieve this look. To maintain the look, take regular trips to your barber and loctician from trims and retwists. Since your locs are likely in their starter phase with this cut, retwist them every four weeks. [17] X Research source"
    },
    {
      "title": "Swoop your style to the side with these long locs.",
      "content": "Swoop your style to the side with these long locs. Side-swept locs leave room on one side of the head by moving the locs to the other side and covering it. These locs will last the standard four to six weeks as long as you take care of them, but make sure to keep one side trimmed for a fresh look. This look calls back to the edgy side bang of the 2010s."
    },
    {
      "title": "Wear comb coils if you’re just starting your locs.",
      "content": "Wear comb coils if you’re just starting your locs. When it comes to starting your locs , comb coils are a great way to go since they encourage locs to evenly shape as they mature. To try locs out with short hair, start with comb coils and let them grow into more mature locs. [18] X Research source"
    },
    {
      "title": "Keep your locs out of your hair with a top knot.",
      "content": "Keep your locs out of your hair with a top knot. A top knot arranges the hair on top of the head into a tight knot that stands high. Putting your locs into a top knot also gives them a tall, concise look, as they are tightly wrapped together. When wearing your locs in a top knot, be careful not to put them up too tight, as that can cause tension and lead to breakage. [19] X Research source"
    },
    {
      "title": "For a thick, bubbly look, rock loc knots.",
      "content": "For a thick, bubbly look, rock loc knots. Loc knots involve bending your loc together and wrapping it within itself before wrapping your other locs together to create a thick, bubbly knot. The knot is secured by a small rubber band. For a short look with long locs, rock loc knots. [20] X Research source Spice up your loc knots by holding them together with colored rubber bands, yarn, or beads."
    },
    {
      "title": "This look lifts your locs out of your face while still leaving length.",
      "content": "This look lifts your locs out of your face while still leaving length. Wearing your locs half up gives you the best of both worlds. You have flexibility when it comes to styling the top and you don’t have to worry about the bottom, which you can let flow freely. If you’re having trouble figuring out what to do up top, try Bantu knots, high space buns, or a top knot."
    },
    {
      "title": "For fast, long locs, wear faux locs.",
      "content": "For fast, long locs, wear faux locs. Faux locs involve sewing synthetic hair extensions into your real hair and locking the two together to create fast, instant locs. They are a protective style that reduces tension on your natural hair. They last around 12 weeks and start to look better the longer you wear them. To skip the waiting stage for mature locs or make your hair look longer fast, rock faux locs. [21] X Research source To style faux locs, put metal hair tubes in to spice up the look. Wear your faux locs in a braid or ponytail for a more standard style."
    },
    {
      "title": "This classic style lets you show off your length in a dynamic way.",
      "content": "This classic style lets you show off your length in a dynamic way. The fishtail braid style involves folding your locs in from right to left to create a fishtail. Section the hair off to create multiple fishtails. Feel for tension when you are getting these locs done. If the fishtail is too tight, let your loctician know so your hair doesn’t get damaged."
    },
    {
      "title": "For a cool, sci-fi look, put your hair into space buns.",
      "content": "For a cool, sci-fi look, put your hair into space buns. Putting your hair into space buns involves wrapping your locs into buns on each side of your head, reminiscent of Princess Leia from Star Wars. Put your locs into two big buns if they are long enough. If you have shorter locs, put them into two spiky space buns."
    },
    {
      "title": "For a sharp look that gives equal attention to all parts of the head, get a line-up with your locs.",
      "content": "For a sharp look that gives equal attention to all parts of the head, get a line-up with your locs. The two styles clash in a good way, working together to create sharp edges that look especially clean after a fresh retwist. Been looking for a way to make your locs look more crispy? Pair them with a line-up and you’ll be looking fresh."
    },
    {
      "title": "Add color and vibrance to your locs with beads.",
      "content": "Add color and vibrance to your locs with beads. Whether your locs are short, mid-length, or long, you can add beads to them to make your look a bit more dynamic. Use thick, wooden beads to draw heavy attention to the locks. Use small, thin beads to give more of a subtle vibe. You can even wear one or two gold beads for a subtle, mysterious look."
    },
    {
      "title": "Express your creativity by wrapping accessories around your locs.",
      "content": "Express your creativity by wrapping accessories around your locs. There are a plethora of accessories you can use to spice up your loc look. Wrap blue yarn around one of your locs to add a pop of color. Wrap red and white pieces of yarn around your locs for an edgy look that is low-maintenance and easy to take out. If yarn isn’t your thing, use gold and metallic hair pieces to add a similar shiny flair. To get color in your hair without committing to the dyeing process, wrap it with colored yarn."
    },
    {
      "title": "For a look that draws attention upward, rock locs with a blowout fade.",
      "content": "For a look that draws attention upward, rock locs with a blowout fade. The blowout fade gives the appearance of hair that’s blowing outward, which makes for a smooth transition when paired with locs. The blowout fade works with the locs to create a sharp contrast, making for a clean, desirable look. Put your locs into a loose ponytail to accentuate the blowout fade."
    },
    {
      "title": "Rock a front taper to bring your hairline out.",
      "content": "Rock a front taper to bring your hairline out. Locs styles often draw attention to the locs, but a front taper helps balance the attention between your locs and your hairline. Since the front taper is cut low, it gets rid of the bulky look that happens around the hairline as your locs grow out. This creates a great contrast that makes your edges look sharp and crispy, giving you the best of both worlds."
    },
    {
      "title": "To show off your forehead and get your locs out of your face, comb them back.",
      "content": "To show off your forehead and get your locs out of your face, comb them back. Combed back locs are an easy way to switch up your look. Put your combed back locs in a ponytail to keep them in place or leave them out so they can flow freely. Get an edge up to make your forehead and sides crispy and help them pop out more."
    },
    {
      "title": "For a protective, low-maintenance style, rock this look.",
      "content": "For a protective, low-maintenance style, rock this look. Doing box braids over locs involves taking your locs and braiding them into smooth, uniform sections with box-shaped bases. This look adds an extra layer of texture to your locs, making this style great if you want something that’s dynamic. [22] X Research source"
    },
    {
      "title": "Marley twists are a great way to get thick locs fast.",
      "content": "Marley twists are a great way to get thick locs fast. Marley twists are a protective style that take tension off of your head. To style Marley twists, wrap two strands of your hair around each other. This can be done with natural hair or synthetic extensions, whichever you prefer. They are meant to mimic regular locs and can last for up to two months. Don’t keep your Marley twists in for longer than two months. If you do, you may risk breakage and tension alopecia. Put beads or yarn into your Marley twists to get creative."
    },
    {
      "title": "Keep your locs out of your face and add some flair with a bandana.",
      "content": "Keep your locs out of your face and add some flair with a bandana. A bandana is a great way to spice up your style and keep your locs aimed back. For an edgy look, rock a bandana with a baggy outfit and mid-length locs. For a more relaxed look, wrap your bandana like a headband and wear it on your hairline."
    },
    {
      "title": "Dye your locs multiple colors for a fun, creative look.",
      "content": "Dye your locs multiple colors for a fun, creative look. Dye your locs half black and half white for an alternative, edgy vibe. Dye one strand blue and another one red for a patriotic look. Or dye multiple strands multiple colors to express your fun, eccentric side. Be careful not to dye your hair too much, as constant dying can cause hair damage and breakage. The less frequent you dye your hair, the healthier it will be. [23] X Research source"
    },
    {
      "title": "For a fresh and eye-catching look, try blonde locs.",
      "content": "For a fresh and eye-catching look, try blonde locs. Blonde locs involve bleaching your hair rather than dyeing it, with the result being a golden brown that draws attention to the locs. Blonde locs have been worn by rappers like Young Thug, Lil Uzi Vert, and Playboi Carti, with fans saying that the locs helped contribute to some of their best eras of music. Whether you’re a rapper or just a guy trying to figure out what style of locs works best, blonde locs are a great choice for a look that fosters confidence. Blonde locs look really good with white clothing!"
    },
    {
      "title": "For a subtle look that still draws attention, rock silver locs.",
      "content": "For a subtle look that still draws attention, rock silver locs. Silver locs are elegant and can be worn with any style. They can also make you look more mature, as they resemble gray hair. For a bright, pristine look, rock silver locs."
    },
    {
      "title": "For a bright, off-the-wall look, dye your locs crimson.",
      "content": "For a bright, off-the-wall look, dye your locs crimson. Crimson locs have been associated with the punk, edgy aesthetic, especially since rapper Playboi Carti rocked them during the rollout of his album, “Whole Lotta Red.” To spice up your aesthetic and make it more edgy, dye your locs crimson. [24] X Research source"
    },
    {
      "title": "Ombre locs are a youthful look with light color.",
      "content": "Ombre locs are a youthful look with light color. Dye the tips of your locs ombre to give a hint of color and create a contrast with the natural color of your locs. To fully switch your look up, dye certain sections of your hair ombre, or dye all of your locs ombre. The color in your locs will get lower as your natural hair continues to grow. Avoid dying your locs if you’ve had another color in the last six to eight weeks. [25] X Research source"
    },
    {
      "title": "Purple locs express your youth and excitement.",
      "content": "Purple locs express your youth and excitement. These colored locs are vibrant and have been popular since 2016, when rapper Lil Uzi Vert wore them during their rise to fame. Purple locs can be worn in any style, but they are mostly worn short and mid-length. They draw attention to the hair with their strong color. [26] X Research source"
    },
    {
      "title": "For a pure, eye-catching look, rock white locs.",
      "content": "For a pure, eye-catching look, rock white locs. To achieve white locs, you have to bleach your hair. A loctician is the best option to go with for a professional bleaching. If you want to do it at home , rub bleach evenly into each dread. Let the bleach sit for 30 minutes then rinse it with cool water before washing it with a clarifying shampoo. The bleach will make your locs lighter, so repeat the process until they are white. [27] X Research source Be careful when bleaching your locs. Bleaching them too often can result in hair damage and breakage. [28] X Research source"
    },
    {
      "title": "If you want crisp sides and a dynamic top, this style is for you.",
      "content": "If you want crisp sides and a dynamic top, this style is for you. The short locs add some texture to the top and serve as bangs if you’ve got some length. The fade and shaved line add a fun, playful look with a little bit of edge. Rock this look to bring out your eccentric, creative side. Put long locks into a ponytail that flows back to bring more attention to the fade."
    },
    {
      "title": "Keep your locs out of your face with a man bun.",
      "content": "Keep your locs out of your face with a man bun. The way you rock this look depends on the length of your locs. For shorter locs, put them in a man bun that lets the locs hang over the back of your head. For longer locs, wrap them into a large bun that sits at the top of the head. Make this look even more masculine with a beard."
    },
    {
      "title": "The short sides let your locs flourish up top.",
      "content": "The short sides let your locs flourish up top. To style mohawk locs, rock a fade on the sides and lengthy locs on top. Depending on the type of fade you get, the sides can blend into the locs to create a smooth, accentuating look or fade from the skin into the temple for a dramatic, edgy look. Direct your mohawk locs to the front for on-demand bangs. Pull them back into a braid for a look that calls back to the Viking braid."
    },
    {
      "title": "Micro locs are a delicate, precise style.",
      "content": "Micro locs are a delicate, precise style. They are about the width of a shoelace and can result in hundreds of locs. Since they house more locs than other loc styles, you have a ton of styling opportunities. To get micro locs, tightly twist small sections of your hair into similar coils. Put your micro locs in four low ponytails for a dynamic, playful look. Put them in a tall ponytail to give the illusion of height. [29] X Research source"
    },
    {
      "title": "This creative, circular look embraces culture.",
      "content": "This creative, circular look embraces culture. Bantu knots originate from the Southwestern African Zulu tribes and have been around for over 100 years. Styling Bantu locs involves sectioning your hair off into different parts, then wrapping your locs around the base of those parts to form a spiral knot. Fully wrap your locs around to create a huge Bantu knot, or partially wrap them for a half-up, half-down look. [30] X Research source"
    }
  ]
}