{
  "url": "https://www.wikihow.com/Increase-Platelet-Count-in-Dogs",
  "title": "How to Increase Platelet Count in Dogs (+Common Signs)",
  "steps": [
    {
      "title": "Watch for sudden, unexplained bruising.",
      "content": "Watch for sudden, unexplained bruising. Bruises happen when you bleed under your skin. Since a dog with low platelets has blood that doesn't clot correctly, bruises can occur due to your pet's normal activities, like playing or going for a walk. [1] X Research source Keep in mind that a single bruise doesn't mean your dog is sick. Your dog may also develop small spots on their gums if they have a low platelet count."
    },
    {
      "title": "Notice if your dog seems lethargic.",
      "content": "Notice if your dog seems lethargic. You may notice the dog lying around a lot, and it might not be as interested in play. Additionally, it may resist going for a walk or playing with its favorite toys. If your dog seems generally tired and uninterested, it likely needs a vet check. [2] X Research source There are many different causes for lethargy in dogs, so don't assume your dog has a low platelet count."
    },
    {
      "title": "Check your dog's nose for excessive mucus.",
      "content": "Check your dog's nose for excessive mucus. Its nose may feel extra wet and sticky, or you may see the mucus dripping down its nose. Also, your dog may wipe its mucus on its fur or around your home, so be on the lookout for mucus streaks. [3] X Research source Like with the other symptoms of low platelet counts, mucus streaks have other causes, as well."
    },
    {
      "title": "Watch your dog for excessive coughing.",
      "content": "Watch your dog for excessive coughing. Excessive mucus may lead to coughing, which won't go away easily. Your dog's cough may sound like a hacking cough or might produce phlegm. [4] X Research source If your dog is coughing, you need to take it to the vet to find out why, regardless of the cause."
    },
    {
      "title": "Notice if your dog has dark, tar-like stools.",
      "content": "Notice if your dog has dark, tar-like stools. This happens from blood in the gastrointestinal (GI) tract. If your dog's blood isn't clotting right, then it may have bleeding in its digestive system, which will result in very black feces. [5] X Research source You might be very scared when you see your dog's poop change colors like this, but there's no need to panic. Your vet can find out what's causing your dog's symptoms and then treat them."
    },
    {
      "title": "Ask your vet to check your dog for a fever or heart murmur.",
      "content": "Ask your vet to check your dog for a fever or heart murmur. Don't try to take your dog's temperature or pulse yourself. It's very easy to make a mistake when you aren't trained. Instead, ask your vet to evaluate your dog to see if it has these symptoms. [6] X Research source It's not safe to take your dog's temperature at home, as the dog might move and get injured. Furthermore, feeling the dog's nose or ears is not a reliable way to take its temperature."
    },
    {
      "title": "See your vet immediately if your dog collapses or has urinary bleeding.",
      "content": "See your vet immediately if your dog collapses or has urinary bleeding. Both of these serious symptoms require immediate vet care. However, your vet may still be able to help your dog recover if you get it treated in time. [7] X Research source If it's after your vet's normal office hours, search online to find out if there's a 24-hour emergency vet service in your area."
    },
    {
      "title": "Allow your vet to do diagnostic tests to determine the cause.",
      "content": "Allow your vet to do diagnostic tests to determine the cause. Low platelet counts in dogs can be caused by several conditions, many of them serious. Common causes include excessive bleeding, impaired bone marrow function, infections, immune system disorders, and certain cancers, like leukemia and lymphoma. The best treatment for your dog's condition will depend on the cause. To get the right diagnosis, your vet may do the following tests: [8] X Research source A blood test will determine if your dog's platelet counts are low. It will also help the vet check for an infection or figure out if the dog's immune system is attacking its own platelets. An X-ray can show if your dog has internal injuries, which may cause low platelet counts. An ultrasound can also check your dog for internal injuries and tumors. A bone marrow sample can help your doctor rule out cancer and bone marrow exhaustion, though they may not need to do this test."
    },
    {
      "title": "Ask your vet about medications to increase your dog's platelet levels.",
      "content": "Ask your vet about medications to increase your dog's platelet levels. Your vet may prescribe several different medications, depending on what is causing your dog's low platelets. Since having a low platelet count is a secondary condition, there's no standard treatment for it. However, your vet may be able to give your dog a medication that will quickly boost its platelets, though the effects will wear off over time. [9] X Research source For instance, they may be able to give your dog romiplostim, which increases platelet levels. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Even a temporary boost to your dog's platelet count can make a big difference because it will help the dog's blood clot if an injury occurs, which might save your dog's life. One of the most common causes of low platelets in dogs is an autoimmune disease, which causes the body to attack its own platelets. Treatment for autoimmune disease includes high doses of steroids, which can shut down inappropriate immune responses. If your dog has an autoimmune disorder and doesn't respond well to steroid treatment, your vet may recommend supplementing the steroids with chemotherapy."
    },
    {
      "title": "Allow a blood transfusion to balance your dog's platelet levels if necessary.",
      "content": "Allow a blood transfusion to balance your dog's platelet levels if necessary. Your dog could receive a blood transfusion if its low platelet count is caused or worsened by anemia. The vet may also give your dog a blood transfusion to treat low platelets caused by another condition if they think it will help your dog recover faster. The platelets in the blood transfusion will raise your dog's platelet count, which will improve its condition. [11] X Research source Your vet will most likely do the transfusion in their office. Since low platelet counts usually result from a serious medical condition, your vet will likely keep your dog overnight, at a minimum. In rare cases, the vet will need to replace all of the blood in your dog's body via transfusion. This can correct anemia, as well as raise the dog's platelet counts. In some cases, transfusion may only produce a temporary improvement, as the underlying cause of your pet's condition may destroy the healthy platelets."
    },
    {
      "title": "Follow your vet's treatment plan for the underlying condition.",
      "content": "Follow your vet's treatment plan for the underlying condition. This will likely involve giving your pet medication for 3-4 months, in some cases longer. However, most dogs can recover from low platelet counts if they complete their round of treatment. [12] X Research source For example, your dog may be placed on immunosuppressive therapy if its immune system is attacking its platelets. Similarly, it may receive cancer treatments if the vet diagnoses leukemia or lymphoma. The type of treatment your dog will need depends on the cause of its low platelet count."
    },
    {
      "title": "Switch your dog to nutritious soft food, which is easier on its gums.",
      "content": "Switch your dog to nutritious soft food, which is easier on its gums. Since the gums are soft, it's easy to scrape them and make them bleed. Unfortunately, this can be a serious injury for a pup with low platelets. Until the vet tells you your dog is in the clear, stick to a well-balanced soft dog food. [13] X Research source"
    },
    {
      "title": "Reduce your dog's activity level to help it recover.",
      "content": "Reduce your dog's activity level to help it recover. Your dog needs to rest until it starts to feel better. Additionally, a lower activity level helps protect your dog from accidental injury. Since even a slight bump can cause bruising, it's hazardous for your dog to be too active. [14] X Research source Encourage your dog to lay on a soft blanket or pet bed while it recovers. Talk to your vet before returning your dog to its normal activity level."
    },
    {
      "title": "Remove any items from your dog's environment that could cause injury.",
      "content": "Remove any items from your dog's environment that could cause injury. It's important that your dog not get injured while its platelet counts are low, as its blood won't clot well. Unfortunately, even a small bump or scrape can become life threatening to a dog with low platelets. To protect your dog, go through your home to make sure you don't have any potential hazards. [15] X Research source For example, don't leave items lying on the floor, make sure items on shelves are secure, and check that doors and cabinets are fully open or shut. Also, it may help to put padding on sharp furniture corners, if you have any."
    },
    {
      "title": "Supervise your dog closely while on walks or around other animals.",
      "content": "Supervise your dog closely while on walks or around other animals. Your dog is most vulnerable when it's outside or around other animals. That's because it's easy to come across something on a walk that could injure your dog, like a stray branch or a hole in the ground. Similarly, it's impossible to predict how animals will act. Be very careful while your dog is in recovery. [16] X Research source If you can, keep your dog away from other animals, and try to walk it in an area you know well."
    }
  ]
}