{
  "url": "https://www.wikihow.com/I-Accidentally-Vacuumed-Mouse-Droppings",
  "title": "A Guide on What to Do If You Accidentally Vacuum Mouse Droppings",
  "steps": [
    {
      "title": "Vacuuming or sweeping mouse droppings can spread airborne viruses.",
      "content": "Vacuuming or sweeping mouse droppings can spread airborne viruses. Some mice carry hantavirus, which is a virus that can infect humans. When you vacuum, sweep, or stir up mouse droppings, the virus particles are released into the air. If you breathe in the air, you can get infected with the virus and develop Hantavirus Pulmonary Syndrome (HPS). [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source HPS is a rare but severe respiratory illness that can be fatal. Since tracking started in 1993, only 850 cases have been reported in the US. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source In the United States, only deer mice, white-footed mice, cotton rats, and rice rats are known to carry hantavirus. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source HPS and most hantaviruses aren’t spread from person to person. Only the Andes virus, which is found in South America, is transmitted person to person. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also contract hantavirus by: Breathing in urine and nesting materials. Being bitten by an infected mouse. Touching your mouth, eyes, or nose after handling droppings, urine, or nesting materials. Mice can also carry diseases like Salmonella, Leptospirosis, and Hemorrhagic fever with renal syndrome (HFRS). Breathing infected waste, touching your nose, mouth, or eyes with contaminated hands, or eating contaminated foods can cause these illnesses. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Put on gloves, an N95 mask, and disassemble your vacuum.",
      "content": "Put on gloves, an N95 mask, and disassemble your vacuum. To protect yourself from inhaling or touching infected waste in your vacuum, wear rubber gloves and an N95 mask . [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Then, take apart your vacuum to separate out the filter, canister or bag, hose, and any other attachments. Using your vacuum without cleaning it may release virus or bacteria particles into the air if the mouse droppings are infected. If you’re not sure how to take apart your vacuum or find the filter and other parts, consult the user’s manual for your vacuum."
    },
    {
      "title": "Disinfect the vacuum’s filter and canister with dish soap and water.",
      "content": "Disinfect the vacuum’s filter and canister with dish soap and water. Fill your sink with warm water and several drops of dish soap. Then, place the filter inside and scrub it with a toothbrush. Then, empty the vacuum canister’s contents in a plastic bag and wash it in the warm water and dish soap. [7] X Research source Let the filter and canister air dry for at least 24 hours before reassembling them. If your vacuum has a bag instead of a canister, simply remove the bag, throw it away, and replace it with a new bag. If your vacuum filter isn’t washable, simply wipe it off with a dry cloth."
    },
    {
      "title": "Clean the beater bar and any other vacuum parts with soapy water.",
      "content": "Clean the beater bar and any other vacuum parts with soapy water. Look for any hair or debris trapped around your vacuum’s beater bar, or the cylindrical brush at the bottom. If there’s any hair, simply cut it off with scissors and throw it in the trash. Then, scrub the vacuum hoses and any other attachments with the warm water and dish soap mixture you made in your sink. [8] X Research source Leave the hose and attachments to air dry for at least 24 hours. If your vacuum’s beater bar is removable, wash it with warm, soapy water as well."
    },
    {
      "title": "Call your doctor if you have flu-like symptoms or trouble breathing.",
      "content": "Call your doctor if you have flu-like symptoms or trouble breathing. It can take 1 to 8 weeks for Hantavirus Pulmonary Syndrome (HPS) to infect your system. If you develop a fever, muscle aches, chills, fatigue, headache, vomiting, or diarrhea after vacuuming up mouse droppings, call your doctor immediately. Tell them that you were recently exposed to rodents so they can determine if you have HPS and treat you accordingly. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source As the HPS infection progresses, you might experience coughing, shortness of breath, and a rapid heartbeat. There are no specific cures or treatments for HPS. In severe cases, patients are given oxygen therapy or placed on a ventilator to support their treatment."
    },
    {
      "title": "Ventilate the area for 30 minutes and wear gloves and an N95 mask.",
      "content": "Ventilate the area for 30 minutes and wear gloves and an N95 mask. Open up any doors or windows in the room where you see mouse droppings to air out the area and reduce the risk of infection. Then, protect yourself from touching or breathing in the droppings by putting on rubber gloves and an N95 mask . [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Treat all mice droppings as if they carry hantavirus. Even though most mice don’t carry it, you can’t tell if a mouse has the virus by looking at it. Most mouse droppings are dark brown or black, cylindrical, pointed at the ends, and about the size of a grain of rice. [11] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source"
    },
    {
      "title": "Spray the droppings with a bleach and water solution until they’re wet.",
      "content": "Spray the droppings with a bleach and water solution until they’re wet. To kill any potential viruses on the mouse droppings, mix 1 ½ cups (355 ml) of bleach into 1 gallon (3.8 l) of water. Pour the solution into a spray bottle and then spray the droppings with the mixture until they are wet and soaked through. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source To make a smaller bleach solution, mix 1 part bleach with 9 parts water. Or, use a commercial disinfecting spray that lists “Disinfectant” on the label. For droppings on carpet : Spray the droppings with a carpet or upholstery-safe disinfectant . Spray any dead mice, urine, or nesting materials with the bleach, too."
    },
    {
      "title": "Soak the droppings for 5 minutes, then wipe them with a paper towel.",
      "content": "Soak the droppings for 5 minutes, then wipe them with a paper towel. Let the bleach solution soak into the droppings and disinfect any viruses for 5 minutes. Then, use a paper towel to scoop and wipe up the droppings. [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Place the paper towels in a sealed bag and throw it in the trash.",
      "content": "Place the paper towels in a sealed bag and throw it in the trash. Dispose of your dirty paper towels by sealing them inside a plastic bag or trash bag. Then, knot the bag and throw it away in a covered and sealed garbage can. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Disinfect the entire area with the bleach solution.",
      "content": "Disinfect the entire area with the bleach solution. Spray the floor, counter, or cupboard where you found the mouse droppings with your bleach and water mixture. Then, mop the area or wipe up the bleach with paper towels or a sponge. This ensures that no viruses or bacteria are left behind. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source For droppings on carpet : Steam clean the carpet , rug, or upholstery. Or, shampoo your carpet with a shampooer and carpet shampoo . [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Wash your gloves and then your hands with warm water and soap.",
      "content": "Wash your gloves and then your hands with warm water and soap. Before you take off your gloves, clean them off with warm water and hand soap. Then, take off the gloves and wash your hands in warm water and soap for at least 20 seconds. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Set traps or call an exterminator if you see droppings after cleaning.",
      "content": "Set traps or call an exterminator if you see droppings after cleaning. If you continue to see mouse droppings in your home, you might have an infestation. To get rid of mice , bait humane traps or lethal traps with peanut butter and set them where you see droppings. Or, call a local mouse exterminator to get rid of the mice for you. [18] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Then, keep mice out of your house by: Sealing up holes or cracks with spackling paste or caulk . Repairing leaky pipes or faucets. Cleaning up crumbs and spills. Storing food, pet food, birdseed, and trash in sealed containers."
    },
    {
      "title": "Put on rubber gloves and an N95 mask.",
      "content": "Put on rubber gloves and an N95 mask. When you see mouse droppings or urine on your clothes or bedding, protect yourself from any potential infection. Just put on a pair of rubber gloves and wear an N95 mask . [19] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Spray the droppings with fabric disinfectant and leave it for 5 minutes.",
      "content": "Spray the droppings with fabric disinfectant and leave it for 5 minutes. To fully disinfect the mouse droppings before you pick them up and throw them away, spray them with a fabric disinfecting spray . Just spray them until they are fully wet with the disinfectant. Then, leave the droppings for 5 minutes. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Remove the droppings with paper towels and throw them in the trash.",
      "content": "Remove the droppings with paper towels and throw them in the trash. Take a paper towel and pick up the disinfected mouse droppings. Then, dispose of the paper towels in a plastic bag and throw the bag away in the trash can. [21] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Wash all the affected clothing on your laundry machine’s hottest cycle.",
      "content": "Wash all the affected clothing on your laundry machine’s hottest cycle. Place the clothing or bedding that had the mouse droppings on it, as well as any clothing near it, in your washing machine. Add laundry detergent and then start your machine’s hottest water cycle. [22] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If there are any dropping stains on your clothing or bedding, treat them with a stain remover. If your clothing can’t get wet, get them dry-cleaned."
    },
    {
      "title": "Wash your gloves and then your hands with soap and water.",
      "content": "Wash your gloves and then your hands with soap and water. After you put your clothes in the washer, disinfect your gloves by washing them under warm water with hand soap. Then, take off your gloves and wash your bare hands, too. [23] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Dry your clothes on high heat or hang them up in the sun.",
      "content": "Dry your clothes on high heat or hang them up in the sun. Place your wet clothes in the dryer as soon as they’re done in the washer and dry them on high heat. [24] X Research source If your clothing isn’t safe for the dryer, hang them up on a clothesline or drying rack set in the sun. Sunlight can kill any remaining bacteria while the fresh air removes odors."
    },
    {
      "title": "Mouse droppings can stay infected with hantavirus for several days.",
      "content": "Mouse droppings can stay infected with hantavirus for several days. Old mouse droppings can be just as hazardous as fresh ones. Hantavirus prefers dark and cold conditions, so it can last for several days in a cool, shady spot. If the droppings are in direct sunlight, the virus may only last for several hours. [25] X Research source Always wear gloves and a mask when cleaning and disposing of any mouse droppings you find. You can’t tell if droppings are infected just by looking at them."
    }
  ]
}