{
  "url": "https://www.wikihow.com/Grow-Long-Hair-As-a-Guy",
  "title": "How to Grow Long Hair As a Guy",
  "steps": [
    {
      "title": "Give yourself a hot oil massage.",
      "content": "Give yourself a hot oil massage. Growing hair starts from the roots - which means that taking care of your scalp and the roots of your hair can stimulate growth. Oil, which conditions hair, warmed and massaged onto your scalp will help to prompt hair growth. Heat up a bit of olive, coconut, or argon oil until warm to the touch. Gently rub this into your scalp for 5-10 minutes, and allow the oil to soak into your hair for an additional 30 minutes. Rinse out the oil with warm water when you’re finished. [1] X Research source www.loveglampeonies.blogspot.com/2013/02/how-to-grow-long-hair-fast-1-inch-month.html"
    },
    {
      "title": "Try an apple cider vinegar rinse.",
      "content": "Try an apple cider vinegar rinse. Apple cider vinegar is one of those ‘jack of all trades’ products; it works wonders on hair, skin, and many health ailments. Among its many abilities is the power to help stimulate hair growth. Mix three parts apple cider vinegar with one part water, and put it in a spray bottle. Every time you shower, spritz your hair with the vinegar mixture post-shampoo. Wait 1-2 minutes, and then rinse it out. You should notice a change in growth rate after several weeks of use."
    },
    {
      "title": "Use a deep conditioner.",
      "content": "Use a deep conditioner. Damaged hair doesn’t grow as well as healthy hair; using a deep conditioner to repair your hair follicles will increase hair growth over time. Choose a deep conditioner for your hair type (available at most drug stores and hair salons), and follow the box directions for application. Normally, the conditioner is left in your hair for 20-30 minutes prior to being rinsed out with cold water."
    },
    {
      "title": "Make an egg white and aloe mask.",
      "content": "Make an egg white and aloe mask. Egg whites and aloe vera have been used in hair for centuries. They add moisture to hair, giving it a healthier appearance, and also help to stimulate hair growth. Mix an egg white with fresh aloe vera (or 100% bottled aloe) and cover your hair and scalp in the mixture. Let the mask set for 15-20 minutes, and then rinse it out with cool water. Allow your hair to air-dry when finished."
    },
    {
      "title": "Try an onion rinse.",
      "content": "Try an onion rinse. Boil a cut onion in water for 10-15 minutes to form an onion broth. Allow this to cool, and then coat your head and scalp in it. The onion provides nutrients that help with hair growth while adding shine to the strands. Rinse it out with cold water, and allow your hair to air dry. And don’t worry - the onion won’t leave a smell in your hair as long as you rinse it all out. [2] X Research source"
    },
    {
      "title": "Know when to brush your hair.",
      "content": "Know when to brush your hair. Brushing your hair is good for increasing hair growth, because it stimulates the scalp and spreads the natural oils throughout the shaft of each strand of hair. However, there are do’s and don’t’s when it comes to brushing your hair. Aim to brush your hair 1-2 times a day (when you wake up and at night, for example). However, be cautious of brushing your hair too much, as this can pull out hair that you’re trying to grow. Additionally, never brush your hair when it’s wet, because it is most fragile and easy to break in this state."
    },
    {
      "title": "Avoid hot tools and chemicals.",
      "content": "Avoid hot tools and chemicals. Although it is typically more of an issue for women than men, using hot tools (like blow dryers and flat irons) and chemicals (such as hair dyes and relaxers) will significantly damage your hair. Not only will it make your hair appear frizzy and dull, it will cause your hair to take longer to grow. When at all possible, allow your hair to air-dry and avoid styling it with any tools."
    },
    {
      "title": "Change your shower routine.",
      "content": "Change your shower routine. Although it may not make your hair look the greatest, the natural oil your scalp produces are imperative for improving hair health and speeding the rate of growth. Washing your hair every day removes these oils, slowing your growth rate. Wash your hair as few times a week as you’re able, spacing washings to be at least every-other day."
    },
    {
      "title": "Take supplements for hair growth.",
      "content": "Take supplements for hair growth. There are certain vitamins and supplements on the market which help increase hair growth. Taken regularly, you should notice an increase in growth each month. Look for Biotin, folic acid, vitamin E and fish oil, all of which increase hair and nail health and growth. [3] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2020. You should also make sure that you’re caught up with all your regular vitamins and minerals, taking a multivitamin as a supplement if necessary. [4] X Research source"
    },
    {
      "title": "Use the right shampoo.",
      "content": "Use the right shampoo. There are dozens of hair shampoos on the market, each tailored for a different hair type or ultimate style. However, the one consistent ingredient that you should avoid in shampoo is silicone. Although it is advertised as beneficial, silicone will block out moisture and nutrients, hindering hair growth. Look for hair products (shampoo or otherwise) which use natural ingredients and are silicone-free. In addition, you should only shampoo once every 2 to 3 days. This allows the natural oils in your scalp to moisturize and protect your hair, which will keep it healthy. [5] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2020."
    },
    {
      "title": "Use the right conditioner.",
      "content": "Use the right conditioner. As said, silicone blocks out moisture and nutrients, so look for a conditioner with natural ingredients. Another option is just to use a leave in conditioner (don't rinse leave in conditioners off)."
    },
    {
      "title": "Wash your hair with cold water.",
      "content": "Wash your hair with cold water. Hot showers may be the most comfortable, but the heat from the water opens the hair shaft of each strand of hair, letting out valuable moisture, making your hair more brittle and prone to damage. When you wash your hair, use the coldest water you can stand. The cool temperature will close the hair shaft and help to trap in the moisture that you would otherwise let out. [6] X Research source"
    },
    {
      "title": "Maintain good health.",
      "content": "Maintain good health. [7] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2020. There’s a reason people remark on ‘losing hair’ when they’re stressed; stress, poor diet, and lack of exercise can all lead to hair thinning and slowing the growth of hair. Make necessary lifestyle changes to promote good eating and exercise habits, and cut out stress whenever possible."
    },
    {
      "title": "Keep hydrated.",
      "content": "Keep hydrated. [8] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2020. Water is important for good health in general, but drinking lots of water can help provide your scalp and hair follicles with necessary moisture for increasing growth. Drink 8-10 glasses of water throughout the course of the day to supply your body with adequate moisture."
    },
    {
      "title": "Know when to cut your hair.",
      "content": "Know when to cut your hair. There tend to be two major parties when it comes to hair growth: those who promote regular trims, and those who vow against any hair cutting at all. While they seem to be opposing views, both are right. The reason you trim hair is to either remove length or to remove damage. Since you’re trying to grow your hair out, you don’t want to trim your hair for the former reason. Instead, hair should be trimmed semi-regularly to cut off damaged ends. This doesn't promote hair growth, but it promotes hair health; long hair that is frizzy and brittle won't look good. Therefore, aim to cut your hair between 1-3 times a year to keep it looking good. When your hair is in that awkward mid-length phase, find ways to style it properly until it grows out more."
    },
    {
      "title": "Use satin pillowcases.",
      "content": "Use satin pillowcases. This might sound strange, but the fabric from most pillowcases (cotton or other low thread-count cases) causes your hair to fall out. The reason being that the “rough” fabric causes friction with your hair, pulling out strands as you sleep. In order to avoid this, swap out your regular pillowcases for satin pillowcases, which are smooth enough to let your hair slide without tugging. [9] X Research source"
    }
  ]
}