{
  "url": "https://www.wikihow.com/Make-Yourself-Feel-Better",
  "title": "How to Make Yourself Feel Better",
  "steps": [
    {
      "title": "Take a few minutes to breathe deeply.",
      "content": "Take a few minutes to breathe deeply. The simple action of taking full, deep breaths can help you start to feel better. [1] X Expert Source Guy Reichard Life Coach Expert Interview. 19 March 2020. Deep breathing increases oxygen supply throughout the body, which can help to relax muscles and reduce your blood pressure when you’re upset or stressed. Deep breathing also helps activate your parasympathetic nervous system, which produces a calming effect. The very act of focusing on your breathing rather than the stressful situation at hand can begin helping you feel better. Those who practice deep breathing for twenty to thirty minutes each day experience reduced levels of stress and anxiety."
    },
    {
      "title": "Start journaling.",
      "content": "Start journaling. Writing down your emotions provides an emotional outlet, as well as a way to cognitively process the circumstances behind how you are feeling. This adds an additional component of clarity to aid in decreasing emotional pain. In fact, studies have shown that writing offers benefits of emotional well-being, including relief of emotional distress. Additionally, journaling has been shown to benefit the immune system. [2] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source If you are dealing with emotional pain that you do not feel comfortable sharing, writing or journaling about your experiences offers you an outlet without the added stress of being vulnerable with a friend or family member who may not understand."
    },
    {
      "title": "Go ahead and cry if you need to.",
      "content": "Go ahead and cry if you need to. Emotional tears signal the body to release endorphins or “feel-good” hormones to promote a feeling of calm and well-being. [3] X Research source Not only does crying allow your body to release stress hormones, but at the end of a good cry, the body assumes a calmer state with a lower heart and breathing rate. [4] X Research source Engage in beneficial crying. This is crying that allows you to release stress and bottled up emotions and does not interfere with your daily functioning. If you seem to have no control over when or how often you cry or if your crying is interfering with your work or home life, this may be an indication of a larger problem, such as depression or an anxiety-related condition. Consider seeing a counselor or therapist who can teach you techniques to control crying that’s interfering with your daily functioning."
    },
    {
      "title": "Turn to a creative hobby.",
      "content": "Turn to a creative hobby. Creative expression has a long history and connection to emotion within many different cultures where music, dance, and stories have been used to express emotions to promote healing. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Whether as an appreciator or creator, try turning to your favorite hobby to help channel your negative or painful emotions into something creative. For example, research has shown that music is linked to decreased anxiety by decreasing neural activity in the amygdala, which produces a calming effect. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Additionally, music was shown to produce feelings of greater control over one’s life, as well as decreased pain in persons with chronic illness. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Visual arts—such as drawing, painting, making collages or cards, or textile work—have been shown to offer an opportunity to make meaning of emotional pain, as well as increase feelings of self-worth. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Movement-based expression—such as dancing or acting—has been shown to increase self-awareness and improve body image, problem solving capacity, and self-esteem. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Rely on your support system.",
      "content": "Rely on your support system. Numerous studies have shown the benefits of having a close support system of family and friends to whom you can turn. Social support leads to a sense of belonging and security rather than loneliness while dealing with emotional pain, and it’s also been linked to an increased sense of self-worth. Try calling a trusted friend or sitting down with a family member to vent your hurt and frustrated emotions."
    },
    {
      "title": "Reward yourself.",
      "content": "Reward yourself. Times of emotional turmoil are also a great time to treat yourself to something special. This can be anything in which you take enjoyment. You can get a massage, go to an amusement park, buy some new shoes, prepare your favorite dessert, go see a movie, or anything else you love doing. Take some time for yourself and treat yourself. Remember to do so responsibly. You don’t want to spend too much on a reward for yourself and lead to more emotional negativity later for budgeting poorly."
    },
    {
      "title": "Take a break to laugh.",
      "content": "Take a break to laugh. Laughter does everything from aiding muscle relaxation to helping alleviate your body’s stress response. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Laughter has also been shown to help elevate your mood in moments of anxiety or depression. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Take some time to laugh by remembering a funny situation, calling your funniest friend, or simply finding a funny video to watch on the internet. Take advantage of whatever is at your disposal in the moment to take a break and laugh."
    },
    {
      "title": "Give yourself a timeout.",
      "content": "Give yourself a timeout. A five-minute walk or a chance to get up and stretch can help you release painful emotional energy. Even if you’re not a big yoga practitioner, even basic stretching can help promote positive emotions. Stretching practices have been shown to help with releasing negative energy related to stress, anxiety, depression, and more. [12] X Research source"
    },
    {
      "title": "Avoid turning to drugs or alcohol.",
      "content": "Avoid turning to drugs or alcohol. While drugs and alcohol may temporarily have a calming affect when you feel stressed or painful emotions, experts agree that the short-term release is not even remotely worth the associated risks. Exposure to stress and other traumatic emotions is one of the leading risk factors in the development of substance abuse problems. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source While all of the other steps in this wikiHow provide tools to help you overcome negative feelings, drugs and alcohol simply create a vicious cycle of dependence on the substance to feel better, which can quickly lead to addiction. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Consult with a professional substance abuse counselor if you find yourself consistently turning to drugs and/or alcohol as a release from your painful emotions."
    },
    {
      "title": "Distract your thinking if you ruminate.",
      "content": "Distract your thinking if you ruminate. Rumination is the process of replaying painful or disappointing events in your head in a cycle that makes it difficult to counteract. Rumination cycles are often unproductive and negative in that they do not help to solve problems or move forward. [15] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Rumination takes your focus off problem solving. Consciously distracting your thinking to stop the cycle of rumination is one of the most common methods of avoiding it. Research has also shown that those who ruminate and talk about their situations over and over often drive away friends and family who could have acted as a social support. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Mindfulness is the most common way of distracting yourself from ruminating. It involves turning your attention to your immediate surroundings, the sounds around you, or the sensations in your body. [17] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Work on reframing your experiences.",
      "content": "Work on reframing your experiences. Negative experiences can often become echo chambers of feelings of fault or guilt. Reframing your experiences means looking at them from a different light. [18] X Research source By reframing your thoughts, you can strengthen your senses of problem solving and confidence. [19] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For instance, to reframe a poor mood after a hurtful situation, you can think about what you have learned about yourself and your relationship. As another example, if you are dealing with the uncomfortableness of embarrassment, you can try to find the humor in the situation and learn to laugh at yourself to feel better and move on."
    },
    {
      "title": "Look for patterns in what negatively affects you.",
      "content": "Look for patterns in what negatively affects you. If you begin journaling or talking to trusted friends and loved ones regarding what’s affecting you, then look for patterns. Are you consistently writing or talking about the same issues? If so, what can you do to make changes at the root of the problem rather than simply venting the emotional impact of it on a regular basis? [20] X Research source “How Is Emotional Awareness Related to Emotion Regulation Strategies and Self-Reported Negative Affect in the General Population?” Subic-Wrana, Claudia; Beutel, Manfred E.; Brähler, Elmar; Stöbel-Richter, Yve; Knebel, Achim; Lane, Richard D.; Wiltink, Jörg. PLoS ONE. Mar2014, Vol. 9 Issue 3, p1-10. 10p This can also mean taking a stark look at your relationships to determine if a toxic relationship consistently brings you down. Toxic interpersonal relationships can be the chronic source of anxiety, depression, stress, and other negative emotions. [21] X Research source If the consistent source is related to your job, then what changes can you make to your work environment? If you can’t change your work environment to suit your mental well-being, then it may be time to consider a job change."
    },
    {
      "title": "Work on your physical health.",
      "content": "Work on your physical health. Taking regular steps to improve and maintain your physical health also leads to an increased sense of mental well-being. Not only does exercise release endorphins to improve your mood, but it also gives you achievable goals to work toward with regard to your fitness. Joining a gym or a fitness group through another organization—such as your church or at work—also expands your support system."
    },
    {
      "title": "Donate time to a cause about which you’re passionate.",
      "content": "Donate time to a cause about which you’re passionate. Feeling good about your contributions can go a long way to help with your self-worth and self-esteem. Try volunteering at a shelter, helping with a food drive, or finding another cause about which you’re passionate to donate some of your time. [22] X Research source"
    },
    {
      "title": "Remind yourself to maintain perspective.",
      "content": "Remind yourself to maintain perspective. One of the harder and more important aspects of maintaining emotional well-being is to remember that difficult situations that lead to emotional turmoil are a normal part of life, that we learn and grow through these experiences, and that surmounting trouble can be a source of pride. Remember that you can overcome the source of your emotional distress and that how you deal with those emotions and move on without letting them interfere with your daily functioning is the important part. [23] X Research source Roads of Freedom -- An Existential-Phenomenological Approach to a Psychotherapy Journey. By: Gabriel, Guiomar. Existential Analysis: Journal of the Society for Existential Analysis. Jan2013, Vol. 24 Issue 1, p95-105. 11p"
    },
    {
      "title": "Consider consulting a counselor or therapist.",
      "content": "Consider consulting a counselor or therapist. If despite your best efforts to feel better about your experiences you still feel overwhelmed by stress, anxiety, frustration, or depression, then consider making an appointment with a counselor or a therapist. A professional can help you increase your inventory of tools to deal with the situations affecting you. A professional can also recommend medications, support groups, or other resources that you might not otherwise be able to tap into."
    }
  ]
}