{
  "url": "https://www.wikihow.com/Make-a-Beaded-Wire-Tree-Centerpiece",
  "title": "How to Make a Beaded Wire Tree Centerpiece",
  "steps": [
    {
      "title": "Cut 90 pieces of wire that are 18\" (43cm) long.",
      "content": "Cut 90 pieces of wire that are 18\" (43cm) long. Here the wire is wrapped around a book 90 times. Then wire cutters were used to cut all of the pieces at once."
    },
    {
      "title": "Remove one wire from the bundle.",
      "content": "Remove one wire from the bundle. Bend it in half as you smooth out the kinks in the wire, using the cloth. You can smooth the wire with your bare hands but it's easier on your fingers if you use a cloth."
    },
    {
      "title": "Slide a bead onto the wire and center it at the bend.",
      "content": "Slide a bead onto the wire and center it at the bend. Cross the ends of the wire directly below the bead and twist the wires together tightly at least three times to secure the bead."
    },
    {
      "title": "Repeat this step with all the remaining wires.",
      "content": "Repeat this step with all the remaining wires. Varying the number of twists below each bead will make the tree less uniform and more interesting."
    },
    {
      "title": "Take 2 or 3 of the beaded wires and twist them together to make the first branch.",
      "content": "Take 2 or 3 of the beaded wires and twist them together to make the first branch."
    },
    {
      "title": "Add another beaded wire or another small branch to this to begin making the larger tree branches.",
      "content": "Add another beaded wire or another small branch to this to begin making the larger tree branches."
    },
    {
      "title": "Repeat until all 90 beaded wires have been grouped into three large branches.",
      "content": "Repeat until all 90 beaded wires have been grouped into three large branches."
    },
    {
      "title": "Twist the three large branches together to form the trunk.",
      "content": "Twist the three large branches together to form the trunk. Continue twisting the wire, leaving only enough untwisted to form the roots (approximately 3-4 inches/7.5-10cm). You must make at least three complete twists to lock the wire in place."
    },
    {
      "title": "Separate the root wire into three groups.",
      "content": "Separate the root wire into three groups. Twist each group together to begin forming the roots. Continue separating each root into smaller roots until you run out of wire to twist."
    },
    {
      "title": "Use the wire cutters to trim the ends of the roots.",
      "content": "Use the wire cutters to trim the ends of the roots. Bend or straighten the roots as needed so that the tree sits level."
    },
    {
      "title": "Mount your tree.",
      "content": "Mount your tree. The tree can be mounted on a rock, a candle holder or decorative plate, using hot glue. After the tree is securely mounted, separate the branches of your tree. It can now be placed on display or used as a gift."
    }
  ]
}