{
  "url": "https://www.wikihow.com/Make-Clay-from-Indigenous-Soil",
  "title": "How to Make Clay from Indigenous Soil",
  "steps": [
    {
      "title": "Collect some soil.",
      "content": "Collect some soil. You will want to collect your soil from beneath the topsoil. The topsoil is usually two to eight inches (five to twenty centimetres) deep and contains a higher concentration of contaminants. Avoiding this top layer of soil will help eliminate organic debris such as living plants, roots, and insects. The more soil you collect, the more clay you can make."
    },
    {
      "title": "Add soil to a container.",
      "content": "Add soil to a container. The size of the container will depend on how much soil you are using. Fill the container about two-thirds full of soil. Try to avoid using bottlenecked containers, as they may make it harder to pour contents out in later steps. To help eliminate debris you could sift the soil before adding it to the container. However, this is not necessary."
    },
    {
      "title": "Mix water into the soil.",
      "content": "Mix water into the soil. You can use water straight from your tap. Be sure to thoroughly stir the mixture. You should eliminate all clumps and have an even mixture of water and soil."
    },
    {
      "title": "Let the mixture sit.",
      "content": "Let the mixture sit. The clay will separate from the sediment and be suspended in the water. The ‘clay water’ will float on top of the sediment. Be careful not to shake the container or stir the sediment that now rests at the bottom."
    },
    {
      "title": "Pour the clay water into another container.",
      "content": "Pour the clay water into another container. Be careful not to pour any sediment into your new container. Once you see the sediment reach the lip of the original container stop pouring. Once you have poured off the clay water, you can discard the sediment."
    },
    {
      "title": "Repeat this process four to five times.",
      "content": "Repeat this process four to five times. Add water, stir the mixture, let it set, and pour the clay water into another container. Each time you do this, the clay will be purer. Ideally, you will continue the process until you see no sediment at the bottom."
    },
    {
      "title": "Allow the clay to separate from the water.",
      "content": "Allow the clay to separate from the water. Since the clay is just suspended in the water and not highly soluble, it will settle at the bottom if left alone. The clay water will need to sit for at least twenty-four hours. The water and clay will form two separate layers. You will be able to tell when this happens because the water will be clear. If you still see a layer of sediment below the clay repeat the steps to remove the sediment."
    },
    {
      "title": "Pour the water off of the clay.",
      "content": "Pour the water off of the clay. Once you see the clay reach the lip of the container, stop pouring. The clay will be soft and saturated with water. If you pour it out, you will have to start over."
    },
    {
      "title": "Let the clay sit.",
      "content": "Let the clay sit. As the clay settles, even more water will move up and create another top water layer. Pour the clear water off of the clay again. Once the clay reaches the lip of the container, stop pouring. You can repeat this process until the water is no longer forming a substantial layer."
    },
    {
      "title": "Pour the clay into a cloth.",
      "content": "Pour the clay into a cloth. Lay the cloth over a bowl to help guide the runny clay into the cloth. The cloth must be large enough to encompass all of the clay in your container. The cloth will act as a bag for the clay. Tie the cloth with a piece of string as though you are creating a ball of clay inside the cloth. Any cloth will do. You can use an old t-shirt or bedsheet. Be sure to use something that you don’t mind getting dirty. You can split the clay into multiple cloths to speed up the hardening process."
    },
    {
      "title": "Hang the cloth bag.",
      "content": "Hang the cloth bag. This will allow water to drip from the fabric. As the water leaves the clay, the clay will harden. This process can take two or three days Be sure to hang it somewhere where you don’t mind water dripping. You could hang it from a tree or your porch. After a couple of days check the consistency of the clay. Different projects require different consistency. If you need it to be harder, let it hang longer."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}