{
  "url": "https://www.wikihow.com/Make-a-Fruit-and-Yogurt-Smoothie",
  "title": "How to Make a Fruit and Yogurt Smoothie",
  "steps": [
    {
      "title": "Chop the fruit.",
      "content": "Chop the fruit. For this smoothie you need a total of 1 cup of fruit. Slice a banana and chop strawberries so that you have a pile of fruit that adds up to a cup. If you like a strong banana flavor with a hint of strawberries, plan on using more banana; if you prefer a lighter smoothie with a little banana flavor, go heavier on the strawberries instead. You can freeze the strawberries and banana beforehand for an icier smoothie."
    },
    {
      "title": "Choose a sweetener.",
      "content": "Choose a sweetener. Strawberries and bananas may be sweet enough for you by themselves, but some people like a little extra sweetness. You can add a teaspoon of regular sugar or go with honey or agave nectar for a delicious flavor."
    },
    {
      "title": "Decide what type of yogurt to use.",
      "content": "Decide what type of yogurt to use. You need a cup of plain, vanilla-flavored, or other fruity-flavored yogurt, depending on your preference. Get either whole milk or skim milk yogurt. The more fat the yogurt has, the thicker and richer the smoothie will taste."
    },
    {
      "title": "Blend the ingredients.",
      "content": "Blend the ingredients. Place the yogurt, the fruit, and the sweetener in a blender or food processor. Blend the ingredients until they are fully incorporated and no large chunks of fruit remain. Check out the texture of the smoothie. If you want to thin it out, add a few tablespoons of milk and continue blending. You can add some ice cubes to cool the smoothie down and give it an icier texture."
    },
    {
      "title": "Serve the smoothie.",
      "content": "Serve the smoothie. Pour it into a glass so you can see its pretty pink color. Refrigerate if you won't be drinking it immediately."
    },
    {
      "title": "Prepare the berries.",
      "content": "Prepare the berries. This smoothie calls for one cup total of berries. You can use any combination of blueberries, raspberries, blackberries, strawberries, and other types of berries you desire. Pick through the berries and remove those that are bruised or soft. Wash the berries and cut the stems off. [1] X Research source You can use frozen berries in place of fresh berries in this smoothie. When you're considering which berries to use, know that raspberries and blackberries have excellent flavor but may contain a lot of tiny seeds. Try to find blueberries with soft, rather than tough, skins. The tougher skins are more difficult to blend."
    },
    {
      "title": "Mix yogurt and milk.",
      "content": "Mix yogurt and milk. Berry smoothies tend to be really thick and almost gel-like. You can make them more drinkable by mixing yogurt with some milk, rather than using all yogurt. Combine 1/2 cup yogurt with 1/2 cup whole or skim milk, keeping in mind that the more fat the milk and yogurt have, the thicker the texture of the smoothie."
    },
    {
      "title": "Decide on a sweetener.",
      "content": "Decide on a sweetener. To keep this smoothie light, go with a teaspoon of stevia or agave nectar for your sweetener. You can also add a few pieces of a very ripe banana if you want to avoid sugar."
    },
    {
      "title": "Blend the ingredients.",
      "content": "Blend the ingredients. Place the berries, yogurt/milk mixture, and sweetener in the blender. Blend the ingredients until the smoothie has no visible lumps. Check the consistency and add more milk, yogurt, or ice as desired."
    },
    {
      "title": "Serve the smoothie.",
      "content": "Serve the smoothie. Pour this healthy smoothie into a glass to drink at home, or use a to-go container so you can enjoy it on the run."
    },
    {
      "title": "Get tropical fruits.",
      "content": "Get tropical fruits. This pina colada-esque smoothie is an incredibly delicious summer treat. You'll need a total of a cup of your favorite tropical fruits. Buy them frozen or fresh, then cut them into 1/2-inch chunks. Consider these excellent options: Pineapple Mango Papaya Guava Passion fruit Kiwi"
    },
    {
      "title": "Consider using Greek yogurt.",
      "content": "Consider using Greek yogurt. The thick texture of Greek yogurt offsets the juicy quality of the tropical fruits, and its tangy flavor pairs perfectly with their bursting sweetness. Get full fat or low fat Greek yogurt. You'll need one cup."
    },
    {
      "title": "Use juice as a sweetener.",
      "content": "Use juice as a sweetener. Sweeten this smoothie with 1/4 cup orange juice, pineapple juice, lime juice, or mango juice."
    },
    {
      "title": "Blend the ingredients.",
      "content": "Blend the ingredients. Place the fruit, yogurt, and juice in the blender. Blend the ingredients until they are completely smooth. Add more juice if you want to thin the smoothie, or more yogurt to make it thicker."
    },
    {
      "title": "Serve the smoothie.",
      "content": "Serve the smoothie. Pour it into a glass for your self and drink immediately. This treat may also be served in dessert glasses with a fancy straw for a refreshing summertime dessert."
    },
    {
      "title": "Prepare autumn fruits.",
      "content": "Prepare autumn fruits. Cut up an apple and a pear to use in this autumn smoothie. Peel the fruit first so that you don't end up with tough skins that will be difficult to blend."
    },
    {
      "title": "Use a cup of thick yogurt.",
      "content": "Use a cup of thick yogurt. This wholesome smoothie tastes best with a thick, rich texture. Use a cup of whole plain yogurt with a creamy top."
    },
    {
      "title": "Add spices and sweetener.",
      "content": "Add spices and sweetener. Adding 1/2 teaspoon cinnamon and a dash of nutmeg to this smoothie gives it the flavor of fall. Use 1 tablespoon (14.8 ml) of maple syrup to sweeten it."
    },
    {
      "title": "Blend the ingredients.",
      "content": "Blend the ingredients. Place the apple, yogurt, spices, and maple syrup in the blender. Blend the ingredients until they are completely smooth and creamy. Add a little milk if you want to thin it out."
    },
    {
      "title": "Serve the smoothie.",
      "content": "Serve the smoothie. Pour it into glasses. Sprinkle a bit of cinnamon on top for garnish, then serve."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    },
    {
      "title": "Assemble your ingredients.",
      "content": "Assemble your ingredients. You'll need a box of strawberries, some banana (optional), a container of plain vanilla yogurt, vanilla extract, and a box of blueberries."
    },
    {
      "title": "Slice the fruit, apart from the blueberries.",
      "content": "Slice the fruit, apart from the blueberries. Make medium-sized slices of the strawberries and/or bananas. Cut off the leaves of the strawberries. It doesn't really matter if the slices are uneven, because they will blend together in the blender."
    },
    {
      "title": "Put all of the prepared fruit into the blender.",
      "content": "Put all of the prepared fruit into the blender."
    },
    {
      "title": "Scoop out the desired amount of yogurt form the container.",
      "content": "Scoop out the desired amount of yogurt form the container. Add it to the blender. About 10 to 15 tablespoonfuls is a good amount."
    },
    {
      "title": "Put a little less than a teaspoon of vanilla onto a teaspoon.",
      "content": "Put a little less than a teaspoon of vanilla onto a teaspoon. Put it into the blender."
    },
    {
      "title": "Add anything else that you'd like.",
      "content": "Add anything else that you'd like. For example, a little granola or a handful of nuts."
    },
    {
      "title": "Put the lid on the blender.",
      "content": "Put the lid on the blender. Let it mix for about 20 seconds, or until the mixture is pinkish with little flecks of dark in it."
    },
    {
      "title": "Pour out the desired amount into your cup.",
      "content": "Pour out the desired amount into your cup. Enjoy!"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}