{
  "url": "https://www.wikihow.com/Import-a-PST-File-to-Thunderbird",
  "title": "Import Outlook PST files to Thunderbird: Easy Step-by-Step Guide",
  "steps": [
    {
      "title": "Go to https://mail.google.com/mail/u/0/ in a web browser.",
      "content": "Go to https://mail.google.com/mail/u/0/ in a web browser. You can use this method on both PC and Mac. If you're not already signed in, follow the on-screen instructions to sign in now. You’ll want to have 2-factor authentication on to allow Outlook to easily connect to your Gmail account. If you don’t have 2-factor authentication enabled, you’ll be prompted to log in to a website with your Gmail account to allow Outlook access to your Gmail account."
    },
    {
      "title": "Click the Settings gear.",
      "content": "Click the Settings gear. It's at the top-right corner of your inbox."
    },
    {
      "title": "Click Settings on the menu.",
      "content": "Click Settings on the menu."
    },
    {
      "title": "Enable IMAP.",
      "content": "Enable IMAP. Here's how: Click the Forwarding and POP/IMAP tab. Select “Enable IMAP” under the \"IMAP Access\" header. You may have to scroll down the page to see it. Click Save Changes all the way at the bottom of the screen."
    },
    {
      "title": "Open Outlook.",
      "content": "Open Outlook. You’ll usually find this in your Start Menu or Applications folder."
    },
    {
      "title": "Click the File menu and select Add Account.",
      "content": "Click the File menu and select Add Account . Now you can link your Gmail account to Outlook."
    },
    {
      "title": "Enter your Gmail account details.",
      "content": "Enter your Gmail account details. Here's how: Enter your Gmail email address. Select POP or IMAP . Enter your personal information as requested. Select IMAP as the account type under \"Server Information.\" Enter imap.googlemail.com as the incoming mail server and smtp.googlemail.com as the outgoing server. Enter your Gmail email address and password."
    },
    {
      "title": "Configure the outgoing mail server.",
      "content": "Configure the outgoing mail server. Here's how: Click More Settings at the bottom-left corner. Click the Outgoing Server tab. Make sure both “My outgoing server (SMTP) requires authentication\" and “Use same settings as my incoming mail server\" are selected. Click the Advanced tab. Type 993 into the “Incoming server (IMAP)\" field. Select SSL in the menu next to “Use the following type of encrypted connection.” Select TLS in the drop-down next to “Use the following type of encrypted connection.” Type 587 into the “Outgoing server (SMTP)\" field."
    },
    {
      "title": "Click Ok and Next.",
      "content": "Click Ok and Next . This closes the open windows. Outlook will now test the connection to your Gmail account. Click Close if there are no errors. If there is an error message, you may have typed something incorrectly. You can try again. Those boxes will disappear and you will see your Gmail in your Outlook."
    },
    {
      "title": "Import the PST file into Outlook.",
      "content": "Import the PST file into Outlook. Here's how: Click the File tab and select Open & Export. Select “Import from another program or file” and then continue. Select “Personal Folder File (.pst)” and then continue. Find and double-click the PST file. Select a location in Outlook to import those files and click Finish ."
    },
    {
      "title": "Copy the imported PST file into your Gmail account.",
      "content": "Copy the imported PST file into your Gmail account. Right-click the folder with your imported information and select Copy. Select a Gmail folder, such as All Mail , and select OK . Your Outlook info will be added to your Gmail account.This may take a few minutes or hours."
    },
    {
      "title": "Open Thunderbird.",
      "content": "Open Thunderbird. You’ll see this in your Start Menu."
    },
    {
      "title": "Click the File menu.",
      "content": "Click the File menu. It's at the top-left corner of Thunderbird."
    },
    {
      "title": "Select New and click Existing Mail Account.",
      "content": "Select New and click Existing Mail Account ."
    },
    {
      "title": "Enter your Gmail account information.",
      "content": "Enter your Gmail account information. Thunderbird will automatically configure your Gmail connection with this info."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . Now that you've connected Thunderbird to Gmail, the PST file (and all of your Gmail messages) will import to Thunderbird. This can take a few hours if you have a lot of data in Gmail."
    },
    {
      "title": "Get your free 14-day trial G Suite account at https://gsuite.google.com/.",
      "content": "Get your free 14-day trial G Suite account at https://gsuite.google.com/ . This method only works with Windows computers. To sign up: Click Get Started and enter your information, including business name, number of employees, and country. Choose if you have your own domain or need one. Type in your existing domain or create one. Enter your billing information and sign in information, including your username and password. Confirm your purchase of the domain if necessary before continuing. If you have your own domain, you’ll need to confirm the free 14-day trial of G Suite."
    },
    {
      "title": "Go to https://tools.google.com/dlpage/outlookmigration.",
      "content": "Go to https://tools.google.com/dlpage/outlookmigration . You can use this app to migrate all your Outlook emails to a Google Business account. You’ll need to have Outlook installed on your computer, but not opened."
    },
    {
      "title": "Click Download Migration Tool.",
      "content": "Click Download Migration Tool . This downloads the installer to your computer."
    },
    {
      "title": "Click the downloaded file to run the installer.",
      "content": "Click the downloaded file to run the installer. Follow the installer's instructions to set up the Outlook Migration Tool."
    },
    {
      "title": "Open G Migration for Microsoft Outlook.",
      "content": "Open G Migration for Microsoft Outlook. You’ll see this in your Start Menu."
    },
    {
      "title": "Sign in to your Gmail account when prompted.",
      "content": "Sign in to your Gmail account when prompted."
    },
    {
      "title": "Click From PST File(s).",
      "content": "Click From PST File(s) . Your file browser will open."
    },
    {
      "title": "Locate and double-click your PST file.",
      "content": "Locate and double-click your PST file. You can also choose to import data directly from a Microsoft Outlook profile."
    },
    {
      "title": "Select which content to import.",
      "content": "Select which content to import. You'll probably want to import your email messages, contacts, and calendars. To speed up the importing process, click to uncheck the boxes next to \"Junk\" and \"Deleted Items.\""
    },
    {
      "title": "Click Migrate to start importing to G Suite.",
      "content": "Click Migrate to start importing to G Suite. This may take a few minutes to hours, depending on the amount of information."
    },
    {
      "title": "Open Thunderbird.",
      "content": "Open Thunderbird. You’ll see this in your Start Menu."
    },
    {
      "title": "Click the File menu.",
      "content": "Click the File menu. It's at the top-left corner of Thunderbird."
    },
    {
      "title": "Select New and click Existing Mail Account.",
      "content": "Select New and click Existing Mail Account ."
    },
    {
      "title": "Enter your Gmail account information.",
      "content": "Enter your Gmail account information. Thunderbird will automatically configure your Gmail connection with this info."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . Now that you've connected Thunderbird to Gmail, the PST file (and all of your Gmail messages) will import to Thunderbird. This can take a few hours if you have a lot of data in Gmail."
    }
  ]
}