{
  "url": "https://www.wikihow.com/Make-Someone-Say-Carrot",
  "title": "How to Make Someone Say Carrot",
  "steps": [
    {
      "title": "Find a willing participant.",
      "content": "Find a willing participant. One of the most important parts of making this trick a success is finding the right person to play it on. This can be a friend, a casual acquaintance, or even a stranger. Ideally, however, you want someone who will go along with the trick, follow your directions, and generally be a \"good sport\" about things. This person should also be able to give you his/her full attention — try not to pick someone who's busy or distracted by something else.\" [1] X Research source"
    },
    {
      "title": "Explain the rules of the game.",
      "content": "Explain the rules of the game. Say something along the lines of the following: \"In this trick, I will show that I can see the future and predict your responses before you even think of them. In a few moments, I am going to ask you a series of questions. Answer each question as quickly as possible. I am not trying to trick you with these questions — the answer to each should be clear and straightforward. Pay attention to me only. Don't look for help from the audience. Are you ready to begin?\" [2] X Research source Here, it's a good idea to \"ham things up\" a little. For instance, you can make a big show for the audience by saying something like: \"Ladies and gentleman, I confess that I've been deceiving you this evening. My real name is not (your name here). In fact, I am the Great Zambini, master illusionist and psychic. In a few moments, you will join me as we journey into the strange world of the paranormal...\""
    },
    {
      "title": "On a piece of paper, write the word \"Carrot.",
      "content": "On a piece of paper, write the word \"Carrot. \" Pull out a small, blank notepad, index card, or scrap of paper. Show the audience that it is a normal, ordinary object. Say to the audience something like, \"I will now use my psychic powers to predict the brave volunteer's behavior.\" Write \"carrot\" on the paper but don't let anyone see what you're writing. Lay the paper face-down in front of you. Ensure the paper is in full view your volunteer and the rest of your audience for the entire trick. You don't want to be accused of cheating after pulling off the trick."
    },
    {
      "title": "Ask the volunteer to say the number \"six\" 10 times.",
      "content": "Ask the volunteer to say the number \"six\" 10 times. The volunteer should go as fast as possible while still saying \"six\" clearly. Have him/her maintain eye contact with you while counting. If your volunteer loses concentration or starts to giggle, calmly direct him/her to start over. You can even use a showy line like \"The psychic bond between us has broken. Start again.\" This trick works best if the volunteer is focusing on you completely. Ideally, you want to get the volunteer into a trance-like state from the repetitive action of saying \"six\" while staring into your eyes."
    },
    {
      "title": "Ask the volunteer to solve 10 math problems with the answer \"six.",
      "content": "Ask the volunteer to solve 10 math problems with the answer \"six. \" Ask simple math problems so that your volunteer can answer them almost instantly. For example, you might ask, \"What's 1 + 5? 2 + 4? 3 + 3? 12 - 6? 6 + 0? 10 - 4...\" and so on. The important thing is that the volunteer must be able to answer the questions quickly, saying \"six\" each time."
    },
    {
      "title": "Say “Name any vegetable.",
      "content": "Say “Name any vegetable. \" Don't give this question any extra importance. Just ask it quickly after the final math problem in the same tone of voice you've been using. Most of the time, the volunteer will respond with \"carrot.\" It's not clear why this works. It may be that the repetition of \"six\" causes the volunteer to think of a six-letter answer, or it may simply be that carrots are the most \"obvious\" vegetable to most people, so it's the first one they think of when they are in a hypnosis-like state."
    },
    {
      "title": "Flip the paper over.",
      "content": "Flip the paper over. If you predicted \"carrot\" correctly, your audience will be wowed. For an impressive effect, you can try saying something mysterious like, \"Ah, my child, your mind is like an open book to me.\" Congratulations! Your trick is complete. Remember: magicians never reveal their secrets. If your volunteer said a different vegetable, you have two options. The first is to simply drop the act and say something like, \"Ahhh, shoot!\" as you turn over the paper. If you do this, be a good sport and laugh along with the audience. Your other option is to maintain your act by saying something like, \"Your mind is cloudy today.\" You can either turn over the card or tear it up, but be ready for some light-hearted jeers from the audience!"
    }
  ]
}