{
  "url": "https://www.wikihow.com/Get-Your-Game-on-Steam",
  "title": "A Detailed Guide to Getting Your Game on Steam",
  "steps": [
    {
      "title": "Go to https://partner.steamgames.com/ in a web browser.",
      "content": "Go to https://partner.steamgames.com/ in a web browser. This is the website for Steamworks. Here you can sign up to be a game developer. You'll need to fill out some paperwork in order to sign up for Steamworks. Before you proceed, you should have your bank account and routing number available, as well as your tax information. There is also a product submission fee of $100.00 per game you want to distribute on Steam. [1] X Research source You will need to go through an approval process, which will take about a week. [2] X Research source"
    },
    {
      "title": "Log in and sign up to be a game developer.",
      "content": "Log in and sign up to be a game developer. You can log in to Steamworks with your existing Steam account. Then you need to click Sign Up next to \"Game Developer or Publisher.\" There will be a form explaining the onboarding process. Read this as it tells you everything you need and then click Continue at the bottom of the page. Alternatively, you can sign up to be a VR content developer or a software developer for Steam."
    },
    {
      "title": "Fill out the forms and click Continue.",
      "content": "Fill out the forms and click Continue . You'll need to provide your name or company name, physical address, payment notification email, language, and fax number. You will also need to agree to a non-disclosure agreement (NDA). Click Continue at the bottom of each page when you are ready to continue."
    },
    {
      "title": "Fill out your payment information and make the payment.",
      "content": "Fill out your payment information and make the payment. You will be charged a $100.00 fee per game you want to upload. To make your payment, select your payment type and fill out your payment information. Click Continue at the bottom to finish. [3] X Research source"
    },
    {
      "title": "Fill out any additional information.",
      "content": "Fill out any additional information. You'll need to provide some tax information. This will vary depending on if you are producing games as an individual or as a company. Fill out any additional forms you are asked to complete. When you are finished, your applications will need to be reviewed by Steam. This may take about a week. Once the onboarding process will be complete, you can start creating your store page and uploading your game builds. [4] X Research source"
    },
    {
      "title": "Go to https://partner.steamgames.com/home and log in.",
      "content": "Go to https://partner.steamgames.com/home and log in. This takes you to your Steamworks dashboard. You will need to have completed the onboarding process before this is available."
    },
    {
      "title": "Click your game.",
      "content": "Click your game. You will see a list of incomplete games below \"Unpublished Applications.\" Click the game you want to upload. If you have not uploaded any information about your game, there will be a blank game listed as \"YOUR GAME HERE (0000000).\" When you open your game, you will see a checklist in the panel to the right. All items in that checklist need to be completed before you can submit your game for approval. If you have a release date for your game, you can click Update below \"Date to be released on Steam\" in the box in the upper-right corner and select your release date on the calendar. This will complete one of your checklist items."
    },
    {
      "title": "Click Edit Store Page.",
      "content": "Click Edit Store Page . It's the first option below \"Store Presence.\" You will need to fill out the form below each tab. You'll need to have all the information about your game available as well as a few screenshots, graphic images for your store, and a video trailer."
    },
    {
      "title": "Click each of the tabs at the top and fill out the form.",
      "content": "Click each of the tabs at the top and fill out the form. Each of the tabs at the top of the page contains a form for you to fill out. The information you provide will be used to create your store page on Steam. Fill out each form as completely as possible and click Save at the bottom. The tabs at the top are as follows: Basic Info: This is where you will provide the bulk of the information about your game. This lengthy form asks you to provide the name of your game, the developer, the publisher, links to your social media and external websites, keywords, PC specs and requirements, release date, supported languages, genres, multiplayer information, DRM information, legal information, as well as support contact information for your game. Description: This page is where you can provide a description for your game. You'll need to provide a long description and a short description. The long description will be displayed on your store page. It should be as detailed as possible. The short description will be used at various places throughout Steam. There is also a section for reviews and awards. Ratings: If your game has received an official content rating from a game rating agency (i.e. ESRB, PEGI, BBFC, etc), you can include it here along with the content it was rated for. Do not include any ratings unless your game has been evaluated by the agency and you have received an official rating. You can also add an age-gate for your game to restrict sales to minors. Early Access: If you plan on allowing early access to your game, fill out this page to provide the Early Access information. You will need to include why you are using early access, how long it will go on, how it will differ from the full version, any difference in price between early access and the full version, as well as, the current state of your early access game. Game Assets: This is where you can provide images for your game. You will need to include some screenshots of your game, a header image, background image, and capsule images that will be used throughout the Steam app. You can drag and drop your images onto the page to upload them. There are also several zip files for download that contain sample files, guidelines, and Photoshop templates you can use to create your own images. Trailers: This is where you can upload video trailers for your game. Your video trailer should have a 16:9 ratio with a resolution of 1920x1080. It should have a high bit rate of 5000 kbps or more. It can be either 30 frames-per-second or 60 frames-per-second. It should also be in MOV or WMV format. Type a name for your trailer and click Create . Then drag and drop the video file into the box to upload it. Special Features: This is where you can add a Google Analytics tracker if you have one. You can also include any information you have about downloadable content or demos you have for your game."
    },
    {
      "title": "Click Preview changes in store to view your store page.",
      "content": "Click Preview changes in store to view your store page. When you are done designing your store page, you can click Preview changes in store in the upper-right corner to see what your store page looks like. Make sure there is nothing you need to change. [5] X Research source"
    },
    {
      "title": "Click the Publish tab.",
      "content": "Click the Publish tab. This tab lets you publish all the changes you have made This will not release your game publicly on Steam unless your game has already been released."
    },
    {
      "title": "Publish your store page.",
      "content": "Publish your store page. To do so click the blue button that says Prepare for Publishing . Then click the blue button that says Publish to Steam . Then enter your password and click Really Publish ."
    },
    {
      "title": "Add pricing to your game.",
      "content": "Add pricing to your game. Once you've decided on a price for your game, you can use the \"Suggest Price\" feature to suggest prices for other markets and currencies. This suggests the best value for those markets. Use the following steps to add pricing to your game: Go to https://partner.steamgames.com/home and log in. Click your game below \"Unpublished Applications.\" Click the game package you want to set a price for. Click Suggest Pricing . Use the drop-down menu next to \"Select in USD\" to select a price for your game. Make any price changes to the suggested prices you want. Click Save Pricing ."
    },
    {
      "title": "Add community images to your game.",
      "content": "Add community images to your game. Community images are used on your store page and a variety of other community hubs. You will also be required to upload an ICO image to use as the desktop icon for your game (you can convert a JPEG to an ICO file using free Photoshop plug-ins or a free online image conversion site). Use the following steps to upload your community images: Go to https://partner.steamgames.com/home and log in. Click your game below \"Unpublished Applications.\" Click Edit Steamworks Settings . Click the Basic Info tab. Click Browse below \"Capsules\" and upload a 184 x 69 pixel capsule image. Click Browse below \"Community Icon and upload your 32 x 32 pixel community icon. Click Browse below \"Client Icon\" and upload your desktop icon ICO image."
    },
    {
      "title": "Go to https://partner.steamgames.com/home and log in.",
      "content": "Go to https://partner.steamgames.com/home and log in. This takes you to your Steamworks dashboard."
    },
    {
      "title": "Click your game.",
      "content": "Click your game. You will see a list of incomplete games below \"Unpublished Applications.\" Click the game you want to create a Steam build for. [6] X Research source"
    },
    {
      "title": "Click Edit Steamworks Settings.",
      "content": "Click Edit Steamworks Settings . It's the first option listed below \"Technical Tools.\""
    },
    {
      "title": "Enter the name of the game and click Save.",
      "content": "Enter the name of the game and click Save . Use the text box next to \"Game\" to enter the name of your game. Then click save."
    },
    {
      "title": "Check which operating systems the game is for and click Save.",
      "content": "Check which operating systems the game is for and click Save . Click the checkbox next to whichever operating systems your game supports. You can publish games for Windows, MacOS, and Linux."
    },
    {
      "title": "Click Configuration under the \"Installation\" tab.",
      "content": "Click Configuration under the \"Installation\" tab. The Installation tab is the third tab at the top fo the page. Click it and then click Configuration ."
    },
    {
      "title": "Change the name of the install folder (if needed).",
      "content": "Change the name of the install folder (if needed). This is the folder that will be created when the game is installed. By default, it will be the name of your game. To change it, enter a new name for the install folder next to \"Current install folder\" and click Update install folder."
    },
    {
      "title": "Click Add New Lanuch Option.",
      "content": "Click Add New Lanuch Option . It's the blue button below \"Launch Options.\""
    },
    {
      "title": "Enter the name of the executable or launch file of the game.",
      "content": "Enter the name of the executable or launch file of the game. This is the executable file (or other launch file) that Steam will use to launch the game from within the Steam client. Enter the name of the launch file from your build."
    },
    {
      "title": "Change the operating system (if needed) and click Update.",
      "content": "Change the operating system (if needed) and click Update . If you have a build for all operating systems, you can leave it as \"Any.\" You will need to create a separate launch option for each operating system. If your build is for a specific operating system, select it next to \"Operating System.\" Additionally, if you need to specify a CPU architecture (32-bit or 64-bit). You can use the last drop-down menu to do so."
    },
    {
      "title": "Click Depots under the \"Installation\" tab.",
      "content": "Click Depots under the \"Installation\" tab. The depots are what Steam uses to package and contain all the files that will be downloaded from Steam. You game should have at least one depot. If you need to add more, you can do so from this page."
    },
    {
      "title": "Select the operating system and language for each depot.",
      "content": "Select the operating system and language for each depot. Use the drop-down menus next to each listed depot to select the operating system and language for the game."
    },
    {
      "title": "Click Save Changes.",
      "content": "Click Save Changes . It's the blue button below section for creating and adding new depots. You can go through other tabs and check to see what additional metadata you would like to add to your game."
    },
    {
      "title": "Click the Publish tab.",
      "content": "Click the Publish tab. This tab lets you publish all the changes you have made This will not release your game. It will only publish the metadata and the configuration changes you have made."
    },
    {
      "title": "Publish your game data.",
      "content": "Publish your game data. To do so click the blue button that says Prepare for Publishing . Then click the blue button that says Publish to Steam . Then enter your password and click Really Publish ."
    },
    {
      "title": "Download Steamworks SDK.",
      "content": "Download Steamworks SDK. You will need to use the Steamworks SDK to create the Steam build for your game. Use the following steps to download Steamworks SDK: Go to https://partner.steamgames.com/doc/sdk in a web browser. Click the text that says Here to download Steamworks SDK as a zip file. Extract the contents of the zip file."
    },
    {
      "title": "Navigate to the \"ContentBuilder\" folder in the Steamworks SDK.",
      "content": "Navigate to the \"ContentBuilder\" folder in the Steamworks SDK. Use File Explorer on Windows of Finder on Mac to open the Steamworks SDK folder you downloaded and extracted earlier and open the following folders: Open the sdk folder. Open the Tools folder. Open the ContentBuilder folder."
    },
    {
      "title": "Open the \"app_build_1000.vdf\" file in the \"Scripts\" folder.",
      "content": "Open the \"app_build_1000.vdf\" file in the \"Scripts\" folder. The \"Scripts\" folder under \"ContentBuilder\" has a file called \"app_builder_1000.vdf.\" You can open the file using a text editor program like \"Notepad\" or \"TextEdit.\" Right-click the file and click Open with . Then click the program you want to open the file with."
    },
    {
      "title": "Change the AppID to your actual appID from Steam.",
      "content": "Change the AppID to your actual appID from Steam. The first line lists the appID as \"1000.\" Change the \"1000\" to your game's actual numeric appID. It's the number listed at the end of the URL when you edit your game in the Steamworks Settings page. You can copy and paste it from the end of the URL after you publish your game. You can also change the appID in the file name of the \"app_build_1000.vdf\" file, though that's not required. If you know what you are doing, you can change any of the other settings in the app_build_1000.vdf file. If you don't know what you are doing, leave them as they are."
    },
    {
      "title": "Change the depot ID to your actual depot ID number.",
      "content": "Change the depot ID to your actual depot ID number. The depot ID is listed as \"1001\" by default at the bottom next to \"depot_build_1001.vdf.\" Change it to your actual depot ID. The depot ID is the 6-digit number listed next to the game title at the top of the depot page in the Steamworks Settings web page. Click File followed, by Save to save the file when you are done. If you plan on changing the filename of the \"depot_build_1001.vdf\" file, be sure to replace the \"1001\" in the filename as well."
    },
    {
      "title": "Open the depot_build_1001.vdf\" file. It's the next file in the \"Scripts\" folder in \"ContentBuilder.\" Open this file with a text editor such as \"Notepad\" or \"TextEdit.\"",
      "content": "Open the depot_build_1001.vdf\" file. It's the next file in the \"Scripts\" folder in \"ContentBuilder.\" Open this file with a text editor such as \"Notepad\" or \"TextEdit.\""
    },
    {
      "title": "Replace the depot ID number with the actual Depot ID for your game.",
      "content": "Replace the depot ID number with the actual Depot ID for your game. Change the default \"1001\" depot ID with your actual depot ID from the Steamworks Settings webpage. Then save the file. You can also replace the \"1001\" in the file name with your actual depot number. But make sure you do so at the bottom of the \"app_build_1000.vdf\" file as well."
    },
    {
      "title": "Copy all the files you want to get packaged.",
      "content": "Copy all the files you want to get packaged. Go to the installation folder for your game build and copy all the files from that folder that you want to get packaged."
    },
    {
      "title": "Paste the game in the \"Content\" folder in Steamworks SDK.",
      "content": "Paste the game in the \"Content\" folder in Steamworks SDK. Navigate back to the \"ContentBuilder\" folder in Steamworks SDK. Open the \"content\" folder and paste your game's contents in this folder. If you create a new root folder in the \"contents\" folder for this specific depot, be sure to note the folder path relative to the \"content\" folder next to \"LocalPath\" in the \"depot_build_1001.vdf\" file where the \"*\" is (i.g. \".\\windows\\*\")."
    },
    {
      "title": "Enabled SteamCMD in the Terminal on Mac (MacOS only).",
      "content": "Enabled SteamCMD in the Terminal on Mac (MacOS only). If you are using a Mac, you'll need to use the following steps to enable SteamCmd in the Terminal. This will allow you to use SteamCmd in the Terminal the same way you would use it in the Command Prompt in Windows. Use the following steps to enable SteamCmd in the Terminal: Use the Finder to navigate to the following folder in the Steamworks SDK folder you extracted: \"\\sdk\\tools\\ContentBuilder\\builder_osx\\\" Right-click the \" osx32 \" folder and click Get Info . Highlight and copy the location next to \"Where.\" Open the Terminal in the Utilities folder or using the Spotlight search function. Type cd and press Command + V to paste the path you copied and press Enter . Type chmod +x steamcmd and press Enter . Go back to the previous \"ContentBuilder\" folder in the Finder and copy the location of the \"builder_osx\" folder. Type cd and paste the location of the folder and press Enter . Type bash ./steamcmd.sh and press enter to start SteamCmd. To exit SteamCmd, type exit and press Enter."
    },
    {
      "title": "Run SteamCmd on Windows (Windows Only).",
      "content": "Run SteamCmd on Windows (Windows Only). If you are using a Windows computer, use the following steps to run SteamCmd: Use File Explorer to navigate to the \"\\sdk\\tools\\ContentBuilder\\builder\" in the Steamworks SDK folder you extracted. Double-click Steamcmd.exe ."
    },
    {
      "title": "Log in to SteamCmd (if needed).",
      "content": "Log in to SteamCmd (if needed). If you are asked to log in type the following command to log in with your Steam account: Substitute \"<account name> for your Steam username, and \"<password>\" for your Steam password. steamcmd.exe +login <account_name> <password> If you are asked to enter a Steam Guard code, retrieve the 4 digit code from your Email or Steam Guard app and type steamcmd.exe \"set_steam_guard_code <code>\" . Replace \"<code>\" with your Steam Guard code."
    },
    {
      "title": "Type run_app_build.",
      "content": "Type run_app_build . You still need to enter the location app_build vdf file. Do not press Enter just yet."
    },
    {
      "title": "Navigate to the \"Scripts\" folder in the Steamworks SDK.",
      "content": "Navigate to the \"Scripts\" folder in the Steamworks SDK. This is the same folder that contains the same folder that contains the \"app_build_1000.vdf\" file you previously edited."
    },
    {
      "title": "Copy the location of the \"Scripts\" folder and paste it in the SteamCmd.",
      "content": "Copy the location of the \"Scripts\" folder and paste it in the SteamCmd. Use one of the following steps to copy and paste the \"Scripts\" folder. Then click SteamCmd and paste the location of the Scripts folder one space after the \"run_app_build\" command. Windows: Click Scripts in the address bar at the top and click Copy address as text . Mac: Right-click the \"Scripts\" folder and click Get Info . Highlight and copy the location next to \"Where:\" ."
    },
    {
      "title": "Type the name of the \"app_build\" vdf folder and press ↵ Enter.",
      "content": "Type the name of the \"app_build\" vdf folder and press ↵ Enter . If you left app_build vdf files as \"app_build_1000\", simply type that immediately after the folder location in SteamCmd. If you change the \"1000\" to the actual app ID, be sure to enter the correct file name. Press Enter to build your app on Steam. This may take a while depending on how big your game is. When this is completed, your game build will have been packaged and uploaded to the depot on Steam."
    },
    {
      "title": "Go to the \"Build\" tab in Steamworks Settings.",
      "content": "Go to the \"Build\" tab in Steamworks Settings. Use the following steps to get to the Build tab in Steamworks settings: Go to https://partner.steamgames.com/home and log in Click your game. Click Edit Steamworks Settings . Click the Build tab."
    },
    {
      "title": "Set build live branch to \"Default\" and click Preview change.",
      "content": "Set build live branch to \"Default\" and click Preview change . Use the drop-down menu below \"Set build live branch\" to select \"Default.\" This is the default way customers download your game. Click Preview change next to the drop-down menu when you are finished. If you want you can click the depot number and inspect the files in the depot to make sure they are correct."
    },
    {
      "title": "Click Set Build Live now and click Ok.",
      "content": "Click Set Build Live now and click Ok . This sets your game build to Live on Steam. It will not be available for customers to download unless the game has already been released."
    },
    {
      "title": "Install and test your game.",
      "content": "Install and test your game. After you build your game on Steam, log in to the Steam client and search for your game. If your game has not been released, it should only be available under your account. Go to the store page and click the Install button to install your build from Steam. Launch the Steam build of the game and make sure it works properly."
    },
    {
      "title": "Finish everything in your checklist.",
      "content": "Finish everything in your checklist. Before you can submit your page for review, you need to have everything in your checklist checked off."
    },
    {
      "title": "Go to https://partner.steamgames.com/home and log in.",
      "content": "Go to https://partner.steamgames.com/home and log in. This takes you to your Steamworks dashboard."
    },
    {
      "title": "Click your game.",
      "content": "Click your game. You will see a list of incomplete games below \"Unpublished Applications.\" Click the game you want to upload."
    },
    {
      "title": "Click Mark as Ready For Review.",
      "content": "Click Mark as Ready For Review . It's the green button in the upper-left corner of the page. This button is only available after your checklist is complete. Click this button and then click Ok to confirm. Your page will be reviewed by Valve. Your game page will either be approved, or you will receive some feedback from Valve about things you need to change."
    },
    {
      "title": "Log back in after your game has been approved.",
      "content": "Log back in after your game has been approved. Once your game is approved, there will be a button that allows you to view your release options."
    },
    {
      "title": "Click your game.",
      "content": "Click your game. This takes you to your app landing page."
    },
    {
      "title": "Click View Release Options.",
      "content": "Click View Release Options . It's the green button at the top of the page."
    },
    {
      "title": "Click one of the release options.",
      "content": "Click one of the release options. Your release options are as follows: Prepare for Release: This publishes your game immediately. It will be available for purchase and play via Steam. Prepare for Coming Soon: This publishes your game store page as Coming Soon. Steam users will be able to add your game to their Wish List and your community will be live and active. Prepare for Early Access: This publishes your game store page with your Early Access content available for download. User's will be allowed to purchase and download your Early Access content, but not the full game."
    },
    {
      "title": "Click Publish Now.",
      "content": "Click Publish Now . It's the green button on the review page. This publishes your store page and publishes live on Steam. Congratulations! You have published your game on Steam."
    }
  ]
}