{
  "url": "https://www.wikihow.com/Last-Longer-in-Bed-Naturally",
  "title": "Natural Techniques to Last Longer In Bed",
  "steps": [
    {
      "title": "Exercise your pelvic floor muscles.",
      "content": "Exercise your pelvic floor muscles. To find your pelvic floor muscles, try stopping your flow while peeing. When you get it to stop, that is the muscle you are working. Give yourself some time to contract the muscles during the day, tightening them for 3 seconds at a time. Do 3 sets of 10 repetitions each day. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Consider doing other, similar exercises that work your pelvic muscles, including yoga, kegels , and Pilates . These can allow you to strengthen these muscles and will give you better control over yourself."
    },
    {
      "title": "Masturbate before sex.",
      "content": "Masturbate before sex. About 1-2 hours before sex, take some time to stimulate yourself and ejaculate. It takes men some time to recover after finishing, so doing so a little bit beforehand will help you slow down. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Train with the start-and-stop method.",
      "content": "Train with the start-and-stop method. Another way to help yourself last longer is to train yourself while masturbating. When you're close to finishing, stop stimulation until you calm down. Build yourself back up, then calm down again. Do this three times before ejaculating. [4] X Research source This technique will help you learn your limits, and how far you can push yourself before the point of no return. Once you know these limits, you will be better able to control yourself before getting to the point where you can’t stop."
    },
    {
      "title": "Stop having sex for a little while.",
      "content": "Stop having sex for a little while. If your problems are related to performance anxiety, it may be helpful to take a little break. Talk to a doctor and your partner about avoiding sex for a set period of time. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This doesn’t mean losing intimacy. Use this time without intercourse to focus on other types of sexual play. This will help you learn to create pleasure for both yourself and your partner, taking the pressure away when you get back to having sex."
    },
    {
      "title": "Eat a diet with naturally sex-enhancing foods.",
      "content": "Eat a diet with naturally sex-enhancing foods. Many foods are said to be natural aphrodisiacs or have benefits that include lasting longer in bed. Some of these foods include: Potassium-rich foods like bananas, spinach and garlic: Potassium helps to regulate blood pressure, and increasing your intake of this nutrient can help you last longer in bed. [6] X Expert Source Ritu Thakur, MA Natural Health Care Specialist Expert Interview. 25 July 2019. Ginseng powder: Ginseng is used in traditional Chinese medicine to help with sexual performance and treat fertility problems. The chemicals in ginseng have been shown to improve libido and can even increase sperm count. [7] X Expert Source Ritu Thakur, MA Natural Health Care Specialist Expert Interview. 25 July 2019. Musli powder: This herb has been used in Eastern medicine to treat many types of sexual performance problems. The powder has been shown to increase the production of testosterone and increase sexual desire as an aphrodisiac. [8] X Expert Source Ritu Thakur, MA Natural Health Care Specialist Expert Interview. 25 July 2019."
    },
    {
      "title": "Wear a thick condom to reduce stimulation.",
      "content": "Wear a thick condom to reduce stimulation. Especially if you’re used to not using a condom or use very thin condoms, this switch can make it easier to last a bit longer during sex. Some condoms also contain numbing ingredients, which can help even further to delay ejaculation. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source There are special “climax control” condoms you can purchase at the drugstore. If you’re embarrassed to buy these in person, consider ordering them online."
    },
    {
      "title": "Apply an anesthetic cream to make your penis less sensitive.",
      "content": "Apply an anesthetic cream to make your penis less sensitive. As you’re getting ready for sex, use a lidocaine or prilocaine cream or spray. These sprays can help you last longer during sexual activities by helping numb your nerves a bit so you’re less sensitive to stimulation. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source There are some over-the-counter options you can pick up from the drugstore, or your doctor may be able to prescribe something for you."
    },
    {
      "title": "Engage in foreplay.",
      "content": "Engage in foreplay. Intercourse is usually better for climaxing if you have a penis, but many people need other stimuli to get there. Some foreplay before penetration, such as rubbing, petting, kissing, and giving oral sex, can help enhance your partner’s pleasure while delaying your own gratification. [11] X Research source Reader Poll: We asked 698 wikiHow readers if they think kissing and cuddling make sex better, and 50% of them said yes. [Take Poll]"
    },
    {
      "title": "Change your position.",
      "content": "Change your position. Having sex in the \"missionary\" position might be contributing to your premature ejaculation. Allow your partner to be on top so you can relax and see if that helps."
    },
    {
      "title": "If you start to feel close to finishing, stop and switch around to another position.",
      "content": "If you start to feel close to finishing, stop and switch around to another position."
    },
    {
      "title": "Go slower.",
      "content": "Go slower. Make yourself last longer by giving yourself time between thrusts. You can also change the angle of your thrusts or make them shallower. If you start to feel like you are close, stop thrusting and hold yourself inside your partner until you feel in control again. Another way to slow yourself down is to focus on other activities. Caress and explore your partner’s body, using your hands and lips to explore."
    },
    {
      "title": "Try the pause-squeeze technique.",
      "content": "Try the pause-squeeze technique. One way for you and your partner to help prevent you from finishing too soon is the pause-squeeze technique, which involves putting pressure on your penis. When you feel almost ready to ejaculate, have your partner squeeze your penis where the head meets the shaft. Hold for several seconds until your urge to ejaculate has passed. Once your partner lets go, wait 30 seconds, then go back to foreplay. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Think about psychological difficulties.",
      "content": "Think about psychological difficulties. Some doctors believe that finishing prematurely may be the result of personal problems or bad habits developed in past experiences, both in your current relationship and in previous ones. By identifying these possible trouble spots, you can better work through them with your partner or a therapist. [13] X Research source Some problems from your past could include hurrying to climax in order to avoid being discovered or rushing through sexual encounters to avoid guilt."
    },
    {
      "title": "Talk to your partner.",
      "content": "Talk to your partner. Talking to your partner may also demonstrate that you have nothing to worry about. Your partner may not find anything wrong with how long you last. At the same time, your partner may also have some ideas for new positions and foreplay that can increase intimacy and passion, as well as the length of time. [14] X Research source"
    },
    {
      "title": "Visit a therapist.",
      "content": "Visit a therapist. You can consider counseling to work through relationship or other issues. A counselor can be particularly helpful in terms of reducing stress and overcoming performance anxiety. If you think your problems are relationship-based, you may want to visit the therapist or counselor with your partner. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Counseling sessions tend to be most helpful when combined with drug therapy, so they may not always be the most natural course. This, of course, depends on the kind of problems you are having."
    },
    {
      "title": "Talk to a doctor if you’re concerned about premature ejaculation.",
      "content": "Talk to a doctor if you’re concerned about premature ejaculation. If you’re ejaculating earlier than you want to during most or all sexual encounters, you may have a condition called premature ejaculation. If this is a concern for you, your doctor may be able to help. They can interview you about your health history, give you an exam, or even do lab tests to try to find a possible underlying medical reason for the problem. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Common causes of premature ejaculation include psychological factors, such as depression, anxiety, or body image issues. It can also be related to physical problems, such as hormone imbalances or conditions that cause inflammation in the prostate or urethra."
    },
    {
      "title": "Work with your doctor to manage any underlying conditions.",
      "content": "Work with your doctor to manage any underlying conditions. If your doctor thinks the problem might be caused by a medical or psychological issue, ask them about treatment options. Once you treat whatever is causing your premature ejaculation, you may be able to last longer in bed. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For example, if you have premature ejaculation that’s related to an infection in your prostate or urinary tract, you may be able to treat it with a course of antibiotics."
    },
    {
      "title": "Discuss medical treatments if natural remedies aren’t working.",
      "content": "Discuss medical treatments if natural remedies aren’t working. If you’ve been trying natural remedies to extend how long you last without success, talk to your doctor. Even if there’s no clear underlying cause for your condition, there are a variety of medications that can help you last longer during sex. Some possible options include: [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Topical anesthetics, which can numb the sensitive skin on your penis and make you less likely to ejaculate early. Certain antidepressant medications, which can delay orgasm. Pain medications such as tramadol (Ultram), which are also known to delay orgasm. Medications for erectile dysfunction, such as sildenafil (Viagra) or tadalafil (Cialis). These may work best in combination with SSRI antidepressants."
    }
  ]
}