{
  "url": "https://www.wikihow.com/Identify-if-a-Child-Has-Been-Traumatized-by-an-Event",
  "title": "How to Identify if a Child Has Been Traumatized by an Event",
  "steps": [
    {
      "title": "Watch for personality shifts.",
      "content": "Watch for personality shifts. Compare how the child acts now to how the child acted before the trauma. If you see extreme behavior, or a noticeable change from their normal behavior, then something is probably wrong. A child may seem to develop a new personality (e.g. a confident girl turning into a shaky people-pleaser overnight), or may switch between several strong moods (e.g. a boy who flip-flops between withdrawn and aggressive). [1] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "Consider how easily the child becomes upset.",
      "content": "Consider how easily the child becomes upset. A traumatized child may cry and whine over relatively small things that wouldn't have bothered them so much before. Some children may already cry or become angry easily, especially between the ages of two and seven. The key part is if it happens more than usual. A child may become extremely upset when reminded of anything related to the trauma - for example, they may become highly anxious or cry when they see an object or person that reminds them of what happened. [2] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "Watch for regression.",
      "content": "Watch for regression. The child may revert to younger behavior, such as thumb-sucking and wetting the bed. [3] X Research source This is especially common in cases of sexual abuse, but can be seen in other forms of trauma as well. [4] X Research source Regression may also be caused by a child adapting to a change in their life, such as a new baby or a new school. The reason change might cause kids to regress is because they long for a time when life was easier. Children with developmental disabilities such as autism may experience regression more easily, which can make it harder to figure out whether the regression is related to trauma or not."
    },
    {
      "title": "Notice signs of passivity and compliance.",
      "content": "Notice signs of passivity and compliance. Traumatized children, especially those harmed by an adult, may attempt to appease adults or avoid angering them. You may notice avoidance of attention, complete compliance, and/or overachieving to turn into a \"perfect\" child."
    },
    {
      "title": "Look for anger and aggression.",
      "content": "Look for anger and aggression. Traumatized children may act out, become frustrated easily, and start throwing more temper tantrums. They may even become aggressive towards others. [5] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source [6] X Expert Source Meredith Brinster, PhD Licensed Clinical Psychologist Expert Interview. 23 July 2021. A child who has been traumatized may seem defiant or frequently get in trouble. [7] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source This may be more apparent in school, especially if the traumatic event took place at school."
    },
    {
      "title": "Observe symptoms of illness, such as headaches, vomiting or fever.",
      "content": "Observe symptoms of illness, such as headaches , vomiting or fever. Children often react to trauma and stress with physical symptoms which may not have an obvious cause. [8] X Research source These symptoms may worsen when the child must do something related to the trauma (e.g. going to school after abuse at school), or when the child is stressed. The child may also be faking sick to avoid school after trauma; however, you should never assume they are faking in the case of trauma. Trauma can affect kids in very real, physical ways, so it’s important to help them and support them through their trauma."
    },
    {
      "title": "Pay attention to changes in behavior.",
      "content": "Pay attention to changes in behavior. If your child acts differently than they used to before the event, it may mean that something is wrong. Look for an increase in anxiety-related behaviors. [9] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source [10] X Expert Source Meredith Brinster, PhD Licensed Clinical Psychologist Expert Interview. 23 July 2021. These changes in behavior will happen over a pretty short timeframe. [11] X Expert Source Meredith Brinster, PhD Licensed Clinical Psychologist Expert Interview. 23 July 2021. It's common for children to start having difficulty with everyday life after experiencing a trauma. They may resist things like bedtime, attending school, or spending time with friends. (Resisting bedtime or school is common among young children, but if they do it more often, or more extremely, than usual, it could be a sign of something serious). Their performance in school might slip and they may experience behavioral regression. Take note of anything that's become a problem after a traumatic event. [12] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source A traumatized child may also act withdrawn all of the sudden. [13] X Expert Source Meredith Brinster, PhD Licensed Clinical Psychologist Expert Interview. 23 July 2021."
    },
    {
      "title": "Watch for clinging to people or objects.",
      "content": "Watch for clinging to people or objects. The child may feel lost without a person they trust, or a favorite object like a toy, blanket, or stuffed animal. [14] X Research source A traumatized child may become extremely upset if this person or object is not with them, because they feel unsafe. Children who have experienced a trauma may develop separation anxiety from parents or caregivers and fear being apart from them. [15] X Research source Carrying toys and blankets around is a phase many children go through, but it could be a sign if they start doing it when they previously did not, or if they do it more often. They may cling to toys or stuffed animals because for a lot of kids, having a special toy or stuffed animal will help them feel more secure. So when they’re separated from it, the emotional trauma could escalate. As such, one way of telling whether their attachment to the toy is truly a sign or just a phase could be whether or not they become nervous or teary-eyed when separated from the toy. Some children withdraw and \"disconnect\" from family or friends instead, preferring to be alone. [16] X Research source If the negative event was a death, the child might cling to and/or obsess over a thing that reminds them of the dead person. If they went somewhere they enjoyed just before the death, they might want to keep coming back to the place so they can have the good memories back."
    },
    {
      "title": "Notice nighttime fears.",
      "content": "Notice nighttime fears. Children who have been traumatized may have difficulty falling or staying asleep, or resist bedtime. They may be afraid to sleep alone at night, with the light off, or in their own room when they previously had no issue with it. They may have an increase in nightmares, night terrors, or bad dreams. [17] X Research source [18] X Expert Source Meredith Brinster, PhD Licensed Clinical Psychologist Expert Interview. 23 July 2021. Some children resist bedtime due to simply not wanting to go to bed rather than fear. To determine the difference, ask a child why they don't want to go to bed. If they're scared, they will say something like \"I don't want to be alone\" or \"What if an alien abducts me?\", whereas if they just don't want to go to bed, they will say something like \"Going to bed is boring\" or \"I don't want to stop playing\". Some children may also relive the traumatic event in flashbacks. [19] X Expert Source Meredith Brinster, PhD Licensed Clinical Psychologist Expert Interview. 23 July 2021."
    },
    {
      "title": "Notice if the child keeps asking if the event will reoccur.",
      "content": "Notice if the child keeps asking if the event will reoccur. The child may ask questions about if it will happen again, or ask about taking steps to prevent it (such as repeatedly asking people to drive safely after a car accident). Reassurance from adults is unlikely to soothe their fears. [20] X Research source Some children may obsess over preventing the event in the future, such as constantly checking the smoke alarm after a house fire. This may turn into Obsessive-Compulsive Disorder. Children might replay the event repeatedly in their art or play, like drawing the event over and over again, or repeatedly recreating the incident with their toys (for instance, crashing toy cars into things if it was a car crash). [21] X Research source"
    },
    {
      "title": "Consider how much the child trusts adults.",
      "content": "Consider how much the child trusts adults. Adults were not able to protect them in the past, so they might reason \"who can?\" and decide that nobody can keep them safe. [22] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source They may not believe adults who try to assure them. If a child has been traumatized, they may have difficulty trusting others as a defense mechanism, as they're unable to view other people or places as safe. [23] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source A child who was abused by an adult may start fearing other adults. For example, a girl who was hurt by a tall, blond man may be afraid of her tall, blond uncle because he looks similar to the man who hurt her."
    },
    {
      "title": "See if the child is afraid of certain places.",
      "content": "See if the child is afraid of certain places. If a child experienced a traumatic event in a specific location, they may avoid or become fearful of the place in question. [24] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Some children may be able to tolerate it with help from a loved one or security object, but be unable to bear being left there alone. For example, a child abused by a therapist may scream and cry if they see the therapy building, and may panic if they even hear the word \"therapy.\" Some places are just commonly scary to a lot of children, such as the doctor. However, if the child is scared of a place most children aren't afraid of, or if they become scared of a place they previously weren't scared of, it's a bad sign."
    },
    {
      "title": "Watch for guilt or shame.",
      "content": "Watch for guilt or shame. The child may blame themselves for the traumatic event because of something they did, said, or thought. [25] X Trustworthy Source Substance Abuse and Mental Health Services Administration U.S. government agency whose mission is to reduce the impact of substance abuse and mental illness on America's communities. Go to source These fears are not always rational; the child may blame themselves for a situation in which they did nothing wrong, and could not have made things any better. [26] X Research source This may lead to obsessive-compulsive behavior. For example, maybe a boy and his sister were playing in the dirt when the traumatic event happened, and now he feels the need to keep everyone perfectly clean and away from dirt."
    },
    {
      "title": "Notice how the child interacts with other children.",
      "content": "Notice how the child interacts with other children. A traumatized child may feel alienated, and may be uncertain how to interact normally with others, or not interested. Or, they may want to talk about or replay the traumatic event, which could annoy or upset other children. A child who has been traumatized may struggle with friendships and appropriate dynamics. They may become extremely passive towards their peers, or try to control or bully them. [27] X Research source Other children withdraw, feeling unable to connect to their peers. [28] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Having trouble with social interactions could also be a sign of autism, introversion, or social anxiety. Children who have been sexually abused may try to mimic the abuse in their play, so it's important to watch how a child plays with peers after trauma. [29] X Research source"
    },
    {
      "title": "Pay attention if the child becomes startled more easily.",
      "content": "Pay attention if the child becomes startled more easily. Trauma can result in hypervigilance and the child may always be \"on guard\". A child may become afraid of wind, rain or sudden loud noises, or seem fearful or aggressive if someone gets too close to them. [30] X Research source [31] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Fear of sudden loud noises might also signify sensory integration issues, but if a child has those, they were likely born with them, whereas with trauma, the fear comes on later."
    },
    {
      "title": "Notice fears that they report.",
      "content": "Notice fears that they report. Children who have been traumatized tend to develop new fears, and may talk or worry about them extensively. [32] X Research source It may seem like nothing can soothe the fear and reassure them that they're safe. For example, if the child experienced a natural disaster or is a refugee, the child may talk about worries that their family will not be safe, or will not have anywhere to live. A traumatized child may obsess over their family's safety and try to protect their family. [33] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "Watch for thoughts of self-harm or suicide.",
      "content": "Watch for thoughts of self-harm or suicide . A suicidal child may start talking a lot about death, give away items for no apparent reason, withdraw from social activities, and talk about what you will do after they are dead. After a trauma, some children fixate on death and may talk or read about it excessively, even if they aren't necessarily suicidal. [34] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source If there was a death in the family, talking about death isn't always a sign of suicidality. Sometimes, it's just a sign that they're trying to understand death and mortality. Still, if it is happening a lot, it may be worth investigating if something is wrong (whether it's suicidality or something else that's wrong)."
    },
    {
      "title": "Keep an eye out for signs of anxiety, depression, or fearlessness in the child.",
      "content": "Keep an eye out for signs of anxiety, depression , or fearlessness in the child. If you think there may be problems, take your child to a psychologist or psychiatrist. Anxiety is a big marker for experiencing a traumatic event. [35] X Expert Source Meredith Brinster, PhD Licensed Clinical Psychologist Expert Interview. 23 July 2021. Watch your child's eating habits, sleep, mood, and concentration. If any of these change dramatically or seem unusual, it's best to investigate it. [36] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Trauma can mimic other conditions. For example, some children become hyper, impulsive, and unable to concentrate after experiencing a trauma, which is frequently mistaken for ADHD. Others may seem defiant or aggressive, which can be misconstrued as simple behavioral problems. If something's wrong, get a professional involved. [37] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "Be aware that even if a child does not display any or a few of these symptoms, that doesn't mean they're coping.",
      "content": "Be aware that even if a child does not display any or a few of these symptoms, that doesn't mean they're coping. A child can be impacted by a traumatic event but keep it bottled up inside out of a misguided need to be strong or courageous for family, or fear of upsetting others. [38] X Research source"
    },
    {
      "title": "Assume that a child who has been part of a traumatic event needs to be cared for with extra attention to helping them through the event.",
      "content": "Assume that a child who has been part of a traumatic event needs to be cared for with extra attention to helping them through the event. They should have opportunities to talk about their feelings about the event, and they should also have opportunities to do fun things completely unrelated to it. [39] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Tell your child that they can come to you if they have fears, questions, or things they want to talk about. If your child does so, give them your full attention and validate their feelings . [40] X Research source If the traumatic event made the news (e.g. a school shooting or natural disaster), reduce your child's exposure to media sources, and monitor their use of the internet and TV. Repeated exposure to the event on the news can make it harder for the child to recover. [41] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Providing emotional support can reduce your child's risk of developing trauma, or make the trauma less severe than it could have been."
    },
    {
      "title": "Keep an eye out, even if signs of trauma don't show up right away.",
      "content": "Keep an eye out, even if signs of trauma don't show up right away. Some children may not give evidence for being upset for several weeks or even months. [42] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Avoid rushing a child to explore and express their feelings. It can take time for some children to process what has happened."
    },
    {
      "title": "Seek help for signs of trauma as soon as possible.",
      "content": "Seek help for signs of trauma as soon as possible. The responses, reactions and abilities of those immediately responsible for a child influence the child's ability to cope with a traumatic occurrence."
    },
    {
      "title": "Have your child see a counselor or psychologist if they seem to be struggling to cope.",
      "content": "Have your child see a counselor or psychologist if they seem to be struggling to cope. While your love and support is very helpful, sometimes children need more than this to help them recover from terrifying events. Don't be afraid to seek help for your child. [43] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "Look into what type of therapy would be right for your child.",
      "content": "Look into what type of therapy would be right for your child. The types of therapy likely to assist recovery for your child include psychotherapy, psychoanalysis, cognitive-behavioral therapy, hypnotherapy and eye movement desensitization and reprocessing (EMDR). If the traumatic event happened to multiple family members, or if you think the family could use help, look into family therapy. [44] X Research source"
    },
    {
      "title": "Don't try to cope alone.",
      "content": "Don't try to cope alone. While it is only natural for you to want to try to be the support for your child, going it alone will make it harder on you, especially if you have also experienced the traumatic event. [45] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Your child will pick up on it if you're distressed or scared, and will take their cues from you, so self-care is a necessity. [46] X Research source Take time to talk about what's going on with your loved ones, like your spouse and friends. Talking about your feelings can help you deal with them and feel less alone. Look into support groups if you or a loved one is going through something very difficult. If you're feeling overwhelmed, ask yourself what you need right now. Do you need a warm shower, a cup of coffee, a hug, 30 minutes with a good book? Take good care of yourself."
    },
    {
      "title": "Encourage your child's interaction with others.",
      "content": "Encourage your child's interaction with others. Family members, friends, therapists, teachers, and others can all support your child and your family in coping with the aftermath of the traumatic event. You are not alone, and neither is your child."
    },
    {
      "title": "Support your child's health.",
      "content": "Support your child's health. You can help a great deal by seeking to restore a routine as soon as possible, continuing to feed your child a nutritious diet and helping your child maintain play and exercise schedules that ensure connections with others of their own age and body movement for good health. [47] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Try to get your child moving (taking walks, going to the park, swimming, jumping on a trampoline, etc.) at least once per day. Ideally, 1/3 of your child's plate should be filled with fruits and vegetables that they like eating."
    },
    {
      "title": "Be available for your child in the here and now.",
      "content": "Be available for your child in the here and now. What does your child need right now? How can you support them today? Just like coping with the past is important, enjoying the present is important too."
    },
    {
      "title": "Be aware of what can be considered a traumatic experience for a child.",
      "content": "Be aware of what can be considered a traumatic experience for a child. A traumatic experience is one that terrifies or shocks the child and may have felt life-threatening (whether real or perceived) and caused the child to feel extremely vulnerable. Potentially traumatizing events include... [48] X Research source [49] X Research source [50] X Trustworthy Source Substance Abuse and Mental Health Services Administration U.S. government agency whose mission is to reduce the impact of substance abuse and mental illness on America's communities. Go to source Natural disasters Vehicle accidents and other accidents Neglect Verbal, physical, emotional, or sexual abuse (including things like compliance therapy, restraint, or seclusion) Sexual assault or rape Wide-scale violence, like a mass shooting or terrorist attack War Violent/intense bullying or victimization Witnessing someone else's trauma (e.g. witnessing abuse)"
    },
    {
      "title": "Recognize that different people respond to trauma differently.",
      "content": "Recognize that different people respond to trauma differently. If two children go through the same experience, they may have different symptoms or different severity of trauma. [51] X Research source What is traumatizing to one child may simply be upsetting to another."
    },
    {
      "title": "Consider signs of trauma in parents and other loved ones close to the child.",
      "content": "Consider signs of trauma in parents and other loved ones close to the child. A parent suffering from post-traumatic stress disorder can also be a trigger for a child to develop a traumatized response. A child may even react more strongly to trauma because adults around them have done so, especially parents because they're so attuned to them."
    }
  ]
}