{
  "url": "https://www.wikihow.com/Make-Movie-Butter-for-Your-Popcorn",
  "title": "2 Ways to Make Movie Theater Butter for Popcorn",
  "steps": [
    {
      "title": "Choose your salt.",
      "content": "Choose your salt. Many movie theaters use salt processed using the Alberger process, as the many jagged edges on the salt crystals help it stick to the popcorn. [1] X Research source Diamond Crystal is the only consumer salt brand in the United States that uses this process. [2] X Research source You can get a similar effect from extra-fine powdered salt, which is often sold as \"popcorn salt\" and stocked next to the popcorn. [3] X Research source You can create powdered salt at home by grinding any salt in an electric coffee grinder, hand-turned salt mill, or mortar and pestle. If using a coffee grinder, grind a small amount of coffee beans afterward to remove the leftover salt."
    },
    {
      "title": "Clarify butter",
      "content": "Clarify butter . Theaters that do use real butter (rather than butter-flavored oil) often use clarified butter. Clarification removes some moisture from the butter, which prevents the popcorn becoming soggy. Orville Redenbacher's and Act II are common brands that use real butter and are the closest to the real thing at the movie theatres. [4] X Research source You can clarify butter at home just by melting it over low heat until the bubbling stops and the liquid turns clear, about 30-40 minutes for 1 lb (0.45 kg) of butter. [5] X Research source Strain the liquid through a damp cheesecloth and let cool to make clarified butter. Discard the milk solids left in the cheesecloth or at the bottom of the pan. The famous \"buttered popcorn\" smell of a movie theater comes from artificial butter flavor. Actual butter won't replicate this perfectly."
    },
    {
      "title": "Heat coconut oil or canola oil in a pan.",
      "content": "Heat coconut oil or canola oil in a pan. You may want to save the clarified butter for later drizzling, as it will likely brown or burn if you try to pop kernels in it. Coconut oil used to be the standard in movie theaters (and many still use it), but you may wish to follow a more recent trend and switch to canola oil, which has less saturated fat and a higher smoke point. [6] X Research source Whichever you choose, pour just enough oil to cover the base of a large pan. Heat on a stovetop until the oil shimmers. Note that most theaters that use canola oil actually use a more hydrogenated version that contains more fat than consumer canola oil. If using coconut oil, the oil should melt completely. You'll need a pan with a lid, but you do not need to cover it now."
    },
    {
      "title": "Make the popcorn",
      "content": "Make the popcorn . Throw in a few unpopped kernels and cover the pot. Once these kernels have popped, add the rest of the popcorn. Use ⅓ cup (80 mL) popcorn kernels for a 6 quart (5.6 L) pot. [7] X Research source Cover and heat, shaking occasionally, until most of the kernels are popped. Pour popped corn into a large bowl whenever the pot gets full. Leave the lid slightly ajar so some of the steam escapes, preventing soggy popcorn. To reduce the number of burned or unpopped kernels, remove from heat right after adding the kernels. Wait for thirty seconds so the kernels reach an even temperature, then return to heat."
    },
    {
      "title": "Add the salt right after the popcorn is popped.",
      "content": "Add the salt right after the popcorn is popped. You'll need about ⅓ tsp (1.5 mL) of fine grained salt for this recipe. [8] X Research source The exact size of the salt crystals affects the flavor, so you may need to adjust to taste. Add the salt right after the popcorn is popped, since the steam clinging to the popcorn will help the salt stick. [9] X Research source"
    },
    {
      "title": "Toss in melted clarified butter.",
      "content": "Toss in melted clarified butter. Pour the popcorn into a large bowl. Add 1 or 2 tbsp (15–30 mL) room temperature clarified butter to the hot pan, according to taste. It should melt quickly in the hot pan without additional heat. Drizzle it onto the popcorn when the butter is still yellow or only slightly brown. Mix the popcorn after drizzling the butter onto it by using a large spoon or by shaking the bowl to get the butter and salt to mix well."
    },
    {
      "title": "Pop your popcorn in coconut oil or canola oil",
      "content": "Pop your popcorn in coconut oil or canola oil . These are the two most common oils used by movie theaters. Heat a thin layer of oil until shimmering in a large pot. Add a few test kernels, then add the rest of the popcorn when they pop. Remove from heat for thirty seconds so the kernels reach an even temperature. Return to heat then cook, shaking occasionally, until popped. You'll need about ⅓ cup popcorn kernels for a 6 quart (5.6 L) pot."
    },
    {
      "title": "Add flavored salt during or after cooking.",
      "content": "Add flavored salt during or after cooking. Many theaters add a salt product that contains artificial butter flavor, often sold under the brand name Flavacol. [10] X Research source You can order this online to add to your own popcorn. Since 1 tsp (5 mL) Flavacol contains 116% of the FDA-recommended daily sodium limit, it's best to sprinkle sparingly. [11] X Research source Theater employees typically toss in the Flavacol before popping. However, Flavacol does release airborne chemicals when heated which could cause harm over long term use. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source This is unlikely to happen if you only make popcorn for personal use, but you can add the Flavacol after cooking if you are concerned."
    },
    {
      "title": "Drizzle on butter flavored popcorn topping.",
      "content": "Drizzle on butter flavored popcorn topping. The Flavacol should already add that artificial butter flavor, but if you want that greasy feel on your tongue and fingers, you can buy a jug of \"popcorn topping\" online. Drizzle this on top to taste after your popcorn is ready. As you might imagine, this is mostly hydrogenated fat, and not the best for your health. [13] X Research source These products may also contain diacetyl or other ingredients linked to respiratory problems and (less conclusively) to Alzheimer's, although these are only likely to cause harm over long periods of time. [14] X Research source"
    }
  ]
}