{
  "url": "https://www.wikihow.com/Make-a-GIF-in-WhatsApp",
  "title": "How To Make GIFs in WhatsApp: 2 Ways on Android and iPhone",
  "steps": [
    {
      "title": "Tap a chat on your WhatsApp Chats list.",
      "content": "Tap a chat on your WhatsApp Chats list. Find the chat you want to send a GIF to, and tap on the chat's name to open the conversation. You can create and send GIFs in one-on-one chats as well as in group messages ."
    },
    {
      "title": "Tap the + at the bottom-left.",
      "content": "Tap the + at the bottom-left. This opens your attachment options. [1] X Research source If you'd rather send a GIF that already exists instead of creating one yourself, just tap the sticker icon, select GIF , and then search for a GIF. [2] X Research source Select a GIF and tap the send button!"
    },
    {
      "title": "Select Photo & Video Library on the pop-up menu.",
      "content": "Select Photo & Video Library on the pop-up menu. This will open your phone or tablet's camera roll. You can make a GIF from a video you recorded on your iPhone if you'd like. You may also download a video from the web and convert it to a GIF in WhatsApp."
    },
    {
      "title": "Find and tap the video you want to convert into a GIF.",
      "content": "Find and tap the video you want to convert into a GIF. This will open the selected video in WhatsApp's video editor."
    },
    {
      "title": "Trim your GIF on the video timeline at the top.",
      "content": "Trim your GIF on the video timeline at the top. If your video is longer than 6 seconds, you'll need to trim it short enough to send as a GIF. [3] X Research source You can hold down and drag the icons on each end of the video timeline at the top and trim your video."
    },
    {
      "title": "Tap GIF at the top.",
      "content": "Tap GIF at the top. You'll see this next to the video camera below the timeline at the top of the screen. The camera icon will slide into a \" GIF \" icon. This means your video is now converted into a GIF. [4] X Research source The GIF option will look white-on-blue when selected."
    },
    {
      "title": "Tap the Send button.",
      "content": "Tap the Send button. It looks like a white paper plane on a blue button. You can find it in the lower-right corner of your screen. It will send your GIF to the selected chat. [5] X Research source"
    },
    {
      "title": "Tap a chat in your WhatsApp Chats list.",
      "content": "Tap a chat in your WhatsApp Chats list. You can tap any chat here to open the conversation and send your GIF here, including group messages . You can make a GIF from a video you recorded on your Android if you'd like. You may also download a video from the web and convert it to a GIF in WhatsApp."
    },
    {
      "title": "Tap the white icon on the right side of the \"Message\" field.",
      "content": "Tap the white icon on the right side of the \"Message\" field. [6] X Research source WhatsApp also makes it easy to find and send existing GIFs from within the app. In a chat, tap the Emoji icon, select GIF , and then search for the GIF you want to send. Select a GIF and tap the send button! [7] X Research source"
    },
    {
      "title": "Tap Gallery on the pop-up menu.",
      "content": "Tap Gallery on the pop-up menu. This option looks like a picture icon on a purple button. It will open your camera roll on a new page. [8] X Research source"
    },
    {
      "title": "Tap the video you want to convert into GIF.",
      "content": "Tap the video you want to convert into GIF. Find the video you want to make into a GIF, and tap on the video thumbnail to open it in WhatsApp's video editor."
    },
    {
      "title": "Trim your GIF on the timeline.",
      "content": "Trim your GIF on the timeline. Because GIFs can't be longer than 6 seconds, you'll probably need to trim your video down to size. Hold down and drag the blue trim heads on each side of the video timeline above, and trim your GIF animation."
    },
    {
      "title": "Tap GIF at the top.",
      "content": "Tap GIF at the top. You'll see this next to the video camera below the timeline at the top of the screen. The camera icon will slide into a \" GIF \" icon. This means your video is now converted into a GIF. [9] X Research source"
    },
    {
      "title": "Tap the Send button.",
      "content": "Tap the Send button. It looks like a white paper plane on a green button in the lower-right corner of your screen. This will send your GIF to the selected chat as a new message. [10] X Research source"
    }
  ]
}