{
  "url": "https://www.wikihow.com/Log-In-to-Gmail",
  "title": "4 Simple Ways to Log Into Your Gmail Account: Computer + App Guide",
  "steps": [
    {
      "title": "Open the Gmail login website in your browser.",
      "content": "Open the Gmail login website in your browser. This method will work on any computer, including your PC, Mac, or Chromebook. You can use any web browser, such as Chrome , Safari, or Firefox, to sign in to Gmail. [1] X Research source If an inbox automatically opens after visiting the website, click the profile icon in the top-right corner, then click Sign out . [2] X Research source Click Use another account if you see a list of saved accounts. You can also remove a saved account by clicking Remove an account then the minus symbol to the right of the email. [3] X Research source You can also use the regular Google website to log into Gmail. Go to the Google website , click Sign in , and enter your login information. Once you're on the homepage, click Gmail in the top-right corner."
    },
    {
      "title": "Enter your Gmail email address.",
      "content": "Enter your Gmail email address. In the text field that appears, type in your Gmail email address. If you don't have a Gmail account, you can make a new one by clicking Create account ."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's below the text box."
    },
    {
      "title": "Enter your Gmail account password.",
      "content": "Enter your Gmail account password. Type in the password you use to log into your Gmail account. Click the eye icon to toggle the password visibility. If you don't remember your password, you'll need to reset or recover it . Click Forgot password? to begin the process."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's below the password text box."
    },
    {
      "title": "Wait for your Gmail inbox to load.",
      "content": "Wait for your Gmail inbox to load. This should take only a few seconds. If you have two-factor authentication turned on, you'll need to follow the on-screen instructions to verify your device. You'll now be able to use Gmail ."
    },
    {
      "title": "Add another account (optional).",
      "content": "Add another account (optional). If you want to sign into another Gmail account without signing out of your current one, click your profile picture in the top-right corner. [4] X Research source Click Add account , and then repeat the sign-in process. If you want to link an email address from another provider, you can add an account to your Gmail ."
    },
    {
      "title": "Sign into Gmail when setting up your Android.",
      "content": "Sign into Gmail when setting up your Android. Since Android phones and tablets use Google Accounts as your default sign-in method, you'll need to sign into Gmail when initially setting up your Android. This also means that, while you can add extra accounts to Gmail on your Android, you can't sign in and out of your primary account without factory-resetting your Android . To set up your Android, turn it on. Enter your Gmail address when prompted. Tap Next , then enter your Gmail password. Tap Next . Follow any additional on-screen instructions."
    },
    {
      "title": "Open the Gmail app.",
      "content": "Open the Gmail app. This looks like a multicolored M . This will open your default Google Account's Gmail inbox."
    },
    {
      "title": "Tap your profile picture.",
      "content": "Tap your profile picture. You can find this at the top-right corner of the screen. [5] X Research source A pop-up window will open."
    },
    {
      "title": "Tap Add another account.",
      "content": "Tap Add another account . This will be below your current Google account. [6] X Research source"
    },
    {
      "title": "Tap Google.",
      "content": "Tap Google . Google's Sign In page will open within the app."
    },
    {
      "title": "Enter your email and tap Next.",
      "content": "Enter your email and tap Next . If you forgot your email, you can tap Forgot email? below the field to start the process of finding it."
    },
    {
      "title": "Enter your password and tap Next.",
      "content": "Enter your password and tap Next . You can check the Show password box to toggle the password's visibility. You'll need to agree to Google's Terms of Service."
    },
    {
      "title": "Tap I agree when prompted.",
      "content": "Tap I agree when prompted. Doing so will take you to your Gmail inbox, which should load after a few seconds. You can now send emails using your added email address."
    },
    {
      "title": "Open the Gmail app.",
      "content": "Open the Gmail app. This looks like a multicolored M . [7] X Research source Gmail is available for iOS in the App Store ."
    },
    {
      "title": "Tap Sign In.",
      "content": "Tap Sign In . This is at the very bottom of the screen. If you're already logged into an account, tap the profile picture in the top-right corner, then tap Add another account ."
    },
    {
      "title": "Tap Google.",
      "content": "Tap Google . If you have another email provider you want to link, you can tap their name. A pop-up window will open."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . Google's Sign In page will open within the app."
    },
    {
      "title": "Enter your email and tap Next.",
      "content": "Enter your email and tap Next . If you forgot your email, you can tap Forgot email? below the field to start the process of finding it."
    },
    {
      "title": "Enter your password and tap Next.",
      "content": "Enter your password and tap Next . You can check the Show password box to toggle the password's visibility."
    },
    {
      "title": "Wait for Gmail to load.",
      "content": "Wait for Gmail to load. This should take only a few seconds. If you have two-factor authentication turned on, you'll need to follow the on-screen instructions to verify your device. If you want to sign into another Gmail account without signing out of your current one, tap your profile picture in the top-right corner, then Add another account . Repeat the sign-in process. [8] X Research source"
    },
    {
      "title": "Open the Settings app on your iPhone or iPad.",
      "content": "Open the Settings app on your iPhone or iPad. Tap the Settings app icon, which resembles a grey box with gears on it. [9] X Research source"
    },
    {
      "title": "Tap Apps.",
      "content": "Tap Apps . If you have an older version of iOS, skip this step."
    },
    {
      "title": "Tap Mail.",
      "content": "Tap Mail . You may need to scroll to find this. It's next to an icon of a white envelope with a blue background. [10] X Research source"
    },
    {
      "title": "Tap Mail Accounts.",
      "content": "Tap Mail Accounts . This is near the top of the page."
    },
    {
      "title": "Tap Add Account.",
      "content": "Tap Add Account . If you have existing emails linked to the Mail app, you'll see them listed under the Accounts header. [11] X Research source"
    },
    {
      "title": "Tap Google.",
      "content": "Tap Google . This is in the middle of the page. Google's Sign In page will open within the app."
    },
    {
      "title": "Enter your Gmail email address and tap Next.",
      "content": "Enter your Gmail email address and tap Next . In the text field that appears, type in the email address for your Gmail account."
    },
    {
      "title": "Enter your Gmail account password and tap Next.",
      "content": "Enter your Gmail account password and tap Next . Type in the password you use to log into Gmail. You can check the Show password box to toggle the password's visibility. If you have two-factor authentication turned on, you'll need to follow the on-screen instructions to verify your device."
    },
    {
      "title": "Select features to sync.",
      "content": "Select features to sync. Tap the white switch next to an option (e.g., \"Notes\") to turn it on for this email account, or tap the green switch next to an option to turn it off."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It's in the top-right corner of the screen. Doing so will save your changes and add the Gmail account to your iPhone's Mail app. You can now find your Gmail inbox in your device's Mail app on the Inboxes page."
    }
  ]
}