{
  "url": "https://www.wikihow.com/Make-Potato-Wedges",
  "title": "How to Make Potato Wedges",
  "steps": [
    {
      "title": "Choose a firm, high or medium starch potato.",
      "content": "Choose a firm, high or medium starch potato. High-starch potatoes (like russets and most sweet potatoes, including the jewel yam) are highly absorbent with a light, fluffy texture. Medium-starch or all-purpose potatoes (such as Yukon Gold, red gold, white, blue, and purple potatoes) have more moisture than high-starch potatoes and are less likely to fall apart. Potatoes should feel firm and heavy. Look out for green spots, wrinkles, sprouts, blemishes and soft spots--these are signs of a bad or bitter potato. If you are using potatoes you already have at home and discover a green spot, make sure you chop it off an discard it. The green parts of a potato are mildly poisonous and will upset your stomach. Store your potatoes in a cool, dry space. Try not to store them anywhere too cold (like the refrigerator), as the starches will begin turning into sugar, which will alter the taste."
    },
    {
      "title": "Scrub the potatoes with cool water and a vegetable brush.",
      "content": "Scrub the potatoes with cool water and a vegetable brush. Potatoes grow in the dirt and, though they are rinsed before you buy them, dirt may still be hiding in the little dimples (or \"eyes\") on the potato. Don't scrub so hard that the skin begins to peel off. Be gentle with your potato. Even organic foods are treated with pesticides, so be on the safe side and make sure you're washing all your organic produce, too. [1] X Research source You don't need to use a special solution of veggie wash to clean the potato--running water should do the job. [2] X Research source"
    },
    {
      "title": "Cut the potato in half lengthwise, then cut those halves into thirds.",
      "content": "Cut the potato in half lengthwise, then cut those halves into thirds. This will give you six wedges per potato. [3] X Research source Try to cut the wedges into equal sizes so they all bake at the same rate. If you have a mixture of thick and thin wedges, the thin ones may burn while you wait for the thick wedges to bake all the way through. [4] X Research source Six wedges per-potato should give you a thick, but not too thick, slice. If wedges are any thicker, they may be crispy and gold on the outside, but completely underdone inside. [5] X Research source If you are not baking the potato wedges right away (if you have to prep the rest of your meal or wait for the oven to preheat), put them in a bowl of cold water with a squirt of lemon juice or vinegar. This will prevent discoloration. Don't let the potatoes soak in the bowl for longer than two hours--the potatoes will absorb the water and may begin to lose some of their vitamins. You may peel the potatoes before slicing if you don't want to eat the skin, but they may not hold their shape as well when you bake them. The skins are more vitamin-rich than the flesh, so the potato would lose some of its nutritional value without it. [6] X Research source"
    },
    {
      "title": "Put sliced potatoes, salt, pepper, and oil in a large bowl and toss with your hands.",
      "content": "Put sliced potatoes, salt, pepper, and oil in a large bowl and toss with your hands. The oil will help the spices stick to the potatoes. [7] X Research source Make sure the spices and oil are distributed evenly and your wedges are fully coated. Make sure your hands are clean before handling the food. If you want to add additional flavors--like minced garlic, chopped rosemary leaves, spicy cumin, or thyme--add it to the bowl and mix with the rest of the ingredients."
    },
    {
      "title": "Preheat the oven",
      "content": "Preheat the oven to 425 °F (220 °C). Position a rack on the middle or lower level of the oven. [8] X Research source If your oven runs a little cool, use the lower rack so the wedges get hot enough to crisp. If your oven tends to over-bake things, use the middle rack instead. If you are baking sweet potatoes, make sure you have a rack on the middle or upper level of the oven, to prevent the starch from caramelizing too quickly and burning your wedges. [9] X Research source"
    },
    {
      "title": "Spread the potato wedges evenly over a baking sheet lined with foil or parchment.",
      "content": "Spread the potato wedges evenly over a baking sheet lined with foil or parchment. Make sure your wedges are only a single layer deep, not piled on top of each other. Piling and crowding the potatoes on the pan will cause them to steam, not roast, and they will end up soft and soggy. [10] X Research source If you are worried about your potatoes sticking to the lining, use non-stick spray or drizzle with a little extra olive oil. The oil on the potatoes should keep them from sticking, but take this extra step if you want to. Lay the potatoes so that one of the cut sides is flat against the pan, with the other cut side exposed. Wedges should not be on their backs (the side with the skin), with the entire cut part (or the flesh of the potato) exposed. [11] X Research source"
    },
    {
      "title": "Roast for 25-30 minutes, turning potatoes to the other side after 15 minutes.",
      "content": "Roast for 25-30 minutes, turning potatoes to the other side after 15 minutes. [12] X Research source Use oven mitts to remove the pan and flip the potatoes with a spatula. You can burn your arms on the top of the stove if you try to reach in and flip the potatoes without first removing the pan. If you are cooking two pans of wedges at once, make sure you change their positions on the rack when you turn the potatoes. The pan that was closer to the bottom should move to the higher rack, and vice-versa. This way both trays will bake evenly and should be done about the same time. [13] X Research source"
    },
    {
      "title": "Remove the potatoes when they are golden and crisp on the outside and tender on the inside.",
      "content": "Remove the potatoes when they are golden and crisp on the outside and tender on the inside. [14] X Research source You can pierce a wedge with a fork to see if it's done--the inside should be soft and offer no resistance to the fork. You can top the fries with additional salt or a garnish like chopped chives or parsley. Serve with a side of ketchup, hot sauce, lime and chipotle mayo, malt vinegar, or any other dipping sauce you'd like to try."
    }
  ]
}