{
  "url": "https://www.wikihow.com/Make-Internet-Explorer-Your-Default-Internet-Browser",
  "title": "How to Make Internet Explorer Your Default Internet Browser",
  "steps": [
    {
      "title": "Open the Start menu.",
      "content": "Open the Start menu. To do so, either click the Windows logo in the bottom-left corner of the screen, or press the ⊞ Win key."
    },
    {
      "title": "Click the settings gear.",
      "content": "Click the settings gear. This icon is in the lower-left corner of the screen. Doing so will open the Settings window."
    },
    {
      "title": "Click System.",
      "content": "Click System . It's in the top-right side of the Settings home page. If Settings opens to a subfolder, first click the Back button in the top-left corner of the window."
    },
    {
      "title": "Click Default apps.",
      "content": "Click Default apps . It's a tab on the left side of the window."
    },
    {
      "title": "Scroll down and click the option beneath the \"Web browser\" heading.",
      "content": "Scroll down and click the option beneath the \"Web browser\" heading. This will likely be Microsoft Edge, which resembles a white \"e\" on a dark-blue background."
    },
    {
      "title": "Click Internet Explorer.",
      "content": "Click Internet Explorer . It's the light-blue \"e\" icon. Doing so will set Internet Explorer as your computer's default browser. If prompted, click Switch anyway to confirm your decision."
    },
    {
      "title": "Open Internet Explorer.",
      "content": "Open Internet Explorer. This app resembles a blue \"e\" with a gold band around it."
    },
    {
      "title": "Click ⚙️.",
      "content": "Click ⚙️. It's in the upper-right corner of the Internet Explorer window."
    },
    {
      "title": "Click Internet options.",
      "content": "Click Internet options . This option is near the bottom of the drop-down menu."
    },
    {
      "title": "Click the Programs tab.",
      "content": "Click the Programs tab. It's at the top of the Internet Options window."
    },
    {
      "title": "Click Make default.",
      "content": "Click Make default . It's near the top of the Internet Options window, beneath the \"Default web browser\" heading. If this button is greyed out, Internet Explorer is already your default browser."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This button is at the bottom of the Internet Options window. Internet Explorer is now your default browser. You may have to close and re-open Internet Explorer before these changes take full effect."
    }
  ]
}