{
  "url": "https://www.wikihow.com/Improvise-a-Small-Bandage",
  "title": "How to Improvise a Small Bandage",
  "steps": [
    {
      "title": "Apply pressure to the wound with a cloth.",
      "content": "Apply pressure to the wound with a cloth. You can use a rag, towel, shirt, or any other fabric you have handy. This will help clot the wound and stop bleeding . You can also raise the wound above your head to slow bleeding. [1] X Research source"
    },
    {
      "title": "Clean the wound.",
      "content": "Clean the wound. It is important to make sure that the wound is clean before you apply the bandage, or else you are at risk of infection. Rinse the dirt from the injured area with clean water, but do not scrub. Dab the wound in a circular motion moving from the center of the wound out towards the edges. Remove any visible dirt or objects. Water should be clean. Tap water, bottled water, or water that has been boiled and cooled are your best choices, but you can also use clear, running water, such as from a stream, if needed. Avoid cleaning the wound with stagnant or cloudy water. Do not pull out any objects deeply penetrating the skin. These may be stopping the bleeding, and by removing them, you risk more damage. Similarly, if an object does not wash away easily from the wound, do not pick at it to remove it; simply leave it. [2] X Research source Contrary to popular belief, urine is not sterile when it leaves the body. If you do not have access to water, you should not pee on the wound. Gently remove any dirt from the wound with your fingers and let your natural clotting properties work. Your body’s white blood cells will be more effective at killing bacteria. [3] X Research source"
    },
    {
      "title": "Disinfect the wound.",
      "content": "Disinfect the wound. If you do not have access to topical antibiotics, such as Bacitracin, there are a number of substitutes that work at killing bacteria around the wound and preventing germs from entering. Petrolatum (also known as petroleum jelly) can be rubbed over the wound to prevent bacteria from entering the cut. [4] X Research source Pine sap, honey, and sugar can help seal the wound. [5] X Research source You can also try using a saltwater solution. Use alcohols and strong antiseptics, such as rubbing alcohol (isopropyl alcohol), strong liquor (whiskey, bourbon, etc.), iodine, or hydrogen peroxide sparingly. There is conflicting evidence as to whether or not these hurt or help healing, but if you have a dirty wound, they may disinfect it initially. [6] X Research source"
    },
    {
      "title": "Pat dry the affected area after cleaning.",
      "content": "Pat dry the affected area after cleaning. This will help the adhesive stick. Be gentle around the injured area to prevent the wound from reopening."
    },
    {
      "title": "Cover the affected area with a cloth pad.",
      "content": "Cover the affected area with a cloth pad. This pad should cover not only the wound itself but the area around the wound. Gauze or a similar open weave fabric is ideal, but if those are not available, you can improvise with any clean cloth, including t-shirts, scarves, or towels. Ideal materials should not be made out of rough or fluffy material. [7] X Research source If you have no clean cloth or clothing but do have access to a heat source, such as a camping fire, boil and dry your clothing instead. If you have no access to a clean cloth and no way to boil your clothing, assess the extent of your wound. If it is in an area likely to be infected—such as your hands or feet—it is best to bandage it as best you can until you can reach medical aid. If not, you can use the cloth to staunch the bleeding but leave the wound unbandaged."
    },
    {
      "title": "Secure the gauze.",
      "content": "Secure the gauze. If you have tape or similar adhesive material, such as a sticker, gently pull it over the cloth. Ideally, the tape should be long enough to stretch over the cloth. Make sure no adhesive is touching the wound. If you do not have tape, you can use a strap, such as a long piece of cloth, ribbon, or cable. Tie it above the bandage pad to apply light pressure to the padding. [8] X Research source Be sure you are not constricting your circulation. Tape and wraps should be tight enough to hold the bandage in place but not so tight that your skin turns blue."
    },
    {
      "title": "Watch your wound closely and change your bandage every 12 hours.",
      "content": "Watch your wound closely and change your bandage every 12 hours. You may need to change your bandage more often if it becomes wet or dirty. Check your wound every day to make sure there are no signs of infection. When the wound is healed, you may remove the bandage."
    },
    {
      "title": "Assess the wound.",
      "content": "Assess the wound. If you have an open or gaping wound that needs closure, you may need a butterfly bandage. Butterfly bandages are ideal to close narrow gaping wounds by pulling the skin together so that it can heal. These bandages should not be used on wounds larger than 2 inches long (or 5 cm)."
    },
    {
      "title": "Cut one inch (or 2.5 cm) of adhesive tape.",
      "content": "Cut one inch (or 2.5 cm) of adhesive tape. Medical tape or a similar cloth-based tape is best. Clear cellulose tapes or thick metallic tapes are not ideal but may work in emergencies. [9] X Research source"
    },
    {
      "title": "Fold the tape back lengthwise.",
      "content": "Fold the tape back lengthwise. Pinch the ends of the tape between your index finger and thumb as you fold back. The sticky side of the tape should be facing out towards you."
    },
    {
      "title": "Cut out four small triangles near the center of the tape.",
      "content": "Cut out four small triangles near the center of the tape. There should be two triangles on either side of the tape. Leave about a pinky-sized space between the triangles. If you do it correctly, the triangles will form a small square of space. This will become the non-adhesive pad of the bandage. [10] X Research source"
    },
    {
      "title": "Fold the tape over between the notches.",
      "content": "Fold the tape over between the notches. The bandage should now resemble a butterfly or a dumbbell. The folded center should be non-sticky on both sides. This is the part that will lie directly over your wound."
    },
    {
      "title": "Apply the bandage.",
      "content": "Apply the bandage. With clean fingers, gently hold close the wound and stretch the bandage over it. The non-adhesive folded center should be directly over the wound. You do not want any part of the sticky bandage touching your wound."
    },
    {
      "title": "Apply as many bandages are necessary.",
      "content": "Apply as many bandages are necessary. There should be one inch or 3 cm between each bandage. The bandage does not need to cover the whole wound, so long as the wound is not bleeding. [11] X Research source"
    },
    {
      "title": "Locate a clean, washed tube sock or another sock with a long elastic leg.",
      "content": "Locate a clean, washed tube sock or another sock with a long elastic leg. You can use it as a compression bandage to reduce swelling or bleeding. [12] X Research source You want a sock that has at least a half-crew or mid-calf length leg. Ankle socks, heel socks, and no-shows will not work for this type of bandage. The leg should have strong elastic that has not been over-stretched. It should be tight when pulled over an arm or a leg."
    },
    {
      "title": "Cut the elastic leg off of the sock.",
      "content": "Cut the elastic leg off of the sock. You should cut just below the ankle or along the “foot-pit” of the sock. You can throw away the rest of the sock or recycle it."
    },
    {
      "title": "Cut a thumb hole.",
      "content": "Cut a thumb hole. If you are using this bandage for your hand or wrist, you may want a thumb-hole. Resting the sock lengthwise against your hand, mark where your thumb lies. Cut out a circle roughly one or two inches in diameter and try it on for size."
    },
    {
      "title": "Slide the sock over an arm or leg wound gently.",
      "content": "Slide the sock over an arm or leg wound gently. Try not to have the fabric rub against the wound as you do so; you may need to stretch out the sock with your fingers so that it is not touching the wound until it is in position."
    }
  ]
}