{
  "url": "https://www.wikihow.com/Levitate-Like-David-Blaine",
  "title": "How to Levitate Like David Blaine",
  "steps": [
    {
      "title": "Stand at an angle to your audience.",
      "content": "Stand at an angle to your audience. Make sure that your audience is at a 45-degree angle while watching you. [1] X Research source This trick relies on you positioning yourself so that your audience can only see one of your feet. The trick works because your audience will only be able to really see the foot nearest to the audience. With the right angle, the other foot is mostly blocked from view, except for maybe the heel. This trick works best with a small audience. If there are too many people you might not be able to find a good angle."
    },
    {
      "title": "Check your surroundings.",
      "content": "Check your surroundings. You need to make sure that nothing in your area is going to expose the illusion of your levitation. Make sure there are no reflective surfaces, like a mirror, that would show the side of your body you are hiding from the audience. It’s best to stand a few feet away from a wall or corner. Or, outside in an open space."
    },
    {
      "title": "Stand at a distance.",
      "content": "Stand at a distance. The closer your audience is to you, the harder it will be to hide your back foot. Stand about 8-10 feet away from everyone to achieve the best illusion. If the audience is too close, then someone might have a viewing angle that exposes the fact that your back foot is still on the ground."
    },
    {
      "title": "Position your feet together.",
      "content": "Position your feet together. Place your feet together or leave about 2 centimetres (0.79 in) if space between. Giving yourself a bit of space between your feet might help you with balancing. Make sure to line up your toes and heels. You don’t want one foot more forward than the other."
    },
    {
      "title": "Shift your weight.",
      "content": "Shift your weight. Slightly shift your weight to the foot hidden from the audience. [2] X Research source You will be balancing on this leg, but the trick is to do so without being obvious. Otherwise, the illusion of floating will be ruined. As you shift your weight feel free to explain that you are about to perform a levitation. By talking to your audience, you can divert attention to your face and off of your feet. You can be as creative as you want when explaining your levitation. Perhaps you spin a tale of studying Buddhism in a monastery in the mountains. Through your meditation, you learned the art of levitation."
    },
    {
      "title": "Slowly begin raising your arms.",
      "content": "Slowly begin raising your arms. Don’t lift your foot just yet. Raising your arms will give you an upward motion that will make it look like you are about to float. By raising your arms slowly before lifting your feet, you draw your audience’s focus up and away from your feet. You also start building suspense. Move your arms slowly and feel free to go up and down as if you’re trying to draw air upward. Think of this motion like a bird flapping its wings in slow motion. Let your upper body rise and fall with your arms for more effect."
    },
    {
      "title": "Raise your audience facing foot.",
      "content": "Raise your audience facing foot. Slowly begin to raise the foot a little off the ground to begin floating. [3] X Research source You can start to raise it and then put it back down for more suspense, or if you need to adjust your balance. Raise your front foot about 1 inch (25 mm) off the ground. If you raise it too high you will expose your back foot and ruin the illusion. As you raise your foot, angle the edge of it facing the audience down slightly to keep a cover over your back foot. Even though you will be wearing shoes, extend and point your toes upward."
    },
    {
      "title": "Lift the heel of your back foot.",
      "content": "Lift the heel of your back foot. As you balance and raise your audience facing foot a little higher, come off the heel of your back foot. Try to balance on the outside edge of your back foot, near the ball. Raise the toes of your back foot as well. By raising your heel and toes you allow space underneath most of your back foot. This will help the illusion to be more convincing, especially if the audience has any view of both feet."
    },
    {
      "title": "Keep the levitation short.",
      "content": "Keep the levitation short. Balancing on such a small part of your foot may cause you to wobble and the longer you hold the levitation, the more the illusion will fade. This trick has the biggest effect when it’s over quickly. You want to show your audience that you can float, but you don’t want to give anyone enough time to get a really good look at what you’re doing. Perform the trick for maybe 5-10 seconds before coming down."
    },
    {
      "title": "Start lowering your arms.",
      "content": "Start lowering your arms. Begin lowering your arms before you put your foot down to divert your audience’s attention away from your feet. Just as you did you when you were starting your levitation, move your arms down and up slightly as if you’re floating down. Keeping your arms out will also help you keep your balance and not put your foot down too quickly."
    },
    {
      "title": "Bring your feet back down.",
      "content": "Bring your feet back down. As you begin to lower your front foot you can also plant your back foot more firmly on the ground for support. Keep your arms moving and don’t rush. You want to slowly lower your foot rather than just stomping it down to keep the illusion up. Slowly lowering it will make you like you’re controlling your descent instead of just shifting your weight back."
    },
    {
      "title": "Dress it up a bit with by bending your knees slightly.",
      "content": "Dress it up a bit with by bending your knees slightly. When you make contact with the ground you can then make bend your knees and give your landing some impact. Hitting the ground with a tiny bit of force will give the illusion of landing back on the ground rather than just putting your foot down. Giving your landing some weight will also help you disguise shifting your balance back. Note that after you are done levitating and have both feet on the ground, slowly lower your toes while bringing down your arms."
    }
  ]
}