{
  "url": "https://www.wikihow.com/Make-a-Great-Student-Council-Campaign",
  "title": "How to Make a Great Student Council Campaign",
  "steps": [
    {
      "title": "Be consistent about who you are throughout the campaign.",
      "content": "Be consistent about who you are throughout the campaign. It won't help if you suddenly change the way you dress or act; people (especially people your age) can smell a phony and won’t react well to your obvious and sudden effort to be cool. What you can do is enhance that existing you, and ensure that it displays an aura of fairness, eloquence, transparency, and council-material. [1] X Research source Be kind to all students instead of being good to only the popular ones. Show responsibility in class and answer questions. It will make other students look up to you."
    },
    {
      "title": "Find out what people actually want.",
      "content": "Find out what people actually want. Do some informal polling (get friends to help if you can) to find out if people want a new vending machine by the gym, a different lunch item in the cafeteria, another dance added to the calendar, etc. A clever campaign won’t do much for you if you have nothing to bring to the table."
    },
    {
      "title": "Think up a few catchy campaign slogans.",
      "content": "Think up a few catchy campaign slogans. Don't just write \"Vote for Mario\" on a poster and hang it above a drinking fountain. That's not going to help much. Think of something clever that will distinguish you from the other candidates. [2] X Research source Check the internet for really funny ones, use your name to riff off a known slogan (“Got Malcolm?”), or have your friends help you create something from scratch. Be sure to mention your core issue either in your slogan (for example, “A diamond is forever. A drinking fountain by the library ain’t going anywhere for a while, either.”) or on your posters or flyers. [3] X Research source"
    },
    {
      "title": "Produce eye-catching posters with compelling graphics.",
      "content": "Produce eye-catching posters with compelling graphics. There are many ways to construct a poster, but you can do amazing things with Microsoft Office Publisher or a digital editing program like Adobe Photoshop (or one of its free alternatives like Pixlr or GIMP). [4] X Research source Vary the size of your posters. Big ones go in the cafeteria, gymnasium, and other school hot spots. Smaller (letter size) posters can be posted on bulletin boards and distributed by hand."
    },
    {
      "title": "Have a clear, catchy headline.",
      "content": "Have a clear, catchy headline. This is the most important part of the poster and should both stand out immediately and be visible from a distance. (Be sure to test the line of sight from various places around the poster.) If you’ve come up with a good campaign slogan, this should be the headline. [5] X Research source Unless you’ve come up with a clever series of clearly interrelated slogans in the same theme, stick with just one. Repetition is key for being memorable, and being memorable is key for winning."
    },
    {
      "title": "Make your name very visible.",
      "content": "Make your name very visible. Second to the headline, your name should be the most visible thing on the poster. (Slogan first: remember, your campaign should be about issues.) If one of your running mates has a similar first or last name, make extra sure your posters are a different style from his/hers and/or include a nickname. [6] X Research source"
    },
    {
      "title": "Consider adding a photo of yourself.",
      "content": "Consider adding a photo of yourself. If people come to associate your face with your slogan, just walking around campus will suddenly become free advertising for you. However, you might only want to add photos on large posters in high-up places to avoid vandalism (not to mention higher printing costs)."
    },
    {
      "title": "Keep it simple.",
      "content": "Keep it simple. The people at your school have enough reading to do as it is, so don’t hand out essays for them to slog through. Make your flyers and posters skimmable by bolding/highlighting keywords. Use bright, visible colours and avoid small, complicated, or numerous fonts."
    },
    {
      "title": "Avoid targeting a specific gender or demographic.",
      "content": "Avoid targeting a specific gender or demographic. Unless you think that a certain group will be key to your success (such as if there are several viable candidates with roughly even numbers and tapping into one group at school might give you an advantage), don’t make your aim too narrow. A sports-heavy theme might get the athletes on your side, but it will also exclude the average student, not to mention other clubs like band, glee, poetry, chess, etc. [7] X Research source"
    },
    {
      "title": "Hang posters up around your school.",
      "content": "Hang posters up around your school. Once you've settled on a few slogans that summarize your political platform, you could also make buttons and put decorations on your posters you need to disseminate those slogans to the electorate. [8] X Research source Put your posters up as soon as possible. Getting a head start is important because it will separate you from everyone else. It also gives you a chance to claim creative ideas or important issues for your campaign before anyone else does."
    },
    {
      "title": "Keep your speeches interesting.",
      "content": "Keep your speeches interesting. When you give your speech(es), focus on the issues and let your funny running mate provide the crack-ups. You might even want to do a joint speech where each time you cover a talking point, your friend chimes in with a joke. This back-and-forth will get people to pay attention and make your campaign more memorable. [9] X Research source Read samples of other speeches to get a general knowledge of what should be in them. Humor is a good tactic, of course, but don’t overlook the important issues in your campaign. Pay attention to the words you use. Be persuasive, be clever, set the agenda, don't be arrogant, and don't brag. For example, instead of saying, \"I'm a creative person,\" say, \"I value creativity.\" A good closing sentence is also important. The last thing you say is what most people will remember. And don't forget to end your speech with a \"Thank you.\" Improve your public speaking skills by joining an after-school club or a debate or oral communications class. [10] X Research source"
    },
    {
      "title": "Memorize your speech; the confidence this will add to your recitation will go a long way in making people listen.",
      "content": "Memorize your speech; the confidence this will add to your recitation will go a long way in making people listen. Practice it in front of your friends, teachers, and family members. You can even practice in front of a mirror. [11] X Research source"
    },
    {
      "title": "Vary the tone of your voice to emphasize keywords.",
      "content": "Vary the tone of your voice to emphasize keywords. Just because you memorized your speech thoroughly doesn't mean you should rattle it off in a coma-inducing monotone. In fact, being really familiar with your speech should allow you to read it confidently and with natural pauses and inflexions, as though you’re coming up with it on the spot."
    },
    {
      "title": "Be prepared to answer questions after your speech.",
      "content": "Be prepared to answer questions after your speech. Try to anticipate what people will ask. Things you might be asked include: Why are you running? What makes you different than the other candidates? How can you deliver on what you’re promising? Remember to have answers sorted out in your mind already."
    }
  ]
}