{
  "url": "https://www.wikihow.com/Make-Blue-Eyes-Pop",
  "title": "How to Make Blue Eyes Pop",
  "steps": [
    {
      "title": "Apply concealer under your eyes.",
      "content": "Apply concealer under your eyes. Blue eyes can easily get lost in dark undereye circles, and this is especially noticeable with a natural look. Apply concealer around and under your eyes to put the focus on them, not your circles! [1] X Research source Try using a salmon-colored concealer to hide the bluish tones in your skin. If you only need light coverage, dot the concealer along your undereye, then blend with your fingers or a makeup sponge. If you have very dark circles, apply a layer of concealer in an inverted triangle shape under your eye. The point of the triangle should be about level with the apples of your cheeks. Blend it with your fingers or a makeup sponge. It should blend into your face makeup and up to the corners of your eye."
    },
    {
      "title": "Put on beige or light gold eyeshadow.",
      "content": "Put on beige or light gold eyeshadow. Colors with warm tones complement blue eyes. For a natural look, pick a beige, light gold, or a similar light neutral eyeshadow. Blend it in lightly over your eyelid with an eyeshadow brush. You want enough to contrast with your eyes, but not enough to look obvious from a distance."
    },
    {
      "title": "Use light-colored eyeliner.",
      "content": "Use light-colored eyeliner. Pick a light eyeliner in white, beige, light gold, or a similar light neutral color. The light color will help your eyes look bigger without looking like you’re wearing heavy makeup. You can use liquid, pencil, or gel eyeliner, but pencil is best for a more natural look. Line your eyes lightly on both the top and bottom lids. [2] X Research source"
    },
    {
      "title": "Highlight both corners of your eyes.",
      "content": "Highlight both corners of your eyes. Adding a little shimmer to both corners of your eyes will make them look bigger and highlight their beautiful color. You can use pencil eyeliner, liquid or powder eyeshadow, or highlighter, as long as it’s a very light, shimmery color. Dab the color gently on each inner corner, then blend with your fingers or a small makeup brush. [3] X Research source If your eyes are gray-blue, try a color with pink tones. Bright, dark, or purple blues will really pop with a gold or copper-toned highlighter. If you are going for something very natural, try white or ivory for light skin, and rose gold for darker skin. Use a very small amount and blend it thoroughly."
    },
    {
      "title": "Curl your eyelashes.",
      "content": "Curl your eyelashes. Curling your eyelashes will make your eyes appear bigger and more open. Line up your upper lashes with your eyelash curler, then hold it closed for 10-15 seconds. [4] X Research source Don’t put on mascara before you curl! The mascara can stick to the curler and pull lashes out, or even break them."
    },
    {
      "title": "Use black or brown mascara.",
      "content": "Use black or brown mascara. Black or brown mascara can help make the blue in your eyes pop, especially if you have dark hair. Use one or two layers on your upper lashes, and one on your lower lashes."
    },
    {
      "title": "Choose warm-toned or purple eyeshadow.",
      "content": "Choose warm-toned or purple eyeshadow. For blue eyes, anything with warm tones will look great! You don’t have to wear bright colors--browns, golds, coppers, and bronzes are also warm tones. Warm hues of purple, like eggplant and plum, are also very flattering for blue eyes because their reddish tones bring out blues. If you have dark blue eyes, try a bright metallic color. Pink-toned purples and golds look great on gray-blue eyes. Avoid blue or blue-toned shadows like turquoise, indigo, and periwinkle--they can make your eyes look washed-out! Gray eyeshadow can also make your blue eyes pop."
    },
    {
      "title": "Apply the shadow to your eyelid.",
      "content": "Apply the shadow to your eyelid. Use an eyeshadow brush to apply the shadow across your entire eyelid. If you want a more dramatic, bolder look, layer it on or even try blending two or more colors in the same family. [5] X Research source"
    },
    {
      "title": "Add a shimmery shadow to your eyelid crease and both corners.",
      "content": "Add a shimmery shadow to your eyelid crease and both corners. Choose a shimmery shadow and brush it onto your eyelid creases and both inner corners of your eye. You can choose any shimmery color you want, but warm metallics will look great with blue eyes. [6] X Research source"
    },
    {
      "title": "Try a bold eyeliner.",
      "content": "Try a bold eyeliner. A bold eyeliner will bring out your blue eyes. You can try a gold eyeliner, black eyeliner, or dark purple eyeliner. Liquid eyeliner is best for a bold look, but you can also use pencil or gel liner. Gently and carefully line along your upper and lower eyelids. If you have trouble with liquid eyeliner, try dotting it along your eyelids, then connecting the dots."
    },
    {
      "title": "Layer your mascara.",
      "content": "Layer your mascara. Brown mascara will look great with blue eyes, but black or even blue mascara will make them pop too! When you put mascara on, try putting on two or three layers on your top lashes and one or two on your bottom lashes to really emphasize your eyes. The best way to put on multiple layers is to wait a few seconds between each layer. If your mascara gets clumpy, gently pinch the clump with your fingers and pull it out You can also use false eyelashes for an even more dramatic look."
    },
    {
      "title": "Put on bright lipstick.",
      "content": "Put on bright lipstick. A bold lipstick in a warm color will provide a startling contrast with your blue eyes. A classic red is a great choice, but any warm-toned red, pink, orange, or brown will look great. Avoid cool-toned lipsticks like blue, purple, and black--these can wash out your eyes."
    },
    {
      "title": "Choose blue shades that complement your eye color.",
      "content": "Choose blue shades that complement your eye color. A blue outfit can draw attention to your eyes, but the wrong shade of blue for your eye color can wash them out. A good rule of thumb is to avoid dull blues, neon blues, and blues that match the exact color of your eyes. [7] X Research source If you have green-blue eyes, avoid turquoise or aqua blues--they’ll overwhelm your eyes. Try purple blues. If your eyes are gray-blue, try a baby blue. Bright blue eyes will look amazing in a royal blue outfit. Navy blue looks good with any color blue eyes."
    },
    {
      "title": "Avoid warm-toned clothes.",
      "content": "Avoid warm-toned clothes. If you have blue eyes, you most likely have a cool-toned complexion. Warm-toned clothing can clash with cool-toned skin. Avoid oranges, reds, and yellows so you don't distract from your eyes."
    },
    {
      "title": "Use gold, brown, or copper accessories.",
      "content": "Use gold, brown, or copper accessories. Jewelry, hair clips, hats, and scarves in browns, oranges, and warm metallics will draw attention to your blue eyes--especially if they’re near your face! They're a great option if you'd rather not wear an entire orange-toned outfit. [8] X Research source If you wear glasses, consider getting gold or tortoiseshell frames to bring out the blue in your eyes. Try a gold hair clip near your face to bring out your eyes. An orange or rust-colored scarf will draw attention to your eyes."
    },
    {
      "title": "Add small pops of blue to your outfit.",
      "content": "Add small pops of blue to your outfit. Adding touches of blue to your outfit will draw even more attention to your eyes. Try wearing blue jewelry, shoes, or bags. You can also pick clothes that have blue patterns or stripes. Turquoise jewelry is a great way to bring in a little blue."
    },
    {
      "title": "Try wearing all black.",
      "content": "Try wearing all black. An all-black outfit can give you a dramatic flair that draws attention to the only spot of color on you--your beautiful blue eyes! This look works especially well with bold, dramatic eye makeup. [9] X Research source This look is best for those with light, bright, green, or purple-blue eyes. Gray and dark blue eyes can be lost in all black. If you don't want to wear an all-black outfit, try wearing a black hat or scarf to frame your face."
    },
    {
      "title": "Get bangs to draw attention to your eyes.",
      "content": "Get bangs to draw attention to your eyes. A great way to draw attention to your eyes is to cut your hair into bangs--people will follow your hair right to your eyes. Cutting them level with your brow line will give your eyes enough space and will keep your hair framing them. Be sure to get your bangs regularly trimmed. Nobody will notice your blue eyes if your hair’s in the way!"
    },
    {
      "title": "Try a short haircut to emphasize your eyes.",
      "content": "Try a short haircut to emphasize your eyes. A short, dramatic hairstyle like a pixie cut or a bob will draw attention to your face and put more emphasis on your eyes. Talk to your stylist about what short haircut will look best on you. [10] X Research source"
    },
    {
      "title": "Layer your hair around your face.",
      "content": "Layer your hair around your face. If you’d rather keep your hair long, consider cutting it in layers around your face. This will draw attention to your eyes by visually leading people to your face."
    },
    {
      "title": "Part your hair to the side.",
      "content": "Part your hair to the side. You don’t have to cut your hair to bring out your blue eyes. Parting your hair far to one side will create a line from the top of your head all the way down the side of your face. This will draw people towards your eyes! [11] X Research source"
    },
    {
      "title": "Pick a complementary hair color.",
      "content": "Pick a complementary hair color. You have lots of hair color options for blue eyes. If you want to go for a more natural look, anything with warm tones will emphasize blue eyes. Reds, auburns, blondes, and chestnut browns all set off blue eyes dramatically. Black hair is a great choice for cooler skin tones. If you want a non-natural color, avoid blues and greens. Your eyes can get lost in them. Try pinks, purples, or rose gold instead."
    }
  ]
}