{
  "url": "https://www.wikihow.com/Get-Your-Cat-to-Stop-Hissing",
  "title": "How to Get Your Cat to Stop Hissing",
  "steps": [
    {
      "title": "Understand why cats hiss.",
      "content": "Understand why cats hiss. Cats don't usually hiss to show dominance or threaten other animals. They usually hiss when they feel vulnerable, frightened, or in pain. [1] X Research source However, cats may still hiss out of aggression. Either way, trying to punish a cat for hissing will only make it more upset, and likely to hiss even more. When a cat is being aggressive, it is more likely to growl or yowl. Give your cat some space until you figure out why he is hissing. [2] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Recognize the signs of aggression.",
      "content": "Recognize the signs of aggression. Though every cat behaves differently, there are some characteristics that will almost always accompany hissing if the behavior is a sign of aggression. Swatting or scratching with the front paws. [3] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Biting people or other animals. [4] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Growling, shrieking, or yowling. [5] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Barring teeth and/or claws. [6] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Look for recent changes.",
      "content": "Look for recent changes. Have you moved your cat into a new home or apartment? Have you introduced a new pet to the household? What about a new roommate? Have you changed the arrangement of furniture? Any of these could cause your cat to feel \"off,\" and it's possible your cat's fear or confusion could be expressed through hissing. [7] X Research source"
    },
    {
      "title": "Consider a trip to the vet.",
      "content": "Consider a trip to the vet. If your cat is hissing and there haven't been any changes in his environment or his temperament, he may be hissing because he is in pain. Consider taking your cat in for a visit with your veterinarian. [8] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Allow your cat to adjust.",
      "content": "Allow your cat to adjust. Whether you've gotten a new pet, or undergone a recent move, your cat will probably need some time to adjust to his new surroundings."
    },
    {
      "title": "Introduce new pets in a controlled environment.",
      "content": "Introduce new pets in a controlled environment. It may be a good idea to introduce them in a neutral area outside your home, so that they can become familiarized without either pet feeling intruded upon. If bringing a new pet into your home, keep the new pet separate from your current cat(s), and provide the new pet separate food, water, and a litter box. Allow the pets to socialize in your home gradually, over a period of several days to several weeks. [9] X Research source Introduce them first by scent by letting the cats each sleep on a piece of your old clothing that has your scent on it as an intermediary. The next night, swap the clothing over so the cats get a whiff of each other's scent. This \"Scent handshake\" can smooth over the introduction as they learn about one another. Keep an aggressive cat in his carrier during introductions, if he has displayed hissing and other aggressive behavior toward the new pet. [10] X Research source Humans often cannot detect cat scent marks. Use a handheld blacklight, available at any pet store, to look for cat urine stains on walls and furniture."
    },
    {
      "title": "Check your cat for injuries.",
      "content": "Check your cat for injuries. When cats fight, they often receive wounds that are not obviously visible. Carefully examine the animal by approaching the cat slowly, and gently running your hands over its body looking for tender spots. Your cat will let you know if you've found one, so don't poke or prod. If you find an injury, take the cat to the vet or animal hospital right away. Common locations for fighting injuries include the head, chest and legs. [11] X Research source Be very careful, an injured cat will lash out to try to protect itself, and can cause serious injury."
    },
    {
      "title": "Consider neutering your cat.",
      "content": "Consider neutering your cat. If your male cat is displaying excessive aggression, including hissing, it's possible that he is hyper-territorial. Neutering an aggressive male cat may help correct this behavior and reduce his undesirable aggression."
    },
    {
      "title": "Listen to your cat.",
      "content": "Listen to your cat. If your cat does not like to be petted, or held, or picked up, hissing may be his way of letting you know. Respect his boundaries, and don't handle your cat in a way he is not comfortable with. [12] X Expert Source Brian Bourquin, DVM Veterinarian Expert Interview. 31 January 2020. Your cat flattening its ears or whisking its tail back and forth quickly can also be signs that it's uncomfortable or scared. [13] X Expert Source Brian Bourquin, DVM Veterinarian Expert Interview. 31 January 2020. Always make sure the cat has an escape route to avoid you if she feels threatened. Many cats will hiss when they are cornered, as a sign they're not comfortable with how close you are and would you please go away. Having a quick look around you and making sure the cat has a clear line of sight way to get away of her own accord is likely to ease some of the tension."
    },
    {
      "title": "Take precautions against redirected aggression.",
      "content": "Take precautions against redirected aggression. It's possible that your cat is hissing at you because he feels threatened by a neighborhood cat or dog that has challenged your cat through the window or screen door. If you believe this to be the case, try keeping the curtains and door closed as much as possible. [14] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Consider whether your cat is afraid of people.",
      "content": "Consider whether your cat is afraid of people. It's possible that your cat was physically harmed or neglected by a previous owner, or even by someone who currently interacts with your cat. Investigate how other people treat the cat. Is there a chance that someone or something is harming or harassing your cat that you are not aware of? Ask around, and keep a close eye on children who may not know how to treat a cat properly. If you are suspicious that someone is harming your cat while you aren't around, consider installing a nanny cam, or setting up a laptop or phone to discreetly film the cat's environment for a few days."
    },
    {
      "title": "Give your cat space and time to calm down.",
      "content": "Give your cat space and time to calm down. When your cat hisses, back off. It's important that a cat not feel trapped or threatened, so don't corner it in a room. Just leaving a door open a crack so the cat knows it can run if it needs to can help soothe an anxious animal. [15] X Research source When approaching a nervous cat, go slow, and give it ample time to adjust to your presence and your scent. Avoid staring at a nervous cat. Cats can interpret staring as a sign of aggression. [16] X Expert Source Brian Bourquin, DVM Veterinarian Expert Interview. 31 January 2020. If your cat does run out of the room, don't chase it. That will only increase its anxiety. Make sure to warn children and guests to give your cat space, and to not try to force it to be sociable."
    },
    {
      "title": "Remove irritants from your cat's environment.",
      "content": "Remove irritants from your cat's environment. Clean up any cat spray that might be in the home using a specially-formulated cleaner. If a neighbor cat is lurking outside a particular window or sliding glass door, use opaque contact paper or cardboard to cover the window so your cat can't see the intruder. If your cat is an indoor animal, you can use cayenne pepper or a specially formulated cat repellent around the perimeter of your yard to try to keep other cats from intruding. [17] X Research source"
    },
    {
      "title": "Provide adequate resources and refuge for the cat.",
      "content": "Provide adequate resources and refuge for the cat. If your cat is stressed out by a new baby or pet, time will often help, but you can further assist your cat by providing him with ample resources and places to hide. Make sure the cat has at least one place to perch that will keep him out of reach from any would-be pesterers, like a tall climbing post or kitty shelf. Cats feel safer when they can access higher levels. [18] X Expert Source Brian Bourquin, DVM Veterinarian Expert Interview. 31 January 2020. If you have more than one cat, make sure that there are enough litter boxes, food dishes, and water bowls for everyone. Cats are much happier when they don't have to share."
    },
    {
      "title": "Buy some new toys.",
      "content": "Buy some new toys. Spend more time playing with your cat, and try introducing new ways to stimulate him. Hide little treats around the house where your cat can find them, and never underestimate the therapeutic power of catnip."
    },
    {
      "title": "Try a pheromone spray.",
      "content": "Try a pheromone spray. There are a number of products on the market that help soothe stressed cats by releasing soothing pheromones into the air. Check with your vet or local pet store for a specific recommendation. These products can be pricey, but they may be worth it."
    },
    {
      "title": "Consult your veterinarian.",
      "content": "Consult your veterinarian. If you still can't figure out how what's bothering your cat, or how to fix it, have your pet checked out by the vet. There may be something going on physically with the cat that you can't see, or the vet may have suggestions for medication or other treatments that can help soothe your distressed animal."
    }
  ]
}