{
  "url": "https://www.wikihow.com/How-Does-a-Jake-Brake-Work",
  "title": "Jake Brakes 101: What They Do and How to Use One",
  "steps": [
    {
      "title": "A Jake brake helps you slow down without hitting the normal brakes.",
      "content": "A Jake brake helps you slow down without hitting the normal brakes. Not to state the obvious, but trucks are exceptionally heavy. This means that your truck’s brake pads have some serious work to do if you hit the pedal and need to stop fast, and CDL drivers end up having to replace their brakes very often. This is where the Jake brake comes in. With a Jake brake, you can slow your vehicle down without pressing the brake pedal by changing how your engine is configured. Not only do Jake brakes help save your service brakes from wear and tear, but they can also be used in conjunction with one another to drastically improve your stopping power. The Jake brake is not a substitute for working service brakes, so you can’t rely on it entirely to stop your vehicle. Jake brakes are installed directly on diesel engines and are engaged by turning a switch on and releasing the clutch and throttle."
    },
    {
      "title": "The Jake brake uses compressed air to slow your engine down.",
      "content": "The Jake brake uses compressed air to slow your engine down. A gas engine has four steps. Air comes in, the air is compressed, combustion and compressed air drives the cylinder, then the air is exhausted. Normally, when you take your foot off of the brake, the air flow continues and the momentum of the cylinders keep the vehicle going forward. The Jake brake restricts that airflow so compressed air builds up in the engine. This artificially slows down your engine’s cylinders and helps you slow down."
    },
    {
      "title": "Switch: set your Jake brake to the appropriate weight.",
      "content": "Switch: set your Jake brake to the appropriate weight. The Jake brake is the lever on your dashboard or behind your steering wheel that’s labelled “Eng. Brake.” [1] X Research source Flip your switch to the appropriate load setting depending on what you’re carrying (i.e. heavier loads deserve strong braking power). [2] X Research source The phrase “switch, clutch, throttle” is the easiest mnemonic device for remembering the order of operations if you’re studying for your CDL license. The higher the position, the stronger the braking power. Most Jake brakes have 3 positions, so position 3 is the strongest stopping power and position 1 is the lowest."
    },
    {
      "title": "Clutch: step off of the clutch.",
      "content": "Clutch: step off of the clutch. Release the clutch. You don’t want then transmission to be engaged while you’re operating the Jake brake, so disable the clutch if it’s activated. [3] X Research source"
    },
    {
      "title": "Throttle: remove your foot from the gas.",
      "content": "Throttle: remove your foot from the gas. Take your foot off of the throttle and the Jake brake will automatically engage. You’ll hear the sharp and sudden sound of air escaping your exhaust valve, followed by the feeling of your vehicle gently slowing down. Whenever you want to turn the Jake brake off, just accelerate or flip the switch to the off position! [4] X Research source You can (and often should) engage your service brake at the same time as you’re using the Jake brake. Remember, the Jake brake isn’t a substation for normal brakes—it’s just a complimentary tool."
    },
    {
      "title": "Engage the Jake brake to control your vehicle on declines.",
      "content": "Engage the Jake brake to control your vehicle on declines. Using your service brakes on a steep hill puts an abnormal amount of stress on the brake pads. It’s also harder to keep your load stable while going downhill and hitting the brakes, since gravity is tugging on the backend of your vehicle. Use your Jake brake to slow down in these scenarios and maintain control. [5] X Research source A lot of drivers will exclusively use their Jake brakes when going downhill, since going downhill is when a truck’s brakes are most likely to fail (this is why downhill roads often have truck escape ramps). If you plan on driving long haul through any mountains and you own your truck, get a Jake brake. It’ll seriously save you money in the long run."
    },
    {
      "title": "Turn the Jake brake off while you actively change gears.",
      "content": "Turn the Jake brake off while you actively change gears. The Jake brake reconfigures how air moves inside of your engine. The transmission isn’t designed to function when the Jake brake is on and the air is pushing on your cylinders though, so you may accidentally stall the engine if you change gears while the Jake brake is running. Just turn it off to change gears. [6] X Research source"
    },
    {
      "title": "Avoid using the Jake brake in slippery or icy conditions.",
      "content": "Avoid using the Jake brake in slippery or icy conditions. If you’ve ever gently pressed the brake when driving on ice, you may have noticed the vehicle stutter a bit as the brake struggles to catch on the pavement. For similar reasons, you’re likely to lose control using the Jake brake when it’s wet or icy out, so stick to the service brakes if you can. [7] X Research source If you do want to use the Jake brake in icy or wet conditions, keep it in the lowest setting available."
    },
    {
      "title": "The Jake brake is stronger when you’re running high RPMs in low gears.",
      "content": "The Jake brake is stronger when you’re running high RPMs in low gears. The Jake brake relies on the airflow in your engine to function. This means that the faster your engine’s cylinders are churning, the stronger the Jake brake’s stopping action will be. Keep this in mind when you’re travelling fast. [8] X Research source Turning the Jake brake on abruptly while travelling fast can cause you to jackknife, since the momentum of your load isn’t prepared for the radical increase in braking power."
    },
    {
      "title": "Leave the Jake brake on perpetually if you want the help.",
      "content": "Leave the Jake brake on perpetually if you want the help. If you’re travelling on flat land and you’ve got the open road ahead of you, it’s totally fine to leave the Jake brake on. Whenever you release the throttle, your truck will gently slow down without you needing to step on the brakes. Over the years, this can radically prevent wear and tear on your service brakes! [9] X Research source"
    },
    {
      "title": "You can’t use Jake brakes in most cities or residential areas.",
      "content": "You can’t use Jake brakes in most cities or residential areas. Activating your Jake brake quickly redirects the flow of air in your engine. It turns out this is exceptionally loud and annoying to most people. As a result, Jake brakes are almost universally illegal in cities, mid-sized towns, and suburbs, so don’t turn your Jake brake on if you’re in a heavily populated area. If you’ve ever heard a truck make a jackhammer sound when it’s slowing down, that’s the Jake brake. Signs that say things like, “Brake Retarders Prohibited,” “Engine Braking Restricted,” or “No Engine Brakes,“ are all referring to the use of Jake brakes."
    }
  ]
}