{
  "url": "https://www.wikihow.com/Haughty-Eyes-Meaning",
  "title": "What Does Haughty Eyes Mean? Explaining Proverbs 6:16-19",
  "steps": [
    {
      "title": "A person with \"haughty eyes\" is arrogant and acts superior.",
      "content": "A person with \"haughty eyes\" is arrogant and acts superior. The Bible uses the phrase \"haughty eyes\" to refer to a haughty person. The Oxford English Dictionary defines \"haughty\" as \"High in one's own estimation; lofty and disdainful in feeling or demeanor; proud, arrogant, supercilious.\" [1] X Research source Therefore, having haughty eyes means possessing all the above negative characteristics – especially the feeling that one is better than everyone else around them."
    },
    {
      "title": "Proverbs 6:17 lists haughty eyes as 1 of 7 things God hates.",
      "content": "Proverbs 6:17 lists haughty eyes as 1 of 7 things God hates. In Proverbs 6, King Solomon dedicates verses 16-19 enumerating 7 things God despises in man: \"haughty eyes, a lying tongue, hands that shed innocent blood, a heart that devices wicked schemes, feet that are quick to rush into evil, a false witness who pours our lies, and a person who stirs up conflict in the community.\" A person with these characteristics goes against God's values of honesty, mercy, justice, and discernment, which is likely why He opposes them so strongly."
    },
    {
      "title": "Proverbs 21:4 warns that wicked people are led by their \"haughty eyes.\"",
      "content": "Proverbs 21:4 warns that wicked people are led by their \"haughty eyes.\" In some translations of Proverbs 21:4, King Solomon says, \"Haughty eyes and a proud heart, the lamp of the wicked, are sin.\" This verse explains that wicked, sinful people go wherever their haughtiness and pride leads them – which is always away from God."
    },
    {
      "title": "King David promises not to tolerate haughty eyes in Psalm 101:5.",
      "content": "King David promises not to tolerate haughty eyes in Psalm 101:5. In this Psalm, King David explains how he will rule Israel with justice and fairness according to God's will. He goes further than merely following the letter of the law; in the 5th verse, he states, \"Whoever slanders their neighbor in secret, I will put to silence; whoever has haughty eyes and a proud heart, I will not tolerate.\""
    },
    {
      "title": "Haughty people look down on others and feel superior.",
      "content": "Haughty people look down on others and feel superior. The most obvious characteristic of a haughty person is their belief that they're better than their fellow Christians (and anyone else, regardless of their religion). [2] X Research source As a result of this superiority complex , they may talk down to others, refuse to help those in need or show a startling lack of empathy for other people's feelings and experiences."
    },
    {
      "title": "They refuse to acknowledge their sinful pride.",
      "content": "They refuse to acknowledge their sinful pride. A haughty person never thinks they're in the wrong. Everything bad that happens is someone else's fault, never a result of their arrogant words or actions. Because of their blindness to their own faults, they plow headfirst into sin and drive a wedge between themselves and God. They also tend to ruin or at least strain their relationships with their family and friends for the same reason. [3] X Research source"
    },
    {
      "title": "They disguise their selfish ambition as religious fervor.",
      "content": "They disguise their selfish ambition as religious fervor. A haughty person may participate heavily in church activities, volunteer, go on mission trips, or donate large sums of money. From the outside, they may look like righteous individuals with a fire for serving God. But while doing these things, what they're really trying to do is feel like they're doing more than anyone else in their community, and to garner attention and praise. In this light, it's clear that the haughty one's objective is to serve their own desires, not to benefit other people. [4] X Research source A more Christ-like approach would be to serve God and His children without a desire for any kind of reward or acknowledgment."
    },
    {
      "title": "Ask God for help being less haughty and prideful.",
      "content": "Ask God for help being less haughty and prideful. Everyone has been guilty of having \"haughty eyes\" at some point in their lives. It's a common sin to commit, and God is more than happy to help us overcome it. The key is not just to pray for help, though; it's also important to put real effort into changing our sinful ways. When we do our best to improve, God will help us the rest of the way. Prayer Against Haughtiness : Heavenly Father, please forgive me for the times that I've been selfish and haughty. I realize now that I think too much of myself and that this is holding me back from serving You. Please help me overcome the sin of haughtiness and become more empathetic, humble, and devoted to you."
    },
    {
      "title": "Practice humility in your pursuit of God.",
      "content": "Practice humility in your pursuit of God. Humility is the antidote to haughtiness. To be truly humble, one must let go of haughtiness and arrogance and follow God for His sake, not for selfish gain or elevation. Instead of seeking praise and attention for your good deeds, help your church and the less fortunate because it pleases Him and will make other people's lives better. One way to practice humility is not to brag about your good deeds or your piety on social media. Those likes and comments may bring you joy in the moment, but obsessing over them may cause you to forget God and feed the haughty spirit."
    },
    {
      "title": "Have more empathy and understanding for your fellow man.",
      "content": "Have more empathy and understanding for your fellow man. Theodore Roosevelt once said, \"Comparison is the thief of joy.\" This phrase means we should avoid comparing what we don't have to what others have – but it also works the other way around. To let go of \"haughty eyes\" for good, one must try to have more empathy and understanding for the people around them. They must avoid comparing themselves favorably and falling into the trap of thinking they're morally or financially superior to everyone around them."
    },
    {
      "title": "Read Bible verses about humility for inspiration.",
      "content": "Read Bible verses about humility for inspiration. The Bible has several verses that expound on the virtues of the humble person. It's also clear from many of these scriptures that God rewards those who speak to Him with humility and who are humble in their everyday dealings with other people. Reading these verses can remind us of the importance (and beauty) of letting go of our egos. Below is a collection of inspirational Bible verses for those who want to meditate on casting off their \"haughty eyes\" and becoming more humble. \"God opposes the proud but shows favor to the humble. Humble yourselves before the Lord and He will lift you up.\" James 4:6-7 \"If My [God's] people, who are called by My name, will humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, and I will forgive their sin and will heal their land.\" 2 Chronicles 7:14 \"For all those who exalt themselves will be humbled, and those who humble themselves will be exalted.\" Luke 14:11 \"When pride comes, then comes disgrace, but with humility comes wisdom.\" Proverbs 11:2"
    },
    {
      "title": "Yes, you can cure haughty eyes through humility and prayer.",
      "content": "Yes, you can cure haughty eyes through humility and prayer. God knows we're not perfect and that we're prone to giving in to pride and other sins. That's why, according to Christian theology, He sent His Son, Jesus Christ, to Earth to die on the cross for humanity's sins. We also know that God forgives those who truly repent, as it says in 1 John 1:9: \"If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness.\""
    }
  ]
}