{
  "url": "https://www.wikihow.com/Make-Your-Feet-Look-Smaller",
  "title": "How to Make Your Feet Look Smaller",
  "steps": [
    {
      "title": "Wear flared jeans and trousers.",
      "content": "Wear flared jeans and trousers. You may worry that a flared leg at the bottom of your pants adds more weight and emphasis to the bottom of your leg, and in a sense, that assessment is accurate. By draping more material over that part of your leg, though, you can actually balance out the size of your foot with the size of your leg. The excess trouser material tricks the eye into expecting “more” at the bottom of your leg, so your larger foot ends up looking proportional. Similarly, you should avoid jeans and trousers with tapered legs. Tapered legs cling to you and train the eye to look for less at the bottom of your leg instead of more. As a result, the size of each foot gets emphasized."
    },
    {
      "title": "Avoid bottoms that highlight your calves.",
      "content": "Avoid bottoms that highlight your calves. This means skipping the cropped pants, capris, and mini skirts. When the fabric of your pants or skirts stops just above the calf, the lower leg and foot get emphasized. This emphasis generally makes your calves and feet look stockier and bigger. Try wearing shorts and skirts that rise just above the knee. This lengthens the overall appearance of your leg. You might be tempted to think that lengthening the look of your leg also lengthens the look of your foot, but by making the leg itself appear longer, you can actually make your foot look more proportional to the rest of the leg. Alternatively, wear floor-length skirts to mask as much of your foot altogether. This is a valid option, especially if the skirt flares out and covers your ankles, since the excess material dwarfs the size of your foot by comparison. Avoid skirts that cling to your lower leg and those that stop just above the ankle, though, since these options will only emphasize your feet more."
    },
    {
      "title": "Balance your feet with a wide belt.",
      "content": "Balance your feet with a wide belt. A large, chunky belt can compete with your feet in regards to size. A skinny belt will cause the eye to notice the mass at the bottom of your legs, but a wide belt will add a comparable amount of mass to the top of the leg. As a result, the eye sees the overall leg, from waist to foot, in a more balanced and proportional light. In general, skinny belts make your legs look longer while wide belts make your legs look shorter by “cutting” your torso in half visually. While you do not necessarily want to make your legs look stubby, the extra foot length usually means that you can afford to remove some of the visual length of your leg without making them look too much shorter."
    },
    {
      "title": "Avoid clingy skirts.",
      "content": "Avoid clingy skirts. Pencil skirts and other snug-fitting styles do nothing to help balance out your legs and feet. As a result, large feet are easier to spot, especially if accompanied by thick calves. There's no need to skip the skirt altogether, though. Try on an A-line skirt or circle skirt. These styles flare out at the knee, and the resulting effect makes the overall appearance of your legs and feet look more balanced and proportional."
    },
    {
      "title": "Draw attention to your top.",
      "content": "Draw attention to your top. A good way to keep the attention off your feet is to draw the attention as far away as possible. Wear shirts in lighter, brighter colors and patterns. Opt for eye-catching \"upper\" accessories, like scarves, necklaces, and earrings, to draw the eye toward the top of your body. On the flip side, wear darker colors on the bottom and skip any prints or patterns there. Accessories that draw the eye downward, like anklets, bracelets, and rings, should be avoided."
    },
    {
      "title": "Choose heels over flats.",
      "content": "Choose heels over flats. High heels realign your foot so that more of its length is displayed vertically rather than horizontally. Since feet are horizontal in their natural state, the mind automatically perceives foot length as a horizontal measurement. As such, when more of the actual length is drawn up toward your leg, the perceived length becomes shorter. The type of heel you choose can also make a difference. Typically, chunky heels and wedges are better choices than stiletto heels. The idea is that a thicker heel balances your foot out better, while a thin heel can look overwhelmed on a large shoe and may accent the size of foot. [1] X Research source"
    },
    {
      "title": "Avoid skimpy sandals.",
      "content": "Avoid skimpy sandals. Skimpy sandals that expose too much of your foot will make anyone's foot look bigger. You want to wear more stylish flats that expose less of your feet so they don't look so front and center. Keep the ankle uncovered when you do wear flats. When you do look for flats, opt for low-rise options that do not extend up too close to the ankle. Wearing shoes with straps around the ankles actually makes your feet appear larger than they really are. However, wearing flat sandals in addition to heels is important. If you care about the health of your feet, you will need to switch back and forth between heels and flats with adequate arch support."
    },
    {
      "title": "Opt for shoes with blunt, rounded toes.",
      "content": "Opt for shoes with blunt, rounded toes. Your actual toes do not fit into a pointed toe on a shoe, so most of that point is extra space. That extra space only adds more length to your foot, making your foot look larger as a result. Skip the pointed toes and go for a shoe with a more natural rounded toe to minimize excess length. As a general rule, try to choose shoes that are cut close to your foot all the way around. This includes the toe area and the ankle area, as well as the sole. Avoid shoes that have a heavy, extended sole around the edges since this can make your feet look heavier and clunkier. [2] X Research source"
    },
    {
      "title": "Wear heeled boots.",
      "content": "Wear heeled boots. If you have large feet, you may worry that heavy footwear like boots can add perceived weight to the foot. The right boot will actually mask some of your foot size by covering it in flattering ways and balancing the overall appearance of your leg. Acquaint yourself with the ankle boot. More specifically, invest in a pair of heeled ankle boots. The heel elevates your foot and reduces its perceived horizontal length, while the boot covers up more of your foot, masking its size underneath the material. Experiment with bulky boots. The usefulness of bulky boots is debatable among fashion experts. There are two opposing schools of thought: some believe that having a visibly large amount of excess material makes the foot look smaller by comparison, while others claim that any excess bulk around the foot will make that foot appear larger, even if that bulkiness looks notably loose. Try this style on and see the results for yourself."
    },
    {
      "title": "Hide your toes.",
      "content": "Hide your toes. Peep toes and similar styles should be avoided. When the tips of your toes peek out of your shoes, it can give the visual impression that your foot is trying to squeeze out of shoes that are too small, thereby making your foot look larger. Avoid flats or boots with peep toes if you want your feet to look smaller."
    },
    {
      "title": "Wear sandals with wider straps.",
      "content": "Wear sandals with wider straps. When you decide to wear sandals, look for options that have wider straps. Pass over shoes with thin straps and head for those that have a few notably thick ones. Exposing too much of your foot can highlight its large size, so hiding more of the foot under large straps can help minimize its appearance. If you do prefer the look of thinner straps, choose styles that have many small straps over those that only have a couple. Multiple thin straps can still cover more of your bare foot and mask its size. When wearing any sandals, make sure that your foot fits into the shoe comfortably and does not threaten to \"squeeze\" out through the straps. If skin pushes its way out of the straps, it can make your foot look as though it is bursting out of the shoe due to its size."
    },
    {
      "title": "Gravitate toward shoes with dark colors.",
      "content": "Gravitate toward shoes with dark colors. Black, dark brown, and navy blue shoes are especially great options, but anything darker than your skin tone will work well enough. Dark colors look slimming on your body, and they have the same effect on your feet. Nude shoes or shoes that are lighter than your skin tone can blend in to your leg. As a result, the shoe looks like an extension of the leg and an extension of the foot. This highlights the length of the foot and may even make it look longer than it already is."
    },
    {
      "title": "Dress up your shoes.",
      "content": "Dress up your shoes. While you might think that accents and embellishments draw unwanted attention to a large foot, interesting details can actually provide a focal point for the eye to fixate on, thereby distracting it from the otherwise obvious length of the foot. Stick with single detail accents rather than all-over detail. For instance, a large bow or flower would work much better than a floral pattern. Wearing boots with buckles on them can also make your feet look more petite. You can test this look out by clipping a decorative shoe clip or hair clip onto the toe area of a plain pair of heels. If you decide that you don't like the way it looks on your foot, simply remove the clip and wear the shoes plain."
    }
  ]
}