{
  "url": "https://www.wikihow.com/Look-Less-Nerdy-with-Glasses",
  "title": "How to Look Less Nerdy with Glasses",
  "steps": [
    {
      "title": "Choose your look.",
      "content": "Choose your look. Can't decide whether you want to look like a literary genius, power executive, or hipster intellectual? Browse fashion magazines and blogs ( GQ , Nylon , etc.), eye wear websites (Warbyparker.com sells affordable designer glasses), or emulate other people who have the look you admire. Make sure the rest of your fashion complements the glasses you want. Like the perfect belt or piece of jewelry, your new glasses will add a defining touch to your wardrobe and persona."
    },
    {
      "title": "Choose frames and lenses.",
      "content": "Choose frames and lenses. Conduct research before visiting an optician to find promotions, and make sure you plan your visit on a day when you are not pressed for time. If you can, take a friend or family member to model for, and wear an outfit that is representative of your style. Before you try on glasses, ask your optician for input when considering the right frames for your face's shape and size. Frame color is important as it should highlight your skin, hair, and eye color. Choose bold colors for an edgy look or dark tortoise shell frames for a more elegant style. Consider the pros and cons of plastic vs. metal when choosing your frames. Plastic frames come in a variety of colors and are cost-effective and lightweight; they also hide thick lenses well. However, they are easier to break than metal frames. Metal frames are made from different materials (titanium and beta-titanium, for example) and are generally light-weight, durable, and corrosion-resistant. Invest in anti-reflective coating and high index polycarbonate lenses. While these features are more expensive, you will look more sophisticated in your new glasses as people won't notice scratches or an unsightly glare."
    },
    {
      "title": "Check out your hair.",
      "content": "Check out your hair. Style your hair to make the most of the frames you have chosen. Consult with your hairdresser to see what haircut or style suits you as an individual, and be sure to wear your glasses to your appointment."
    },
    {
      "title": "Grooming to enhance your glasses.",
      "content": "Grooming to enhance your glasses. Take care of your face to ensure that it looks its best with your new frames. For women--get your eyebrows shaped as they can create a clean, elegant look that emphasizes your glasses; unkempt eyebrows can detract from your glasses' flair. Remember to use waterproof and liquid makeup to prevent residue from dirtying your lenses. For men--decide whether you are going to be clean shaven or maintain facial hair. If you decide to have a mustache or beard, trim it often. Your glasses will draw a lot of attention to your face, so you want it to look as neat and clean as possible. A five o' clock shadow, however, can create a sometimes sexy \"disheveled intellectual\" look."
    },
    {
      "title": "Attitude is the most important thing.",
      "content": "Attitude is the most important thing. You can wear designer clothing, have a trendy haircut, and groom impeccably, but remember you have to feel good to look good. Wear your glasses with confidence!"
    }
  ]
}