{
  "url": "https://www.wikihow.com/Make-a-Game",
  "title": "How to Make a Game",
  "steps": [
    {
      "title": "Decide what genre your game will be.",
      "content": "Decide what genre your game will be. Choosing a theme will narrow your focus when planning and designing the game. To pick a genre, consider what types of games you like to play, what the goal or mission of the game will be, and what you want the user experience to be like. For example, if you like games you can play with a group of people, you might make a multiplayer online role-playing game."
    },
    {
      "title": "Create a compelling storyline that has multiple paths players can take.",
      "content": "Create a compelling storyline that has multiple paths players can take. The most important part of a video game is telling a story that captures the interest of the player. Brainstorm the overarching problem that players are trying to solve and build off of that. Make sure there are multiple ways to “win” the game to provide more entertainment for the players. [1] X Research source For example, if you want the goal of the game to be finding a pot of gold, create characters like an evil leprechaun who’s trying to protect the pot and a storyline of events that might happen throughout the player’s journey, like the appearance of a magical rainbow."
    },
    {
      "title": "Add increasing levels of difficulty to keep players engaged.",
      "content": "Add increasing levels of difficulty to keep players engaged. You don’t want the game to end as soon as a player accomplishes the first goal. Keep the game going by incorporating new challenges throughout the story, along with different levels that players can unlock as they go along. [2] X Research source Having a beginner’s level along with more advanced levels also means more people can play your game. It won’t exclude any players. You can create different levels for the same goal, or make levels get progressively harder throughout the story. For example, you can have a beginner’s option and an advanced option for trying to slay the evil leprechaun. Or you can make the first step, like finding the leprechaun, easier, then make the next step, like getting inside his lair, a little more difficult, and so on."
    },
    {
      "title": "Lay out your video game with a storyboard.",
      "content": "Lay out your video game with a storyboard. Before you jump into coding and development, you need to have a clearly defined plan and vision for how your game will run and what it will look like. Create a storyboard by sketching out the major scenes of your game in each frame, along with details on what will happen in that scene. Place the images in order of occurrence in the game. [3] X Research source Include details like what actions the characters will take in each scene, what the background should look like, whether there will be any special effects or sounds, etc. For instance, using the leprechaun example, 1 frame might be searching the woods for the leprechaun’s cave. The storyboard would have a description of the woods, what animals or elements the character might run into, and whether the character can run, jump, or even swing from the trees. The more in-depth your storyboard is, the easier the development stage will be, since you’ll be more prepared."
    },
    {
      "title": "Download an easy-to-use program if you’re a beginner.",
      "content": "Download an easy-to-use program if you’re a beginner. You don’t have to be able to code to create a video game. There are “drag and drop” programs available where you simply insert your storyline, characters, actions, rewards, etc., and the software writes the code for you. This allows you to focus on the storytelling and concept, rather than the technical details and coding. GameMaker Studio and Unity 3D are 2 of the most popular programs for video game development. Choose a free version of one of these programs if you’re on a budget. Keep in mind that the free versions will have limited options and features."
    },
    {
      "title": "Learn how to code if you want a more custom or complex game.",
      "content": "Learn how to code if you want a more custom or complex game. Coding allows you complete freedom as far as customization and unique features go. You can use online classes or tutorials to teach yourself the basics to start building your game. [4] X Research source Some of the common programming languages used in designing games are JavaScript, HTML5, ActionScript 3, C++, or Python. After you master the basics, learn the application programming interface (API) for your coding language. This basically is a set of instructions for how your code will interact with other software or programs. Open-source game development programs also provide extra support and sample code for creating games. For example, if you want your character to climb the wall of the leprechaun’s cave, you can find a pre-made coding sequence for a climbing motion, then tweak it to fit your game."
    },
    {
      "title": "Create a prototype of your game focusing on the core features.",
      "content": "Create a prototype of your game focusing on the core features. Think of this like a rough draft of your game. Don’t stress over tiny details, like what color the earrings your character is wearing are. Instead, work on building the main components of the game, like what happens when a player catches the leprechaun or how many pots of gold they have to find to advance to the next level. Keep your prototype as simple as possible if you’re a beginner. You can always build on it later. Be open to new ideas that come to you as you build your game and also be willing to let go of things you thought would work but don’t."
    },
    {
      "title": "Playtest the game and make any final tweaks.",
      "content": "Playtest the game and make any final tweaks. Once you’ve built a prototype of your game, it’s time to actually play it to see how it works. Go through each part and level thoroughly, checking all of the different features and player pathways. If something doesn’t run smoothly or if you have ideas for improvement, jot them down so you can go back later and correct them. [5] X Research source You can also have your friends and family to playtest the game. Ask them for honest feedback about their experience. Don’t just test for functionality. Test for how fun the game is, too! If it’s boring or slow, brainstorm ways to make it more exciting, like by adding more challenges or special effects. You can do as many rounds of playtesting as necessary until you’re satisfied with your finished game."
    },
    {
      "title": "Come up with a concept for your game that’s simple yet addicting.",
      "content": "Come up with a concept for your game that’s simple yet addicting. The key to a successful mobile game is one that’s easy to understand and play, yet interesting and challenging enough to keep the user coming back. Outline a basic idea or story, then brainstorm how to make it “never-ending,” like by adding different levels, challenges, and goals. [6] X Research source For example, if your game is going to be shooting down stray meteorites, incorporate harder levels where the meteorites start falling faster, or set a goal for the player where they can unlock a new launcher if they shoot 15 meteorites in 5 seconds. Think about the games that are most popular or that you like the most when you’re brainstorming. What do you like about them? How can you use the best aspects in your own game?"
    },
    {
      "title": "Decide which platform you want to use based on features and budget.",
      "content": "Decide which platform you want to use based on features and budget. The 2 primary platforms are either iOS (which is what iPhones use) or Android. While similar in some ways, each platform differs in how much freedom you have as a developer along with how much money you’ll spend or make. For instance, Android allows you more flexibility with custom functions and features because it’s an open-source platform. [7] X Research source iOS tends to be easier to develop apps on since its programming language (Swift) is less involved than Android’s (Java). You’ll have a better chance of making more money if you use iOS. The App Store generates almost double the revenue of Android’s equivalent, which is Google Play. [8] X Research source You can build for both iOS and Android, but it will be more expensive since each one has its own coding structure and requirements. If you want to use both platforms, it’s best to start with just one since you have limited time and resources. Once you develop the game for that platform, you can convert it to be compatible with the other."
    },
    {
      "title": "Design your game using colorful graphics and mobile-specific features.",
      "content": "Design your game using colorful graphics and mobile-specific features. Once you have your concept, figure out how you want it to look and run. Vibrant, bold graphics tend to look best on small smartphone or tablet screens. You’ll also want to take advantage of all the fun functions of mobile devices, like tilting the phone to steer a car or swiping with your finger to swing a sword. [9] X Research source Add sound effects to enhance the experience for the user. You can include anything from fun background music to the sound of a cheering crowd whenever the player scores a goal, for instance. You can design your graphics with software like Photoshop, or hire a graphic designer if you want more professional-looking images. Check your platform’s design requirements first. You can find the list on either Google Play or the App Store."
    },
    {
      "title": "Build your app with a development program or open-source framework.",
      "content": "Build your app with a development program or open-source framework. Beginners can use a “drag and drop” program to create your game without actually having to code anything. And if you do know how to code, use open-source framework, like Phaser, which can provide support, plugins, and blueprints for building your game. [10] X Research source One of the most popular game development programs is GameSalad, which lets you build fully functioning 2D games without writing a single line of code. While “drag and drop” programs are easy and convenient, they’ll also limit how much customization and control you have. Consider outsourcing the development step to make your life easier if you’re not an experienced coder or developer. It’s worth the extra cost to have a professionally-designed product."
    },
    {
      "title": "Monetize your game if you want to generate revenue.",
      "content": "Monetize your game if you want to generate revenue. The top way to make money from your app is by charging a fee to download it or a monthly subscription rate. But if you want to offer a free game, you can still monetize it by adding things like in-app purchases, premium content, or ads. [11] X Research source You can try offering what’s known as a “freemium” app. People can download your gaming app for free, but then pay for more advanced features or a better experience. In-app purchases might include buying coins so your character can have new clothes, for example, or paying to play the game without ads. There are different ad services you can choose from. For instance, a popular option for Android apps is Google AdMob. Be careful not to overdo it with ads. You don’t want to frustrate players or disrupt their gaming experience."
    },
    {
      "title": "Submit your finished game to the platform’s reviewing body.",
      "content": "Submit your finished game to the platform’s reviewing body. If you developed your game for iOS, you’ll use the App Store. If you used Android, you’ll upload to Google Play. The companies will review your game and determine if it’s acceptable to be included in their app stores. Getting your game approved by Google is much easier than by Apple. Once you submit to Google Play, your game could be live in just a few hours. To upload an app on Google Play, you have to sign up for a Google Play Developer account which costs $25. To submit an app to Apple, you need to enroll in the iOS Developer Program, which is $99 a year. If your game isn’t accepted, make any necessary changes based on the feedback you receive, then re-submit as many times as you’d like. You can appeal a rejection to Apple’s App Review Board if you feel it was unfair."
    },
    {
      "title": "Design a board game if you want old-fashioned fun.",
      "content": "Design a board game if you want old-fashioned fun. The sky’s the limit when it comes to creating a board game. Consider how many players you want to have, what the objective and rules will be, and how players can win the game. And feel free to get creative with decorating the board and game pieces themselves. If you need some inspiration, incorporate elements from your favorite board games. For example, if you love Monopoly, include a buying and selling element in your own game. Use any materials you’d like to construct the physical game. The board could be made of cardboard, wood, or even fabric, for example. You can also repurpose an old board game. Cover the board with paper and decorate it yourself and use the pawns for your new game, too."
    },
    {
      "title": "Come up with a party game if you're hosting an event.",
      "content": "Come up with a party game if you're hosting an event. Getting your guests engaged in a game is a great way to fill any potential downtime during a party. Think about the demographic of your guests. If they’re a range of ages and interests, create a game that everyone can play and that doesn’t require a specific skill or athletic ability, for instance. [12] X Research source Match the game to the theme of the party. For example, if it’s an undersea party, make a play on “pin the tail on the donkey” with “pin the fin on the mermaid” instead. If your guests enjoy alcoholic beverages, consider starting a drinking game. For instance, have everyone try to balance a spoon on their nose. Whenever your spoon drops, you have to take a drink."
    },
    {
      "title": "Invent a road trip game if you’re bored on a long car ride.",
      "content": "Invent a road trip game if you’re bored on a long car ride. Not only will a fun car game help pass the time on a 10-hour trip if you’re the passenger, it will also help keep you awake if you’re the driver. Come up with an activity that either doesn’t use any props or that involves the sights and scenery you’re passing, so even the driver can play along. [13] X Research source For example, look for every letter in the alphabet on signs as you drive by. Start with the “A” you saw on the Taco Bell sign, then the “B” on “Exit 4B,” and so on. Avoid games where you have to write or read or that take up a lot of space. Those are difficult to play in the car."
    },
    {
      "title": "Use cards if you want to make a portable game you can play anywhere.",
      "content": "Use cards if you want to make a portable game you can play anywhere. Card games are a great, on-the-go alternative to bulky board games. Come up with one that just requires 1 deck of cards so you don’t need to carry around any extra props. For instance, brainstorm a variation of a classic game like Go Fish or Solitaire. [14] X Research source Try to keep the rules as simple as possible. When card games get too complicated or involved, they can be frustrating and not as fun. You can also create a game where you can play it by yourself with 1 deck, for instance, or add a second deck for multiple players. That way you can really play anytime, anywhere!"
    }
  ]
}