{
  "url": "https://www.wikihow.com/Install-a-Tub-Drain",
  "title": "How to Install a Tub Drain",
  "steps": [
    {
      "title": "Turn a foot lock stopper counterclockwise to take it out of the drain.",
      "content": "Turn a foot lock stopper counterclockwise to take it out of the drain. Foot lock stoppers are the simplest type of drain mechanism. All you need to do is rotate the stopper, or the part that moves up and down to open and close the drain. Pull up as you twist it counterclockwise until it lifts out of the drain flange. [1] X Research source Make sure the stopper is in the open position. You won’t be able to unscrew it if it’s closed. The drain flange, or drain basket, is the body that connects the tub and stopper to the waste pipe."
    },
    {
      "title": "Loosen the center screw if you have a lift-and-turn drain.",
      "content": "Loosen the center screw if you have a lift-and-turn drain. Lift-and-turn drains and some foot lock drains may have a screw in the center of the stopper that holds it in place. If there’s no visible screw, see if you can pop or twist off a cap on the stopper’s top. Then, using a screwdriver, turn the screw counterclockwise and lift the stopper out of the drain flange. [2] X Research source Some lift-and-turn drains simply twist out, so see if you can remove your stopper by turning it clockwise if you can’t find any screws."
    },
    {
      "title": "Remove the overflow plate and linkage if you have a lever-style drain.",
      "content": "Remove the overflow plate and linkage if you have a lever-style drain. Start by removing the screws that secure the overflow faceplate. Take off the overflow plate, and pull the linkage rod and plunger out of the overflow hole. Then remove any screws that secure the drain plate, and lift it out of the drain flange. [3] X Research source The overflow faceplate is the part with the lever on the tub wall beneath the faucet. The linkage connects the lever to a plunger, which drops down to stop the tub when the lever is down. You may also need to pull out lower linkage when you remove the drain plate."
    },
    {
      "title": "Unscrew the exposed drain flange with a drain key or pliers.",
      "content": "Unscrew the exposed drain flange with a drain key or pliers. After removing the stopper, you’ll see the exposed drain flange. The easiest way to remove it is to insert the head of a drain key into the flange and twist counterclockwise. You can find drain keys online and at home improvement stores. [5] X Research source If you don’t have a drain key, try sliding the handles of a pair of pliers down the flange past the X-shaped metal arms. Slide a strong screwdriver between the handles, and use it like a lever to turn the flange counterclockwise."
    },
    {
      "title": "Scrape off old plumber’s putty with a scrub pad or putty knife.",
      "content": "Scrape off old plumber’s putty with a scrub pad or putty knife. Once you’ve lifted the flange out of the drain opening, scrape away any putty left behind. Take care not to damage the tub's enamel and avoid using harsh, abrasive cleaning products. [6] X Research source Remove and discard larger pieces of putty by hand, then rinse away smaller bits. If necessary, wipe away any stubborn residue with rubbing alcohol."
    },
    {
      "title": "Spread a pencil-sized bead of putty around the rim of the new flange.",
      "content": "Spread a pencil-sized bead of putty around the rim of the new flange. Roll out a long, thin strand of plumber's putty about the size and thickness of a pencil. Place it on the underside of the new flange’s rim, then press it to cover the rim in an even layer. [7] X Research source Purchase plumber’s putty online, at home improvement stores, and at plumbing supply stores. The putty will help create a watertight seal."
    },
    {
      "title": "Slide a new gasket into the opening, then screw in the new flange.",
      "content": "Slide a new gasket into the opening, then screw in the new flange. If your new drain came with a rubber gasket, place it over the drain opening. Then fit the new flange into the opening and, using a drain key or pliers, rotate it clockwise until it’s tight. If necessary, scrape away excess plumber’s putty with a putty knife. [8] X Research source It shouldn’t be so tight that you can’t loosen it if it needs to be adjusted or replaced in the future. The gasket is a rubber ring that helps create a waterproof seal between the flange and waste pipe."
    },
    {
      "title": "Twist or screw on the new stopper, if necessary.",
      "content": "Twist or screw on the new stopper, if necessary. If the stopper isn’t already connected to the flange, attach it according to your product’s instructions. If it's a foot lock or lift-and-turn design, either twist it clockwise by hand or secure it with a screw. Specific installation steps vary, so be sure to follow the new drain’s manual."
    },
    {
      "title": "Thread the linkage through the overflow hole if you have a lever drain.",
      "content": "Thread the linkage through the overflow hole if you have a lever drain. If you’re installing a lever-style drain, insert the plunger and linkage into the hole in the tub wall beneath the faucet. Feed it into the overflow pipe, screw the overflow faceplate onto the opening, then screw the new drain plate onto the flange."
    },
    {
      "title": "Add some water to the tub to test the seal.",
      "content": "Add some water to the tub to test the seal. After you’ve installed the new drain, close the stopper and fill about ¼ of the tub with water. Let it sit for an hour, then go back and see if any water drained. If it’s around the same level as an hour prior, congratulations! You’ve installed your drain successfully! If the seal isn’t watertight, inspect the drain flange. Make sure it’s sitting flush with the tub and, if necessary, remove and reinstall it. If you’ve installed a lever-style drain, remove the overflow plate and linkage, and twist the linkage rod’s adjuster counterclockwise to extend the plunger. Some designs aren't adjustable and include linkage rods of various lengths, so you may need to swap the rod for a longer one. If you can’t find the problem on your own, you might want to consult a professional plumber. There’s no need to wait to fill the tub with water after installing the drain. You can use a fixture immediately after applying plumber’s putty."
    }
  ]
}