{
  "url": "https://www.wikihow.com/Get-a-Boy-to-Like-You-in-Fifth-Grade",
  "title": "How to Get a Boy to Like You in Fifth Grade",
  "steps": [
    {
      "title": "Let him see you having a great time.",
      "content": "Let him see you having a great time. If you want a boy to like you, then he should see that you're a fun girl to be around. You don't want him to think that you're one of those people who always depends on other people for fun, or who stands around with a frown on her face, worrying or just feeling cranky. Instead, you want him to notice you and to think, “Hey, that girl is always laughing or having fun. I should try to meet her.” This shouldn't be fake – you should just aim to be the kind of person who is always having a great time, no matter what. This doesn't mean you should put a fake smile on your face if you're really not feeling it. However, you should try to cultivate a positive attitude by focusing on the things that make you happy in conversation, instead of complaining about every little thing that goes wrong. Even if you're by yourself or about to take a math test, try to look on the bright side and to keep a smile on your face. Not every moment of your life will be a sheer joy, but you can think about something that you're looking forward to later when you're struggling to stay positive. If you're just walking to class by yourself, you don't need to do it with a dopey grin on your face, but you should avoid frowning, looking bored as you search through your cell phone, or generally looking disengaged. If you avoid distractions and stare ahead with a happy, or at least neutral look on your face, then the boy is more likely to notice you."
    },
    {
      "title": "Have confident body language.",
      "content": "Have confident body language. When it comes to showing that you're confident, body language is half the battle. You should walk with straight posture and avoid slouching, whether you're sitting down or standing up. Keep your arms at your sides instead of folded over your chest so that you look approachable. Look straight ahead if you're alone, or make eye contact if you're talking to people, instead of looking at the floor. Though you may not always feel confident, showing confidence with your body language can go a long way in making you feel more secure. Another way to have confident body language is to avoid fidgeting as much as you can. Try to avoid biting your nails, playing with the bottom of your shirt or your hair, or anything else that will make you look nervous. When you're standing in a group of people, try to stand tall instead of shrinking back so you get noticed and feel comfortable."
    },
    {
      "title": "Don't be afraid to smile at him.",
      "content": "Don't be afraid to smile at him. You may be feeling shy when it comes to the boy you like, but a small, sweet smile can go a long way in making the boy notice you. All you have to do is smile at the boy when you make eye contact, and this will instantly make you look more friendly and approachable. You shouldn't try to catch his eye and smile at him every single time, but you should make an effort to smile at him if you lock eyes and it feels right. You should especially do this if you both pass each other in the halls, just to be friendly. If you're feeling shy about this, you can give him a quick smile and then look away. You don't have to look too eager – the goal is to look friendly and approachable so he notices you and wants to get to know who you are."
    },
    {
      "title": "Stand out to him.",
      "content": "Stand out to him. To get a boy to notice you, you should let him see what makes you different. You don't have to show off or hog all the attention to do this, either. If you love fashion, then let him see your latest homemade necklace or unique dress. If you like soccer, then talk about how much the sport means to you, or even invite him to watch you play. If you're known for your sense of humor, then crack some jokes in his company. Your goal is to make him see that there's something special about you, which will make him want to get to know you more. [1] X Research source Avoid bragging about the things you're good at. Instead, just talk about how much you love to paint, write poetry, do gymnastics, or pursue one of your other hobbies, and he'll see that you're passionate about it. Don't stand out just for the sake of standing out. Dying your hair pink isn't a good idea if all you want to do is to get his attention; however, if you really do want pink hair, then go for it! Remember that if you're doing something just for the sake of attention, he will be able to tell."
    },
    {
      "title": "Don't use your friends to talk to him.",
      "content": "Don't use your friends to talk to him. At your school, it can be pretty common for you to ask your friends to talk to the boy you like for you. You may ask them to ask him if he likes you, or just to run up and talk to him for you. However, if you want to impress the boy and get him to really notice you, then you shouldn't get your friends to do the hard work for you. Show that you're more mature than a lot of girls your age and that you're comfortable enough to talk to the boy yourself. [2] X Research source Whether you want to say hi or even feel ready to tell him you like him, you should talk to him on your own. He'll be impressed by this and will want to get to know you. Having your friends write notes to the boy, or even writing them yourself, also makes it look like you're afraid to talk to him yourself. Instead, just take a deep breath and talk to him face to face."
    },
    {
      "title": "Wow him with your confidence.",
      "content": "Wow him with your confidence. Boys can be really impressed by girls who know who they are and who are happy with themselves. Though developing true confidence can take a lifetime, you can make an effort to love yourself and your life, so that you can use that energy to make others feel good about themselves, too. If you want to get a boy to notice you, then he should see you smiling, feeling good about yourself, and giving off a positive, satisfied energy. At this age, boys also tend to like girls who don't care too much about their appearance. You should still look good, just don't use excessive makeup or be obsessed with how you look, because that makes you look a little bit insecure. [3] X Research source Here are some other ways to impress the boy you like with your confidence: Don't put yourself down in front of him. Instead, focus on the good aspects of yourself – without bragging. Being down on yourself just puts the boy in an awkward position, and you want him to feel comfortable, and to not feel like you need him there to feel good about yourself. It's okay if you're feeling a little nervous about talking to him. If you stutter, forget what you were going to say, or find yourself rambling on about nothing, make sure you're able to laugh at yourself a little and to brush it off. It's okay if he doesn't think you're the smoothest person in the world; what's important is that he sees that you're comfortable with yourself. When you talk about other girls, stick to the things you like about them. Nothing will make you look insecure faster than putting down other girls."
    },
    {
      "title": "Be nice to everyone who deserves it.",
      "content": "Be nice to everyone who deserves it. Don't think that you should be a Mean Girl or to make other people look stupid just to get the boy's attention. If he's a good guy, then he'll be much more impressed by the fact that you're a nice person than if you're putting other people down or giving people the cold shoulder just to look cool. Instead, work on being friendly to any person who is nice to you, or even to someone who is a little shy; give people the benefit of the doubt until they prove that they're not worth it. If you're a generally nice person, then the boy will be more likely to know who you are, and to want to get to know you. Everyone has a reputation to uphold. If you're known for being a snob, then the boy will hear about it. Instead, be genuinely nice to people so you're open to more friendships and experiences. You don't have to be super outgoing to do this, either. Just saying hi to people and asking how their day is going can go a long way in helping you make friends and to come off like a nice person. If you hang out in circles where girls tend to gossip a lot of to be mean to each other, then ask yourself if it's time for a friend spring-cleaning. Even if you're not the one being mean, it's no fun to be associated with people who are being cruel."
    },
    {
      "title": "Ask him questions.",
      "content": "Ask him questions. If you want the boy to like you, then it's not all about making him think that you're a fascinating, awesome person. You have to show that you're interested in him, too. To do this, you have to ask him a few questions about his life to keep him interested and to show that you're more than just a pretty face. Make sure there's a balance in the conversation between talking about yourself and asking him questions, and he'll see that he likes talking to you a lot. Here are some questions you can ask him about: What he did over the weekend His plans for the summer or upcoming holidays His pets His favorite bands, TV shows, movies, or books His hobbies and interests"
    },
    {
      "title": "Don't come on too strong.",
      "content": "Don't come on too strong. Another way to keep the boy interested is to not overwhelm him by coming on too strong. You can compliment him and make it pretty clear that you like him if he shares your interests, but you shouldn't glue yourself to him or constantly spend time with him. Give him time to miss you, to wonder what you're doing, and to appreciate that you have your own life. If you make your life all about him, then he'll lose interest pretty soon. You don't want him to think that you're too intense. Even if you really, really like him, you should wait for the relationship to deepen before you share your true feelings. [4] X Research source One way to avoid coming on too strong is to avoid texting him or checking in on him all the time. You can check in with him to say hi, but don't make it seem like all you do is think about him when you're not together."
    },
    {
      "title": "Make him feel special.",
      "content": "Make him feel special. If you want to hold a guy's interest, then you have to make him feel like he's special to you – without coming on too strong, of course. If he starts treating you like you're special to him, then you should do the same, by paying a bit more attention to him in groups, asking him how he's doing, or even giving him a subtle compliment about his clothes or something that isn't overly personal. If you want to keep the boy around, then he has to know that you care for him. You don't have to come right out and say it, but you can let your actions show that you care for him. If you're in a group, pay more attention to him than the other boys, but don't stick by his side the whole time. He should take the first step and come to you, sometimes. Don't give him the same compliments you might give someone else. Let him see that he really does stand out to you."
    },
    {
      "title": "Find common ground.",
      "content": "Find common ground. Another way to hold a boy's interest is to find some common ground. You probably don't have everything in common, but having just a few things to talk about can help you relate to each other and keep the conversation going. Don't worry if you feel like you're really different people and you have nothing to talk about; once you relax a bit and keep the conversation moving forward, you'll find that you have more in common than you thought. Here are some common bonds you may find, which will give you a lot to talk about: A favorite sports team A favorite TV show or movie A favorite band Favorite video games Pets Friends in common Favorite hobbies"
    },
    {
      "title": "Be a good listener.",
      "content": "Be a good listener. Another way you can hold the boy's interest is to be a good listener. When he talks to you, put away your phone or any other distractions that would keep you from hearing him out. Let him finish what he has to say before interrupting. Don't tell him that you know exactly how he feels any time he shares an emotion with you. Show that you really care about who he is and what he has to say instead of talking about yourself the whole time. Just make eye contact, turn your body toward the boy, and give him all of your attention to show that you care. Remember that it should work both ways; you should listen to him just as much as he listens to you. Pay attention to what he tells you so you can follow up about it later. If he tells you he has a big baseball game this weekend, for example, you can ask him how it went on Monday. This shows that you're keeping track of the things that he tells you and that it means something to you."
    },
    {
      "title": "Don't gossip or put other people down.",
      "content": "Don't gossip or put other people down. If you want the boy to continue to be interested in you, then you should avoid gossiping or saying bad things about the people you both know, or you will give off the wrong impression. If you're always gossiping about other girls, then he'll think that you're mean and that you don't care about other people. He'll also sense that you're insecure and may think that you like to put people down just to feel better about yourself. You should avoid being that girl and talk about the things you like, or the things you're looking forward to instead. If other people around you are gossiping, just excuse yourself or even offer a different opinion. You don't want to look like a follower. Boys tend to hate drama. If you gossip in front of the boy, he'll think that you're the kind of girl who likes to bring on the drama, and he most likely will want to back off."
    },
    {
      "title": "Don't do anything you're not comfortable with.",
      "content": "Don't do anything you're not comfortable with. Though you're only in the fifth grade, which means that most people haven't kissed or done anything else yet, some boys will be ready to move further than you want. You should only kiss boys when you're ready, and you should never do it just because you think it'll keep a boy interested. If the guy you like is the type of person who will only like you if you kiss him, then he's not worthy of your time. Make sure that you feel completely comfortable before you do anything with a boy, and that you do it because you want to, not because you feel pressure. The real way to keep a boy interested is to be firm in your convictions and to stick to what you know is right. [5] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source If a boy is pressuring you to do something before you're ready, calmly tell him that you're just not interested. Hold your head high and don't let him get to you. You'll feel much better in the long run."
    },
    {
      "title": "Be a fun person to be around.",
      "content": "Be a fun person to be around. Guys in fifth grade don't tend to take life too seriously; they just want a girl they can have fun with. They're not quite at the age when they want to spend all of their time alone with a girl, and they're not really ready for intense relationships. Instead, they want girls who are lighthearted, who have fun friends, and who are spontaneous and up for trying something new. If you like to worry or are more quiet by nature, then that's fine; you can't change yourself, but you can work on keeping up more fun, lively conversation, and cutting down on the negativity and complaints, if you do that. It shouldn't be hard for you to burst into laughter. Don't hold back if something is funny and show that you're really having a great time. One way to be a fun person is to know how to make people feel at ease. Make eye contact with people, ask them easy questions about themselves, and introduce them to each other if they don't know each other. Make them feel at home, and they'll be more relaxed and more likely to have fun."
    },
    {
      "title": "Be nice to his friends.",
      "content": "Be nice to his friends. If you want the boy to like you for a long time, or even for him to ask you out and date you, then you have to make an effort to be nice to his friends. Though it can be hard to be nice to his group of friends, especially if you really don't know any of them or if you're just a naturally shy person, you have to try as hard as you can to make a positive impression on the people that matter to him. If his friends think you're mean to them, too controlling, or just plain annoying, then they'll let him know how they feel and may be able to influence him. Unless they're really mean people, you should stay on their good sides and show them what a great catch you are. If his friends are jerks, then you don't have to entertain them just for the sake of impressing him. But if they're nice guys, then you should try to be nice, too, even if you don't have all that much in common. Don't be frustrated if this takes a bit of work. It's only natural that a lot of girls and guys aren't super comfortable with talking to each other yet."
    },
    {
      "title": "Don't drop everything for him.",
      "content": "Don't drop everything for him. If you want to keep things interesting, then you have to continue to do your thing. Don't stop talking to your friends, spending time with your family, going to swim meets, or doing the things you love to do just because you're suddenly spending time with your crush. While you should make time for him so that your relationship can grow, you shouldn't give up everything you care about for the sake of a boy. He'll respect you more because he'll see that you're okay with doing your own thing while maintaining a relationship. Your friends will always be there for you, no matter what, while it can be a different story when it comes to guys. Don't be the girl who drops her friends to hang out with a boy and then has to come crawling back to them when the relationship is over. Doing the things you love to do, from playing piano to drawing, makes you who you are. If you stop doing those things for a boy, then you're giving up a part of yourself. If you and the boy really like spending time together, then you can include him in some of your favorite interests, such as watching a show you like together."
    },
    {
      "title": "Check in when he's not around.",
      "content": "Check in when he's not around. If you want the relationship to thrive, then you should check in to say hi to the boy from time to time when you're apart. This could be when you're apart for a few weeks because of summer vacation, or just when you're apart for a weekend during school. You shouldn't contact him every five seconds, or even every day, but just a quick text, Facebook message, or even a phone call will let him know that he's still on your mind. Make sure that he returns your feelings and also gets in touch with you when you do this, so that there's a balance in your relationship. If he told you he has a big basketball tournament this weekend, send him a quick text the next day to see how it went. But don't try to text him right before the game or he'll feel a bit overwhelmed. This is where playing hard to get comes in. You want to check in enough to show that you care, but not so much that he thinks you're spending a lot of time thinking about him."
    },
    {
      "title": "Don't take yourself so seriously.",
      "content": "Don't take yourself so seriously. At the end of the day, you have to remember that you're only in the fifth grade, and that the chances that the boy you like is your soul mate and that you'll be together forever – or even for a few months – are pretty low, so you shouldn't bank too much on your relationship. If he's not interested, then just smile, catch your breath, and prepare for the next boy who will come your way. And if he's interested but things aren't working out the way you planned, then you shouldn't be too disappointed. The important thing is that you enjoy your time at school and your friendships, and that you get something out of the relationship. As far as dating goes, you have a lifetime of boys ahead of you! The more relaxed you are about getting a boy to like you, the happier you'll feel because you won't be putting pressure on yourself. It's important to enjoy your life instead of fretting over getting boys to like you too much. In the end, the right boy will come along and sweep you off your feet."
    }
  ]
}