{
  "url": "https://www.wikihow.com/Keep-Me-Updated-Meaning",
  "title": "What Does “Keep Me Updated” Mean and How Do You Use It?",
  "steps": [
    {
      "title": "It means you want to be informed about what is going on.",
      "content": "It means you want to be informed about what is going on. “Keep me updated” is a formal English phrase that lets you know that someone wants to know how something goes, ideally whenever details become available. If a coworker says “keep me updated on that project” they want you to let them know how the project is developing. [1] X Research source If a friend wants you to keep them updated on a job search, they want you to continuously inform them about your efforts to find a job."
    },
    {
      "title": "Use it when you want frequent updates about what’s happening.",
      "content": "Use it when you want frequent updates about what’s happening. “Keep me updated” is used in many different contexts, but it is mainly used to let someone know that you want to be consistently informed about what’s happening, whether it be about something going on in their personal life, a project at work, or just a food delivery order. Example: “Hey, I know you’ve been trying to get back in the dating scene. Keep me updated on how that goes. If you need any pointers, let me know.” Example: “I’m eager to hear about how the job search goes! Make sure you keep me updated.” Example: “We’re on deadline with those projects so keep me updated on your progress.” Using “keep me updated” can help establish a connection with someone , as it lets them know that you care about what’s going on in their life."
    },
    {
      "title": "Update someone whenever there is a significant change in a situation.",
      "content": "Update someone whenever there is a significant change in a situation. If your boss wants updates on your work, send them updates whenever you make big changes. If you’re updating a friend on big life changes, like a new relationship or job, let them know as soon as something develops, like a new round of interviews or a first date . If you’re driving to someone, let them know when you get in the car and when you arrive at the destination. [2] X Research source If you're on deadline at work, send frequent updates on important changes. Depending on how tight the deadline is, this can be every few hours or at the start of everyday."
    },
    {
      "title": "Say “For sure, I’ll keep you updated” and provide timely updates.",
      "content": "Say “For sure, I’ll keep you updated” and provide timely updates. If someone asks you to keep them updated, respond with a positive tone and say something like, “For sure, I’ll keep you updated!” If you want to be more professional , respond with something a little more formal, like, “I will inform you as soon as I have an update.” Once you receive new information, update the person with that information immediately. [3] X Research source"
    },
    {
      "title": "There are plenty of formal and casual ways to say “keep me updated.”",
      "content": "There are plenty of formal and casual ways to say “keep me updated.” The phrase “keep me updated” is fairly formal, but there are plenty of other ways to convey the same message. Each phrase is an imperative , meaning it's a request or demand and starts with a verb (like \"keep\" or \"let\"). Imperatives are also typically used in the second-person perspective, meaning the subject is \"you,\" but the subject is usually only implied and not explicitly stated in the sentence. [4] X Research source These phrases work for both formal and casual situations, so use them interchangeably when you see fit: “Keep me informed” is typically used in formal situations, like at work or in a meeting. “Keep me posted” is typically used in casual situations, like a friendly chat between friends. “Keep me in the loop” can be used in both casual and professional situations. “Let me know about any changes” is fairly neutral and can be used in both casual and professional situations. “Update me as things progress” is typically used in formal situations. “Let me know what happens” is fairly neutral, but is typically used in casual situations. Note that while you may say either \"Keep me updated \" or \" Update me often,\" you can say \"Keep me posted ,\" but \"Post me\" is grammatically incorrect."
    },
    {
      "title": "Use these prompts to include a sense of urgency in your emails.",
      "content": "Use these prompts to include a sense of urgency in your emails. Whether you want your coworkers to frequently update you on their work, need updates on a professional project you’re working on, or you’re looking to update others, use “keep me updated” in an email to inform them that you’re looking for timely updates. Use the following messages to close out your emails with urgency: [5] X Research source “I look forward to hearing more about this project. Keep me updated on how everything goes and reach out if you’re having any trouble.” “I appreciate you for taking the time out of the work schedule to help me with this project. Please let me know if you need anything and keep me updated if anything changes.” “You’re seriously a life saver! The guidelines for this project are tough, so keep me updated on your progress and let me know if you need any clarification.” “Thank you for sitting down with us for the interview today. I will keep you updated with the next steps.”"
    }
  ]
}