{
  "url": "https://www.wikihow.com/Make-Straight-Hair-Wavy",
  "title": "How to Make Straight Hair Wavy",
  "steps": [
    {
      "title": "Wash and condition your hair.",
      "content": "Wash and condition your hair. Follow your normal routine to wash and condition your hair. Aim to do this around late afternoon or evening or whenever you have time to let it air dry."
    },
    {
      "title": "Towel dry your hair.",
      "content": "Towel dry your hair. Use a towel to get extra moisture out of your hair before letting your hair air dry. Your hair should be damp or about 75% dry. If you don’t want to wait for it to air dry, then use a hair dryer to get it 75% dry."
    },
    {
      "title": "Add curl-enhancing cream or mousse to your hair.",
      "content": "Add curl-enhancing cream or mousse to your hair. Apply a quarter-sized dollop of curl-enhancing cream or curl-enhancing mousse to your hair. Mousse will give your straight hair more volume, while curl-enhancing cream will help to keep your hair smooth. You can also add texturizer to your hair. This can help straight hair from falling flat. Depending on the length and texture of your hair, you may want to use a different hair product. For example, volumizing mousse is better for stick-straight or fine hair. Styling cream may help control frizz and flyaway hair for thicker hair. [1] X Research source"
    },
    {
      "title": "Scrunch up your hair.",
      "content": "Scrunch up your hair. Once you have mousse throughout your hair, use both hands to scrunch up your hair. Do this all over your head. Your hair won’t really hold the waves at this point, but it will help your hair from going stick-straight."
    },
    {
      "title": "Let your hair dry almost completely.",
      "content": "Let your hair dry almost completely. Take some time to let your hair air dry. If you have really long hair, this might take a while. You can speed it up somewhat by turning up the heat in your house or going into the sunshine for a bit."
    },
    {
      "title": "Apply texturizer spray.",
      "content": "Apply texturizer spray. Spritz texturizer throughout your hair. This hair product will help your hair hold waves in it."
    },
    {
      "title": "Braid your hair into 4-5 braids.",
      "content": "Braid your hair into 4-5 braids. Separate your hair into 4 or 5 chunks. Braid each one loosely. You can use a rubber band or bobby pin to hold each end. You can also just scrunch or twist the end of the braid and it might hold on its own (especially if you’ve used enough texturizer), but using a hairband or bobby pin is best. You can also twist your hair instead of braiding it."
    },
    {
      "title": "Leave the braids in overnight.",
      "content": "Leave the braids in overnight. Go to sleep in your braids. Don’t worry if they get messed up or one of them comes loose. You’re going for a wavy, slightly messy look anyway."
    },
    {
      "title": "Undo the braids carefully.",
      "content": "Undo the braids carefully. When you wake up in the morning, gently undo the braids in your hair. Don’t run your fingers through the braids to undo them. This will reduce the waves."
    },
    {
      "title": "Scrunch up your hair a little bit and add hairspray.",
      "content": "Scrunch up your hair a little bit and add hairspray. Use your hands to carefully scrunch your hair all over your head. Then add some hairspray to hold the shape."
    },
    {
      "title": "Rebraid your hair every night.",
      "content": "Rebraid your hair every night. When it’s bedtime again, put 4-5 braids in your hair again. You don’t need to start the process from scratch every night. Instead, skip washing your hair. You may want to add a tiny bit of texturizer spray to your hair before braiding, although you may already have enough product in your hair. If you have very fine or short hair and it tends to get stringy quickly, you might want to wash your hair every night. In this case, you’ll have to start the process from the beginning."
    },
    {
      "title": "Make a salt spray.",
      "content": "Make a salt spray. A homemade salt spray is easy to put together and you can use it to get the same kinds of waves that you have after a day at the beach. [2] X Research source Put the following ingredients into a clean spray bottle: 1 cup of hot water 1-2 teaspoons of sea salt 1 tablespoon of coconut oil or argan oil (or you can use a half tablespoon of each) ½ teaspoon leave-in conditioner"
    },
    {
      "title": "Shake up the ingredients in the spray bottle.",
      "content": "Shake up the ingredients in the spray bottle. Mix well to ensure that the sea salt dissolves and the other ingredients are mixed well. This should only take about a minute of good shaking."
    },
    {
      "title": "Wash and towel dry your hair.",
      "content": "Wash and towel dry your hair. Use your normal routine for washing your hair. Use a towel to soak up extra moisture out of your hair."
    },
    {
      "title": "Spray your hair with the salt spray.",
      "content": "Spray your hair with the salt spray. Spray liberally all over your hair. Flip your hair upside down and get the underside of your hair as well."
    },
    {
      "title": "Scrunch your hair with your hands.",
      "content": "Scrunch your hair with your hands. When your hair has been sprayed with the salt spray, use your hands to scrunch through all of your hair. Do this for a few minutes."
    },
    {
      "title": "Put your hair in a loose braid and let it dry.",
      "content": "Put your hair in a loose braid and let it dry. Take all of your hair and braid it into one or two big braids. Let your hair dry."
    },
    {
      "title": "Take out the braid and scrunch some more.",
      "content": "Take out the braid and scrunch some more. When your hair has fully dried, take out the braid. Give your hair a good shake. Then, apply some styling cream using the palms of your hands, and use your hands to scrunch through your hair some more."
    },
    {
      "title": "Add hair product to your hair.",
      "content": "Add hair product to your hair. Starting with dry hair, rub a quarter-sized dollop of hair product through your hair. Mousse and texturizer are good options. These will both give your hair volume and help hold the style longer. If you have short hair, use less hair product in your hair. Otherwise, your hair can get weighed down too much. [3] X Research source Find a strong hold mousse to get maximum hold throughout the day. [4] X Research source"
    },
    {
      "title": "Use a curling iron with a medium-sized barrel.",
      "content": "Use a curling iron with a medium-sized barrel. This size of curling iron will allow you to make a slightly tighter curl in your hair. The heat from the curling iron will be able to reach every strand of hair more easily this way. If you use a large-barreled curling iron, your hair will not hold the waves as well. [5] X Research source"
    },
    {
      "title": "Pin up the top layers of hair.",
      "content": "Pin up the top layers of hair. Take the hair around the crown of your head and pin it up. This will keep it out of the way while you curl the hair underneath."
    },
    {
      "title": "Curl a small chunk of hair at a time.",
      "content": "Curl a small chunk of hair at a time. Take 1 small chunk of hair at a time and wrap it around the curling iron. Make sure not to clamp the iron shut on the hair. Instead, wrap the strand around the outside of the iron and leave 1 to 2 in (2.5 to 5.1 cm) extending from the barrel. Hold for a few seconds and let it go. [6] X Research source A styling wand is another good option for curling your hair."
    },
    {
      "title": "Work through your hair, curling in chunks.",
      "content": "Work through your hair, curling in chunks. Continue to curl your hair, taking down the hair that has been pinned up."
    },
    {
      "title": "Flip your head upside down and give a shake.",
      "content": "Flip your head upside down and give a shake. You don’t want all the curls to stay in corkscrews. Turn your head upside down and toss your head around. [7] X Research source Don’t comb your fingers through the curls unless you want a very subtle wave."
    },
    {
      "title": "Finish off with hairspray.",
      "content": "Finish off with hairspray. Use a strong hold hairspray to cover your hair. Spritz hairspray all over. Careful not to overdo it, especially if you have shorter hair. Too much hairspray will make your hair look crunchy."
    },
    {
      "title": "Wash and dry your hair.",
      "content": "Wash and dry your hair. Follow your usual routine for washing your hair. Add conditioner and rinse it out. Use a towel to dry your hair so that it is just damp."
    },
    {
      "title": "Apply foam mousse to your hair.",
      "content": "Apply foam mousse to your hair. Foam mousse will add texture and volume to straight hair, helping to hold the shape of wavy hair. [8] X Research source Dispense a quarter-sized amount into the palm of your hand. Gently work it through all of your hair. If you have really long hair, you might want to use more. If you have pretty short hair, start with a smaller amount."
    },
    {
      "title": "Divide and twist your hair into 1 to 2 in (2.5 to 5.1 cm) sections to reduce frizz.",
      "content": "Divide and twist your hair into 1 to 2 in (2.5 to 5.1 cm) sections to reduce frizz. Use your finger to twist each of these sections. Slide your finger out from the coil to keep it twisted while you diffuse it. Your hair will have more movement and body as a result of these twists. If the twists come loose at any time while you are drying them, you can just retwist them."
    },
    {
      "title": "Use a diffuser on your hair dryer.",
      "content": "Use a diffuser on your hair dryer. A diffuser is an attachment to a hair dryer. It is round with prongs that come out of one end. The diffuser will reduce the velocity of the air coming from your hair dryer, which leaves your hair less frizzy. It will also help with wave and curl formation. [9] X Research source [10] X Research source Use a medium to cool setting on your hair dryer. It’s best to use the cool setting, as this temperature will “set” your hair better. Tilt your head upside down or sideways. Place sections of your hair into the diffuser and move the diffuser up towards your scalp. Let your hair get about 80 to 90% dry. Stand upright and finish drying your hair with the diffuser."
    },
    {
      "title": "Use a funnel system attachment.",
      "content": "Use a funnel system attachment. Instead of a diffuser, you can use a funnel system attachment. [11] X Research source This attaches directly onto the mouth of your hair dryer. Place your hair through the funnel and turn on your hair dryer to a cool setting."
    },
    {
      "title": "Scrunch up your hair.",
      "content": "Scrunch up your hair. After your hair is dry, turn off your hairdryer and scrunch your hair with your hands. This will give your hair a little bit more wave to it."
    },
    {
      "title": "Spray hairspray over your waves.",
      "content": "Spray hairspray over your waves. To set your look, spray hairspray over your hair. Hold the container of hairspray a few inches from your head and spritz all over."
    },
    {
      "title": "Prepare your hair.",
      "content": "Prepare your hair. Follow your usual routine for washing your hair. Add conditioner and rinse it out. Use a towel to dry your hair so that it is just damp."
    },
    {
      "title": "Add hair product to your hair.",
      "content": "Add hair product to your hair. Use foam mousse, styling cream or texturizer to your hair. Make sure it’s spread throughout your hair. Focus on the mid-length to the ends of your hair. If you have pretty short hair, don’t use hair product on your roots. This can make your hair look stringy."
    },
    {
      "title": "Separate your hair into 10 to 15 sections.",
      "content": "Separate your hair into 10 to 15 sections. Each chunk of hair will be about 1 to 2 inches (2.5 to 5.1 cm) wide. It might help to pin up some of the hair around the crown of your head so you can work with the hair underneath. The bigger the sections, the wavier your hair will be. If you have very small sections of hair, your hair will end up more as curls."
    },
    {
      "title": "Wrap the first section around your fingers",
      "content": "Wrap the first section around your fingers . Roll the end of the section around your index finger and thumb. This will make a loop. Then keep rolling the hair around the loop up to the scalp."
    },
    {
      "title": "Secure with a bobby pin.",
      "content": "Secure with a bobby pin. When you’ve curled the entire section of hair up to your scalp, use a bobby pin to keep the curl against your head."
    },
    {
      "title": "Continue making pin curls all over your head.",
      "content": "Continue making pin curls all over your head. Pin up the rest of your hair in the same manner. You’ll have lots of bobby pins in your hair. Be sure to pin them against your head so that they don’t stick out and poke into your head."
    },
    {
      "title": "Let your hair air dry overnight.",
      "content": "Let your hair air dry overnight. Go to sleep in your pinned-up hair. If you’ve secured the bobby pins flat against your head, then you shouldn’t get poked by any of them in your sleep."
    },
    {
      "title": "Take out the pins and shake out your hair.",
      "content": "Take out the pins and shake out your hair. When you wake up, remove the bobby pins. Shake out your hair by turning your head upside down and tossing your head around. If you don’t shake out your hair and run your fingers through it, your hair will still be curly. To make it wavy, run your fingers through your hair or use a brush to soften the curls into waves."
    },
    {
      "title": "Finish off your look with hairspray.",
      "content": "Finish off your look with hairspray. Spritz some hairspray on your hair to hold the style."
    }
  ]
}