{
  "url": "https://www.wikihow.com/Learn-to-Dance-at-Home",
  "title": "How to Learn to Dance at Home",
  "steps": [
    {
      "title": "Choose the style of dance that you want to learn.",
      "content": "Choose the style of dance that you want to learn. There are so many different types of dance which means that there is bound to be a style that suits you. Look at dance books, watch dance videos online, or see dancers perform to find a style that you want to focus on. Some popular types of dance include ballet , jazz, contemporary, ballroom , and hip hop. [1] X Research source Explore as many different types of dance as you can to find one that you think that you will enjoy."
    },
    {
      "title": "Warm up",
      "content": "Warm up and stretch before you begin dancing. Jog on the spot for 1-5 minutes until you can feel your heart rate increase. Move your ankle, shoulder, and hip joints in small circles. Stretch out your hamstrings by laying on your back and drawing each knee to your chest and then extending your leg. Repeat lunges 5-10 times to stretch out your thighs. [2] X Research source There are many warm up workouts for dance available online. Try many different warm-ups to see what you prefer. Warming up before you dance helps to enhance your body’s performance and to prevent injuries."
    },
    {
      "title": "Cool down",
      "content": "Cool down for approximately 10 minutes once you have finished dancing. Start to cool your body down by gradually reducing the speed and intensity of your dance workout, to begin lowering your heart rate. Continue dancing, but dance more slowly or pick a slower song. Try not to raise your heart rate again during your workout. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you prefer, you can stretch each of your muscles that you worked on during your warm-up for 15 seconds each. [4] X Research source Make sure to drink some water once you have finished dancing to rehydrate."
    },
    {
      "title": "Practice strength and flexibility exercises to improve your dance ability.",
      "content": "Practice strength and flexibility exercises to improve your dance ability. Dance requires many different forms of exercise to help you feel like a fitter, stronger, and more confident dancer. Practice strength exercises regularly such as lifting weights , climbing stairs , or yoga . Try out pilates , tai chi, or stretching to improve your flexibility. [5] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Choose dance videos to follow along to learn the moves and routines.",
      "content": "Choose dance videos to follow along to learn the moves and routines. Use a search engine or the YouTube search bar to find instructional videos for your chosen style of dance. Pick 1-2 videos that are designed for beginners and that seem easy to follow. [6] X Research source Remember that when you're watching dancers on a video, their moves will mirror yours. This means that you should match the side of the body that the instructor is moving with the same side of your own body. [7] X Expert Source Yolanda Thomas Dance Instructor Expert Interview. 15 November 2019. Try to stay away from the instructional videos that are geared towards more advanced dancers until you practice more and feel more confident in your ability."
    },
    {
      "title": "Mirror the movements of the instructor in the dance video.",
      "content": "Mirror the movements of the instructor in the dance video. Face the dance instructor in the video and pretend that you are the mirror image of the instructor’s movements. Watch the instructor at all times and try to keep up with all of the steps. [8] X Expert Source Yolanda Thomas Dance Instructor Expert Interview. 15 November 2019."
    },
    {
      "title": "Learn the dance steps and sequences in order.",
      "content": "Learn the dance steps and sequences in order. It’s likely that the video that you are watching will consist of a few different steps to learn. Practice each of these steps until you feel confident performing them. Then learn the sequence of the steps, paying attention to what step to start with and how to transition to the next one. [9] X Research source Once you have learned the steps, it may still take a bit of practice to learn the order. Although the instructor may explain the steps and sequence verbally, it’s easiest to learn to dance visually by watching and then following along. [10] X Research source"
    },
    {
      "title": "Keep to the rhythm of the music as you are learning.",
      "content": "Keep to the rhythm of the music as you are learning. When learning how to dance, listening to the beat and the rhythm of the music can help you to remember the sequence of the steps. [11] X Expert Source Yolanda Thomas Dance Instructor Expert Interview. 15 November 2019. Concentrate on listening to the music and always dance to music rather than without while you are learning a new routine. [12] X Research source If you are struggling to hear the beat in the music, try tapping your foot, clapping your hands, or counting to 8 along with the rhythm."
    },
    {
      "title": "Practice the dance moves and routines until you feel confident.",
      "content": "Practice the dance moves and routines until you feel confident. Continue following along with instructional dance videos until you can dance without needing to watch the video. Then begin dancing without the guidance of the videos by playing the music and trying to remember the steps on your own. You can always go back and watch the dance videos if you need a quick reminder. [13] X Research source The more that you practice the dance steps and routine, the easier it will get to remember on your own over time."
    },
    {
      "title": "Dance in front of a mirror to see how you can make improvements.",
      "content": "Dance in front of a mirror to see how you can make improvements. Pick a space where there is enough room for you to move and place a large mirror in front of you. Practice your dance moves and routines in front of the mirror and look out for any parts that you think you could improve on. Then, practice adjusting your steps slowly and incorporating these into your dance. [14] X Research source Alternatively, you can video yourself dancing. Having a collection of videos of yourself dancing will also let you watch your progress over time."
    },
    {
      "title": "Go dancing with your family or friends to have fun with your new moves.",
      "content": "Go dancing with your family or friends to have fun with your new moves. Once you feel confident in your dancing ability, it’s time to enjoy yourself and reap the rewards of all of your hours of practice! Invite your family or friends out to a dance class, party, bar, or club. Alternatively, you can invite them over to your home for an informal night of dancing and fun. [15] X Expert Source Yolanda Thomas Dance Instructor Expert Interview. 15 November 2019."
    },
    {
      "title": "Follow the beat of the music and move with it.",
      "content": "Follow the beat of the music and move with it. Simply listen closely to the rhythm of the music before you begin dancing. Try tapping your foot or bopping your head along to help you to find the beat. Once you know the beat, line up your moves in time with the beat to create a sequence that flows to the music. [16] X Expert Source Yolanda Thomas Dance Instructor Expert Interview. 15 November 2019. A mistake that is common with beginner freestyle dancers is to jump straight in and start moving before they have established the beat. Taking a moment or two to simply establish your moves to the beat will make learning to dance freestyle much easier."
    },
    {
      "title": "Move your arms and legs to the beat of the music.",
      "content": "Move your arms and legs to the beat of the music. Dancing freestyle is all about moving in a way that feels right for you in time to the music, rather than following specific steps of routines. Keep your moves simple and make sure that each movement is in time with the beat. For example, you could cross your arms in front of you and snap your fingers for 1 beat, and then bring your arms to your sides again for the next. Combine this move with stepping from side to side and bopping to the music. [17] X Research source While you are freestyle dancing, look around and see what the other dancers are doing. Try out new moves if you prefer and remember that the more you practice, the more confident you will feel!"
    },
    {
      "title": "Have a dance move that you spend most of the time doing.",
      "content": "Have a dance move that you spend most of the time doing. Choose a basic move that you feel the most confident with. Perform this to the beat of the music. A good, basic freestyle move is the step-touch. Simply step from side to side, adding a little bounce with each step and snapping your fingers along to the beat of the music. [18] X Research source"
    },
    {
      "title": "Pick 1-2 other moves that you perform occasionally during the dance.",
      "content": "Pick 1-2 other moves that you perform occasionally during the dance. Choose some moves that you feel less confident with. When the rhythm feels right, include these moves into your dance, and continue your familiar, basic move for the majority of the time. Over time you will gradually feel more confident with your additional moves. [19] X Research source If you find your less practiced moves difficult, simply continue dancing with your basic move until you feel ready to try again."
    },
    {
      "title": "Practice the 5 fundamental positions to begin learning ballet.",
      "content": "Practice the 5 fundamental positions to begin learning ballet. All beginner ballet dancers need to learn the basic positions to create a good foundation for practicing ballet. Your arms and legs change in posture for each position. There are many tutorials and dance videos available online that detail how to perform each ballet position."
    },
    {
      "title": "Learn to do the passe for a simple jazz position.",
      "content": "Learn to do the passe for a simple jazz position. Bend your right leg to the side and turn your knee out. Hold your right leg so that your baby toe is just below your left kneecap. Keep your arms by your sides. [20] X Research source Make sure that your toes are pointed while you are doing the passe. Your knee should form a triangular shape."
    },
    {
      "title": "Dance the waltz",
      "content": "Dance the waltz to practice a type of ballroom dancing. Find a partner to dance with. The leader will step forward, to the side, and then back, and the follower will follow along with the same steps. This is called the box step. [21] X Research source This move is called the box step because it looks as though the dancers are moving within a box shape."
    },
    {
      "title": "Do the step-touch as a basic move for learning hip hop.",
      "content": "Do the step-touch as a basic move for learning hip hop. Step to the side with 1 leg, bending your knees slightly as you move. Bring your other leg to join the first and bounce slightly as you step. Let your arms swing gently around your waistline as you step and snap your fingers to the beat of the music. [22] X Research source Avoid letting your arms hang loosely by your sides, as this can look awkward. Move your arms in time with your steps and the music. [23] X Research source"
    }
  ]
}