{
  "url": "https://www.wikihow.com/Get-a-Dog-to-Stop-Eating-Dirt",
  "title": "How to Get a Dog to Stop Eating Dirt",
  "steps": [
    {
      "title": "Learn some of the reasons that dogs eat dirt.",
      "content": "Learn some of the reasons that dogs eat dirt. Eating dirt is a form of pica, or eating things that aren't food. In some cases, pica is caused by a mineral deficiency in your dog's diet, a parasite infestation, or a case of anemia. A dog may also eat dirt to alleviate an upset stomach. [2] X Expert Source Natalie Punt, DVM Veterinarian Expert Interview. 22 June 2023."
    },
    {
      "title": "Think about when the dirt-eating started.",
      "content": "Think about when the dirt-eating started. Were there any recent changes in the dog's diet, level of activity, or environment? Does the dog show any other unusual symptoms or behaviors that might help explain the problem? If you have multiple dogs, are they all eating dirt? If your dog eats an unusual quantity of dirt, keep a close eye on him in case he did eat something he should not have and is experiencing signs of poisoning. If multiple dogs in a household are all eating dirt, it could be a sign of a deficiency in their diet. If multiple dogs are all eating dirt from the same location, however, it could be that there is something delicious in that dirt."
    },
    {
      "title": "Check your dog's gums.",
      "content": "Check your dog's gums. Eating dirt may be a sign of anemia caused by dietary deficiencies or parasites. If the dog's gums are pale or jaundiced (yellow in color) take him to the vet right away for further diagnosis and treatment. [3] X Research source"
    },
    {
      "title": "Think about your dog's diet.",
      "content": "Think about your dog's diet. Most commercial dog foods contain enough vitamins and minerals to keep a dog healthy, but some brands contain less minerals than others. Check the label of your dog food and compare it to other brands to make sure it has similar amounts of minerals like iron and calcium. If your dog eats a raw or home-cooked diet, he may not be getting the nutrients he needs. Talk to your vet about mineral supplements in that case. A dog may also eat dirt because he is hungry. If you have cut back on your dog's food because he is overweight, consider a lower-calorie food that keeps him feeling full instead of less of his normal food."
    },
    {
      "title": "Talk to your vet.",
      "content": "Talk to your vet. If you can't figure out the cause of your dog's dirt-eating, or suspect it may be a sign of a more serious problem, bring the dog in for a check-up. During an exam, the vet can check the dog's overall health, order lab work to rule out deficiencies and diseases, and look for signs of parasites. Some veterinarians may be willing to offer advice over the phone. You can try calling your vet first to talk about the behavior and get some suggestions of things to try. Check out the dog's feces. If he has diarrhea or produces a greasy stool it might be he isn't digesting his food properly. This can lead to an nutritional imbalance and the dog eats dirt in an attempt to remedy this. This being the case, a vet consultation is essential since the problem needs investigating and a solution found."
    },
    {
      "title": "Entertain your dog.",
      "content": "Entertain your dog. Increase the amount of attention you give your dog, and give him a selection of new and interesting toys to play with. If possible, take your dog on extra walks. A busy, tired dog is less likely to try to entertain himself by eating dirt. [4] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Try changing your dog's food.",
      "content": "Try changing your dog's food. If you suspect that your dog food contains insufficient minerals, try a different brand. There are many kinds of dog food available. Try giving your dog wet, canned foods, which typically have more nutrients and are healthier for your dog. You can also look for dog foods made out of natural ingredients as well. [5] X Expert Source Beverly Ulbrich Dog Behaviorist & Trainer Expert Interview. 30 January 2020. Be sure to look for a food that addresses any special needs your dog might have (age, size, activity level, medical issues). When in doubt, call your vet for a recommendation."
    },
    {
      "title": "Deworm your dog.",
      "content": "Deworm your dog. Intestinal parasites like roundworms, hookworms, and whipworms can absorb nutrients your dog needs and cause anemia and intestinal distress, both of which can lead to dirt-eating. Visible worms in your dog's feces are a definite sign he is infected, but other symptoms include diarrhea, low appetite, loss of energy, etc. If you suspect worms, you can get dewormer tablets at your local pet store, or from your veterinarian. Some breeds of dogs (especially Australian shepherds and collies) are sensitive to the ingredients in some dewormers, so it's a good idea to check with your vet first. [6] X Research source"
    },
    {
      "title": "If your dog only eats dirt in specific areas, avoid those places.",
      "content": "If your dog only eats dirt in specific areas, avoid those places. This is most likely a sign that your dog is interested in eating something in the dirt, and not the dirt itself. But if the behavior bothers you, keep him away from that patch the dirt."
    },
    {
      "title": "Supervise your dog when he is outside.",
      "content": "Supervise your dog when he is outside. Walk your dog on a leash, and keep an eye on him while he is in the yard. Discourage your dog verbally when you see him start to eat dirt and physically tug him away if he's on a leash. Try to distract him or redirect him, and give him praise when he leaves the dirt alone. That way, you can start breaking his habit. [7] X Expert Source Beverly Ulbrich Dog Behaviorist & Trainer Expert Interview. 4 March 2020. If your dog only eats dirt from a specific area of your yard, you can try treating the area with a taste deterrent like cayenne pepper, hot sauce, or a bitter apple spray (available at pet stores). [8] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Keep potted houseplants out of reach.",
      "content": "Keep potted houseplants out of reach. If your dog eats the dirt from houseplants, remove them from reach, if possible. You can also try spraying them with a taste deterrent. [9] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If you see your dog approach the plants, tell him firmly to \"sit.\" When he does, reward him with a small treat to reinforce the positive behavior."
    },
    {
      "title": "Use a spray bottle to train your dog not to eat dirt.",
      "content": "Use a spray bottle to train your dog not to eat dirt. Carry a spray bottle filled with cool, clean water when you go on walks, and keep it nearby when your dog is in the yard. When you see your dog begin to eat dirt, approach him and scold him with a firm \"No!\" Wait one second, and then spray him in the face with a spray bottle. [10] X Research source Never use hot water, or add anything to the water that could hurt the dog or sting his eyes. Never use a spray bottle on a dog that might bite you."
    },
    {
      "title": "Try a remote punishment device to train your dog.",
      "content": "Try a remote punishment device to train your dog. These devices are triggered remotely so the dog does not associate the punishment with you personally. Popular choices include a citronella collar that can be activated to release an unpleasant smell when remotely triggered. [11] X Expert Source Natalie Punt, DVM Veterinarian Expert Interview. 22 June 2023. Many dog owners are against using punishments of this nature, whereas others think it is justified if the behavior they are trying to stop could be harmful to the dog. Use your best judgement and do what's right for you and your dog."
    },
    {
      "title": "Keep your dog indoors.",
      "content": "Keep your dog indoors. If you are unable to supervise your dog when he is outside and can't get him to stop eating dirt, you may need to keep him indoors while you are away. Make sure to keep all houseplants out of reach, or he may still find a way to get his dirt fix indoors."
    },
    {
      "title": "Consider anxiety medication for your dog.",
      "content": "Consider anxiety medication for your dog. If your dog won't stop eating dirt and exhibits other signs of anxiety, first try adding more entertainment and removing any stressors from his life that you can. If this is not possible or does not help, talk to your vet about the possibility that he needs an anxiety medication. [12] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Consult with a dog trainer or behavior specialist.",
      "content": "Consult with a dog trainer or behavior specialist. If your vet finds nothing physically wrong with your dog, and none of these at-home remedies are successful, an experienced trainer or animal behavior specialist may be able to help. Ask your vet for a recommendation, or call your local pet store. You can also do a web search for \"animal behavior\" or \"dog training\" in your area."
    }
  ]
}