{
  "url": "https://www.wikihow.com/Hang-Shelves-Without-Studs",
  "title": "The 3 Best Ways to Hang Shelves without Studs",
  "steps": [
    {
      "title": "Mark the ends of the shelf on the wall in pencil.",
      "content": "Mark the ends of the shelf on the wall in pencil. After you pick a spot, press the back edge of the shelf flat up against the wall. Draw a small dot on the wall at both ends of the shelf to mark its length and location. Try to keep these marks as aligned with one another as possible. If you’re installing a heavy shelf , have a friend support the shelf while you mark the endpoints. If you’re working alone, measure the shelf’s length and then transfer the dimensions onto the wall."
    },
    {
      "title": "Use a bubble level to make a straight guide line on the wall.",
      "content": "Use a bubble level to make a straight guide line on the wall. Hold the bubble level against the wall between the 2 marks you made. Adjust the level until the air bubble floats in between the lines in the middle of the tube to ensure the shelf isn’t crooked. Sketch a straight line between the points you marked, using the level as a straightedge. [1] X Research source Make a separate guideline for each shelf you plan on hanging."
    },
    {
      "title": "Mark the screw holes for the shelf’s mounting brackets on the wall.",
      "content": "Mark the screw holes for the shelf’s mounting brackets on the wall. Hold the shelf up against the guide line you just made on the wall and check where the screw holes line up on the mounting brackets. Use a pencil to make a small dot on your wall at each of the screw holes to use as reference points. Some brackets have multiple screw holes, so be sure to mark each one. [2] X Research source Standard shelves usually rest on top of metal brackets or have them built in. A floating shelf has a long, horizontal bracket with pegs that the shelf slides onto. Mounting brackets typically come packaged with new shelves, but you can buy different shelf brackets to change up their look."
    },
    {
      "title": "Make pilot holes",
      "content": "Make pilot holes with a drill . Install a bit in your drill that’s the same diameter as the wall anchor you plan on using. Hold the drill bit against your wall and slowly push it through the drywall or plaster. A 2 1 ⁄ 2 in (6.4 cm) drill bit will break through the wall without hitting anything behind it. Drill out the rest of the holes you marked. [3] X Research source The wall anchor size you need depends on the weight of your shelf. Typically, wall anchors with a larger diameter can support more weight than smaller ones. Check the weight limits and restrictions on the anchor packaging so you know what size to use. Interior drywall is most commonly 1 ⁄ 2 in (1.3 cm) thick while plaster is about 7 ⁄ 8 in (2.2 cm). If you know the thickness, check a drill bit set for a bit that’s the same length. Keep in mind that the wall may have wires, wood framing, and other components behind it. To avoid hitting these things, drill slowly. Check the hole often and stop drilling once you’re able to see all the way through it."
    },
    {
      "title": "Tap wall anchors into the pilot holes with a hammer.",
      "content": "Tap wall anchors into the pilot holes with a hammer. A drywall anchor is the most common wall fastener, and it’s shaped like a plastic screw. [4] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 7 April 2021. Choose anchors that are the same diameter as the pilot holes you drilled. Fit the threaded end of the anchor into one of the pilot holes you made earlier. Use the drywall anchor by tapping its head a few times with a hammer to push it into the wall just enough so it doesn’t fall out when you let go of it. [5] X Research source Wall anchors work great for drywall and plaster walls, and they’re best if your shelves weigh 25 pounds (11 kg) or less. Check the weight limit of the anchors on the packaging before using them for your shelves since they may vary between different sizes. [6] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 7 April 2021."
    },
    {
      "title": "Turn the wall anchors clockwise with a screwdriver until they’re flush.",
      "content": "Turn the wall anchors clockwise with a screwdriver until they’re flush. Fit a screwdriver into the opening on the anchor’s head and tighten it like you would with any ordinary screw. Make sure it’s flush with the wall, but don’t overtighten it or else it could damage the drywall or plaster. [7] X Research source Use a drill to secure the anchors faster, but make sure to stop as soon as the anchors are flush so you don’t damage them or your walls."
    },
    {
      "title": "Fit the mounting brackets over the anchors and screw them in.",
      "content": "Fit the mounting brackets over the anchors and screw them in. Hold the shelf’s brackets against the wall, aligning the screw holes with the anchors. Then, fit a screw into each hole so the threaded end is in the middle of the anchor’s head. Turn the screws clockwise with a screwdriver or drill until they’re flush with the anchors. [8] X Research source Wall anchors often come with screws when you purchase them. The exact screw size needed depends on the anchor, but they should be roughly the same size. Many anchors use 3 ⁄ 32 in (0.24 cm)-wide screws. Tighten the screws until you feel resistance. Be careful not to force the screws any tighter since you could strip the threads and make them difficult to remove later on."
    },
    {
      "title": "Hang the shelf on the mounting brackets.",
      "content": "Hang the shelf on the mounting brackets. If the shelf came with separate brackets, just set the shelf on top of the brackets. For a floating shelf, slide the hollow shelf over the bracket until the edge is flush with your wall. Set a few lightweight objects on the shelf to make sure it’s sturdy and ready to bear the weight. Some shelves may have additional screws to secure them to the brackets. Check the manual that came with the shelf you bought to see if there’s any additional work you need to finish. If the shelf feels loose or sags, then it’s not secured to your wall. You may need to use a different anchor or larger screws."
    },
    {
      "title": "Slide a molly bolt through each of the pilot holes in the wall.",
      "content": "Slide a molly bolt through each of the pilot holes in the wall. Molly bolts look like screws inside of a metal shaft, and they create a secure grip inside of your wall. Get bolts that are the same diameter as the pilot holes. Gently push the end of the molly bolt through the pilot hole as far as it will go. If you meet any resistance, just tap the head of the bolt with a hammer so the lip of the shaft is flush with the wall. [9] X Research source Molly bolts can generally support up to 50 lb (23 kg), and they work well for both drywall and plaster walls. Compare the weight rating on the packaging to the weight of the shelf and items you’re putting on it to make sure they support the weight. Some molly bolts have a pointed tip so they’re easier to push into your wall."
    },
    {
      "title": "Turn the bolt clockwise until the heads are flush with the wall.",
      "content": "Turn the bolt clockwise until the heads are flush with the wall. Use a flathead or Phillips-head screwdriver to tighten the bolt. Turning the screw head at the end of the bolt clockwise to open the metal flanges on the bolt’s shaft, which press against the inside of the drywall or plaster to evenly distribute the weight. Once the heads are flush with your wall, lightly tug on each bolt to ensure it’s secure and stable. [10] X Research source Stop turning the bolts once you feel resistance. Continuing to rotate them could strip the threads or damage the wall."
    },
    {
      "title": "Rotate the head counterclockwise to remove the screw from inside the shaft.",
      "content": "Rotate the head counterclockwise to remove the screw from inside the shaft. Use a screwdriver to loosen the screw and pull it out completely. The bolt shaft will stay in place since the flanges cling to the insides of the wall. [11] X Research source Set the screws from the molly bolts in a small cup or bowl so you don’t lose them."
    },
    {
      "title": "Screw the brackets to the molly bolts.",
      "content": "Screw the brackets to the molly bolts. Reuse the same screws you just removed from the molly bolts. Hold the brackets over the holes where your molly bolts are in the wall, and fit the screws through them. Turn the screws clockwise until they’re tight and the brackets feel secured and sturdy against your wall. [12] X Research source"
    },
    {
      "title": "Place the shelves on the brackets to hang them.",
      "content": "Place the shelves on the brackets to hang them. For a standard shelf, rest the shelf on top of the brackets and screw them in. For a floating shelf, slide the shelf piece over the bracket to hide it from view. Gently push on the shelf and brackets to make sure they’re stable before putting anything on top of them. [13] X Research source"
    },
    {
      "title": "Fit the flanges of a heavy toggle bolt into the pilot hole.",
      "content": "Fit the flanges of a heavy toggle bolt into the pilot hole. Heavy toggle bolts are either metal or plastic, and have spring-loaded flanges on one end that press against the insides of the wall. Use toggle bolts that have the same diameter as the pilot holes in your wall. Squeeze the flanges tightly together so they fit through the pilot hole. Push the toggle bolt in as far as it will go in your wall. [14] X Research source If the toggle bolt has metal flanges attached directly to the barrel of a screw, feed it through the shelf bracket before putting it in your wall. Once you push this style of toggle bolt through the wall, you won’t be able to remove it easily [15] X Research source Metal toggle bolts are the best choice for heavy shelves up to 50 pounds (23 kg) in drywall, plaster, and hollow-core concrete. Plastic toggle bolts work best for drywall and plaster and can support up to 25 pounds (11 kg). [16] X Research source"
    },
    {
      "title": "Slide the plastic ring toward the wall if your bolts have them.",
      "content": "Slide the plastic ring toward the wall if your bolts have them. Look for a small plastic ring at the end of the toggle bolt. Push the ring flush to the wall with one hand while holding onto the plastic straps at the end of the toggle bolt with your other hand. Gently pull the plastic end toward so the flanges on the shaft open up inside the wall and secure the bolt. [17] X Research source For a toggle bolt without plastic straps, just tighten the screw to open the flanges and secure the shelf brackets to the wall. [18] X Research source"
    },
    {
      "title": "Snap the plastic end off the bolt if it has one.",
      "content": "Snap the plastic end off the bolt if it has one. Pinch the plastic straps near where it emerges from the wall. Bend the straps up and down to break them off, leaving only the bolt behind in your wall. [19] X Research source If you’re having a hard time removing the strap, pull the ends of the strap apart. Then, push them against the wall until they crack. Otherwise, use a pair of scissors to cut them."
    },
    {
      "title": "Screw the brackets to the open toggles.",
      "content": "Screw the brackets to the open toggles. With the plastic straps out of the way, you can screw the brackets to the toggles. Hold the brackets up to the wall, aligning the screw holes with the toggles. Fit a screw in each pilot hole and then turn the screws clockwise until they’re tight. [20] X Research source Make sure to insert the screws so they’re straight. If they are crooked, they won’t fit cleanly in the toggles."
    },
    {
      "title": "Hang the shelves on the brackets.",
      "content": "Hang the shelves on the brackets. Test the brackets first by gently pushing and attempting to move them. If they’re stable, set the shelf on top of the brackets and screw it in. For a floating shelf, slide the actual shelf unit onto the bracket so it’s completely hidden. [21] X Research source If the brackets don’t feel stable, check to make sure the toggles are flush with the wall."
    }
  ]
}