{
  "url": "https://www.wikihow.com/Heal-Barrett%27s-Esophagus",
  "title": "How to Heal Barrett's Esophagus",
  "steps": [
    {
      "title": "Steer clear of greasy and fatty foods.",
      "content": "Steer clear of greasy and fatty foods. Eating rich, heavy food can cause heartburn. This will usually result in temporary chest pain and discomfort while the food is digesting. Avoid this painful symptom by cutting back on fatty foods and eating healthier foods, like fruits and vegetables. [3] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Avoid eating fast food, pizza, and other high fat foods. You should also avoid heavy sauces and rich desserts."
    },
    {
      "title": "Opt for mildly seasoned foods instead of spicy foods.",
      "content": "Opt for mildly seasoned foods instead of spicy foods. Spicy food can irritate the digestive tract, causing heartburn. Use mild seasonings like salt, parsley, and rosemary and avoid intense seasonings like garlic, chili pepper flakes, and curry. Avoid spicy cuisine and read the ingredients in food items you purchase prior to buying them. [4] X Research source"
    },
    {
      "title": "Avoid tomato and citrus fruits.",
      "content": "Avoid tomato and citrus fruits. Produce with a high acid content can irritate your esophagus and cause acid reflux. Tomatoes and citrus fruits like lemon, strawberries, cherries, orange and grapefruit are the biggest culprits. Steer clear of these fruits, as well as tomato sauce and tomato and citrus juices. [5] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Don't drink coffee or carbonated drinks.",
      "content": "Don't drink coffee or carbonated drinks. Beverage choices are also important in preventing heartburn and other GERD symptoms. Avoid coffee and carbonated drinks, which can both cause heartburn. Opt instead for water or herbal teas, which will be gentle on your digestive tract. [6] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source If you like to drink coffee in the morning, try replacing it with a caffeine-free substitute such as chicory root coffee."
    },
    {
      "title": "Stay away from alcohol.",
      "content": "Stay away from alcohol. Drinking alcohol is directly related to heartburn. Red wine, in particular, can cause this digestive symptom and should be avoided. If you do drink, do so in moderation to minimize the risk of heartburn. [7] X Research source"
    },
    {
      "title": "Elevate the head of your bed 6-8 inches.",
      "content": "Elevate the head of your bed 6-8 inches. Keeping your head elevated at night will ensure that your stomach acid stays in your stomach, preventing acid reflux. Use solid objects like books or bricks to prop up the feet under the top of your bed by between 6-8 inches. You can also purchase plastic or wooden bed raisers. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Propping up your head with many small pillows will not be sufficient to prevent the rise of stomach acid. You can, however, buy large pillows designed to prop up your head while you sleep. Regardless of whether you sleep on your back, side, or stomach, it is important to prop yourself up to avoid acid reflux."
    },
    {
      "title": "Avoid cigarettes and other forms of tobacco.",
      "content": "Avoid cigarettes and other forms of tobacco. Tobacco products, such as cigarettes and chewing tobacco, can cause acid reflux. Tobacco relaxes the lower esophageal sphincter, allowing stomach acid to flow back into the esophagus. Avoid the recreational use of these products, and speak to your doctor to get help with quitting if you use them regularly. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Exercise 5 days a week to lose weight.",
      "content": "Exercise 5 days a week to lose weight. Your risk of suffering from digestive issues such as acid reflux may be higher if you are overweight as the extra weight can press down on your esophagus. Speak to your doctor about losing weight safely, in a way that you are comfortable with. In addition to lowering your calorie intake, try doing moderate exercise like walking , swimming, or cycling at least 5 days a week. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Avoid eating less than 3 hours before bed.",
      "content": "Avoid eating less than 3 hours before bed. Sleeping too soon after eating can disrupt the digestive process and cause acid reflux. Finish your evening meal and snacks early enough that your body has at least 3 hours to digest the food properly. Aim to have your last meal by 6 pm. Curb your late night food cravings by drinking water and eating well balanced meals throughout the day. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take an over-the-counter antacid if you experience heart burn.",
      "content": "Take an over-the-counter antacid if you experience heart burn. If your GERD flares up and you experience heartburn, take an antacid like Rolaids, Tums, or Mylanta. Follow the instructions on the label for the right dosage. Take the medication with a glass of cold water. [12] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Stay upright while the heartburn passes. If you feel panicked or upset, try taking deep breaths to relax."
    },
    {
      "title": "Take any medications prescribed by your doctor to treat GERD.",
      "content": "Take any medications prescribed by your doctor to treat GERD. [13] X Expert Source Payam Daneshrad, MD Board Certified Otolaryngologist Expert Interview. 30 September 2020. Your doctor will typically prescribe a high dose antacid medication for you to take to slow down the progression of Barrett's esophagus and ease the symptoms of GERD. Take this medication exactly as it is prescribed to you. If necessary, set an alarm on your phone to avoiding missing doses of the medication. [14] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Monitor the disease with regular doctor's appointments.",
      "content": "Monitor the disease with regular doctor's appointments. [15] X Expert Source Payam Daneshrad, MD Board Certified Otolaryngologist Expert Interview. 30 September 2020. Depending on the severity of your Barrett's esophagus, your doctor may ask you to return for screenings every few months, or yearly. They may perform an endoscopy to examine the condition of your esophageal tissue and assess the condition. Severe cases of Barrett's esophagus may be a precursor to esophageal cancer, so it is important to keep up with these screenings as recommended. [16] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Discuss the option of micro-frequency ablation with your doctor.",
      "content": "Discuss the option of micro-frequency ablation with your doctor. Micro-frequency ablation is a procedure where an electrode is used to deliver heat energy to diseased esophageal tissue to destroy it. Over 2 or 3 sessions, this treatment may remove Barrett's esophagus entirely. Ask your doctor if this procedure, which requires anesthesia or sedation, is the right choice for you. [17] X Research source This procedure is performed on an outpatient basis. Each session lasts between 25-35 minutes."
    },
    {
      "title": "Inquire about cryotherapy to treat Barrett's esophagus.",
      "content": "Inquire about cryotherapy to treat Barrett's esophagus. Cryotherapy is a procedure similar to micro-frequency ablation, except it uses cold to freeze off disease esophageal tissue. Patients need between 1 and 5 treatments, each lasting between 25-35 minutes. Ask your doctor about this treatment option. [18] X Research source Cryotherapy is typically an outpatient procedure."
    },
    {
      "title": "Ask your doctor about the possibility of surgery.",
      "content": "Ask your doctor about the possibility of surgery. Surgery may be an option for dealing with the symptoms of GERD and Barrett's esophagus. While medications can treat reducing acid reflux, surgical intervention can prevent reflux of pancreatic and biliary secretions. Ask your doctor is surgery is the right option for you. [19] X Research source Ask about recovery time and risk factors when considering surgery."
    },
    {
      "title": "Identify the risk factors that apply to you.",
      "content": "Identify the risk factors that apply to you. As a general rule, people over 50 years old are the most at risk for contracting Barrett's esophagus. Other risk factors include being a current or former smoker, being Caucasian, being overweight, and having a family history of esophageal cancer. If 2 or more of these factors apply to you, ask your doctor about getting screened for this condition. [20] X Research source Barrett's esophagus is more common in men than women, although it can appear in both sexes."
    },
    {
      "title": "Treat heartburn and acid reflux to rule out Barrett's esophagus.",
      "content": "Treat heartburn and acid reflux to rule out Barrett's esophagus. Heartburn and acid reflux that persists despite treatment is a common indicator of Barrett's esophagus. Treat these moderate symptoms with over the counter medications and dietary changes. If the symptoms subside, you can safely rule out the condition. [21] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Undergo other diagnostic testing if you have GERD or similar symptoms.",
      "content": "Undergo other diagnostic testing if you have GERD or similar symptoms. If you have Gastroesophageal Reflux Disease (GERD) or have suffered from chronic heartburn and acid reflux for a month, contact your doctor. Ask if they can refer you to a gastroenterologist, which is a doctor that specializes in the digestive tract. [22] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source The doctor may do an endoscopy, where a small camera will be sent down your throat to examine your esophageal tissue Alternatively, your doctor may suggest a capsule endoscopy, where you will swallow a pill-sized video capsule which will pass naturally through the digestive tract. The doctor will be able to view the esophageal lining, but will not be able to take a sample of tissue to biopsy. The doctor may remove and biopsy a small amount of tissue from your esophagus. Your doctor may also do echocardiograms and blood work to check your heart. GERD can often feel similar to a heart attack, so you want to make sure that you are not confusing GERD symptoms with a heart problem."
    }
  ]
}