{
  "url": "https://www.wikihow.com/Make-a-Homemade-Fishing-Rod",
  "title": "How to Make a Homemade Fishing Rod",
  "steps": [
    {
      "title": "Find a suitable piece of bamboo cane.",
      "content": "Find a suitable piece of bamboo cane. Find a piece of bamboo cane that’s between 8–10 feet (2.4–3.0 m) long and 1–2 inches (2.5–5.1 cm) in diameter and cut it at the base. [1] X Research source When it comes to bamboo fishing pole, bigger is not necessarily better. Larger poles can be cumbersome to hold and awkward to transport. It’s probably best to cut three or four pieces of bamboo at a time, in case your first piece breaks after you’ve dried it out and you have to begin the process again"
    },
    {
      "title": "Trim and smooth the cane.",
      "content": "Trim and smooth the cane. Use a small sharp knife to trim away any leaves or nubs, as close to the main body of the cane as possible. Find a joint at the thicker end of the cane and saw through it. This will ensure that the butt of your fishing pole has a closed end. Take a piece of sandpaper and use it to smooth the body of the fishing pole as much as possible."
    },
    {
      "title": "Leave the cane to dry.",
      "content": "Leave the cane to dry. The next step is to dry out the cane pole. Tie a piece of string around the narrow end of the pole and suspend it from the ceiling. This will ensure that the cane dries evenly and as straight as possible. [2] X Research source Dry the cane pole in a warm, dry place but do not exposed it to direct sunlight. Sunlight will dry out the cane too quickly, causing it to become brittle. Depending on temperature and humidity levels, the cane will take a few weeks to several months to dry out fully. You will know it’s ready when it turns a tan color. When the cane is dry pick it up and give it a few test swings through the air to make sure it doesn’t break or bend. If it does, try another piece. You want your fishing pole to be as straight as possible, so if it dries with a slight curve you can straighten it out by weighing it with bricks."
    },
    {
      "title": "Attach the fishing line.",
      "content": "Attach the fishing line. Take some 20 lb (9.1 kg) Dacron line and tie 1 end 1–2 inches (2.5–5.1 cm) above the “handle” of the fishing pole. Run the line along the length of the pole until you get to the end. This will allow the pole to bend all the way through when you’re fighting a fish, which will prevent the line from snapping. Then take some extra pieces of fishing line and use them to tie the running line to the fishing pole at 2 or 3 different points (including the tip). Be careful when tying the running line to the pole—if it’s tied too tightly you won’t be able to slide the line up and down, but if it’s tied too loosely the line will droop and get tangled. Use a whip-finish if possible. The length of the fishing line (from the tip of the pole) should measure the total length of the pole, plus an extra 2 feet (0.61 m). If you prefer, the extra 2 feet (0.61 m) can be monofilament leader instead of the Dacron line. After you’ve tried this out, experiment with a longer amount of line so you can cast out farther."
    },
    {
      "title": "Attach the hook, bobber and sinker.",
      "content": "Attach the hook, bobber and sinker. Attach your preferred hook or lure to the end of the line along with a bobber and a split-shot sinker. [3] X Research source Now your homemade bamboo fishing pole is ready to use! To shorten the line, pull it back through the loops and wrap the excess around the handle."
    },
    {
      "title": "Cut 2 PVC pipes.",
      "content": "Cut 2 PVC pipes . Take 2 pieces of PVC piping—one 1 ⁄ 2 inch (1.3 cm) in diameter and the other 3 ⁄ 4 inch (1.9 cm). [4] X Research source Use a saw to cut the PVC pipes to the desired length. Keep in mind that the combined length of the 2 PVC pipes will be the approximate length of your finished fishing rod. For example, for a small child-size fishing rod you could cut each pipe to a length of 10 inches (25.4 cm). Use some sandpaper to smooth the sawed edges and remove any markings from the body of the pipes."
    },
    {
      "title": "Attach the slip caps and threaded connectors.",
      "content": "Attach the slip caps and threaded connectors. You will need two slip caps: one 1 ⁄ 2 inch (1.3 cm) and one 3 ⁄ 4 inch (1.9 cm) fitting. You will also need a 1 ⁄ 2 – 3 ⁄ 4 inch (1.3–1.9 cm) threaded connector (female/male) and a 1 ⁄ 2 – 3 ⁄ 4 inch (1.3–1.9 cm) threaded connector (female/female). These fittings are available very cheaply from the hardware store. Slip each fitting onto the corresponding piece of pipe, but do not glue in place."
    },
    {
      "title": "Drill holes into the smaller PVC pipe.",
      "content": "Drill holes into the smaller PVC pipe. Take a power drill with a 3 ⁄ 32 inch (0.2 cm) drill bit and drill 3 to 5 holes all the way through the 1 ⁄ 2 inch (1.3 cm) PVC pipe. The number of holes will depend on the length of the pipe you are using. No matter how many holes you make, ensure that they evenly spaced."
    },
    {
      "title": "Attach the eyelets.",
      "content": "Attach the eyelets. Take a number of medium sized binder clips (to match the number of holes you drilled) and remove the silver wire from the clip. Use a pliers to bend one leg of the silver wire across the other. When you’re done, there should be a closed loop on one end of the wire and on the other end the legs should point inwards towards each other. Repeat with the other wires. Take a wire and clip the legs into the holes on either side of the 1 ⁄ 2 inch (1.3 cm) pipe. The loop at the end of the wire forms an eyelet for the fishing line. Repeat with the other wires."
    },
    {
      "title": "Attach a premade fishing reel to the larger pipe.",
      "content": "Attach a premade fishing reel to the larger pipe. Buy a premade fishing reel and attach it to the side of the larger 3 ⁄ 4 inch (1.9 cm) PVC pipe. You can do this by using the same drill bit as before to make 2 holes in the side of the pipe, then screw the fishing reel into place"
    },
    {
      "title": "Screw the PVC pipes together.",
      "content": "Screw the PVC pipes together. The last step is to screw the 2 pieces of PVC pipe together to form your fishing rod and run the fishing line through the eyelets. Attach a hook, bobber and sinker to the end of the line. The great thing about this fishing rod is that you can remove the slip caps from either end of the rod to store tackle or anything else you want!"
    },
    {
      "title": "Find a sturdy stick.",
      "content": "Find a sturdy stick. Find a sturdy, straight stick that’s approximately 8 to 10 feet (2.4 to 3.0 m) long and 1–2 inches (2.5–5.1 cm) in diameter. Remove any leaves or branches and use sandpaper to remove any knobbly bits, if necessary. [5] X Research source"
    },
    {
      "title": "Attach string and fishing line.",
      "content": "Attach string and fishing line. Take a piece of string that’s about 20 feet (6.1 m) long and tie it to the narrower end of the stick, about 4 inches (10.2 cm) from the end. Make sure the knot is nice and tight. Wrap the remaining string around the end of the stick. Tie 2–3 feet (0.61–0.91 m) of thin fishing line to the end of the string, as this will make it easier to attach the hook."
    },
    {
      "title": "Tie a small hook to the end of the line.",
      "content": "Tie a small hook to the end of the line. Thread a small fishing hook onto the end of the line. When it’s time to fish, unwind enough string from the end of the pole for the hook to reach the required depth. [6] X Research source"
    }
  ]
}