{
  "url": "https://www.wikihow.com/Keep-Poinsettias-Growing-To-Next-Christmas",
  "title": "How to Keep Poinsettias Growing To Next Christmas",
  "steps": [
    {
      "title": "Inspect the plant for bugs (most plants won't show bugs in the greenhouse but they will show up after about two weeks in the home).",
      "content": "Inspect the plant for bugs (most plants won't show bugs in the greenhouse but they will show up after about two weeks in the home). If the plant is infected, it is best to throw it out and purchase another for keeping over. [1] X Research source"
    },
    {
      "title": "If you want to keep over that particular plant, several applications of soapy water to the plant and potting soil should rid it of most infestations.",
      "content": "If you want to keep over that particular plant, several applications of soapy water to the plant and potting soil should rid it of most infestations. Mealy bugs are the main concern and can be removed by dabbing them with a cotton swab dipped in rubbing alcohol. However, this should be done before the infection spreads or gets too large or you may never kill them all. [2] X Research source"
    },
    {
      "title": "Place the plant in a cool (not cold) room with curtain filtered sunlight and cut back on the watering.",
      "content": "Place the plant in a cool (not cold) room with curtain filtered sunlight and cut back on the watering. The plant should be allowed to go dry to the touch between watering and be watered only sparingly (over-watering is the leading cause of plant death in the winter months inside, the plant is not actively growing and is not taking up the normal food it would during the growing season, and if watered to much the plant will end up sitting in water and problems like moss, mold, rot and leaf yellow may accrue). [3] X Research source Clark Hill. Plant Specialist &amp; VP of Operations, Platt Hill Nursery. When the temperatures at night get above 10 C, the plant can then be moved outside. [4] X Research source Poinsettias are sensitive if you expose them to temperatures below 50 °F (10 °C). [5] X Research source Clark Hill. Plant Specialist &amp; VP of Operations, Platt Hill Nursery."
    },
    {
      "title": "Decide what kind of plant you want to end up with for Christmas.",
      "content": "Decide what kind of plant you want to end up with for Christmas. If a small bushy plant is your goal, the entire plant should be trimmed down to about \"inches above the main trunk. If you want a larger plant, simply pinch the tops of each main branch and continue this until about July. If a topiary is your goal, then remove all of the branches except for the tallest, straightest main branch and do not pinch the plant on the top, just remove the side shoots for the remainder of the season. [6] X Research source"
    },
    {
      "title": "Do not set the plant in full sun at first.",
      "content": "Do not set the plant in full sun at first. Doing this will cause what leaves are left to scorch and fall off and may kill the weakened plant. Place the plant in full shade then move the plant out of the shade in two weeks to part shade then two weeks later to full or part sun for the remainder of the season. This will allow the plant to harden off and get used to the new conditions outside. [7] X Research source"
    },
    {
      "title": "Start watering regularly.",
      "content": "Start watering regularly. Fertilize every fifth watering or every two weeks (whichever comes last) with a poinsettia fertilizer or house plant fertilizer. Or, if you would like, try a diluted evergreen fertilizer to help promote leaf growth (at this stage all you want is leaf growth, no flowers). [8] X Research source Avoid overwatering since your poinsettias could develop root rot. [9] X Research source Clark Hill. Plant Specialist &amp; VP of Operations, Platt Hill Nursery."
    },
    {
      "title": "When it is time to bring the plant in for fall, start the processes of turning the top leaves red (or pink or whatever color they were last winter).",
      "content": "When it is time to bring the plant in for fall, start the processes of turning the top leaves red (or pink or whatever color they were last winter). This process can take up to 2 months and sometimes longer, depending on conditions and the variety of plant you have. [10] X Research source Switch from a nitrogen based fertilizer to an even houseplant fertilizer or one made for poinsettias, and reduce fertilizing by half. Begin the routine of long nights/short days needed to initiate buds: 13 hours of uninterrupted darkness, 11 hours of bright sunshine each day. Keep temperatures in the low 60's at night. Turn pot regularly for even light. (Note: Darkness must be total - light from a street lamp or even that cast by headlights from passing cars is enough to disrupt bud formation.) Discontinue darkness routine after about 2 months and place plant in the sunniest window in the house. Reduce fertilizer: don't over water!"
    },
    {
      "title": "Grow outdoors when possible.",
      "content": "Grow outdoors when possible. Depending on your climate, poinsettias tend to due better outside than in, so grow them outside where they get partial shade in the afternoon. If it gets too hot and dry, their growth might slow. [11] X Research source"
    },
    {
      "title": "Be realistic about the plant's appearance.",
      "content": "Be realistic about the plant's appearance. You will never get that \"store bought\" look again, as they are literally tree sapping. If you want some \"store bought\" looking plants, take cuttings from your plants (don't worry you can still flower the parent plants too) from late April, up until you bring them inside to flower. You can use rooting hormone, but poinsettias seem to root well in just compost (such as compost made from yard waste like grass clippings). [12] X Research source"
    },
    {
      "title": "Focus on the timing of the flowering.",
      "content": "Focus on the timing of the flowering. Depending on when you want the poinsettia to be fully flowering and how you intend to care for them after flowering, determines on when you start flowering them. If you want them in full bloom by Thanksgiving, start on October 1st and by Halloween for Christmas. You can start earlier, but you need to maintain light timing to keep them flowering throughout the season. [13] X Research source"
    },
    {
      "title": "Put the plants in a dark room, closet or cabinet.",
      "content": "Put the plants in a dark room, closet or cabinet. Choose a spot which is lightproof, for the most part. [14] X Research source"
    },
    {
      "title": "Use warm white CFLs or warm white fluorescent tubes.",
      "content": "Use warm white CFLs or warm white fluorescent tubes. It's necessary to use \"warm white\" as opposed to regular grow lights because the plant needs the extra red light; this, plus the timing, will ensure flowering. [15] X Research source Make sure you have enough light too. One 26watt CFL (100watt equivalent) for two or more plants won't be enough. Use one 26 watt CFL per cutting about 1 and 1/2 feet above them to just 1 foot (0.3 m). Make sure you can adjust the height, as they will grow fast during flowering. HPS lights can be used too. Be careful with HPS lights though, as local law enforcement might think you are flowering another Mexican plant with the same light cycle! HPS light give off signatures they use to help track unlawful botanists."
    },
    {
      "title": "Set the timing.",
      "content": "Set the timing. Set the timing to suit. A good one is to use standard banking hours, 9am to 5pm. Do not disturb the plants when the lights are off. While 14 hours of darkness is said to be enough, 16 hours works every time (with warm white). [16] X Research source"
    },
    {
      "title": "Check for flowering indicators.",
      "content": "Check for flowering indicators. The first signs they have begun to flower is what you might call \"rusting out\". This is when the top leaves quite literally \"rust out\" as they think it's fall. Leave the plant under the light until it has fully flowered. [17] X Research source You may want to leave the plant in your makeshift nursery the whole season and bring it out for company and the day of the holiday you want to display it. Even the plants you buy this year would benefit and be a good plant to make cutting from next year, so put them in the nursery too."
    },
    {
      "title": "Avoid letting the plant have more than 10 hours of light a day.",
      "content": "Avoid letting the plant have more than 10 hours of light a day. This will keep it flowering long after the season is over. Take good care of it: keep the plant watered properly, keep it away from whiteflies, and give it plenty of light during its day cycle. Given this care, the plant can flower well past Mother's Day! [18] X Research source If the plant is still flowering for too long, put it under light with 24 hours of on time to get it to vegetate. You may find that some plants will still have flower buds on when you place them outside for the summer."
    }
  ]
}