{
  "url": "https://www.wikihow.com/Keep-Away-Lizards",
  "title": "How to Keep Away Lizards",
  "steps": [
    {
      "title": "Get rid of newspapers, boxes, and other potential hiding places.",
      "content": "Get rid of newspapers, boxes, and other potential hiding places. [1] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. Clutter provides lizards with hiding spots, so stick to a regular cleaning schedule. Nip messes in the bud, and throw away paper, magazines, boxes, and other debris before they pile up around the house. Clutter also provides hidings spots for insects and spiders, which are lizards’ food sources."
    },
    {
      "title": "Avoid keeping food out and clean up food scraps.",
      "content": "Avoid keeping food out and clean up food scraps. Clean up crumbs, wipe down counters, and mop the floor after cooking or spilling food. Keep food in sealed containers, especially if you’ve noticed flies or other insects. Food attracts bugs, and eliminating food sources is essential to keeping away lizards."
    },
    {
      "title": "Use insecticides and adhesive traps to get rid of insects.",
      "content": "Use insecticides and adhesive traps to get rid of insects. If you regularly see insects and spiders in your home, spray an indoor insecticide at points of entry, corners, crevices, and your home’s other nooks and crannies. Place adhesive insect traps by doors and windows, behind furniture, and under kitchen cupboards, and replace them with fresh traps regularly. Read your product’s instructions and use it as directed. Follow any recommended safety precautions, such as wearing protective gloves or a mask. If you have trouble controlling an insect infestation, call a professional exterminator."
    },
    {
      "title": "Keep outdoor areas around your home mowed, trimmed, and tidy.",
      "content": "Keep outdoor areas around your home mowed, trimmed, and tidy. [2] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. Mow the grass regularly, and trim back tall plants along your home’s exterior walls. Keep outdoor trash receptacles tightly closed, and avoid storing firewood, lumber, and other potential lizard habitats next to your home. [3] X Research source"
    },
    {
      "title": "Avoid keeping doors and windows open.",
      "content": "Avoid keeping doors and windows open. Close the door unless someone is entering or leaving the house. Even if you’re bringing in groceries or other items, keep the door closed between trips to prevent any little green visitors from scurrying inside. Keep the windows closed as well, especially if you don’t have screens or if screens have any tears. [4] X Research source"
    },
    {
      "title": "Install snug weather stripping and window screens.",
      "content": "Install snug weather stripping and window screens . If there’s any gaps between an exterior door and the floor or jamb, install adhesive weather stripping, which you can find at your local home improvement store. Replace torn screened windows, or keep your windows closed at all times if you don't have screens. [5] X Research source If you don’t have screened windows but want to keep a window open, you could purchase an adjustable, removable screen panel."
    },
    {
      "title": "Seal cracks and crevices with caulk, spray foam, or wire mesh.",
      "content": "Seal cracks and crevices with caulk , spray foam, or wire mesh. [6] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. Examine your home’s exterior walls, roof line, windows, and utility connections. Fill in smaller cracks with waterproof caulk or spray foam. Cover any exposed vents or large gaps with wire mesh or hardware cloth. [7] X Research source Look for mesh or hardware cloth labelled for rodent or bird deterrence online or at a home improvement store."
    },
    {
      "title": "Keep your home cooler and darker.",
      "content": "Keep your home cooler and darker. Lizards are cold-blooded, so they love bright, warm environments. Turning off the lights when you leave a room can make that area less hospitable. Additionally, try keeping the temperature in your home under 70 °F (21 °C). Most house lizards, such as anoles and geckos, thrive in temperatures between 75 and 95 °F (24 and 35 °C). [8] X Research source"
    },
    {
      "title": "Put containers of mothballs near doors and windows.",
      "content": "Put containers of mothballs near doors and windows. While there’s no scientific evidence to back it up, some people use mothballs to repel lizards. Try keeping bags or open containers of mothballs by doors, windows, and other points of entry. [9] X Research source"
    },
    {
      "title": "Work peacock feathers into your decor.",
      "content": "Work peacock feathers into your decor. Again, while there’s no scientific evidence, peacock feathers might help keep lizards out of your home. Lizards could be scared by the big eye designs or think that feathers indicate a nearby predator. Peacock feathers are aesthetically pleasing, too. Try placing a jar or bottle filled with feathers by your exterior doors."
    },
    {
      "title": "Try placing egg shells near points of entry.",
      "content": "Try placing egg shells near points of entry. Some people claim that lizards are afraid of eggshells. The sight and smell of egg shells could make a lizard think that a bird or other predator is nearby. [10] X Research source"
    },
    {
      "title": "Consider getting a cat.",
      "content": "Consider getting a cat. Cats are great for deterring lizards, rodents, and other pests. However, keep in mind that cats like to play with their food and often give prey to their owners as presents. Getting rid of a live lizard might be less disgusting than dealing with one that your cat got to first. [11] X Research source"
    }
  ]
}