{
  "url": "https://www.wikihow.com/Give-Someone-a-Guilt-Trip",
  "title": "How to Give Someone a Guilt Trip",
  "steps": [
    {
      "title": "Ask questions to get the person to admit what they did.",
      "content": "Ask questions to get the person to admit what they did. If the person won't even admit that they did something wrong, they're probably not going to apologize. Accusing them outright will often cause them to become defensive, but you may be able to get them to confess by asking them leading questions. At the very least, you might catch them in a lie that you can prove is untrue. [2] X Research source For instance, if you found out that your boyfriend was out with another woman, you might start by asking him something like, \"Why didn't you answer the phone when I called you earlier?\" If he says he was at work, you could say, “No you weren't, because I called there too.” If you know your teenager took cash out of your wallet, you could say, “Where did you get the money to go to the movies last night?” Be careful of accusing someone of something they may not have done. If they get blamed when they haven't done anything, they might start to feel like they might as well do whatever they're accused of."
    },
    {
      "title": "Bring up other things they've done wrong.",
      "content": "Bring up other things they've done wrong. Playing the victim is an integral part of a guilt trip. Make it seem like this is a pattern of behavior you've come to expect, and certainly not one that you deserve. It's most effective if you bring up things that are similar to whatever you're trying to get the person to apologize for, but it can be anything that upset you. [3] X Research source For example, if you're trying to get your spouse to apologize for being irritable, you might say, “It's not the first time you've snapped at me. Remember the other day when you said...?\" Only do this when you absolutely must, since it opens the door for the other person to bring up things they feel you've done to hurt them as well."
    },
    {
      "title": "Play on their feelings for you.",
      "content": "Play on their feelings for you. Tell the person that what they did makes you question the way they feel about you. In some cases, this might very well be true, especially if what you're upset about is something very serious. Either way, make sure the person you're guilt-tripping feels like they need to prove that they still care about you. [4] X Research source Say something like, \"How can you say you love me and then lie to me?\" You could also say \"It really hurt my feelings that you forgot my birthday. Don't I matter to you?\""
    },
    {
      "title": "Remind them of some good things you've done for them.",
      "content": "Remind them of some good things you've done for them. Put their actions into stark contrast by bringing up some of the good things you've done for them. The more recent or grand the gesture, the better, but anything will work. It doesn't even have to have anything to do with the subject at hand; just so long as it shows what a good person you are. If someone takes something from you without permission, you could say, \"After everything I've given you, how could you steal from me?” You might also say something like, \"I guess it didn't mean anything to you that I brought you flowers the other day, since you want to pick a fight with me today.\" You could also say something like, “I've cooked dinner for you every night for 5 years, but you can't remember to pick up a carton of milk on the way home?” Overdoing this can actually make the person less grateful over time, since whenever you do something nice for them, they'll be wondering how long it will be before you throw it back in their face."
    },
    {
      "title": "Deflect any of their attempts to make the situation your fault.",
      "content": "Deflect any of their attempts to make the situation your fault. When you're giving someone a guilt trip, they'll often try to do the same thing to you in return. Even if you've done something wrong, don't acknowledge it. Instead, turn everything back on what the other person did. For instance, if you want your boyfriend to apologize for texting another girl, he might try to make you feel guilty for going through his phone. In this case, you could say something like, \"Well, it turns out I had a reason to be suspicious, didn't I?\" Even if you lose your temper, you can say something along the lines of, \"I wouldn't yell if you didn't make me feel like this!\" Refusing to admit when you're wrong might be an effective technique for a guilt trip, but it's not a good approach to having a healthy relationship."
    },
    {
      "title": "Amp up the emotions.",
      "content": "Amp up the emotions. If the person is resisting your attempts to guilt them into apologizing, it's time to turn on the drama. Cry, yell, stomp around, whatever you feel like doing—eventually they'll probably be so desperate to calm you down that they'll say whatever you want to hear. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Play on the other person's emotions, as well. Use words like \"disappointed,\" \"selfish,\" and “ashamed” to fuel their internal guilt."
    },
    {
      "title": "Highlight any of your recent achievements or good deeds.",
      "content": "Highlight any of your recent achievements or good deeds. When you're getting ready to ask for something, start out by painting yourself in a positive light. The better you look, the more effective your guilt trip will be. [6] X Research source For instance, if you want a new phone, you might start off by saying, “Hey Dad, check out my report card! I only got one B this whole year!” If you're trying to get someone to donate to your charitable organization, you could list some of the good things the charity has done to help the community."
    },
    {
      "title": "Appeal to the other person's negative emotions as you ask for what you want.",
      "content": "Appeal to the other person's negative emotions as you ask for what you want. Sadness, pity, anger, injustice, and shame are all powerful motivators. When you're trying to get someone to give you something, making them feel a negative emotion can encourage them to give in, just so that feeling is replaced by something more positive. [7] X Research source For instance, if you want your parents to take you out to eat, you might say, \"I was really hoping we could go somewhere and spend time as a family, but I guess that's not important.\" If you want a new outfit, you might say, “I feel embarrassed because my clothes aren't as nice as the other kids at school.” Use exaggerated language like “always” and “never” to further your point. For instance, you might say, “You always work, and you never spend any time with me.”"
    },
    {
      "title": "Equate the thing you want with happiness or love.",
      "content": "Equate the thing you want with happiness or love. Once you've appealed to the other person's negative emotions, give them a reason to believe that giving in to you will make them—and you—feel better. Use words like “love,” “happiness,” and “the best” to get your point across. This technique is especially effective with parents, who are usually motivated by showing you their love. [8] X Research source For instance, you might say \"Don't you want me to be happy?\" or “By helping me, you'd be making yourself feel good, too!” You could also \"Don't you love me?\" or \"If you really loved me, you'd...\" Keep in mind that your parents actually do love you, and exploiting that for something small is a mean manipulative trick. It might be effective, but it also might make them mad."
    },
    {
      "title": "Keep asking in different ways even if they say no the first time.",
      "content": "Keep asking in different ways even if they say no the first time. Even the best guilt trip won't necessarily work the first time. If the person doesn't give you what you want, take a break and try again later. Be persistent, and they might eventually give in just to get you off of their backs. If they say no the first time, say something like, \"I know you said no, but think about it like this...\" You could also wait a few days, then say, \"I wish you would reconsider letting me drive your car this weekend.”"
    }
  ]
}