{
  "url": "https://www.wikihow.com/Make-a-Good-Speech-for-School",
  "title": "How to Make a Good Speech for School",
  "steps": [
    {
      "title": "Choose a topic or theme.",
      "content": "Choose a topic or theme. [1] X Research source [v161163_b01].12 November 2019. Most of your speech should explore one topic, or several related topics that follow a theme. What this theme is depends on the nature of the speech. Graduation speeches often have a theme about memories or the future, school election speeches convince people you'll make good decisions if elected, and class assignment speeches usually argue a controversial point. [2] X Research source If you're not sure which theme to choose, write down or summarize a few stories and statements you could include in your speech. Pick the ones you like best and see if there's a unifying theme to tie them together. See What to Do and What Not to Do for more advice on themes."
    },
    {
      "title": "Pick a tone that makes you comfortable.",
      "content": "Pick a tone that makes you comfortable. If you enjoy making people laugh, write a funny speech. If you are a serious person, create moments that will cause reflection. Remember to end on an inspirational and uplifting note, especially for commencement speeches."
    },
    {
      "title": "Use short sentences, and avoid words your audience won't understand.",
      "content": "Use short sentences, and avoid words your audience won't understand. Avoid long, meandering sentences and overcomplicated arguments. Unlike when writing an essay, you'll have difficulty explaining technical terms or referring back to your earlier points. Keep each sentence easy to follow. If younger kids will be present, make sure to use words and concepts they can understand. [3] X Research source Don't interrupt one point with a clause, or section set aside by commas or parentheses. Instead of saying \"Our tennis and basketball teams, which we all know won the regional championships two years ago, need increased funding to compete,\" say \"Our tennis and basketball teams both won the regional championships two years ago. Now we need to increase their funding to compete with other schools.\" You can reference your school's slang once or twice to get a laugh, but don't overdo it, especially if there are parents in the audience."
    },
    {
      "title": "Write down original stories and messages.",
      "content": "Write down original stories and messages. You can write a whole rough draft, or come up with several separate stories and inspirational statements that fit your theme. Stick to your own ideas and specific detail. People will enjoy and remember original and detailed sentiments more than generic phrases such as \"I will make our school proud\" or \"Our class will go on to do great things.\" [4] X Research source Find a broad message that your whole audience can connect to their own life, but still deals with a specific idea. For instance: \"Become an even better version of the hero who inspired you.\" (But don't steal your \"original\" idea from this website!) Your stories can be specific incidents in your life or from history, but you should connect them to a more general idea. For instance, you could tell a story about your sibling's hospital visit, then go on to talk about overcoming fear and hardship in general. If you like what you're writing but it doesn't fit the theme you had planned, it's fine to adjust your topic or switch it entirely. Switch back and forth between writing stories and brainstorming a theme if you keep getting stuck."
    },
    {
      "title": "Find a gripping way to begin your speech.",
      "content": "Find a gripping way to begin your speech. Pick an engaging and on-theme story to lead with, one that will grab your audience's attention and prepare it for the overall tone and message. Pay extra attention to the first sentence: [5] X Research source Surprise your audience by diving right into a tough story. \"When I was ten years old, I lost my father.\" Make your audience laugh by telling a joke, especially one that everyone in the room will get. \"Hello everyone. Let's have a round of applause for the guy who installed air conditioning.\" Start with a grand, thought-provoking statement. \"Our galaxy contains billions of earth-like planets, and we're only just beginning to discover them.\" Most likely, someone else will introduce you, and many of your classmates know you already. Unless you're asked specifically to introduce yourself, you can get right to the good stuff."
    },
    {
      "title": "Make the theme clear.",
      "content": "Make the theme clear. Your audience should know what your overarching theme is before you've finished your first few sentences. State exactly what you're talking about or at least suggest it strongly right at the beginning. [6] X Research source [v161163_b01]. 12 November 2019. To use an example from earlier, if your theme is \"Become an even better version of the hero who inspired you,\" you could begin your speech with two or three sentence about your hero, then say \"You all have heroes who inspire you, but you don't have to just follow them. You can become even greater than the people you look up to.\""
    },
    {
      "title": "Move from one idea to the next in a natural order.",
      "content": "Move from one idea to the next in a natural order. Don't jump straight from a joke to a story about surviving a car crash. Think about what the audience is feeling and expecting after each section. It's good to surprise them, but do it with your ideas, not by confusing them with a completely different topic. Include phrases such as \"Now I'd like to talk about...\" and \"But we should also remember...\" when moving on to your next idea."
    },
    {
      "title": "End with a memorable statement that captures your speech.",
      "content": "End with a memorable statement that captures your speech. A good joke or an idea that makes people think are two good ways to end a speech, depending on the overall mood. If you're arguing a point, summarize it briefly and end by restating your position firmly. [7] X Research source Build up to a big ending, then crack a joke to wrap up a funny speech. \"And I know when you walk to the ballot box tomorrow, you'll be ready to do the right thing. Protect the interests of yourself and your school by washing your hands afterward. Do you know how many people touch that thing?\" If you're giving a commencement speech, leave people feeling excited or awed about the future. This is a big moment and you have the power to help them realize it. \"Years from now, you will be the father or mother your kid looks up to. The writer who changes the way we think. The inventor who creates new ways to live. Come up to the stage and start becoming heroes!\""
    },
    {
      "title": "Edit and polish it as much as possible.",
      "content": "Edit and polish it as much as possible. [8] X Research source [v161163_b01]. 12 November 2019. Congratulations, you've finished your first draft. Wait, the work isn't over yet! To write a good speech, you will need to work on it, think about it, and maybe even rewrite the whole thing. Have a teacher, family member, or trusted friend check it over for grammar mistakes and offer feedback. Spelling isn't as important, since you'll be speaking out loud."
    },
    {
      "title": "Consider visual aids.",
      "content": "Consider visual aids. Bringing in maps, pictures, or other materials is most practical and useful for speeches given as class assignments, since you'll have something to write on and don't need to transport your materials outside the classroom. You won't need anything like this for a graduation speech. [9] X Research source If your topic involves a lot of numbers, plan to write them on the board so your audience can remember them"
    },
    {
      "title": "Turn the speech into note cards, then practice!",
      "content": "Turn the speech into note cards, then practice! [10] X Research source [v161163_b01]. 12 November 2019. No one wants to listen to you read an essay out loud. You'll need to become familiar enough with what you wrote to deliver it confidently while looking at your audience. It is a good idea to write down notes on small index cards to jog your memory. Your notes are there to remind you what to say next and of important facts. \"Move on to bear wrestling story (guy's name is Paul Bunyan)\" is the level of detail you need."
    },
    {
      "title": "Think about movement and materials.",
      "content": "Think about movement and materials. Will you be standing or sitting? Do you have room to move around a little, or will you stand in place? Where will you keep your note cards, visual aids, or other materials? What will you do with them once you're done? Practice giving your speech in as situation as similar to your actual speech as possible. In general, you should stay fairly still while giving a speech. Small hand gestures and occasionally moving to a new spot are fine, especially if they help you feel and appear confident"
    },
    {
      "title": "Practice speaking loudly and clearly.",
      "content": "Practice speaking loudly and clearly. [11] X Research source [v161163_b01]. 12 November 2019. If you're going to speak to a roomful of people or more, learn to project your voice, not mumble or scream. Stand with your legs shoulder width apart and your back straight. Try to speak using your diaphragm, pushing the air out from low in your chest. [12] X Research source"
    },
    {
      "title": "Time yourself while you read the speech out loud.",
      "content": "Time yourself while you read the speech out loud. Use the stance and techniques described above. If you have already memorized your speech, use your index cards. Otherwise, that's okay — just read it from the page. [13] X Research source If you speech is too long, you absolutely need to cut some material out of it or shorten the longer stories or ideas. If you're giving a commencement speech, aim for a 10 or 15 minute maximum. An election speech should be no more than a few minutes, and your teacher should be able to tell you the time limit for a class assignment speech."
    },
    {
      "title": "Talk slowly and pause between ideas.",
      "content": "Talk slowly and pause between ideas. It's easy to rush when you're nervous. Pause at the end of each sentence. At the end of a section, before you move on to the next idea, make a longer pause and pretend you're looking across your audience making eye contact with a few people. [14] X Research source If you can't stop rushing, work out how long you should spend on each section and write the number of minutes at the top of each index card or paragraph. Practice near a clock so you can check whether you're on pace."
    },
    {
      "title": "Deliver your speech to a mirror until you can do it without reading.",
      "content": "Deliver your speech to a mirror until you can do it without reading. Start by reading your speech out loud, then try to look down at the page less and less and make eye contact with your reflection instead. Eventually, you should be able to make your speech while only referring to notes written on index cards. [15] X Research source Use slightly different words each time once you have the main ideas down. Try not to get caught up on exact memorization; using a new phrase to communicate the written idea makes your speech sound more natural."
    },
    {
      "title": "Pay attention to other details once you become comfortable with the content.",
      "content": "Pay attention to other details once you become comfortable with the content. Once you can remember each idea and connect them together smoothly, watch the mirror more closely and correct any issues you see. Practice varying your facial expression if your face looks fixed and mechanical. Try to vary the tone of your voice as well. Don't make it sound like you're reciting every word from memory; pretend you're speaking in ordinary conversation."
    },
    {
      "title": "Practice in front of a test audience.",
      "content": "Practice in front of a test audience. Gather together your family members or friends and ask them to listen to your practice. You'll probably feel nervous, but the practice will make you more confident for the actual speech. Try to make eye contact with different members of your audience throughout the speech. Don't stare at any one person for too long. Resist the temptation to hide by standing near a corner or large object. Don't fidget, tap your foot, or make other nervous gestures. Try slowly walking back and forth across the stage to get rid of your nervous energy."
    },
    {
      "title": "Use their feedback to practice more.",
      "content": "Use their feedback to practice more. The members of the audience may pick up on problems you didn't even consider, whether with the statements you make or your delivery style. Take their advice gracefully; they're doing you a favor by letting you know what you need to improve. [16] X Research source"
    },
    {
      "title": "Prepare yourself for confidence on the day of the speech",
      "content": "Prepare yourself for confidence on the day of the speech . Get to bed early the night before and eat full, comforting meals that won't upset your stomach. Take your mind off the event with other activities in the hours before the speech. [17] X Research source Dressing nicely will increase your confidence and gain respect and attention from your audience."
    },
    {
      "title": "Choose an appropriate theme (for an election speech).",
      "content": "Choose an appropriate theme (for an election speech). You should spend a short amount of time covering your qualifications, but most of your speech should focus on what you plan to change or accomplish if you get elected. If you can, try to group these together into a memorable category or snappy message."
    },
    {
      "title": "Choose an appropriate theme (for a commencement speech).",
      "content": "Choose an appropriate theme (for a commencement speech). Here are a few examples of common themes, although you should try your best to turn one of these into a more specific, original topic: Memories your class shares and personal memories that many people will connect to, such as your first day at the school. Overcoming obstacles. Talk about how your classmates overcame problems related to academics, finances, and health, and how proud everyone is that they're standing here. The diversity of your classmates and celebrating the rich variety of experiences, personalities, and interests at your school. Describe some of the many ways people will go on to do good in the world."
    },
    {
      "title": "Use techniques to make your speech more memorable.",
      "content": "Use techniques to make your speech more memorable. You may not consider yourself a great writer, but there are some decisions you can make that will make any speech more engaging: [18] X Research source Address your audience directly. Ask them questions to get them thinking, although you shouldn't expect an answer. Use groups of three. The human brain loves repetition, and especially trios. Start three sentences with the same phrase, speaking louder each sentence. Use emotive language. Try to provoke a strong emotional response in your audience, not present a list of facts to them."
    },
    {
      "title": "Thank specific people, but don't go on too long.",
      "content": "Thank specific people, but don't go on too long. If it's relevant to your topic, you should thank your teachers, parents, or other influences on your life. But don't go into a lot of detail unless it's part of an engaging story; you could easily bore or confuse the audience."
    },
    {
      "title": "Make references your audience will get, but avoid all others.",
      "content": "Make references your audience will get, but avoid all others. Including a quote from a popular movie or a reference to a famous event at your school will keep your audience excited, as long as you only use this technique a few times. Don't tell stories that only a few friends will understand. Even references that your whole class will get should be used sparingly if there are parents in the room as well."
    },
    {
      "title": "Avoid clichés.",
      "content": "Avoid clichés. The same old sayings crop up in every speech, especially graduation speeches. If you can keep them to a minimum, you'll stand out from the crowd. Here are a few phrases that are overused in graduation and election speeches: [19] X Research source Go change the world! Today is not the last day of your education, but the first. The future belongs to you. If elected, I will be the voice of the students. It's time for change!"
    },
    {
      "title": "Don't insult or offend anyone.",
      "content": "Don't insult or offend anyone. A speech is not an opportunity to trash talk another student, even jokingly. Even in an election, you'll earn more respect by focusing on your own attributes than attacking your opponent. If you're giving a high school commencement speech, remember that not everyone in your class will be attending college. Don't joke about your education letting you avoid a \"bad\" profession; chances are good there's a parent who has that job out in the audience.="
    }
  ]
}