{
  "url": "https://www.wikihow.com/Make-Your-Best-Friend-Jealous-of-You",
  "title": "How to Make Your Best Friend Jealous of You",
  "steps": [
    {
      "title": "Hang out with other friends.",
      "content": "Hang out with other friends. A good way to make your friend jealous is hanging out with other friends. Many people fear they're missing out, and if your friend sees you making plans with others, he or she may become jealous. Make sure your friend knows you're hanging out with others. If your friend asks you to hang out on a Saturday night, note that you're hanging out with another group. You can also bring up events that your friend missed when your hanging out with mutual friends. In a group, mention an inside joke you guys formed during a movie night your friend missed."
    },
    {
      "title": "Brag in subtle ways.",
      "content": "Brag in subtle ways. A good way to make others jealous is to find subtle ways to brag about yourself. Outright bragging may feel too awkward for you, so find ways to work small brags into day-to-day conversations. [1] X Research source Talk about your accomplishments in a way that makes you look gracious. When you have success, try to talk about it in a way that conveys excitement. For example, you can try something like, \"I can't believe I got an A on that test. I'm so happy and grateful my Mom helped me study.\" Be a little self-depreciating. You can brag about your achievements while simultaneously downplaying them, allowing you to show off without being too overt. Say you got an internship. You can text something like, \"So tired. I just spent all day doing the work the real employees don't want to do.\" This acknowledges your internship without succumbing to outright bragging."
    },
    {
      "title": "Use social media to your advantage.",
      "content": "Use social media to your advantage. Social media often makes other jealous. As you pick and choose what to share, you can cater your updates to make things look better than they are. You can find ways to make your friend jealous by posting happy statuses and updates on social media accounts. [2] X Research source Post things from vacations and outings. If you had your nails done, for example, post a before/after picture. Update others on your successes via social media. If you got a new job, for example, post about it. If you did great on a test, let others know on Facebook or Twitter. If you're going out with other friends, post pictures and updates. If your friend sees them, he or she may get jealous."
    },
    {
      "title": "Show off your strengths.",
      "content": "Show off your strengths. Everyone has things that come naturally to them. If you have a particular strength or talent, showing it off can inspire jealousy. If you're a great writer, for example, have your friend read a story you wrote. You can claim to be asking for feedback when you're really showing off."
    },
    {
      "title": "Focus on your own goals.",
      "content": "Focus on your own goals. Sometimes, you can make your friend jealous simply by working on yourself. If you're pursuing your own goals and interests, you'll eventually have more success. This can help make your friend jealous. Focus on what you want. If you want to improve your grades, for example, work on studying more, completing homework quickly, and asking questions in class. Pursue your outside interests as well. If you're interested in art, for example, join a drawing class and practice drawing in your free time."
    },
    {
      "title": "Follow up on commitments.",
      "content": "Follow up on commitments. If you come off as a reliable person, others will be drawn to you. If you're in a club, show up on time every day and always volunteer to do extra work. If you're trying to make friends with someone new, always keep plans and show up on time. Opportunities will present themselves as you'll be asked to do things more. A president of a club may ask you to coordinate something. If you're fun and reliable, your social life will begin to blossom. [3] X Research source If your friend sees you have a lot going on, he or she may become jealous."
    },
    {
      "title": "Show off nice things.",
      "content": "Show off nice things. Another way to make your friend jealous is to show off nice things. If you have something you know your friend wants, make a point of mentioning it. If you have a new dress or outfit that you know your friend will admire, wear it to school or to a social event where you'll see your friend. If you have a new device, like a new phone or iPod, you can show it to your friend. Try not to come off as boastful, but simply say something like, \"Check this out. I just got it.\" You can find subtle ways to show off new technology. For example, say you got a new camera. You can say you want to take some pictures with your friend. Avoid being cruel, however. If there's something your friends wants but can't have, it may be best to avoid bragging about this. For example, say your friend's parents don't make a lot of money and, therefore, he or she can't afford new school clothes. It may be a bad idea to show off your new outfit."
    },
    {
      "title": "Have a good attitude.",
      "content": "Have a good attitude. People are often jealous of those with self-confidence. If you want your friend to be jealous of you, work on fostering a good attitude. Try to genuinely congratulate others on their successes. If you run into a setback, take it in stride and see it as a learning experience. If your friend sees you're resilient and positive, he or she may become jealous of your great attitude."
    },
    {
      "title": "Examine yourself.",
      "content": "Examine yourself. Consider why you're trying to make your friend jealous. There are a variety of reasons you may want to make someone jealous of you. If you're trying to make your friend jealous, try to figure out the reason. Over time, jealousy can cause strain on a relationship. If you want to keep your relationship with your best friend healthy, you need to examine underlying issues. If you tend to get jealous yourself, you may be an insecure person by nature. Therefore, you may try to make others jealous to raise your own self-esteem. You might not have had strong attachments early in life, fueling insecurity and jealousy. If you do find yourself feeling jealous of your friend, look for ways to put that envy into action. For instance, you could create a goal for yourself that allows you to fill up that insecurity or void without tapping into your envy. Are you angry at your friend? If your friend did something to hurt your feelings or make you insecure, you may be trying to make him or her jealous as payback. While this can feel good in the short term, it's a good idea to eventually talk it out. Communication is important to a successful relationship."
    },
    {
      "title": "Talk things out with your friend.",
      "content": "Talk things out with your friend. If there's an issue that needs addressing, talk it out. Instead of passive aggressively making your friend jealous, you should be upfront about any issues you have and work on smoothing things over. [4] X Research source Choose a specific time and place to talk. Pick a time where neither of you are busy, and a place free of external distractions. For example, you can meet on a Saturday afternoon at a large coffee shop that's usually not crowded. Think about what you want to say ahead of time. Have some idea of the issues that are bothering you. It may help to write down your thoughts to try and sort them out."
    },
    {
      "title": "Use \"I\" statements when expressing yourself.",
      "content": "Use \"I\" statements when expressing yourself. \"I\" statements are statements that begin with \"I feel...\", after which you state your feeling. Then, you would explain the behavior that leads to that feeling, and why you feel the way you do. This lessens blame, as you're focusing on your own feelings and not external truths. For example, say you were trying to make your friend jealous because she keeps bragging about her boyfriend. Don't say, \"It's irritating that you always talk about your boyfriend when we hang out. It's like I'm not important to you.\" Rephrase the above sentiment using an \"I\"-statement. Say, \"I feel irritated when you talk about your boyfriend when we hang out because it makes me feel like you don't value the time you spend with me.\""
    },
    {
      "title": "Find a way to move on.",
      "content": "Find a way to move on. After talking out your issues, work on establishing a mutually beneficial solution. You and your friend should work on ways to better communicate with one another. Set some ground rules to make sure jealousy does not continue to damage your relationship. You could both agree not to bring up specifics about certain subjects. If you struggle with your weight, for example, you could ask your friend not share details with you about her exercise regimen. Apologize. If you were intentionally making your friend jealous, this can be very hurtful. After admitting to trying to spur jealous, offer your friend a sincere apology. This will help the two of you move on."
    }
  ]
}