{
  "url": "https://www.wikihow.com/Get-Your-Spouse-to-Clean-Up-After-Themselves",
  "title": "Does Something Need to Change? 10 Ways to Get Your Spouse to Clean Up After Themselves",
  "steps": [
    {
      "title": "Make time to talk with your spouse about your concerns.",
      "content": "Make time to talk with your spouse about your concerns. Calmly discuss what's bothering you and what you'd like to change. [1] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. You might say something like, \"I'm feeling really stressed out with our messy place. It's like I'm always cleaning up something and I'm tired.\" [2] X Research source It's totally fine to get specific here, especially if 1 or 2 things are really bothering you. For instance, say, \"The bathroom is always a mess—the towels are laying everywhere, dirty clothes are on the floor, and there's toothpaste on the sink.\""
    },
    {
      "title": "Skip the judgment and focus on what you'd like to see.",
      "content": "Skip the judgment and focus on what you'd like to see. [3] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. Avoid using phrases like, \"You always,\" or \"You never,\" since your spouse will instantly feel defensive. You might phrase things like, \"I wish you could put your dirty clothes in the hamper,\" rather than, \"You never put your dirty clothes in the hamper.\" [4] X Research source Your spouse will be a lot more receptive to cleaning if you don't make the issue personal. If you're getting angry, maybe take a moment before you continue the conversation. This conversation is also a great way to see what they're doing right now. You might not realize that your spouse always dusts the furniture until they mention it."
    },
    {
      "title": "Write down all of the cleaning tasks that are important to you.",
      "content": "Write down all of the cleaning tasks that are important to you. Sit down with your spouse and make a comprehensive list of all the cleaning jobs you do around your home. Don't forget to include things that you do only once every week or so like take the trash to the curb or mop the kitchen floor. Your list might look like: [5] X Research source Bedroom: wash the sheets, declutter, vacuum, dust the furniture Bathroom: scrub the tub, sink, and toilet; mop the floor, change the towels, clean the mirror Living room: vacuum or mop, declutter, dust the furniture Kitchen: clean out the fridge, wipe countertops, scrub the sink, empty and load the dishwasher, take out the trash"
    },
    {
      "title": "Find out what tasks your partner prefers to do.",
      "content": "Find out what tasks your partner prefers to do. Decide together which chores on the list your spouse will do and what you'll do. This might be hard to do, but talk about whether you'll create a fair division of labor or if one person will be responsible for more tasks. If that's the case, discuss how you both feel about it. If one person feels resentful, you'll need to adjust the list differently. For instance, if you don't work a job outside the home, but your spouse puts in 40 hours a week, they probably won't be able to put in as much cleaning time. In this case, pick a few things that you'd really like to see them do—put their clothes in the hamper, run the dishwasher, keep the office clean, etc. The point is for you to be on the same page so you both feel happy with the cleaning arrangement. For instance, if your spouse really hates doing a task like mopping, try to find something else that they're more likely to stick with like vacuuming or decluttering."
    },
    {
      "title": "Don't expect your spouse to improve overnight.",
      "content": "Don't expect your spouse to improve overnight. It's more realistic to start with small tasks and add to them as your spouse becomes more helpful. For instance, if your partner never cleans up after themselves, then getting them to put dirty clothes in a hamper and tidy their area in the bedroom is a fantastic start. [6] X Research source You may need to adjust your expectations over time. If you were too ambitious at the start, maybe scale back, or if your spouse eagerly follows through with tasks, you two might add more to their list."
    },
    {
      "title": "Try to make cleaning a fun activity for both of you.",
      "content": "Try to make cleaning a fun activity for both of you. Sure, tidying up isn't something that either of you probably looks forward to, but you can make it more enjoyable. If your home needs a thorough cleaning, turn on some music or a podcast and clean your home together. [7] X Research source Congratulate each other on a job well done when you're finished. You might go out for coffee or treat yourselves to takeout and a movie."
    },
    {
      "title": "Talk with your spouse if you need extra support.",
      "content": "Talk with your spouse if you need extra support. Maybe you're sick, extra busy, or you think your spouse could be helping you more. Whatever the reason, just ask your partner for help with something specific when you need it. [8] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. This is way better than hoping your spouse will read your mind and getting frustrated when they don't. [9] X Research source For example, say, \"I have extra meetings this week, so could you run a load of laundry tomorrow?\""
    },
    {
      "title": "Re-cleaning signals to your spouse that they didn't do a good job.",
      "content": "Re-cleaning signals to your spouse that they didn't do a good job. If they continue to see you do this, they'll stop trying altogether. After all, why should they fold the laundry if you'll just come through and re-do it? [10] X Research source If you don't like the way your spouse is doing something, don't wait and correct it. Instead, say something like, \"Hey, usually I sort the laundry into 3 loads: whites, darks, and towels.\""
    },
    {
      "title": "Thank them for the work they put in so they feel valued.",
      "content": "Thank them for the work they put in so they feel valued. In a way, you're modeling the behavior you want to see from them. Tell your spouse that you noticed when they picked up after themselves or tidied up around the home without you asking. It's nice to feel noticed and appreciated, so you're reinforcing their behavior. [11] X Research source You might say, \"Hey, I saw that you put all the breakfast dishes away. Thanks for doing that.\" It's as simple as that! If you'd like more guidance, Kelli Miller, a psychotherapist and wikiHow Brand Ambassador, recently wrote an excellent book — Love Hacks — that provides tangible advice for communicating with your spouse and addressing relationship issues."
    },
    {
      "title": "Talk with your spouse if you want to switch chores.",
      "content": "Talk with your spouse if you want to switch chores. Just because you two came up with a list together doesn't mean it's set in stone! It's totally fine to see how things work and make adjustments. For instance, if you become pregnant, you shouldn't clean the litter box anymore, so your spouse should take on that task. You might take over their job of washing up after dinner."
    }
  ]
}