{
  "url": "https://www.wikihow.com/Install-a-Front-License-Plate",
  "title": "How to Install a Front License Plate",
  "steps": [
    {
      "title": "Remove the screws in the bracket that secure the license plate.",
      "content": "Remove the screws in the bracket that secure the license plate. Locate screws at the corners of the license plate bracket on your front bumper. [1] X Expert Source Audra Fordin Certified Automotive Technician Expert Interview. 13 January 2022. Turn them counterclockwise with a screwdriver to remove them, then keep them in a safe place so they don’t get lost. If the bracket held an old license plate, it’ll come off when you remove the screws. [2] X Research source If your vehicle is new, the license plate bracket screws might be in the glove compartment. If you have no screws, you can pick up some license plate screws at a nearby hardware or automotive store."
    },
    {
      "title": "Check for a license plate frame.",
      "content": "Check for a license plate frame. Some license plate brackets have a screw-mounted frame that fits over the license plate. [3] X Expert Source Audra Fordin Certified Automotive Technician Expert Interview. 13 January 2022. If your bracket has a frame, just remember to align it over your license plate and insert screws through both during installation. You’ll know you have a license plate frame if a separate rectangular piece comes off when you remove the bracket’s screws."
    },
    {
      "title": "Align the license plate with the holes in the bracket.",
      "content": "Align the license plate with the holes in the bracket. Locate the holes in the corners of the license plate and the bracket. Place the license plate into the bracket so the holes are aligned. [4] X Research source If your bracket includes a frame that fits over the license plate, line its holes up with those in the plate and bracket. [5] X Expert Source Audra Fordin Certified Automotive Technician Expert Interview. 13 January 2022."
    },
    {
      "title": "Drive the screws to secure the license plate.",
      "content": "Drive the screws to secure the license plate. Insert your screws through the holes in the bracket and license plate (and frame, if applicable). Tighten the screws by turning them clockwise with your screwdriver to complete installation. [6] X Research source"
    },
    {
      "title": "Purchase a mounting bracket that fits your make and model.",
      "content": "Purchase a mounting bracket that fits your make and model. Look online or visit your local automotive store for a no-drill mounting bracket that fits your car’s make and model. Many no-drill brackets use a strong adhesive and fit a variety of makes and models. Some brackets fit only a specific model and include special hardware to clamp the bracket onto the grill or bumper. Check your product manual for specific installation instructions. [7] X Research source"
    },
    {
      "title": "Clean the mounting site on your bumper with alcohol wipes.",
      "content": "Clean the mounting site on your bumper with alcohol wipes. An adhesive-mounted bracket requires a clean installation site. Locate the center of your bumper where you’ll mount the bracket, clean it with alcohol wipes, then let it air dry or dry it with a clean microfiber cloth. [8] X Research source Some brackets attach to the front face of the bumper, while others stick to indentations or gaps unique to specific models. Check your installation instructions for details about the mounting location."
    },
    {
      "title": "Test the fit without removing the protective film.",
      "content": "Test the fit without removing the protective film. The adhesive is protected by a film, which you should leave in place while you test the fit. Place the bracket onto the mounting site to make sure it fits and matches your model. [9] X Research source If it doesn’t line up with your car’s bumper, you might have accidentally bought the wrong kind of bracket. See if you can exchange it for the correct bracket."
    },
    {
      "title": "Remove the protective film and press the bracket to the bumper.",
      "content": "Remove the protective film and press the bracket to the bumper. After you’ve double checked your bracket’s fit, peel back the protective film to expose the adhesive. Press the bracket firmly onto the bumper’s front face, underside, or other mounting site specified in your product’s instructions. [10] X Research source Try to be precise when you mount the bracket, since you'll only get one shot."
    },
    {
      "title": "Screw the license plate onto the bracket.",
      "content": "Screw the license plate onto the bracket. Once the bracket is in place, you can align its holes with the holes in your license plate. If your product includes a license plate frame, place it over the license plate and align its holes with those in the bracket and plate. Drive the screws clockwise through the holes to complete installation. [11] X Research source"
    },
    {
      "title": "Locate and remove the plastic panel that covers the tow hook anchor.",
      "content": "Locate and remove the plastic panel that covers the tow hook anchor. Many models have a plastic plate in the front bumper that you can press and pop out. It conceals a tow hook anchor, and license plate brackets are available with a threaded stud that drives into the anchor. [12] X Research source Make sure you have a tow hook anchor before you purchase a tow hook license plate bracket kit."
    },
    {
      "title": "Screw in your kit’s tow hook stud.",
      "content": "Screw in your kit’s tow hook stud. Grab the tow hook stud included in your kit and insert the threaded end into the anchor slot. Turn it clockwise until it’s tight. [13] X Research source"
    },
    {
      "title": "Drive the bolt through the holes in the bracket and tow hook stud.",
      "content": "Drive the bolt through the holes in the bracket and tow hook stud. Align the hole in the bracket plate with the hole in the tow hook stud. Your kit includes a bolt that fits through these holes. Locate it and drive it through the holes to attach the bracket plate to the tow hook stud. [14] X Research source Turn the bolt clockwise with your fingers to get it started, then use a ratchet to finish tightening it."
    },
    {
      "title": "Attach the license plate to the bracket.",
      "content": "Attach the license plate to the bracket. With the bracket in place, all that’s left is to screw on the license plate. If your product includes a license plate frame, remember to place it over the plate and drive the screws clockwise through both the plate and the frame. [15] X Research source"
    },
    {
      "title": "Check if you have a fiberglass or metal bumper.",
      "content": "Check if you have a fiberglass or metal bumper. Drilling into metal is more complicated than drilling into fiberglass. If you have a chrome bumper, you might want to try a no-drill method if you've never drilled into metal. If you do want to try drilling into a chrome bumper, you'll need to take a few more steps and use special tools. You'll need a center punch, a bit made for drilling into metal, a countersink bit, and safety glasses. [16] X Research source"
    },
    {
      "title": "Align the license plate bracket with the center of your front bumper.",
      "content": "Align the license plate bracket with the center of your front bumper. Use a measuring tape to measure your bumper’s length so you can find the exact center. Mark the lengthwise center with tape or a felt-tip pen, then measure the bumper’s height to find that center point. Once you’ve found the bumper’s exact center point, place your license plate bracket over it. [17] X Research source If you’re not using a bracket, just place the license plate itself onto the bumper."
    },
    {
      "title": "Make guide marks through the holes in the bracket.",
      "content": "Make guide marks through the holes in the bracket. Hold your license plate bracket over the bumper’s center point and locate the pre-drilled mounting holes. Use a felt-tip pen to mark where you’ll need to drill holes into your bumper to line up with the bracket’s holes. [18] X Research source Keep in mind the bracket’s mounting holes are where it mounts to the bumper, not the holes at the corners that you’ll use to screw on the license plate. If you’re not using a bracket, just make marks on the bumper for the holes at the plate’s top corners."
    },
    {
      "title": "Drill 1⁄8 inch (0.32 cm) pilot holes into the bumper.",
      "content": "Drill 1 ⁄ 8 inch (0.32 cm) pilot holes into the bumper. After you’ve marked your guide holes, set the bracket or license plate aside. Use a power drill and a 1 ⁄ 8 inch (0.32 cm) bit to drill shallow pilot holes into the bumper. Drill your pilot holes only about 1 ⁄ 8 inch (0.32 cm) deep into the bumper. [19] X Research source If your bumper is chrome, you'll need to start your holes with a center punch before you can start drilling."
    },
    {
      "title": "Use a center punch and a special drill bit for chrome bumpers.",
      "content": "Use a center punch and a special drill bit for chrome bumpers. After marking the spots on the chrome where you'll need to drill, hammer your center punch into the spots to make indentations. It's wise to add lubricating oil to the indentations to reduce friction and heat. Wear safety glasses to protect your eyes. [20] X Research source Placing masking or duct tape around the spot where you're drilling can help protect the chrome finish if your bit slips. Hold your drill (with a bit made for drilling into metal) perfectly perpendicular to the surface. Use firm, steady pressure to drill into the chrome. After you drill the holes, switch to a countersink bit and rotate it 3 to 4 revolutions to smooth sharp metal burrs from the hole's leading edge."
    },
    {
      "title": "Mount the bracket to the bumper.",
      "content": "Mount the bracket to the bumper. Line the bracket’s mounting holes up with those you’ve just drilled into the bumper. Drive screws clockwise through the bracket into the bumper. [21] X Research source"
    },
    {
      "title": "Screw the license plate onto the bracket.",
      "content": "Screw the license plate onto the bracket. After mounting the bracket, line the holes at the corners of the license plate with those at the bracket’s corners. Drive screws clockwise through the holes to secure the license plate and complete installation. [22] X Research source If you’re not using a bracket, screw the license plate directly onto the bumper."
    }
  ]
}