{
  "url": "https://www.wikihow.com/Make-Your-Top-Bunk-Cool",
  "title": "How to Make Your Top Bunk Cool",
  "steps": [
    {
      "title": "Get permission before making changes.",
      "content": "Get permission before making changes. This is especially important if you plan on doing anything that might damage the wall or your bed, like installing shelves, hanging hooks, or even painting. Making big changes without permission could get you in trouble. Tell your parents you want to make your top bunk cool by saying something like, \"Mom and dad, my bunk's great but it's a little plain. I was thinking maybe we could make some improvements?\""
    },
    {
      "title": "Make a plan.",
      "content": "Make a plan. You might not be able to make all of your improvements at once. Having a general plan for how you want to make your bed cool will help make sure you get everything done. A plan is also helpful in case you need to purchase supplies. For example, you might need things like: Hooks for hanging things (either adhesive or screw-in). Tacky putty or poster adhesive, for putting up pictures without damaging walls. A shelf to improve your storage space. String lights, to create a cozy space in your bunk."
    },
    {
      "title": "Purchase bunk improving supplies.",
      "content": "Purchase bunk improving supplies. Once you've made a plan and know roughly what you'll need to improve your top bunk, you can go shopping. You might want to check prices online first, so your parents aren't surprised by the cost of the items you want. Many bunk improving supplies can be found at home centers, hardware stores, and big box stores, like Walmart and Target."
    },
    {
      "title": "Install a shelf",
      "content": "Install a shelf . You and your parents can make your own shelves , or you could buy one from a store. By adding a shelf to your bunk space, you'll have a place to stash important items, like books, your tablet, your cell phone, and so on. [1] X Research source Be careful when hanging your shelf. Placing it too close to your bunk might result in you hitting your head on it, knocking items off, and so on, which could be dangerous. [2] X Research source"
    },
    {
      "title": "Hang hooks in your bunk area.",
      "content": "Hang hooks in your bunk area. Adhesive hooks won't do damage to your walls, but screw-in hooks will be sturdier. Adhesive hooks can even be used on your bed frame, which is a great spot to hang sweatshirts and jackets. To add color and character to your bunk, you might want to hang streamers, long strips of fabric, scarves, and so on from hooks. Hooks are also a great way of keeping jewelry and accessories from disappearing. You'll be able to clearly see belts, necklaces, and bracelets that are hanging from hooks."
    },
    {
      "title": "Use satchels and bags for hanging storage.",
      "content": "Use satchels and bags for hanging storage. A bag with a strap can be hung from one of the corners of your bed. This is the perfect place to store less frequently used items, like books, a box of tissues, extra blankets, spare batteries, a flashlight, and more. You might want to use a specially designed hanging storage container. These oftentimes have special compartments to keep your things organized. [3] X Research source"
    },
    {
      "title": "Organize power cords with binder clips.",
      "content": "Organize power cords with binder clips. This will also ensure your power cords are always accessible. Take a large binder clip and clamp it onto your bed frame. Then, flip the metal parts so they're facing opposite the mouth of the clip. Feed cords through the open space of the metal part to hold power cords in place. [4] X Research source You can buy binder clips at office supply stores or even at the grocery store. You can even get colored binder clips to suit your room's color scheme or make a neat design."
    },
    {
      "title": "String up Christmas lights.",
      "content": "String up Christmas lights. String lights are a great way to make your bunk look like a magical place. This soft lighting is also easy on the eyes, so you won't have to worry about being blinded by it. Use hooks, tacks, and so on to fasten the lights in place above your bunk. With enough string lights, you can extend them all the way down the frame of your bed. In some cases, you may be able to use binder clips to hold these in place. Short, battery powered strings of lights are a great option if you don't have a wall outlet that's convenient. These can be bought at craft stores. To prevent the lights from getting to hot and potentially creating a fire risk, use LED string lights. [5] X Research source"
    },
    {
      "title": "Drape a sheet from the ceiling for added privacy.",
      "content": "Drape a sheet from the ceiling for added privacy. Not to mention, enclosing your bed with fabric walls, much like a tent, will look cool. Put in an adhesive hook or a screw-in C-hook over your bed. Hang a sheet from the hook, and tuck the edges around the sides or your bunk. To give more form to your fabric bunk shelter, you might want to put in hooks at the four corners of your bed. Otherwise, the sheet may hang too low and make it feel cramped. You can also attach a sheet (or other fabric) to your ceiling with thumb tacks. Be sure to use a light fabric, otherwise its weight might pull out the tacks. [6] X Research source"
    },
    {
      "title": "Add pictures and art to your wall.",
      "content": "Add pictures and art to your wall. Adhesive putty or poster adhesive won't damage your walls or paint like tape sometimes does. You can also display your pictures with a cork board hung from hooks. Use push pins to hang up pictures of your family, friends, pets, and so on. If you don't have art but want to add some to your bunk space, visit a secondhand store, like Goodwill or Salvation Army. These often have lots of unique, inexpensive art."
    },
    {
      "title": "Create a stenciled message to express yourself.",
      "content": "Create a stenciled message to express yourself. Stencil a message on decorative paper and cut out the letters. Use poster adhesive or adhesive putty to put up this message without damaging your wall. This way, you can easily change the message whenever the mood strikes you. Some message ideas include: [7] X Research source Tanya's bed! Fort Top Bunk The Castle in the Sky"
    },
    {
      "title": "Put up a white board for reminders and messages.",
      "content": "Put up a white board for reminders and messages. You can also easily draw and erase designs on a white board. This makes it both functional and decorative. A whiteboard is also a great idea if you sometimes get ideas late at night. You can jot them down when they happen and look at them in the morning. Dreams can be difficult to remember. If you've woken up from a cool dream, write it down on your whiteboard so you remember later and can share it with your family and friends."
    },
    {
      "title": "Get a fan.",
      "content": "Get a fan. The top bunk can get warm sometimes, especially in the summer. A small fan can help with circulation and improve your comfort. You may want to choose a plug-in fan to save on batteries and cut down on the inconvenience of changing them. Some fans clip onto surfaces. One of these might be perfect for your bunk, and might help save space, too."
    },
    {
      "title": "Buy a reading light.",
      "content": "Buy a reading light. Because the top bunk is so close to the ceiling, you might not have great reading light. Also, getting out of your bunk to turn on the lights can be a pain. A plug-in reading light that clips onto your bed frame or sits on an accessible shelf can be a big help. [8] X Research source Many reading lights have a long battery life. One of these might be most convenient for you, as a battery powered light will be more portable, allowing you to move it around your bed where you need it most."
    },
    {
      "title": "Load your bed with pillows.",
      "content": "Load your bed with pillows. Not only will this be comfy, but you can also use the pillows to make a fort. Stack pillows along the sides of your bed and hang a sheet from the top of the pillow walls to create a roof. Add a pillow to the ladder area for a door, and you've got a castle all your own. [9] X Research source Pillows can be expensive. Save money while building up your pillow horde by purchasing these from secondhand stores."
    },
    {
      "title": "Use a hanging tray for holding food and drinks.",
      "content": "Use a hanging tray for holding food and drinks. Some trays can clip onto a narrow surface, like the side or rail of your bunk. These can be super useful if you like to have a glass of water at your bedside at night, or if you enjoy a snack in bed. [10] X Research source Search for these kinds of shelves at home centers, hardware stores, and furniture stores. If you're having no luck, online might be the best place to find this kind of shelf."
    }
  ]
}