{
  "url": "https://www.wikihow.com/Make-Christmas-Crackers",
  "title": "How to Make Christmas Crackers",
  "steps": [
    {
      "title": "Cut a piece of paper into an 8 inch (20.3 cm) by 12 inch (30.5 cm) rectangle.",
      "content": "Cut a piece of paper into an 8 inch (20.3 cm) by 12 inch (30.5 cm) rectangle. [1] X Research source You can use gift wrap, construction paper, butcher paper, scrapbooking paper, or even tissue paper. Hide the contents if you use tissue paper. Stack 2 to 3 sheets so the contents will stay invisible. The paper does not have to be Christmas themed. It can be winter themed instead. Blue, white, and silver stripes are perfect for a Winter Wonderland party. You can use a summer theme if December is a summer month where you live. Match the paper to your table settings. Your table will be more festive if the crackers match the napkins, plates, candles, decorations, etc."
    },
    {
      "title": "Orient your paper landscape style.",
      "content": "Orient your paper landscape style. Start with one of the long edges facing you. If your paper has one side patterned and blank on the other (such as scrapbooking paper or gift wrap), make sure that the blank side faces up."
    },
    {
      "title": "Attach a cracker snap to the top of the paper.",
      "content": "Attach a cracker snap to the top of the paper. This will make your Christmas cracker pop like store bought ones. Place a long strip of double-sided tape at 1 inch (2.5 cm) from the top edge of the paper, . [2] X Research source Press the cracker snap onto the tape. Make sure that it is centered. Both ends of the cracker snap need to be taped down. Many craft and dollar stores/pound shops etc sell cracker snaps during the holiday season. You can also find them available online."
    },
    {
      "title": "Lay a strip of double-sided tape along the top edge of your paper.",
      "content": "Lay a strip of double-sided tape along the top edge of your paper. Make sure that the tape goes from edge-to-edge to seal your Christmas cracker shut. If you added a cracker snap, the tape will be just above it."
    },
    {
      "title": "Use a strip of double sided tape to attach an empty toilet paper tube to the bottom center of your paper.",
      "content": "Use a strip of double sided tape to attach an empty toilet paper tube to the bottom center of your paper. You should have about 4 inch (10.2 cm) on either side of the toilet paper tube. [3] X Research source If you can't find any toilet paper tubes, cut an empty paper towel tube in half. You can also get an empty gift wrap tube, and cut 4 inch (10.2 cm)) segments."
    },
    {
      "title": "Make the cracker body.",
      "content": "Make the cracker body. Roll the toilet paper tube as evenly and as tightly as you can towards the top of the paper to keep the paper smooth. [4] X Research source When you get to the top edge, run your finger along the tape to seal it."
    },
    {
      "title": "Tie one of the end of the Christmas cracker shut.",
      "content": "Tie one of the end of the Christmas cracker shut. Get as close to the toilet paper tube as possible. (See the Tips section) [5] X Research source Do not tie the other end shut yet. You can use anything to tie the cracker shut. Choose something that matches your paper or your theme for pizzaz. For example: For something fancy or elegant, use a piece of satin, sheer, or curling ribbon. For something cozy or rustic looking, use baker's twine, raffia, jute, hemp cord, or yarn."
    },
    {
      "title": "Fill the Christmas cracker with your choice of goodies.",
      "content": "Fill the Christmas cracker with your choice of goodies. Tie it shut with a matching piece of ribbon or string. You do not have to fill your Christmas cracker with everything listed in this section. Instead, use the ideas for inspiration. Choose items that suit your budget, party theme and guest needs."
    },
    {
      "title": "Add a traditional paper crown.",
      "content": "Add a traditional paper crown. One of the most popular items is the paper crown. It is great for both adults and children. Make your own out of gold poster paper or from butcher paper. Here's how you do it: [6] X Research source Measure your head and add 2 inch (5.1 cm). Cut a 2.5 inch (6.4 cm) strip of paper according to that measurement. Cut a zigzag pattern into one of the long edges. Overlap the two narrow ends by 1 inch (2.5 cm) and secure them with a piece of double sided tape. Roll up the crown into a tube, then tie it up with a piece of string. This allows the crown to fit inside your cracker."
    },
    {
      "title": "Add Christmas greetings, facts, and jokes.",
      "content": "Add Christmas greetings, facts, and jokes. You can find lots of Christmas themed facts and jokes online or make up your own. Write or print your greetings, facts, and jokes on little slips of paper. Step it up with decorations of Christmas themed stickers, stamps, or simple illustrations. [7] X Research source Washi tape around the borders can make a nice touch. Here are some examples of messages you can include: A fortune A riddle A blessing or a spiritual message A recipe"
    },
    {
      "title": "Add some small gifts.",
      "content": "Add some small gifts . You can find lots of small items that can fit inside a Christmas cracker in the goodie bag section of a party store. The dollar section of an arts and crafts store also have some suitable items. Many stores have a stocking stuffer section during the holiday season. Browse through these sections and pick out items to stuff your crackers. Here are ideas to get you started: Candies or chocolates Costume jewelry, such as \"pearl\" necklaces and clip-on earrings Mini manicure kits and mini bottles of nail polish Mini stationery items: notepads, pens, novelty erasers, etc. Plastic figurines, toy cars, etc. Small toys: spinning top, dice, hopping frog, etc. Vouchers or gift cards for music, cafes, restaurants, etc."
    },
    {
      "title": "Add an element of surprise with confetti or glitter.",
      "content": "Add an element of surprise with confetti or glitter. Keep in mind that this can get messy. Only do this if you don't mind cleaning up afterwards. To avoid getting bits of paper or glitter into food, open confetti or glitter filled crackers after the meal is over ."
    },
    {
      "title": "Tuck in a few coins or paper bills.",
      "content": "Tuck in a few coins or paper bills. Keep the amounts small and equal in value for your guests. It wouldn't be fair if one guest got a lot of money while another did not. Choose coins that are shiny and clean and paper money that is crisp. Do not add money if you plan on including candy, even if the candy is wrapped."
    },
    {
      "title": "Keep your gifts together by packaging them.",
      "content": "Keep your gifts together by packaging them. This will give your guests something to unwrap as well as preventing a mess. A small, organza bag works well for a fancier Christmas cracker. [8] X Research source Matching tissue paper works for a simpler Christmas cracker. [9] X Research source"
    },
    {
      "title": "Add decorations to your Christmas Cracker.",
      "content": "Add decorations to your Christmas Cracker. Once you have tied your Christmas cracker shut, you are essentially done. You do not have to add \"all\" the decorations listed in this section. Instead, choose the ideas that appeal the most to you."
    },
    {
      "title": "Cut your ribbons ends at an angle for a nice finish.",
      "content": "Cut your ribbons ends at an angle for a nice finish. [10] X Research source Seal the ends with fray check or clear nail polish to prevent fraying. This will give your crackers that final elegant touch and make them look more professional. If you use curling ribbon, consider curling the ends by running them between your finger and the end of a pair of scissors."
    },
    {
      "title": "Add contrast with another strip of paper.",
      "content": "Add contrast with another strip of paper. Cut a strip of contrasting paper 4 inch (10.2 cm) and wrap it around the middle of your Christmas cracker. Seal the edge with a strip of double-sided tape. [11] X Research source"
    },
    {
      "title": "Add a pretty label to the front of your Christmas cracker.",
      "content": "Add a pretty label to the front of your Christmas cracker. This can be as simple as a Christmas sticker with a Christmas greeting. If this is for a party, use a \"To/From\" style label and write the person's name on it. Use this as a place setting for your dinner party in place of the standard nametag."
    },
    {
      "title": "Decorate the ends of the cracker with washi tape or stick on rhinestones.",
      "content": "Decorate the ends of the cracker with washi tape or stick on rhinestones. Get fancy scissors and cut a notched or scalloped edge into the paper."
    },
    {
      "title": "Add mini floral picks to your cracker.",
      "content": "Add mini floral picks to your cracker. Many craft stores sell mini pine branches, holly leaves, and red berries for decorating gifts and wreaths. Even though they are small to begin with, cut them down further so they are proportionate to your Christmas cracker. With hot glue or clear tape, attach them to the body of the cracker or to the ends where the ties are. For blue, white and silver Winter Wonderland themed crackers, add mini sparkly snowflake ornaments."
    },
    {
      "title": "Use stamps to make plain paper crackers look more interesting.",
      "content": "Use stamps to make plain paper crackers look more interesting. An ink pad and a Christmas-themed rubber stamp can add a touch of old time design to a brown butcher paper cracker. It will make the paper more interesting, but keeps it simple enough to not detract from that cozy, rustic feel."
    },
    {
      "title": "Decorate the tube with glitter glue.",
      "content": "Decorate the tube with glitter glue. This works great on construction paper. If you used gift wrap or patterned scrapbook paper, use the original design as a guide. Glitter glue can take time to dry, so do this the night before the party. You can also decorate with puffy paint instead."
    },
    {
      "title": "Set the table with your crackers.",
      "content": "Set the table with your crackers. The cracker is a great way to bring people together. After all, you need two people to pull apart the cracker snap to celebrate the moment!"
    }
  ]
}