{
  "url": "https://www.wikihow.com/Get-an-RSS-Feed-from-a-Website",
  "title": "How to Find the RSS Feed for a Web Page",
  "steps": [
    {
      "title": "Open the website in any web browser.",
      "content": "Open the website in any web browser. This method will work on any website powered by WordPress, which is about 30% of websites on the internet. [1] X Research source"
    },
    {
      "title": "Click or tap at the end of the URL in the address bar.",
      "content": "Click or tap at the end of the URL in the address bar. The cursor should now be on the last character of the URL."
    },
    {
      "title": "Type /feed/ and press ↵ Enter or ⏎ Return.",
      "content": "Type /feed/ and press ↵ Enter or ⏎ Return . Adding this text to the end of the URL will take you to the RSS feed as long as the site uses WordPress. You’ll know you’ve found the feed when you see a white page containing a bunch of raw web code."
    },
    {
      "title": "Open the website in any web browser.",
      "content": "Open the website in any web browser. Many websites (but not all) display an RSS feed icon somewhere on the page."
    },
    {
      "title": "Scroll down until you find the RSS icon.",
      "content": "Scroll down until you find the RSS icon. It’s an orange square with a white dot at the bottom-left corner and two white curved lines above the dot. The icon is usually small."
    },
    {
      "title": "Click the icon (if found).",
      "content": "Click the icon (if found). If this icon appears on the page, clicking or tapping it should bring up a text-only version of the page in raw code. This means the URL of the RSS feed is currently in the browser’s address bar and you can copy and paste it anywhere you’d like."
    },
    {
      "title": "Open the website in Firefox.",
      "content": "Open the website in Firefox. Mozilla Firefox attempts to locate a website’s RSS feed automatically. If an RSS feed for the site is found, a link to the feed will appear near the top-right corner of the browser in the address bar. [2] X Research source"
    },
    {
      "title": "Click the RSS button (if found).",
      "content": "Click the RSS button (if found). Look at the far-right corner of the address bar (where you typed the URL). If you see an orange square with a white dot at the bottom-left corner and two white curved lines above the dot, click it to open the RSS feed. The URL of the feed will then appear in the address bar, ready to be copied."
    },
    {
      "title": "Open the website in your preferred web browser.",
      "content": "Open the website in your preferred web browser. You should be able to find a link to a website’s RSS feed in its raw source code."
    },
    {
      "title": "View the source code of the website.",
      "content": "View the source code of the website. The steps to do this vary by browser. [3] X Research source In Chrome on a computer, right-click the page and select View page source . In Chrome for Android, tap your finger right before the URL in the address bar to insert the cursor before the first character, type view-source: , and then tap Enter or Go . [4] X Research source In Safari for macOS, you’ll have to enable the Develop menu to view source code. Open the Safari menu, click Preferences , click the Advanced tab, and then check the box next to ″Show Develop menu in menu bar.″ Now you can right-click the page and select Show Page Source . On an iPhone or iPad, you’ll need to install an app like HTML Viewer Q or iSource Browser from the App Store. Once installed, open the app and follow the on-screen instructions to find a page’s source code. In Firefox on a computer, right-click the page and select View Page Source . In Edge for Windows, right-click the page and select View Source . If you don’t see this option, click the ⋯ menu at the top-right corner, select Developer Tools , and then close the developer tools box by clicking the X at the top-right corner. This enables the View Source option."
    },
    {
      "title": "Search the code for ″RSS.",
      "content": "Search the code for ″RSS. ″ On a computer, click somewhere in the code and press ⌘ Command + F (Mac) or Control + F (PC), type rss , and then press ↵ Enter or ⏎ Return . This should take you to a line that starts with <link rel and contains the text ″application/rss+xml.″ In Chrome for Android, tap the menu, tap Find in Page , type rss and tap the magnifying glass. [5] X Research source"
    },
    {
      "title": "Find the URL in the line.",
      "content": "Find the URL in the line. The URL of the site’s RSS feed is the address that appears after ″href=″ in the line. Copy that URL and paste it into the desired location."
    },
    {
      "title": "Go to http://createfeed.fivefilters.org/ in a web browser.",
      "content": "Go to http://createfeed.fivefilters.org/ in a web browser. If you can’t find a site’s RSS feed (or if a site doesn’t have one), you can create one for the site at no cost using this tool."
    },
    {
      "title": "Enter the URL of the site.",
      "content": "Enter the URL of the site. Type or paste the URL into the ″Enter page URL″ field near the top of the form."
    },
    {
      "title": "Click or tap Preview.",
      "content": "Click or tap Preview . It’s the green button near the bottom of the form."
    },
    {
      "title": "Scroll down and select RSS Feed.",
      "content": "Scroll down and select RSS Feed . It’s the first gray button beneath the site’s title under the ″Results″ header. This opens the RSS feed in your web browser—it looks like raw website code. The URL for the RSS feed is now located in the address bar at the top of the browser, ready to be copied."
    }
  ]
}