{
  "url": "https://www.wikihow.com/Get-over-Marijuana-Withdrawal-Symptoms",
  "title": "How to Get over Marijuana Withdrawal Symptoms",
  "steps": [
    {
      "title": "Withdraw slowly.",
      "content": "Withdraw slowly. One action that may help you with withdrawal symptoms is to gradually reduce your consumption rather than going cold turkey. In some cases, that may help reduce the number of withdrawal symptoms you have, as well as the severity of those symptoms. Discuss with your doctor the best method for getting off of marijuana slowly. You could try reducing intake over a week or two, or for especially heavy usage, over the course of a month."
    },
    {
      "title": "Use exercise for stress relief and to distract you from temptation.",
      "content": "Use exercise for stress relief and to distract you from temptation. Exercise is a great way to deal with any anxiety you may be feeling. It can also help with depression. In addition, it can distract you from the temptation of wanting to get back on marijuana. Try exercising a bit each day to help get out some of your anxiety. You could walk, jog, go to the gym, swim, or ride a bike. You could also invite friends for pickup games of basketball or soccer."
    },
    {
      "title": "Try meditation.",
      "content": "Try meditation. If you're feeling depressed, anxious, or restless, meditation or deep breathing can help you deal with those feelings. Meditation helps you focus on your body and bring you back into the moment, rather than getting lost in your thoughts. For a simple meditation, try deep breathing. When you feel yourself getting anxious or stressed, take a moment to close your eyes. Breathe in slowly through your nose to the count of four. Hold your breath for four counts, and then breathe out slowly to the count of four. Repeat the exercise until you feel some of your stress leave."
    },
    {
      "title": "Ask about an antidepressant.",
      "content": "Ask about an antidepressant. As noted, depression is one of the most common forms of withdrawal symptoms. To help deal with that, you may need a medicinal boost for a few months. An antidepressant may help perk you up and make the withdrawal symptom have less effect on you. [1] X Research source Be honest with your doctor about why you want the antidepressant. Your doctor needs to know that you may still have marijuana in your system. Don't worry; privacy laws protect you from prosecution even if you live in a state where marijuana use is still illegal. The one exception to this rule is that if your doctor thinks you may be participating in abuse or neglect in connection with your marijuana use, they may report it to the police."
    },
    {
      "title": "Consider a sleep aid.",
      "content": "Consider a sleep aid. If you are having consistent problems with sleeping, then a sleep aid may be appropriate. An over-the-counter aid may be sufficient, but talk to your doctor about what the best option is for you. Your doctor may be willing to give you a prescription sleep aid you can take just for the first week or so of withdrawal."
    },
    {
      "title": "Deflect irritability.",
      "content": "Deflect irritability. You're likely to feel more irritable than normal when withdrawing from marijuana. That can cause you to snap at people if you're not careful. Pay attention to your emotions, and when you start getting angry or irritable, take steps to change the situation. [2] X Research source For instance, you could take several deep breaths or count to ten to calm down. You could also walk away from the situation. Tell the person you need a few minutes to calm down. Discuss what's going on with your friends and family so that they know why you may be angrier. Apologize when you make a mistake. You're bound to snap at someone, and when you do, be sure to apologize."
    },
    {
      "title": "Find ways to relax.",
      "content": "Find ways to relax. When stress and anxiety start to overwhelm you, take time to do something you enjoy that relaxes you (not smoking marijuana, of course!). Taking time out just for yourself can help relieve these symptoms and make you feel better overall. For instance, take a relaxing, hot bath with candles. [3] X Research source You could also read a novel or spend some time baking or gardening."
    },
    {
      "title": "Try over-the-counter pain medications.",
      "content": "Try over-the-counter pain medications. Acetaminophen/paracetamol (Tylenol) or NSAIDS like ibuprofen and naproxen sodium (Advil, Motrin, Aleve) can help with some of the withdrawal symptoms of marijuana. For instance, they can help with any pain or headaches you may experience, as well as the sweating and fever. Make sure to follow the recommended schedule for taking acetaminophen, as taking too much can cause liver damage."
    },
    {
      "title": "Use nausea medications.",
      "content": "Use nausea medications. Some people experience nausea while withdrawing. If you are having that problem, you can start by trying over-the-counter stomach medications, such as calcium carbonate (Tums) or bismuth subsalicylate (Pepto-Bismol). If those medications don't work for you, you may need to have prescription medications. If so, talk to your doctor. [4] X Research source"
    },
    {
      "title": "Decrease food smells.",
      "content": "Decrease food smells. Nausea can often be worsened by food smells. One way you can work on this problem is to ask someone else to cook for you. If that's not feasible, try sticking to foods you can eat cold for a while, as they won't smell as much. [5] X Research source"
    },
    {
      "title": "Take an antihistamine.",
      "content": "Take an antihistamine. If you're having issues with congestion, an antihistamine may be able to help with that issue. Many antihistamines are available over-the-counter, and you can take any one that you find beneficial. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Antihistamines come in traditional formulas that can make you drowsy (such as diphenhydramine) and non-drowsy formulas, such as loratadine (Claritin), fexofenadine (Allegra), and cetirizine (Zyrtec)."
    },
    {
      "title": "Hydrate well.",
      "content": "Hydrate well. The sweating can cause you to lose more water than you normally do, making you dehydrated. Dehydration can make the muscle spasms and aches worse, so make sure you are drinking plenty of clear fluids while you are in withdrawal. [7] X Research source It's also a good idea to skip caffeine. Caffeine can dehydrate you."
    },
    {
      "title": "Discuss a medically supervised detox.",
      "content": "Discuss a medically supervised detox. If you have used heavily for extended periods of time, it may be helpful to go through a rehab program that supervises your withdrawal from the drug. Doing so can help make the transition easier. If you are a light user, it may not be necessary, but talk to a doctor about your options. [8] X Research source This option can be especially helpful if you have any mental disorders that may compound your withdrawal symptoms. It can also help if you live in a place where drugs are readily available or if you've tried to quit before several times and failed."
    },
    {
      "title": "Talk about oral synthetic THC.",
      "content": "Talk about oral synthetic THC. In some cases, taking doses of oral synthetic THC can help withdrawal symptoms. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Essentially, it provides a controlled way to wean yourself slowly off of the drug, and it is sometimes used in rehab programs. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Synthetic THC (Marinol) is produced in a lab. THC is one of the active chemicals in marijuana. Synthetic THC is available in pill form, and you'll need a prescription. Not all doctors are willing to prescribe this medication for people who have used marijuana heavily. However, because it is a pill, it's easier to control the dosage."
    },
    {
      "title": "Discuss a long withdrawal period.",
      "content": "Discuss a long withdrawal period. While much of the marijuana will clear out of your system relatively quickly, it can take a while (months) to clear it all out. You'll need to be ready to deal with this period by treating symptoms as they come up. [11] X Research source However, the majority of your withdrawal symptoms should dissipate after two weeks, so if they haven't, talk to your doctor again. [12] X Research source It can help to join a support group, as other people will be going through the same things you are. They can help you get through the withdrawal period. Talk to a therapist that specializes in substance use if you're able to since they'll be able to give you effective strategies to overcome your symptoms. Marijuana has a long withdrawal period because the drug is stored in fat cells, making it more difficult to clear out than drugs that are water-soluble."
    }
  ]
}