{
  "url": "https://www.wikihow.com/Know-You-Smell-when-You-Can%27t-Smell-Yourself",
  "title": "How to Know You Smell when You Can't Smell Yourself",
  "steps": [
    {
      "title": "Smell your clothes after removing them.",
      "content": "Smell your clothes after removing them. Take a break first. Go take a shower, watch TV, read a book for a while. Then, collect the clothes and give them the sniff test, especially around the pit area and anywhere you sweat profusely. If you find an odor that is unpleasant, that might be an indicator that you have a body odor problem that is leaching into your clothing. Our own odor can be augmented by the materials we wear, with un-breathable synthetics being at the top of the list for enhancing bad odors. Stinky clothing always means that the clothes need a wash immediately! [2] X Research source"
    },
    {
      "title": "Consider your diet.",
      "content": "Consider your diet. You might enjoy heaps of garlic, curry, onions, beer, spices, etc., but the residual odor can be very unpleasant to some people. If you think this might be a problem, make sure everyone you're hanging around with at the time shares your meal choices, and you'll all find it harder to smell one another's unpleasant odors! [3] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Temporary relief can be found in chewing parsley, mint candies, or swishing mouthwash."
    },
    {
      "title": "Hold your hand against your mouth and puff out some breath.",
      "content": "Hold your hand against your mouth and puff out some breath. If the result is stinky when you smell your hand and the air rising back up as a result of being stopped by the hand, it's time to clean your teeth and tongue a lot more thoroughly. Brush your teeth, floss your teeth, rinse with mouthwash, and brush your tongue. [4] X Research source Another method is to lick your wrist. Wait ten seconds before sniffing your wrist. The odor that rises into your nose is the smell of your breath."
    },
    {
      "title": "Check the parts of your body that moisture loves.",
      "content": "Check the parts of your body that moisture loves. Anywhere there is a potential for skin folds (between toes, under the arms, under breasts, etc.) can be a source of odor if bacteria gets the opportunity to thrive. Don't try smelling any of these regions; that will just confirm you're not thinking straight. The answer to avoiding this source of musty odor is to always dry skin fold areas thoroughly. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "If you're sweating profusely, there is a fair chance that you don't smell wonderful.",
      "content": "If you're sweating profusely, there is a fair chance that you don't smell wonderful. If it's post-sport, don't worry – everyone expects that sporty sweat smell. Less so if it's caused by the stress of your job, a presentation, an exam, etc. Use antiperspirant and/or deodorant and avoid foods that encourage sweating, such as chilies. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Dress appropriately for the occasion. Do not wear too much perfume. It can be overpowering. Some people are allergic to it. Reader Poll: We asked 331 wikiHow readers if they use deodorant, and 79% of them said yes. [Take Poll]"
    },
    {
      "title": "Ask someone whom you trust.",
      "content": "Ask someone whom you trust. Find a friend or a family member to give you an honest appraisal of your odor. Tell them that you're worried that you might be a little malodorous and see what they have to say. Don't forget to reassure them that you want the truth and won't hold their comments/assessment against them – and mean it too!"
    }
  ]
}