{
  "url": "https://www.wikihow.com/Inject-Ovidrel",
  "title": "How to Inject Ovidrel",
  "steps": [
    {
      "title": "Get a prescription from a fertility specialist.",
      "content": "Get a prescription from a fertility specialist. If you think you need a prescription for Ovidrel, make sure you discuss this with a fertility specialist first. They may need to run some tests to confirm that this is a necessary next step for your path to conception. With the supervision of your fertility specialist and a proper prescription, you can begin your Ovidrel treatments."
    },
    {
      "title": "Get training from your doctor about how to perform the injection.",
      "content": "Get training from your doctor about how to perform the injection. Your doctor will give you explicit instructions on how to give yourself the injection. This training will prepare you and your partner for handling the injections at home. If possible, your doctor will give you the first injection and demonstrate the procedure for you. If possible, your partner should also be present for training so that they can help you if you have trouble giving yourself the injection."
    },
    {
      "title": "Ask for help if you need it.",
      "content": "Ask for help if you need it. If you are uncomfortable about injecting yourself with the Ovidrel shot, it is possible to get the shot administered at your doctor’s office. You will likely have to pay for any fees associated with a visit to the doctor’s office. But this may be a better option for you if you feel unable to do the injection yourself. [2] X Research source Keep in mind that it is quite safe to do these injections at home, so you may want to try pushing through your uncertainty and doing it yourself anyways. The first time is always the hardest, and it only gets easier each time. Your partner may also be able to administer the Ovidrel shot, if they have been properly trained by the doctor."
    },
    {
      "title": "Prepare yourself emotionally.",
      "content": "Prepare yourself emotionally. Difficulty conceiving can be a very emotional and trying time for a person. Remember that you are not alone. Lean on your partner, your family, and your friends during this difficult time for support. Giving yourself injections can sometimes add to this emotional stress, so try to take precautions to maintain your mental health during the process. [3] X Research source This includes seeking professional help from a counselor or therapist, if you feel like that might be beneficial to you. Additionally, remember that Ovidrel can cause mood swings. So there is a possibility the injections will make you feel even more emotional. Keep your expectations realistic. Ovidrel may not work immediately, it can take several months of injections and getting the rhythm right to conceive."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Remember to always wash your hands thoroughly before you begin the injection process. This will help decrease the risk of infection, especially at the injection site. Use an antibacterial hand-sanitizing soap and a clean, disposable paper towel to dry your hands."
    },
    {
      "title": "Unwrap the syringe.",
      "content": "Unwrap the syringe. Take the syringe with the Ovidrel injection out of the box it came in. You’ll need to unwrap the packaging and remove the cap from the needle end of the syringe. Make sure the syringe is in the original sealed package. It is dangerous to use needles that are not sterilized or that have been used by others. Make sure to check the expiration date on the box as well to ensure that the medication has not expired. Read the writing on the syringe to be sure it is the correct medication and dosage."
    },
    {
      "title": "Remove the air bubble.",
      "content": "Remove the air bubble. Once you unwrap the syringe, you’ll see a small air bubble on top of the liquid inside; this needs to be removed. You may need to gently tap the syringe until the air bubbles settle at the top. Hold the syringe with the needle pointing up and push the plunger slowly and gently until the air bubble is completely gone. Be careful not to push too quickly or you may waste quite a bit of the liquid medication inside. You want to only expel one tiny drop that covers the tip of the needle."
    },
    {
      "title": "Follow the instructions given to you by the doctor.",
      "content": "Follow the instructions given to you by the doctor. Make sure that you follow any directions your doctor or fertility specialist gave you about administering the Ovidrel injection. [4] X Research source You should also discuss your overall health and any preexisting conditions you may have with your doctor before administering the Ovidrel treatment."
    },
    {
      "title": "Choose the injection site and clean it with alcohol.",
      "content": "Choose the injection site and clean it with alcohol. Decide which site you are going to use to inject the medication. You can use any area that has some fat underneath the skin, such as the area of your stomach near your belly button, the back area of your upper arm, or the outside of your thigh. If you decide to inject in the stomach area, then pick a spot that is about 2 in (5.1 cm) away from your belly button – on either side or below it. Sterilize the area with an alcohol swab and let it air dry. Drying the injection site (or wiping off any excess alcohol) with a towel will re-contaminate the area and negate the sterilizing process you just completed."
    },
    {
      "title": "Inject the needle into your skin.",
      "content": "Inject the needle into your skin. Sit or stand in a comfortable location and pinch an inch or so of your skin/fat in the now sterilized area. Stick the tip of the needle into your skin and slowly push down on the plunger until the entire dose is emptied out of the syringe. [5] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source Make sure you stick the needle far enough into your skin (about 1 ⁄ 4 in (0.64 cm) or so). Gently remove the needle and use a Band-Aid (or gauze) if your skin is bleeding at the injection site."
    },
    {
      "title": "Dispose of the syringe safely.",
      "content": "Dispose of the syringe safely. Once you’ve finished injecting the Ovidrel, you need to dispose of the syringe in a safe manner. Put the cap and the syringe in a waste bin intended for hazardous/sharp objects. You could use an empty milk jug and tape the lid on after adding the syringe. [6] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Your doctor should be able to provide you with a small canister that is intended for disposal of sharp objects. You can store the used syringes in this container until you finish the treatment cycle, then seal the container and put it in the appropriate trash bin. This will protect others from accidentally getting poked by the needle."
    },
    {
      "title": "Contact your doctor if you forget your injection.",
      "content": "Contact your doctor if you forget your injection. Ovidrel is intended for use on specific days in your menstrual cycle. If you forget a dosage, it’s important that you contact your doctor and follow their advice. [7] X Research source Do not try to administer the injection when you remember it without discussing with your doctor first."
    },
    {
      "title": "Monitor your symptoms.",
      "content": "Monitor your symptoms. After injecting the Ovidrel, make sure you monitor your symptoms to ensure that you don’t have a bad reaction to the drug. Reactions are rare, but you want to be able to notify your doctor immediately if you notice anything out of the ordinary. [8] X Research source Normal side effects include slight discomfort, swelling, or bruising at the injection site; mild nausea; or digestive issues. If you have any of the following symptoms, then contact emergency services or go to an emergency room immediately: extreme abdominal pain, intense nausea and vomiting, shortness of breath, dizziness, or decreased urination."
    }
  ]
}