{
  "url": "https://www.wikihow.com/Make-ID-Cards-Online",
  "title": "How to Make ID Cards Online",
  "steps": [
    {
      "title": "Plan your card.",
      "content": "Plan your card. Think about the purpose of the card, how many cards you will need, and what kind of design you want to use. Planning before you begin creating and ordering your ID card(s) will make the process easier and ensure that you get exactly the kind of card you need. Consider, for instance: How will the card(s) be used? For instance, to permit access to a building or site? To differentiate an employee or group member from non-employees/group members? To prove someone’s identity? If the card(s) will be used to prove identity, what security features will be used? A photograph? Bar code? Magnetic stripe? The right feature depends upon the capabilities you or your company/organization has. How many cards do you need? Just one for yourself? One for each member of a group, organization, or company? Does each person need an individualized card, or is a standardized card for each group member sufficient?"
    },
    {
      "title": "Visit an ID creator website.",
      "content": "Visit an ID creator website. There are numerous online ID creation services to choose from. [1] X Research source If you are not already familiar with one or more, a quick online search should produce several. You can also ask for a colleague to recommend a service to you. In any case, choose a service that is reliable, cost-efficient, and that can deliver the options you need."
    },
    {
      "title": "Decide if you want to use a template.",
      "content": "Decide if you want to use a template. [2] X Research source Typically, online ID manufacturers will offer you the option of using a template for your card. Templates can save you time and effort by pre-selecting the design for you. Usually, if you use a template you will just need to click on the areas you want to adjust (such as text or a picture). If you design an ID card from scratch, you will have to decide where to position all of the information."
    },
    {
      "title": "Contact the ID printing service about creating a custom design.",
      "content": "Contact the ID printing service about creating a custom design. If you don’t see a template that looks right for your needs, and you don’t want to or don’t have time to design one yourself, you can ask the ID printing service to create a custom design for you. Some services will announce this as an option when you begin the card design process. Custom design services will probably entail a higher fee."
    },
    {
      "title": "Choose options.",
      "content": "Choose options. [3] X Research source [4] X Research source Options may be available for both the front and back of the ID card. There may be an additional fee for options. Examples of options you may choose include: Orientation (portrait / vertical or landscape / horizontal) Text font Text to appear on the card (name, organization, etc.) Background color or image Lamination Holograph Material to print the card on (paper, plastic, etc.) Punching a hole in the card Including a bar code"
    },
    {
      "title": "Decide what picture you want to include on the ID card, if any.",
      "content": "Decide what picture you want to include on the ID card, if any. [5] X Research source Usually, you can include a picture on your card. You will need to have a photo file stored on your computer or accessible to you online. In most cases, online ID creators allow you to simply click on an area of the card you are designing and insert the photo file you want to use. Most services also give you the option of editing the image (for instance, resizing or cropping it)."
    },
    {
      "title": "Determine if you want to use a magnetic stripe or bar code.",
      "content": "Determine if you want to use a magnetic stripe or bar code. [6] X Research source Including a magnetic stripe or bar code on the front or back of an ID card is a great way to store information such as a personal identification number or door access code. You can enter in the appropriate information for this use, and the ID creator will encode it in the magnetic stripe."
    },
    {
      "title": "Choose any accessories.",
      "content": "Choose any accessories. [7] X Research source Along with your ID card, you may want to order a lanyard, clip, or badge holder to protect and carry the card. You will be given the option to choose these accessories; usually, there is an additional fee for them."
    },
    {
      "title": "Decide how many copies you want.",
      "content": "Decide how many copies you want. If you are printing an ID just for yourself, you may only want one copy (or you may want to order a backup). If you are ordering IDs for others, such as key cards for your employees, you will want to order enough copies for all of them. If you are ordering cards for multiple people, decide if you want to use a standard group card, or if you want to include personal details on each person’s card (such as the person’s name, picture, or employee number). Many online ID manufacturers will offer discounts for ordering multiple cards. [8] X Research source"
    },
    {
      "title": "Select shipping options.",
      "content": "Select shipping options. You may be able to choose between standard or expedited shipping, as well as add-ons like tracking. [9] X Research source Typically, there is a fee for choosing such shipping options. Some ID manufacturers may provide incentives, such as free shipping for orders over a certain amount. Make sure to enter the correct address that you want the ID card(s) shipped to. Take note of the estimated shipping date or tracking number so that you will know when to expect your ID card(s) to arrive."
    },
    {
      "title": "Enter your payment information.",
      "content": "Enter your payment information. Once you have completed the ID card design process, chosen any accessories you want, and entered your shipping information, you are ready to pay for the card order. The online service will prompt you to enter information such as a credit card or bank account number to charge for the cost of the order."
    },
    {
      "title": "Review your card and order.",
      "content": "Review your card and order. [10] X Research source Before completing your order, you should be able to review your order and make sure everything looks good. Make sure that your card looks the way you want it to, and that you have ordered enough copies."
    }
  ]
}