{
  "url": "https://www.wikihow.com/Make-a-Mosaic-Table-Top",
  "title": "How to Make a Mosaic Table Top",
  "steps": [
    {
      "title": "Lay a large piece of butcher paper over the tabletop.",
      "content": "Lay a large piece of butcher paper over the tabletop. Secure the paper around the table's edges with tape. If your paper is not wide enough, tape two pieces together so that it can fit over the entire table."
    },
    {
      "title": "Cut the piece of paper in the shape of the table.",
      "content": "Cut the piece of paper in the shape of the table. Use scissors to cut around the edge of the table. The tape should hold the paper in place as you cut. Once you're done, remove the remaining tape and butcher paper from the tabletop. It should be the same dimensions as your tabletop."
    },
    {
      "title": "Smash your tiles into different shapes.",
      "content": "Smash your tiles into different shapes. If you want a more artistic look, you can create different shaped tiles yourself. Place your tiles flat on the floor and cover them with a towel. Then use a hammer and smash the tiles into different pieces carefully. When you lift up the towel, the tiles should be in different shapes and sizes. [1] X Research source You can also just purchase smaller tiles from the store. Consider using premade ceramic tiles, glass tiles, glass gems, or a mirror to cover your table top."
    },
    {
      "title": "Arrange your tiles on top of the butcher paper.",
      "content": "Arrange your tiles on top of the butcher paper. Lay the paper out on a different flat surface, like the floor. Collect the tiles that you plan on using for your mosaic and lay them out on the paper. This will help you visualize what they will look like before you commit them to your table. It will also help you keep your tiles organized as you continue to construct your mosaic. [2] X Research source If you are using uniform sized pieces for your mosaic, remember to leave gaps in between the tiles so that grout can fit in between them. Experiment with creating unique designs. If you don't like how your design looks, you can rearrange the tiles on the paper before you start constructing your table."
    },
    {
      "title": "Sand the table top.",
      "content": "Sand the table top. If the table top is made of wood, you'll want to make sure that you have a smooth surface to place your mosaic tiles. Use a hand or belt sander to sand down any rough edges or bulges in the wood. If your table top is made of another material like granite or metal, you can skip this step. Use 150-grit on coarse-grain woods like oak or walnut and 180-grit on fine-grain woods like cherry or maple."
    },
    {
      "title": "Dust the table.",
      "content": "Dust the table. Use a duster or a dry cloth to run over the surface of the table and remove any dust that you created from sanding. Make sure to go over the surface of the table with your hand to make sure that there aren't any places that you missed with the sander. If there are places that you missed with the sander, go back and resand the area."
    },
    {
      "title": "Wash and dry the table.",
      "content": "Wash and dry the table. Use a damp cloth and a traditional mild dish soap and go over the surface of your table. Once the table top is clean, you can start creating your mosaic."
    },
    {
      "title": "Paint the surface of your table.",
      "content": "Paint the surface of your table. Use a roller or a brush to apply a coating of paint over the surface of the table. You can purchase a latex semi-gloss paint made specifically for furniture at a paint or hardware store. The first coat of your paint will most likely not be dark enough, so you may have to apply multiple coats. Once you've painted the table, allow it to dry overnight. [3] X Research source Painting the table is important if you plan on using translucent tiles or stones and don't want the table's natural color to come through the mosaic."
    },
    {
      "title": "Seal the surface of the table.",
      "content": "Seal the surface of the table. Be sure to mix the sealer well before using it. Apply a coat of oil or water-based polyurethane sealer with a clean brush. Remember to read the instructions when using a sealer or stain. The sealer will prevent water damage. Seal your table in a well-ventilated area."
    },
    {
      "title": "Glue the tiles to the surface of the table.",
      "content": "Glue the tiles to the surface of the table. Using the tiles from the butcher paper, dab one side of the tiles that you plan on using and press it hard into the surface of the table. Work from the outside in when gluing down your design. Once you're done gluing down the tiles, allow the tiles to set overnight. [4] X Research source If you decide that you want to change the design of the mosaic, make sure that you move the tiles around before the glue fully dries. The best glue to use for ceramic or glass tiles are mortar, mastic, or tile adhesive. You can purchase these at most home improvement stores. [5] X Research source"
    },
    {
      "title": "Mix grout",
      "content": "Mix grout according to the instructions. Combine the grout powder with water in a bucket and use a trowel to mix the grout until it forms a thick consistency. Make sure to read the instructions on the grout to get the exact measurement of water that you need. Make sure there aren't any lumps in your grout before using it."
    },
    {
      "title": "Smear the grout over the tiles and in between the cracks.",
      "content": "Smear the grout over the tiles and in between the cracks. The goal is to get the grout to go in between your tiles. This will add to the look of your mosaic table, make it flatter, and will help keep the tiles onto the table. Use the trowel and work the grout over the tiles. This will force some of the grout in between your tiles. [6] X Research source"
    },
    {
      "title": "Scrape the excess grout with a plastic card.",
      "content": "Scrape the excess grout with a plastic card. Use a plastic card and run it over the surface of your tiles. Some grout will be left over after the scraping, but try to get as much of it as you can with the card. [7] X Research source"
    },
    {
      "title": "Let the grout dry and wash off your table.",
      "content": "Let the grout dry and wash off your table. Let the grout set for at least 24-hours before cleaning it. Once it's dry, go over the surface of the tiles with dish soap and warm water. If the grout is not coming off, use a sponge to help scrub it. Once your mosaic table top looks shiny, wipe it down and dry it with a clean rag."
    },
    {
      "title": "Spray sealer to seal the grout.",
      "content": "Spray sealer to seal the grout. Purchase a penetrating sealer that works with whatever material you used for your mosaic. Spray the sealer over the surface of the table and make sure to wipe down the tiles with a damp cloth to prevent a film from forming on the tiles themselves. Once the grout is saturated with the sealer, allow it to dry. Once the grout is dry, wash down your table one more time before using it. [8] X Research source If the table is going outdoors or you'll be having meals at it, it's important to seal the grout to prevent mildew and stop the grout from getting soft when it comes into contact with water."
    }
  ]
}