{
  "url": "https://www.wikihow.com/Level-Your-Refrigerator",
  "title": "How to Level a Refrigerator (With Leveling Feet or Rollers)",
  "steps": [
    {
      "title": "Remove the grille from the bottom of the refrigerator.",
      "content": "Remove the grille from the bottom of the refrigerator. Loosen the screws holding the grille in place with a screwdriver and then pull the plate off straight toward you. If you can't find any screws, the grille is most likely held in place by clips. Pry those out of place and then pull the grille free. [1] X Research source Consult your owner’s manual when you’re unsure how to remove the grille."
    },
    {
      "title": "Set a level on top of the fridge and adjust the feet until the level is centered.",
      "content": "Set a level on top of the fridge and adjust the feet until the level is centered. Leveling legs can be adjusted with a wrench or, in some cases, simply by turning them clockwise with your hand to raise them or counterclockwise to lower them. Rollers are adjusted by turning a bolt with a socket wrench. After every adjustment, check the level. When the bubble in the level is centered, that means the fridge is level from side to side. [2] X Research source To adjust leveling legs : Ask a helper to push against the refrigerator doors to shift the weight to the back feet (this is the safest way to tilt a fridge). [3] X Research source If that's not possible, slide a piece of cardboard near the leg you plan to adjust first. Next, set the bottom of a prybar onto the cardboard, hook it underneath the bottom of the fridge, and then tilt the fridge upward slightly. [4] X Research source Either method will allow you to easily twist the leveling leg with your fingers or use an adjustable wrench to twist the leveling screw on both front legs until they reach the desired height. To adjust rollers : Ask someone to push against the fridge doors to shift the fridge's weight to the back feet. If you're working alone, leverage a prybar under the fridge to tilt it slightly upward. Next, twist the bolt next to each front roller using a socket wrench until the rollers are lowered or raised to the proper height according to your level. [5] X Research source"
    },
    {
      "title": "Raise the front legs so the fridge is tilted front to back.",
      "content": "Raise the front legs so the fridge is tilted front to back. Your fridge's front legs should sit at least 1 ⁄ 4 in (0.64 cm) higher than the back legs to provide a tilt for coolant to flow properly and for your doors to shut by themselves. To check the tilt, set a level on the bottom of the fridge beneath the opening. If the level isn't centered, adjust each front foot until the bubble is exactly in the middle of the level. Lastly, reinstall the grille. [6] X Research source On a fridge that's been properly leveled, you'll notice a slight incline running from the front of the top of the fridge to the back. Furthermore, when you look at the front of the fridge, the top will be level, not higher on one side. Finally, your doors will shut by themselves when left open."
    },
    {
      "title": "Adjust the alignment screws on the refrigerator doors to raise or lower them.",
      "content": "Adjust the alignment screws on the refrigerator doors to raise or lower them. The alignment screws are located at the bottom hinges of each door (you may need to open the doors and remove the front grille to access them depending on your refrigerator model). Twist the screw clockwise with an adjustable wrench to raise the door or counterclockwise to lower it. [7] X Research source You'll know your refrigerator doors are properly aligned when there's no more than ¼ in height difference between them when the refrigerator is empty. [8] X Research source Another sign of alignment is when your doors seal properly. After adjusting the doors, open and close them multiple times to ensure they close fully. If they don't, you may need to raise or lower one or both doors more until the seals no longer misalign. [9] X Research source"
    },
    {
      "title": "How do you level a refrigerator on an uneven floor?",
      "content": "How do you level a refrigerator on an uneven floor? Expert appliance technician Aaron Beth recommends placing a piece of thin plywood underneath one or more of your refrigerator legs (or wherever needed) to help it sit level on an uneven floor. [10] X Expert Source Aaron Beth Refrigerator Technician Expert Interview. 14 July 2022."
    },
    {
      "title": "Does a refrigerator have to sit perfectly level?",
      "content": "Does a refrigerator have to sit perfectly level? It's important for your fridge to sit as close to level as possible to ensure the coolant circulates and the doors shut properly. With that in mind, aim to make the front feet at least 1 ⁄ 4 in (0.64 cm) higher than the back feet."
    },
    {
      "title": "How do you adjust the back feet on a refrigerator?",
      "content": "How do you adjust the back feet on a refrigerator? In most refrigerators, only the front feet are adjustable. If your fridge model's back feet are adjustable, move the fridge out and open the back panel on the bottom. Then use an adjustable wrench to raise or lower leveling legs or a socket wrench for rollers. [11] X Research source"
    }
  ]
}