{
  "url": "https://www.wikihow.com/Line-a-Dress",
  "title": "How to Sew a Lining Into a Dress",
  "steps": [
    {
      "title": "Purchase a smooth-surfaced cotton blend for your lining.",
      "content": "Purchase a smooth-surfaced cotton blend for your lining. Popular lining options include smooth-surfaced cotton blends such as Viole, Habutai, crepe, thin satins, and Georgette. As a general rule, lining fabrics should be smooth, lightweight, and very flexible. If the dress fabric is sheer, match the lining color to your skin tone or the dress. If the fabric is opaque, you don’t have to worry about the lining color. [1] X Research source Do not use Negative Weight fabrics, heavy fabrics, taffeta, crinoline, or tulle as a lining. Negative weight fabrics will alter the form, and heavy fabrics will restrict movement and add bulk and weight."
    },
    {
      "title": "Buy the same amount of lining it took to make the dress.",
      "content": "Buy the same amount of lining it took to make the dress. You don’t need to include any pieces that don’t touch your body, like the facings, collars, cuffs, or waistbands. If you have the dress pattern, you can work directly from that. Otherwise, measure the bodice, skirt, and sleeves, and add the totals together to get enough lining fabric. Buy a little bit extra just in case you need more as you cut the pattern. [2] X Research source You can find lining fabric at most fabric supply stores. If you're lining a dress to add structure, you might end up cutting your lining with a different shape from the top layer, as you might need to include interfacing or boning. [3] X Expert Source Kpoene Kofi-Bruce Couture Bridal Designer Expert Interview. 28 January 2021."
    },
    {
      "title": "Remove 1⁄8 in (0.32 cm) from the dress pattern for the lining.",
      "content": "Remove 1 ⁄ 8 in (0.32 cm) from the dress pattern for the lining. Trace the lining from the original pattern used to construct the main dress, but adjust the edges by taking away 1 ⁄ 8 inch (0.32 cm). This will ensure that the lining doesn’t hang below the hem of the dress in any areas. [4] X Research source Transfer any pattern markings, but don’t include any extra material for kick pleats. When working without a pattern, trace the lining from the actual bodice, skirt, and sleeves. Add a 1 ⁄ 8 in (0.32 cm) seam allowance to the neckline, shoulders, zipper opening, and armholes (sleeveless dress only)."
    },
    {
      "title": "Cut out the lining pieces with sharp scissors.",
      "content": "Cut out the lining pieces with sharp scissors. After tracing the lining pieces onto the material, use sewing shears or scissors to carefully cut out each one. Check the lining against the original dress to make sure the hems match up without hanging beneath the hem. [5] X Research source"
    },
    {
      "title": "Complete most of the main dress except for the neck and shoulders.",
      "content": "Complete most of the main dress except for the neck and shoulders. Before lining the dress, you should follow the original pattern instructions to complete everything except for the outer edges. Leave the edges at the neck and shoulders raw, but finish the bottom hem. For sleeveless dresses, leave the armholes raw, too. [6] X Research source"
    },
    {
      "title": "Assemble the lining by sewing it together like the dress.",
      "content": "Assemble the lining by sewing it together like the dress. Follow the pattern instructions to stitch together the pieces of the lining as though making a separate dress. If you made your unfinished dress on your own, you’ll follow the same steps that you did earlier. [7] X Research source Every pattern is a little bit different, but this will most likely include sewing the torso and skirt together and then combining them with the sleeves, if your dress has any. Any edge left unfinished on the original dress (neck, shoulders, and armhole) should remain raw on the lining, as well. Leave the zipper opening unfinished, too. If the dress has any kick pleat or slit, you should also leave those edges unfinished."
    },
    {
      "title": "Pin the lining pieces to the dress.",
      "content": "Pin the lining pieces to the dress. Turn your dress inside out and pull the lining on top of it. Use sewing pins to attach the lining to the edges of the dress so that it stays in place. [8] X Research source The zipper opening of the lining should match the zipper opening of the dress, if it has one. Pin the lining around the zipper to keep it in place."
    },
    {
      "title": "Stitch along the neckline, armholes, and shoulders.",
      "content": "Stitch along the neckline, armholes, and shoulders. Machine sew the lining to the main dress at the neckline and shoulders using a standard straight stitch. Follow the seam allowance indicated by the original pattern, but keep in mind that the seam allowance of the lining will be 1/8 inch (3 mm) shorter than that of the main fabric. Then, use a straight stitch again on the armholes of the dress. [9] X Research source Sewing the shoulders and neck first creates an anchor for your lining to attach to so that you can work with the rest of the dress. [10] X Expert Source Kpoene Kofi-Bruce Couture Bridal Designer Expert Interview. 28 January 2021. For sleeveless dresses, you'll need to follow the seam allowance according to the instructions of the original pattern. For dresses with sleeves, stitch the lining to the dress directly over the matched seams. Pull the sleeve lining through the sleeves and let it hang loosely."
    },
    {
      "title": "Attach the lining at the waist by using a straight stitch.",
      "content": "Attach the lining at the waist by using a straight stitch. If the dress has separate bodice and skirt pieces, you should stitch the lining to the main fabric around the hemline. Align the lining and main fabric so that the waist lines match. Stitch directly over the existing seams, stopping 1 in (2.5 cm) before the zipper opening on either side. [11] X Research source"
    },
    {
      "title": "Stitch along the zipper opening with a zipper foot.",
      "content": "Stitch along the zipper opening with a zipper foot. Change the foot on your sewing machine to a zipper foot, then sew the lining to the dress around the zipper. Start at the top left side and sew straight down. Then, start at the bottom of the right side and sew straight up. [12] X Research source Do not get too close to the bumps of the zipper while stitching the lining in place, or you could cause it to warp."
    },
    {
      "title": "Attach any remaining raw edges except for the bottom hem.",
      "content": "Attach any remaining raw edges except for the bottom hem. If the skirt has a slit, stitch the lining to the main dress around the perimeter of the slit. If the dress has a kick pleat, finish the lining with a narrow hem around this area and let it hang free. [13] X Research source The bottom hem of the skirt should remain loose. You can also leave the outer edge of the sleeve loose, but if you would prefer secured sleeves, top stitch the outer edges of the sleeve together."
    },
    {
      "title": "Turn the dress and lining right-side out to put it on.",
      "content": "Turn the dress and lining right-side out to put it on. Your dress is now complete! You can put it on normally and the lining will protect your skin and add some shape and volume to your dress. [14] X Research source Even though the hem of the lining is loose, it shouldn’t bunch up or move around a ton since it will hang freely inside the skirt."
    },
    {
      "title": "Sew the lining pieces together to make a duplicate dress.",
      "content": "Sew the lining pieces together to make a duplicate dress. Machine stitch the separate lining pieces together using a straight stitch. Connect the skirt panels, shoulders, and waistline to create a duplicate dress made out of lining. Sew the sides together with a 1 ⁄ 4 in (0.64 cm) seam allowance, but use a seam allowance of 1 ⁄ 8 in (0.32 cm) along the shoulders. [15] X Research source"
    },
    {
      "title": "Press and hem the raw edges, leaving a small seam allowance.",
      "content": "Press and hem the raw edges, leaving a small seam allowance. Hem the skirt of the lining with a 1 ⁄ 4 to 1 ⁄ 2 in (0.64 to 1.27 cm) seam allowance. Press the other raw edges with an iron and finish them with 1 ⁄ 8 in (0.32 cm) seam allowance. [16] X Research source Finish the neckline, zipper opening, armhole, sleeve opening, and any skirt slits."
    },
    {
      "title": "Pin the lining to the dress, matching the wrong sides to each other.",
      "content": "Pin the lining to the dress, matching the wrong sides to each other. Turn the dress inside-out but leave the lining right-side out. Slip the lining form over the dress form, matching the seams and edges precisely. [17] X Research source The only edge that should not match will be the lower hem, since the lining should be shorter than the original dress."
    },
    {
      "title": "Stitch along the connecting seams with a straight stitch.",
      "content": "Stitch along the connecting seams with a straight stitch. Machine stitch the lining to the dress at the neckline, shoulder seams, armholes, and waist seam. Use a standard straight stitch for all topstitching. Instead of sewing directly over the existing seams, stitch 1 ⁄ 8 inch (0.32 cm) to the inside of each seam. Leave the bottom hem of the skirt loose. [18] X Research source If the dress has a slit in the skirt, topstitch the lining to the dress around the slit opening. The sleeve openings can remain loose, or you can stitch them together."
    },
    {
      "title": "Sew around the zipper with a zipper foot.",
      "content": "Sew around the zipper with a zipper foot. Switch to a zipper foot on your sewing machine, then machine stitch the lining around the zipper. Sew from top to bottom on the left side of the zipper and from bottom to top on the right side. Make sure that you do not get too close to the bumps of the zipper while working. [19] X Research source You can hand stitch the lining to the zipper if you do not have a zipper foot with a fell stitch ."
    },
    {
      "title": "Turn the dress right-side out to wear it.",
      "content": "Turn the dress right-side out to wear it. The lining should be secure, so you can turn the dress right-side out again. You can try on your dress and wear it out on the town! [20] X Research source Since you attached the lining with the right side facing out, it will be soft and comfortable against your skin."
    }
  ]
}