{
  "url": "https://www.wikihow.com/Lose-30-Pounds",
  "title": "How to Lose 30 Pounds",
  "steps": [
    {
      "title": "Start a food journal.",
      "content": "Start a food journal. You will need a good idea of the calories you are consuming before you start any type of reduced calorie diet plan. Start keeping a food journal by noting everything you eat and drink in one day. Note your breakfast, lunch, dinner, snacks, drinks and anything else you eat throughout the day. Be as accurate as you can. [2] X Research source The calories you calculate from these typical days will be your starting point for figuring out a level that will help you lose weight. Continue your food journal after you've begun your weight loss plan as well. Studies show this keeps you accountable to your diet and can help you lose weight and keep it off. [3] X Research source"
    },
    {
      "title": "Calculate your current daily calorie total.",
      "content": "Calculate your current daily calorie total. After you've kept a food journal for a few days, you'll be able to determine a calorie goal to meet each day to help you lose weight. Most health professionals recommend aiming for a one to two pound weight loss each week. This is gradual, but safer and more sustainable weight loss. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You'll most likely have an easier time maintaining a weight loss that was more gradual. Take your food journal and average the total calories you typically eat. Subtract 500 to 750 calories from this number. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source This lower calorie level is what you should aim for if you want to lose one to two pounds per week. If you subtract 500 to 750 calories but you get a value less than 1,200 calories, then make 1,200 calories your daily target. Eating less than 1,200 calories daily isn't considered safe. Your metabolism can slow and you're at a high risk for nutrient deficiencies. [6] X Research source"
    },
    {
      "title": "Figure out a realistic weight loss period.",
      "content": "Figure out a realistic weight loss period. Set up a weight loss calendar or schedule to help get you going and keep you on track for weight loss within a specific time period. If you're going about weight loss with the mindset of losing one to two pounds per week, you'll need about four months to lose 30 pounds. However, you may want to consider giving yourself a few extra weeks to lose that weight. You need to plan for slip-ups, holidays and unplanned stressful events that could set you back a few days or week with your weight loss."
    },
    {
      "title": "Build a support group.",
      "content": "Build a support group. Another thing that will be beneficial to plan as part of your weight loss diet is finding and building a support group. [7] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Studies have shown that those who have a support group tend to stick to diets long-term and are able to lose more weight and keep it off compared to those who do not have a support group. [8] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Talk to friends, family members or co-workers about your weight loss goals and ask them to be your support group and keep you accountable. Also, be your own support group by writing down your motivations for losing weight in your food and fitness journal. Return to this journal daily and weekly to plot your goals, weight and inch reduction."
    },
    {
      "title": "Follow a higher protein diet.",
      "content": "Follow a higher protein diet. Many studies show that a higher protein diet can help you lose weight, but also make it a bit easier to keep the weight off long-term. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Protein is an essential nutrient to your diet. Focus on getting a little more than average to help you increase your overall satiety and better manage your appetite. If you make sure to eat a source of protein at each meal, you'll be able to meet your protein needs with ease. Plan to have at least one or two servings of leaner protein per meal and one serving with snacks. One serving of meat protein, is about 85 to 120 grams by weight (or 3 to 4 oz), which delivers 20 to 25 grams of protein. [10] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source Choose leaner protein sources as these are lower in calories and can easily fit into a low-calorie diet plan. Alternate between different sources of protein to maintain a varied diet. Try: seafood, tofu, legumes, lean beef, eggs, low-fat dairy and poultry."
    },
    {
      "title": "Make half your plate a fruit or vegetable.",
      "content": "Make half your plate a fruit or vegetable. Another easy trick to maintaining a lower calorie diet, without feeling like you're starving yourself is to fill up on lots of fruits and vegetables. These foods are low in calorie which means you can eat a fair amount and still be within your target calorie goal. In addition, these foods are high in fiber. They provide bulk to meals so you'll feel more full during meals and stay satisfied longer after your meal is completed. [11] X Research source Make half of your meals and snacks a fruit or vegetable. Aim for one cup of dense vegetables, two cups of leafy greens and 1/2 cup of fruit per serving. [12] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source [13] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source"
    },
    {
      "title": "Go for 100% whole grains.",
      "content": "Go for 100% whole grains. In addition to fruits and vegetables, another fiber-packed food group are grains. Add a serving or two of whole grains to your day to help you increase your fiber intake so you'll feel more satisfied with your meals. Its recommended to go for 100% whole grains over refined grains because they are higher in fiber, protein and other essential nutrients. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Avoid refined grains like white bread, white rice, plain pasta or baked goods made with white flour. Instead, try a variety of whole grains like: oats, quinoa, brown rice, whole wheat bread or whole wheat pasta. Also, always measure portion sizes of whole grains. Stick to 1/2 cup or 1 oz per serving. [15] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source"
    },
    {
      "title": "Pre-pack healthy snacks.",
      "content": "Pre-pack healthy snacks. Although snacking might seem counter intuitive to weight loss, they can actually be an appropriate part of your weight loss plan. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you feel like you'll need a snack, aim to make snacks 150 calories or less. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Also, make sure they contain some lean protein and a fruit or vegetable to make them a nutrient-packed addition to your day. Also, only snack if you need to. For example, if it's been more than four hours since you ate and your stomach is growling or you need a little something before your workout. Try to avoid snacking out of boredom. Place 100 to 150 calorie snacks in small baggies to bring to work or keep at home for a quick on-the-go snack choice."
    },
    {
      "title": "Eat mindfully.",
      "content": "Eat mindfully. When you're trying to lose weight, it is a smart idea to make some lifestyle changes in addition to following a reduced calorie diet. [18] X Expert Source Kristi Major ACE Certified Personal Trainer Expert Interview. 28 October 2019. Eating mindfully can be a great tool to use in addition to following a specific diet or exercise plan to lose weight. You'll be forced to pay attention to what you're eating, how you're eating and why you eat. Take at least 20 minutes to eat your meals. This slow method of eating helps give your body enough time to feel satisfied and can help prevent you from overeating. [19] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Use smaller portions and smaller plates. Using salad plates at dinner can help you control portion sizes better. Also remove distractions while you're eating. Turning off the TV and your cell phone can force you to pay attention and get more enjoyment and satisfaction from your meals."
    },
    {
      "title": "Drink enough fluids each day.",
      "content": "Drink enough fluids each day. Water is essential to keeping you hydrated throughout the day. However, it's also a key factor in your weight loss. [20] X Expert Source Kristi Major ACE Certified Personal Trainer Expert Interview. 28 October 2019. When you're dehydrated, which is fairly common, many times you may confuse thirst for hunger. You may eat or have a snack when in reality you just needed to sip on some water. [21] X Research source In addition, drinking a large glass of water prior to meals can help fill you up and make you feel full on a no-calorie fluid. Aim for a minimum of eight 8 ounce glasses of fluid daily. However, some health professionals believe you may even need up to 13 glasses daily. This will depend on your age, gender and activity level. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Aim to have you urine the color of lemonade or very pale yellow by the end of the day. In addition, you shouldn't feel thirsty throughout the day."
    },
    {
      "title": "Make an exercise plan.",
      "content": "Make an exercise plan. When you're aiming to lose a larger quantity of weight and are planning to use exercise to support that weight loss, it might be beneficial to set up an exercise plan for yourself. [23] X Expert Source Kristi Major ACE Certified Personal Trainer Expert Interview. 28 October 2019. Write up a little schedule or calendar that shows what type of exercise you'll be doing, what time of day, how many days a week and for how long. Plan to start with low-impact workouts. Try swimming, walking, water aerobics or elliptical use during the first month. These types of exercises might be better on your joints or be easy for those suffering from arthritis. Also plan to slowly increase the duration or amount of time spent exercising. You may start out by aiming to work out for 20 minutes three days a week. Slowly advance to 30 minutes three days a week and then 30 minutes four days a week. You may want to considering meeting with a personal trainer or physical therapist if you haven't exercised before or want additional guidance."
    },
    {
      "title": "Increase lifestyle activity.",
      "content": "Increase lifestyle activity. An easy way to begin exercising and just being more active is by increasing your lifestyle activity. This is an especially good place to start if you aren't currently doing any planned or structured exercise. Lifestyle activities are those you do on a regular basis. Walking to and from your car, mopping the floor, taking the stairs in your office or even shoveling snow. Some studies show that those people who do a lot of lifestyle activity reap similar benefits to those people who do structured aerobic activity. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Try to add more movement or steps to your day. For example, go for a 10 to 20 minute walk after dinner or on your lunch break. Micro walks during the work day, in the morning or during your lunch hour will also help you lose weight. Also, try planning activities, rather than television watching. Encourage your entire family to be more active. Go mini golfing, dog walking or play sports."
    },
    {
      "title": "Include regular cardiovascular exercise.",
      "content": "Include regular cardiovascular exercise. After you've worked on increasing your lifestyle activity start making strides to participating in some planned and structured cardio exercises. Most health experts recommend participating in about 150 minutes of activity each week. This is about 2 1/2 hours. [25] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you haven't been exercising or have difficulty with exercising, start with a smaller goal like 1 1/2 hours a week. Many activities can count as cardio exercises. Try: water aerobics, using the elliptical, going for a walk, doing a dance class or riding a stationary bike."
    },
    {
      "title": "Add in strength training.",
      "content": "Add in strength training. Strength training helps build lean muscle mass and can help increase your body's ability to burn calories during rest over time. Lift free weights or use weight machines for at least 30 minutes two to three times per week. Aim to work each major muscle group. Lift free weights or use weight machines for at least 30 minutes two to three times per week. Sign up for a personal training session to learn proper form. You should be very careful to avoid injury. Review your form and new exercises with the personal trainer frequently."
    }
  ]
}