{
  "url": "https://www.wikihow.com/Line-Dance",
  "title": "How to Do Line Dancing",
  "steps": [
    {
      "title": "Stand with your feet together.",
      "content": "Stand with your feet together. Keep your arms relaxed at your sides."
    },
    {
      "title": "Step out with your right foot.",
      "content": "Step out with your right foot. Your feet should now be about a shoulder's width apart."
    },
    {
      "title": "Step your left foot behind and to the right of your right foot..",
      "content": "Step your left foot behind and to the right of your right foot.. Your legs should now be crossing one another."
    },
    {
      "title": "Step out with your right foot.",
      "content": "Step out with your right foot. Your feet should once again be a shoulder's width apart."
    },
    {
      "title": "Place your left foot back in its original position so that you are now standing with your feet together.",
      "content": "Place your left foot back in its original position so that you are now standing with your feet together. The speed of the steps will be based on the rhythm of the song your are dancing to."
    },
    {
      "title": "Repeat the steps, this time moving to the left.",
      "content": "Repeat the steps, this time moving to the left. The grapevine is used in popular line dances such as the Cowboy Boogie. [2] X Research source"
    },
    {
      "title": "Stand with your feet together.",
      "content": "Stand with your feet together. Keep your arms relaxed at your sides. Step forward about 1-1/2 feet with your right foot."
    },
    {
      "title": "Slide, or shuffle, your left foot up to meet your right foot.",
      "content": "Slide, or shuffle, your left foot up to meet your right foot. At least part of your foot should be touching the ground the entire time."
    },
    {
      "title": "Step forward once again with your right foot.",
      "content": "Step forward once again with your right foot. This is the last step of the sequence."
    },
    {
      "title": "Repeat the move starting with your left foot.",
      "content": "Repeat the move starting with your left foot. Step forward with your left foot about 1-1/2 feet. Slide your right foot up to meet your left foot. Step forward again with your left foot."
    },
    {
      "title": "Practice doing this move to the front, to the back (stepping backward), and side to side.",
      "content": "Practice doing this move to the front, to the back (stepping backward), and side to side. One of the most popular line dances to use this step is the Cupid Shuffle . [3] X Research source"
    },
    {
      "title": "Stand with your feet together.",
      "content": "Stand with your feet together. Kick your right foot forward a few inches above the ground, then lean forward and step on the ball of that foot, but only for a second."
    },
    {
      "title": "Place your foot back in its original position.",
      "content": "Place your foot back in its original position. Then step down with your left foot."
    },
    {
      "title": "Repeat the move beginning with your left foot.",
      "content": "Repeat the move beginning with your left foot. The kickball change [4] X Research source is featured in many dances, including Copperhead Road. [5] X Research source"
    },
    {
      "title": "Step forward with your right foot.",
      "content": "Step forward with your right foot. Place your weight on the ball of your foot and pivot 90-degrees to your left."
    },
    {
      "title": "Shift your weight to your left foot.",
      "content": "Shift your weight to your left foot. Bring your feet back together."
    },
    {
      "title": "Repeat the move with your left foot, this time pivoting 90-degrees to your right.",
      "content": "Repeat the move with your left foot, this time pivoting 90-degrees to your right. Pivot turns are used in many line dances, including the popular Cupid Shuffle, [6] X Research source to change directions or to link other steps."
    },
    {
      "title": "Line dance to the song, \"The Cupid Shuffle.\"",
      "content": "Line dance to the song, \"The Cupid Shuffle.\" Put the above steps together to perform the Cupid Shuffle Line Dance . Step four steps to the left using either the grapevine or a side shuffle, keeping rhythm with the song. Then make four similar steps to the right. Complete the kickball change with your left foot, followed by your right foot. Repeat the step with each foot. Pivot turn to the left, adding extra steps, turns and hip movements in tune to the music. Repeat the sequence."
    },
    {
      "title": "Step to the \"Electric Slide.\"",
      "content": "Step to the \"Electric Slide.\" You can also combine the above steps to perform the Electric Slide . Similar to the Cupid Shuffle, the Electric Slide begins with four grapevine steps to the left followed by four to the right. After grape-vining to each side, take four shuffle steps back followed by four shuffle steps forward. Complete a kickball change with each foot. Pivot turn 90 degrees to the left."
    },
    {
      "title": "Learn the Cowboy Boogie.",
      "content": "Learn the Cowboy Boogie. [7] X Research source The dance is a popular sequence used with many country songs. Do one grapevine to the left, followed by a half-step with your knee up, known as a hitch. Complete the action to the right. Step forward and hitch, then step forward and hitch again. Take three steps back and hitch. \"Boogie\" by shaking your hips as you stand in place. Pivot step to the left, hitch and repeat."
    },
    {
      "title": "Join a line dance at any club, party or reception by walking to the end of one line.",
      "content": "Join a line dance at any club, party or reception by walking to the end of one line. Once in place, you can start stepping in time with the other dancers. If there is no more room on either side of the current lines, form a new line in the front or back. The rhythm of the line dance will be based on the tempo of the song playing. Step in time with the other dancers to stay on track."
    },
    {
      "title": "Use the four walls of a room as reference points while line dancing.",
      "content": "Use the four walls of a room as reference points while line dancing. When practicing the different moves, make an effort to always be moving in a straight line either to the side, front and back. This will be especially important when you are dancing with groups of people."
    },
    {
      "title": "Choose personal movements.",
      "content": "Choose personal movements. While the steps and the counts or each dance are set, your own style will make your dancing stand out. You can choose how to move your hips, upper torso and arms to stand apart from the crowd. While some line dances have arm movements built in, most of the time you can hold you arms however you're comfortable. Hold your arms steady to your sides or in front of you, or you can even make up your own arm movements, as long as they're not too distracting."
    },
    {
      "title": "Wear whatever attire is appropriate for your location.",
      "content": "Wear whatever attire is appropriate for your location. Line dances can be held at barns, nightclubs, school dances, wedding receptions or even birthday parties. [8] X Research source"
    }
  ]
}