{
  "url": "https://www.wikihow.com/Knock-Someone-Out",
  "title": "How to Knock Someone Out",
  "steps": [
    {
      "title": "Grab the attacker by the shirt.",
      "content": "Grab the attacker by the shirt. Use both hands to grab the attacker by the shirt, at the center of the chest just below the collar or neckline. The most effective way to headbutt someone is to draw them into a whiplash motion. In order to accomplish this, you need to push and pull the attacker away by the shirt. Avoid grabbing the attacker behind the neck. Natural instinct is to grab the attacker behind the neck and draw the head down for a headbutt, but the problem with this is that the neck and shoulder muscles naturally tense when grabbed behind the neck, making it much more difficult to pull the person forward."
    },
    {
      "title": "Push the attacker away.",
      "content": "Push the attacker away. Use your full body weight to push forward into the attacker until their upper body leans back. This movement causes the attacker to lose balance and cause their shoulders to disengage. Since this movement is also likely to be unexpected, you will also have the element of surprise on your side."
    },
    {
      "title": "Quickly pull the attacker toward you.",
      "content": "Quickly pull the attacker toward you. As soon as the attacker's shoulders disengage, use your arms to pull the attacker back toward your head. With the shoulders disengaged in this manner, the attacker's arms will naturally swing open, preventing them from using the arms to block the headbutt."
    },
    {
      "title": "Swiftly strike with the right or left of the crown of your head, if you use the middle chances are you might crack your head.",
      "content": "Swiftly strike with the right or left of the crown of your head, if you use the middle chances are you might crack your head. As you draw the attacker toward you, bring your head down so that the top of your head meets with the attacker's nose as their nose drops down. Strike with the top of your head. Do not use your forehead. The nose is a sensitive pressure point, and striking it with enough force will allow you to knock the other person out."
    },
    {
      "title": "Position yourself along the centerline of your attacker.",
      "content": "Position yourself along the centerline of your attacker. Stand directly in front of the attacker so that the vertical center of your body lines up with the vertical center of your attacker's body. When performing an upper-cut, you will need to bring your arm up along this center line until you reach the attacker's chin. As such, you will need to be in a position where you have access to the center line of your attacker's body."
    },
    {
      "title": "Draw the eye with your non-dominant hand.",
      "content": "Draw the eye with your non-dominant hand. Use your non-dominant hand to block and swipe at your attacker's block. Keep the hand near eye level so that it draws attention. Keeping this hand free allows you to defend yourself against your attacker's strikes and also causes your attacker to shift their attention away from your dominant hand."
    },
    {
      "title": "Swiftly bring an open hand up to the attacker's chin.",
      "content": "Swiftly bring an open hand up to the attacker's chin. Swing your dominant arm up along your attacker's center line with your fingers slightly bent, exposing the heel of your palm. The palm should face your attacker's face. Do not make a fist. The heel of your hand is located just above the wrist and should be aimed at your attacker's chin."
    },
    {
      "title": "Strike with the palm heel of your hand.",
      "content": "Strike with the palm heel of your hand. Strike just below the chin of your attacker, snapping their head back and knocking them out. Striking the attacker here throws the head back and pinches the nerves at the top of the spinal column, causing the attacker to black out. Using the palm of your hand gives you a greater surface area to work with in bare-handed fighting . It also protects your fingers, thereby saving your hand and preventing damage to the one \"weapon\" you have access to in the fight."
    },
    {
      "title": "Assess the best way to strike depending on your position.",
      "content": "Assess the best way to strike depending on your position. You can strike the nose of your attacker if they are in front of you or behind you, but the movement you use will vary depending on your starting position. [2] X Research source If your attacker is in front of you, you will need to move in a forward direction. If your attacker is behind you, you will need to attack as you turn to face them."
    },
    {
      "title": "Strike with the heel of your palm from the front.",
      "content": "Strike with the heel of your palm from the front. When standing face-to-face with your attacker, open your hand and strike straight forward, hitting the base of the nose and shoving it back. Throw your weight into the attack in order to apply the most force. This move causes your attacker's head to snap back, pinching the nerves of the upper spinal column and, if done with enough force, causing the opponent to black out."
    },
    {
      "title": "Strike with your elbow if the attacker is behind you.",
      "content": "Strike with your elbow if the attacker is behind you. If the attacker is behind you, bend and lift your arm so that your elbow points toward the attacker's face. Rotate your upper body enough to throw your elbow into the side of the attacker's nose. The center side of the nose, on either side, is another pressure point of the body. If you strike hard enough, you can cause the nose to break and the attacker to fall unconscious."
    },
    {
      "title": "Align your side with your attacker's center line.",
      "content": "Align your side with your attacker's center line. This technique works especially well when your attacker comes from the side, but if your attacker is coming from a different angle, you will need to rotate your stance until your shoulder roughly lines up with the vertical center of your attacker's body. [3] X Research source Note that you can use either side of your body for this attack, but you may be able to apply more force if you turn your body so that your dominant side faces your attacker."
    },
    {
      "title": "Step forward and shift your weight as your attacker approaches.",
      "content": "Step forward and shift your weight as your attacker approaches. Once your attacker comes toward you, take a step forward with the foot nearest them, causing your full body weight to shift forward onto that foot. You need to step into your assailant's attack, not draw back from it. This move only works if your attacker is on the offensive and actively coming toward you. It uses the force of the attacker's forward motion to inflict damage."
    },
    {
      "title": "Aim your elbow toward the Adam's apple.",
      "content": "Aim your elbow toward the Adam's apple. Lift your elbow up as you step into your opponent's attack, causing the elbow to meet the inside of the Adam's apple on either side. If you strike the inside of the Adam's apple from a 45 degree angle, you should be able to cause your attacker to collapse. Even if you do not successfully strike the pressure point, the force from the impact of your elbow should be enough to throw your attacker off."
    },
    {
      "title": "Begin in a protective stance.",
      "content": "Begin in a protective stance. Stand with your feet shoulder-width apart and your knees slightly bent. Your non-dominant foot should be slightly in front of your dominant foot, and your hands should be up and ready to move. [4] X Research source Standing in this manner keeps your center of gravity at the center of your stance, thereby allowing you to maintain perfect balance . Note that this move can still be performed even if you are not in a protective, balanced stance, but you will have greater odds of succeeding in a knockout if you start from this stance."
    },
    {
      "title": "Analyze your position in relation to the attacker.",
      "content": "Analyze your position in relation to the attacker. The attacker should be crouched down and no greater than half a leg's length away. You can bring your attacker down by delivering a kick to the groin or to the shin. This move generally works best of your attacker is already doubled-over and off-guard. It works less well if they are already facing you and attempting to rise."
    },
    {
      "title": "Force your attacker's shoulders down.",
      "content": "Force your attacker's shoulders down. Press down on both of your attacker's shoulders with the heel of your palms. Throw your entire upper body weight into the gesture so that you can apply maximum force. Keep your legs in the same stance to maintain your balance as you prepare to deliver the knockout blow."
    },
    {
      "title": "Swiftly bring your knee up as you draw your attacker down.",
      "content": "Swiftly bring your knee up as you draw your attacker down. While holding your attacker's shoulders down, bring your dominant knee forward so that it strikes your attacker in the nose or chin. [5] X Research source Work quickly . The force of being pushed down will automatically cause the attacker to tighten his or her shoulder muscles, making it harder to keep the attacker down. Aim for either the nose or the chin to inflict the most damage and cause a black out."
    }
  ]
}