{
  "url": "https://www.wikihow.com/Make-Pineapple-Cake",
  "title": "How to Make Pineapple Cake",
  "steps": [
    {
      "title": "Preheat your oven to 350 째F (180 째C).",
      "content": "Preheat your oven to 350 째F (180 째C)."
    },
    {
      "title": "Prepare your cake pans.",
      "content": "Prepare your cake pans. Grease and flour two 9-inch (23 cm) round cake pans."
    },
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. These are listed in the \"Ingredients\" section ."
    },
    {
      "title": "Combine and whisk the dry ingredients.",
      "content": "Combine and whisk the dry ingredients. In a medium sized bowl, add the flour, baking powder, baking soda, and salt."
    },
    {
      "title": "Cream the butter and sugar.",
      "content": "Cream the butter and sugar. Use a hand mixer or stand mixer to beat together the softened unsalted butter and sugar in a different bowl. Beat on medium speed for 3 to 4 minutes, or until the mixture becomes light and fluffy."
    },
    {
      "title": "Add eggs and vanilla extract.",
      "content": "Add eggs and vanilla extract. Starting with the eggs, add into the wet mixture one at a time. Beat well after each addition. Stir in 1 teaspoon of vanilla extract until fully incorporated."
    },
    {
      "title": "Mix the dry ingredients with the wet ingredients.",
      "content": "Mix the dry ingredients with the wet ingredients. In alternating additions beginning with the dry ingredients, add the dry ingredients and the milk and pineapple juice from the can to the wet mixture."
    },
    {
      "title": "Mix in the can of crushed pineapple to the batter.",
      "content": "Mix in the can of crushed pineapple to the batter. Fold gently until fully incorporated."
    },
    {
      "title": "Pour the batter evenly into the prepared cake pans.",
      "content": "Pour the batter evenly into the prepared cake pans."
    },
    {
      "title": "Bake the cake layers for 30-35 minutes.",
      "content": "Bake the cake layers for 30-35 minutes. Allow cakes to cool completely before transferring onto wire racks."
    },
    {
      "title": "Prepare the frosting in a chilled bowl.",
      "content": "Prepare the frosting in a chilled bowl. Beat heavy cream using a hand mixer or stand mixer on high speed. Add powdered sugar and vanilla extract to the cream. Whip until soft peaks form."
    },
    {
      "title": "Spread a layer of whipped cream frosting on top of the first cake layer.",
      "content": "Spread a layer of whipped cream frosting on top of the first cake layer. Place the second cake layer on top of the frosting, then frost the top and sides of the entire cake."
    },
    {
      "title": "Garnish and serve with coconut if desired.",
      "content": "Garnish and serve with coconut if desired."
    }
  ]
}