{
  "url": "https://www.wikihow.com/Grow-Alum-Crystals",
  "title": "How to Grow Alum Crystals",
  "steps": [
    {
      "title": "Gather the necessary materials.",
      "content": "Gather the necessary materials. To grow crystals using this method, you will need alum, two jars, a spoon, hot water, a wood pencil, some clear string, plastic wrap, and food coloring (optional). [1] X Research source The food coloring can be used to alter the color of the crystal if you wish, but is not necessary to the creation of the crystal. Alum can be found in the spice aisle at the grocery store. It is generally used for pickling vegetables. [2] X Research source Alum is nontoxic, but can cause irritation to the eyes. Avoid touching your eyes or wear protective glasses. [3] X Research source Glass jars are recommended because you will be using hot water. Also, it is easier to see the crystals form. The pencil needs to be long enough to sit on top of the jar."
    },
    {
      "title": "Make a saturated alum solution.",
      "content": "Make a saturated alum solution. In order to start growing your crystal, you need to make a solution of hot water and alum. A saturated solution means that you add enough alum that it can no longer dissolve in the water. The water does not have to be boiling, but the alum will dissolve in warm water faster than in cold water. Add a cup of hot water to one jar. Stir in a tablespoon of alum until it dissolves. Keep adding alum and stirring until the alum no longer dissolves. You may see a small amount of alum powder at the bottom of the jar. Add food coloring at this stage to color the water."
    },
    {
      "title": "Transfer the saturated solution into the clean jar.",
      "content": "Transfer the saturated solution into the clean jar. If there is no undissolved powder left at the bottom of the jar that you mixed the solution in, you can skip this step. If there is powder, pour the alum solution into a new jar, making sure none of the powder gets into the new jar. In order to grow good crystals, you don't want any particles in the solution. Wash the original jar, you will use it again later for the second stage of growing."
    },
    {
      "title": "Cover the lid of the jar.",
      "content": "Cover the lid of the jar. You want to keep any dust or dirt particles out of the jar. Do this by covering the lid with plastic wrap, foil, or placing a piece of cardboard over the top. Plastic wrap or foil are preferable because you can make a tighter seal. [4] X Research source For a strong seal, wrap a rubber band around the plastic wrap or foil."
    },
    {
      "title": "Leave the jar alone for at least 24 hours.",
      "content": "Leave the jar alone for at least 24 hours. Store the jar in a place that is out of the way and won't be bumped by anyone. If the jar gets jostled, no crystals will form. Locations with warmer air will help the crystals grow faster. Let the jar sit for at least 24 hours. After 24 hours check for crystal formation. [5] X Research source You can leave the jar for longer, but if you have crystals at the bottom, you can use these as seeds to grow larger crystals."
    },
    {
      "title": "Pour the solution only into a clean jar.",
      "content": "Pour the solution only into a clean jar. Once you have crystals formed at the bottom of the jar, you need to transfer the solution to a new jar so you can choose your seed crystals. When you pour, take care not to let any crystals fall into the new jar. You want only the alum solution to be in the new jar. You can also add another spoonful of alum to the jar to replace the alum that formed into crystals."
    },
    {
      "title": "Choose a seed crystal.",
      "content": "Choose a seed crystal. Pour the crystals out of the bottom of the jar and dry them off with a paper towel. Examine them and choose the largest transparent crystal with flat sides. This crystal will serve as the base to grow your larger crystal. You may notice that some of the crystals are overlapping. These will not work well to grow larger crystals. Choose a single crystal to use as a seed."
    },
    {
      "title": "Tie a piece of clear string around the seed crystal.",
      "content": "Tie a piece of clear string around the seed crystal. Take your piece of clear string and make a loop around the crystal tying it in place. The string needs to be tight enough to hold the crystal in place once it is suspended. Alternatively, you can glue the string to the crystal with a dab of superglue. [6] X Research source Clear string is recommended because the crystal will grow around it. Darker colors will be seen in the crystal. Tie the other end of the string around a pencil or popsicle stick. Use caution if you choose to use superglue to attach the string."
    },
    {
      "title": "Suspend the crystal in the saturated alum solution.",
      "content": "Suspend the crystal in the saturated alum solution. Use the original solution that you used to grow the seed crystals. Place the pencil across the mouth of the jar so that the crystal hangs down into the solution. If you didn't already, you can add more alum to the solution to replace what formed into crystals during the seed formation stage. Make sure the solution is cooled to room temperature before placing the seed crystal into it. If the water is warm, it will dissolve. [7] X Research source"
    },
    {
      "title": "Cover the top of the jar.",
      "content": "Cover the top of the jar. To keep out dust and dirt, tightly cover the jar. Dust and dirt particles can mess up the crystal formation. Cover the top of the jar with plastic wrap or foil. Even placing a napkin or piece of paper over the top will be sufficient to cover it. You can make a tighter seal by placing a rubber band around the plastic wrap or foil."
    },
    {
      "title": "Leave the jar alone for at least 24 hours.",
      "content": "Leave the jar alone for at least 24 hours. Store the jar in a place that it will remain undisturbed. If the jar gets bumped or moved around, the crystals will not grow. It may take a few days for the crystal to start to grow in size. [8] X Research source Keep the crystal in a cool place so it doesn't dissolve. After a few days, check on the crystal. You can tell how much it has grown by the location of the clear string within the crystal."
    },
    {
      "title": "Add more alum to the solution to grow the crystal larger.",
      "content": "Add more alum to the solution to grow the crystal larger. After a few days, you may notice that the crystal doesn't seem to be growing. This is likely due to the fact the solution is no longer saturated. As the crystal grows, alum is taken out of the solution and added to the crystal. To keep the crystal growing, simply add more alum. [9] X Research source Remove the crystal, add a spoonful of alum and stir until dissolved. Replace the crystal and let it grow for a few more days. You can repeat this process until your crystal is at the desired size."
    },
    {
      "title": "Admire your crystal.",
      "content": "Admire your crystal. You can keep it in a glass case or out in the open. Make sure you don't get it wet as it can dissolve the crystal. To clean off dust, take a dry, soft rag and carefully pat the crystal. Try making crystals of different sizes and colors. If you do accidentally get your finished crystal wet, quickly take a paper towel or a cloth and pat dry until the water is mostly dry. It might dissolve, but it won't dissolve as much."
    },
    {
      "title": "Gather the necessary materials.",
      "content": "Gather the necessary materials. To make fake geodes you will need eggshells, a glass container, alum, hot water, craft glue, a small paintbrush, and food coloring. All of these items are readily available at the grocery store. You can find alum in the spice aisle as it is used for pickling vegetables. The eggshells need to be cut in half widthwise, washed out, and dried before use. The food coloring is optional, but it allows you to color the crystals of the geode. The glass container needs to be large enough for the eggshell to be completely immersed in water."
    },
    {
      "title": "Paint glue on the eggshells.",
      "content": "Paint glue on the eggshells. Pour some craft glue onto a piece of newspaper and use a paintbrush to coat the inside of the eggshell. You only need a thin layer of glue; just enough for the alum to stick to the surface. Don't let the glue dry between this step and the next."
    },
    {
      "title": "Sprinkle alum on the glue before it dries.",
      "content": "Sprinkle alum on the glue before it dries. While the glue is still wet, sprinkle some alum powder onto the glue. The powdered alum will serve as a starting point for a crystal to grow. If you want smaller crystals, completely coat the inside of the egg with alum because the crystals will not be able to grow very large when they are close together. If you want larger crystals, lightly sprinkle the alum making sure there is some space between the powder granules. Leave the eggshell to dry overnight."
    },
    {
      "title": "Make a saturated alum solution.",
      "content": "Make a saturated alum solution. Use hot water to make a solution that is completely saturated with alum (no more alum will dissolve). Use enough water to fill your container so that the eggshell will be completely immersed. Add a tablespoon of alum and stir to dissolve. Keep adding alum until no more dissolves in the water. At this point, the solution is saturated. Add food coloring to change the color of the geode. Cool the solution to room temperature."
    },
    {
      "title": "Place the egg in the saturated alum solution.",
      "content": "Place the egg in the saturated alum solution. Once the solution is cooled, transfer it to the container you will use for the growth phase. Gently place the egg into the container and make sure it is completely covered by the solution. Cover the top of the container with plastic wrap or foil to keep dust out."
    },
    {
      "title": "Let the container sit for at least 24 hours.",
      "content": "Let the container sit for at least 24 hours. As time passes, the alum crystals will grow larger from the starting points on the eggshell. It can take a few days for the crystals to grow to a respectable size. Check on the eggshell geode each day and remove it from the solution when you are satisfied with the growth of the crystals. Store the experiment in a place where it will not be bumped. If it gets bumped or moved around, the crystals will not form properly. Once you remove the eggshell from the solution, you will have made an alum crystal geode!"
    }
  ]
}