{
  "url": "https://www.wikihow.com/Install-the-Pinterest-%22Pin-It%22-Button",
  "title": "4 Easy Ways to Install and Use the Pinterest \"Pin It\" Button",
  "steps": [
    {
      "title": "Go to the Pinterest Save Button page in the Chrome Web Store.",
      "content": "Go to the Pinterest Save Button page in the Chrome Web Store. You'll need to use Google Chrome . [1] X Research source"
    },
    {
      "title": "Click Add to Chrome.",
      "content": "Click Add to Chrome . This is the blue button on the left of the screen. A pop-up will open."
    },
    {
      "title": "Click Add extension.",
      "content": "Click Add extension . This is the right button. The Pinterest Save Button extension will be added . For quick access, you can pin this extension to the right of the address bar. Click the puzzle icon in the top-right corner, and then click the push pin icon next to Pinterest Save Button ."
    },
    {
      "title": "Use the Pinterest Save Button.",
      "content": "Use the Pinterest Save Button. If you aren't already logged into Pinterest , go to https://www.pinterest.com/ to do so now. Once you're logged in, do the following: Navigate to a website with content you want to Pin. Hover over the image, video, or product. [2] X Research source Select a board. Click Save ."
    },
    {
      "title": "Go to the Pinterest Save Button page in Microsoft Edge Add-ons.",
      "content": "Go to the Pinterest Save Button page in Microsoft Edge Add-ons. You'll need to use Microsoft Edge."
    },
    {
      "title": "Click Get.",
      "content": "Click Get . This is the blue button on the left of the screen. A pop-up will open."
    },
    {
      "title": "Click Add extension.",
      "content": "Click Add extension . This is the right button. The Pinterest Save Button extension will be added. For quick access, you can pin this extension to the right of the address bar. Click the puzzle icon in the top-right corner, and then click the eyeball icon with a slash through it next to Pinterest Save Button ."
    },
    {
      "title": "Use the Pinterest Save Button.",
      "content": "Use the Pinterest Save Button. If you aren't already logged into Pinterest, go to https://www.pinterest.com/ to do so now. Once you're logged in, do the following: Navigate to a website with content you want to Pin. Hover over the image, video, or product. Select a board. Click Save ."
    },
    {
      "title": "Go to the Pinterest Save Button page in Firefox Add-Ons.",
      "content": "Go to the Pinterest Save Button page in Firefox Add-Ons. You'll need to use Mozilla Firefox ."
    },
    {
      "title": "Click Add to Firefox.",
      "content": "Click Add to Firefox . This is the blue button below Pinterest Save Button . A pop-up will open."
    },
    {
      "title": "Click Add.",
      "content": "Click Add . The Pinterest Save Button add-on will be added to Firefox. You can click the puzzle icon to the right of the address bar to view your extensions."
    },
    {
      "title": "Use the Pinterest Save Button.",
      "content": "Use the Pinterest Save Button. If you aren't already logged into Pinterest, go to https://www.pinterest.com/ to do so now. Once you're logged in, do the following: Navigate to a website with content you want to Pin. Hover over the image, video, or product. Select a board. Click Save ."
    },
    {
      "title": "Open the Safari app.",
      "content": "Open the Safari app. This looks like a blue and grey compass. If desired, you can use another mobile browser. While there's no Pinterest Save Button extension on the Safari desktop app, you can add Pinterest as a favorite icon for quick access."
    },
    {
      "title": "Navigate to any webpage.",
      "content": "Navigate to any webpage. This could be a webpage you want to add as a pin."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share. This is at the very bottom of the screen. If you're using a different browser, the location may differ."
    },
    {
      "title": "Scroll to the far right of the apps.",
      "content": "Scroll to the far right of the apps. You'll see a list of common apps you can use to share the webpage. If you don't see Pinterest immediately, scroll to the very far right."
    },
    {
      "title": "Tap ••• More.",
      "content": "Tap ••• More . A new page will open with a list of apps."
    },
    {
      "title": "Tap Edit.",
      "content": "Tap Edit . You can find this in the top-right corner."
    },
    {
      "title": "Tap + next to \"Pinterest\".",
      "content": "Tap + next to \"Pinterest\". This will add Pinterest to your Favorites."
    },
    {
      "title": "Tap Done and Done again.",
      "content": "Tap Done and Done again. When you open the Share menu, you'll now see Pinterest as one of the first app suggestions."
    }
  ]
}