{
  "url": "https://www.wikihow.com/Get-a-Girl-if-You%27re-Short",
  "title": "How to Get a Girl if You're Short",
  "steps": [
    {
      "title": "Project confidence.",
      "content": "Project confidence. There's no substitute for confidence. When you walk into a room, hold your head high and put a little swagger in your step. Acting self-assured shows that you have a lot going for you and you're not hung up on being a little more compact than the people around you. [1] X Research source In order to feel bigger, it can also help to sound bigger. Use a clear, assertive tone when you speak instead of acting shy or murmuring softly. If you don't treat your shortness like a big deal, chances are no one else will either. Many women won't care if you're short as long as you're a good person. [2] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021."
    },
    {
      "title": "Stand up straight.",
      "content": "Stand up straight. Practice good posture and avoid slouching. Draw your shoulders back, push your chest forward and raise your chin up. You should also find something better to do with your hands than stick them in your pockets, which can cause your shoulders to droop and make you look self-conscious. [3] X Research source It's all about creating a presence—by holding yourself as though you were the tallest person in the room, you'll have an influence over the way other people see you. [4] X Research source Poor posture can actually play up shortness, which is the opposite of the effect you're going for."
    },
    {
      "title": "Put your personality on display.",
      "content": "Put your personality on display. Remember, it's what's inside that really counts. Instead of simply wishing you were taller, make your worth visible in other ways. For instance, you could play up your accomplishments at school or work, or describe a fascinating hobby of yours that will help you stand out from the crowd. [5] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021. [6] X Research source Always wear a warm smile. It will make you more approachable. [7] X Research source Being friendly will take you a lot further than just being a certain height. Girls want to spend time with people they can feel comfortable around. [8] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021."
    },
    {
      "title": "Dress in a way that compliments your frame.",
      "content": "Dress in a way that compliments your frame. Wearing slim, fitted clothes can make your limbs look longer, creating the appearance of added height. Take your measurements and start buying items that are true to your build. Dressing well can help you cut a more appealing image. [9] X Research source Vertical stripes and patterns are also a smart choice, as they make the eye move up and down. [10] X Research source Steer clear of baggy, oversized clothes that have a tendency to bunch up. You'll look even smaller if you're swallowed up by your outfit. Thick-soled shoes or boots will raise you up a little, which can help you get noticed when socializing."
    },
    {
      "title": "Improve your physique.",
      "content": "Improve your physique. You might be able to make your short stature less noticeable by building a healthier, more proportioned body. Put in some time at the gym doing cardio and lifting light weights to increase your muscle mass, and make sure you're eating a balanced diet. A well-developed physique will draw attention away from the fact that your interest has a few inches on you. [11] X Research source Get good at a sport or some other discipline that's physically impressive, like dancing. Be careful not to bulk up too much, or it could end up making you look stocky. Putting on massive amounts of muscle may also give the impression that you're trying to compensate. [12] X Research source"
    },
    {
      "title": "Accept your height.",
      "content": "Accept your height. There's no way to change how tall you are, and the sooner you make peace with that reality, the better off you'll be. But that doesn't mean you have to hide your face in shame. Your height is just one of many features. Remember that you have plenty more to offer than just the way you look. [13] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021. [14] X Research source Insecurity can lead to bashfulness or defensive behavior, both of which may be unattractive to girls."
    },
    {
      "title": "Date shorter girls.",
      "content": "Date shorter girls. One simple solution is to go after girls that are around the same height as you. That way, there will be no need to bring up the topic while you're getting to know her, and no awkward hugs or dances later on. You'll be able to look her in the eye without constantly feeling like she's towering over you. [15] X Research source Since you won't be intimidated by someone in the same height range, you'll be able to focus on enjoying yourself. [16] X Research source While height may be something you consider when playing the field, you shouldn't judge people on their physical characteristics alone. Take the time to really get to know the girls that you're interested in."
    },
    {
      "title": "Be willing to joke about your height.",
      "content": "Be willing to joke about your height. Most girls are drawn to fun, lighthearted personalities. Whereas tall guys are a dime a dozen, finding someone who can make her laugh isn't nearly as common. Having a good sense of humor is a far better selling point than simply being a little taller. Don't hesitate to make a quip about how you have trouble reaching the top shelf or need platform shoes to drive when the situation calls for it. Saying something like \"I'm so short you can see my feet in my driver's license photo\" can really help to break the ice. If you let your height become a source of frustration or embarrassment, it may cause you to come off as bitter around other people. [17] X Research source"
    },
    {
      "title": "Don't rely on online dating.",
      "content": "Don't rely on online dating. Many users on dating apps and websites list preferences for physical traits like height, weight and hair and eye color. With such an impersonal format, it's possible that you could get passed over before a single word is exchanged. It's better to talk face-to-face, since this will give you an opportunity to show what you're all about. [18] X Research source Making a solid first impression is critical, but it can be very tough to do over the internet. Resist the urge to lie about your height on your online dating profile. The truth will come out as soon as you meet, and your date most likely won't be too pleased. [19] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021."
    },
    {
      "title": "Just go for it.",
      "content": "Just go for it. Work up the nerve to walk right up and ask her out. There's no way to know whether she's interested in you unless you put yourself out there. If she says no, you're no worse off. If she says yes, you'll have succeeded in making that initial connection without letting insecurity about your height hold you back. [20] X Research source Different people have different preferences, so realistically your chances of winning her affection are no worse than anyone else's. There's no need to mention your height unless she brings it up first. If she does, laugh it off and wow her with your wit, intellect and charm."
    },
    {
      "title": "Get to know her.",
      "content": "Get to know her. Spend more time with your interest, even if it's just as friends. Make an effort to show a genuine interest in her and what she has to say. The height difference may seem like a deal breaker to her at first, but as she grows more comfortable with you, she'll begin to see how many other things there are to appreciate. [21] X Research source Start things off slow by taking a stroll, grabbing a cup of coffee or doing something casual that will allow you to have a conversation. When she talks, be attentive and listen without interrupting. If you're constantly posturing or distracted by your own doubts, she might think you're self-absorbed. [22] X Research source"
    },
    {
      "title": "Find the right girl.",
      "content": "Find the right girl. Someone who isn't willing to give you a shot based on something as trivial as your height isn't deserving of your time. Keep looking until you find someone who likes you as you are. [23] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021. Ultimately, this will only benefit the relationship. [24] X Research source Avoid talking to girls who insist on bringing up your height as a negative. The girl you've got your eye on may not always be the one that's best for you. If you run into someone closed-minded who sees height as an issue, it's probably best to just move on."
    }
  ]
}