{
  "url": "https://www.wikihow.com/Greet-People-from-the-Philippines",
  "title": "A Simple Guide to Greeting People from the Philippines",
  "steps": [
    {
      "title": "Remember that almost everything you read in Tagalog or Filipino is phonetic.",
      "content": "Remember that almost everything you read in Tagalog or Filipino is phonetic. This means that words can be sounded out. Try to sound it out the way you see it and you will most likely be close to the correct pronunciation. Vowels are harder than in American English, but softer than in a British accent. Also, all the vowels are unrounded, except for /o/. [2] X Research source There are exceptions though: ng is pronounced 'nang' and mga is pronounced 'muhNGA'. The '-ng', which is a single letter, is pronounced as in 'ba ng' or 'so ng' ."
    },
    {
      "title": "Learn a little of the language before you visit.",
      "content": "Learn a little of the language before you visit. You can learn Filipino or Tagalog by reading books, viewing television, listening to music, or watching videos. Just like other languages, it is still best if you practice by conversing with someone who knows the language. If you have a limited amount of time, focus your studying on common greetings that you are likely to use. Don't try to learn all the grammar and structure of the language if you are visiting in the near future."
    },
    {
      "title": "Learn how to say the equivalent of good morning, good afternoon, and good evening.",
      "content": "Learn how to say the equivalent of good morning, good afternoon, and good evening. There is no literal translation for these phrases. Instead, Filipinos greet each other by saying \"beautiful\" before day, afternoon, or evening. To say good morning, say \"Magandang umaga\" (ma-gan-dang u-ma-ga), which literally means beautiful morning. To say good afternoon, say \"Magandang hapon\" (ma-gan-dang ha-pon), which literally means beautiful afternoon. To say good evening, say \"Magandang gabi\" (ma-gan-dang ga-bi), which literally means beautiful evening."
    },
    {
      "title": "Try English if all else fails.",
      "content": "Try English if all else fails. Filipinos are generally accustomed to English in fact, 96.3% of Philippine population consider English as a second language and Filipinos can speak English fluently also, so you can simply say \"Hi,\" \"Hello,\" 'Good Morning,' etc. The person you are greeting will probably understand your basic greeting in English. [3] X Research source If you get stuck and don't know what to say, just speak in English. It is better to say something in English than nothing at all. However, if you want to impress those you interact with, then go ahead and study the language so you are prepared!"
    },
    {
      "title": "Greet a group of friends.",
      "content": "Greet a group of friends. If you are trying to impress a new group of friends, say \"Kumusta kayó\" when you approach them. This is the plural form of \"How are you?\" [4] X Research source It is pronounced /kah - mu:s - ta: ka: - yo:/."
    },
    {
      "title": "Speak differently to elders.",
      "content": "Speak differently to elders. If you are talking to someone who is older or of higher social rank than you, always add po to your sentences. Po is usually added at the end of a sentence, for example \"Salamat po\" means \"thank you.\" Also, use opo to say \"yes.\" This is basically the equivalent of saying \"yes, ma'am\" or \"yes sir.\""
    },
    {
      "title": "Shake people's hands.",
      "content": "Shake people's hands. In Filipino culture it is generally best to shake hands with someone that you are meeting for the first time. This is usually a soft hand shake, not an overly firm one. [5] X Research source Greeting someone you just met with a kiss on the cheek or a hug is not usually done. This is most often reserved for once you have developed a relationship. [6] X Research source If you are in a Muslim area of the Philippines, then the rules for touching, especially between men and women, may be different. Shaking hands may still be appropriate but men may need to initiate. Notice what others are doing around you and follow their lead. [7] X Research source"
    },
    {
      "title": "Consider using a \"mano\" greeting with elders.",
      "content": "Consider using a \"mano\" greeting with elders. Filipino elders are often greeted by taking their right hand and bringing it up to touch your forehead. This is called \"mano.\" This is especially important to do with ones own family members and with those that are extremely elderly. [8] X Research source If an elderly person holds out their hand in front of their body with the palm facing down, this may be a sign that they are expecting a \"mano\" greeting. This greeting is about you respecting your elders but it is also about the elder blessing you when they touch your forehead. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Keep the conversation light and friendly.",
      "content": "Keep the conversation light and friendly. As with many people all over the world, Filipinos don't necessarily want to talk about politics or serious topics with strangers. Instead, focus your conversations on the joys of life: family, food, and fun. This will make getting to know this new person more enjoyable. In general, Filipinos love to laugh. They do it genuinely but they also laugh to move away from uncomfortable topics or to break tension. Be aware of this and be willing to change the subject if you notice this cue. [10] X Research source"
    }
  ]
}