{
  "url": "https://www.wikihow.com/Imagine",
  "title": "How to Imagine",
  "steps": [
    {
      "title": "Daydream.",
      "content": "Daydream. Daydreaming is a process that helps form connections and recall information without distractions. Rather than being a mindless activity, daydreaming actually fosters a state of high engagement in the brain. Often your best ideas seem to come out of nowhere while you're daydreaming. [1] X Research source Avoid distractions like computer/video games, the internet, a movie, etc. Your brain won't be taking its much needed time-out if you're constantly plugged into distractions. Good times to daydream are in the morning right before you have to get up, or at bedtime before you fall asleep. Taking a walk, without any distractions like your phone or music, also fosters daydreaming."
    },
    {
      "title": "Improve your visual working memory.",
      "content": "Improve your visual working memory. For those who cannot imagine anything, the best starting place is working on your visual working memory, as visual working memory arguably determines your ability to imagine sth: ultimately to imagine something, you have to be able to hold an image in your mind's eye for a period of more than five or so seconds and potentially hold several items in your visual working memory. Visual working memory is something we can all improve: the most useful exercise for this is Dual n'Back which has been proven to improve working memory. Many Dual N'Back apps and websites exist online. Train at the limit of your ability to improve working memory and adjust settings where possible to maximise the interval time in seconds between stimuli: this way you will be training yourself to hold items in your working memory for longer where you can manipulate them. To see a noticeable difference, you must train over a period of several weeks, trying where you can to do the exercise for at least 20 minutes. Practise memorising and evoking various colours simultaneously in your mind's eye, as your ability to recreate colour in part corresponds to the vividness of your imagination. Additionally, you can improve your episodic memory by memorising clips of films, then attempting to replay the film in your head as you close your eyes: walking around your local neighbourhood, you can apply the same techniques as you attempt to memorise what you see."
    },
    {
      "title": "Seek out new experiences.",
      "content": "Seek out new experiences. Being open to having new experiences can foster an openness to emotions and to fantasy, as well as stimulating intellectual curiosity. It also, simply provides more opportunities for daydreaming (whether you're planning a travel adventure, or you're experiencing a new kind of cooking class) and opens up opportunities to imagine greater and different possibilities. [2] X Research source You don't have to go halfway across the world to try out a new experience. Instead, look around your community. You could take a free class, or go to a lecture. You could try learning something like scrapbooking, or gardening, or simply checking out a part of town you haven't yet explored."
    },
    {
      "title": "Observe people.",
      "content": "Observe people. Go to a cafe, or simply sit on a part bench, for a period of time and watch the people who go past. Making up stories about them, being curious about other people, fosters your imagination and gives it practice, while also foster empathy. Some of your best, most creative ideas will come from simply watching people. [3] X Expert Source Dan Klein Improvisation Coach Expert Interview. 22 March 2019."
    },
    {
      "title": "Make art.",
      "content": "Make art. It doesn't matter what kind of art you decide on but do something that allows you to express yourself. Don't bind your art with limitations and things that it should be. If you're painting, for example, and you paint a green sun instead of a yellow one, that's okay! Use your imagination to take you outside the box. You could do any kind of art from writing poetry, to doing pottery, to building. Remember, you don't have to be amazing at the art. This is about fostering your imagination, not making you a world-class painter."
    },
    {
      "title": "Avoid being overloaded by media.",
      "content": "Avoid being overloaded by media. While media like movies, t.v. shows, everything on the internet, computer and video games, can be great and fun, overloading on media can diminish your creativity, your imagination and your inner space. People, especially children growing up now, are being turned into consumers, not creators. They're being fed pictures and images and vision that someone else has created and presented for them. This means, limit your consumption of media: don't immediately turn on the t.v. or computer when you're feeling bored. Take a moment of quiet time for yourself and practice letting your imagination loose."
    },
    {
      "title": "Find creative solutions.",
      "content": "Find creative solutions. Once you've gotten into the habit of using your imagination, you'll need it to help you come up with creative solutions for problems that you face. This means trying to come up with solutions that are outside the norm. [4] X Research source One problem that most people have is \"functional fixity\" or the way your brain can only come up with the function of an object as the one for which it was designed (for instance a pair of pliers). In an experiment, people were told to get a rope that was hanging from the ceiling to touch two opposite walls. The only other item in the room was a pair of pliers. Most people did not come up with the solution: tie the pliers to the rope and use that as a weight to swing the rope between the walls. Practice coming up with alternate uses for objects around your home. When confronted with obstacles, let your imagination try out some of the wackier possibilities to see what might actually work. Remember, just because something is intended for one purpose, does not mean that it can't be used for others."
    },
    {
      "title": "Free yourself from the possibility of failure.",
      "content": "Free yourself from the possibility of failure. Sometimes your imagination gets really stuck and it is hard to unlock it, especially if you're not very good at, or haven't practiced using your imagination. There are a couple tricks to help unlock your imagination so you can use it to help you think outside the box. Ask yourself how you would approach the problem if it were impossible to fail. Consider if you might try a riskier solution if there were no consequences. Ask yourself what you would do first if you had access to any resources you needed to approach the problem. Ask yourself who would you approach to help you solve your problem if you could ask anyone in the world. Answering these questions will free your mind from the possibility of failure, which in turn will open up the potential solutions from your imagination. Not every solution you come up with in this manner is going to be feasible, but you will improve your imagination capabilities and you'll be surprised by the solutions that you do come up with."
    },
    {
      "title": "Visualize.",
      "content": "Visualize. Using your imagination to visualize can greatly help you improve your life. You can use this for things like imagining yourself getting the promotion that you want before you go ask for it, to picturing finishing that marathon that you're training for. The more specific and detailed your visualization, the more successful you'll be at achieving it and not getting stopped by the possibility of failure."
    }
  ]
}