{
  "url": "https://www.wikihow.com/Improve-Your-Stride",
  "title": "How to Improve Your Stride",
  "steps": [
    {
      "title": "Count your steps per minute.",
      "content": "Count your steps per minute. Time yourself running for 60 seconds. As you run, count how many times your feet strike the ground. [1] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Calculating how many steps you take per minute will give you an idea of what your cadence currently is and how much you need to improve. Most runners have a cadence of 150-170 steps per minute, while elite runners will often have a cadence of over 180. [2] X Research source A stride is two steps—one by each foot. Divide your steps per minute by two to find your stride per minute. Most running analyses use steps per minute, but you may find strides per minute more convenient for your training."
    },
    {
      "title": "Film yourself running.",
      "content": "Film yourself running. You only need a few minutes of film. Find a track or a treadmill where you can run at your optimal speed. It is best to ask a friend or a coach to hold the camera for you. You can also try using a tripod, although it may not catch the full length of your run."
    },
    {
      "title": "Review the film of your running.",
      "content": "Review the film of your running. You may need to watch the footage several times. Upload the video onto a computer or TV so that you can see your form in large detail. When reviewing the footage, pay special attention to your knee, head, and shoulder placement. You may compare your running form to professional and elite runners. You will need to correct any mistakes in form or style before you can start to improve your stride. Ask yourself: How high do you drive your knees? What is your posture like? How fast are you running?"
    },
    {
      "title": "Watch your foot strike.",
      "content": "Watch your foot strike. Do you land on your forefoot, midfoot, or heel? While there is some debate on what is the best foot strike, it is generally agreed that you should avoid landing on your heel. [3] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. You may need to reform your foot strike to a more consistent style. A forefoot strike will cause the least amount of shock on your body. You land on the balls of your feet before rotating back on your midfoot or heel. Your foot will rotate forward again to propel your next stride. A midfoot strike spreads the impact throughout your foot. It will look like you are landing flat on your feet or that you are landing on both the ball and heel of your feet. A good midfoot strike will land on the outside of the foot. [4] X Research source A heel strike can cause stress and injury. Your foot will land on the heel and rock forward to propel your body on the ball of your foot."
    },
    {
      "title": "Examine your form.",
      "content": "Examine your form. If you do not have not a good form, you may not be reaching your full running potential. [5] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Each time you watch your video, look at a different part of your body, and see if you need to correct any mistakes. Your head should be looking straight ahead, not down at your feet or at the track. Your shoulders should be down and relaxed, not tight and scrunched up by your neck. Your arms should be relaxed, and they should be moving backwards and forwards, not sideways. Keep your arms positioned between your chest and lower waist. Your back should be straight. You should be leaning slightly forward, centered over your hips. You should not be leaning back. [6] X Research source"
    },
    {
      "title": "Determine your running style.",
      "content": "Determine your running style. Different styles of running will require different techniques. Training is a highly individual process, and what works for some may not work for others. Understand what your needs are so that you can improve your stride using the techniques best for you. Sprinters will want to increase their stride length. High knee lifts and hip exercises will be most beneficial. Mid-distance runners may want to improve both stride length and rate. They will need to focus on glute, hamstring, hip, and core exercises. Endurance runners may want a shorter stride length and a faster stride rate. They will want to work on core, glutes, and hamstrings. If you’ve had an injury, you may want to avoid widening your stride length, focusing instead on proper form and stride speed."
    },
    {
      "title": "Improve your posture.",
      "content": "Improve your posture. Even when you are not running, you should try to keep good posture. This will naturally improve your form when running. When you stand, keep your back straight and your shoulders rolled back. Try to work standing up if you can to naturally strengthen your back muscles."
    },
    {
      "title": "Stretch before running.",
      "content": "Stretch before running. Dynamic stretching exercises are a good warm-up for running. [7] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. These increase your range of motion and help prepare your muscles for exercise. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Dynamic stretches include: Shoulder circles: slowly move your shoulders forward in a circular motion. Do ten times before rolling them backwards in a similar motion. Side bends: Stand straight with your legs apart. With a straight arm, reach down the side of your legs before coming back to the center. Repeat with the other side of your body. Hip circles: Put your hands on your hips. Make a circle with your hips, keeping your legs and torso still. Leg swings: Balance your weight on your left side of your body. Swing your right leg back and forth rapidly. (You can balance your left hand on a wall if necessary). Do 6-10 times before switching to your other foot. Leg bouncing: Brace your hands against the wall. Quickly bounce on the on the balls of your feet. Your heels should be lifting from the ground. [9] X Research source"
    },
    {
      "title": "Strengthen your arms.",
      "content": "Strengthen your arms. Your arms are an underutilized force that will balance and push you forward. Strength training may be able to increase your overall energy, running economy, and endurance. Try to have two training sessions a week. Some exercises you can try are: Bench press: Lie on a bench with two dumbbells extended above your shoulders. Lower one dumbbell to shoulder height, and slowly lift it back up until your arm is straight. Lower the other dumbbell in the same manner. Bicep curls: Hold a dumbbell in both hands. Stand straight with your elbows near your torso and your palms facing forward. Curl one arm up slowly. Wait a second before lowering it back down. Repeat with the other arm. [10] X Research source Dumbbell squat to press: Hold a dumbbell in both hands at shoulder height. Slowly lower into a squat. Rise back up, stretching the dumbbells above your head. Your arms should be straight above your head. Lower the weights back to shoulder height before repeating."
    },
    {
      "title": "Train your core.",
      "content": "Train your core. Core exercises will increase your energy and provide essential stability to your running. These exercises will often not just give your abs strength, but they can also strengthen your hips, glutes, and legs, which are essential components for a good stride. Some good core exercises are: Plank: Lie down on your stomach. Lift your body until it is resting on your forearms and toes. Your body should form a straight line from your shoulders to your toes. Try to hold the pose for at least 20 seconds. Bridging: Lie back on the ground. Your knees should be bent about hip’s width apart. Relax your arms on the floor. Squeeze your glutes. Lift your hips and pelvis off the ground. Your body should form a straight slope from your knees to your neck. Hold for 10 seconds before lowering. Lunge with a medicine ball: Hold the medicine ball with both hands straight in front of your body. Lunge forward, bending the front leg and keeping the back leg straight. Move the medicine ball from right to left across your body before bringing it back to center."
    },
    {
      "title": "Keep your knees high.",
      "content": "Keep your knees high. As you run, focus on driving your knees high up into your chest. Try to keep a steady pace at first so that you can focus on how high your knees can go. There are several exercises you can do to improve knee height. Knee hugs: Stand straight with your legs slightly apart and your arms at your side. Beginning with your right leg, raise one knee as high as it will go. Grab the knee with your hands, and squeeze it towards your body. Release and slowly lower it towards the ground. Repeat with the other leg. [11] X Research source Marching Drill: March at a walking pace around your usual running route. As you step up, drive your knees up as high as you can. The more exaggerated the movements, the better. Start slowly but build up speed over several sessions. [12] X Research source Skip: Once you have mastered marching, try skipping around an exercise track. Skipping is more intensive than marching, and it will help you lengthen your stride at a faster pace. Focus on pushing yourself off, and use your arms to help drive you forward. [13] X Research source"
    },
    {
      "title": "Extend your hips.",
      "content": "Extend your hips. The hips are an important area to strengthen if you want a longer stride. While core exercises can help you open and stretch your hips, there are certain exercises you can do that will specifically target your hips. Deep lunges: Bend one leg in front of you while keeping the other leg stretched out straight behind you. Lower your body as far as it will go. As you rise, bring the back leg forward into a new lunge. Hip flexor stretch: Kneel on your right knee with your left knee bent 90 degrees in front of you. Slide your left foot forward a few inches before stretching your hips forward so that your left knee is straight over your left foot. Hold for 30 seconds before switching to the other leg."
    },
    {
      "title": "Train with bounding drills.",
      "content": "Train with bounding drills. Start with a slow jog. With each step, increase the length of your stride just a little bit. Soon, you should be leaping between each stride. Focus on propelling yourself off your feet and extending the back of your stride. [14] X Research source High skips are another type of bounding drill. Push off or jump from one leg while driving the other leg up towards your knees. It will look like an exaggerated skipping or jumping motion. As you move forward, alternate between your legs."
    },
    {
      "title": "Avoid overstriding.",
      "content": "Avoid overstriding. While it can be good to increase your stride length, you do not want to extend your stride too far. This can cause injury. Your foot should be landing beneath your body, not in front of your body. If your stride is too long, you may land on a straight leg extended in front of your body, or you may feel a harder impact on the foot. When you lengthen your stride, you should be focusing on lifting the knees and extending the back leg of the stride, not the front."
    },
    {
      "title": "Practice visualization.",
      "content": "Practice visualization. Some runners find that visualization techniques can help them mentally focus for better stride rates. Try imagining that you are running on hot coals or on spikes. This will cause you to soften your steps and increase your turnover rate. [15] X Research source"
    },
    {
      "title": "Speed up your cadence.",
      "content": "Speed up your cadence. Identify what your personal stride rate goal is. For example, if you are starting in the 160 steps per minute range, you might want to work your way up to 170. As you train continue to count your steps per minute. Try counting aloud to give yourself a beat to run to. Measure yourself several times to see what your average rate is. See if you can increase it by a few steps a day. It may take several training sessions to work your rate to a consistently higher level."
    },
    {
      "title": "Exercise your hamstrings and glutes.",
      "content": "Exercise your hamstrings and glutes. Your hamstrings and glutes are important to develop if you want to increase your speed. Many exercises target both the hamstrings and the glutes. [16] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. That said, hamstring injuries are common amongst runners. Make sure that you are practicing safe, proper techniques. Certain exercises can strengthen your hamstring while preventing injury [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Leg curl: You can find a leg-curl machine at your local gym. Adjust the machine for your height and weight preferences. Lie flat on your bench against the bench and your legs beneath the weight pad. Curl your lower legs up, keeping your upper legs flat against the bench. Lower and repeat. Superman exercise: Lie on your stomach. Extend your arms straight in front of you. Raise your arms, legs, and chest off the ground, and squeeze your glutes. Hold for two seconds before lowering. Repeat at least ten repetitions. [18] X Research source Glute-ham raise: Have a partner hold your ankles. Kneel with your torso straight. Lower yourself towards the ground by extending your knees. Hold your hands out to catch the floor, and gently propel yourself back up. You may need to practice before you are able to reach the floor. [19] X Research source"
    }
  ]
}