{
  "url": "https://www.wikihow.com/Make-Fruit-Tea",
  "title": "How to Make Fruit Tea",
  "steps": [
    {
      "title": "Choose a quality black tea that doesn't have flavours added to it.",
      "content": "Choose a quality black tea that doesn't have flavours added to it. You can choose your favourite black tea variety but avoid ones already flavoured with fruit or other strong flavours, as you can't be sure the fruit will meld well with them."
    },
    {
      "title": "Select the fruit.",
      "content": "Select the fruit. The best fruit is sweet and strong in flavour. For example, peaches, apricots, raspberries, watermelon, strawberries, etc. Prepare the fruit by washing, then cutting it into small pieces."
    },
    {
      "title": "Make the tea.",
      "content": "Make the tea. Use either one teabag or a teaspoon of tea leaves (inside a tea caddy or enclosure) and add these to the 950ml or 1 quart heatproof glass jar. Pour in boiling water. Let it steep for 3 minutes, then remove the teabag or enclosed leaves. Leave the fruit pieces in."
    },
    {
      "title": "Cover the jar and leave the fruit to infuse.",
      "content": "Cover the jar and leave the fruit to infuse. Stand aside for 10 minutes."
    },
    {
      "title": "Strain out the fruit.",
      "content": "Strain out the fruit. Pour the fruit tea into mugs or cups if serving hot. If serving cold, chill for a half an hour, then pour into a glass with ice."
    },
    {
      "title": "Preheat the oven to 120ºC/250ºF.",
      "content": "Preheat the oven to 120ºC/250ºF. Place one sheet of parchment paper for each of the two baking sheets."
    },
    {
      "title": "Prepare the fruit.",
      "content": "Prepare the fruit. Wash the lemons and oranges, then remove the zest using a vegetable peeler. Chop the zest finely. Peel the ginger and chop it finely as well."
    },
    {
      "title": "Place the lemon and orange chopped zests on the first baking sheet.",
      "content": "Place the lemon and orange chopped zests on the first baking sheet. Add the ginger pieces. Mix together and spread out across the baking sheet."
    },
    {
      "title": "Arrange the mint leaves across the second baking sheet.",
      "content": "Arrange the mint leaves across the second baking sheet."
    },
    {
      "title": "Place both baking sheets into the preheated oven.",
      "content": "Place both baking sheets into the preheated oven. Bake the mint leaves for about 10 to 15 minutes. Bake the zest and ginger mixture for about 45 minutes. Once baked, remove and set aside to cool down."
    },
    {
      "title": "Use your fingertips to crumble the mint leaves into a bowl.",
      "content": "Use your fingertips to crumble the mint leaves into a bowl. Add the baked zest and ginger mix to the same bowl. Finally, add the chopped dried fruits. Add the ground cinnamon. Stir everything together. The tea mixture is now made."
    },
    {
      "title": "Make dried fruit tea.",
      "content": "Make dried fruit tea. To make up the tea, add 2 tablespoons of the dried fruit tea mixture per cup into the teapot or steeping container and pour full with boiling water. Allow to steep for 5 minutes. Before serving, strain out the dried fruit mixture."
    },
    {
      "title": "Add 1 tablespoon of dried apple to the cup or mug.",
      "content": "Add 1 tablespoon of dried apple to the cup or mug. Repeat for each cup being made."
    },
    {
      "title": "Pour in boiling water.",
      "content": "Pour in boiling water. Set aside to steep for 10 minutes."
    },
    {
      "title": "Serve.",
      "content": "Serve. You can choose to strain out the dried apple or to leave it in and spoon it out and enjoy eating when the tea is finished. A little sprinkle of cinnamon can give this tea a delicious zing."
    },
    {
      "title": "Prepare the lemon.",
      "content": "Prepare the lemon. Wash the lemon and dry it. Grate a little of the lemon peel to create thin parings. Then, cut 3 to 6 fat slices of lemon from the lemon. You'll need a few parings per cup or mug, and 3 slices of lemon per cup or mug."
    },
    {
      "title": "Boil some water.",
      "content": "Boil some water. You'll need one cup of water for each cup of tea."
    },
    {
      "title": "Pour the water into the mug or cup.",
      "content": "Pour the water into the mug or cup. Add some lemon peel parings and 3 slices to the cup or mug. Do the same for each cup of tea being made."
    },
    {
      "title": "Allow to steep for 3 minutes.",
      "content": "Allow to steep for 3 minutes. Steeping refers to letting the ingredients stand in the water, untouched, allowing the flavours to infuse through the water."
    },
    {
      "title": "Stir well.",
      "content": "Stir well. Strain out the lemon ingredients. Sweeten to taste, if desired. It doesn't need sweetening if you don't mind the taste of just lemon but if you find it a little sour, a teaspoon of sugar or other sweetener can serve well. Honey can be a nice addition if you have a sore throat or cold, or just because you love the flavour of honey."
    },
    {
      "title": "Serve immediately.",
      "content": "Serve immediately."
    },
    {
      "title": "Fill a cup 3/4 with boiling water.",
      "content": "Fill a cup 3/4 with boiling water."
    },
    {
      "title": "Pour in the fruit squash so your cup is full.",
      "content": "Pour in the fruit squash so your cup is full."
    },
    {
      "title": "Add sugar (optional).",
      "content": "Add sugar (optional)."
    },
    {
      "title": "Carefully pour in the lemon juice (optional).",
      "content": "Carefully pour in the lemon juice (optional)."
    },
    {
      "title": "Sit back, relax and enjoy a cup of squash or cordial fruit tea.",
      "content": "Sit back, relax and enjoy a cup of squash or cordial fruit tea."
    }
  ]
}