{
  "url": "https://www.wikihow.com/Make-a-Freddy-Krueger-Glove",
  "title": "How to Make a Freddy Krueger Glove",
  "steps": [
    {
      "title": "Refer to Things You'll Need.",
      "content": "Refer to Things You'll Need. Gather all of the supplies together that you will need to make your glove. You can find the list of things you will need near the end of the page. It doesn't matter if the glove is a righty or lefty. Freddy wore his glove on the right, but you can wear it on the left if it will be more comfortable for you. Choose whatever color glove you like. Brown is a good choice, if you want it to look more authentic."
    },
    {
      "title": "Stack 2 sheets of silver paper.",
      "content": "Stack 2 sheets of silver paper. Make sure you can only see the silver side. In other words, put the bland, pale sides to each other so you don't see them. Glue or tape the sheets of silver paper together securely so the paper won't slide around while you are trying to cut it."
    },
    {
      "title": "Cut four 7 inch (17.8 cm) long blades out of the stack.",
      "content": "Cut four 7 inch (17.8 cm) long blades out of the stack. Create four pairs of two pieces of silver paper each. Then cut a 1 inch (2.5 cm) gap at the beginning of each blade in every pair so there are little \"arms\". You will need to do this or you will not be able to attach your blades to the fingers of the glove. The blades should be long, thin, and slightly curved. Cut them out into a banana-like shape, with one that is very pointy. The arms will allow you to glue each arm to each side of the gloves finger. If you want, you can stroke the end of the blades with a red permanent marker and add dots for a splattered blood effect."
    },
    {
      "title": "Take a pair of blades and put 1 on each side of a popsicle stick.",
      "content": "Take a pair of blades and put 1 on each side of a popsicle stick. Make sure they are even. Then tape the blades together so they cover the stick."
    },
    {
      "title": "Duct tape the pair of blades to the first finger.",
      "content": "Duct tape the pair of blades to the first finger. Then duct tape the sides of the blade to the fingers to sturdy them. Only make the side strip 2 inches (5.1 cm). Then repeat until all four fingers have blades. Consider painting the duct tape to match the color of the glove."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Before beginning gather everything you will need to make your glove. You will find a list of things needed for this method near the bottom of the page. Once you have begun, it may be frustrating if you have to stop to find something you need. Make sure you have the glove you want. Brown will be more authentic, but you can choose any color you like. You will need you glove, scissors, some strong glue, thin cardboard (such as that you might find for a cereal box), and if you want to paint the pieces then silver paint. You could also use shiny silver paper. If you want to rough up the appearance of the glove, you can use a piece of sandpaper."
    },
    {
      "title": "Rough up the glove.",
      "content": "Rough up the glove. In the movie, Freddy’s glove does not look new. If you wish to, you can use a piece of sandpaper on the glove to make it look a bit more used."
    },
    {
      "title": "Create your finger pieces.",
      "content": "Create your finger pieces. You will need to trace out a total of 8 different pieces for the fingers, plus a “cover” for the hand piece. Remember, the thumb is left completely free, with no pieces covering it, except the glove. First, draw out a piece for the hand. You want the cardboard to be large enough to cover the back of the hand. The shape should be roughly the size and shape of the back of your hand, so a somewhat rounded square shape. Then, draw out a piece for each of the lower halves of your finger. This piece of cardboard will need to cover your finger between your knuckles and the middle of your finger. Draw the pieces so that they will be wider than each of your fingers and can be folded in half over the glove (you will glue them on later). For the bottom part of your finger, you can measure the cardboard out so that it is the length of your finger from your knuckle to the middle of your finger, where the joint is. Draw out finger pieces for the top of the fingers. These will be slightly smaller than the pieces for the bottom half of your fingers, but should still be wide enough so that they can wrap around the glove, and be attached with glue. The pieces will be shaped in a rounded rectangular shape so that the will be long enough to cover each half of your finger, and wide enough to wrap around your knuckle. They don’t have to wrap all the way around, but you want the sides of the fingers to be covered. For the top finger piece, you should measure the cardboard so that it will extend from the middle joint of your finger to the top of your finger, where you will attach the blade."
    },
    {
      "title": "Cut out the pieces.",
      "content": "Cut out the pieces. Once you have finished drawing the pieces, cut them all out carefully with scissors. [3] X Research source Before gluing them, put the glove on the hand you plan to wear it, and make sure that each piece lines up on the glove properly, and that it is wide enough to wrap around the finger of the glove. If one is too small, or shaped incorrectly, simply draw another one, and try again."
    },
    {
      "title": "Glue the finger pieces to the glove.",
      "content": "Glue the finger pieces to the glove. This may be easiest if you put the glove on while you work. Consider wearing a rubber glove underneath to create a barrier between your skin and the glove in case any glue seeps through. Begin by gluing the hand piece to the back of your hand. Then glue each of the bottom finger pieces on, make sure that they are folded over your finger, and are glued securely. Finish by gluing each of the top finger pieces. If you like, you can let the top finger pieces overlap on the bottom pieces where the joint is to make it appear as though they are connected with rivets. Allow the glue to dry completely."
    },
    {
      "title": "Paint the hand and finger pieces.",
      "content": "Paint the hand and finger pieces. In the movies, Freddy’s glove is usually an old copper color. You can paint the pieces of cardboard to make it appear more authentic. [4] X Research source Mix together some gold paint with a bit of red or orange paint to make a coppery color. You can also paint small black dots onto each of the pieces, which will look like rivets. [5] X Research source Paint each piece of cardboard, and allow to dry. Before continuing with the project, the paint must be completely dry."
    },
    {
      "title": "Draw the blades.",
      "content": "Draw the blades. If you like, you can use cardboard that is a bit thicker for this step, or you can simply use the same cardboard as you did for the finger pieces. You will need four blades for each of your fingers (minus the thumb). These blades should be about 7 inches long (17.8 cm) and shaped sort of like a banana. That is, each one should be slightly curved. Make them pointy on the edge, but not too pointy! You don’t want to injure yourself or someone else with the blade."
    },
    {
      "title": "Paint the blades.",
      "content": "Paint the blades. You can either paint each blade with silver paint, or you can cover each piece of cardboard in shiny silver paper. [6] X Research source You might also consider using a bit of red paint or a red marker on the edge of the blade to make it appear as though there is blood on it. If you choose to paint each blade, make sure the paint is completely dry before moving on."
    },
    {
      "title": "Glue the blades to the glove.",
      "content": "Glue the blades to the glove. Lay the glove flat on your workspace, and then glue the back edge of one blade to the side of one finger. Repeat this with each blade until all four finger have one. If you want to reinforce the blades, you can put the glove on, and carefully wrap a strip of duct tape or electrical tape to the glove, and then paint the tape with the copper paint you used on the finger pieces to disguise it. If you do this, be careful not to wrap the tape to tight around your fingers! Otherwise, you may cut off the circulation in your fingers."
    }
  ]
}