{
  "url": "https://www.wikihow.com/Make-New-Friends-Quickly",
  "title": "How to Make New Friends Quickly",
  "steps": [
    {
      "title": "Try a new activity.",
      "content": "Try a new activity. [1] X Expert Source Katie Styzek School Counselor Expert Interview. 28 October 2020. Taking up a new activity or enrolling in a course on something you've always wanted to try not only gets you out there and doing something new but also opportunities to meet NEW people. [2] X Research source Activities, workshops, and classes are a great way to meet people quickly. The nature of the activity or course forces engagement with the other participants and will help turn everyone into fast friends. You also have a ready-made icebreaker in the activity itself! Reader Poll: We asked 131 wikiHow readers, and 54% agreed that the most appealing activity or group to make friends in is a club or sports team related to your interests and passions . [Take Poll]"
    },
    {
      "title": "Join meet-up groups.",
      "content": "Join meet-up groups. You can find different groups on various social networking sites, such as Meetup.com. There are a ton of interest-specific groups out there, including groups for writers, vegetarians, board game lovers, cyclists, runners, and so on. [3] X Expert Source Katie Styzek School Counselor Expert Interview. 28 October 2020. You should be able to find a groups that corresponds to one of your passions! [4] X Research source Group meetups usually happen each month and will probably include generally the same people each time but with a few new additions here and there."
    },
    {
      "title": "Accept opportunities and invitations to go out.",
      "content": "Accept opportunities and invitations to go out. Going out with your current friends increases the likelihood that you're going to meet other people and expand your social circle. Remember that you can't make friends staying at home by yourself! Good invitations to accept are ones involving parties with big crowds. These include birthday parties, holiday parties, housewarmings, weddings, among lots of other functions. This is a sure-fire way to meet lots of new people and potentially make new friends."
    },
    {
      "title": "Join an online community.",
      "content": "Join an online community. The internet can be a great way to meet new people instantly and in real time, as long as you do so safely. Try frequenting online forums related to your interests. Participate in the conversations and add value to the discussions. Over time, you'll come to know these people as friends and you can always arrange to meet up on Skype or in-person down the line. Remember to be safe. Don't disclose any personal information about where you live or how to contact you. Use your discretion about what you put on the Internet and make available to the world."
    },
    {
      "title": "Reach out to acquaintances and contacts.",
      "content": "Reach out to acquaintances and contacts. Do you have any casual friends that you've lost touch with? For example, what about friends that changed schools or jobs or are just involved in different activities than you? Maybe consider dropping them a friendly text or Facebook message saying \"hi.\" If they respond positively, maybe suggest a meet up in the near future. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Looking for opportunities to reconnect with people you once knew casually is a great way to build new friendships quickly. You already know something about each other so it's not like you're building a friendship from the ground up. In general, it's easier to turn people you know casually into real friends than it is to meet someone totally new and build a friendship."
    },
    {
      "title": "Get to know friends of friends.",
      "content": "Get to know friends of friends. Expand your social circle by becoming friends with your existing friends' friends. This is another way to build a friend network quickly. Plus, you'll already have something in common: your mutual friend! [6] X Research source Ask your friends to bring someone they think is cool to a party or social gathering and have them introduce you. Chances are that if you like your friend, you'll probably like most of your friend's friends too."
    },
    {
      "title": "Break the ice.",
      "content": "Break the ice. Once you've put yourself out there and actually met someone new, you need to make the first move to turn the meet-and-greet into a real friendship! Say hello and share something about yourself, then give the other person the chance to say something about herself. [7] X Research source Start with something easy and casual, like how she knows the hostess if at a party, or whether she got caught in the rain that day. Once the ice is broken, making a real and more meaningful connection will be easier."
    },
    {
      "title": "Multi-task.",
      "content": "Multi-task. Starting and keeping up a conversation requires multi-tasking. You need to make and hold eye contact (but not in a creepy way!), smile, look pleasant and open, and say something clever. Doing all these things at the same time sends out a good vibe to the people around you and shows them that you are someone worth being friends with."
    },
    {
      "title": "Don't ask too many questions.",
      "content": "Don't ask too many questions. Although asking questions of potential new friends shows that you're interested in them and what they have to say, don't appear like you're launching an investigation. No one wants to feel like they're under the spotlight or in the middle of some sort of investigation; this is one of the easiest ways to make someone feel uncomfortable. Intersperse questions with statements or comments. For example, when they tell you what they do for a living, maybe ask them a question about how they got into their careers and then share an anecdote about how you got into yours."
    },
    {
      "title": "Talk like you're friends.",
      "content": "Talk like you're friends. Make statements that include both you and the person you're talking to in a group; this is great way to establish a sense of rapport, camaraderie, and intimacy, as though you've known each other for longer than you really have. These statements might be something like \"I don't know about you, but I'd die for a burger right now\" or \"I think we can both agree that this DJ is the worst, right?\" Research has shown that talking like friends is important to making \"fast friends,\" so to speak, because it creates a sense of interpersonal closeness. [8] X Research source"
    },
    {
      "title": "Don't brag or tout your own horn.",
      "content": "Don't brag or tout your own horn. If you want to let a new person know how cool you are, go for subtlety over blatant self-promotion. You don't have to necessarily downplay your accomplishments, but don't turn the conversation into a list of your Top 10 achievements. This is boring for other people and suggests to them that you're not looking for friends, but followers. For example, let other people know about one really incredible thing you've done - like climbed one of the world's tallest mountains or lived for a year in China. This might capture their interest and make them want to talk more to you."
    },
    {
      "title": "Be funny and outgoing.",
      "content": "Be funny and outgoing. An extroverted personality and sense of humor attracts people to you. In addition, people are more likely to trust you when you show them that you trust them enough to be able to laugh at yourself. By being open, other people will want to mirror that and be open with you in turn! Try telling a story about something embarrassing or funny that happened to you. One good type of story to tell would be one that is very relatable, such as a story about getting lost when traveling or rushing to get somewhere. Usually everyone can relate to these types of stories and this is one way to start building a sense of connection between you and these new acquaintances."
    },
    {
      "title": "Use the \"Fast Friends\" protocol.",
      "content": "Use the \"Fast Friends\" protocol. This is a scientifically proven procedure for making friends quickly through conversation. Researchers have developed a technique that will help two people become close friends with almost anyone in less than 60 minutes. This technique works best when you meet someone one on one, so it is ideal for situations like meeting someone for coffee or at a party. Basically the key is that both individuals need to gradually disclose personal information using a set of predetermined and incremental questions. [9] X Research source Begin by asking something that is just slightly personal. Make sure that you relate the question to what you are currently talking about. For example, if the other person is discussing an unpleasant phone call she recently made, ask, “When you make a telephone call, do you rehearse it beforehand?” After your new friend answers, it's your turn to reveal something personal about yourself, such as “I actually practice a bunch of times before I call someone I don't know that well.” Don't ask questions that are too personal too quickly after the beginning of the conversation. This can be perceived by your conversational partner as off-putting and unpleasant. Start off easy and work towards more personal questions. After around 30 minutes of talking, you can start asking deeper questions, such as “What is your most terrible memory?” or \"When was the last time you cried in front of someone else?” By starting with the easier but still personal questions, the progression to deeper and more probing questions will be more natural because there will by that point be an established sense of closeness as more and more information is revealed. Other questions used by researchers include: Would you like to be famous? In what way? When did you last sing to yourself or to someone else? Do you have a secret hunch about how you will die? If you could change anything about the way you were raised, what would it be? If you could wake up tomorrow having gained any one quality or ability, what would it be? [10] X Research source Remember to reveal as many personal things about yourself as your new friend is telling you. If you are also sharing about yourself, the other person will become more comfortable opening up to you. In the end, you'll have a new, close friend after 45-60 minutes! [11] X Research source"
    },
    {
      "title": "Make sure to \"pick up\" your new friend.",
      "content": "Make sure to \"pick up\" your new friend. Irrespective of whether you've had a long or short chat, you want to make sure you will see this person again before your time runs out. Try inviting her out for something in the near future. Say, for example, \"Would you like to come to __________ tomorrow?\" or \"I'm doing __________ later. Want to join?\" If she responds positively, then you've secured some of their time for the near future, which is key to creating a quick friendship. [12] X Research source"
    },
    {
      "title": "Connect and open up.",
      "content": "Connect and open up. Although you may have met new people and had conversations with them, there's no guarantees that you've actually become friends immediately. Instead you need to create a sense of interpersonal closeness. Bond with each other over the things you have in common. Finding those connections and commonalities usually makes a friendship stronger because you realize you share something that most people don't. You'll also both feel more understood in the world. [13] X Research source For example, maybe you both love the same TV show and are the only two you know who actually watch it or maybe you both are in the same profession and can talk shop with each other about your daily trials and tribulations. Finding these moments is what brings a friendship to fruition. Of course, this connecting means that you have to open up about yourself, even perhaps the things that you don't usually like to talk about (like your parent's divorce or a childhood illness or trauma). You don't have to reveal everything at once, but once you do you'll realize that it can be refreshing to talk to someone and have them accept and embrace you. Be sure not to draw away from the other person if they want to have more deeper conversations. Remember that friendship is about giving and receiving. [14] X Research source"
    },
    {
      "title": "Spend time together.",
      "content": "Spend time together. Seeing the other person is key to a growing friendship. Sometimes this will be easy enough if you both do an activity together. But be sure to also propose get-togethers and hang-outs outside of that commitment. Don't be bummed out if you don't start hanging out all the time. With some people, you might fall into an almost immediate routine of seeing each other all the time. With others, the one-on-one time might be less frequent due to work, school, family or other commitments. Making the effort to make plans is what's key here. This step is ongoing. You need to keep spending time with someone to make a friendship strong and lasting. [15] X Research source"
    },
    {
      "title": "Keep in touch when not together.",
      "content": "Keep in touch when not together. Staying in contact when you're not hanging out is one way to solidify a new friendship. Keep up with new friends by sending them texts or asking how their weekends were if you haven't seen them in a few days. This shows that you're invested and interesting them and maintaining the friendship. Don't overdo it. Don't be a needy friend. Give them a bit of time if they don't write back immediately; not everyone texts all day, every day. Once you have a better sense of how your new friend communicates, keep in touch in a manner that respects their boundaries. [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Do, however, show your new friend that you care. For example, if she mentioned at your first meeting that it's her birthday the following week, send her a 'happy birthday' text or email. This shows her that you cared enough to remember and starts to establish you as a legitimate friend who remembers the important things after only a week!"
    },
    {
      "title": "Have fun!",
      "content": "Have fun! One thing that separates a friendship from an acquaintance is that you have a shared history with this person, a history filled with memorable experiences. It's those experiences, adventures, and memories that will bind you together. So have fun! That what's will truly make a friendship! Plan fun outings and trips together. How often have you heard of people doing on a camping trip together who are at first casual friends and then come back and seem to be a tight group? It's time to make your own \"Remember the time we...\" stories."
    },
    {
      "title": "Be a good friend.",
      "content": "Be a good friend. This may seem obvious, but it's not an easy concept. A friendship will blossom if each person shows to the other that they are dependable, reliable, trustworthy, supportive, and caring. These are classic friend traits and ones that make a friendship last. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You don't have to be perfect but you do have to try, especially with new friends."
    }
  ]
}