{
  "url": "https://www.wikihow.com/Give-Good-Advice-to-Your-Boyfriend",
  "title": "How Can I Give My Boyfriend Advice? 10 to Ways Help Him (Without Making Him Feel Bad)",
  "steps": [
    {
      "title": "You want to make sure you’re working with the correct information.",
      "content": "You want to make sure you’re working with the correct information. Ask your boyfriend questions⁠, or rephrase what he’s saying to you in your own words⁠—this will allow you to get to the heart of the issue and figure out exactly what he’s struggling with. The more information you have, the better advice you can offer⁠—plus, your attention to detail will show him that you’re taking this seriously. You could start with general questions to open up the conversation, and make them more specific as you learn more. For instance, you could try asking “How has your workload been lately?” or “Are you feeling okay about the family get-together?” to get an overall feel for your boyfriend’s mood. Then, you could say “So you’re still trying to figure out how to ask for a raise?” or “So it sounds like your sister still doesn’t want to show up?”"
    },
    {
      "title": "Remember that your boyfriend’s personality and situation are unique to him!",
      "content": "Remember that your boyfriend’s personality and situation are unique to him! Even if there’s a piece of advice that you think is best, or that tends to work the most for you, he might be better suited to trying another solution. [1] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. In other words, rather than making assumptions about what’s going to work best, try to take on your boyfriend’s perspective and think about how he tends to operate. [2] X Research source If you know your boyfriend tends to dislike conflict, for instance, avoid suggesting that he confront his roommates immediately about being too loud. Instead, consider bringing up options that he might feel more comfortable with, like finding a mediator or switching rooms."
    },
    {
      "title": "Make sure he's looking for solutions and wants your input.",
      "content": "Make sure he's looking for solutions and wants your input. If your boyfriend is in a tough place or dealing with a sensitive issue, it might be safer to check in about giving advice beforehand. [3] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. He may just want to vent! Even if he doesn’t end up asking for your advice, he may express his gratitude that you’re looking out for him. [4] X Research source For instance, if your boyfriend isn’t feeling too confident about his weight, you could check-in and ask, “Would it be okay if I gave you some health advice?” or “Hey, would you be open to hearing my thoughts about your diet?”"
    },
    {
      "title": "You want him to go with the advice that works best for him.",
      "content": "You want him to go with the advice that works best for him. Though all of your advice might be great, presenting your boyfriend with a couple of possibilities allows him to choose what he’s most comfortable with. He’ll really appreciate the effort you’re putting in by considering all of the different sides of the issue⁠—and this could even jump-start him to brainstorm and explore other ideas of his own! [5] X Research source For example, try saying, “I feel like you could either be upfront right now about your roommate issues, or wait maybe 1 more week to see if it gets better. But if you want to avoid confrontation, I guess you could even consider just dealing with it for the last month.”"
    },
    {
      "title": "This helps you avoid coming on too strong.",
      "content": "This helps you avoid coming on too strong. You could bring up the topic more broadly to see how your boyfriend responds⁠ and whether he might be open to advice. Then, gauge the situation to decide if you should work up to more specific feedback. If your boyfriend is having some spending issues, for example, consider starting with “How’s budgeting been going recently? I know you mentioned before that it’s kind of tricky for you.” instead of saying something like “I think you need some help managing your finances.”"
    },
    {
      "title": "Your boyfriend might feel more empowered if it’s a team effort.",
      "content": "Your boyfriend might feel more empowered if it’s a team effort. You can still give your best advice, but consider talking through possible paths together, and even deciding on the next steps (rather than just giving advice and leaving the rest up to your boyfriend). This way, there’s less of a chance that your advice will come across as one-sided⁠. Instead, you’re in it together and fully there to help him work through the issue⁠—and you’ll come out of it with a stronger couple bond, too! For example, if he’s stressed about how to deal with a workplace bully, discuss what options would be best for him before coming to a collective decision."
    },
    {
      "title": "Telling him you relate helps him feel less alone.",
      "content": "Telling him you relate helps him feel less alone. Share a time you went through something similar, and then explain how you dealt with it and why you think that solution would also benefit him. You’ll decrease the chance that your advice seems abrupt or out of the blue because you’re grounding it in your own experience. In the process, the two of you will also learn more about each other and deepen your emotional connection. [6] X Research source You could say, “I remember when I felt insecure about my appearance, too. It was hard, but what I ended up doing was…” Or try saying, “I totally get what you mean. It really helped me to schedule a time with them to just sit and talk it out at the cafe. Maybe you could try that too?” Be careful about making the advice about yourself, since your goal is to help your boyfriend as much as possible⁠—don’t spend too much time on your own story!"
    },
    {
      "title": "Pointing out his positive qualities can make your advice more gentle.",
      "content": "Pointing out his positive qualities can make your advice more gentle. [7] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. If you’re worried about offending your boyfriend, make sure he knows you appreciate how great he is by complimenting him and using positive, uplifting language in general. By pairing your advice with positive comments, you’ll come off as supportive rather than accidentally harsh, and he’ll be more receptive to your words because he senses that you truly want the best for him. [8] X Research source For example, you could say, “You’ve been working so hard lately. I just miss you and want to spend more time together! Do you think you could try to reduce your hours by a bit? Or you could express trust in his judgment by saying, “You’ve been handling the situation super well. Maybe one other thing you could try is…”"
    },
    {
      "title": "Your boyfriend might just need someone to vent to.",
      "content": "Your boyfriend might just need someone to vent to. Focusing on listening might be a good option if you’re not qualified or knowledgeable enough about the issue to provide specific, actionable advice. By just being there for him, you’re giving him a space to talk through his worries⁠. Through the process, he might even find closure or realize on his own what the best path to take is. You don’t have to be completely silent⁠—nod along and ask him for more details or clarification to let him know you’re really listening. [9] X Research source For instance, if his problem is related to a specific technical issue at work that you don’t know much about, or family issue that’s too personal for you to get involved in, you could let him know that you’re there to support as much as possible by lending an ear. You could also say, “Tell me more” if you need clarification on something."
    },
    {
      "title": "If you sense resistance, consider giving your boyfriend some space.",
      "content": "If you sense resistance, consider giving your boyfriend some space. It can definitely be hurtful to feel that he doesn’t value your input, but remember that it’s probably a tough issue for him to deal with, too. It doesn’t mean he doesn’t want your help⁠—just that he needs time to process what’s going on. [10] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. He might even feel bad that you’re stressing out on his behalf, and doesn’t want you to worry about it⁠—it could be his way of shielding you from the issue! [11] X Research source"
    }
  ]
}