{
  "url": "https://www.wikihow.com/Grow-Dahlias-in-Pots",
  "title": "How to Grow Dahlias in Pots",
  "steps": [
    {
      "title": "Select a species of dahlia that suits your space.",
      "content": "Select a species of dahlia that suits your space. Purchase dahlia tubers online or at a local garden center. Dwarf and low-growing varieties are best for container growing. Some varieties can grow as tall as 5 feet (1.5 m), so you’ll need a much larger pot if you choose a tall species. [1] X Research source Small to medium varieties include Bednall Beauty, which grow up to 2 feet (61 cm), and Bishop of Llandaff, which grow up to 3 feet (0.91 m). Larger varieties include Hadrian’s Sunlight and Twyning’s After Eight, which grow 4 feet (1.2 m) or higher. [2] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source A single tuber needs about 1 to 2 feet (30 to 61 cm) of space, so you’ll probably only need 1 per container. [3] X Research source"
    },
    {
      "title": "Pick out a pot that’s at least 12 by 12 inches (30 by 30 cm).",
      "content": "Pick out a pot that’s at least 12 by 12 inches (30 by 30 cm). Go for a heavy pot that’s at least 12 inches (30 cm) deep with a diameter of at least 12 inches (30 cm). Pots this size usually hold around 5 to 7 gallons (19 to 26 L) of soil. [4] X Research source For the largest varieties, go with a 24 by 24 inch (61 by 61 cm) pot, which usually holds around 25 gallons (95 L) of soil."
    },
    {
      "title": "Choose a heavy pot if you’ve chosen a tall variety.",
      "content": "Choose a heavy pot if you’ve chosen a tall variety. Varieties that grow 3 to 5 feet (0.91 to 1.52 m) can become top-heavy, and a lightweight pot may not be sturdy enough to support their weight. Additionally, tall varieties require a stake, which will add even more weight. [5] X Research source Plastic containers are lightweight, so go for sturdy ceramic or terracotta pots instead. Keep in mind terracotta and unglazed ceramic pots absorb water, so they can freeze and crack if they’re left out during the winter. [6] X Research source"
    },
    {
      "title": "Drill drainage holes, if necessary.",
      "content": "Drill drainage holes, if necessary. This step may not be necessary if the container already has several drainage holes that allow excess water to drain. However, if your pot has small holes or only has 1 center hole, drill a few extra holes to improve drainage. [7] X Research source Dahlias grow best in well-drained environments. While they require lots of water, their fine roots are prone to rotting if the soil is too waterlogged. Fill the bottom with 2 inches (5.1 cm) of gravel for improved drainage."
    },
    {
      "title": "Clean the pot with mild soap and warm water.",
      "content": "Clean the pot with mild soap and warm water. A dirty pot could spread disease, and hidden insect eggs may be lying in wait at the bottom of the pot. Remove these threats by cleaning the container before you plant. Gentle soap and water will do the trick. [8] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source Be sure to thoroughly rinse away all soap residue. It’s particularly important to wash the pot if you’ve used it for other plants in the past."
    },
    {
      "title": "Choose a rich, well-draining potting mix.",
      "content": "Choose a rich, well-draining potting mix. Standard potting soil alone is too porous and may lead to pour bud formation. For a good potting mix, combine 2 parts potting soil with 1 part peat moss or well-aged manure. [9] X Research source Note that garden soil isn’t suitable for container plants. Be sure you purchase potting soil labeled for potted plants."
    },
    {
      "title": "Plant your dahlia tubers in the middle of spring.",
      "content": "Plant your dahlia tubers in the middle of spring. Dahlias should be planted in spring, or from April through early June in the Northern Hemisphere. They’re are frost-sensitive, so keep the container outdoors only when there’s no threat of freezing temperatures. [10] X Research source If your area is prone to frost in the spring and you don’t want to wait to plant, start your dahlias indoors, then move them outside."
    },
    {
      "title": "Line the bottom of the pot with a thin layer of gravel.",
      "content": "Line the bottom of the pot with a thin layer of gravel. Placing gravel at the bottom of your pot also accomplishes this task, as long as you keep the layer less than 1 ⁄ 2 inch (1.3 cm) deep. [11] X Research source"
    },
    {
      "title": "Add soil to within 5 to 7 inches (13 to 18 cm) of the container’s rim.",
      "content": "Add soil to within 5 to 7 inches (13 to 18 cm) of the container’s rim. Don’t pack the soil tightly. Pour it into the container, and let it remain loose. Remember that dahlias like loose, well-draining soil. [12] X Research source Eventually, you’ll plant your dahlia tuber about 4 to 6 inches (10 to 15 cm) deep, and you’ll want to leave 1 inch (2.5 cm) between the surface of the soil and the rim of the pot at the end of the planting process. To meet these measurements, start by adding soil to within 5 to 7 inches (13 to 18 cm) of the rim."
    },
    {
      "title": "Water the soil lightly, but don’t soak it.",
      "content": "Water the soil lightly, but don’t soak it. The soil should be damp, but not so wet that it gets packed. Try using a watering can to dampen the soil instead of blasting it with a garden hose. [13] X Research source"
    },
    {
      "title": "Mix fertilizer into the top layer of soil.",
      "content": "Mix fertilizer into the top layer of soil. Dahlias need a lot of nutrients, and mixing fertilizer into the soil where the roots will develop will give your plant a head start. Use a slow-release, general purpose fertilizer, or go with an organic option, such as bone meal or seaweed fertilizer. [14] X Research source Any fertilizers recommended for flowering plants or vegetables are suitable for dahlias. You might find store-bought fertilizers with N-P-K numbers, which stand for nitrogen, phosphorus, and potassium. Good choices for dahlias include 5-10-15, 5-10-10, and 10-20-20 fertilizers. Use a fertilizer with a higher nitrogen value earlier in the season and reduce it over time. Read your product’s instructions, and use it as directed."
    },
    {
      "title": "Bury a stake in the pot to support large dahlia varieties.",
      "content": "Bury a stake in the pot to support large dahlia varieties. If you’ve selected a variety that will grow more than 3 feet (0.91 m) tall, you’ll need to support it with a sturdy metal or wood stake. Place the stake in the soil before planting the tuber. If you bury the stake after planting, you’ll risk injuring the tuber and its root system. [15] X Research source Insert the stake in the soil next to where you’ll place the tuber. Choose a stake that will touch the bottom of the pot and extend at least 3 feet (0.91 m) above the soil’s surface. For a 12 inch (30 cm) pot, go with a 4 foot (1.2 m) stake. Tie the stem to the stake loosely as it grows."
    },
    {
      "title": "Plant the tuber in the soil on its side.",
      "content": "Plant the tuber in the soil on its side. Lay the tuber down horizontally with the eye centered in the middle of the pot. The eye is where the stalk will sprout, so place the tuber on a slight angle so the eye faces upward. [16] X Research source The eye looks like a bud, and it’s located on the opposite side of the tuber’s roots."
    },
    {
      "title": "Cover the tuber with about 1 inch (2.5 cm) of pre-moistened soil.",
      "content": "Cover the tuber with about 1 inch (2.5 cm) of pre-moistened soil. Don’t bury the tuber with lots of soil just yet. Instead, cover it with a 1 inch (2.5 cm) of layer of damp soil to allow the stalk to grow."
    },
    {
      "title": "Water new sprouts lightly, but be sure not to drown them.",
      "content": "Water new sprouts lightly, but be sure not to drown them. Stick your finger into the soil to test it. If it feels moist, don’t add any more water. If it's dry, sprinkle just enough warm water to moisten the surface. [17] X Research source You don’t want the soil to dry out completely, but the young tuber will rot if you soak it. Unless you live in a hot climate, you might not need to water at all until the first shoots and leaves emerge from the soil. [18] X Research source"
    },
    {
      "title": "Add small amounts of soil as the stalk grows.",
      "content": "Add small amounts of soil as the stalk grows. Do so carefully to avoid damaging the young stalk, since it’s still fragile at this stage. Cover the new stalk with a little soil up to the top set of leaves; be sure these leaves remain above the soil. As the stalk grows, continue adding small amounts of soil until 1 inch (2.5 cm) of empty space remains between the top of the soil and the rim of the pot. Dahlias grow quickly, and you’ll see substantial foliage within 2 weeks. Blooms typically appear about 8 weeks after planting."
    },
    {
      "title": "Keep the pot in full sun.",
      "content": "Keep the pot in full sun. Dahlias grow best with 6 to 8 hours of direct sunlight. For best results, choose a spot that gets full sun from the morning through midday. Try to find a spot that will also provide partial shade from intense afternoon light, especially if you live in a hot climate. If you keep your dahlia indoors, you’ll need to supplement sunlight with fluorescent plant lights. You’ll also need supplemental lighting if you’re starting your plant indoors in early spring. Set the light about 6 inches (15 cm) above the top rim of the pot for newly planted tubers and raise the light as the plants grow."
    },
    {
      "title": "Water the tubers deeply once the stalk extends above the rim of the pot.",
      "content": "Water the tubers deeply once the stalk extends above the rim of the pot. Give them a thorough watering 2 or 3 times a week. Dahlias growing in hot, dry climates may need daily watering. While you should water thoroughly and keep the soil moist, the soil shouldn’t be soggy or waterlogged."
    },
    {
      "title": "Tie the stalk to the stake when it reaches a height of 1 foot (30 cm).",
      "content": "Tie the stalk to the stake when it reaches a height of 1 foot (30 cm). Use twine or nylon string to secure the stalk to the stake. As the stalk grows, tie it to the stake in 1 foot (30 cm) intervals. [19] X Research source"
    },
    {
      "title": "Fertilize the flowers once every 2 weeks throughout blooming season.",
      "content": "Fertilize the flowers once every 2 weeks throughout blooming season. Go for a liquid fertilizer with higher concentrations of phosphorus and potassium. Good N-P-K combinations include 8-24-16 and 0-20-20. Higher amounts of phosphorus promote blood production, and potassium encourages root development. Apply your product according to its label’s instructions."
    },
    {
      "title": "Prune and deadhead regularly to encourage healthy growth.",
      "content": "Prune and deadhead regularly to encourage healthy growth. Flowers last 4 to 6 days, then fade and die. Clip spent flowers as you see them to encourage further bloom production. Remove the bottom leaves by the middle of summer, or around mid-July in the Northern Hemisphere. [20] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Pinch back the tips before flower buds form when the plant is about 16 inches (0.41 m) tall to encourage a bushier growth. Removing the bottom leaves improves air circulation, which reduces the risk of mildew."
    },
    {
      "title": "Spray your dahlia with fungicide or insecticide as needed.",
      "content": "Spray your dahlia with fungicide or insecticide as needed. Dahlias are prone to a number of pests, including mold, earwigs, slugs, spider mites, aphids, and cucumber beetles. To prevent infestation and infection, apply a combination insecticide and miticide every 7 to 10 days once the plant grows to a height of 6 inches (15 cm). Find a chemical insecticide and miticide labelled for flowering plants at your local garden center. Apply your product as directed. Use organic insecticides, such as horticultural soap or neem oil, for a more natural approach."
    },
    {
      "title": "Store the tuber in a cool, dry place during winter.",
      "content": "Store the tuber in a cool, dry place during winter. The first freeze will kill the plant’s leaves and stalk. When this happens, cut the stalk to a height of 6 inches (15 cm). Allow 2 weeks for the tuber to harden in the pot, then carefully dig it out of the pot. Rinse it, let it air dry for a day, then pack it in paper, sawdust, or perlite. [21] X Research source Store the tuber in a dry, dark place that’s 40 to 50 °F (4 to 10 °C) during the winter, then replant it in the spring."
    }
  ]
}