{
  "url": "https://www.wikihow.com/Make-Your-Eyes-Stop-Hurting-after-Swimming",
  "title": "How to Make Your Eyes Stop Hurting after Swimming",
  "steps": [
    {
      "title": "Rinse your eyes with cool water to remove harsh chemicals.",
      "content": "Rinse your eyes with cool water to remove harsh chemicals. After swimming, residue from the water may remain in your eyes. Rinsing them with cool water will wash away traces of chloramines or other substances that may be causing irritation. Hold your face over a sink and slowly pour water from a cup into one eye, then the other. Dry your eyes by patting them with a soft towel when you're finished. [1] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source If you’re wearing contacts, take them out first. However, keep in mind that you should never swim with contacts in, since they can trap irritants and bacteria against your eyes. [2] X Expert Source Mark Cannon, OD Board Certified Optometrist Expert Interview. 24 August 2020. While flushing your eyes probably won't provide immediate relief, it's an important first step, since your eyes will stay irritated as long as they have residue in them. Cool water may help the inflammation go down, but warm water is also fine to use if you prefer it."
    },
    {
      "title": "Use a saline solution to restore moisture to your eyes.",
      "content": "Use a saline solution to restore moisture to your eyes. [3] X Expert Source Mark Cannon, OD Board Certified Optometrist Expert Interview. 24 August 2020. If your eyes are feeling dry and scratchy after swimming, a saline solution can help to soothe them. Saline is similar to your natural tears, and it helps add moisture and rinse away impurities to make your eyes feel better right away. Look for standard saline eye drops at the drugstore, and check the expiration date first to make sure it’s still good. After you get out of the pool, use a few drops according to instructions. Keep a small bottle of saline solution in your beach or pool bag so you have it on hand when you need it."
    },
    {
      "title": "Lubricate extra dry eyes with artificial tears.",
      "content": "Lubricate extra dry eyes with artificial tears. For a stronger boost of soothing hydration, follow up your saline rinse with 1-2 drops of artificial tears or lubricating eyedrops. Add a couple drops once an hour for the next 4-6 hours after your swim. Make sure you get drops that say “artificial tears” or “lubricating” on the bottle. [4] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source Stay away from medicated eyedrops formulated to treat red eye, since these can dry your eyes out and make the irritation worse. Adding a couple drops of artificial tears to your eyes before you start swimming can help keep them from drying out in the first place. [5] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source"
    },
    {
      "title": "Try soothing your eyes with milk, but be aware of the possible risks.",
      "content": "Try soothing your eyes with milk, but be aware of the possible risks. This method for relieving sore eyes is not scientifically proven to work , but some swimmers swear by it as a way to soothe their eyes after a long day in the pool. Use a dropper or a spoon to drip a few drops of milk into your eyes. Blink a few times and wipe the excess milk away. However, be aware that there’s no scientific evidence to back up this method. If the milk irritates your eyes, stop using it right away. [6] X Research source Milk may work by balancing the pH of your eyes or soothing them with a protective coating of protein. If you experience further irritation after using milk, rinse your eyes with water to remove it. While there’s not a lot of formal research about the risks of putting milk in your eyes, some doctors warn that it could be unsafe because milk isn’t sterile. [7] X Research source"
    },
    {
      "title": "Use a cool compress to relieve inflammation and pain.",
      "content": "Use a cool compress to relieve inflammation and pain. When you’re dealing with the agony of burning eyes, cooling them down is a quick and easy way to get relief. A cool compress will help to bring down any swelling and reduce irritation. [8] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Just wet a washcloth with cool water and drape it over your closed eyelids for a few minutes. The sting will naturally start to lessen. If the washcloth gets warm before your eyes feel better, wet it again with cool water and repeat. You can also wrap an ice pack in a clean, lint-free cloth if you prefer a colder compress. To avoid spreading germs, don’t share the washcloth or ice pack with anyone else until you’ve had a chance to wash it."
    },
    {
      "title": "Apply wet teabags over your eyelids to soothe inflammation.",
      "content": "Apply wet teabags over your eyelids to soothe inflammation. Tea contains anti-inflammatory chemicals, called polyphenols, that may help to reduce swelling and irritation. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Soak 2 teabags with cool water, lie back and close your eyes, and place the teabags over your eyelids. Keep the bags there for about 10 minutes, or until they come to room temperature. If your eyes still feel sore, wet them in cold water again and repeat. While tea is known to have anti-inflammatory properties, there’s no evidence that it works better for relieving irritated eyes than plain water. However, because of their size, shape, and absorbent properties, teabags make great eye compresses!"
    },
    {
      "title": "Try cucumber slices for cool, moisturizing relief.",
      "content": "Try cucumber slices for cool, moisturizing relief. While there’s not a lot of scientific research on how they work, cucumber slices are a classic home remedy for eye irritation and inflammation. [10] X Research source Refrigerate a cucumber, then cut off 2 thick slices. Lie down and close your eyes, then place the slices over your eyelids. The cool cucumber will soothe your eye irritation and help restore moisture to your irritated skin. Like tea, cucumber contains phytochemicals that might help ease irritation and inflammation. [11] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Plus, refrigerated cucumber slices are cold, moist, and fit nicely over your eyes, making them excellent natural cold compresses. If you don’t have a cucumber on hand, some DIY health and beauty gurus recommend using cold, raw potato slices instead. Rinse your eye area when you’re done to wash away any grainy residue."
    },
    {
      "title": "Use a gel eye mask to cool your eyes.",
      "content": "Use a gel eye mask to cool your eyes. Gel eye masks are soothing on the eyes and can even help with headaches as well. Store them in the refrigerator for a cool source of relief whenever you need it. You can buy a gel eye mask online or in a drug store."
    },
    {
      "title": "Take out your contacts first if you wear them.",
      "content": "Take out your contacts first if you wear them. Never go swimming with contact lenses in your eyes, since they can trap irritants and bacteria against the surface of your eye. [12] X Expert Source Mark Cannon, OD Board Certified Optometrist Expert Interview. 24 August 2020. Before you jump in the pool, ocean, or any other body of water, always be sure to take out your contacts first. If you need glasses or contacts to see well, look into getting prescription goggles as a safe alternative to use while swimming. [13] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source Swimming with your contacts in puts you at risk of developing a serious eye infection. An infection in your cornea can eventually cause permanent damage to your vision. If you forget to take out your contacts before you swim, don’t panic! Take them out immediately after you’re done, then soak them in contact solution for a full 24 hours to remove contaminants. [14] X Research source If your lenses are single-use, throw them away and start using a new pair. [15] X Research source"
    },
    {
      "title": "Wear goggles when you swim.",
      "content": "Wear goggles when you swim. This is the best way to prevent irritation from pool or ocean water. If you never let the water hit your eyes, you won't experience redness and sore eyes every time you swim. Wear goggles so you can swim to your heart's content and open your eyes underwater without dealing with pain later. [16] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source Make sure you use goggles that fit well. They should fit snugly around your eyes so that water doesn't seep in while you're swimming. If you can't stand goggles, try to keep your eyes closed as much as possible while you're underwater. If you have children, encourage them to wear goggles as well to keep their eyes healthy."
    },
    {
      "title": "Avoid pools with a strong smell or cloudy water.",
      "content": "Avoid pools with a strong smell or cloudy water. Have you ever been to a pool with a strong chemical smell? Many people mistakenly think that's the smell of chlorine, but it’s actually the smell of chloramines, which form when chlorine binds with sweat, sunscreen, urine, saliva, and other substances that can irritate your eyes. A pool with a strong smell is one that hasn't been properly cleaned to remove all of these substances. Look for these signs that a pool isn't very clean: The pool has a strong chemical smell (or any other type of smell) The water looks cloudy instead of clear You don't hear any cleaning equipment, such as pumps and filters, operating in the pool The pool feels slippery or sticky instead of clean"
    },
    {
      "title": "Stick to lakes and rivers that are designated safe for swimming.",
      "content": "Stick to lakes and rivers that are designated safe for swimming. Lakes and rivers don't require chemical treatment to make them safe for swimming. They should have natural ways of keeping harmful bacteria at bay. However, some lakes and rivers are part of ecosystems that have been disrupted, and they may contain bacteria that can irritate your eyes or lead to eye infections. To keep yourself safe: [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Only swim in natural bodies of water that have been deemed safe for swimming; avoid areas that have a \"no swimming\" policy. Avoid swimming in lakes or rivers that are contaminated with pollution. Avoid swimming in lakes or ponds that seem stagnant. Don't swim in water that's cloudy or green in color. Avoid swimming in lakes that have lots of algae. They could contain cyanobacteria, which can irritate your eyes or make you ill. [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Avoid swimming in lakes near pastures or farmland or lakes with pipes draining into them, since they could be contaminated by E. coli."
    },
    {
      "title": "Test the water you’re swimming in if you’re unsure of its safety.",
      "content": "Test the water you’re swimming in if you’re unsure of its safety. Environmental agencies might conduct water safety tests in your area, but you can also purchase home kits to test it yourself. Look for kits online that check for major forms of waterborne illness and pollutants, especially E. coli, then follow the instructions carefully to carry out the test. [19] X Research source E. coli is often used as an indicator for water that can irritate your eyes or make you sick, since other pathogens can be hard to detect. If this type of bacteria is present in certain quantities, there is typically a higher probability that other pathogens will be present as well. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source In some areas, you may be able to buy an inexpensive test kit from your local Department of Health."
    }
  ]
}