{
  "url": "https://www.wikihow.com/Make-Origami-Birds",
  "title": "How to Make Origami Birds",
  "steps": [
    {
      "title": "Fold your paper diagonally.",
      "content": "Fold your paper diagonally. Start with a square of origami paper (colored side up). Turn it so that it looks like a diamond. Fold the top of the diamond all the way down to the bottom and crease. Unfold, then make another fold, taking the left tip over to the right one, and crease. Unfold once again. [1] X Research source"
    },
    {
      "title": "Make horizontal and vertical folds.",
      "content": "Make horizontal and vertical folds. Flip the paper over. Turn it so that it is oriented like a square again. Fold the top left and right corners down to the bottom ones and crease. Unfold, then take the top and bottom corners on the left and fold them over to the corresponding corners on the right. Crease at the fold, and unfold your paper again. [2] X Research source"
    },
    {
      "title": "Fold the top corners to the bottom.",
      "content": "Fold the top corners to the bottom. Turn your paper so that it is diamond shaped again and fold the top to the bottom. It will look like a triangle. Push the left and right tips into the interior of the triangle until they reach the bottom tip, and crease. [3] X Research source"
    },
    {
      "title": "Make creases on the left and right.",
      "content": "Make creases on the left and right. The paper should now look like a smaller square with upper and lower flaps. Turn it so that looks like a diamond. Take the tips of the upper flaps on the left and right and fold them to the center of the square. Make creases, then unfold. [4] X Research source"
    },
    {
      "title": "Fold the top down.",
      "content": "Fold the top down. Take the top flap of the diamond and fold it downwards. Crease it to make a line running between the folds made by the right and left flaps. The tip of the top should touch the center crease. Unfold the top flap. [5] X Research source"
    },
    {
      "title": "Open the upper flap.",
      "content": "Open the upper flap. Lift the upper flap, starting from the bottom of the diamond. Keep lifting it upwards until it lies flat. The sides of the upper flap should fold inwards at the same time. Press the folds. [6] X Research source"
    },
    {
      "title": "Repeat on the other side.",
      "content": "Repeat on the other side. Flip your paper over and work with the flap on the other side (originally the lower flap, now facing upwards) to make creases on its left, right, and top tips. The lift the flap from the bottom until it lies flat, as you did before. Press all of the folds. [7] X Research source"
    },
    {
      "title": "Make the bird’s legs and neck.",
      "content": "Make the bird’s legs and neck. Your paper should now look like a narrow diamond shape. One of the points will be separated into two sections that you can move freely. Turn the paper so that these face downwards. Take the right section and fold it diagonally, just below the left point of the diamond, so that the tip points upward and slightly to the left. Do the opposite on the right side, then unfold. [8] X Research source Make an outside reverse fold on the right section by pushing the outer edge of inward, and pulling it upwards until it reaches the diagonal fold you made. Make an inside revers fold on the left section by pushing its inner fold inwards and pulling it upwards until it reaches the diagonal fold. Press the folds again to neaten them."
    },
    {
      "title": "Fold the bird’s head.",
      "content": "Fold the bird’s head. You paper should now look roughly like a bird, with a narrow neck and tail/legs, and two wings in the middle. Make another outside reverse fold on the very tip of the neck to make a head for your bird. [9] X Research source"
    },
    {
      "title": "Make the bird’s wings.",
      "content": "Make the bird’s wings. Right now, you paper will resemble a bird with both wings pointing directly upwards. Make a slightly diagonal fold on each wing so that it is raised up a bit on the side closest to the head. Crease the folds,then lift the wings up so they stick out to the right and left of the bird. [10] X Research source"
    },
    {
      "title": "Make your bird’s wings flap.",
      "content": "Make your bird’s wings flap. Your bird is now ready to “fly”! Gently pull and push on its tail to make its wings flap up and down. [11] X Research source"
    },
    {
      "title": "Make a diagonal fold.",
      "content": "Make a diagonal fold. Turn a square of origami paper (with the colored side up) so that it looks like a diamond. Take the top of the diamond and fold it all the way down to the bottom and crease. [12] X Research source"
    },
    {
      "title": "Fold the paper in half.",
      "content": "Fold the paper in half. Your paper should now resemble a triangle with the longest side at the top. Take the left tip of the triangle and fold it over so that it lays on top of the right tip. Crease the fold. [13] X Research source"
    },
    {
      "title": "Open the top flap.",
      "content": "Open the top flap. Now your paper should look like a smaller triangle with upper and lower flaps. Take the right tip of the top flap and push it toward the bottom tip. To do this, open up the flap as you push, and then fold the paper down flat so that the tips touch. [14] X Research source Turn the paper over, and repeat this step on the other side with the lower/left flap."
    },
    {
      "title": "Fold the left and right sides in.",
      "content": "Fold the left and right sides in. You’ll now have a smaller square with upper and lower flaps. Take the left and right tips of the upper flap and fold them toward the center. Crease the folds, then unfold the tips again. [15] X Research source"
    },
    {
      "title": "Lift the upper flap.",
      "content": "Lift the upper flap. Take the bottom of the upper flap, and raise it upwards. Gently push it down flat. The sides of this flap should fold inward along the creases you previously made on the sides of the upper flap. [16] X Research source Flip your paper over, and repeat this step on the other side."
    },
    {
      "title": "Make the paper narrower.",
      "content": "Make the paper narrower. Your paper will now look like a narrow diamond, with upper and lower flaps. Fold the left and right tips of the upper flap of the diamond from the bottom tip, moving them toward the center. Crease the folds. Turn the paper over and repeat on the other side. You should now have an even narrower diamond, with the bottom tip at a narrower angle than the top one. [17] X Research source After narrowing the diamond, take the right flap of each side and fold it over the left flap."
    },
    {
      "title": "Fold the bottom of the diamond upwards.",
      "content": "Fold the bottom of the diamond upwards. Take the upper flap at its bottom point, folding it upwards. Crease the fold about three-fourths of the way from the bottom. Flip your paper over and repeat on the other side. [18] X Research source"
    },
    {
      "title": "Form the crane’s neck and tail.",
      "content": "Form the crane’s neck and tail. If you hold your paper in your hand, you should now feel narrow pieces on the left and right in between the upper and lower flaps. Gently pull these apart until they look roughly like a bird’s neck and tail with wings sticking up between them. Crease the folds to hold them in place. [19] X Research source"
    },
    {
      "title": "Make the bird’s head.",
      "content": "Make the bird’s head. Choose which point you want to be your bird’s neck. Push down slightly on the fold near the end. Keep pushing until the fold goes inward and the tip forms roughly a right angle with the neck, forming the bird’s head. Crease the fold. [20] X Research source"
    },
    {
      "title": "Fold the crane’s wings.",
      "content": "Fold the crane’s wings. Now your paper should look like your bird’s wings are pointed straight up. Fold them down on each side of the bird’s body, and make a horizontal crease. Lift them up slightly, and the wings should now stick out at the sides, so that your crane looks like it is in flight. [21] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}