{
  "url": "https://www.wikihow.com/Have-a-Productive-Day",
  "title": "How to Have a Productive Day",
  "steps": [
    {
      "title": "Start preparation the night before.",
      "content": "Start preparation the night before. You should plan ahead if you want a productive day. Before going to bed for the night, make a to-do list. [1] X Expert Source Sharon Lee Success Strategist Expert Interview. 2 December 2021. But make sure that it is doable. If you list an onslaught of tasks, this is more likely to stress you out than make you productive. Stick to 3 to 5 big daily goals. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If your goals are bigger, stick to a lower number. For example, if you need to finish a report for work, that's going to take a lot of sub-steps. You can write a goal that just says, \"Finish the Henderson report by end of day\" and assume you'll have a lot of sub-steps involved there. If you don't have any big tasks ahead, reach for 4 or 5 smaller goals. You could write something like, \"Return e-mail to Cindy, rewrite press release, proofread website copy, and return Carter's phone call.\" Remember, you may get more done. In fact, if you work hard and stay productive, there is a good chance you will exceed this list. The point of making your list is to get a sense of what absolutely must be done by the end of the day. Seeing your main goals written down can help you prioritize."
    },
    {
      "title": "Have a glass of lemon water.",
      "content": "Have a glass of lemon water. Lemon can boost your energy in the morning, which can increase your productivity throughout the day. As soon as you wake up in the morning, have a glass of water with lemon juice squeezed in. Do not drink pure lemon juice, as this is hard on your teeth. It can help to place a pitcher of lemon water in the fridge before bed at night. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For best results, you should drink the lemon water on an empty stomach. Wait 15 to 30 minutes to eat after drinking the water."
    },
    {
      "title": "Avoid social media right away.",
      "content": "Avoid social media right away. Facebook, Twitter, and other social media outlets can make you lose focus. Do not grab your phone first thing in the morning to check your Facebook. Instead, focus your energy elsewhere. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Think of a relaxing, positive way to start the day. Social media can often fuel feelings of inadequacy, making you grumpy at the beginning of the day. Instead, stretch, meditate, watch the birds outside, or listen to a song you like. Make a rule for yourself about when you can first look at social media. You can promise yourself, for example, you won't check Facebook until after breakfast. If this becomes a more serious problem for you, you can even block distracting sites on your iPhone ."
    },
    {
      "title": "Have breakfast.",
      "content": "Have breakfast. A good breakfast is vital for a successful day. It's called the most important meal of the day for a reason. Breakfast helps improve your mood and energy and can increase your overall productivity. Go for a real breakfast. Skip the processed foods or sugary snacks like donuts. Oatmeal, yogurt, fruit, and eggs are all great breakfast choices. If you're in a rush, try grabbing something small on your way out the door. Even eating a banana on your way to work can help bolster your productivity levels."
    },
    {
      "title": "Exercise before work.",
      "content": "Exercise before work. A workout can help regulate your mood and stress level. Also, physical activity bolsters your energy. Get up a little earlier in the mornings so you can fit a workout in before work or school. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source You don't have to do a long workout. Something as simple as 10 minutes of physical activity can help. You can go for a brisk 10 minute walk, do 10 minutes of aerobics in your kitchen, or run on the treadmill for 10 minutes. If you like something like yoga or Pilates, try to find a 10 minute routine online."
    },
    {
      "title": "Eliminate distractions.",
      "content": "Eliminate distractions. A productive day begins with minimal distractions. Going into work or school, remove anything that could get you off track. You want to be able to focus on your work and not other things. [6] X Research source If you work on a computer, shut any browsers and close any applications or software that's distracting. Log out of social media accounts. Shut down websites where you're reading news articles. If you have a distracting program in the background, close it. Get rid of anything on your desk that may distract you. If you have a book you brought to read during downtime, put it away. Put away any electronic devices, like an iPhone or an iPod, that may take away your energy."
    },
    {
      "title": "Say “no”",
      "content": "Say “no” to requests that do not fit in with your priorities. There is nothing wrong with saying “no,” especially if you have a busy day ahead and people ask you to do things that you do not have the time or energy to do. If someone asks you to do something that does not fit in with your priorities for the day, then let them know that you cannot help them. [7] X Research source Try saying something like, “No, I have a lot on my plate today and I can’t add anything else.” Or, simply say, “No. I can’t help you with that today.”"
    },
    {
      "title": "Organize your workspace.",
      "content": "Organize your workspace. No one can work productively in a messy atmosphere. Before you begin to work, take a few moments to tidy up. Organize any papers and throw out anything you don't need. If there's dirt or dust on your desk, quickly wipe it off. If you notice any garbage, like a can of soda or a candy wrapper, throw it away. A neat workspace can go a long way in terms of making you more productive. [8] X Research source Organize papers logically. Papers that you need to review or work on can be in one pile. Papers that have been completed can be in another. Keep your supplies organized. Have all your basic office supplies (staplers, scissors, pens, etc.) on one part of your desk."
    },
    {
      "title": "Focus on one thing at a time.",
      "content": "Focus on one thing at a time. While you're working on a single task, keep your energy focused there. Do not think about your commute home while you're working on a report, for example. Do not think about the next assignment you need to do while you're working on another assignment. Focusing on one thing at a time will make you more productive, as you'll work more productively when you give a task your full attention. [9] X Research source Multitasking is actually bad for productivity. It will take you much longer to try to do three things at once than it will to do one thing at a time. Instead of bouncing between different tasks, choose one, complete it, and then move on. Avoid things like checking your phone or email while you're trying to complete something."
    },
    {
      "title": "Tackle the most important tasks first.",
      "content": "Tackle the most important tasks first. [10] X Expert Source Sharon Lee Success Strategist Expert Interview. 2 December 2021. If you're not looking forward to a difficult or important task, do it first. This way, important jobs will not fall to the wayside. You will also feel more relaxed after getting a big task done, allowing you to proceed through your day with less stress. This can make you more productive. [11] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source You can refer to the list you made the night before. What were the three to five things you absolutely needed to do? Start with one of those. For example, say you're nervous about returning an email to an important client. Rather than putting this off and worrying about it, do it first thing in the morning."
    },
    {
      "title": "Give yourself breaks and rewards throughout the day.",
      "content": "Give yourself breaks and rewards throughout the day. Part of being productive is cutting yourself some slack on occasion. If you don't take breaks, you'll burn out well before the day is over. Time yourself as you work and grant yourself a small break every 15 to 30 minutes. [12] X Research source You can also reward yourself. You may work harder if you know there's a reward coming at the end of a particular task. For example, you can allow yourself to have a piece of candy after finishing one essay. You can grant yourself a 5 minute social media break after you finish planning a presentation."
    },
    {
      "title": "Reflect on your day.",
      "content": "Reflect on your day. At the end of the day, take some time to reflect when you get home. Do not immediately jump into a new task for the day, as this can leave you feeling stressed and burnt out. Instead, sit down and review your day. Think about everything you accomplished. Allow yourself to feel a sense of pride. Congratulate yourself on anything you did right during the day. For example, think something like, \"I'm really glad I spoke up in that meeting today.\" Then, forgive yourself for anything you did wrong. Remind yourself everyone makes mistakes and embrace the fact imperfections and missteps are a normal part of life. For example, \"I know there was a typo in that memo I sent out, but everyone makes mistakes.\""
    },
    {
      "title": "Set your clothes up for the next day.",
      "content": "Set your clothes up for the next day. It's a good idea to have the clothes you're going to wear ready the night before. Choose the outfit you want to wear to work or school the next day. Lay it out near your bed. This way, you won't waste any time scrambling to find clothes when the morning comes around."
    },
    {
      "title": "Get some cleaning done.",
      "content": "Get some cleaning done. Doing a little bit of cleaning each day helps you feel more productive at home. Remember, a clean environment helps with a productive mindset. In addition to this, regular cleaning saves you time. If you clean a bit each day, you won't have to spend hours on the weekend doing a big cleanup. If there's a chore you particularly dread, start with that. Once you feel like that's out of the way, you'll free up mental space to handle other chores. You can separate chores into different days of the week. For example, you can always do laundry on Mondays, dishes on Tuesdays, pay bills on Wednesdays, and so on."
    },
    {
      "title": "Engage in activities that help you relax.",
      "content": "Engage in activities that help you relax. You can't be going all the time. It's important to take time each night to give yourself a break. Before bed, do something that keeps you feeling sane and grounded. Choose an activity like reading a book, taking a warm bath, or watching some television. All of this can help you feel more relaxed, preventing burnout which can decrease productivity. [13] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source Reader Poll: We asked 352 wikiHow readers if they prefer to shower in the morning or at night, and 62% of them said night. [Take Poll] A warm shower can also help you relax before bed."
    },
    {
      "title": "Make a to-do list for the next day before bed.",
      "content": "Make a to-do list for the next day before bed. Again, make a to-do list. You can keep up the productivity cycle the following day. Remember to write down 3 to 5 tasks you absolutely must do the next day. [14] X Research source"
    }
  ]
}