{
  "url": "https://www.wikihow.com/Identify-a-Russian-Blue",
  "title": "How to Spot a Russian Blue Cat: An Easy Step-By-Step Guide",
  "steps": [
    {
      "title": "Distinctive silvery coat with a bluish sheen",
      "content": "Distinctive silvery coat with a bluish sheen The most striking and unique thing about a Russian Blue is the coat for which it is named. It appears silvery grey, although this deep and dynamic color is often described as blue depending on the light and angle you’re looking from. This is where the name comes from. It should be dense, thick, plush, and double layered. [1] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source If you look carefully at individual hairs, you will find a grey shaft tipped with lighter grey or silver at the tip."
    },
    {
      "title": "Black nose and mauve paw pads",
      "content": "Black nose and mauve paw pads The mauve paw pads are a big giveaway you’ve got a Russian Blue as opposed to some other breed of gray cat. Most of the other breeds that come in gray will have gray or black paw pads. [2] X Research source"
    },
    {
      "title": "Deep and striking emerald eyes",
      "content": "Deep and striking emerald eyes Russian Blues have a distinctive green eye color. There is no other eye color for a Russian Blue. This trait starts to develop from 4 months of age and manifests as a rim of green around the outside of the iris, which is the colored part of the eye. All kittens are born with blue eyes, but the color changes to the final adult shade once they get older. [3] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source Many people assume the “blue” in “Russian Blue” refers to the eyes. It’s actually the fur coat, though! Pro-tip, if you’ve got a gray cat with blue eyes, you’re probably looking at a Ragdoll cat."
    },
    {
      "title": "Small, upturned smile",
      "content": "Small, upturned smile Partially due to the shape of their heads and partially due to some genetic quirk, Russian Blues have a slightly round and upturned mouth, which can make these cats look like they’re smiling. It’s a subtle smile, but it’s there! [4] X Research source If you can’t see it, call a Russian Blue’s name when they’re sitting down and you’re standing up. It’s easier to see the smile when the cat looks up at an angle since their neck fur isn’t in the way."
    },
    {
      "title": "Wedge-shaped and angular head",
      "content": "Wedge-shaped and angular head Russian Blues have a characteristic wedge-shaped or triangular face, which is often described as cobra like with seven distinct planes. Typical cats, in contrast, tend to have a rounder, more apple like skull. This sets Russian Blues apart. [5] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source"
    },
    {
      "title": "Average body size",
      "content": "Average body size Russian Blues typically grow to be around 10 inches (25 cm) in height and on average they weigh around 12 pounds (5.4 kg). This is extremely average in the context of all the cat breeds out there, so if the cat seems really big or exceptionally stout, it probably isn’t a Russian Blue. [6] X Research source"
    },
    {
      "title": "Slim, muscular build",
      "content": "Slim, muscular build Russian Blues give an overall impression of being long, slender, and elegant. They have a long graceful neck when it’s stretched out, but the deep plush coat can disguise this and make the neck appear shorter. If you feel like the cat is lean, muscular, and long, it could be a Russian Blue. [7] X Research source Blues don’t tend to be exceptionally chunky or robust, the way the average Persian or Main Coon is."
    },
    {
      "title": "Shy and reserved personality",
      "content": "Shy and reserved personality Studies demonstrate that Russian Blues are among the most fearful of cat breeds, especially when it comes to strangers. If the cat seems uniquely judicious and shy—even for a feline—there’s a very good shot you’re looking at a Russian Blue. [8] X Research source This translates to the way Russian Blues behave around other cats and pets, as well. Blues don’t typically jump at the chance to hang out with new animal friends."
    },
    {
      "title": "A gentle and affectionate disposition",
      "content": "A gentle and affectionate disposition Russian Blue’s are delicate cuddlers who won’t push you or throw a fit if you don’t want to pet them. A lot of breeds out there, like Assyrians and Norwegian Forest Cats, will paw at you, scratch, meow, and pester you until you pay attention to them. Not the Russian Blue. These gentle kitties will patiently sit nearby and wait for your love. [9] X Research source Blues are great observers and love to actively watch what's going on around them, without necessarily joining in. Like many cats, they are lovers of peace and will prefer to retire to a quieter spot while noisy activities such as vacuuming take place. [10] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source This is part of why people think it’s so easy to care for a Russian Blue but they require just as much attention as any other breed of cat."
    },
    {
      "title": "Minimal meowing",
      "content": "Minimal meowing Russian Blues are among some of the quietest cat breeds out there. They don’t tend to talk up a storm when they’re hungry and you’re unlikely to hear a Russian Blue putting on a show at 4 am by meowing through the night. They won’t be completely mute—especially if you startle them—but they’re relatively quiet for a cat. [11] X Research source As a note, this is also true for the Chartreux, another breed of gray cat often mixed up for the Russian Blue. You can always tell them apart by the eyes. Chartreux kitties have bright orange eyes. Russian Blues have a reputation for having a quiet meow, not a loud, boisterous meow like the Siamese or Javanese. These breeds can be extremely vocal and screechy."
    },
    {
      "title": "Self-play when alone",
      "content": "Self-play when alone Russian Blues are one of the few breeds of cat that will have a blast playing all by themselves. If you catch the cat romping around with a stray sock or chasing a shadow on the wall in a room you aren’t in, you’re looking at vintage Russian Blue behavior. [12] X Research source This isn’t to say that a Russian Blue won’t want you to hang out with them and play if you two bond. One of the breed’s unique quirks is that they tend to enjoy playing fetch , which is pretty unusual among cat breeds. [13] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source"
    },
    {
      "title": "Exceptional grooming routine",
      "content": "Exceptional grooming routine The Russian Blue is notorious for being easy to clean up after and groom. They spend an inordinate amount of time grooming themselves and cleaning up after any loose furs. If you’re looking for a uniquely neat kitty, this is a great breed for you. [14] X Research source This is part of why Blues are considered to be (mostly) hypoallergenic."
    }
  ]
}