{
  "url": "https://www.wikihow.com/Give-an-Injection",
  "title": "How to Give an Injection",
  "steps": [
    {
      "title": "Determine what type of injection you are giving.",
      "content": "Determine what type of injection you are giving. Your doctor or should give you detailed directions on the type of injection you will administer as well as the technique. When you are ready, review the detailed instructions that come with the medication as well as the directions given to you by your doctor, nurse, or pharmacist. If you have any questions or doubts about how and when to administer the injection, talk to your doctor, nurse, or pharmacist. Ask questions if you are not sure about the correct syringe, needle length, and needle gauge before proceeding. Some medications come ready-to-use, while others require you to fill the needle with medication from a vial. Be very clear on the supplies you need for the injection. Some people receive more than one type of injection at home. It is easy to confuse the syringes and needles needed for one injection with those intended for use with another medication injection."
    },
    {
      "title": "Be familiar with the product packaging.",
      "content": "Be familiar with the product packaging. Not all injectable medication packaging is the same. Some medications may need reconstitution before administration. Many come packaged with everything you need including syringes and needles. Again, it is imperative that your healthcare provider teaches you about your medication and any preparatory steps specific to that medication. Simply reading the instructions or a \"How To\" is not sufficient — you must have access to a direct link to ask questions and become educated on your medication and the administration. Once you have talked to your doctor, you can also review the product literature, which will give clear step-by-step instructions on anything you need to do in order to prepare the medication for administration. Again, this is should not be considered a replacement for talking to your healthcare provider about how to prepare and administer the medication. The literature will also tell you the recommended syringe size, needle size, and needle gauge, if those are not included in the packaging. Give a medication packaged in a single dose vial. Common manufacturer packaging for many injectable medications is done by putting the medication into a vial called a single dose vial. The label on the medication vial will say either “single dose vial” or will contain the abbreviation, SDV. This means each vial contains only one dose. There may be fluid left in the vial after you have prepared the dose you need to give. The remainder of the medication in the vial is to be discarded and not saved for another dose."
    },
    {
      "title": "Prepare a dose from a multi dose vial.",
      "content": "Prepare a dose from a multi dose vial. Other medications are packaged in a multi-dose-vial, which does allow for more than one dose to be withdrawn from the vial. The label on the medication will say “multi-dose vial” or contain the abbreviation, MDV. If the medication you are using is packaged in a multi-dose vial, use a permanent marker to write the date it was first opened on the container. Store the medication in the refrigerator between doses. Do not freeze the medication. Small amounts of preservatives may be used in the manufacturing process for medications contained in multi-dose-vial. This helps to minimize the growth of any contaminants, but only protects the purity of the medication for up to 30 days after the vial is opened. The vial should be discarded 30 days after the first date of opening has passed, unless your doctor advises you otherwise."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. You will need the medication package or vial, the syringe that comes with the product if available, a purchased syringe-needle unit, or separate syringes and needles that are put together at the time of administration. Other items you need include alcohol pads, a small gauze pad or cotton ball, a band-aid, and a sharps container. [1] X Research source Remove the outer seal from the medication vial then wipe the rubber top of the with an alcohol pad. Always let the area air dry after wiping with an alcohol pad. Don't blow on the top of the vial or the cleaned skin as this can cause contamination. Use the gauze pad or cotton ball to apply pressure on the injection site to reduce bleeding. Cover this with a band-aid. The sharps container is used as an important safety measure to protect the patient, caregiver, and community from biohazardous materials. The container is a thick, plastic, bin designed to hold used sharps. Sharps are lancets, syringes, and needles. When the sharps container is full, arrangements are made to transfer it to a place that destroys biohazard equipment. [2] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Examine the medication.",
      "content": "Examine the medication. Be sure you have the right medicine in the right strength, and the expiration date has not passed. Be sure the medication vial or package has been stored according to the manufacturer’s guidelines. Some products are stable when kept at room temperature before use and others may need refrigeration. [3] X Research source Check the packaging for visible damage such as cracks or dents in the vial that holds the medication. Look at the area around the top of the vial. Check for cracks and dents in the seal around the top of the medication container. Dents can mean that the sterility of the packaging may no longer be reliable. Look at the liquid inside the container. Check for particulate matter which is anything unusual or floating inside the container. Most injectable medications are clear. Some insulins appear cloudy. If you notice anything other than clear liquid inside the container, other than some insulins products, then discard it."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Thoroughly clean your hands using soap and water. [4] X Research source Include washing your nail area, between your fingers, and your wrist area. This helps prevent contamination and reduce the risk of infection. It is recommended to wear FDA approved gloves such as Medint Latex Examination Gloves prior to an ejection as an extra barrier against bacteria and infection."
    },
    {
      "title": "Inspect the syringe and needle.",
      "content": "Inspect the syringe and needle. Be sure the syringe and needle are in unopened, sterile packaging that shows no evidence of damage or deterioration. Upon opening, check the syringe for cracks in the barrel or discoloration of any part of the syringe. This includes the rubber top on the plunger. Any damage or deterioration indicates the syringe should not be used. Examine the needle for any evidence of damage. Be sure the needle has not been bent or broken. Do not use any product that appears damaged including damage to the packaging that might indicate the needle is no longer considered sterile. Some packaged syringes and needles have a visible expiration date, but not all manufacturers provide this on the packaging. If you are concerned that a product is too old to use, contact the manufacturer. Have any lot numbers available when you call. Discard damaged or deteriorated syringes, or those that have expired, by putting them in a sharps container."
    },
    {
      "title": "Verify that you have the correct size and type of syringe.",
      "content": "Verify that you have the correct size and type of syringe. Be sure to use a syringe designed for the injection you are giving. Avoid interchanging different types of syringes as this can result in serious errors in dosing. Use only the type of syringe recommended for the medication you are giving. Select a syringe that holds a little more than the amount you need to administer. Follow the manufacturer’s recommendations regarding the needle length and gauge The needle gauge is the number that describes the diameter of the needle. Larger numbers mean skinnier needles. Some medications are thicker and need a smaller gauge, or larger diameter needle. Most syringes and needles are currently manufactured as a single unit for safety reasons. When you select your syringe size you are also selecting your needle length and gauge. Be sure you have the proper equipment to administer the injection. This information is detailed in the product literature, or is available by asking your pharmacist, doctor, or nurse. Separate syringes and needles are still available. If this is what you have, then assemble the syringe and needle. Make sure that the syringe is the proper size and the needle is sterile, unused, and the correct length and gauge for the type of injection you're performing. Intramuscular and subcutaneous injections use different needles."
    },
    {
      "title": "Fill the syringe.",
      "content": "Fill the syringe. Follow the packaging instructions if available or proceed with filling the syringe from the medication vial. Sterilize the top of the vial with alcohol and allow it to air dry for several minutes. Prepare to fill your syringe. Know exactly how much liquid medication you need to withdraw and administer for your dose. Your syringe should contain exactly the amount of the prescribed dose. This information is available on the prescription label or the instructions provided by the doctor or pharmacy. To fill the syringe, pull the plunger back to fill it with air equal to the exact amount of fluid you will need. Holding the vial upside down, insert the needle into the rubber seal, and push the plunger to inject the air from the syringe into the vial. Pull the plunger out to withdraw the fluid to the exact amount needed for administration. [5] X Research source Sometimes air bubbles are visible in the syringe. Tap the syringe gently while the needle is still in the medication vial. This moves the air to the top of the syringe. Push the air back into the vial then withdraw more medication if needed to be sure you have the exact amount you need to administer."
    },
    {
      "title": "Get the patient comfortable.",
      "content": "Get the patient comfortable. Consider icing the area before administering the injection to reduce pain, particularly if the patient is a child. Let him or her sit in a comfortable position with the area exposed. Be sure you can comfortably reach the area of administration. Have the person remain as still and relaxed as possible. If you wipe the area with alcohol, wait several minutes for the area to air dry before inserting the needle into the skin."
    },
    {
      "title": "Determine the injection site based on your doctor's instructions.",
      "content": "Determine the injection site based on your doctor's instructions. A subcutaneous injection (SQ) is one given into the fatty layer of the skin. SQ injections are necessary for specific medications and for doses that usually require small amounts. The fat layer where the injection is given is between the skin and the muscle. [6] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source One place that is good to give a subcutaneous injection is the abdomen. Select an area below the waist and above the hip bone, and about two inches away from the belly button. Avoid the belly button area. SQ injections can be given in the thigh area, halfway between the knee and hip, and slightly to the side as long as you can pinch up one to two inches of skin. The lower back is a good place for SQ injections. Target the area above the buttocks, below the waist, and halfway between the spine and the side. The upper arm is a usable site as long as there is enough skin to pinch up one to two inches. Use the area of the upper arm that is halfway between the elbow and shoulder. Alternating between sites will help prevent bruising and skin damage. You can also alter within the same general site by using different patches of skin within that area."
    },
    {
      "title": "Proceed with the injection.",
      "content": "Proceed with the injection. Clean the skin on and around the site with rubbing alcohol. Allow the alcohol to dry before administering the injection. This shouldn't take more than a minute or two. [7] X Research source Do not touch the wiped area with your hands or any other material before giving the injection. Verify that you have the right drug, right site of injection, and that you have prepared the correct dose for administration. Hold the syringe with your dominant hand and pull the needle cover off with your other hand. Pinch the skin with your non-dominant hand."
    },
    {
      "title": "Determine your angle of entry.",
      "content": "Determine your angle of entry. Depending on the amount of skin you can pinch, you can insert the needle at either a 45 degree or 90 degree angle. [8] X Research source Use a 45 degree angle if you can only pinch about one inch of skin. If you can pinch two inches of skin, then insert the needle at a 90 degree angle. Grasp the syringe tightly and use a quick motion of your wrist to puncture the skin with the needle. Insert the needle quickly and carefully at the determined angle with your dominant hand while pinching the skin with your other hand. Quick needle insertion helps prevent the patient from becoming tense. Aspiration for a SQ injection is not necessary. There is no harm in doing so unless you are administering blood thinning agents, such as enoxaparin sodium. To aspirate, pull the plunger back slightly and check for the appearance of blood in the syringe. If there is blood, then remove the needle and find a different spot to administer the injection. If no blood is found, continue. [9] X Research source"
    },
    {
      "title": "Inject the medicine into the patient.",
      "content": "Inject the medicine into the patient. Push the plunger down until all the fluid has been released. Remove the needle. Push down on the skin above the injection site and use a quick and careful motion to remove the needle in the same angle in which it was administered. The whole process doesn't need to take more than five or ten seconds. Discard all used sharps in a sharps container."
    },
    {
      "title": "Administer an insulin injection.",
      "content": "Administer an insulin injection. Insulin injections are given SQ but require different syringes to be sure each dose is accurate Plus, insulin administration is ongoing. Keeping a record of injection sites is an important part of insulin administration that helps you to rotate your sites. [10] X Research source Recognize the difference in syringes. Using a regular syringe can cause serious dosing errors. Insulin syringes are graduated in units instead of cc’s or mls. It is critical that you use an insulin syringe when giving insulin. Check with your doctor or pharmacist to be sure you understand which type of insulin syringe to use with your prescribed insulin type and dosage."
    },
    {
      "title": "Determine the injection site.",
      "content": "Determine the injection site. An intramuscular injection (IM) delivers medication directly into a muscle. Choose an injection site that has easy access to muscle tissue. [11] X Research source There are four primary sites recommended for administering IM injections. Those include the thigh, the hip, the buttocks, and the upper arm. Alternate between injection sites to prevent bruising, soreness, scarring, and skin changes."
    },
    {
      "title": "Give the injection into the thigh.",
      "content": "Give the injection into the thigh. The vastus lateralis is the name of the muscle that you will be targeting for your medication delivery site. [12] X Research source Visually divide the thigh into three sections. The middle section is the target for the IM injection. This is a good site if you are giving yourself an IM injection since you can easily see and reach the target area."
    },
    {
      "title": "Use the ventrogluteal muscle.",
      "content": "Use the ventrogluteal muscle. This muscle is located in the hip. Use landmarks on the body to find the location where you want to inject the medication. [13] X Research source Find the proper location by having the person lie on his or her side. Place the heel of your hand on the upper and outer part of the thigh where it joins the buttocks. Point your fingers toward the person’s head and point your thumb towards the groin. You should feel a bone along the tips of your ring finger and little finger. Form a V shape by moving your pointer finger away from the other fingers. The injection is given in the middle part of the V shape."
    },
    {
      "title": "Give the injection into the buttocks.",
      "content": "Give the injection into the buttocks. The dorsogluteal muscle is the area where you want to inject the medication. With practice the target area becomes easier to locate, but begin by using physical landmarks and divide the area into quadrants to be sure you have the correct area. [14] X Research source Draw an imaginary line, or actual line using an alcohol wipe if available, from the top of the crack to the side of the body. Locate the midpoint of that line, and move up three inches. Draw another line that crossed the first one, forming a cross. Locate a curved bone in the upper outer square or quadrant. The injection should be given in the upper outer square below the curved bone."
    },
    {
      "title": "Administer the injection in the upper arm.",
      "content": "Administer the injection in the upper arm. The deltoid muscle is located in the upper arm and is a good site for IM injections if there is adequate muscle tissue. Use an alternate site if the person is thin or has little muscle in that area. [15] X Research source Find the acromion process, or the bone that crosses the upper arm. Draw an imaginary upside down triangle with the bone as the base and the point of the triangle is the level of the armpit. Give the injection in the middle of the triangle, one to two inches below the acromion process."
    },
    {
      "title": "Clean the skin on and around the site with an alcohol wipe.",
      "content": "Clean the skin on and around the site with an alcohol wipe. Allow the alcohol to dry before administering the injection. [16] X Research source Do not touch the cleaned area with your fingers or any other material before giving the injection. Hold the syringe firmly with your dominant hand and remove the needle cover with your other hand. Put pressure on the skin where you are giving the injection. Push down gently and pull the skin so it is tight."
    },
    {
      "title": "Insert the needle.",
      "content": "Insert the needle. Use your wrist to inject the needle through the skin at a 90 degree angle. You will need to force the needle deep enough to be sure you deliver the medication into muscle tissue. Selecting the correct needle length helps to guide you in the injection process. [17] X Research source Aspirate by pulling the plunger back slightly. Look for blood that is pulled back into the syringe as you pull back on the plunger. If there is blood, then carefully remove the needle and find a different spot to administer the injection. If no blood is seen then continue with giving the injection. [18] X Research source"
    },
    {
      "title": "Carefully inject the medicine into the patient.",
      "content": "Carefully inject the medicine into the patient. Push the plunger down until all of the fluid has been released. [19] X Research source Do not push too hard on the plunger as this forces the medication into the site too fast. Push the plunger in a steady but slow manner to reduce pain. Remove the needle in the same angle in which it was injected. Cover the injection site with a small gauze pad or a cotton ball and a band-aid, and check on it regularly. Make sure it looks clean and the injection site is not continuing to bleed."
    },
    {
      "title": "Watch for an allergic reaction.",
      "content": "Watch for an allergic reaction. Any new medication should be first administered in a physician's office so the patient can be monitored for allergy signs and symptoms. However, if signs or symptoms of an allergic reaction develop during subsequent treatments, seek medical attention immediately. [20] X Research source Signs of an allergic reaction include hives, a rash or itching; shortness of breath; difficulty swallowing; feeling like your throat or airway is closing; and swelling of the mouth, lips, or face. Call 911 if symptoms of an allergic reaction develop. You have just injected a medication into the body which speeds up the reaction time if an allergy is present."
    },
    {
      "title": "Seek medical attention if you develop an infection.",
      "content": "Seek medical attention if you develop an infection. Even the best injection technique can sometimes allow entry of contaminants. [21] X Research source Contact your doctor as soon as possible if you develop a fever, flu-like symptoms, headache, sore throat, joint and muscle aches, and gastrointestinal problems. Other symptoms that warrant prompt medical attention include chest tightness, nasal congestion or stuffiness, a widespread rash, and mental changes like confusion or disorientation."
    },
    {
      "title": "Monitor the injection site.",
      "content": "Monitor the injection site. Watch for changes in skin tissue at the point of injection and the area immediately surrounding it. [22] X Research source Injection site reactions are more common with some drugs than others. Read the product literature before drug administration to know what to look for. Common reactions that occur at the site of an injection include redness in the area, swelling, itching, bruising, and sometimes a raised lump or hardened area. Alternating injection sites can help to minimize damage to the skin and surrounding tissue when frequent injections are needed. Persistent problems with injection site reactions warrant medical evaluation."
    },
    {
      "title": "Dispose of used items safely.",
      "content": "Dispose of used items safely. Sharps containers are a safe way to dispose of used lancets, syringes, and needles. Sharps containers can be purchased at your local pharmacy and are available online. [23] X Research source [24] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Never put lancets, syringes, or needles in the regular trash. Review your state’s guidelines. Your pharmacist can help you to find a program that meets your needs. Many states have clear guidelines and suggestions on developing a safe system for disposing of biohazardous waste created from giving injections at home. Sharps, including used needles, lancets, and syringes, are biohazardous waste since they are contaminated with skin and blood from direct contact with you or the person receiving the injections. Consider an arrangement with a company that provides mailback kits. Some companies provide a service that supplies you with sharps containers you need and make arrangements that allow you to safely mail the containers to them when they are full. The company takes responsibility for proper destruction of biohazardous waste. [25] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Ask your pharmacy about safe ways to discard any vials that contain unused medications. Often, any opened vials of medication can be placed into the sharps container."
    }
  ]
}