{
  "url": "https://www.wikihow.com/Make-a-Hot-Dog-in-the-Microwave",
  "title": "How to Make a Hot Dog in the Microwave",
  "steps": [
    {
      "title": "Place the hot dog(s) on a paper towel-lined plate.",
      "content": "Place the hot dog(s) on a paper towel-lined plate. Paper towels make cleanup a cinch by absorbing grease and moisture that leaks out of the hot dog as it cooks. If you're cooking multiple hot dogs, line them up in a row on the towel, leaving a little space between each. This allows them to cook evenly. Be sure to use a microwave-safe plate. Plates made from glass or ceramic are safe bets. Plastic and metal plates should be avoided. Click here for a detailed guide to which containers are microwave-safe. [1] X Research source"
    },
    {
      "title": "Optionally, pierce the hot dog(s) a few times.",
      "content": "Optionally, pierce the hot dog(s) a few times. Traditional microwave wisdom dictates that hot dogs should be pricked or sliced a few times with a sharp utensil before cooking. This allows steam from inside the hot dog to escape rather than building up and causing it to explode. However, some sources (like Oscar Mayer) claim that there is no danger of explosion and that piercing the hot dogs will let the juices run out while they cook, leaving you with a dry frank. The choice here is yours — if you're only microwaving one or two hot dogs, they'll be in the microwave for such little time that you're unlikely to run into problems either way."
    },
    {
      "title": "Cover with another towel (or roll the first towel up).",
      "content": "Cover with another towel (or roll the first towel up). Covering the hot dogs with a second layer of paper towel holds moisture next to them as they cook, ensuring a plump, juicy hot dog. If you roll up your hot dog, tuck the ends under so that the towel doesn't unroll during cooking."
    },
    {
      "title": "Heat on HIGH.",
      "content": "Heat on HIGH. Different microwaves have different wattages, so cooking times can vary slightly. The cooking times below assume a middle-of-the-road microwave rated for about 800-1,000 watts. If your microwave has a higher wattage, use shorter cooking times (and vice versa for lower wattage units). If you're unsure of your microwave's wattage, click here . 1 hot dog: About 40 seconds 2 hot dogs: About 1 minute to 1 minute 15 seconds 3-4 hot dogs: About 1 minute 30 seconds to 2 minutes 30 seconds 5-6 hot dogs: About 3 minutes to 3 minutes 30 seconds 7-8 hot dogs: About 4 to 5 minutes 9-10 hot dogs: About 6 minutes"
    },
    {
      "title": "Check on your hot dog(s) halfway through cooking.",
      "content": "Check on your hot dog(s) halfway through cooking. Since microwaves can vary in their cooking power, it's wise to see how your hotdogs are doing when they're half-finished. If they're still cold or just barely lukewarm, let them finish cooking. If they're warm or hot to the touch, consider shortening the cooking time or simply taking them out of the microwave immediately. [2] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source Remove the paper towel carefully — steam trapped underneath may be released. Use oven mitts if concerned about burns."
    },
    {
      "title": "Serve hot.",
      "content": "Serve hot. When your hot dogs are as hot as you'd like them to be, they're ready to eat. They're pre-cooked, so there's no \"right\" temperature to cook them to. Carefully remove the hot plate from the microwave, discard the paper towel, and serve the franks between buns or on their own. Enjoy!"
    },
    {
      "title": "Consider warming the buns in the microwave.",
      "content": "Consider warming the buns in the microwave. Traditionally, hot dogs are served in a white bun. Though you can use buns straight out of the bag and have no problems, many prefer the sensation of a warm bun when they eat a hot dog. Warming a bun in the microwave is quick and easy — see below: Open the bun and place it face-down on a paper towel. A plate is OK but is not necessary. Wrap the bun in the paper towel or place a second on top. [3] X Research source Microwave on high for 10-15 seconds. Check for a warm, soft texture. If it's not quite warm yet, go an additional 10 seconds. Don't microwave the bun with the hot dog in it. The steam from the hot dog will make the bun soggy."
    },
    {
      "title": "Alternatively, toast the buns.",
      "content": "Alternatively, toast the buns. Toasted buns have the warmth of microwaved buns with the added benefit of a crisp, toasty texture. If you have a toaster, toasting hot dog buns is easy — just put them in at the setting you'd normally use for white bread. There are other ways to toast buns as well: [4] X Research source Heat the open bun under a broiler until well-browned. Most modern ovens will have a \"broil\" setting that also works. Rub the inside of the bun with a little oil and lay it face-down in a hot pan or griddle. Turn occasionally to prevent burning."
    },
    {
      "title": "Top hot dogs with your preferred condiments.",
      "content": "Top hot dogs with your preferred condiments. Hot dogs are great plain, but adding toppings allows you to express your culinary creativity and add flavor to this classic dish. Typically, you'll want to add these condiments after microwaving the hot dog, as cooking can often affect these toppings' taste and consistency. Just a few topping ideas include: [5] X Research source Ketchup Mustard Mayonnaise Hot pepper sauce (Sriracha, etc.) Cream cheese Chopped onions Pickle relish Bacon"
    },
    {
      "title": "Consider an \"all-in-one\" microwave recipe for your hot dog.",
      "content": "Consider an \"all-in-one\" microwave recipe for your hot dog. While most hot dog condiments are meant to be added cold after the hot dog is finished, a few recipes allow you to cook the hot dog along with its toppings in the microwave. A few are described below: Cheese dogs: Slit each hotdog lengthwise and place a strip of your preferred cheese inside. Microwave as normal and serve. Chili dogs: Place hot dogs in a microwave-safe tray and cover with chili. Microwave as normal, allowing a little extra cooking time for the chili. Serve separate from the buns — guests can pick a bun, then add a hot dog and chili from the other dish. Sauerkraut dogs: Put an uncooked hot dog in a bun and top with sauerkraut. Wrap the entire hot dog in a paper towel and fold the leftover towel underneath. Microwave as normal, allowing an extra 5-10 seconds per frank. The bun will be somewhat soggy, but this texture pairs well with the sauerkraut."
    }
  ]
}