{
  "url": "https://www.wikihow.com/Make-2-Ingredient-Slime",
  "title": "Easy 2-Ingredient Slime Recipes for Kids of All Ages",
  "steps": [
    {
      "title": "Add cornstarch and dish soap to a large bowl.",
      "content": "Add cornstarch and dish soap to a large bowl. Start by pouring 1 cup (120 g) of cornstarch into a large bowl. Then, slowly add 1 ⁄ 2 cup (120 ml) of dish soap to the bowl. [1] X Research source If you don’t have dish soap on hand, use clear shampoo or hand soap instead. This makes a squishy, stretchy slime with no glue and no Borax. It’s not very sticky, so this can be a low-mess slime option."
    },
    {
      "title": "Stir until the mixture is combined, then knead for 5 minutes.",
      "content": "Stir until the mixture is combined, then knead for 5 minutes. Use a spoon or stick to stir together the cornstarch and dish soap until the ingredients are fully combined. Then, use your hands to knead the mixture until it comes together. [2] X Research source If the mixture feels too dry, add a little more dish soap. If it’s too runny, add a little more cornstarch. After a few hours, this slime will turn crumbly, so it’s best to play with it right away—it won’t keep long."
    },
    {
      "title": "Mix fiber powder and water in a microwave-safe bowl.",
      "content": "Mix fiber powder and water in a microwave-safe bowl. Pour about 1 cup (240 ml) of water into a large, microwave-safe container. Then, stir in about 1 tbsp (3.4 g) of fiber powder . Mix until the fiber powder is completely dissolved—this usually takes about 1 minute. [3] X Research source It’s best to use a psyllium-based fiber powder for this slime. This creates a sticky, stretchy, taste-safe slime. It does tend to be messy, but it’s a lot of fun to play with! And since it’s Borax-free, soap-free, and glue-free, this slime is great for toddlers and babies who still explore by putting things in their mouth."
    },
    {
      "title": "Microwave on high for 5 minutes, pausing when the mixture bubbles.",
      "content": "Microwave on high for 5 minutes, pausing when the mixture bubbles. Set your microwave timer for 5 minutes, but don’t leave the mixture unattended or it could boil over and make a big mess. Once you see the fiber mixture starting to bubble up, carefully remove the bowl from the microwave and stir it well. Then, return it to the microwave. [4] X Research source Be very careful stirring the hot mixture. An adult should handle this step."
    },
    {
      "title": "Allow the mixture to cool.",
      "content": "Allow the mixture to cool. Remove the mixture from the microwave and stir it one last time, then let the slime cool down completely. It will be very hot, so if you try to play with it right away, you could get burned. To cool your slime faster, try pouring it onto a large plate or a baking sheet. Because of the high fiber content, this isn’t exactly an edible slime, so don’t let children eat large quantities—but it is perfectly safe to taste."
    },
    {
      "title": "Mix a 2:1 ration of glue and liquid starch.",
      "content": "Mix a 2:1 ration of glue and liquid starch. In a large bowl, stir together 1 ⁄ 2 cup (120 ml) of school glue with 1 ⁄ 4 cup (59 ml) of liquid laundry starch . [5] X Research source You can use any glue you want for this recipe—white glue makes a fluffy opaque slime, while clear glue or colored glue makes a shinier slime. You can even make sparkly slime by using glitter glue . The proportions of this recipe are easy to adjust, so you can make as much or as little as you want! This makes a fluffy, stretchy slime. It’s gooey and squishy but holds its shape well, making it fun for hours of play."
    },
    {
      "title": "Knead the mixture once the ingredients are combined.",
      "content": "Knead the mixture once the ingredients are combined. Use a spoon or a stick to mix the ingredients at first, but once the mixture starts to come together, pour it out onto your table or a plate and start kneading it by hand. The more you knead, the stretchier the slime will become. As you’re kneading, add more starch if the slime feels too thick or sticky. Add more glue if the slime is too slimy or runny. This slime needs to be kneaded for at least 5 minutes. Adding a few drops of water to the mixture at the start of the kneading process may help it come together more quickly. This slime keeps especially well—if you place it in a covered container, it will stay squishy for weeks!"
    },
    {
      "title": "Stir together cornstarch and conditioner or lotion.",
      "content": "Stir together cornstarch and conditioner or lotion. Pour 2 cups (240 grams) of cornstarch in a large bowl, then pour in 1 cup (240 ml) of hair conditioner or body lotion . Use a spoon or stick to stir the mixture the ingredients are fully combined. [6] X Research source Any conditioner will work, so feel free to use an inexpensive store brand. But since this slime will smell like whatever product you use, choose something that smells good to you! This mixture creates a fluffy butter slime with a dough-like texture that’s fun to squish and squeeze."
    },
    {
      "title": "Adjust the ingredients until the slime is the texture you want.",
      "content": "Adjust the ingredients until the slime is the texture you want. After you stir the ingredients to combine them, knead the slime with your hands to test the consistency. If the mixture feels too dry or crumbly, add more conditioner. If it’s too runny, add a little more cornstarch. If it’s just right—enjoy your slime! You’re more likely to get a good stretch with this slime if you hold it up and let gravity pull it down."
    },
    {
      "title": "Stir baking soda into gel shampoo.",
      "content": "Stir baking soda into gel shampoo. Pour about 1 ⁄ 4 cup (59 ml) of clear gel shampoo or dish soap into a bowl, then add about 1/2 tsp (3 g) of baking soda. Use a spoon or stick to stir the mixture together. [7] X Research source If you prefer, you can use 1 tsp (2.1 g) of sugar instead—the results will be about the same. [8] X Research source This makes a clear, sticky slime. It’s jiggly, runny, and pretty messy. But if it sets up correctly, it should have a decent amount of stretch."
    },
    {
      "title": "Continue stirring until the soap turns opaque.",
      "content": "Continue stirring until the soap turns opaque. It can take a long time to stir this mixture together, so be patient. First, you’ll see small bubbles appearing in the soap. As you continue to stir, the soap will get thicker, and eventually it will turn opaque. The more you stir the soap, the better your slime will turn out."
    },
    {
      "title": "Cover the mixture and refrigerate it for one day.",
      "content": "Cover the mixture and refrigerate it for one day. Refrigerating the soap will help the mixture set up and turn into slime. Take it out after about a day, then remove it from the container and enjoy your slime. [9] X Research source You can also try putting it in the freezer for an hour or letting it sit at room temperature for 2 days. Try adding mix-ins for a gooey tactile experience."
    },
    {
      "title": "Stir cornstarch into smooth yogurt.",
      "content": "Stir cornstarch into smooth yogurt. Scoop 1 cup (240 g) of yogurt into a bowl, then sprinkle in about 3/4 cups (180 g) of cornstarch. Mix the cornstarch into the yogurt with a spoon until the mixture clumps together. [10] X Research source You may be able to get the same result by using flour instead of yogurt. Don’t use yogurt with fruit chunks in it, as this will affect the texture of the slime. This fluffy mixture is somewhere between play dough and slime. It’s not quite as runny or stretchy as regular slime, but it’s squishier than regular play dough."
    },
    {
      "title": "Roll the slime mixture into a ball.",
      "content": "Roll the slime mixture into a ball. Once the ingredients are combined, use your hands to pat and roll the yogurt slime into a ball. You may need to knead the mixture a little to finish combining it. This slime is taste-safe, and if you use fruit-flavored yogurt, it will have a pleasant fruity smell. The yogurt won’t keep, so use this slime the day you make it, then toss out whatever is left."
    },
    {
      "title": "How do I store slime?",
      "content": "How do I store slime? To store your slime, keep it covered in an airtight plastic or glass container. Most types of slime can last for a few weeks if they’re covered. Slime made out of dish soap and cornstarch gets crumbly after the first day, so toss it after you play with it. Slime made from yogurt and cornstarch will spoil and shouldn’t be stored."
    },
    {
      "title": "Is slime a solid or a liquid?",
      "content": "Is slime a solid or a liquid? Slime is a non-Newtonian fluid, which means it’s not really a solid or a liquid—it’s somewhere in the middle. That’s why it feels squishy and gooey if you let it run between your fingertips, but solid if you smack it with your open hand."
    },
    {
      "title": "Why isn’t my slime stretchy?",
      "content": "Why isn’t my slime stretchy? Most slime needs to be stretched slowly. If you pull it too quickly, the slime will tear instead of stretching. If your slime is too runny or crumbly, you may need to adjust the ingredients."
    },
    {
      "title": "What are the benefits of playing with slime?",
      "content": "What are the benefits of playing with slime? Slime is science, so this is a great STEM activity for kids! With older children, you can talk about the different states of matter, like liquids, solids, and non-Newtonian fluids. Slime is also a soothing sensory activity for kids and adults of all ages!"
    },
    {
      "title": "How do I get slime out of clothes and hair?",
      "content": "How do I get slime out of clothes and hair? For clothes, dab a little white vinegar onto the slime to help dissolve it. Let it sit for a few minutes, then wash it away with soap and hot water. If you're trying to get slime out of hair, try coating the slime in conditioner to help it rinse out more easily."
    }
  ]
}