{
  "url": "https://www.wikihow.com/Make-Friends-in-a-New-City",
  "title": "Expert-Approved Ways to Meet People & Make Friends in a New City",
  "steps": [
    {
      "title": "Participate in a group-oriented hobby.",
      "content": "Participate in a group-oriented hobby. One of the best ways to make new friends is to meet people who have the same interests as you. Find interesting clubs or activities by talking to your neighbors, looking online, or visiting your local community center. Consider joining a sports team, a book club, a theater troupe, or anything else you think you’d enjoy that will allow you to get to know new people. [1] X Research source Therapist Kirin Dejonckheere says to meet new friends as an adult , “It's always a good idea to try to find interest groups, so fitness classes or book clubs, maybe hobbies that you like, because if you find people with shared interests, they can foster quick connections.”"
    },
    {
      "title": "Learn something new and meet new people.",
      "content": "Learn something new and meet new people. If you’re nervous about talking to strangers , taking a class is a great way to break the ice. Talk to your fellow classmates about what you’re learning or ask them questions if you’re confused about something. Then, keep the conversation going and get to know them! Consider auditing a class at a local college or university, signing up for yoga or dance, or taking a painting or baking class. [2] X Research source Even if you don’t make friends right away, at least you’re learning valuable skills!"
    },
    {
      "title": "Explore and get to know your new city.",
      "content": "Explore and get to know your new city. Many organizations in cities of all sizes host meet-ups and events to encourage people to get to know each other. Try to attend as many local events as possible to discover all the unique aspects of your new city and connect with those around you. [3] X Research source Some events to look out for include hiking, paint nights, block parties, community clean-ups, BBQs, and movie nights."
    },
    {
      "title": "Ask your coworkers to grab lunch or get a coffee.",
      "content": "Ask your coworkers to grab lunch or get a coffee. If you relocated for a job, take the opportunity to make friends at work. When you see each other every day, you’ll eventually move past the small talk and get to know each other better. Speed up this process by asking them to join you for lunch or a drink after work, as well as participating in work events. [4] X Research source To deepen your connection with a coworker, Dejonckheere says, “Try to bring the conversations outside of work…It’s very important to show curiosity and [listen] actively because a lot of people just want to be heard. Keep it appropriate and [focus on] asking the right questions.”"
    },
    {
      "title": "Invite your neighbors to a housewarming party.",
      "content": "Invite your neighbors to a housewarming party. Your neighborhood is a great place to start meeting new people, as we’re more likely to become friends with people who are in close proximity to us. [5] X Research source Consider going door-to-door to introduce yourself and let your neighbors know you’ve just moved in and are looking to meet new people . Tell them that you’re hosting a get-together at your house or a nearby park to get to know everyone better. Odds are, several people will show up to help you feel welcome."
    },
    {
      "title": "Meet new people by giving back to your community.",
      "content": "Meet new people by giving back to your community. Volunteering for a cause you care about has many benefits, as it improves your mental, physical, and social wellbeing and is known to boost overall life satisfaction. [6] X Research source Helping your community is a great way to meet individuals who care about the same causes you do, which is often a great foundation for friendship. Therapist Rebecca Tenzer says, “Volunteering is not only a selfless way to give back to the community but also an excellent way to meet people. Find volunteer opportunities within your local community. You'll likely encounter individuals who share your values and interests.”"
    },
    {
      "title": "Attend a place of worship to meet people with similar values.",
      "content": "Attend a place of worship to meet people with similar values. If you’re religious, joining a faith group like a church or synagogue is a great way to find community in a new city. Mingle before or after services and let everyone know you’re new to the area. You’ll likely be welcomed with open arms. [7] X Research source"
    },
    {
      "title": "Strike up a conversation with those who visibly display their interests.",
      "content": "Strike up a conversation with those who visibly display their interests. Many people love to show off their interests or hobbies on their shirts, backpacks, phone cases, or other accessories. If you spot someone wearing or holding something you like, compliment them . Just remember to be yourself—you don’t have to pretend to like something to try to make friends. Be your authentic self. Tenzer says, “Authenticity is key to forming lasting friendships. Be true to yourself, and let your genuine personality shine. People are more likely to connect with you when you're authentic. If you’re struggling in this area, working on self-esteem is always a good first step.”"
    },
    {
      "title": "Don’t be afraid to make the first move.",
      "content": "Don’t be afraid to make the first move. When you’re out at an event, look around to see if anyone else is there alone. If they don’t seem busy or preoccupied, they may be looking for someone to talk to, as well. Tenzer says, “Sometimes, all it takes is a friendly introduction. Don't hesitate to approach someone who looks approachable and strike up a conversation. Asking questions about their interests or offering a genuine compliment can be a great icebreaker.” Pay attention to the person’s body language . If they seem uninterested in having a conversation, politely bow out. When someone isn’t interested, they may physically close off by crossing their arms, turning away, or looking around the room rather than making eye contact."
    },
    {
      "title": "Meet locals through social media.",
      "content": "Meet locals through social media. Most cities have Facebook groups and other social media sites for those new to the area or those looking for new friends or hobbies . Join as many of these groups as you’re interested in, and make a post introducing yourself, your interests, and what you’re looking for. This is a great way to make friends if you’re introverted and don’t want to introduce yourself to strangers in public. [8] X Research source To find these groups , search terms like “[your city] newbies” or whatever is relevant to your situation. Remember, don’t engage with anyone who makes you feel uncomfortable. This applies to real-life situations, as well!"
    },
    {
      "title": "Become a regular at a local place.",
      "content": "Become a regular at a local place. This can be a cafe, a bar, your favorite bookstore, or anywhere else you hang out. The more you visit a place, the more likely you are to meet like-minded people. Other regulars may notice your presence and start up a conversation, as well. [9] X Research source"
    },
    {
      "title": "Don’t be afraid to start with online friendships.",
      "content": "Don’t be afraid to start with online friendships. Depending on the size of your city, you may have some luck finding friends online by using an app like Bumble BFF , MeetUp , or NextDoor . Unlike dating apps, these apps are specifically designed for those looking for platonic friendships, so there’s a good chance you’ll find someone looking for the same thing you are. Be sure to mention your interests, and suggest an outing or friend-date you’d like to try! [10] X Research source"
    },
    {
      "title": "Ask friends or family if they know anyone in the area.",
      "content": "Ask friends or family if they know anyone in the area. Depending on where you’re moving to, there’s a chance someone you already know has some connections in the area. If that’s the case, ask if they’re willing to introduce you. Even if this new person doesn’t become your BFF, they can help you navigate your new neighborhood and introduce you to even more people. [11] X Research source When hanging out with someone for the first time, therapist Ebony Eubanks recommends keeping things casual: “You should always start with a casual place to see where [you can see] how [you] feel and how [you] connect, versus making it more intimate and having these expectations that may or may not happen.”"
    },
    {
      "title": "Try dating to expand your social circle.",
      "content": "Try dating to expand your social circle. When dating, the ultimate goal is to find someone you have a romantic connection with, but sometimes, if that connection isn’t there, you can still walk away with a new friend. Try going on a few dates with people you meet in person or on a dating app. Be open to romance, but be upfront that you’re looking for platonic friends, as well."
    },
    {
      "title": "Don’t turn down too many invitations when you first move somewhere.",
      "content": "Don’t turn down too many invitations when you first move somewhere. While you won’t always feel like socializing, sometimes it’s a good idea to push yourself out of your comfort zone . When someone invites you to something, try to say yes. This shows people that you want to be included and are making an effort to get to know them. Plus, you may end up having a blast even if you initially thought you wouldn’t enjoy yourself. [12] X Research source Tenzer says to be open-minded when it comes to making new friends: “It's important to be open to making friends with people from different backgrounds or with diverse interests. Don't limit yourself to a specific group; sometimes, unexpected friendships can be the most rewarding.”"
    },
    {
      "title": "Join a networking group to meet people professionally.",
      "content": "Join a networking group to meet people professionally. If you’ve moved to a new city for business but don’t have any new coworkers to connect with, joining a professional networking group is a great way to meet other business owners or professionals. Plus, these organizations often include member benefits such as discounts on services and other professional opportunities. Contact your local Chamber of Commerce to find out what kind of networking groups are available in your area, as they often advertise or host business-related events.. [13] X Research source"
    },
    {
      "title": "Consider living with other newcomers if you don’t already have a place.",
      "content": "Consider living with other newcomers if you don’t already have a place. A co-living space is a housing arrangement in which people with shared interests and values can live together in a communal space. This is a great option if you haven’t found a permanent living space, as it’s more affordable and allows you to meet like-minded people. Additionally, if you’re looking for a permanent roommate, this could be a great place to start! [14] X Research source Usually, people only stay in co-living spaces for a few weeks to a few months. If you’re interested in trying co-living, search for a space in your city on the Coliving website . If you’re just looking for a roommate, try looking on Facebook groups or asking people you know if they know anyone who’s looking for a roommate."
    },
    {
      "title": "Understand that meeting new people may be uncomfortable.",
      "content": "Understand that meeting new people may be uncomfortable. Odds are, going out of your way to make new friends will feel a bit forced or awkward at first, but that’s to be expected. You’re getting out of your comfort zone! Sometimes, embracing that feeling and letting others know your intentions is the best way to go. Remember that other people who are looking for friends likely feel the same way you do. Be confident and be yourself . When getting to know someone, Dejonckheere suggests that you “Start with the basic questions like ‘What do you do for a living? What do you love doing outside of work? What's your favorite workout class?’ Then you can go deeper and start a conversation about that [topic] [to build] some trust as well.” Starting with the basics can help you avoid awkward lulls in the conversation."
    },
    {
      "title": "Make socializing a priority.",
      "content": "Make socializing a priority. Think of it this way—you can’t make friends if you stay at home by yourself all the time. While you don’t have to go out every day, set a realistic goal for how many times you want to socialize per week or per month. The more often you socialize , the more likely you are to make friends. [15] X Research source"
    },
    {
      "title": "Remember that making friends takes time.",
      "content": "Remember that making friends takes time. Be patient and have confidence in yourself. Friendships take time to develop, so odds are, you won’t make new friends overnight. [16] X Research source And that’s totally okay! Keep doing the things you love and eventually your people will find you. Remember that you are worthy of friendship, and continue to foster your existing relationships as you wait for new ones to bloom. Tenzer says to stay positive: “Building friendships can take time, and you might face some setbacks. Stay positive, keep trying, and don't be discouraged if not every attempt leads to a new friend.”"
    }
  ]
}