{
  "url": "https://www.wikihow.com/Load-a-Trailer",
  "title": "How to Load a Trailer",
  "steps": [
    {
      "title": "Confirm your towing vehicle’s Gross Trailer Weight Rating (GTWR).",
      "content": "Confirm your towing vehicle’s Gross Trailer Weight Rating (GTWR). You’ll find this number alongside your vehicle’s VIN number , which is usually printed on a small sticker on the windshield or inner edge of the driver’s side door. A vehicle’s GTWR refers to the total amount of weight it can bear, including all cargo, passengers, and attachments. [1] X Research source Knowing how much weight your vehicle can handle will give you a better idea of how to load the trailer it will be pulling. Never exceed your towing vehicle’s GTWR. Doing so can put serious strain on the engine, transmission, brakes, or other systems, potentially resulting in accident or permanent damage."
    },
    {
      "title": "Note the Gross Vehicle Weight Rating (GVWR) of your trailer.",
      "content": "Note the Gross Vehicle Weight Rating (GVWR) of your trailer. Similar to the GTWR for towing vehicles, a trailer’s GVWR is its maximum weight limit when loaded. Nowadays, manufacturers typically list the GVWRs of their trailers in the product description or literature. You’ll most likely also find the GVWR listed on a sticker somewhere on the trailer itself. [2] X Research source A spacious 8.5 ft (2.6 m) x 25 ft (7.6 m) flatbed trailer will have a GVWR in the neighborhood of 38,000 pounds (17,000 kg)."
    },
    {
      "title": "Subtract the weight of your trailer from its GVWR to see how much it will hold.",
      "content": "Subtract the weight of your trailer from its GVWR to see how much it will hold. If you know how heavy your trailer is, simply subtract its weight from the GVWR. Otherwise, you’ll need to weigh it yourself. Hitch the empty trailer to your towing vehicle, haul it to a truck stop or another location with a certified scale, and drive it onto the scale. Once the scale calculates a weight reading, subtract this number from the trailer’s GVR to find out how much weight it can safely carry. [3] X Research source Run a quick search to pull up a list of truck stops and other businesses in your area with certified scales available for general use. In some cases, you may have to pay a small fee in order to weigh your trailer. The weight of your trailer before it has been loaded is known as its “curb weight.” If you have a trailer with a GVWR of 7,000 lb (3,200 kg) and a curb weight of 4,000 lb (1,800 kg), it will be able to safely haul 3,000 lb (1,400 kg) of cargo. [4] X Research source"
    },
    {
      "title": "Weigh the trailer’s tongue to determine how best to distribute your cargo.",
      "content": "Weigh the trailer’s tongue to determine how best to distribute your cargo. The tongue is the long metal shaft that extends from the trailer to the back of the towing vehicle. The simplest way to find the weight of your trailer’s tongue is to use a hitch that also measures tongue weight. If that’s not an option, you can also set a bathroom scale on a cinder block or other sturdy object with height matching the rear of your towing vehicle and rest the tongue on it long enough to record the weight manually. [5] X Research source Ideally, your trailer’s tongue weight should be somewhere between 10% and 15% of its total weight when loaded. Too heavy a tongue could make it difficult to maneuver your vehicle once you’ve hitched the trailer, while one that’s too light could cause the trailer to sway when you steer the vehicle through a curve. [6] X Research source It’s possible to adjust the tongue weight of your trailer by repositioning its cargo. If the tongue weight is too high, for example, you can shift some of the cargo to the back to lighten the pressure on the hitch."
    },
    {
      "title": "Aim for a 60-40 weight distribution towards the front of the trailer.",
      "content": "Aim for a 60-40 weight distribution towards the front of the trailer. As you proceed with the loading process, you’ll want to arrange your cargo in such a way that approximately 60% of the weight is positioned at the front end, with the remaining 40% in the back. Proper weight distribution is a crucial part of safe driving, as it minimizes cargo shift and decreases the chances of the trailer swaying or whipping once you're in motion. [7] X Research source It’s helpful to apply the \"60-40 rule\" whether you’re using an enclosed cargo trailer or one with an open design. [8] X Research source There’s no need to get too technical when it comes to distributing the weight of your cargo. As long as you keep slightly more weight in the front of the trailer and drive carefully, you aren’t likely to encounter any problems."
    },
    {
      "title": "Place top-heavy items closer to the front of the trailer to prevent shifting.",
      "content": "Place top-heavy items closer to the front of the trailer to prevent shifting. If you’re moving tall, easily off-balanced items like armoires, display cabinets, or bookcases, load them first and make sure they’re even with or just ahead of the trailer’s front axle. Since this part of the trailer is the shortest distance from the back of the towing vehicle, items situated there will have much less of an effect on the way your vehicle drives. [9] X Research source Loading top-heavy items first also makes them easier to tie down and less likely to “dive”, or take weight off of the tongue and decrease your towing vehicle’s steering and braking capabilities as a result."
    },
    {
      "title": "Position the heaviest items in the center of the floor to keep them stable.",
      "content": "Position the heaviest items in the center of the floor to keep them stable. Next, move in any especially weighty cargo you may have, such as bulky furniture, appliances, and small vehicles or power equipment. Push these up against your top-heavy items to provide additional support from the rear, and pack them in as tightly together as possible to minimize shifting and sliding. [10] X Research source You might use a heavy vanity to brace a tall china cabinet, with a mattress stood horizontally in between to serve as a buffer. Heavy items tend to cause the most issues while your towing vehicle is in motion. Make sure each of the items in your second round of cargo is stable and secure, especially if you’re using an open trailer."
    },
    {
      "title": "Stack smaller items by weight in the space you have remaining.",
      "content": "Stack smaller items by weight in the space you have remaining. Once you’ve loaded your heaviest and most precarious items, you can begin filling in the back of the trailer with small pieces of furniture, boxes, and other accessories. Set the heaviest items on the trailer floor, then pile the rest of your cargo on top from heaviest to lightest. Be sure to balance the items in the back of your trailer not only from bottom to top, but from front to back."
    },
    {
      "title": "Secure your cargo from multiple angles using tie-downs.",
      "content": "Secure your cargo from multiple angles using tie-downs. Drape a series of ropes, chains, or nylon webbings straps widthwise across your cargo every 5–10 feet (1.5–3.0 m). Pull the ties taut and fasten the ends to the rails, hooks, rings, or other available attachment points on either side of the trailer, wrapping the excess material if necessary to eliminate slack. Before you hit the road, take a moment to double-check each connection site. [11] X Research source If you’re worried about taller items falling over lengthwise, you can run an addition 1-2 ties from the front of the trailer to the back. Always tie down your cargo when towing an open trailer. It may also be a good idea to secure select items, like top-heavy furniture and appliances, in enclosed trailers that aren’t completely full. The exact number of tie-downs you use will vary depending on how much and what kind of cargo you’re carrying. You may be able to get by with 1 or 2 for small- and medium-sized items that aren’t in danger of tipping over, whereas you’ll likely need a minimum of 3-4 when moving house or transporting large equipment."
    },
    {
      "title": "Measure the height of both your vehicle and trailer hitches.",
      "content": "Measure the height of both your vehicle and trailer hitches. Park the towing vehicle and trailer back-to-front on a level patch of ground. Use a tape measure to find the distance from the ground to the top of the hitch or hitch receiver opening on your vehicle. Then, measure a second time from the ground to the top of the coupler on your trailer. [12] X Research source Be sure to also measure the length of your hitch ball, if you have one already. You’ll need this measurement to select the perfect ball mount for your hitch. Most hitch balls are between 2 1 ⁄ 2 to 3 in (6.4 to 7.6 cm) in length."
    },
    {
      "title": "Find the difference of the 2 measurements to equip the right ball hitch.",
      "content": "Find the difference of the 2 measurements to equip the right ball hitch. Subtract the smaller measurement from the larger one to determine the height distance between the vehicle and trailer hitches. Once you’ve done that, subtract the length of your hitch ball. If your vehicle’s hitch is lower than the trailer coupler, you’ll need an elevated ball mount, or one that has “rise.” If your vehicle’s hitch is higher than the trailer coupler, you’ll need a mount with “drop” to make up the height difference. [13] X Research source If your hitch is 15 in (38 cm) high and your coupler is 10 in (25 cm) high, you’d subtract 10 from 15 to get a height difference of 5 in (13 cm). This means that the ball mount needs to drop 5 in (13 cm) to meet the trailer. Conversely, if your hitch is 10 in (25 cm) high and your coupler is 15 in (38 cm), you’d subtract 10 from 15, giving you a necessary rise of 5 in (13 cm). The hitch ball will reduces the total rise or drop by its length. For example, if the ball is 3 in (7.6 cm) long, subtract it from 5 in (13 cm) to get a drop of 2 in (5.1 cm)."
    },
    {
      "title": "Select a mount and hitch ball that are the right size for your trailer.",
      "content": "Select a mount and hitch ball that are the right size for your trailer. You’ll need to keep your rise or drop measurement in mind while buying or renting a ball mount to connect your trailer to your towing vehicle. To install your ball mount, insert the shank of the mount into your vehicle’s hitch receiver, then slide the included hitch pin through the aligned holes in the receiver and shank. Secure the hitch pin by slipping the straight leg of the pin clip through the small hole at the end. [14] X Research source The opening in your ball mount should be the same diameter as your hitch ball, or vice versa. There are only 3 standard hitch ball sizes in the U.S.— 1 7 ⁄ 8 in (4.8 cm), 2 in (5.1 cm), and 2 5 ⁄ 16 in (5.9 cm). [15] X Research source Make sure you use a ball mount with a weight rating that matches your vehicle’s towing capacity. You won’t be able to haul any loads greater than that number, even if you use a mount rated for more weight."
    },
    {
      "title": "Back your towing vehicle up to the trailer.",
      "content": "Back your towing vehicle up to the trailer. Put the vehicle in reverse and creep towards the front end of the trailer slowly. Stop when the hitch ball is positioned directly above or beneath the trailer coupler. It may take a few attempts to get the 2 components lined up precisely. [16] X Research source If possible, have another person stand nearby to direct your movements and help you get the hitches centered."
    },
    {
      "title": "Connect the trailer to your vehicle",
      "content": "Connect the trailer to your vehicle by lowering the coupler onto the hitch ball. Lift the latch on the top of the coupler, then turn the handle on the trailer jack clockwise or counterclockwise to raise or lower the coupler enough to bring it down over the hitch ball. When the hitch ball is sitting squarely inside the coupler, flip down the coupler latch and insert the included pin through the hole in the top to lock it in place. [17] X Research source Many trailers come with jacks built in for quick and easy hitching. If yours doesn’t, you can pick one up from any trailer supply company. Trailer jacks range in price from $50 to $400-500 for automated or multi-use models. Use chains to reinforce the connection between the vehicle and trailer hitches. Cross 2 strands of chains under the tongue and hook the ends to the loops on either side of the opposing hitch. The chains will act as a failsafe if the hitch happens to fail for any reason. [18] X Research source"
    },
    {
      "title": "Hook the trailer’s electrical system up to your vehicle if it has brake lights.",
      "content": "Hook the trailer’s electrical system up to your vehicle if it has brake lights. Most newer trailers have retractable wires somewhere near the coupler that are designed to be patched directly into the electrical system of the vehicle towing them. If you find such a wire on your trailer, run it to the socket on the back of your vehicle and plug it in. This will allow you to make use of brake lights and other functions while you’re pulling the trailer. [19] X Research source Test your electrical connection quickly before you get moving. If everything is working correctly, activating the brake lights or turn signal on your vehicle will also activate the corresponding lights at the rear of the trailer. Adjust the wire so that it lays on top of the coupled vehicle and trailer hitches. That way, it will be less likely to become damaged during a rough ride or an accidental disconnection."
    },
    {
      "title": "Drive slowly and carefully once you get out on the road.",
      "content": "Drive slowly and carefully once you get out on the road. Stay at or below the posted speed limit for the area you’re in at all times. It’s also a good idea to avoid exceeding 55 miles per hour (89 km/h) on highways and interstates, regardless of what the speed limit is. Remember, the faster you’re going, the less control you’ll have over the trailer. [20] X Research source If you’ve got a long way to go, set out a little early to give yourself ample time to reach your destination safely. If you’re driving too fast and you’re forced to throw on your brakes, there’s a chance that your cargo could slide, shift, or even come free of its tie-downs."
    },
    {
      "title": "Reduce your speed around turns to prevent swaying.",
      "content": "Reduce your speed around turns to prevent swaying. As you approach the turn, press down lightly on the brakes of your towing vehicle and slow down by 8–10 miles per hour (13–16 km/h) until the road you’re on straightens out. This will keep the trailer from swaying or whipping, which typically happens when you change direction too quickly at high speeds. [21] X Research source It may sometimes be necessary to cut across the opposing lane of traffic in order to make a tight turn. Be extremely cautious when doing this, however, especially when traffic is heavy. If swaying does occur, take your foot off of the accelerator and drive in as straight a path as possible until you regain control over the trailer. Attempting to speed up or slow down could just make the fishtailing effect worse. [22] X Research source"
    },
    {
      "title": "Leave 4-5 seconds’ worth of space between you and vehicle in front of you.",
      "content": "Leave 4-5 seconds’ worth of space between you and vehicle in front of you. This could be 2-3 times the combined length of your towing vehicle and trailer, depending on how fast you’re going. Hanging back a bit more than you ordinarily would will not only give you more room to maneuver comfortably but also increase your reaction time in the event of an accident or sudden slowdown. [23] X Research source When passing a slower-moving vehicle, be sure to switch on your turn signal well ahead of time to alert the driver to your intentions and ensure that you have enough space to accelerate and change lanes. [24] X Research source Bear in mind that you’ll be the one held responsible if you happen to rear-end another driver. The added momentum generated by the weight of your cargo could also cause significantly more damage to other vehicles in a collision scenario."
    }
  ]
}