{
  "url": "https://www.wikihow.com/Make-Old-Fashioned-Hard-Candy",
  "title": "How to Make Old Fashioned Hard Candy",
  "steps": [
    {
      "title": "Before you make candy of any kind, read through the entire instructions for the individual recipe.",
      "content": "Before you make candy of any kind, read through the entire instructions for the individual recipe. You need to be thoroughly aware of what the recipe requires before starting because candy needs precise temperature control and precise actions at the times that the recipe states. Most importantly, remember that candy not attended to is candy that burns!"
    },
    {
      "title": "Check the temperature before making candy.",
      "content": "Check the temperature before making candy. Candy should not be made when the weather is high in humidity or rainy or it has a hard time setting. Check the room temperature––it should be around 60ºF-68ºF (15.5ºC-20ºC), with low humidity. If you have no choice about cooking in sub-optimal temperature conditions, you may be able to compensate by cooking the candy 1 to 2 degrees higher than recommended by the recipe. Altitude will affect the outcome; if you live at high altitude, you may need to make adjustments in accordance with the usual recommendations for high altitude cooking."
    },
    {
      "title": "If you don't already have one, purchase a candy thermometer of good quality.",
      "content": "If you don't already have one, purchase a candy thermometer of good quality. You need to be happy about working with great precision when making candy––it's a science as well as an art. For more details on selecting a candy thermometer, see How to choose a candy thermometer. Never touch the base of a saucepan with a candy thermometer. The pan must always be long enough that the thermometer does not reach the bottom when hung on the pan lip."
    },
    {
      "title": "Avoid changing the ingredient amounts in a recipe.",
      "content": "Avoid changing the ingredient amounts in a recipe. They are precise because they work. Even doubling ingredients in a candy recipe can result in a failure."
    },
    {
      "title": "For the heat source, choose the burner that is wider than the cooking pan you're using.",
      "content": "For the heat source, choose the burner that is wider than the cooking pan you're using. This ensures more even heating."
    },
    {
      "title": "Know how to test the hardness of candy.",
      "content": "Know how to test the hardness of candy. This can be done manually or using a thermometer. The thermometer is easiest, but it's handy to know how to test the temperature manually, which you can learn to do before using a recipe by reading How to test candy hardness stages."
    },
    {
      "title": "Gather the ingredients and items needed before starting.",
      "content": "Gather the ingredients and items needed before starting. Have everything in place."
    },
    {
      "title": "In a large saucepan, combine the sugar, corn syrup and water.",
      "content": "In a large saucepan, combine the sugar, corn syrup and water. Stir over medium heat until the sugar has dissolved, about 5 minutes. Without stirring, let the mixture come to a boil which should be about another 5 minutes,"
    },
    {
      "title": "Raise the temperature to high as it boils.",
      "content": "Raise the temperature to high as it boils. Right before the liquid reaches exactly 300ºF/150ºC, add the food coloring and flavoring to the mixture. Doing so will allow the boiling action to stir the coloring and flavoring into the mixture."
    },
    {
      "title": "Watch the thermometer until the temperature is at exactly 300ºF/150ºC.",
      "content": "Watch the thermometer until the temperature is at exactly 300ºF/150ºC. (If you do not have a candy thermometer you can fill a glass with really cold water then take a drop of the candy liquid and if it solidifies in the shape of a ball and floats to the surface, then its ready for next step.) Remove the mixture immediately at 300ºF/150ºC, or it will burn! After you remove the sugar from heat, the temperature will continue rising but that is not a problem provided that you took it off the heat at 300ºF/150ºC."
    },
    {
      "title": "When it is still very hot, add a dab of flavoring oil and several drops of your choice of food coloring or Kool Aid.",
      "content": "When it is still very hot, add a dab of flavoring oil and several drops of your choice of food coloring or Kool Aid. Mix quickly. Mix food coloring to make fun shades. Try adding the color after stirring in flavor and stir lightly for a swirled effect. Mix flavors or Kool Aid or pour over dried fruit for an added texture."
    },
    {
      "title": "Pour the molten sugar onto a greased cookie sheet.",
      "content": "Pour the molten sugar onto a greased cookie sheet. Allow it to cool. Spread the mixture around the sheet before it cools too much. It is not advised to put the mixture inside the freezer as it makes it harden too fast. Try pouring into candy molds or mini muffin pans instead for a consistent shape."
    },
    {
      "title": "After the sheet cools (30 minutes to an hour), break up the candy into several pieces.",
      "content": "After the sheet cools (30 minutes to an hour), break up the candy into several pieces."
    },
    {
      "title": "Dust with powdered sugar.",
      "content": "Dust with powdered sugar. For a variation, do not dust the pieces––simply leave them as they are and they will look like stained glass. The powdered sugar keeps the candy pieces from sticking together and becoming a large, sharp lump. If you like the effect of the colors without the powdered sugar, make sure you store the pieces on pieces of wax paper and not touching one another."
    },
    {
      "title": "Store if needed.",
      "content": "Store if needed. This candy is best stored in paper bags or metal tins for a fun snack or a quick sugar craving."
    },
    {
      "title": "Gather the ingredients and items needed before starting.",
      "content": "Gather the ingredients and items needed before starting. Have everything in place."
    },
    {
      "title": "Line the baking pan.",
      "content": "Line the baking pan. Use parchment or baking paper, or grease lightly."
    },
    {
      "title": "Pour the sugar, glucose and 175ml/6 fl oz of water into the heavy based saucepan.",
      "content": "Pour the sugar, glucose and 175ml/6 fl oz of water into the heavy based saucepan. Using a wooden spoon, stir until the sugar dissolves."
    },
    {
      "title": "Place on the heat source.",
      "content": "Place on the heat source. Bring to the boil. Cover, then boil for another 3 minutes."
    },
    {
      "title": "Remove the cover.",
      "content": "Remove the cover. Boil until the temperature reaches 154ºC/310ºF, also known as the hard crack stage. (See How to test candy hardness stages for more information)."
    },
    {
      "title": "Add the cream of tartar and the fruit extract (essence) of choice.",
      "content": "Add the cream of tartar and the fruit extract (essence) of choice. Mix through quickly."
    },
    {
      "title": "Pour the candy syrup into the prepared pan.",
      "content": "Pour the candy syrup into the prepared pan."
    },
    {
      "title": "Leave until the candy is cool enough to handle.",
      "content": "Leave until the candy is cool enough to handle. Using lightly oiled scissors, quickly cut small pieces off and use your hands to shape into small balls."
    },
    {
      "title": "Roll in icing (confectioners) sugar to complete.",
      "content": "Roll in icing (confectioners) sugar to complete."
    },
    {
      "title": "Serve or give away.",
      "content": "Serve or give away. These are lovely wrapped in clear cellophane or tucked into a small candy tin as gifts. If you are adding them to a tin, line with wax paper."
    },
    {
      "title": "Store in an airtight container.",
      "content": "Store in an airtight container. Ensure that moisture doesn't get to the drops or they'll lose their appeal and turn sticky."
    },
    {
      "title": "Gather the ingredients and items needed before starting.",
      "content": "Gather the ingredients and items needed before starting. Have everything in place."
    },
    {
      "title": "Measure the flavoring.",
      "content": "Measure the flavoring. Depending on whether you're using 3 or 4 flavorings, measure thirds or quarters in a measuring jug."
    },
    {
      "title": "Pour the sugar and glucose into the saucepan.",
      "content": "Pour the sugar and glucose into the saucepan. Add 150ml/1/4 pint of water. Gently heat and stir well to ensure that the sugar dissolves."
    },
    {
      "title": "Add the measured coloring to the syrup.",
      "content": "Add the measured coloring to the syrup. Bring to the boil, then cover and boil for another 3 minutes."
    },
    {
      "title": "Remove the cover.",
      "content": "Remove the cover. Boil until the temperature reaches 130ºC/265ºF, the hard ball stage."
    },
    {
      "title": "Remove the syrup from the heat.",
      "content": "Remove the syrup from the heat. Separate quickly into three or four batches. Pour in the chosen flavoring for each batch."
    },
    {
      "title": "Using a soup spoon or a dessert spoon, drop small, round shapes of syrup onto the parchment covered tray.",
      "content": "Using a soup spoon or a dessert spoon, drop small, round shapes of syrup onto the parchment covered tray. Carefully add a lollipop stick to each round, covering with a little more syrup if needed."
    },
    {
      "title": "Allow to cool and harden.",
      "content": "Allow to cool and harden. Carefully remove them from the parchment paper. Wrap in clear cellophane or stick into a lollipop holder and they're ready to be shared around or given away as a gift."
    },
    {
      "title": "Assemble the ingredients and items needed before starting.",
      "content": "Assemble the ingredients and items needed before starting. Have everything in place. Prepare the baking pan by covering in parchment paper or oil a marble slab."
    },
    {
      "title": "Cook the hulled barley in the water gently for 5 hours.",
      "content": "Cook the hulled barley in the water gently for 5 hours. Keep the heat low and be aware that it's easy to burn barley, so keep a regular check on the water level."
    },
    {
      "title": "Strain the liquid.",
      "content": "Strain the liquid. It will look like white jelly. Then return it to the pan."
    },
    {
      "title": "Warm the sugar.",
      "content": "Warm the sugar. Then add it to the pan and stir until it is dissolved, over a gentle heat."
    },
    {
      "title": "Boil the mixture until the temperature reaches 156ºC/310ºF, the hard crack stage.",
      "content": "Boil the mixture until the temperature reaches 156ºC/310ºF, the hard crack stage."
    },
    {
      "title": "Pour the candy syrup over the lined tray or oiled slab.",
      "content": "Pour the candy syrup over the lined tray or oiled slab."
    },
    {
      "title": "Once the barley sugar has cooled enough to touch, immediately cut it into long strips using lightly oiled scissors.",
      "content": "Once the barley sugar has cooled enough to touch, immediately cut it into long strips using lightly oiled scissors. Twist as you cut, to form the traditional twisted barley shape."
    },
    {
      "title": "Leave the strips to harden.",
      "content": "Leave the strips to harden. Once hardened, they can be wrapped individually in cellophane or place on wax paper inside an airtight tin."
    }
  ]
}