{
  "url": "https://www.wikihow.com/Make-Soda",
  "title": "How to Make Soda",
  "steps": [
    {
      "title": "Start by making a thick soda-syrup base.",
      "content": "Start by making a thick soda-syrup base. The easiest and fastest way to make your own soda is to create a thick flavoring and add a small amount to already-carbonated soda water. If you want to start from scratch, skip to the next method and brew your own. Making syrup saves you the trouble of messing with yeast, and works in much the same way an old-fashioned soda jerk used to work, or a modern soda machine. [1] X Research source In a saucepan, mix the following ingredients: 1 cup granulated sugar about 1/2 cup water 1/2 cup fresh fruit juice, or two tablespoons of flavor extract"
    },
    {
      "title": "Bring the mixture to a boil in a heavy saucepan.",
      "content": "Bring the mixture to a boil in a heavy saucepan. Whisk vigorously to keep the sugar moving, staying careful to avoid burning it. It should melt thoroughly and form a thick syrup. Bring the syrup to a boil."
    },
    {
      "title": "Reduce the syrup by half.",
      "content": "Reduce the syrup by half. Turn down the heat and let simmer until half of mixture is left. It'll look pretty thick and sweet, which is good. It should be very sweet and concentrated, perfect for cutting in cold soda water. [2] X Research source"
    },
    {
      "title": "Store in squeeze bottle and refrigerate.",
      "content": "Store in squeeze bottle and refrigerate. Let the syrup cool and store it in an easy-access container in the refrigerator. It should be good for a few weeks, or more. If you've got a sports water bottle, that would be perfect for storing. You can portion out a squirt or two of the syrup per glass of soda you want to make, and keep it nicely slotted in the fridge door."
    },
    {
      "title": "Serve by mixing with ice and seltzer water.",
      "content": "Serve by mixing with ice and seltzer water. Fill a glass with soda water and add a small squirt of the soda syrup to it, mixing it thoroughly with a spoon until it becomes integrated. Give it a taste and add more if necessary, or dilute it further with more soda water. Serve chilled and enjoy. [3] X Research source If you've got access to a carbonator, you can even bubble up your own soda water to streamline the process and make everything yourself. While a carbonator can cost a pretty penny, you'll be able to start making your own soda water for free. If you drink lots of it, it'll pay for itself in no time."
    },
    {
      "title": "Assemble the necessary ingredients and equipment.",
      "content": "Assemble the necessary ingredients and equipment. Brewing your own soda is a whole lot easier than you might think. All you need is some sugar, bottles, flavoring, and a little time. To get started on your own batch, you'll need: Enough bottles to hold roughly a gallon of liquid . Old recycled plastic soda bottles work fine, as long as you clean them properly. Many soda-makers prefer the plastic bottles because they have less of a chance of breaking while the soda bubbles. Glass bottles, on the other hand, are more environmentally friendly and will last longer. Flip-cap glass beer bottles work great for making soda, as long as you keep an eye on them while they carbonate. Sweetener . Using regular white sugar is fine, though alternative sweeteners like honey or agave nectar are also effective if you want to cut refined sugar from the equation. [4] X Research source You'll need about a half-cup to a cup of sugar or the equivalent in alternative sweetener, depending on how sweet you want your soda. Yeast . Commercial yeasts like champagne yeast are commonly available at groceries, natural food stores, and beer outlets, and are perfect for getting your soda bubbling. Don't use bread yeast to make soda. Flavoring . The sky's the limit when it comes to choosing flavors for your homemade soda. Soda extracts and fruit extracts are commonly available at home-brewing stores, in flavors like root beer, ginger, and fruit flavors. It's also just as easy to use whole raw ingredients to cook up your own flavors. Want to learn to make honey-lemon-ginger soda? We've got you covered."
    },
    {
      "title": "Sterilize and wash your bottles.",
      "content": "Sterilize and wash your bottles. You'll need to let your cooked-up soda sit and bubble in the bottles for at least 24 hours at room temperature, which means you need to sterilize and wash them before you get started to kill any bacteria that will taint the soda. If you're using plastic bottles , soak them in a mixture of chlorinated bleach and water--1 tsp. bleach per gallon water--for at least 20 minutes. Wash the bottles thoroughly with dish soap and water to remove any traces of bleach, which will kill the yeast and hurt the carbonation process. If you don't want to use bleach, you can use a natural alternative, like Straight-A, which contains no chlorine. [5] X Research source If you're using glass bottles , you can use the same method for plastic bottles, or simply boil them for at least 5-10 minutes to kill bacteria."
    },
    {
      "title": "Cook up the flavored syrup.",
      "content": "Cook up the flavored syrup. The basic method of brewing soda is to cook up a sugary batch of flavored liquid, then add the activated yeast, and let it sit in bottles to carbonate. The combination of flavors will vary depending on what kind of soda you want to make, but the basic ratio should be about 2 cups of sweetener for every gallon of water you use in the soda, and 2 tablespoons (29.6 ml) of extract. This will form the uncarbonated base of your soda. If you're using extracts for flavoring , bring the temperature to hot, but not boiling, about 100 or 110 째F (38 or 43 째C), and dissolve the sugar in the liquid. Add about 2 tablespoons (30 ml) of your flavoring extract and allow the mixture to cool for several minutes until the temperature comes down. If you're using raw ingredients for flavoring , bring a gallon of water just to a boil in a large pot and add the sugar, stirring vigorously to dissolve it. Let it cook for a few minutes, stirring continuously, so the flavors infuse, then remove it from the heat and add the yeast."
    },
    {
      "title": "Add the yeast.",
      "content": "Add the yeast. You've got a basic flavored drink, but now you've got to add the bubbles. When the sugary liquid has come down to around 100 째F (38 째C)--it needs to be warm enough to activate the yeast, but not so warm as to kill it--add about a 1/4 teaspoon of champagne yeast to the mixture and stir vigorously to activate. Yeast, depending on the age and the potency and the climate, can be a tricky thing. When you're first starting out, you may end up with soda that's too carbonated, or soda that's too flat, depending on how much you use. Anywhere from 1/4 to 1/2 teaspoon can be an appropriate amount. It's best to err on the side of not-carbonated-enough, though, since you can add bubbles after the fact. Overcarbonated soda can cause bottles to explode, which can be messy at best and dangerous at worst, especially if you're using glass bottles. For your first batch, aim for the low end of carbonated and experiment to see what works best for you."
    },
    {
      "title": "Pour soda into the bottles.",
      "content": "Pour soda into the bottles. Use a sanitized funnel to pour soda directly into your sanitized bottles after adding the yeast, and cap them. Allow the bottles to sit on the counter at room temperature for at least 24 hours to carbonate fully, then put them immediately into the refrigerator. If you cooked up soda with raw ingredients, it might be appropriate to run the soda through a strainer to get out any sediment or hard bits that might be left at the bottom of the pot. If the bottles get too warm after being filled and capped, they may pop their tops or burst. As soon as they're done bubbling at room temperature, put them in the fridge to keep them safe."
    },
    {
      "title": "Take your first taste outdoors.",
      "content": "Take your first taste outdoors. After letting the soda sit for 24 hours, take a bottle outside and open it. It might fizz up uncontrollably, letting you avoid a nasty mess if you're in the yard instead of the kitchen. If you're satisfied with the carbonation and the taste, put the bottles in the fridge and enjoy them over the next week or so. After five days in the fridge, they'll tend to lose some of their carbonation and become flat. [6] X Research source If the soda isn't as bubbly as you'd like it, you can let them sit on the counter for another day or two to hopefully increase the carbonation. If that doesn't work, you can also add another tiny pinch of carbonation to each bottle, if you want, to try again. Or just enjoy the sodas slightly flat and cook up another batch!"
    },
    {
      "title": "Try out an old-fashioned root beer.",
      "content": "Try out an old-fashioned root beer. Because sarsaparilla bark was outlawed by the FDA a long time ago, commercial root beer is made with root beer extract. It's commonly available in homebrew stores for $3-$5, enough to make several batches of your own homemade root beer. The materials pay for themselves in the long run. Zatarain's is a common and cheap brand that's widely available, but experiment with different varieties to find one you like best. [7] X Research source Add two tablespoons of root beer extract after boiling the sweetener and water, before adding the yeast. Try using brown sugar instead of white for an added molasses kick to the finished product. [8] X Research source Try out other roots for unusual earthy-botanical sodas. Licorice root extract is also available that tastes delicious and surprising, especially when mixed with a little lemon rind."
    },
    {
      "title": "Make fruit soda from fruit juices or extracts.",
      "content": "Make fruit soda from fruit juices or extracts. Orange, grape, lemon-lime, strawberry, even lemon-papaya: fruit sodas are where it's at. Adding a few tablespoons of any fruit extracts you can find will give you a great fruity summertime soda. [9] X Research source Instead of using extract, start your soda base with grape juice instead of water to make authentic grape soda. It's a far cry from that fake-tasting purple stuff you can get at the store. If you want to make a citrus-based soda, steep the rinds of oranges, lemons, or limes in the sugar-water mixture for several hours before straining and adding the activated yeast. You'll get the most potent flavor from the rind. Consider adding a few drops of food coloring if you want the flavor to match the look."
    },
    {
      "title": "Try cracking the Coke-code.",
      "content": "Try cracking the Coke-code. The flavors that go into Coca-Cola are almost impossible to identify and replicate for a reason--you don't become the number one selling soda for nothing. With the right combinations of food-grade essential oils added to a basic soda mix, though, you can come close to approximating the classic flavor of the most famous cola. Experiment with different combos to get the flavor as close as possible, but start with a combination of equal amounts of the following surprising flavors to get in the neighborhood: [10] X Research source orange lime lemon nutmeg coriander lavender"
    },
    {
      "title": "Brew up some sweet ginger ale.",
      "content": "Brew up some sweet ginger ale. It's a simple classic, cool, soothing, and refreshing. Making ginger ale from raw ginger and sweetened with honey will beat any commercial soda on the market, perfect for mixing into cocktails or drinking on ice. To make up your own ginger ale: [11] X Research source Mix up a gallon of water, a cup of honey, and the juice of two small lemons in a big pot and bring to a boil. Grate at least two thumb-sized (about 2 inches) pieces of peeled ginger into the pot and let it cool for at least an hour. When the temperature has subsided, you can add the yeast and strain the ginger pieces through a strainer before bottling. Let it sit for at least 48 hours before refrigerating, and let it refrigerate for a few days for the best results. [12] X Research source"
    }
  ]
}