{
  "url": "https://www.wikihow.com/Make-Your-Boyfriend-Break-up-With-You",
  "title": "How to Make Your Boyfriend Break up With You",
  "steps": [
    {
      "title": "Pull away from him gradually.",
      "content": "Pull away from him gradually. If your boyfriend is used to having a close relationship with you, try acting a little distant. Start going longer and longer before you return his phone calls or texts, and try to stretch out the time between visits or dates with him. Also, avoid calling or texting him first, at least most of the time. Do this a little at a time so it won't be super obvious. [1] X Research source For instance, you might wait 5 or 10 minutes before you answer a text instead of responding right away. You might also cancel a date at the last minute by saying something like, \"I'm not feeling very well. I really need to stay in tonight.\" You might also skip celebrating his birthday or your anniversary. If he asks why, just tell him you forgot. Cut your conversations a little shorter than normal if you can't avoid talking to him. For instance, if you normally talk on the phone every day after work and you think he would get suspicious or mad if you missed the call, you might answer, then make an excuse for why you need to get off the phone after a few minutes. Reader Poll: We asked 179 wikiHow readers if they think it's acceptable to ghost someone, and 53% said No . [Take Poll] It's best to be honest with them and tell them how you feel, instead."
    },
    {
      "title": "Act bored when the two of you are together.",
      "content": "Act bored when the two of you are together. Instead of being cute and flirty when you're with your boyfriend, try to act stilted and uncomfortable. Give short answers to any questions he asks, and don't try to start any interesting conversations with him. You can even act a little annoyed, like you don't want to be there. [2] X Research source For instance, if he asks what you've been doing that day, you might say something like, \"Nothing much, it was a normal day at work, then I came over here.\" If he starts to get upset, you can either act a little more warmly to try to make him feel better, or you can talk about how you really feel by saying something like, \"I don't really want to be here right now.\""
    },
    {
      "title": "Be vague about the future.",
      "content": "Be vague about the future. If you don't see a future together with your boyfriend, don't make plans that include him, and try to avoid committing to specific plans. If he mentions doing something in the near future, for instance, you might say something like, \"We'll see, I don't know what I'll be doing then.\" [3] X Research source You can also get annoyed when he asks you questions. If he asks you what you are doing over the weekend, reply with something like \"Why do you need to know? You don't have to know where I'm at every moment.\" If he realizes you can't commit to the weekend, he might get the hint that you don't want to commit to a future with him. When you do talk about the future, don't include him in the plans. Talk about how you want to go on vacation with your friends or are thinking about looking for a job in a new city. If you fail to mention him in any of your plans, he'll know you aren't planning a future with him."
    },
    {
      "title": "Avoid saying \"I love you.\"",
      "content": "Avoid saying \"I love you.\" Whenever he tells you he loves you, don't say it back. If he asks if you love him, say something noncommittal such as \"Sure,\" or \"Uh huh.\" If you do say it, don't sound sincere or convincing, as if it is an afterthought. [4] X Research source For instance, if he says something like, \"I love you so much,\" you might say something like, \"That's so sweet.\" Keep in mind that this might really hurt his feelings and could provoke an argument. However, if you really don't love him, it's better in the long run to avoid making him feel like you do."
    },
    {
      "title": "Ask him to give you some space.",
      "content": "Ask him to give you some space. A good way to stop spending time with him is to tell him you need some time away from him. If he starts calling or texting you after a while, just ignore all his attempts. He will eventually understand what you are doing and break things off with you. [5] X Research source For instance, you might say something like, \"I feel like all we do is argue lately. I need some space, so I'm going to stay with my sister this weekend. I'll talk to you when I get back.\""
    },
    {
      "title": "Stop being intimate.",
      "content": "Stop being intimate. Limiting any physical intimacy will definitely send up a red flag about your relationship. No matter what level of intimacy your relationship has gotten to, start backing off from him. For instance, avoid kissing or snuggling with him, or act like you're reaching in your purse or looking at your phone if he tries to hold your hand. [6] X Research source If you are having sex, tell him you don't feel like it or aren't in the mood. If he asks you why, don't give him a reason. In addition to making your boyfriend feel like things are fine, being physically intimate can make you feel more confused about what you really want. [7] X Research source"
    },
    {
      "title": "Complain about little things to annoy him.",
      "content": "Complain about little things to annoy him. While you don't necessarily have to pick fights with your boyfriend, you may be able to push him away by coming up with little ways to show disapproval. For instance, you might intentionally take something he says the wrong way, or you could make him feel like he can't do anything right. [8] X Research source For instance, if he's running a little late, you might say something like, \"I'm not surprised, you're never on time for anything.\" If he picks a restaurant for the two of you to eat at, you might say, \"Um no thanks, that place is gross. I'll just make a sandwich.\" Keep in mind that this could really affect your boyfriend's self-esteem, especially if he's sensitive. It's much kinder in the long run to just be honest with him about wanting to break up."
    },
    {
      "title": "Act overly clingy if he's the independent type.",
      "content": "Act overly clingy if he's the independent type. Some people like having plenty of space in a relationship. If that's the case with your boyfriend, you may be able to push him away by acting overly affectionate anytime he's around. Pile on the PDA by holding his hand, wrapping your arms around him, and kissing him on the cheek while he's talking to other people. [9] X Research source You might also act jealous if he talks to other girls, demand to know where he's been at all times, or pretend to be upset if he doesn't answer your calls or texts right away. If your boyfriend is nervous about commitment, you might start pushing him to talk more about a future with you. That could make him uncomfortable enough to break up with you. However, it could backfire and make him start seriously thinking about taking your relationship to the next level so he doesn't lose you."
    },
    {
      "title": "Change your social media.",
      "content": "Change your social media. If you and your boyfriend are on social media, you may be able to use that as a way to hint at wanting to break up. For instance, if you have a picture of the two of you as your profile picture, you might change it to a great selfie, or a picture of you and your dog, instead. [10] X Research source For an even more obvious hint, try changing your relationship status to \"It's Complicated,\" or remove your status from your profile altogether."
    },
    {
      "title": "Let your friends know you're thinking of ending things.",
      "content": "Let your friends know you're thinking of ending things. The next time that you and your boyfriend are going to hang with your friends, give them a heads up about the situation. Tell them that you're waiting to see if he breaks up with you, and they don't have to treat him as nice or be as welcoming as they normally would. Then, when you are all together, give more attention to your friends than you do to him. He will feel the cold shoulder from all of you and know that something is up. [11] X Research source Keep in mind that if he gets upset by this treatment, he may bring it up again when the two of you are alone."
    },
    {
      "title": "Complain about his friends.",
      "content": "Complain about his friends. Whenever your boyfriend talks about his friends, roll your eyes or complain about them. Point out any little flaws you've noticed about them, as well. Chances are, he'll feel an increased sense of loyalty toward his friends, which could end up pushing him away from you. If you genuinely like his friends, don't do this. They could hear what you said about them, which could hurt your chances of having a friendly relationship with them in the future."
    },
    {
      "title": "Compare him to your ex.",
      "content": "Compare him to your ex. Nothing will make a guy run faster than if you bring up your ex-boyfriend all the time. Mention him in conversation, talking about how much you miss him or how you wonder what he's been up to. Not only will your boyfriend's ego be bruised, he will also get the hint that he is no longer good enough for you because you keep thinking about your ex. [12] X Research source For example, you could say something like, \"You're the first skinny guy I've ever dated. My ex was huge; he went to the gym every day!\" Before doing all this, you should think whether you love someone for who they are or because of what they bring into your life. You may want to break up with someone because you are traveling to a different country, losing attraction, or your parents do not want them. You should not do things because others want you to do them."
    }
  ]
}