{
  "url": "https://www.wikihow.com/Hold-Your-Mini-Lops",
  "title": "How to Hold Your Mini Lops",
  "steps": [
    {
      "title": "Do not hold your mini lop right away.",
      "content": "Do not hold your mini lop right away. As cute as your mini lop may be, do not rush to pick him up and hold him in your arms. In the wild, the only time rabbits are held is when they are being picked up by a predator—you certainly don’t want your mini lop to see you as the enemy! [4] X Research source Give your mini lop time to become comfortable with you and see you as someone he can trust. If you need to move him from one area to another, place him in a pet carrier or sturdy cardboard box that has some tasty treats in it. Leave it in his area for a few days so that he does not automatically associate it with going to the veterinarian. [5] X Research source"
    },
    {
      "title": "Spend quiet time with your mini lop.",
      "content": "Spend quiet time with your mini lop. Your mini lop will be good at sensing if you are about to pick him up. To prevent him from associating your presence with only being picked up, spend some quality bonding time with him. For example, sit calmly in his pen and let him come to you. Rabbits are independent animals, so you should give your mini lop the freedom to approach you when he feels like it. When you are in his area, do not pay attention to him. [6] X Research source While you wait for him to approach you, consider reading a book or magazine. The more quiet time you spend with him, the more your mini lop will become comfortable with your presence. Fortunately, lop-eared rabbits enjoy interacting with their owners, [7] X Research source so it probably won’t be long before your mini lop comes to you for attention and affection."
    },
    {
      "title": "Approach your mini lop with food.",
      "content": "Approach your mini lop with food. This is not as simple as just walking up to your mini lop. Making a direct approach may look aggressive to him, causing him to run in the opposite direction. Instead, walk towards him at a slight angle, as if you are about to walk right past him. [8] X Research source To prevent weight gain, offer food that is part of his normal daily food ration. [9] X Research source You may need to stop a short distance away from your mini lop and let him come to you. [10] X Research source Eventually, he may allow you to walk up to him with the food. You can also offer him food while you are sitting in his area."
    },
    {
      "title": "Identify and touch the 'hold' areas during bonding time.",
      "content": "Identify and touch the 'hold' areas during bonding time. When you hold your mini lop, you will mainly be touching his chest, shoulders and bottom. Keep in mind that your mini lop is very perceptive—if you touch him only when you want to hold him, he will soon associate being touched in those three areas with being picked up. [11] X Research source Your goal should be to touch him in those areas, regardless of whether you want to hold him. Just like your mini lop needs time to become comfortable with you, he also needs time to adjust to being touched. As you sit and spend time with him, touch him all over his body. The more you touch the three ‘hold’ areas without picking him up, the less likely he will think you’re about to pick him up and hold him. [12] X Research source Be patient with your mini lop. It may take a while before he begins to enjoy your touch."
    },
    {
      "title": "Place one hand under your mini lop’s chest.",
      "content": "Place one hand under your mini lop’s chest. By now, you may be getting a little anxious to pick up your mini lop and hold him. Not so fast! You don’t want to risk weakening your bond with him by picking him before he’s ready. Get him used to the action of being held by putting one hand under his chest and applying gentle pressure. [13] X Research source Approach his chest from his side so your hand reaches from one side of his chest to the other. Use just enough pressure so he feels what you’re doing, but not so much that his feet leave the ground. [14] X Research source Your mini lop may want to run away. If he does, let him do so and try again later. When he stops running away, gently apply more pressure with your hand until his feet barely leave the ground. [15] X Research source Place his feet back on the ground after a few seconds. Give him a few treats with your other hand. [16] X Research source"
    },
    {
      "title": "Place your hand on your mini lop’s bottom.",
      "content": "Place your hand on your mini lop’s bottom. When your mini lop feels comfortable with his front feet being off the ground, practice lifting his back feet up. Cup your hand around your mini lop’s bottom so your fingers wrap slightly under his body between his to back legs. Add a gentle yet increasing amount of pressure to lift up his back legs. His front legs should still be on the ground. Return his back feet to the ground after a few seconds. Give him treats with your other hand."
    },
    {
      "title": "Place both of your hands in the ‘hold’ position.",
      "content": "Place both of your hands in the ‘hold’ position. Now it’s time to support his chest and bottom at the same time. Place one hand under your mini lop’s chest and run your other hand down his back before positioning it around his bottom. Lift only his front feet off the ground and then return them to the floor. [17] X Research source Keep some treats on the ground that he can eat when you put his front back down. You can try lifting his back end up, too."
    },
    {
      "title": "Let your mini lop run away if he wants to.",
      "content": "Let your mini lop run away if he wants to. Your mini lop may want to move away when you are touching him. That’s okay! Let him get away without going after him. If you try to grab him, he may associate being touched with something negative—this would make it harder for you to pick him up and hold him. [18] X Research source Your rabbit needs to continue to feel comfortable around you. When you give him freedom to move away, he will be more relaxed around you. Give him treats to encourage him to stay nearby as you are touching him. [19] X Research source"
    },
    {
      "title": "Pick up your mini lop.",
      "content": "Pick up your mini lop. It may have taken a few weeks, or maybe even longer, to get your mini lop comfortable with the idea of being held. Your patience has finally paid off! With your hands positioned under his chest and around his bottom, gently pick your mini lop off the ground. Start with holding him just slightly off the ground, then work up to holding him in your lap. [20] X Research source You may want to hold his back legs with the hand that’s supporting his bottom. This would prevent him from kicking his back legs out. Your mini lop should not be wriggling or struggling when you hold him. If he does, let him go. Start by holding him for a few seconds, then slowly increase the amount of time you hold him. Give him a treat when you can pick him up and hold him without him struggling. [21] X Research source"
    },
    {
      "title": "Hold your mini lop firmly.",
      "content": "Hold your mini lop firmly. Your mini lop will want to feel secure in your arms. To do this, keep a firm hold on his chest and bottom. If your mini lop does not feel safe and secure when being held, he may begin to panic and struggle to escape, which could result in you getting scratched. If your mini lop begins to struggle, he may start kicking his back legs, which are surprisingly strong. He may kick them so hard that he breaks his back."
    },
    {
      "title": "Hold your mini lop frequently.",
      "content": "Hold your mini lop frequently. Although your mini lop may not always feel comfortable being held, you should aim to hold him as often as you can (and as often as he will allow). [22] X Research source It would be ideal to hold him every day, but keep in mind that your mini lop may not want to be held that often. Read his body language. If he initiates affection with you, he may be in the mood to be held. Frequent handling may help your mini lop maintain a calm temperament, but only if he is comfortable with the idea in the first place."
    },
    {
      "title": "Teach your children how to hold your mini lop.",
      "content": "Teach your children how to hold your mini lop. As tiny as mini lops can be, they were bred to be hardy enough to be held by young children. [23] X Research source However, children can be rough. If you have children, teach them how to properly pick up and hold your mini lop. Do not allow your children to run with your mini lop in their arms. This could be very frightening to him. Keep a close eye on your children when they handle your mini lop."
    }
  ]
}