{
  "url": "https://www.wikihow.com/Learn-to-Read-Piano-Music",
  "title": "How to Learn to Read Piano Music",
  "steps": [
    {
      "title": "Determine if the upper line is in treble clef.",
      "content": "Determine if the upper line is in treble clef. While it's not so common for the bass clef to be in the right hand, it is still a possibility; such as when the music requires your hands to cross for example! If your sheet music has bass clef in the right hand, you can skip this part of the process."
    },
    {
      "title": "Learn the key signature.",
      "content": "Learn the key signature. The key signature comes right after the treble clef. This will consist of flats and sharps of different notes. There are also orders of flats and sharps to help you determine the key signature quickly and easily. The order of flats is B - E - A - D - G - C - F. The order of sharps is the same as the order of flats, but reversed. The order is then F - C - G - D - A - E - B. For example: Remember that a sharp looks like '#' and a flat looks like 'b' Notice the key signature has 3 flats. Therefore, B, E, and A will all be flat. Notice the key signature has 6 flats. Therefore, B, E, A, D, G, and C will be flat. Notice the key signature has 2 sharps. Therefore, F and C will be sharp. Notice the key signature has 5 sharps. Therefore, F, C, G, D, and A will be sharp."
    },
    {
      "title": "Learn the time signature.",
      "content": "Learn the time signature. The time signature is the two numbers at the beginning of the line. The top number will indicate how many of the lower-number notes are in each bar. For example: 4 / 4 will have FOUR QUARTER note beats 5 / 8 will have FIVE EIGHTH note beats 12 / 8 will have TWELVE EIGHTH note beats A \"C\" with a line through it means cut time where you only have 2 half note beats per measure"
    },
    {
      "title": "Learn where the notes are.",
      "content": "Learn where the notes are. There are 5 lines which indicate these notes in order from bottom to top: E - G - B - D - F. Then, in between those lines, you have F - A - C - E. If a note is above the staff (above the five lines) the pattern of notes continues as shown above"
    },
    {
      "title": "Determine if the lower line is in treble clef.",
      "content": "Determine if the lower line is in treble clef. Again, it is possible to have treble clef in the left hand (lower line). If that is the case, you can refer back to Part 1 to understand the rhythms and time signatures."
    },
    {
      "title": "Learn the key signature.",
      "content": "Learn the key signature. The key signature shouldn't be different from the treble clef's signature if your right hand is treble clef. To determine what notes are flat and sharp, you can refer to the order of flats and sharps. The order of flats is B - E - A - D - G - C - F. The order of sharps is the same as the order of flats, but reversed. The order is then F - C - G - D - A - E - B. For example: Remember that a sharp looks like '#' and a flat looks like 'b' Notice the key signature has 3 flats. Therefore, B, E, and A will all be flat. Notice the key signature has 6 flats. Therefore, B, E, A, D, G, and C will be flat. Notice the key signature has 2 sharps. Therefore, F and C will be sharp. Notice the key signature has 5 sharps. Therefore, F, C, G, D, and A will be sharp."
    },
    {
      "title": "Learn the time signature.",
      "content": "Learn the time signature. Again, this is no different than the treble clef's. The time signature is the two numbers at the beginning of the line. The top number will indicate how many of the lower-number notes are in each bar. For example: 4 / 4 will have FOUR QUARTER note beats 5 / 8 will have FIVE EIGHTH note beats 12 / 8 will have TWELVE EIGHTH note beats A \"C\" with a line through it means cut time where you only have 2 half note beats per measure"
    },
    {
      "title": "Learn where the notes are.",
      "content": "Learn where the notes are. For bass clef, there are still 5 lines, but different notes to go with them. Starting from the bottom line to the top, G - B - D - F - A. The lines in between will be A - C - E - G. If a note is above the staff (above the five lines) the pattern of notes continues as shown above"
    },
    {
      "title": "Learn each note at a time.",
      "content": "Learn each note at a time. Now you can continue to start reading sheet music. It is essential to learn the difference between a single note and a chord. A chord will be multiple notes stacked on top of each other. This simply means that you must play all of those notes at once to play the chord."
    },
    {
      "title": "Learn the rhythm.",
      "content": "Learn the rhythm. There are a lot of different types of notes that correlate to different rhythms."
    },
    {
      "title": "Learn the dynamics.",
      "content": "Learn the dynamics. Dynamics are letters that generally appear between the lines of the right and left hand. p - piano - softly mp - mezzo piano - slightly louder piano mf - mezzo forte - slightly louder than mp f - forte - a loud talking voice"
    },
    {
      "title": "Learn the articulation.",
      "content": "Learn the articulation. There are lots of different kinds of articulation that signify a lot of things. 1 - Staccato - played very short and to the point 2 - Slurs - played so that the notes don't have any gaps of sound between them 3 - Tepee - Played short but with \"umph\" 4 - Accent - Played with force at front 5 - Legato - played triumphantly to the notes extent"
    },
    {
      "title": "Play them together.",
      "content": "Play them together. This last step is very tricky if you're just learning piano. A neat tip is that the notes/chords line up from right to left hand. The notes in the picture above shows that."
    }
  ]
}