{
  "url": "https://www.wikihow.com/How-Tight-Should-a-Watch-Be",
  "title": "How Tight to Wear Your Dress or Fitness Watch",
  "steps": [
    {
      "title": "Keep your watch loose enough to slide your pinky under the strap.",
      "content": "Keep your watch loose enough to slide your pinky under the strap. Slide your pinky between your skin and the clasp of the watch strap. If it fits snugly without having to jam it in there, then your watch is the perfect fit—loose enough to be comfortable, but tight enough to stay in place. Check for marks around your wrist when you take the watch off. If you notice any irritated spots, try wearing the watch a notch looser next time. It’s usually better to err on the side of wearing your watch too loose than too tight. If it’s really tight, it can be painful or affect your circulation."
    },
    {
      "title": "Leave enough slack so the watch only slides 2 in (5.1 cm) up or down.",
      "content": "Leave enough slack so the watch only slides 2 in (5.1 cm) up or down. Stand up and put your arm down at your side, then notice if your watch drops closer to your hand. Ideally, it should only budge a little bit (preferably not any lower than your wrist bone). Raise your arm straight up into the air, too. The watch should fall just beyond its original placement. [1] X Research source A great spot to position your watch is just above the wrist bone so that the watch face peeks out from under the cuff of a long sleeved shirt. [2] X Research source"
    },
    {
      "title": "Tighten the watch enough so that it doesn’t rotate around your wrist.",
      "content": "Tighten the watch enough so that it doesn’t rotate around your wrist. Adjust the strap so the watch face sits securely on top of your wrist (or on the back side if that’s your preference). Check to make sure there’s a little wiggle room for comfort and good circulation, but not so much that the watch face can turn all the way to the other side of your wrist. Wear the watch face on top of your wrist for most casual or formal occasions. Position the watch face on the back side of your wrist to reduce glare, prevent scratches, or to check the time super quickly and discreetly. [3] X Research source"
    },
    {
      "title": "Make sure your watch feels comfortable!",
      "content": "Make sure your watch feels comfortable! Tighten the strap if you’re worried the watch will slide around too much and irritate you, or loosen it if you feel any pain, discomfort, or loss of circulation. Your comfort is the most important factor in the fit, and this will be slightly different for everyone. [4] X Research source Other factors that affect comfort include the weight of the watch or the material of the band (metal links can pinch your skin or pull wrist hairs if they’re too tight)."
    },
    {
      "title": "Tighten the strap so the sensors under the face touch your skin.",
      "content": "Tighten the strap so the sensors under the face touch your skin. Whether your smartwatch has metal sensors or light sensors, make sure they’re always touching your skin so the watch can monitor your activity accurately. Once it’s on, look under the watch from various angles and try to see the sensors. Ideally, they won’t be visible at all. [5] X Research source Tighten the strap so it’s snug, but not so tight that it’s restricting blood flow or causing you pain or discomfort. It’s OK if the watch moves around a little bit as long as the sensors stay in contact with your skin. If it’s sliding around a lot, tighten the strap another notch. This rule of thumb applies to any smart or fitness watch like a Fitbit, Apple Watch, or Garmin."
    },
    {
      "title": "Wear the watch 2 finger widths above your wrist bone during exercise.",
      "content": "Wear the watch 2 finger widths above your wrist bone during exercise. Slide your watch a bit higher up your wrist than you might normally wear it—this makes it fit a little more snugly and ensures the sensors will touch your skin while you’re working out. If it keeps slipping back down, tighten the strap another notch to keep the watch in place. [6] X Research source"
    },
    {
      "title": "Keep the watch 1 finger width above your wrist bone for casual wear.",
      "content": "Keep the watch 1 finger width above your wrist bone for casual wear. Wear your smartwatch slightly looser when you’re not exercising. Tug it closer to your wrist bone or loosen the strap by a notch. Check to make sure it’s still snug enough that the sensors are in contact with your skin. [7] X Research source If your watch is too loose, the sensors won’t be able to check things like your pulse or movement very accurately. If your watch is too tight, the extra pressure on your veins and arteries could make your watch think your pulse or blood pressure is higher than it actually is."
    },
    {
      "title": "Change or add holes to solid leather, plastic, or textile straps.",
      "content": "Change or add holes to solid leather, plastic, or textile straps. If your watch strap is one solid piece with holes (i.e. no links or chains), then simply put the prong of the clasp in a different hole until you find a fit that’s comfortable. If your watch is still too loose or too tight after trying all the holes, add a new hole similar to how you’d punch a new hole in a belt . Mark the exact spot where the new hole needs to go so your watch fits comfortably. Use a leather hole punch , a drill, or a similar object to puncture the strap. Put on the watch to test the new hole for comfort."
    },
    {
      "title": "Remove links from metal watch bands to adjust the size.",
      "content": "Remove links from metal watch bands to adjust the size. Put on the watch and gather the slack to determine how many links to remove . Then, use a pin pusher or small screwdriver to remove the pins that hold the excess links in the band. Depending on the style of your band, you may have to remove the clasp or separate the band from the watch face first. Once the excess links are out, reconnect the band to the clasp or watch face and try on the watch to test the fit. A lot of times, metal watch bands come with extra links to accommodate many wrist sizes (it’s generally easier to take them out than to add them in)."
    },
    {
      "title": "Order a shorter or longer strap that matches the quality of the watch.",
      "content": "Order a shorter or longer strap that matches the quality of the watch. If you’re unsure about adjusting the watch yourself or have a watch with an easily replaceable band (like a smartwatch), get a new strap that’s bigger or smaller, depending on your need. This is helpful for people with very thin or very thick wrists who struggle to fit into standard watch band sizes. [8] X Research source Measure the circumference of your wrist for the right length (straps are usually measured in millimeters ). Check the width of the old strap so your new one fits onto the watch face. Get a strap of the same quality as your watch. For example, you wouldn’t want a cheap rubber strap on a Rolex (unless that’s your style, then go for it!). Buying a new band or visiting a jeweler may be your only options if your band is a solid metal bracelet."
    },
    {
      "title": "Visit a jeweler or watchmaker to adjust the strap for you.",
      "content": "Visit a jeweler or watchmaker to adjust the strap for you. If you’re hesitant about punching holes or disassembling your fancy new watch strap yourself, take it to a pro for peace of mind. A quality jeweler or watchmaker will have no problem shortening or lengthening the strap for you, although depending on the quality of the watch, it may be a little costly. [9] X Research source A jeweler is probably your best bet if the watch is very expensive, vintage, or a family heirloom."
    },
    {
      "title": "Your watch will sit properly on your wrist at all times.",
      "content": "Your watch will sit properly on your wrist at all times. When your watch fits just right, the face will stay on top or on the bottom of your wrist (whichever you prefer) without rotating around your arm. The band will also stay near the same spot on your wrist, meaning you won’t have to tug it up or down throughout the day to adjust it."
    },
    {
      "title": "The watch will feel more comfortable on your wrist.",
      "content": "The watch will feel more comfortable on your wrist. When your watch is too tight, it can be painful and even cut off your circulation. If it’s too loose, on the other hand, you might feel anxious that it will slide right off your hand or get caught on something, and then find yourself checking or adjusting it all day. When it fits just right, you’ll barely notice it physically and your mind will be at ease knowing it won’t slip away from you. [10] X Research source"
    },
    {
      "title": "Your overall look will seem sharper and cleaner.",
      "content": "Your overall look will seem sharper and cleaner. When your watch is too loose and sliding or twisting around, it can make your ensemble look a little more disheveled than you might like. When it’s snugly in place, though, everyone you pass will get to take a look at your timely accessory and admire your styling. [11] X Research source Other people probably won’t be able to tell if your watch is too tight (unless it’s cutting off your circulation and your hand turns blue, which is a bigger issue!)."
    },
    {
      "title": "Your watch will experience less wear and tear.",
      "content": "Your watch will experience less wear and tear. When a band or strap is too tight, the leather, links, or pins can get stretched and wear out faster. Likewise, if it’s too loose, metal links can knock into each other and wear down from friction. You’ll also develop “wrist awareness” when your watch face sits securely in the same spot all the time, which will help you stop knocking the watch on doorknobs, doorways, or other obstacles. [12] X Research source For the ultimate protection, wear your watch with the face on the inside of your wrist. A little wear and tear is normal. For fine scratches, just buff the watch face with a soft cloth and polish for acrylic or mineral crystal. Use a jewelers cloth to buff out scratches on a stainless steel band."
    }
  ]
}