{
  "url": "https://www.wikihow.com/Greet-People-in-Afrikaans",
  "title": "How to Greet People in Afrikaans",
  "steps": [
    {
      "title": "Greet a stranger formally with “Goeie dag”.",
      "content": "Greet a stranger formally with “Goeie dag”. When you first meet someone, you should greet them formally as a sign of respect with the formal way to say “Hello” in Afrikaans. [3] X Research source You can also offer your hand to the person and shake their hand as a formal way of greeting. Many Afrikaner men will shake hands when they are greeting each other informally and the women will kiss each other on the lips. A man might kiss a woman and visa versa, especially if they are related or close friends. In a business situation, it is custom to greet all attending the meeting or gathering with a friendly handshake."
    },
    {
      "title": "Say “Haai” or “Hallo” if you are greeting an acquaintance or a friend.",
      "content": "Say “Haai” or “Hallo” if you are greeting an acquaintance or a friend. You can use the informal way to say “Hello” in Afrikaans if you know the person or are on familiar terms with the person. Many Afrikaners will greet each other with “Haai” or “Hallo” when they see each other on the street or in their homes. [4] X Research source"
    },
    {
      "title": "Use “Hoe gaan dit met u?”",
      "content": "Use “Hoe gaan dit met u?” if you are greeting a stranger. The formal way to say “How are you?” in Afrikaans is “Hoe gaan dit met u?” It is considered polite to use the formal phrase when you are greeting someone you have just met. [5] X Research source"
    },
    {
      "title": "Use “Hoe gaan dit met jou?”",
      "content": "Use “Hoe gaan dit met jou?” if you are greeting an acquaintance or a friend. The informal way to say “How are you?” in Afrikaans is “Hoe gaan dit met jou?” Only use this greeting if you are on familiar terms with the person you are speaking to. [6] X Research source"
    },
    {
      "title": "Respond to “How are you?”",
      "content": "Respond to “How are you?” formally or informally. To keep the conversation going, you can respond to the formal “Hoe gaan dit met u?” with “Baie goed dankie, en u?” [7] X Research source You can respond to the informal “Hoe gaan dit met jou?” with “Goed, dankie en met jou?” An example dialogue with someone you just met might be: “Goeie dag!” “Goeie dag!” “Hoe gaan dit met u?” “Baie goed dankie, en u?” \"Goed, dankie!\" An example dialogue with someone you know well or are friends with might be: “Haai!” \"Hallo!\" “Hoe gaan dit met jou?” “Goed, dankie en met jou?” \"Goed, dankie!\" A complete pronunciation guide for these greetings can be found at https://www.omniglot.com/language/phrases/afrikaans.php ."
    },
    {
      "title": "Say “Goeiemôre!”",
      "content": "Say “Goeiemôre!” to greet someone in the morning. This is the formal way to say “Good morning” in Afrikaans. [8] X Research source Many Afrikaans speaking people will shorten this to “Môre!” as an informal way to say “Good morning”."
    },
    {
      "title": "Use “Goeie middag” to greet someone in the afternoon.",
      "content": "Use “Goeie middag” to greet someone in the afternoon. This is how you say “Good afternoon” in Afrikaans."
    },
    {
      "title": "Remember the difference between “Good evening” and “Goodnight” in Afrikaans.",
      "content": "Remember the difference between “Good evening” and “Goodnight” in Afrikaans. “Good evening” in Afrikaans is “Goeienaand”, and “Goodnight” is “Goeienag”. Many Afrikaans speaking people will shorten “Goeienag” to “Nag” as an informal way to say “Goodnight”."
    },
    {
      "title": "Say “Goodbye” formally or informally.",
      "content": "Say “Goodbye” formally or informally. To say “Goodbye” to someone you just met, use the formal greeting: “Totsiens”. [9] X Research source “Totsiens” can also be used to say goodbye more casually, as it can be taken to mean “See you later”. Many Afrikaans speaking people will use “Mooi loop” when saying goodbye to a friend or a relative, which means “go/walk well”. [10] X Research source You can also add on to your “Goodbye” with “Lekker dag!”, which means “Have a nice day!” [11] X Research source An example dialogue with someone you just met might be: “Goeiemôre!” “Goeiemôre!” “Hoe gaan dit met u?” “Baie goed dankie, en u?” \"Goed, dankie!\" “Totsiens! Lekker dag!” An example dialogue with someone you know well or are friends with might be: “Môre!” \"Môre!\" “Hoe gaan dit met jou?” “Goed, dankie en met jou?” \"Goed, dankie!\" \"Totsiens, mooi loop!” A complete pronunciation guide for these terms can be found at https://www.omniglot.com/language/phrases/afrikaans.php ."
    }
  ]
}