{
  "url": "https://www.wikihow.com/Make-a-Memory-Box",
  "title": "How to Make a Memory Box",
  "steps": [
    {
      "title": "Find a box that catches your eye.",
      "content": "Find a box that catches your eye. This box can be made from plastic, cardboard, metal, wood – or any other sturdy material. The box can be plain and simple, or rich and ornate. Poke around at thrift shops, antique stores, and estate sales. Look for boxes at junkyards, dumps, and recycled building centers. Try to use a box with which you feel a special connection. [1] X Research source Always be on the lookout. You might notice the box laying on the sidewalk on your way to school, or stuffed into the depths of your garage, or jutting out of a dumpster behind your apartment complex. Consider using a suitcase, or an old lunchbox, or a shoebox. The \"box\" can be any container that holds your memories."
    },
    {
      "title": "Make a box",
      "content": "Make a box . You can craft a simple box from paper , or you can make a sturdier box out of wood . The box should be large enough to hold all of the \"memories\" that you want to save. Plan ahead: you'll probably want to put many more things in here! In general, try to build something at least as large as a shoebox or an old-fashioned hatbox."
    },
    {
      "title": "Put a lock on the box.",
      "content": "Put a lock on the box. You don't need to lock the box up, but it might make your memories feel a bit more secure. You can build a lock into the box, if you want to get crafty. Otherwise, you can use a combination lock or a simple keyed lock to seal the lid to the rest of the box. Think about what you'll be putting in here, and consider how much you would care if anyone else looked through it."
    },
    {
      "title": "Decide whether to decorate the box.",
      "content": "Decide whether to decorate the box. If you want to keep the box private and discreet, then you probably don't want to do much with the outside unless you plan to hide it somewhere very safe. On the other hand, you might want to personalize your memory box so that it very clearly belongs to you. Think about the purpose of this box, and think about the sensitivity of the memories that you'll be putting into it. If you are making a memory box for someone else, then you'll want to decorate it with their needs in mind. Think about whether this person would want a colorful, heavily decorated memory box or a plain, discreet box. Consider that people might be less likely to snoop into the box if it looks boring and ordinary. On the other hand, personalized decoration can be a signal to stay away. People might open an ordinary-looking box thinking that something else is inside it."
    },
    {
      "title": "Stick something inside the lid.",
      "content": "Stick something inside the lid. Tape or glue pictures or photographs that mean a lot to you. Perhaps you have a treasured note from a friend or relative. Perhaps there is a sticker, or a concert ticket, or a postcard that you want to see every time you open the box. If you use tape, then you can change out these \"featured memories\" for other meaningful items as you live your life and make new memories."
    },
    {
      "title": "Personalize the outside of the box.",
      "content": "Personalize the outside of the box. Consider painting the surface: in solid colors, or with a more detailed picture. You can make the design simple, or you can make it a colorful swirl of personality. Get creative! This box is yours to design. Use glitter and rhinestones to add sparkle and flair to the outside of the box. Cover the box in chalkboard paint so that you can write on it with chalk. Glue ceramic tiles and/or mirror shards to the surface to make a mosaic. Try gluing or sewing fabric to the surface of the box. If you're into furry things, attach fake fur to the outside. Use a floral print, or flannel, or denim – anything that says something about your personality! You can cut swaths of fabric from old clothes, curtains, blankets, and other textiles."
    },
    {
      "title": "Label the box.",
      "content": "Label the box. Try writing your name or the \"theme\" of the memories directly onto the box in paint, pen, or marker. You can also cut out letters (from paper, cardboard, wood) and glue them on. Consider printing the words onto a sticker using a printer or a label-maker. If you want to make it clear that the box is private, make a tag that says \"Property of [your name]. Do not open!\" Make a memory box for a specific trip or time. For instance, you might make a memory box to preserve all of your photos, letters, and items from summer camp, or from the past year at school, or from a memorable trip that you took. [2] X Research source"
    },
    {
      "title": "Place memories in the box.",
      "content": "Place memories in the box. You can fill the box with personal treasures that relate to a specific trip or time, or you can loosely reserve the box for any meaningful items that come into your life. This is a space for anything that you want to save. You don't need to fill the box up yet! Fill the box with old letters, notes, and birthday cards. Fold up and save any words that people have written to you. Later, you'll read back over these words and cherish the connections that you've made. Store photographs of special times. If you don't have any physical photos, you can print them from your computer, or you can save them to a flash or USB drive and put the drive into the box. Keep art, broken things, and found objects. Perhaps you want to preserve the picture that your best friend drew for you, or the remnants of your favorite charm bracelet that broke, or a special rock that you found on the beach."
    },
    {
      "title": "Continue to fill the box.",
      "content": "Continue to fill the box. As time goes by, save the meaningful things that you find or receive. Put these items into the box for safekeeping. You never know when you'll want to dig them out and relive the past."
    },
    {
      "title": "Make a box for a friend or relative.",
      "content": "Make a box for a friend or relative. This can be a great way to commemorate a friendship: with items that remind your friend of shared memories. A memory box can also be a great gift to a parent or grandparent. As people grow older, they have more and more memories to look back upon – and it can be very rewarding to have a lot of those memories stored in one place. If you have a relative with Alzheimers or another memory impairment, a memory box can be a great way to help him or her keep in touch with the past. [3] X Research source"
    },
    {
      "title": "Keep the box somewhere safe.",
      "content": "Keep the box somewhere safe. If you feel secure doing so, you can simply place the box on a shelf in your room or your closet. If you want to keep the memories a bit more secure, you might place the box in a dresser drawer, or under your bed, or in a secret compartment that only you know about."
    }
  ]
}