{
  "url": "https://www.wikihow.com/Make-a-Poll-on-Twitch",
  "title": "Simple and Easy Steps to Making a Poll on Twitch",
  "steps": [
    {
      "title": "Enter \"/poll\" in your stream's chat.",
      "content": "Enter \"/poll\" in your stream's chat. If you include the slash \"/\", it won't appear in the chat, but will enter as a command. After you enter \"/poll\" and press Enter or Return , you'll see a new window pop up. If you want to click something instead, go to Stream Manager > + (if the Poll tile is not visible) > Manage Poll > New Poll . [1] X Research source"
    },
    {
      "title": "Enter the poll title.",
      "content": "Enter the poll title. Under the \"Question\" header, enter your poll prompt, which is limited to 60 characters."
    },
    {
      "title": "Enter the responses.",
      "content": "Enter the responses. Polls require a minimum of 2 possible answers, so you can add more than that (up to 5 total). These are also limited to 25 characters."
    },
    {
      "title": "Select your Poll settings.",
      "content": "Select your Poll settings. There are a few different options you can pick for your poll. These are: Allow Voting with Bits: this will allow your viewers to vote more than once by using their Bits. Allow Voting with Channel Points: this setting lets your viewers vote more than once by using their Channel Points. Subscriber Votes Count 2x: If you want subscriber votes to weigh more heavily than those who aren't subscribed to your channel, enable this setting. In this case, each subscriber's vote is counted twice. Duration: You can decide how long you want the poll to remain up. Use this drop-down menu to select a duration."
    },
    {
      "title": "Click Start Poll.",
      "content": "Click Start Poll . Your poll will appear in the top right corner of your stream, above the chat. Your poll's final results will appear in place of the poll when it ends. To view your poll's breakdown, go to \"https://twitch.tv/popout/YOURUSERNAME/poll\" (replace YOURUSERNAME with your username) and click Vote Breakdown to see the poll's details. You can only run 1 poll at a time. [2] X Research source"
    },
    {
      "title": "Add Nightbot to your stream.",
      "content": "Add Nightbot to your stream. If you haven't already done so, you'll need to get Nightbot, a simple chatbot, on your stream. Nightbot has tons of features, including the ability to create polls for your stream. You can get Nightbot from https://nightbot.tv ."
    },
    {
      "title": "Enter \"!poll POLLTITLE|OPTION1|OPTION2|...\"",
      "content": "Enter \"!poll POLLTITLE|OPTION1|OPTION2|...\" into the chat. Replace \"POLLTITLE\" with your poll and \"OPTION1-5\" with possible answers. [3] X Research source Poll titles are restricted to 60 characters and the options can be up to 25 characters long. You can have up to 5 answers, so you might have something like \"!poll POLLTITLE|OPTION1|OPTION2|OPTION3|OPTION4|OPTION5\""
    },
    {
      "title": "Enter \"!poll results\" to see your most recent poll results.",
      "content": "Enter \"!poll results\" to see your most recent poll results. If you want to see your previous poll results, you can enter that command to see what they were. If you're currently running a poll, this command may not work. [4] X Research source Those with mod or editor permissions will also be able to create polls this way."
    },
    {
      "title": "Enter \"/vote OPTIONNUMBER\" into chat.",
      "content": "Enter \"/vote OPTIONNUMBER\" into chat. Replace OPTIONNUMBER with the number of the option that you want to vote for. [5] X Research source For example, if the poll is asking \"What should I do today?\" and the options are: 1. PVP 2. Level 3. Raids, then \"/vote 2\" means you're voting for Level."
    },
    {
      "title": "Click the down arrow (v) next to the poll title then click an option.",
      "content": "Click the down arrow (v) next to the poll title then click an option. The poll title is at the top of your chat box and clicking it will expand to reveal the entire poll."
    }
  ]
}