{
  "url": "https://www.wikihow.com/Lessen-Fiberglass-Itch",
  "title": "How to Lessen Fiberglass Itch",
  "steps": [
    {
      "title": "Do not rub or scratch the affected area.",
      "content": "Do not rub or scratch the affected area. Fiberglass can cause intense itching on the skin, and it is tempting to scratch it. However, this can force the irritating fibers deeper into or over the skin, making the problem even worse."
    },
    {
      "title": "Immediately carefully remove any clothing you wore while in contact with fiberglass.",
      "content": "Immediately carefully remove any clothing you wore while in contact with fiberglass. [1] X Research source Keep it apart from your other clothing as personal items, and wash it separately. This will help keep the fibers from spreading and causing more irritation."
    },
    {
      "title": "Wash your skin if you are exposed to fiberglass.",
      "content": "Wash your skin if you are exposed to fiberglass. If you see, feel, or suspect that your skin has come into contact with fiberglass, you should wash the area as soon as possible. If you are already suffering from itching and irritation, wash the affected area with mild soap and warm running water. [2] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source You can use a washcloth very lightly to help remove fibers. If fiberglass got in your eyes, flush them with water for at least 15 minutes."
    },
    {
      "title": "Remove any fibers that are visible.",
      "content": "Remove any fibers that are visible. If you see individual fibers sticking out of or just under the skin, you can try to carefully remove them yourself. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This will help to stop the irritation. First, wash your hands and clean the area with soap and water (if you have not already). Sterilize tweezers by wiping them with rubbing alcohol, then use them to remove the fibers. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source A magnifying glass can help you see small fibers. If you see the fibers but cannot remove them easily with tweezers, sterilize a clean sharp needle by wiping it with rubbing alcohol. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Use it to lift or break the skin over the fiber. Then use sterile tweezers to remove it. Squeeze the site gently gently to allow bleeding to wash germs out. Wash the area again and apply an antibiotic cream. If you see fibers deep below the skin, contact a doctor and do not try to remove them yourself."
    },
    {
      "title": "Use a cream to soothe your skin.",
      "content": "Use a cream to soothe your skin. After washing the area of skin affected by fiberglass, apply a quality skin cream. This can help to soothe and moisturize your skin, giving some relief from the irritation. You can also apply an over-the counter anti-itch cream for additional relief."
    },
    {
      "title": "Wash clothing and any other materials that may have come in contact with fiberglass.",
      "content": "Wash clothing and any other materials that may have come in contact with fiberglass. Remove any clothes worn while in contact with fiberglass, and keep them separate from other clothes. Wash them as soon as possible, separately from any other clothes. This will help to prevent any lingering fibers from spreading and causing irritation. If there is a lot of fiber material on the clothing, presoak it before washing. This will help to loosen the fibers and rinse them away. After washing your clothing that came into contact with fiberglass, rinse your washer with water before washing any other clothing. This will wash away any fibers that might have stuck in the machine, and keep them from spreading to other clothes."
    },
    {
      "title": "Clean your work area.",
      "content": "Clean your work area. If you were working with fiberglass when you came into contact with it, be sure to clear any remaining bits of fiberglass from your work area as soon as possible. This will help prevent another reaction to the material. Use a vacuum to remove bits of fiberglass, rather than a dry broom (which may sweep particles into the air). Wearing protective clothing, goggles, and a mask or respirator while cleaning will also keep particles from affecting your skin, eyes, or lungs. [6] X Research source"
    },
    {
      "title": "Pay attention to the affected area.",
      "content": "Pay attention to the affected area. While contact with fiberglass can be painful and irritating, the symptoms should subside soon if you follow the steps for treatment. If the itching and irritation persists, however, seek medical attention."
    },
    {
      "title": "Wear appropriate clothing when handling fiberglass.",
      "content": "Wear appropriate clothing when handling fiberglass. Whenever you work with or know you will be exposed to fiberglass, wear protective clothing. Long sleeves, pants, closed-toed shoes, and gloves will all help to protect your skin from fibers. Try to keep as much of your skin covered as possible. Wearing any sort of respirator or face mask will also protect you from breathing in airborne particles of fiberglass. [7] X Research source"
    },
    {
      "title": "Keep your work area clean and ventilated.",
      "content": "Keep your work area clean and ventilated. If you are working with fiberglass, your work area should have a good airflow so that bits of the material do not linger in the air and settle on your skin or clothing and so that you do not breathe them in. [8] X Research source Keep your work clothes separated from other clothes. Don’t eat, drink, or smoke while handling fiberglass. This will keep you from accidentally eating or inhaling fiberglass particles. If you notice any symptoms of irritation caused by fiberglass, stop and treat them before returning to work."
    },
    {
      "title": "Shower after handling fiberglass.",
      "content": "Shower after handling fiberglass. Shower as soon as possible after handling or being exposed to fiberglass—even if you don’t notice any irritation or itching. This will help to rinse away any fibers that might be on your skin but that aren’t yet causing a reaction. Showering with cold water, if you don’t yet notice any reaction, will rinse any fiberglass particles off of your skin while also keeping your pores closed and any particles out of them. [9] X Research source"
    },
    {
      "title": "Talk to your doctor about any concerns you may have about fiberglass exposure.",
      "content": "Talk to your doctor about any concerns you may have about fiberglass exposure. If you are unsure about your symptoms, or your contact with fiberglass, talk to your doctor. Some people may develop a kind of tolerance to fiberglass in time, so that it doesn’t irritate them in the way it once did. However, this does not mean that there are no potential skin or lung problems, so always be careful handling fiberglass. [10] X Research source"
    }
  ]
}