{
  "url": "https://www.wikihow.com/Lose-Weight-(for-Girls)",
  "title": "How to Lose Weight (for Girls)",
  "steps": [
    {
      "title": "Use a nutrition guide to help you make good choices.",
      "content": "Use a nutrition guide to help you make good choices. It can be hard to know what you should eat and how much. To help you make healthy eating decisions, try using a food guide like the ChooseMyPlate guide: https://www.girlshealth.gov/nutrition/healthy_eating/choosemyplate.html . These guides can give you information about what to eat based on factors like your age, your current weight, and how physically active you are. [1] X Research source The ChooseMyPlate guide breaks down the different categories of food you need for a balanced diet and tells you how many servings of each category you should eat daily."
    },
    {
      "title": "Stick to healthy sources of fat.",
      "content": "Stick to healthy sources of fat . Cutting back on fatty foods can help you lose weight, but you need some fat in your diet to grow and stay healthy. Instead of trying to cut fat out of your diet altogether, choose healthy sources of fat, such as fish, nuts and seeds, avocados, and vegetable oils. [2] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020. Cut back on unhealthy trans and saturated fats, like those found in butter, fatty meats, cheese, and greasy fried foods. Fatty fish, like salmon, tuna, and mackerel, are great sources of healthy fat. You can also get it from nut butters, like peanut butter or sunflower seed butter."
    },
    {
      "title": "Avoid sugary snacks and drinks.",
      "content": "Avoid sugary snacks and drinks. Foods and drinks with a lot of refined sugars are high in calories and short on the nutrients you need. Try to stay away from candy, sugary baked goods, sweet sodas, juices, and sugary coffee drinks. [3] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source If you have a sweet tooth, try satisfying your craving with some fruit or a small piece of dark chocolate. If you drink juice, stick to unsweetened 100% juices instead of juice drinks or fruit juice cocktails, which often have added sugar."
    },
    {
      "title": "Stay away from processed foods.",
      "content": "Stay away from processed foods. Processed and pre-packaged foods, like chips, hot dogs, canned meats, and fast food, are often full of added salt, sugar, and unhealthy fats. Stick to eating fresh, homemade foods as much as you can to avoid these unhealthy additives. [4] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020. If possible, limit yourself to no more than 1 fast food meal per week. [5] X Research source"
    },
    {
      "title": "Fill up on fiber and lean protein.",
      "content": "Fill up on fiber and lean protein . Foods that are rich in fiber and protein will boost your energy and help you feel satisfied without giving you a lot of empty calories. If you’re feeling hungry, reach for a snack that’s got plenty of protein and fiber. [6] X Research source For example, try eating some whole-grain crackers with natural peanut butter or sun butter, or some apple slices and low-fat cheese. Good sources of fiber include leafy green vegetables, fruit, nuts and beans, and whole-grain foods. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You can find healthy protein in foods like fish, chicken or turkey breast, low-fat dairy products, beans, nuts and seeds, and soy products (such as tofu). [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Eat a well-balanced diet to get all the nutrients you need.",
      "content": "Eat a well-balanced diet to get all the nutrients you need. Your body needs a wide variety of foods in order to stay healthy and grow properly. In order to lose weight in a healthy way, you’ll need to incorporate all of the food groups. [9] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source A healthy diet should include: Fruits and vegetables in a rainbow of colors Complex carbohydrates, like those found in whole grain cereals, bread, or pasta Lean proteins, such as poultry breast, fish, beans, or soy Healthy fat sources, such as fatty fish (like tuna and mackerel), nuts and seeds, avocados, and vegetable oils Dairy products, like low-fat milk, cheese, and yogurt"
    },
    {
      "title": "Stay hydrated",
      "content": "Stay hydrated to boost your energy and feel more satisfied. As you go about your day, don’t forget to drink water whenever you start to feel thirsty. Getting enough water to drink will help you feel fuller so that you don’t eat as much. It also prevents you from retaining water, which can cause bloating, and it may even help your body burn fat. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source While the amount of water you need to drink depends on your age and how active you are, most teens and young adults should aim to drink about 8 glasses a day. If you don’t like plain water, try adding a splash of lemon juice to give it a little flavor. You can also get extra hydration by eating juicy fruits and vegetables or soups with clear broth."
    },
    {
      "title": "Avoid weight-loss fads and crash diets.",
      "content": "Avoid weight-loss fads and crash diets. Extreme diets that involve eating very little or cutting out entire food groups may help you lose weight in the short term, but studies show they ultimately don’t work. Not only are you likely to gain back the weight quickly, but these diets are also bad for your health and your growing body. [11] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020. Watch out for diets that promise quick or extreme results. Stay away from supplements or seemingly magic pills that claim to melt away fat and help you lose weight fast. These products are often don’t work, or worse, they’re harmful to your health."
    },
    {
      "title": "Pay attention to your body’s hunger cues.",
      "content": "Pay attention to your body’s hunger cues . It’s easy to lose track of what your body is telling you and get into the habit of eating when you’re not really hungry. If you want to eat something, stop and ask yourself how you’re feeling. Are you actually hungry, or do you just want to eat because you’re stressed, bored, or craving a particular flavor? If you’re hungry, grab a snack. If not, find a way to distract yourself until the urge passes. [12] X Research source Pay attention to cues such as hunger pains, a growling stomach, or lightheadedness and irritability. If you’re not sure whether you’re really hungry, try drinking a glass of water. It can be easy to confuse feelings of hunger and thirst. When you eat, take your time and be mindful of how you are feeling. Stop eating when you feel satisfied, before you feel uncomfortably full. [13] X Research source"
    },
    {
      "title": "Watch your portion sizes.",
      "content": "Watch your portion sizes. When you have a plate full of food in front of you, it’s hard to resist the urge to polish it off—even if it’s way too much! One good way to avoid overeating is to put smaller portions on your plate. At every meal, try to stick to about 1 cup (240 mL) of carbs (such as pasta, rice, or cereal) and the same amount or more of fruits and vegetables. Keep servings of meat no bigger than the palm of your hand. [14] X Research source A 1 cup (240 mL) serving of food is about the size of your clenched fist. You can also try dividing your plate into equal quarters. Fill 1 quarter with a whole grain (such as whole wheat pasta or brown rice), 1 quarter with a lean protein (such as fish, poultry breast, or tofu), and the other 2 quarters with vegetables. If those portions seem small, try eating your meals on a smaller plate. If your plate is filled up, it can trick your brain into thinking you’re eating more food."
    },
    {
      "title": "Avoid skipping meals.",
      "content": "Avoid skipping meals. When you’re trying to lose weight, you may be tempted to skip eating altogether sometimes. However, doing this can often backfire, because you’ll be hungrier and more likely to overeat at your next meal. Try to eat at 3 healthy, satisfying meals each day. [15] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020. It’s especially important to eat a good breakfast, since this will energize you and prevent you from getting too hungry later in the day."
    },
    {
      "title": "Keep track of your calories.",
      "content": "Keep track of your calories . To lose weight, you need to burn more calories than you eat each day. Keep a food journal to help you count how many calories you’re eating in an average day. Ask your doctor or a dietitian how many calories you need to be eating each day based on your age, weight, current eating habits, and activity level. [16] X Research source You can find out how many calories are in a serving of prepackaged food by checking the nutrition label. Many restaurants also have calorie information in their menus. When eating fresh or homemade food, you can use a guide like this one to approximate how many calories are in each meal: https://www.nhs.uk/live-well/healthy-weight/calorie-checker/ ."
    },
    {
      "title": "Get at least 60 minutes of moderate exercise daily.",
      "content": "Get at least 60 minutes of moderate exercise daily. Physical activity is important not only for losing weight, but also for keeping your bones, muscles, heart, and lungs strong. Try to do 60 minutes of moderate physical activity each day, such as jogging , walking, dancing , swimming, playing tennis , or biking. [18] X Research source If you’re not used to exercising, start with shorter times and less intense exercise. For example, you might start by walking for 10 minutes each day, then gradually build up to a daily 20-minute fast walk or jog. Depending on your current weight or your fitness goals, you may need to spend more time exercising or do more intense exercise. Talk to your doctor or a PE instructor to find out how much you need to exercise."
    },
    {
      "title": "Incorporate strength training into your exercise regimen.",
      "content": "Incorporate strength training into your exercise regimen. In addition to aerobic activities that get your heart pumping, like running and biking, you should also do exercises that help you build muscle . At least 3 days a week, add some strengthening exercises to your regular 60 minutes of physical activity. [19] X Research source Some good strength-building exercises include doing planks or squats, climbing, and using resistance bands. You can also ask a fitness instructor for advice on how to safely lift weights. Building muscle helps you burn fat more efficiently, and also makes you less prone to injury. [20] X Research source"
    },
    {
      "title": "Find ways to be more physically active throughout the day.",
      "content": "Find ways to be more physically active throughout the day. In addition to working out, you can also look for little ways to get more physical activity during your daily routines. For example, take the stairs instead of an elevator or escalator whenever you can. Every little bit can make a difference! [21] X Research source Doing work around your house and yard can also help you burn calories. Kill 2 birds with 1 stone by cleaning up your room or volunteering to mow the lawn. If you’re in school, try walking or biking there if possible. Even standing instead of sitting while you work at a desk can help you burn extra calories! [22] X Research source"
    },
    {
      "title": "Minimize screen time and other sedentary activities.",
      "content": "Minimize screen time and other sedentary activities. When you have a world of entertainment and information literally at your fingertips, it’s easy to forget to get up and move. Make a decision to limit your time on the phone, at your computer or tablet, or in front of the TV. [23] X Research source Try setting specific limits for yourself. For example, you might commit to spending no more than 1 hour watching TV per day. If you find yourself too tempted to play on your phone, try installing an app like BreakFree or Moment that will remind you to take breaks or lock you out during designated phone-free times. If you have to sit a lot while you study or work, try to take occasional breaks to get up and walk around or stretch."
    },
    {
      "title": "Get at least 8-10 hours of good sleep per night.",
      "content": "Get at least 8-10 hours of good sleep per night. If you’re not sleeping enough, you may be tempted to snack at night. Getting too little sleep will also leave you feeling tired and drained, which makes it harder to stay active during the day. Try to get to bed early enough every night so that you can get at least 8-10 hours of sleep. [24] X Research source Try to go to bed and wake up at the same times every day. Practice good sleep hygiene by turning off bright screens at least half an hour before bed and keeping your room quiet, dark, and comfortable at night. Try establishing a relaxing bedtime routine, like doing yoga , meditating , reading, or taking a warm bath or shower before bed."
    },
    {
      "title": "Try stress-relieving activities.",
      "content": "Try stress-relieving activities. Stress can sap your energy and make you want to overeat. [25] X Research source The process of losing weight can also be stressful, so find ways to help yourself relax and unwind. Some good stress-relieving activities include: Meditating and doing deep breathing exercises Doing yoga Spending time with friends, family, and pets Going for walks and spending time outdoors Doing creative activities or working on hobbies"
    },
    {
      "title": "Be body positive.",
      "content": "Be body positive. Being body positive doesn’t mean that you have to be happy with everything about your body. Instead, focus on loving and respecting your body, accepting its quirks and unique features, and looking for ways to care for it. Think of your body as a friend or loved one. Treat it kindly. Instead of focusing on achieving an “ideal” weight or body type, think in terms of what you can do to stay healthy and feeling good."
    },
    {
      "title": "Expect slow progress when you’re losing weight.",
      "content": "Expect slow progress when you’re losing weight. Losing weight is a long process. To do it safely and effectively, you’ll need to commit to permanent lifestyle changes. For most people, it’s healthy and realistic to aim for losing 1–2 pounds (0.45–0.91 kg) per week. [26] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source It’s normal for your weight loss to slow down and even stop eventually after you start a new diet and exercise routine. If this happens and you still need to lose more weight, don’t get discouraged. Ask your doctor if you can safely cut more calories or increase your physical activity level. [27] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take it easy on yourself if you slip up.",
      "content": "Take it easy on yourself if you slip up. Occasional setbacks are a normal part of the weight loss process. If you slip up and eat too much or forget to exercise for a few days, don’t beat yourself up. Instead, gently steer yourself back to your healthy routine and move on. [28] X Research source If you’re upset with yourself because you recently gained back a couple pounds, look back at your overall weight loss since you first started instead. It’s normal and expected that you’ll have occasional ups and downs in your weight."
    },
    {
      "title": "Work with your doctor to find a healthy weight for you.",
      "content": "Work with your doctor to find a healthy weight for you. The healthiest weight for you depends on a lot of factors, such as your age, height, activity level, and overall health. Before you set any weight goals for yourself or start working on losing weight, talk to your doctor. They can help you determine whether your current weight is healthy and, if not, how you can lose weight safely. [29] X Research source Being overweight means you are more at risk of developing certain health problems, like diabetes or heart disease. However, being overweight doesn’t necessarily mean that you’re not healthy."
    },
    {
      "title": "Develop a weight loss plan with a doctor or dietitian.",
      "content": "Develop a weight loss plan with a doctor or dietitian. If your doctor says you could benefit from losing weight, ask them for advice about the best way to do it. They can help you choose the right foods, figure out how much you should be eating, and suggest ways to get the physical activity you need. [30] X Research source Your doctor may refer you to a registered dietitian if you need more advice on diet and nutrition. You and your dietitian can come up with a diet plan that works best for you."
    },
    {
      "title": "Ask a coach or personal trainer about healthy exercise routines.",
      "content": "Ask a coach or personal trainer about healthy exercise routines. If you’re not sure how to exercise safely, talk to a coach or PE instructor at your school. They can tell you what kinds of exercises will help you lose weight and give you instructions on how to do them correctly, so that you don’t hurt yourself. [31] X Research source You could also look into working with a personal trainer at a local gym who has experience working with kids or teens."
    },
    {
      "title": "Manage any health issues that might affect your weight.",
      "content": "Manage any health issues that might affect your weight. If you’re struggling to lose weight even with good eating and exercise habits, there may be something else going on. Talk to your doctor about doing an exam or running tests to find out if you have a health problem that’s making it hard for you to lose weight. If they discover a problem, they can help you treat it so that you can manage your weigh more easily. Common medical causes of weight gain include thyroid conditions, polycystic ovary syndrome (PCOS), mental health conditions like anxiety or depression, and certain genetic disorders, like Cushing’s syndrome. Certain medications, like corticosteroids, may also have weight gain as a side effect."
    },
    {
      "title": "Reach out for support if you feel depressed or anxious about your weight.",
      "content": "Reach out for support if you feel depressed or anxious about your weight. Being unhappy with your weight can be very stressful. If you feel anxious, sad, or embarrassed about your weight, talk to someone you trust, like a family member, supportive friend, or school counselor. [32] X Research source You can also talk to your doctor about how you are feeling. They can offer advice on how to cope with your feelings, or even refer you to a counselor or other mental health specialist who can help."
    }
  ]
}