{
  "url": "https://www.wikihow.com/Get-an-MMSI-Number",
  "title": "How to Get an MMSI Number",
  "steps": [
    {
      "title": "Confirm that you’re not required to obtain a ship station license.",
      "content": "Confirm that you’re not required to obtain a ship station license. If you’re a recreational boater and aren’t planning on visiting a foreign port, you don't need to get a ship station license from the FCC. You're allowed to travel in international waters without a ship station license. However, you won't be able to dock at or communicate with a foreign port. [1] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source If you boat in an area close to foreign ports, such as off the tip of Florida, it may be a good idea to go ahead and get a ship station license. You never know who might be able to come to your aid if you ever get in trouble out on the water."
    },
    {
      "title": "Identify an approved boat owners' organization that assigns MMSI numbers.",
      "content": "Identify an approved boat owners' organization that assigns MMSI numbers. The FCC and US Coast Guard authorize organizations to assign domestic MMSI numbers. The application process is relatively simple and you’ll receive an MMSI number immediately. As of 2019, authorized organizations include: [2] X Research source Boat US: https://www.boatus.com/MMSI/MMSI/Home US Power Squadron: https://www.usps.org/php/mmsi_new"
    },
    {
      "title": "Join the organization if necessary.",
      "content": "Join the organization if necessary. The boating organization you use may require you to become a member before it will assign you an MMSI. Others, such as Boat US, assign MMSI numbers to non-members for a fee. However, if you're a member of the organization, you can get your MMSI number for free, as well as having access to other organization resources. [3] X Research source Each organization has various membership levels. Annual dues range from $25 to $175. Perks of membership may include tow service or other assistance if you run into problems while boating. To join, look for a button or link on the organization's home page. You’ll need to provide your name, contact information, your boat’s specifications, and payment information."
    },
    {
      "title": "Fill out the registration form.",
      "content": "Fill out the registration form. Head to the organization’s MMSI main page and find the link to start a new application. You’ll need to enter your name and contact information, boat specifications, radio specifications, and vessel registration number. [4] X Research source You'll also need to provide the name and phone number of at least one emergency contact."
    },
    {
      "title": "Print out your MMSI certificate for your boat's records.",
      "content": "Print out your MMSI certificate for your boat's records. Immediately after you submit your application, a confirmation page will appear with your new MMSI number. You may also receive this information through a confirmation email. Print at least 2 copies, one for your boat and one for your home records."
    },
    {
      "title": "Program your MMSI number into your radio.",
      "content": "Program your MMSI number into your radio. Programming instructions vary by radio, so check your product’s user manual. Read the directions carefully and enter your MMSI number precisely. Most radios can only be programmed with an MMSI number once. [5] X Research source If you make a mistake, you may have to send your radio back to the manufacturer to get it cleared."
    },
    {
      "title": "Request your FCC Registration Number (FRN).",
      "content": "Request your FCC Registration Number (FRN). Applying for a ship station license online is easier than doing so through the mail and your application will be processed more quickly. Go to https://apps.fcc.gov/cores/userLogin.do to get started. [6] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source After you create your account, you'll receive your FRN. You'll need this number to apply for an MMSI."
    },
    {
      "title": "Complete a new license application.",
      "content": "Complete a new license application. Go to https://wireless2.fcc.gov/UlsEntry/licManager/login.jsp and enter your FRN and the password you created when you set up your online account. You'll then be able to start a new license application or manage existing ones. [7] X Research source Once you click submit to log in, click the \"Apply for a New License\" tab to start a new online license application."
    },
    {
      "title": "Choose the correct license type for your boat.",
      "content": "Choose the correct license type for your boat. If you intend to dock at or communicate with foreign ports, choose \"SB-Ship\" from the drop-down menu. If you're a domestic boat owner and want a voluntary license, choose \"SA-Ship.\" While you can get a voluntary MMSI through the FCC, it will be cheaper and easier to go through an authorized boating organization if you won't be near any foreign ports."
    },
    {
      "title": "Complete your ship station license application.",
      "content": "Complete your ship station license application. Once you open the online application, enter information about yourself, including identification and contact information. You'll also need to provide information about your boat specifications and documentation. You'll have the opportunity to review your application before you submit it. Double-check everything you've entered and make sure it's correct. Mistakes could delay your application."
    },
    {
      "title": "Pay the application and regulatory fees.",
      "content": "Pay the application and regulatory fees. The Universal Licensing System (ULS) will calculate your fees for you based on the information you provided in your application. You can pay your fees online with a major credit or debit card, or by initiating an electronic wire transfer of funds directly from any US bank account. [8] X Research source As of September 2018, the FCC no longer accepts checks or money orders for payment of fees. If you don't want to submit your payment information over the internet, you can fill out Form 159 and mail it in with credit card or wire transfer information. Form 159 is available at https://www.fcc.gov/licensing-databases/forms . It must be received within 10 days of the date you file your application. Your license is valid for 10 years. To renew your license, you'll have to provide the same information you did with your initial application and pay another fee."
    },
    {
      "title": "Wait to receive your license and MMSI.",
      "content": "Wait to receive your license and MMSI. Your license and MMSI will be delivered to you electronically. Typically, you can expect to wait at least 10 days after submission of your application. If there is a high volume of applications, it may take longer. [9] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source If you provided a valid email address, the FCC will email your license and MMSI to you when your application is processed. You can also access your license and MMSI by logging onto your FCC account with your FSN and password. You can also check the status of your application at https://wireless2.fcc.gov/UlsApp/ApplicationSearch/searchAppl.jsp ."
    },
    {
      "title": "Get a FCC Registration Number (FRN) if you don't already have one.",
      "content": "Get a FCC Registration Number (FRN) if you don't already have one. Go to https://apps.fcc.gov/cores/userLogin.do to apply for an FRN. You'll need to include your FRN on your application for a ship station license. [10] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source Provide information about yourself and your boat. Your FRN will be issued immediately after you submit your information. There is no charge for an FRN. Copy it and keep it in a safe place so you'll be able to access it when you complete your form."
    },
    {
      "title": "Download Form 605 from the FCC forms database.",
      "content": "Download Form 605 from the FCC forms database. Go to https://www.fcc.gov/wireless/support/fcc-form-605 to get a copy of the licensing application. You'll need this form to apply for a ship station license if you want to mail in a paper form. If you don't have reliable internet access or the means to print the form, contact the FCC Licensing Support Center at 877-480-3201 to have a blank form mailed to you."
    },
    {
      "title": "Fill out your application with information about yourself and your boat.",
      "content": "Fill out your application with information about yourself and your boat. On Form 605, you must enter your FRN, legal name, and contact information. You'll also need to include your boat's specifications and documentation information. [11] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source The application includes instructions for providing the correct information. Read the instructions carefully and make sure you understand them. Incorrect or inaccurate information could delay your application."
    },
    {
      "title": "Pay your fees online or complete a remittance form.",
      "content": "Pay your fees online or complete a remittance form. The FCC only accepts payment through major credit card or wire transfer from a US bank account. You can go online and pay your fee (even though you're mailing your paper application), or you can download Form 159 and fill it out with your payment information. [12] X Research source"
    },
    {
      "title": "Mail your completed forms to the FCC.",
      "content": "Mail your completed forms to the FCC. Double-check your forms for accuracy and completeness, then make a copy of them for your records. Send the originals to Federal Communications Commission, PO Box 979097, St. Louis, MO 63197-9000. [13] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source You can also have your forms hand-delivered by courier to US Bank, Attn: FCC Government Lockbox #979097, SL-MO-C2-GL, 1005 Convention Plaza, St. Louis, MO 63101."
    },
    {
      "title": "Wait to receive your license.",
      "content": "Wait to receive your license. Your license and MMSI will be delivered to you electronically. Expect it to take at least 10 days for your application to be processed after it is received. If you provided a valid email address, your license and MMSI will be emailed to you. [14] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source You aren't required to provide an email address. You can also access your form by logging onto your FCC account online using your FRN and the password you created when you opened your account."
    }
  ]
}