{
  "url": "https://www.wikihow.com/Jump-on-Horseback",
  "title": "How to Jump on Horseback",
  "steps": [
    {
      "title": "Lift yourself out of the saddle.",
      "content": "Lift yourself out of the saddle. To jump, you must get yourself into position as the horse starts to jump. Start by lifting yourself out of the saddle in to 2 point . You should also lean forward while lifting yourself. [2] X Research source Getting yourself into position should happen quickly, basically as the horse is changing from his final stride into a jumping position. You will be learning to do this transition so it takes you only a few seconds."
    },
    {
      "title": "Shift your weight.",
      "content": "Shift your weight. As you lift yourself, your weight should shift to the balls of your feet. This movement should come naturally as you rise in the saddle and move forward. [3] X Research source"
    },
    {
      "title": "Adjust your legs.",
      "content": "Adjust your legs. It may be tempting to ride this position with your heels up. However, you need to keep your heels down, putting your full weight in the stirrups. In addition, make sure to bend your leg slightly. This keeps your leg from moving backwards too much. If your leg moves backwards too much, it can make your horse go too fast."
    },
    {
      "title": "Move your hands up.",
      "content": "Move your hands up. That is, you need to push your hands up the horse's neck a bit from where you normally keep your hands. Some riders even grab the horses mane. Moving your hands gives your horse a chance to really stretch out his neck as he takes the jump."
    },
    {
      "title": "Practice out of the saddle.",
      "content": "Practice out of the saddle. It can be difficult to learn the proper position in the heat of the moment. Every jump only provides a little bit of time to get into position. Therefore, try practicing in front of a mirror at home. You can also practice on your horse when he is trotting or cantering to get a feel for the position. Basically, as soon as you get the feel for how to shift your weight, you can start trying it in the saddle."
    },
    {
      "title": "Apply a neck strap before trying.",
      "content": "Apply a neck strap before trying. If you've never jumped a horse before, try using a neck strap. If you don't, you may jerk back on the reins at the wrong time, pulling the bit hard into the horse's mouth. [4] X Research source"
    },
    {
      "title": "Line up the horse properly.",
      "content": "Line up the horse properly. As you turn to take a jump, you must make sure the horse is in the correct position to take it. In other words, the horse needs to take it dead on, directly in the center, rather than slanted or off to the side. [5] X Research source Part of lining up the horse properly means you are sitting up and looking straight at the jump, which helps to push the horse in the proper direction. [6] X Research source"
    },
    {
      "title": "Support your weight with your thighs and legs.",
      "content": "Support your weight with your thighs and legs. You shouldn't be putting any weight on your hands as you prepare to take a jump. Also, make sure you are not holding the reins too tightly, giving your horse freedom to move his head. [7] X Research source"
    },
    {
      "title": "Get into position.",
      "content": "Get into position. As you feel the horse prepare for the jump, you must get into position, detailed in the previous section. Remember, you also must keep your leg around the horse, or else you could fall off. Also, look forward as you take the jump, not downward. [8] X Research source"
    },
    {
      "title": "Continue to lean forward.",
      "content": "Continue to lean forward. As the horse jumps, lean forward even more. Leaning forward helps you maintain your balance on the horse, as it shifts your weight. [9] X Research source"
    },
    {
      "title": "Return to normal position.",
      "content": "Return to normal position. You only return to your normal position as the horse lands from the jump. During the jump, stay in this position. [10] X Research source As he lands, transition back into normal position as he transitions back into his stride. It should take about the same amount of time. During this time, you should keep contact with the reins and the horse's head, but let the horse balance himself as he will. Also, you can keep one leg in the jumping position as you head to the next gate. [11] X Research source"
    },
    {
      "title": "Move towards the next jump.",
      "content": "Move towards the next jump. Now that you've come out of the jump, it's time to be looking for the next one. Once again, make sure to approach it head on, rather to the side. [12] X Research source"
    },
    {
      "title": "Try bouncing.",
      "content": "Try bouncing. Bouncing is when you set up a series of small fences in rapid succession. Start with two at first. The idea is the horse never goes back into regular strides between fence. Therefore, you must stay in the proper position for jumping the whole time, giving you and the horse practice."
    },
    {
      "title": "Don't look down.",
      "content": "Don't look down. It's important to look ahead through the jump. For one thing, it helps you plan ahead for the next jump. For another, shifting your head can shift your whole body. That can throw the horse off, which in turn can make you lose your balance. [13] X Research source"
    },
    {
      "title": "Trot first.",
      "content": "Trot first. While you generally canter a horse in competition, starting the horse on trotting helps acclimate him to jumping. It also helps him learn how to jump the best way, meaning leaning back on his hocks before he takes the jump."
    },
    {
      "title": "Start small.",
      "content": "Start small. One of the best ways to teach your horse not to refuse a jump is to start with very small jumps. That way, the horse can jump it even if he stops in front of it. If you let him walk away and come back to it, you're only telling him he can refuse a jump at will. For instance, you can start with just rails on the ground. Another way to introduce a horse to jumping is trail logs. Because they're round, there's less chance the horse will hurt himself. In addition, let him jump in the way he feels like when he first starts jumping. That is, he's inexperienced and will not be jumping properly yet. In time, he will learn, but in the meantime, still try to get into position as he jumps. In addition, try using a neck strap to help you stay on the horse."
    },
    {
      "title": "Give your horse an example.",
      "content": "Give your horse an example. Anytime you introduce your horse to something new, it helps to have an older horse around to show him what to do. Horses follow other horses' lead, so once the young horse sees the older horse do it, he'll be willing to give it a try."
    },
    {
      "title": "Move up slowly.",
      "content": "Move up slowly. Introduce higher jumps and trick jumps over time. However, every time you start, review what you've recently taught the horse to solidify it in his memory."
    },
    {
      "title": "Understand why a horse may refuse.",
      "content": "Understand why a horse may refuse. If a horse starts refusing jumps, it's usually because of the rider. The rider may be inexperienced and not approaching the jump correctly, meaning the horse feels like he can't take it. Occasionally, it may mean mean the horse shouldn't be jumping anymore. [14] X Research source If a horse decides to have trouble with a particular jump, have someone lower it for you to help the horse build confidence again."
    }
  ]
}