{
  "url": "https://www.wikihow.com/Make-Sims-Nude-in-Sims-2",
  "title": "2 Methods for Making Sims Naked in Sims 2",
  "steps": [
    {
      "title": "Open the cheat box.",
      "content": "Open the cheat box. When you're in the game, press Ctrl+Shift+c, and type the cheat \"boolprop testingCheatsEnabled true\" (without the quotation marks). Don't worry about the code that appears below."
    },
    {
      "title": "Go to a non-residential lot (like a club or park).",
      "content": "Go to a non-residential lot (like a club or park)."
    },
    {
      "title": "Find a non-playable character (NPC).",
      "content": "Find a non-playable character (NPC). Press the shift key and left-click on any NPC that you want to be nude. You will get new options."
    },
    {
      "title": "Find the 'spawn' button.",
      "content": "Find the 'spawn' button. When in the 'spawn' button, find 'Toms clothing tester.' This will open a clothes rack."
    },
    {
      "title": "Press the Shift key and left-click on the uncontrollable Sim.",
      "content": "Press the Shift key and left-click on the uncontrollable Sim. Find the 'Make Selectable' key. Once you've clicked on it, the uncontrollable Sim will now be a controllable Sim."
    },
    {
      "title": "Select your new Sim and click on the clothes rack.",
      "content": "Select your new Sim and click on the clothes rack. Click on 'Plan Outfit,' then on the 'Formal' option. After you click on the option of your choice, you will see a nude male/female Sim."
    },
    {
      "title": "Click on the tick button.",
      "content": "Click on the tick button. Make your other Sim build a relationship with the new Sim. This way, the new Sim can invite your first Sim to his/her house."
    },
    {
      "title": "Send your new Sim home.",
      "content": "Send your new Sim home. Invite the first Sim to your place, then when he/she comes, just press shift and left-click, and choose 'Make Selectable.' (Make sure you've typed in the cheat code \"boolprop testingCheatsEnabled true\")."
    },
    {
      "title": "Left-click your first Sim and find 'PlanOutfit'.",
      "content": "Left-click your first Sim and find 'PlanOutfit'. Follow the same procedure that you did for the NPC Sim."
    },
    {
      "title": "Open up the Sims 2 Body Shop.",
      "content": "Open up the Sims 2 Body Shop. If you don't know where to find it, go to Start (Windows Key/Bottom Right of the screen) and search for The Sims 2 Body Shop."
    },
    {
      "title": "Start a new clothing project.",
      "content": "Start a new clothing project. Pick the age and gender of the person you'd like to make nude. If you want to make more than one type of person naked, you'll have to do it separately."
    },
    {
      "title": "Click on the underwear category and choose something tight-fitting.",
      "content": "Click on the underwear category and choose something tight-fitting. For women, anything will do and for men, choose the briefs."
    },
    {
      "title": "Hit the \"Export Project\" button.",
      "content": "Hit the \"Export Project\" button. Name it whatever you want, though something like \"Nude\" would be best."
    },
    {
      "title": "Go to the project folder.",
      "content": "Go to the project folder. If you have Windows XP, look under Documents and Settings\\(Whatever your user account is)\\My Documents\\EA Games\\The Sims 2\\Projects If you have a Mac, look under Users\\(Whatever your user account is)\\Documents\\EA Games\\The Sims 2\\Projects If you have Windows Vista, the Downloads folder is: Users\\(Whatever your user account is)\\Documents\\EA Games\\The Sims 2\\Projects"
    },
    {
      "title": "Open up the folder with the name of your project.",
      "content": "Open up the folder with the name of your project. Inside, there will be some files. Open up body-stdMatBaseTextureName_alpha.bmp, which will be a black and white picture of the outfit you're modifying. You can use any graphics editor to open it. Even Paint, which comes with all Microsoft computers, will work."
    },
    {
      "title": "Fill in all of the white space with black and then save it.",
      "content": "Fill in all of the white space with black and then save it."
    },
    {
      "title": "Go back to Body Shop and hit the 'Refresh Project' button (the circular-arrow icon).",
      "content": "Go back to Body Shop and hit the 'Refresh Project' button (the circular-arrow icon). Make sure you didn't miss any spots on the Sim, or a piece of the fabric will show up. If you did, simply reopen the project and fill in any spots you missed and re-save. You can do this as many times as you need to."
    },
    {
      "title": "Once you're happy with your naked outfit, click on all of the icons next to the picture that you want your sim to be able to be naked in.",
      "content": "Once you're happy with your naked outfit, click on all of the icons next to the picture that you want your sim to be able to be naked in. You can add a tooltip (the text that appears when you mouse over a picture of the outfit in the Create-A-Sim, Bodyshop or when you're buying an outfit) to help you remember what you made your outfit for."
    },
    {
      "title": "Hit the \"Import to Game\" button.",
      "content": "Hit the \"Import to Game\" button. You will now be able to buy the naked outfit from a store or create a sim wearing that outfit in Create-A-Sim."
    }
  ]
}