{
  "url": "https://www.wikihow.com/Make-a-Hand-Puppet",
  "title": "How to Make a Hand Puppet",
  "steps": [
    {
      "title": "Get a clean sock in the desired color.",
      "content": "Get a clean sock in the desired color. The most basic requirement for your sock puppet is a clean sock. If you want to make a specific character, keep the color of the sock in mind. Remember that a black sock will be harder to draw on. Understand that you’ll need to attach materials to make the face rather than draw it on. You should also avoid using black materials."
    },
    {
      "title": "Figure out the space for the puppet’s face.",
      "content": "Figure out the space for the puppet’s face. Slip your sock on your hand, and use your thumb as the lower jaw and your fingers to form the face and upper jaw. This will help you block out on the sock the space for the eyes, nose, hair, etc."
    },
    {
      "title": "Make the eyes for the puppet.",
      "content": "Make the eyes for the puppet. You can use a variety of objects to make the eyes for your sock puppet. Try using googly eyes. You can find these at craft stores or in the craft section of big box stores. [1] X Research source You could also draw the eyes on a piece of construction paper. Using overlapping circles of felt for the whites, color, and pupils of the eyes is an option. [2] X Research source Try using beads as eyes. You can find plenty of beads in a wide variety at a craft store. If you need to take the sock off your hand to make the eyes, then mark the position for the eyes with a small pen mark, so you can see the rough size you want to make the eyes."
    },
    {
      "title": "Attach the eyes.",
      "content": "Attach the eyes. Depending on what you decided to use for the eyes, you may have to attach them in separate ways. For quick and easy results, you can simply use a glue stick , but a hot glue gun will yield better results. For beads and felt, you can also consider sewing the eyes to the sock. If you use a hot glue gun, make sure to take the sock off your hand first so as not to burn yourself."
    },
    {
      "title": "Make the mouth for your puppet.",
      "content": "Make the mouth for your puppet. You can make the mouth for your sock puppet as simple or complex as you'd like. For a simple mouth, try using crayons or a fabric marker to draw lips. Put your hand in the sock puppet and figure out where the mouth would be given the dimensions of your hand. Draw the lips around where your fingertips form the lips of the sock puppet. You could also make a more complex mouth. You can consider making a tongue out of construction paper or felt, making teeth with beads, or drawing a more elaborate mouth. [3] X Research source"
    },
    {
      "title": "Make hair for the puppet.",
      "content": "Make hair for the puppet. If you decide that you want your puppet to have hair, you can easily use yarn, string, felt, or anything else you want to get creative with. Simply cut the material down to size and glue it to the top of the sock at your chosen hairline for your puppet."
    },
    {
      "title": "Give your puppet a nose.",
      "content": "Give your puppet a nose. You have even more options for the nose of your puppet than some of the other features. You can use felt, a pompom, crayons, markers, or even leave your puppet without a nose. [4] X Research source For many puppets , simply drawing in nostrils with a black or color marker is more than enough for a nose."
    },
    {
      "title": "Accessorize your sock puppet.",
      "content": "Accessorize your sock puppet. Once you have the basic puppet, feel free to add any other accessories you wish. You can make antennae with pipe cleaners and pompoms, make ears with folds of felt, add glasses or a hat, etc. [5] X Research source"
    },
    {
      "title": "Buy felt, cloth, or whatever other fabric material you would like to use to make your hand puppet.",
      "content": "Buy felt, cloth, or whatever other fabric material you would like to use to make your hand puppet. You have to buy something that you can stitch together, but otherwise it’s totally up to you. Use a left over pillowcase or even the old drapes."
    },
    {
      "title": "Make your template.",
      "content": "Make your template. There are a couple ways to get a template for your hand puppet. You can buy them at crafts stores, download them online, or make them yourself. [6] X Research source If you want to make a basic hand puppet yourself, put your hand palm down on your piece of fabric. Now draw small dots on the fabric on either side of your hand to designate the width. This is how wide you’ll want the body of your template to be. Once you’ve done that, you can start drawing the outline of your puppet. If you want your puppet to have arms remember that your thumb and pinky will be controlling the arms. Put your hand back down on the fabric and designate where your thumb and pinky emerge from your hand. This is where you’ll want the arms to begin. Make sure you leave room for your fingers in the head of the puppet as well. Your index, middle, and ring finger will need to rest in there, so ensure that it is wide enough for those three fingers to fit inside. Otherwise, the drawing is up to you! Using the width of your hand as your guide make two straight parallel lines. Now round these lines off away from each other diagonally to create the arms. Try to keep them the same length. Keep in mind that they should be pretty short. Once you’ve completed the full outline of the arms draw a wide half circle for the head. Add ears, horns, or whatever else you would like to the outline."
    },
    {
      "title": "Place two pieces of fabric on top of each other.",
      "content": "Place two pieces of fabric on top of each other. Put the fabric that you drew or traced your template onto on top of the second piece of fabric. [7] X Research source"
    },
    {
      "title": "Cut the template out of both pieces of fabric.",
      "content": "Cut the template out of both pieces of fabric. Try not to cut so much that your hand will not fit in there. Make sure that the two pieces of fabric are lined up well. Once you start cutting make sure that you don't move the two pieces of fabric away from each other at all. If you're worried you can trace your template onto a piece of paper first and then cut one piece of fabric at a time."
    },
    {
      "title": "Sew the two pieces of fabric together.",
      "content": "Sew the two pieces of fabric together. Sew around the outline of your cut out fabric. Make sure you leave a hole at the bottom so you can put your hand in there."
    },
    {
      "title": "Embroider your puppet.",
      "content": "Embroider your puppet. You can add string for eyes and a mouth, different colored fabric to give your puppets spots, or anything else you can think of. If you sew on another piece of fabric to your puppet make sure you only sew through one layer of your puppet fabric. Otherwise it will be stuck together."
    },
    {
      "title": "Draw a template for the puppet’s shape.",
      "content": "Draw a template for the puppet’s shape. The hand puppet should be roughly the size of your hand from your wrist to the tips of your fingers. Trace around your hand on a piece of paper while extending your thumb. Your thumb will be one arm of the puppet, your pointer finger will be the head, your middle finger will be the other arm, and your two smallest fingers will be bent toward your palm. Remember to include any other details your want to include in the shape of the felt, such as little semi-circles on top of the head for ears. You may want to leave a little more room past the edges of your fingertips to accommodate the space where you will sew the puppet together."
    },
    {
      "title": "Cut out the template.",
      "content": "Cut out the template. Once you have a template you’re happy with, you’ll need to cut it out from the paper. [8] X Research source"
    },
    {
      "title": "Pin the template to a piece of felt.",
      "content": "Pin the template to a piece of felt. You’ll need felt from a craft store or the craft section of a big box store in your desired color for this method. Rather than tracing the template onto the felt, you can easily just pin the template down against the felt. [9] X Research source Remember to make sure that the bottom portion of the template (where the template reaches your wrist) lines up with the bottom edge of the felt. This is where your hand will go into the puppet. You’ll need both a front and a back piece of the hand puppet, so you can easily place two pieces of felt on top of each other and pin the template to both of them at once."
    },
    {
      "title": "Cut out the hand puppet shape from the felt.",
      "content": "Cut out the hand puppet shape from the felt. With the template pinned firmly to the felt, you can cut out the pieces of the hand puppet. [10] X Research source Try to cut in smooth, fluid lines rather than jagged ones to ensure that you have a polished finished product. If you did not line up two pieces of felt together, then pin the template to the second piece of felt and cut it out as well."
    },
    {
      "title": "Accessorize the body of the hand puppet.",
      "content": "Accessorize the body of the hand puppet. It’s easier to add things to the body of the hand puppet before sewing the two halves together, so now is the time to accessorize the body. For instance, if you are making a teddy bear hand puppet, then you may have dark brown felt for the body, and you can add an oblong, tan piece of felt for the tummy. [11] X Research source You can attach the tummy felt with either a hot glue gun or by sewing it. All of the sewing required for this project is very simple, but you can learn more about sewing if you need to at: How to Sew ."
    },
    {
      "title": "Give the hand puppet a face.",
      "content": "Give the hand puppet a face. Now you’re ready to accessorize the face of the hand puppet. You can use a variety of different objects to help you create the face. [12] X Research source Consider using beads, other pieces of felt, or even googly eyes for the eyes. You can use a bead, a pompom, other felt, or even just a knot of stitches for the nose. For the mouth, you can create lips or a tongue with felt, stitch a mouth, or come up with another idea for a mouth entirely. If you made the shape for ears in your felt, your can also give more definition to the ears by sewing or gluing a smaller semi-circle of felt onto the ear. For the bear example, you can easily use the same lighter color you used for the tummy."
    },
    {
      "title": "Sew the front and back pieces of the hand puppet together.",
      "content": "Sew the front and back pieces of the hand puppet together. Once you’re happy with the body and face of your puppet, you are ready to sew the pieces together. Follow around the edges of the two pieces of felt and sew them together with stitches close enough that you can’t accidentally stick your fingers through the edges of the puppet. [13] X Research source Remember to leave the bottom edge of the puppet stitch free since this is where you need to put your hand inside the puppet."
    },
    {
      "title": "Bring your puppet to life.",
      "content": "Bring your puppet to life. Once you’re done with all of the sewing, you are ready to bring your puppet to life. Put your hand inside the puppet in the most comfortable position with your fingers and start practicing working the arms and head of the puppet."
    }
  ]
}