{
  "url": "https://www.wikihow.com/Make-Pepper-Spray",
  "title": "How to Make Pepper Spray",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. [2] X Research source Pepper spray mixture can be made using household ingredients. Here are the main ingredients you'll require for your mixture: Cayenne pepper. Cayenne pepper is recommended for its spiciness and ability to irritate the eyes. You won't need a lot of it to get it to work; two tablespoons of it will give you enough for several sprays' worth of mixture. 92% alcohol and vegetable oil. These will be used to mix with the cayenne pepper into a sprayable substance."
    },
    {
      "title": "Add pepper to a mixing cup.",
      "content": "Add pepper to a mixing cup. Add two tablespoons of cayenne paper to a small cup. [3] X Research source A small, clear glass is best in this case because it will allow you to mixture proportions more easily. Alternatively, instead of using powder, you can grind peppers up yourself and add them to the mix. Even if you want to make more than two tablespoons' worth, it's a good idea to begin with this set proportion. That way, you'll get a hands-on idea of a good pepper spray's texture and consistency."
    },
    {
      "title": "Submerge pepper in alcohol solution.",
      "content": "Submerge pepper in alcohol solution. [4] X Research source Rubbing alcohol will give the cayenne powder a liquid to grip onto. Pour rubbing alcohol over the cayenne pepper until the pepper has been completely submerged. Stir constantly to get a better idea of the mixture's progress."
    },
    {
      "title": "Give the mix vegetable oil.",
      "content": "Give the mix vegetable oil. Add one tablespoon of vegetable oil for every two tablespoons of cayenne pepper you've dished out. Stir the mixture well. Baby oil is a viable alternative to vegetable oil."
    },
    {
      "title": "Include extra ingredients.",
      "content": "Include extra ingredients. True to its name, pepper spray's active ingredient is pepper. If you want a more intense mixture, you should replace the cayenne pepper with a pepper that scores higher on the Scoville Hotness meter. In addition, because you're making this pepper spray from home, there's not necessarily any rule to state what you can and can't add. Citrus is a natural irritant on the eyes, so squeezing in a lemon will add to the sting your spray causes. Soap is a known irritant that many add to their homemade pepper sprays. [5] X Research source If you're considering adding anything else into your pepper spray mix, you should make sure that it won't cause permanent damage if it comes in contact with someone's eyes. Pepper spray is intended solely as a non-lethal method of self-defence ."
    },
    {
      "title": "Allow the mixture to settle overnight.",
      "content": "Allow the mixture to settle overnight. [6] X Research source Place a layer of plastic wrap over the mixture and secure it by pulling an elastic band around the cup. Let it sit at least overnight for the mixture to properly settle. After enough time has passed, take off the wrapping."
    },
    {
      "title": "Filter your spray mixture.",
      "content": "Filter your spray mixture. [7] X Research source Get another cup and fix a coffee filter or cheesecloth overtop. When a filter is in place, gently pour the spray mixture through the filter. This will pick up the solid matter, leaving the spray a liquid. Filtering the mixture as such will help prevent clogging the nozzle with sediment after use."
    },
    {
      "title": "Wash your eyes",
      "content": "Wash your eyes immediately if you get any mixture on you. [8] X Research source Pepper spray is an intense irritant on the eyes. Keep an eyewash station nearby if you have the option. Most importantly, be very careful while you prepare the mixture."
    },
    {
      "title": "Make sure you have all of the necessary equipment.",
      "content": "Make sure you have all of the necessary equipment. An empty deodorant can. Make sure it has its safety cap on, and that the can is free of any puncture marks. It's a good idea to clear out the deodorant can as much as you can before adding in pepper spray. A tire valve. A tire valve will add pressurization to your can after the spray's been added. These can be bought at department stores and auto repair shops. A drill. An electric drill will allow you to open a hole in the bottom of the spray can. Aim for a 9mm drill bit. [9] X Research source Epoxy. You will only need a few grams of the putty to A syringe or funnel. An air compressor. Because you'll be using a tire valve to pressurize your can, a car tire air pump should work for this purpose."
    },
    {
      "title": "Drill a hole",
      "content": "Drill a hole in the bottom of the can. [10] X Research source Drill a 9mm hole in the bottom of your spray can. This will be used to fill the can with mixture and compressed air. Hold your drill steady and try to make as even a hole as possible. This will make it easier to patch up with epoxy once you've filled the can. Alternatively, you can avoid the can process altogether by using capped spray bottle. You should take lengths to make sure that the spray has no chance of getting out however. Tape the head and nozzle shut when it's not in use."
    },
    {
      "title": "Inject the can's hole with spray fluid.",
      "content": "Inject the can's hole with spray fluid. [11] X Research source It's now time to add pepper spray to your can. Taking a cooking syringe, suck up the mixture and inject it in the hole you drilled. Repeat this until all of your mixture is in the can. A funnel is a solid alternative in lieu of a syringe. [12] X Research source"
    },
    {
      "title": "Fill the hole with epoxy.",
      "content": "Fill the hole with epoxy. Epoxy will be used to patch up the hole you drilled in the can. Take a bit of it and dab over the hole. Wipe off the excess material you don't need, and allow it a few minutes to settle before you continue. It's a good idea to wear a set of gloves while handling epoxy."
    },
    {
      "title": "Attach a tire valve in the hole.",
      "content": "Attach a tire valve in the hole. While the epoxy is still solidifying, push your tire valve through the hole. This will give you a quick way to pressurize the can. The hole you covered with epoxy won't let the air escape once it's inside. If you give it a few minutes to sit, the epoxy should hold the tire valve in place. [13] X Research source Make sure you push the tire valve most of the way in. It needs to be able to poke past the epoxy through to the other side."
    },
    {
      "title": "Spray paint",
      "content": "Spray paint your can. [14] X Research source Some people prefer to decorate their homemade products. Painting over the old can will distinguish it from all other cans. This is especially important if there's a risk that someone might mistake the pepper spray for the can's written contents. Spray painting a can black will make it more concealable. Adding a decal can make your homemade can look more professional. It helps to state clearly on the can what it is."
    },
    {
      "title": "Pressurize the can with an air compressor.",
      "content": "Pressurize the can with an air compressor . [15] X Research source Hook the tire valve up with an air compressor. Fill it up with air, and keep your eye on the pressure gauge. As the pressure increase, you should be able to tell a difference in the feel of the can."
    },
    {
      "title": "Spray the can.",
      "content": "Spray the can. Practice your aim on a hard surface once you get the hang of spraying before you need to use it in real-life. Make sure the can nozzle is facing away from you, and squeeze the trigger lightly. Shoot the pepper spray in short, controlled bursts. If you need to use it against an assailant, you'll only need a little bit to incapacitate him. Most pepper spray cans have an effective range of about 10 feet. [16] X Research source The effects of pepper spray last from 45 minutes to an hour. However, lingering effects will last up to three hours."
    },
    {
      "title": "Store the spray at room temperature.",
      "content": "Store the spray at room temperature. Pepper spray is a volatile substance. Like any pressurized contents, you need to make sure it's store in a temperate area where it won't be affected by extremes in heat. Keep it locked away in a cupboard or climate-controlled storage room when you're not using it. Just as importantly, keep the spray out of reach from others."
    }
  ]
}