{
  "url": "https://www.wikihow.com/Make-Cola-Popsicles",
  "title": "How to Make Cola Popsicles",
  "steps": [
    {
      "title": "Prepare a cupcake pan.",
      "content": "Prepare a cupcake pan. Find a cupcake pan or anything with cup molds in it. Clean it out by washing it with soap and water. Dry the pan with a paper towel or rag."
    },
    {
      "title": "Find a cola.",
      "content": "Find a cola. All colas are different so find the one you like and prefer. Try looking for flavor options for a little twist and flavor to your popsicles. Some popular flavor options could be vanilla, cherry, lemon, or lime. For a healthier choice and dessert, try using a diet cola instead of regular cola."
    },
    {
      "title": "Pour the cola in the number of molds desired.",
      "content": "Pour the cola in the number of molds desired. Figure out how much popsicles you'll exactly need. Pour the amount of how much you need. When pouring the cola in the molds, fill it all the to the top. This helps the popsicle get bigger and have more room to eat. Popsicles that are too flat won't look very appealing."
    },
    {
      "title": "Place aluminum foil on top of the pan.",
      "content": "Place aluminum foil on top of the pan. Rip a piece of aluminum foil and cover it on the cupcake pan. Tuck in the edges to have the foil stick together. Plastic wrap can also be used as a substitute. Try using a plastic wrap that is strong so it can hold the popsicles together in a better standing position."
    },
    {
      "title": "Poke popsicle sticks in the aluminum foil.",
      "content": "Poke popsicle sticks in the aluminum foil. In each cupcake hole, poke a popsicle stick in between. It should pop in easily and if it doesn't try poking it harder. Do not use toothpicks when making these popsicles. The popsicles are round from the cupcake pan and the toothpicks will be too thin to be able to hold the popsicles. Also, the edges are pokey and may harm others by mistake."
    },
    {
      "title": "Freeze.",
      "content": "Freeze. Place popsicles in a freezer and wait until thoroughly frozen. For it to be thoroughly solid, wait about three hours to overnight. Some people make the mistake by taking out their popsicles too early. The popsicles break and crack open their liquid. Always freeze at the appropriate timing, but never over-due it as the popsicles can smell funny afterwards from sitting too long in the freezer."
    },
    {
      "title": "Take out popsicles from freezer and remove foil.",
      "content": "Take out popsicles from freezer and remove foil. Open the freezer and take the cupcake pan out of the freezer. Set it aside on a counter or cooking space. Remove aluminum foil by getting the ends and pulling it up."
    },
    {
      "title": "Remove popsicles from pan.",
      "content": "Remove popsicles from pan. Remove the frozen cola out of the pan by pulling the popsicle handle lightly. If that doesn't work, flip over the pan and gently hit it so the pops can come out."
    },
    {
      "title": "Enjoy eating your cola popsicles!",
      "content": "Enjoy eating your cola popsicles!"
    }
  ]
}