{
  "url": "https://www.wikihow.com/Make-Flaxseed-Hair-Gel",
  "title": "How to Make Flaxseed Hair Gel",
  "steps": [
    {
      "title": "Place 1/4 cup (37 g) flaxseeds in a bowl with water overnight.",
      "content": "Place 1/4 cup (37 g) flaxseeds in a bowl with water overnight. Measure out your flaxseeds in a container you can cover. Pour in 2 cups (470 mL) of distilled or filtered water. Put the solution in the refrigerator for 8 hours or so. You can find flaxseeds at most grocery stores in the baking aisle or health food aisle. It's fine if you need to leave the solution in the fridge for longer. Soaking the flaxseeds first isn't absolutely necessary, but it will increase how much gel you get. Distilled or filtered water has fewer additives, meaning your hair gel will likely last longer if you use one of these types of water. However, tap water will also work."
    },
    {
      "title": "Bring the flaxseeds and water to a rolling boil in a saucepan.",
      "content": "Bring the flaxseeds and water to a rolling boil in a saucepan. Dump the mixture from the container into the pan. Place it on the stove over medium-high heat, letting it come to a rolling boil. Aim for a pot that's 2 to 3 US quarts (1,900 to 2,800 mL)."
    },
    {
      "title": "Simmer for 7-10 minutes, stirring often until the mixture thickens.",
      "content": "Simmer for 7-10 minutes, stirring often until the mixture thickens. Once the mixture reaches a rolling boil, turn the heat down to medium-low. As it simmers, stir it frequently so that the flaxseeds don't stick to the bottom and burn. Keep an eye on the pot, as it can overflow if you're not careful. [1] X Research source If it looks like it's about to overflow, take it off the heat for a few seconds to let it cool."
    },
    {
      "title": "Take the pot off the heat when you see tan-colored foam and a thicker consistency.",
      "content": "Take the pot off the heat when you see tan-colored foam and a thicker consistency. After 7-10 minutes, the mixture will start to thicken. It won't be as thick as typical gel while it's still hot, but it will have a gelatinous quality when you pour some off the spoon. [2] X Research source"
    },
    {
      "title": "Pour the mixture through a strainer lined with cheesecloth or pantyhose.",
      "content": "Pour the mixture through a strainer lined with cheesecloth or pantyhose. Set the lined strainer over a bowl or glass measuring cup with a spout. Allow the mixture to drain as much as possible while you move the seeds around with a spoon. Once the mixture has cooled enough to touch, you can gather up the cheesecloth or pantyhose to squeeze out more gel. [3] X Research source If you don't have cheesecloth or pantyhose, a fine mesh strainer will suffice to get out most of the flaxseed bits. Rinse the pot immediately, as the gel is difficult to remove once it dries."
    },
    {
      "title": "Add essential oils if desired and pour the gel into a clean container.",
      "content": "Add essential oils if desired and pour the gel into a clean container. Stir in 30-35 drops of your favorite essential oil once the mixture has cooled. However, if you don't have any oils, you can leave them out. [4] X Research source At this point, you can also add 1 tablespoon (15 mL) of olive oil, shea butter, or aloe vera gel, which will create a thicker consistency. Tea tree oil or lavender oil are good options, as they can extend the life of the gel from 2 weeks to 1-2 months. When the gel goes bad, it will smell rancid. Clove and cinnamon oils may dry out your skin and hair."
    },
    {
      "title": "Pour the mixture into an airtight container and store it in the refrigerator.",
      "content": "Pour the mixture into an airtight container and store it in the refrigerator. Keep air and bacteria out as much as possible. A jar with a spring-top lid works well, as it is very airtight. Refrigerate this gel for a much longer shelf life. [5] X Research source If you make a lot at once, you can store some in the freezer for up to 6 months."
    },
    {
      "title": "Portion out a little at a time into a small squeeze bottle.",
      "content": "Portion out a little at a time into a small squeeze bottle. Put a few spoonfuls into a small squeeze bottle to use for a couple of days at a time. It's easier to apply to your hair, and you're not introducing bacteria to the main gel with your hands. [6] X Research source Plus, if you forget and leave this jar out, you've only wasted a little gel."
    },
    {
      "title": "Smell the gel every time you open it to see if it's gone bad.",
      "content": "Smell the gel every time you open it to see if it's gone bad. You should be able to tell easily if the gel isn't good anymore. It will have a bad, off-putting smell that will overpower the essential oils. If it smells rotten, it's time to toss the gel and make more. If you find you can't use all the gel before it goes bad, try making it in smaller batches. [7] X Research source It can last as long as 2 months."
    },
    {
      "title": "Add flaxseed gel to damp hair for soft curls with bounce.",
      "content": "Add flaxseed gel to damp hair for soft curls with bounce. Squeeze a cherry-sized amount of gel into your hands and use your fingers to work it through your damp hair. Let your hair dry naturally for light and natural curls. [8] X Research source You may need to use a touch more gel then you would with a commercial product, as flaxseed may not have quite as much hold."
    },
    {
      "title": "Use flaxseed gel in combination with other products for more definition.",
      "content": "Use flaxseed gel in combination with other products for more definition. Apply a cherry-sized amount to damp hair with your fingers, then add a similar amount of pomade or another product. Style your hair as you normally would. [9] X Research source This gel has good, natural hold, but if you need a bit more definition, you may want to add a pomade or another product."
    },
    {
      "title": "Flip your head upside down to add volume, scrunching the ends for curls.",
      "content": "Flip your head upside down to add volume, scrunching the ends for curls. Get a cherry-sized amount in your hands and rub it into your palms. With damp hair, turn your head upside-down and run your hands through your hair from the roots. When you get to the ends, use your hands to squish them a bit to apply the gel and encourage curls. Flip your head back up and adjust your hair as needed."
    }
  ]
}