{
  "url": "https://www.wikihow.com/Make-Blush",
  "title": "How to Make Blush",
  "steps": [
    {
      "title": "Consider making a pressed powder blush.",
      "content": "Consider making a pressed powder blush. This blush closely resembles the blush you would buy in a store, except that it lacks all of the dangerous chemicals. You can apply it like you would any other pressed powder blush with a brush or makeup sponge. This section will show you how to make pressed powder blush."
    },
    {
      "title": "Find a mixing bowl.",
      "content": "Find a mixing bowl. You will need a small bowl to mix all of your ingredients together. Make sure that the bowl is clean, or you will risk contaminating your makeup."
    },
    {
      "title": "Put your food coloring and water in a bowl and mix together.",
      "content": "Put your food coloring and water in a bowl and mix together. You will need 3 tablespoons of water. The amount of food coloring you use will determine how dark or how light you want your blush to be. Here are some proportions to get you started: [1] X Research source For a light pink blush, use 1 to 2 drops of red food coloring. For a medium pink blush, use 3 to 4 drops of red food coloring. For a dark pink blush, use 5 to 6 drops of red food coloring."
    },
    {
      "title": "Consider tinting your blush with other colors.",
      "content": "Consider tinting your blush with other colors. You can leave your blush a traditional pink, or you can add other colors to get the shade you want. Yellow food coloring will give you more of an orange tint, while blue will give you more of a purple tint. Start with one drop at a time, and be sure to mix between drops. Do this until you get the color you achieve. [2] X Research source If your blush ends up too orange or too purple, then add in a drop or two of red food coloring. If you are aiming for a light-colored blush, you may have to balance this out by adding a few drops water."
    },
    {
      "title": "Add in a bit of baby powder and mix.",
      "content": "Add in a bit of baby powder and mix. You want to end up with a thick paste. Try adding 1 to 2 teaspoons of baby powder at a time. If you do not have any baby powder, you can make your own by combining cornstarch and arrowroot powder. The blush will be damp and have a darker color, but it will lighten a little once it dries."
    },
    {
      "title": "Transfer your blush in a container.",
      "content": "Transfer your blush in a container. You can use any container you want, but a shallow container, such as an old makeup pallet, will work best. You will be applying this blush with a brush. Make sure that your container has a lid."
    },
    {
      "title": "Smooth out the blush.",
      "content": "Smooth out the blush. When you first put your blush into the container, it may be lumpy. Use a spoon, knife, or spatula to smooth the surface down so that it is flush with lip of the container—just like a store-bought blush. You may end up with some excess blush during this process. If you do, either discard the excess blush or transfer it to another container to make more blush. Consider pressing the blush. If the blush is still too lumpy and moist, you can place a paper towel onto the blush, and then pressing down on it with something hard and smooth, such as a spice bottle or a wooden block."
    },
    {
      "title": "Wait for the blush to dry.",
      "content": "Wait for the blush to dry. Set the blush in a warm, dry, and preferably sunny location. Open the lid and leave it for 24 hours. After this, the blush should be dry and ready to use. Note that, depending on how much water you added, your blush may require more drying time."
    },
    {
      "title": "Use the blush.",
      "content": "Use the blush. You can apply your blush as you would any other store-bought powder blush, using a brush or a makeup sponge. Be sure to keep the lid on your container closed when you are not using the blush."
    },
    {
      "title": "Consider making some loose powder blush.",
      "content": "Consider making some loose powder blush. This blush closely resembles the loose, mineral powder blush you might buy in a store, except that it costs much less. You can apply it using a brush or poof. This section will show you how to make your own loose powder blush."
    },
    {
      "title": "Find a mixing container.",
      "content": "Find a mixing container. You will need some sort of to combine all of your ingredients. Because you are working with such small amounts, you can use a small mixing bowl, or even a cup."
    },
    {
      "title": "Pour beetroot or hibiscus powder into the mixing container.",
      "content": "Pour beetroot or hibiscus powder into the mixing container. You will need ½ teaspoon of beetroot or hibiscus powder. Pour the powder through a sifter into a bowl and break up any clumps you may find with a fork. If your powder is still too clumpy, then you may have to grind it further using a coffee grinder or a pestle and mortar. If your beetroot powder comes in a capsule, simple pull the capsule apart and pour out the beetroot powder. Discard the capsule. Keep doing this until you have enough beetroot powder. You can also use freeze-dried or dehydrated strawberries and raspberries as well. Be sure to grind them into a fine powder in a coffee grinder, or by using a pestle and mortar, before using them in your recipe."
    },
    {
      "title": "Add the arrowroot powder and mix.",
      "content": "Add the arrowroot powder and mix. You will need ½ teaspoon of arrowroot powder. Once you have measured it out, add that into your mixing bowl. Mix everything together with a fork. You can also transfer the ingredients into another bowl through a sifter; not only will the sifter blend everything together smoothly, but it will also break up any remaining clumps. [3] X Research source If you do not have any arrowroot powder, you can substitute it with cornstarch. [4] X Research source"
    },
    {
      "title": "Adjust as needed.",
      "content": "Adjust as needed. If your blush is too dark, you can lighten it by adding more arrowroot powder. If your blush is too light, you can darken it by adding some cocoa powder. Be sure to mix everything again after you have added your powder."
    },
    {
      "title": "Consider adding some shimmer.",
      "content": "Consider adding some shimmer. You can add a little shimmer to your powder blush with ground ginger or ground nutmeg. [5] X Research source You can also use mica powders as well. Once you have added your shimmer, mix the ingredients again using a fork. Ground ginger will give you a light-colored shimmer. Ground nutmeg will give you a darker shimmer."
    },
    {
      "title": "Consider adding some essential oil.",
      "content": "Consider adding some essential oil. The essential oil is not necessary, but it will help the powder stick better to your skin. [6] X Research source It will also give it a nice fragrance. Simply add a drop or two of essential oil and mix the blush again using a fork. Keep in mind, however, that this might cause the blush to become more clumpy. Use floral or sweet fragrances, such as chamomile, lavender, rose, or vanilla."
    },
    {
      "title": "Consider decorating your container.",
      "content": "Consider decorating your container. You can leave your container plain, or you can decorate it with stick-on gemstones. You can also make a custom label for it."
    },
    {
      "title": "Consider making a cream blush.",
      "content": "Consider making a cream blush. Cream blushes don't have to contain dangerous chemicals. By making your own cream blush, you get to decide exactly what goes into it—and you can customize the color too. This section will teach you how to make your own cream blush. You can apply it using your fingers or makeup sponge."
    },
    {
      "title": "Assemble your double boiler.",
      "content": "Assemble your double boiler . Fill the bottom pot with an inch or two of water and place the upper pot on top. Transfer everything to the stove and turn the stove on to a medium heat. If you do not have a double boiler, then you can make your own by filling a large pot with an inch or two of water, and placing a large bowl over it. The bottom of the bowl should not touch the water."
    },
    {
      "title": "Measure out the shea butter and emulsifying wax and put it the a double boiler.",
      "content": "Measure out the shea butter and emulsifying wax and put it the a double boiler. You will need 1 teaspoon of shea butter and ½ teaspoon of emulsifying wax. Place both ingredients into the upper pot or bowl of your double boiler."
    },
    {
      "title": "Melt shea butter and wax in a double boiler.",
      "content": "Melt shea butter and wax in a double boiler. Heat the two ingredients until they melt. Be sure to stir them while they are melting with a spoon or spatula. This helps the butter and wax melt more evenly, and it mixes them together."
    },
    {
      "title": "Remove the double boiler from the stove.",
      "content": "Remove the double boiler from the stove. Once the shea butter and emulsifying wax have melted completely, turn the stove off and move the double boiler to a heat-resistant surface. The mixture in the pot should look translucent, and there should be no clumps."
    },
    {
      "title": "Add aloe and mix until smooth.",
      "content": "Add aloe and mix until smooth. Once the mixture has cooled slightly, measure out 1 tablespoon of aloe gel and transfer it to the mixture. Blend everything together with a spoon or spatula. Try to use a clear aloe gel, as opposed to a tinted one."
    },
    {
      "title": "Add mica and cocoa powders a little bit at a time.",
      "content": "Add mica and cocoa powders a little bit at a time. Add both your mica and cocoa powders a little bit at a time until you get the color you want. You can use any color of mica powders you want, but pinks and reds might yield the best and most natural results. The cocoa powders will help darken the blush. If you wish to have a lighter blush, then use less cocoa. You will need ½ to 1 teaspoon of each powder, depending on your preferences. Consider dipping a spoon into the mixture, letting it cool, and holding it against your cheek to make sure you have the right color."
    },
    {
      "title": "Transfer everything into a little jar and let it solidify.",
      "content": "Transfer everything into a little jar and let it solidify. Once you have achieved the color you want, transfer everything into a small, seal-able jar using a spoon or spatula. Leave the jar in a cool place, unopened, until it has solidified, then seal the jar tightly with a lid. Wait 24 hours before using the blush. This allows it to solidify. [7] X Research source"
    },
    {
      "title": "Consider decorating your container.",
      "content": "Consider decorating your container. You can leave your container as is, or you can personalize it further by adding a personalized label or embellishing it with stick-on gems."
    },
    {
      "title": "Store your cream blush in a cool, dry place.",
      "content": "Store your cream blush in a cool, dry place. It should last for several weeks to a few months, depending on the ingredients used. If you notice any changes in the texture or smell, it's time to make a new batch."
    },
    {
      "title": "Make a simple cheek stain using beets, olive oil, and honey.",
      "content": "Make a simple cheek stain using beets, olive oil, and honey. You will need one peeled and chopped beet, 4 tablespoons of olive oil, and 2 tablespoons of honey. Place all of the ingredients into a blender and blend until everything is smooth. Transfer your stain into a small, seal-able container and store it in the refrigerator. The stain will keep for one month. [8] X Research source You can also freeze your cheek stain. It will keep in the freezer for two months."
    },
    {
      "title": "Consider making a simplified cream blush.",
      "content": "Consider making a simplified cream blush. Sometimes, we just don't have all of the ingredients on hand, or sometimes we don't have the time to melt the butters and waxes. If this is the case, then simply add 1 to 2 teaspoons of mineral powder to 1 tablespoon of moisturizer and transfer it to a small container. [9] X Research source"
    },
    {
      "title": "Make cream blush using lipstick.",
      "content": "Make cream blush using lipstick. You can also make cream blush using lipstick and coconut oil. You will need at least half of a lipstick (not sheer) and 1 teaspoon of coconut oil. Melt the lipstick in the microwave (about 15 to 30 seconds) or in a spoon held over a burning candle. Mix the melted lipstick with the coconut oil and transfer it to a small, seal-able container. Wait until the mixture cools down and becomes solid before using it."
    }
  ]
}