{
  "url": "https://www.wikihow.com/Go-Streaking",
  "title": "How to Go Streaking",
  "steps": [
    {
      "title": "Pick a place.",
      "content": "Pick a place. The timid might experiment with the backyard, an abandoned street or somewhere uncrowded at night. The bold (or those with authority problems) may aim for busy malls in the middle of the day. The extreme streaker may choose the football field during game time, right in front of all the cameras. How daring are you feeling? Know that the more extreme your location, the more extreme the consequences. If you want to go streaking through a mall, you'll really just be running through a mall naked getting chased by security guards. And the football field? You're asking to be on tomorrow night's Tosh.O and you might be watching it from a 24-hour holding cell. It depends on your location, but you could either receive a fine, get arrested, or get put on the sex offender list (depending on the gravity of your circumstances). Research the laws in your region before you go about ruining the rest of your life for 30 seconds of harmless fun. [1] X Research source"
    },
    {
      "title": "Pick a time.",
      "content": "Pick a time. You'll look a lot skinnier in the dark. But if you want the world to experience you in your natural form, just like you were moments after you wrestled out of your mother's womb, do it in broad daylight. And if your stretch marks and fat rolls make it viral on YouTube, awesome. That's half the fun, right? If you're planning a streak on private property, also be aware of trespassing laws. What is already illegal in the daytime is doubly illegal after hours if you're somewhere you're not supposed to be. [2] X Research source"
    },
    {
      "title": "Choose your company wisely.",
      "content": "Choose your company wisely. Too many stories involve some poor schmuck getting his undies stolen. Then he has to grab the nearest garbage can lid (as if garbage cans had lids anymore) and parade his way through the nearest wedding in his starkers just to make a phone call to his mom. Don't let that kid be you. Get with a group of friends that you trust, that will not mind seeing you naked and that you don't mind seeing or being seen while naked. If your friend is also streaking, make sure they're the type that you want to see naked too. And if all those guidelines rule out everyone you know, just go at it alone! That way the glory can be all yours. All eyes on you."
    },
    {
      "title": "Cover all your bases.",
      "content": "Cover all your bases. This is one of those plans where you need all your exits clearly marked and located. If the cops do come after you, if things do go awry, what's your out? How are you going to handle it? Who's driving your getaway car? And what are you going to wear? Where are your clothes going to be? On your head, in your hands, or somewhere else? Where's your transportation and how swiftly can you get to it when it all hits the fan? Are you going to wear a wig so no one recognizes you? How about shoes? Do your feet need protecting, wherever you are (especially if you need to run fast)? If you're working on a rather tight time frame, plan what clothes you're going to be shedding. A robe can be thrown off in seconds, but those skinny jeans may take minutes to peel off, putting you in a rather vulnerable position."
    },
    {
      "title": "Go to the scene of the crime.",
      "content": "Go to the scene of the crime. Literally - this is illegal. [3] X Research source But you've done all this planning, so you might as well go through with it. Did you pound some caffeine beforehand? This type of thing takes some serious energy and adrenaline. Did you bring your guts and lack of shame? Hope so!"
    },
    {
      "title": "Do a quick peripheral check.",
      "content": "Do a quick peripheral check. The phrase \"watch your 6\" comes from streaking (questionable sources, though). If you're in a public place, scan the scene. Are there children present? Police? Obstacles that could trip you up (very literally)? The last thing you want to be is buck naked, spread-eagled (due to an unfortunate faceplant) in front of a six-year-old girl who's crying her eyes out and asking questions you're not prepared to answer. So check left, check right, and whip around. If you're part of a crew, there's strength in numbers. Designate a person or two as a guard to keep watch. If something's amiss, establish a signal that can cue you to abort mission. You'll just have to try again tomorrow."
    },
    {
      "title": "Take off all your clothes.",
      "content": "Take off all your clothes. Ah, sweet, sweet freedom. A healthy breeze around your privates. The way Mother Nature and Nelly intended. Just don't get too used to it. It's not streaking anymore if you just keep your clothes off. So run around, do your thing, and get your fill. How's it feel? Put your clothes in a safe place or with friends that you trust before leaving them. If there is any chance you won't get your clothes back safely, put your underwear around your head so you will have some cover if needed. Or get another pair of clothes and hide them just in case. That underwear can also come in handy if the police arrive unexpectedly."
    },
    {
      "title": "Go for it.",
      "content": "Go for it. Well, don't just stand there. Jump around. Do some lunges. Dive in. Adopt the Captain Morgan pose. Because how often does this moment happen? Not often enough is the correct answer, yes. So take these next 30 seconds and milk them for all they're worth. You may not get another chance ever . If you want attention, scream and yell and you'll get it. It may be from the wrong people, but you'll get it. And those people will probably have some form of a recording device on them, so don't be surprised when they whip those out. There's no way this can get back to your employer, right?"
    },
    {
      "title": "Turn it into a game.",
      "content": "Turn it into a game. Just how far will you and your friends go? Who can last the longest and what crazy deeds can you do? Your locale will determine what kind of games you can play, but don't let your environment harsh your creativity. Here's a couple ideas: Take a tennis ball (or some random small object) and place it far away. One person has to streak to it and move it further away. Then the next person has to do the same. Soon enough, someone will chicken out! If you're in a public place, consider time, volume, and audacity to be your three variables. Who can do it the longest? Who is willing to be the loudest? Who is the most willing to make themselves seen and vulnerable?"
    },
    {
      "title": "Put your clothes back on.",
      "content": "Put your clothes back on. Well, it was short-lived, but it was sweet. If it were any longer-lived, it wouldn't be nearly as special. Brevity keeps the exceptional from turning into the mundane, so put your clothes back on (you're probably a little chilly anyway) and turn to your friends and talk about that one time when you all went streaking. How awesome was that? Did anyone get pictures? If you can't find your clothes, for once wikiHow can't really help you. You could make your own , but it's probably easier to ask for the shirt off someone's back or to just parade around until you're escorted to somewhere that'll give you a bright orange jumpsuit."
    },
    {
      "title": "Relish the memories.",
      "content": "Relish the memories. When you have grandchildren, you can regale them with the tale of that one time you laughed in the face of social norms and paraded around in your starkers as happy as a clam on Friday afternoon. Or you could not wait until you have grandkids and challenge your friends now to be as awesome as you are! Snowball's chance in hell, but they can try!"
    }
  ]
}