{
  "url": "https://www.wikihow.com/Know-if-Someone-is-Bisexual",
  "title": "How to Tell If You or Someone Else Is Bisexual",
  "steps": [
    {
      "title": "They talk about finding people of different genders attractive.",
      "content": "They talk about finding people of different genders attractive. Some people feel comfortable commenting on other people's looks or bodies and don't think anything of it. But if they're continually making comments about the sexual attractiveness of different genders, it's more likely that they're bisexual. You might also look at the way they act around people of different genders. \"The signs overall would be rather similar to a heterosexual couple,\" relationship expert Joshua Pompey explains, \"in the sense that if a guy is interested in another guy, there's still going to be that playful flirting.\" Pompey recommends that you pay attention to body language, eye contact, and their tone of voice, adding \"I think that, if you're paying attention to the signs… they will be there.\""
    },
    {
      "title": "They've been in relationships with people of different genders.",
      "content": "They've been in relationships with people of different genders. Romantic attraction and sexual attraction are two different things, but if someone's had relationships with different genders, it's pretty likely that they identify as either bi or pan. While there are some differences between these two sexual identities, they essentially both involve people who are attracted to multiple genders. [1] X Research source"
    },
    {
      "title": "They've had crushes on people of different genders.",
      "content": "They've had crushes on people of different genders. Who someone has a crush on can give you some idea of the type of person they like. If they've pretty clearly had crushes on different genders, you can at least infer that they're sexually curious about those genders. While this doesn't necessarily mean that they identify as bisexual, it gives you a good basis to question them further. [2] X Research source For example, you might say, \"I couldn't help but notice you drooling over both Jaden and Sarah. Is it possible that you're bi?\""
    },
    {
      "title": "They speak about their love life vaguely.",
      "content": "They speak about their love life vaguely. If someone isn't comfortable talking about their sexuality yet, they might also be really vague about their sex life or love life in general. They might be concerned that if they start talking, they'll accidentally reveal too much and out themselves. Or they might hope that you'll notice they're being unusually vague and ask them about it. [3] X Research source They might change the subject when you ask about their dating life or seem uninterested when you bring up yours. If you ask them questions, they'll likely answer in generalities. It might also be that they're simply very private and don't like talking about their love life. You can always ask. For example, you might say, \"You don't seem comfortable talking about the dating world right now—no worries! Tell me about something cool you've seen recently.\""
    },
    {
      "title": "They use gender-neutral pronouns and language.",
      "content": "They use gender-neutral pronouns and language. It might be that they're simply using the person's pronouns—but people might also use gender-neutral pronouns if they're trying to conceal someone's gender. If they're not ready to come out, they're likely hoping you don't even notice. [4] X Research source"
    },
    {
      "title": "They joke about being bi.",
      "content": "They joke about being bi. There are a lot of memes going around about fashion trends that are \"bi culture\" and other commonalities people claim mean you're bi. If you have a friend who frequently brings those things up, they might be trying to gauge your reaction to them being bisexual before they actually come out in a serious way. [5] X Research source For example, your friend might joke, \"Oh look, I cuffed my pants again! Guess I must be bi today!\" It's not appropriate to assume that someone is bi based solely on the way they dress or the way they style their hair—but if they bring up the association themselves by joking about it, they might want you to make the association. If you're curious, you can always ask. Keep it light, like you're joking back, and see how they respond. For example, you might say, \"You joke around about looking bi an awful lot. Have you got something you wanna tell me?\""
    },
    {
      "title": "You just have a gut feeling.",
      "content": "You just have a gut feeling. Some people have an intuitive sense for whether someone is LGBTQ+ or not—especially if they've spent a lot of time around LGBTQ+ people. Science hasn't determined how or why \"gaydar\" works, but it often does. If your gaydar is going off and you feel like it's pretty reliable? That person might just be bi. [6] X Research source Keep in mind that this might not mean that the person has taken on a particular label for themselves. Someone who's sexually attracted to different genders might still decide that the bisexual label just doesn't fit them. Gaydar seems to be more accurate for intuiting if someone is attracted to your gender. This might be why, while gaydar definitely seems to be a thing for many people, \"bidar\" probably isn't. It's also worth noting that people who hold anti-gay or homophobic views tend to have the least accurate gaydar—likely because they avoid spending time around gay people and aren't interested in them or open to them. [7] X Research source"
    },
    {
      "title": "You ask them directly and they tell you.",
      "content": "You ask them directly and they tell you. While these signs can give you a little guidance, \"it is always better to ask than to make assumptions,\" advises licensed clinical psychologist Kateri Berasi. \"It is understandable to want to have an idea of the sexuality of important people in your life, as this is an identity status that is 'invisible' and cannot be known simply by looking at someone.\" \"Before talking with someone about their sexuality,\" Berasi cautions, \"ask yourself why you want to know this, and why it matters to you.\" \"If you are inquiring due to a desire to find connection or from a place of empathy or support,\" Berasi continues, \"these are good indicators that your question is more likely to be well received and possibly helpful as opposed to harmful or hurtful.\" If they avoid your question or seem uncomfortable with the topic, just let it go and move on to something else."
    },
    {
      "title": "A bisexual is sexually attracted to people of their own gender and another gender.",
      "content": "A bisexual is sexually attracted to people of their own gender and another gender. They might not necessarily be attracted to people of every possible gender identity. They also might not be attracted to people of different genders in the same way, or to the same degree. The important thing to remember is that bisexuals recognize the potential for attraction to or new relationships with more than one gender. [8] X Research source Some believe that the concept of bisexuality reinforces the gender binary, since the prefix bi means \"two.\" But in the context of bisexuality, the prefix simply means \"not one.\" What gay and heterosexual people have in common is that they are only attracted to one gender. Bisexual people, in contrast, are attracted to more than one. It's important to distinguish bisexuality from pansexuality . Although the reality is that you can choose any identity that resonates with you, pansexuals typically hold that gender doesn't affect their potential attraction to a person at all."
    },
    {
      "title": "Approach the topic with openness and respect.",
      "content": "Approach the topic with openness and respect. It's totally normal to want to understand your partner's sexuality. But at the same time, they have reasons they haven't been open about this before. Their sexuality might be something they're uncomfortable with or still unsure about, so tread with caution. Here are some tips to guide your conversation: [9] X Research source Before you talk to them, reflect on the reasons you believe your partner isn't being completely open with you about their sexuality. Ask your partner directly. For example, you might say, \"Do you consider yourself totally straight? I'm not sure that I do.\" Practice active listening as your partner answers your question. Accept their answer and show them that you emotionally support them and won't judge them. Let them know that you are a safe person for them to talk to if they are questioning or feeling anxious about their sexuality."
    },
    {
      "title": "You think all human bodies are potentially attractive.",
      "content": "You think all human bodies are potentially attractive. Bisexuals are typically interested in both male and female bodies. \"Sexuality exists on a continuum,\" Marriage and family therapist Samantha Fox explains. \"It is as normal to have attraction to the same sex as it is to the opposite sex.\" \"Sexuality is very fluid,\" psychotherapist Kelli Miller agrees. \"So it's not so black and white. Are you 100% straight? Are you 100% homosexual? Sometimes you can be in the gray.\" \"I think sexuality is one of those things that we need to have a little bit more leeway around,\" Miller continues. \"And be okay with [the fact] that there may not be a direct answer\" or the answer may change over time."
    },
    {
      "title": "You've been attracted to a couple in a movie or TV show.",
      "content": "You've been attracted to a couple in a movie or TV show. Being attracted to two people of different genders, or fantasizing about two people of different genders, is a great sign that you might be bisexual. Bisexuals typically describe their sexuality as an attraction to the person—and a fantasy about characters you've been introduced to in a nonsexual setting can show that. [10] X Research source For example, when you watch the movie Mr. And Mrs. Smith , you might find yourself fantasizing about both Brad Pitt's character and Angelina Jolie's character."
    },
    {
      "title": "You've had a crush on people of different genders.",
      "content": "You've had a crush on people of different genders. People who are bisexual tend to fantasize about having sexual experiences with people of different genders. It's not so much about the specific acts (specific anatomy might not even matter)—rather, your attraction is based on the people themselves, the way they identify, and the way they move in the world. [11] X Research source Interested in a friend but not sure if they swing your way? Berasi recommends having \"general discussions with them about sexuality and desire as a starting point.\" \"This way,\" Berasi continues, \"they will become aware that you are interested in same-sex relationships and/or sexual activity, and hopefully you can get a better sense of their own interest.\""
    },
    {
      "title": "You take it personally if you hear someone dissing bisexuals.",
      "content": "You take it personally if you hear someone dissing bisexuals. There are a lot of insulting stereotypes about bisexuals. If you hear one and feel like someone is saying that about you, it might be because deep down, you already consider yourself bi—even if you haven't fully owned the label yet. [12] X Research source For example, if you hear someone saying that bisexuals can't be trusted and they always cheat, you might think to yourself, \"But I've never cheated on anyone in my life! Someone's sexuality has nothing to do with whether they might deceive their partner!\" You might also find that you stand up for LGBTQ+ rights and other LGBTQ+ people. This makes you a better ally—even if you ultimately don't claim the bi identity for yourself."
    },
    {
      "title": "You just dig the label.",
      "content": "You just dig the label. The thing about your sexuality is that it belongs to you. That means you alone get to define it. And if you decide that bisexual is the label for you, who cares if your sexuality isn't exactly the same as other people who also identify as bi? If you like the label, you're perfectly free to use it. [13] X Research source This is true if you've never been in a relationship with some genders or even if you've never been in a sexual relationship before. Your sexuality is all about potential —what could happen, and how you see yourself being happy. It's also totally okay if you're not interested in dating some genders. Distinguish romantic attraction from sexual attraction —it's totally normal to experience one and not the other."
    },
    {
      "title": "You relate to stories from bisexual people.",
      "content": "You relate to stories from bisexual people. It might be that you've heard or read stories from bisexual people and they really resonated with you. You might also follow social media accounts of bisexual people or watch videos made by bisexual content creators and influencers. If you feel as though you relate to these people, it might be because you share the same sexuality. If you want to talk to more LGBTQ+ folks in a welcoming and open environment, Berasi recommends that you \"join a queer club or gay-straight alliance club… in your area and get to know people through this group.\""
    },
    {
      "title": "You enjoy thinking about it.",
      "content": "You enjoy thinking about it. If the thought of being bi resonates with you right now, go for it! Sexuality isn't a static thing—it's totally normal for it to change over the course of your life. Fox recommends \"maintaining curiosity and working from what you actually feel instead of what you feel is accepted in society.\" If it makes you happy to think of yourself as bi, you're free to do so. \"I think it's okay to explore,\" Miller suggests. \"And to see if you're ready to take that next step. And just see how you feel in that situation.\" Miller advises that the only way to really know is to try, \"just [to] see how you feel about the situation.\" Just query yourself, you might think \"it's not really for me, or I might have built this up in my head, but it's not really what I want.\" Experimentation might also come out \"the opposite of like, okay, now I kind of know this is the sexuality that I want to pursue.\""
    },
    {
      "title": "The best way to find out if someone is bisexual is to ask them.",
      "content": "The best way to find out if someone is bisexual is to ask them. People who identify as bisexual typically do so because they're sexually attracted to people of their own gender as well as other genders. The only way to know that for certain about someone is to hear it straight from their own mouth. And if the label feels right to you, you're free to claim bisexuality as your sexual orientation—regardless of your sexual or romantic experiences. Got more questions? Check out these great organizations for more resources: American Institute of Bisexuality Gay and Lesbian Alliance Against Defamation (GLAAD) Parents, Families and friends of Lesbians and Gays (PFLAG) The Trevor Project"
    }
  ]
}