{
  "url": "https://www.wikihow.com/Keep-Cut-Calla-Lilies-Fresh",
  "title": "How to Keep Cut Calla Lilies Fresh",
  "steps": [
    {
      "title": "Give the plant a good watering to ensure they stay hydrated.",
      "content": "Give the plant a good watering to ensure they stay hydrated. If you are cutting calla lilies yourself, give the plant a good watering the night before. This will ensure that they will be hydrated when you cut them. Hydrated flowers will last much longer than ones that are cut when they are dehydrated. [1] X Research source Cut the flowers early in the morning before the day heats up to prevent them from drying early. Use a clean sharp knife to remove flowers at the base of the stem."
    },
    {
      "title": "Unwrap purchased calla lilies as soon as possible to prevent drying.",
      "content": "Unwrap purchased calla lilies as soon as possible to prevent drying. If you have purchased or been gifted callas, unwrap them as soon as possible. Immediately after unwrapping, get them into water quickly. [2] X Research source If you are unable to do this, put them in a cool, dimly-lit place such as a basement until you can attend to them. Make sure that they remain cool so they do not wilt."
    },
    {
      "title": "Be aware that callas bruise easily to avoid damaging them.",
      "content": "Be aware that callas bruise easily to avoid damaging them. Calla lilies are very fragile flowers. The less you can handle them, the better. [3] X Research source Especially avoid handling the flower heads. If these have been supplied with a protective wrapping, carefully remove it."
    },
    {
      "title": "Get a deep vase for tall callas to avoid constricting them.",
      "content": "Get a deep vase for tall callas to avoid constricting them. You’ll need a deep vase for tall callas. Use a very clean vase; some florists clean vases using a combination of dish soap and a little bleach. Rinse very carefully afterwards to remove cleaning product residue. Any remaining product residue can kill your flowers quickly because it is toxic."
    },
    {
      "title": "Compare your stem against the vase to see how long to trim it.",
      "content": "Compare your stem against the vase to see how long to trim it. Measure your calla lilies against your selected vase to determine where best to cut them. Cut them to make sure that they can protrude from the top of the vase while at the same time making sure their stems will remain in the water. Use a sharp clean knife to cut the stem at a 45 degree angle. Cutting the stems at an angle maximizes the amount of cut cell in contact with the vase water, which will help the plant take up more water. Cut them underwater so the cut surface isn’t exposed to the air. Avoid using a dull knife, or a pair of scissors, as these tend to crush as they cut. This cell damage stops the plant from being able to absorb water. Lilies won’t appreciate being crowded in a vase so avoid putting too many into one container."
    },
    {
      "title": "Give your flowers something to eat to ensure their health.",
      "content": "Give your flowers something to eat to ensure their health. Add flower feed to the vase water or, if you have none, a teaspoon of sugar and a drop or two of bleach for every two liters of water. Some people advise using a dash of Sprite or 7-up instead. Regular calla lilies will need a vase filled about 2/3 full of water. Mini callas will want much less than this, as only the lower part of the stem should stand in the water. This prevents the stem from going soggy on a mini calla."
    },
    {
      "title": "Put your calla lilies' vase in a good location to keep them healthy.",
      "content": "Put your calla lilies' vase in a good location to keep them healthy. Callas will do best in a cool room that isn’t too light and is away from direct sunlight or other sources of heat, like radiators. [4] X Research source Avoid putting them near a TV or computer, as these areas can get warm with extended use. Keep them out of drafts. Keep them away from fruit bowls, as ripening fruit emits gases that will encourage the flower to mature, shortening its lifespan in the vase."
    },
    {
      "title": "Keep the water at a good level to keep your flowers hydrated.",
      "content": "Keep the water at a good level to keep your flowers hydrated. Aim to replace the water every day or two and keep it topped up. A steady supply of water is essential to the health of your lilies, and should never be neglected. Mini callas will probably need additional water more often as they should be sitting in less water than regular ones."
    },
    {
      "title": "Be careful when deciding whether or not to store your flowers in the refrigerator.",
      "content": "Be careful when deciding whether or not to store your flowers in the refrigerator. Some people like to keep their vase in the fridge overnight to preserve the life of their flowers – but be warned you need a big fridge for this! It’s a bad idea to expose calla lilies to a gas called ethylene, which is produced by some foods, so only store your lilies in an empty fridge. It’s probably best not to put them in a domestic fridge."
    },
    {
      "title": "Drain and change the water completely to make sure it doesn't get dirty.",
      "content": "Drain and change the water completely to make sure it doesn't get dirty. The water in your vase will need a complete changing every day or two. This is to prevent any bacteria in the water from building up and attacking your lilies. It also stops the water from smelling. Callas will absorb a lot of water, so keep it topped up."
    },
    {
      "title": "Recut the bottom of your lilies to refresh them.",
      "content": "Recut the bottom of your lilies to refresh them. Every second or third day, trim another half inch off the bottom of the stems. This is because the cells at the end of the stem will die. Refreshing the cut helps exposes fresh cells and helps them absorb water. Replace the water in your vase when you do this. Remember to replace the flower feed or whatever additive you were putting into the water."
    },
    {
      "title": "Don't put your lilies out until you need them to preserve their beauty.",
      "content": "Don't put your lilies out until you need them to preserve their beauty. If you are using calla lilies as part of a wedding bouquet, let them sit in a vase in a cool place until 30 minutes before you need them. Remove them from the water 30 minutes before using them to avoid water dripping onto clothing. It may be a good idea to dip the cut ends in melted wax to help seal them. Alternately, try putting a cotton ball at the end of the stem and wrapping it with cloth underneath ribbon. This will help seal the end to stop it brushing against clothing and leaving a stain."
    },
    {
      "title": "Avoid calla lily pollen to avoid staining.",
      "content": "Avoid calla lily pollen to avoid staining. Calla lily pollen will stain clothing. You can remove the ‘spadix’ – that’s the yellow finger-shaped thing inside the flowerhead [5] X Research source – but this ruins the appearance of the flower. The best option to avoid staining is to just be careful when you are handling the flowers."
    },
    {
      "title": "Condition your callas after transport to help them rehydrate.",
      "content": "Condition your callas after transport to help them rehydrate. If your callas are being transported some distance to their final destination, after arrival they need to ‘condition’ in a cool dark room for about 6 hours before you arrange them in a bouquet. [6] X Research source Cut the ends and let them sit in a bucket of lukewarm water in a cool dark place such as a basement This helps them rehydrate after transport to preserve their lifespan and look their best. If any are still looking limp after this time, recut the ends and repeat the conditioning. If any pollen is visible on the flower petal, avoid using the flower. This is a sign the flower head is more mature and won’t last as long as other flower heads that don’t have visible pollen stains. Callas last well in a bouquet so long as they are fully hydrated before they are arranged."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}