{
  "url": "https://www.wikihow.com/Install-a-Basic-Aftermarket-Car-Stereo",
  "title": "How to Install a Basic Aftermarket Car Stereo",
  "steps": [
    {
      "title": "Choose a new stereo.",
      "content": "Choose a new stereo. Browse online or in at a local retailer to find a stereo that fits your needs. Make sure to do research on the brand you choose and confirm the quality of your choice."
    },
    {
      "title": "Purchase additional accessories.",
      "content": "Purchase additional accessories. For a successful installation you will need some additional pieces that may or may not come with your stereo. You should make sure to get a trim plate for the outer face of the stereo. A DIN cage or mounting bracket may be necessary to secure the stereo to your dash. You should also purchase a wiring harness adapter so that you can plug your new stereo into your car’s electrical system. [1] X Research source"
    },
    {
      "title": "Gather all the necessary tools.",
      "content": "Gather all the necessary tools. This list can change from vehicle to vehicle, but the basic tools include: screwdrivers, wire strippers, wire cutters, and electrical tape. You might also need a panel remover tool and factory stereo removal pins depending on your vehicle."
    },
    {
      "title": "Locate a manual on dash panel removal for your car.",
      "content": "Locate a manual on dash panel removal for your car. This can be very helpful in knowing exactly which pieces of dash to remove and how to remove them. If your owner's manual or service manual does not provide the details you need, you might try looking for a Haynes Service Manual for your car. [2] X Research source"
    },
    {
      "title": "Disconnect the ground cable from your battery.",
      "content": "Disconnect the ground cable from your battery. This is the negative, commonly seen as the black terminal of the battery. You never want to work on your cars electronics with this connected as it might result in damage to the electrical system or injury to yourself."
    },
    {
      "title": "Remove any necessary pieces of the dashboard.",
      "content": "Remove any necessary pieces of the dashboard. Using the manual from above, determine which pieces of your dash must be taken off to remove the factory stereo. These pieces may pull right off with a panel remover, or they may be held on with screws, bolts, or clips."
    },
    {
      "title": "Remove the factory stereo.",
      "content": "Remove the factory stereo. Once any necessary pieces of dashboard have been removed you can take out your stereo. Sometimes the stereo is bolted or screwed onto the dash and sometimes you will need to use special tools that are inserted into the face of the factory stereo to release it from the dashboard. This procedure will vary from car to car. [3] X Research source"
    },
    {
      "title": "Unplug the factory wiring harness from the back of the stereo.",
      "content": "Unplug the factory wiring harness from the back of the stereo. If you opted out of buying a wiring harness adapter, you may have to cut the wires instead of just pulling them out. Some vehicle manufacturers may void warranties if wiring is cut. Cut only as a last resort."
    },
    {
      "title": "Connect the new aftermarket wiring harness adapter.",
      "content": "Connect the new aftermarket wiring harness adapter. The aftermarket wiring harness adapter is specifically designed to fit your vehicle's wiring harness. This allows you to simply plug the new harness adapter into the factory radio harness and makes wiring your stereo fairly straightforward."
    },
    {
      "title": "Connect the new radio's plug to the wiring harness adapter.",
      "content": "Connect the new radio's plug to the wiring harness adapter. The new radio will have a plug that must be spliced to the wiring harness. The harness adapter and plug are made to go together easily. This adapter set up will allow you to plug the car's original wiring harness into your stereo. A few quick steps is all that it takes to connect the new stereo plug and wire harness adapter. Match the colors and sizes of wires on the plug to their identical counterparts on the wiring harness adapter. Strip approximately two inches insulation off of all of the wires and twist matching wires together. This provides superior surface area connection to crimping and more flexibility than soldering. [4] X Research source Cover the splice with electrical tape or a twist on wire nut If you have any trouble matching the wires, follow the steps provided with the wiring harness adapter. The wires on the harness adapter and plug are usually color coded or tagged for easy identification and matching."
    },
    {
      "title": "Connect the aftermarket stereo.",
      "content": "Connect the aftermarket stereo. Now that the wiring harness adapter is plugged into the wiring harness and attached to the stereo plug, all you need to do is plug it into the back of your stereo. Now the wiring of your stereo is complete!"
    },
    {
      "title": "Slide the new stereo into the dash.",
      "content": "Slide the new stereo into the dash. This step will differ with each car and may require first sliding in a DIN cage, or simply mounting the aftermarket stereo onto the original mounting brackets."
    },
    {
      "title": "Test the aftermarket stereo.",
      "content": "Test the aftermarket stereo. Make sure no wires have become disconnected or pinched. Reconnect the negative battery terminal and power up your vehicle. Make sure that all features of the radio and all the speakers are working."
    },
    {
      "title": "Troubleshoot the stereo installation.",
      "content": "Troubleshoot the stereo installation. If it doesn't work, you likely have a loose connection or have joined the wires incorrectly. Disconnect the negative battery terminal and troubleshoot. Make sure that the original wiring harness and aftermarket wiring harness adapter are securely attached. Make sure that all of the connections between the aftermarket wiring harness adapter and the aftermarket stereo plug are correct. Double check with the manual that came with the aftermarket stereo or adapter. Ensure that the aftermarket stereo plug is properly and tightly plugged into the back of the aftermarket stereo."
    },
    {
      "title": "Re-assemble the dash.",
      "content": "Re-assemble the dash. Once the new stereo works, secure it into the dash and put everything back together. This is the same way that dash was disassembled, but in reverse."
    },
    {
      "title": "Reconnect the negative battery terminal.",
      "content": "Reconnect the negative battery terminal. If you unplugged the terminal again after testing the battery, you can reconnect it now."
    },
    {
      "title": "Enjoy your new stereo!",
      "content": "Enjoy your new stereo! Your installation is complete and you can show off your new aftermarket stereo."
    }
  ]
}