{
  "url": "https://www.wikihow.com/Lift-and-Carry-a-Baby",
  "title": "How to Lift and Carry a Baby",
  "steps": [
    {
      "title": "Lift from your legs.",
      "content": "Lift from your legs. It is tempting to bend your back to pick up a baby, especially if you are picking the baby up from a lower surface. Bend at your knees to move to a lower level before you lift the baby. Bending at your knees shifts your weight and takes some of the pressure off of your back. Bending at the knees is particularly important if you have recently given birth. Your legs are much stronger than your back. Your feet and knees should be at least shoulder-width apart when you lift. If you have to squat to pick up the baby, stick your buttocks out and keep your back as flat as possible. If you had a C-section birth, you may want to have someone lift the baby and hand it to you until you've fully recovered. [2] X Research source"
    },
    {
      "title": "Support the baby's head.",
      "content": "Support the baby's head. Slide your hand under the baby's head and place your other hand under the baby's bottom. Once you have a good grip, scoop the baby up and bring him or her to your chest. [3] X Research source Always bring the baby close to your chest before you lift. [4] X Research source Head support is critical for newborns because their neck muscles are not developed. [5] X Research source Be careful not to press on the soft spots on the baby's head. [6] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Support the baby the same way if it's swaddled or in a sleep sack. Rely on your palms instead of your wrists to lift. Lifting a baby can put a strain on your wrist. Keep your thumbs close to your hand. Large gaps between your thumb and the rest of your hand will put a strain on the tendons that control your thumb. Babies typically can keep their head up with minimal support around three or four months of age."
    },
    {
      "title": "Use the tripod technique.",
      "content": "Use the tripod technique. This technique is good if you are lifting the baby from the ground. Place one foot next the baby and lower yourself down to one knee. Make sure the baby is close to your knee on the floor. Slide the baby from your knee to your mid-thigh and lift the baby onto your opposite thigh. Put both of your forearms under the baby and bring the baby close to your chest. Keep your back straight and your head facing forward as you do this technique. To protect your back, make sure your buttocks is pushed out as you bend."
    },
    {
      "title": "Use the pivot technique.",
      "content": "Use the pivot technique. Use this technique if you need to turn while you are lifting the baby. Lift the baby as you usually would and hold the baby close to your body. Turn your lead foot 90 degrees in the direction that you want to move. Bring your other foot to where your lead foot is. Move your feet instead of twisting your body. You can hurt your back if you turn your upper body instead of changing the position of your feet. We'll cover avoiding injuries later. Try not to turn too quickly. Pivot at a slow,controlled pace."
    },
    {
      "title": "Cradle the baby to support its hips and back.",
      "content": "Cradle the baby to support its hips and back. Rest the baby's head on your chest and slide your hand from the baby's bottom to support the baby's neck. Move your baby's head to the crook of your arm and then place your other hand on the baby's bottom. Once the baby is cradled in one arm, you can use your other arm to interact and play with the baby. [7] X Research source Support your baby's neck as you get your baby settled into the cradle position. Cradling is ideal for holding a newborn baby."
    },
    {
      "title": "Hold the baby on your shoulder.",
      "content": "Hold the baby on your shoulder. Rest the baby on your chest and shoulder. Place one hand on the baby's bottom and support the baby's head and neck with your other hand. [8] X Research source Keep your back straight and your abdominal muscles tight as you are holding the baby. This position allows the baby to look over your shoulder and hear your heartbeat. Alternate the shoulder that you carry the baby on. This can prevent overuse injuries. Use your entire arm as you hold the baby. Your forearm is comprised of small muscles that may not be used to carrying a baby. Keep your wrist straight and use your elbow and shoulder muscles to carry the baby. If you're going to swaddle the baby, do it before you hold it on your shoulder. Avoid pointing your wrists and fingers towards the floor as you carry your baby. Make sure the baby's head is over your shoulder or turned to the side so it can breathe."
    },
    {
      "title": "Use a baby sling.",
      "content": "Use a baby sling. A baby sling is a fabric, one-shouldered carrier that is a safe option for carrying your baby. Make sure that your baby's face is not covered by your body or the sling when you carry your baby this way. Your baby may have difficulty breathing if his or her face is covered. Bend at your knees if you pick something while holding your baby in the sling. You can alternate the shoulder that your sling is on to help with alignment issues and from tiring one of your shoulders out. Always read the instructions when you use a sling. There is a weight minimum for using the sling."
    },
    {
      "title": "Use a front carrier.",
      "content": "Use a front carrier. Carrying the baby on the front of your body allows you to keep the baby close to your body and evenly distribute the weight of the baby. Cinch the carrier around your waist and shoulders. Make sure the baby is facing you instead of facing outwards. [9] X Research source Facing the baby outwards puts pressure on the baby's spinal curves and hips. This can result on developmental issues for your baby in the future. Facing the baby towards you will also protect your spine. If your baby is facing outwards, more pressure is put on your spine and back."
    },
    {
      "title": "Pick up your baby.",
      "content": "Pick up your baby. You do not have to support the head and neck of older babies when you pick them up. Get close to the baby and squat down to pick the baby up. Reach under the baby's armpit and lift the baby towards you. [10] X Research source Try not to hook your thumbs under the baby's armpits. Keep your fingers together and cup your hands instead. This will help protect your wrists. You can use this same technique to put the baby down as well."
    },
    {
      "title": "Carry your baby in front of you.",
      "content": "Carry your baby in front of you. Hold the baby's back against your chest. Put one hand around the baby's waist and use your other hand to support the baby's bottom. This position allows your baby to look around. [11] X Research source You can use a variation of this position to soothe your baby if he or she is upset. Put your left arm over the baby's left shoulder and hold the baby's right thigh. The baby should have one arm on each side of your arm and his or her head should be near your elbow. Your hands should meet near the baby's crotch area. You can gently bounce in this position as well to soothe your baby."
    },
    {
      "title": "Hold the baby",
      "content": "Hold the baby on your shoulder. Older babies enjoy being held on an adult's shoulders. Hold the baby facing your chest and allow the baby's arms to drape over your shoulders. [12] X Research source You can use one or two hands depending on how heavy the baby is and if you need a free hand. Keep your back straight when you hold the baby up to your shoulder. Arching your back can result in a back strain. Jump to info on avoiding injuries ."
    },
    {
      "title": "Carry the baby on your back.",
      "content": "Carry the baby on your back. If your baby is able to support his or her own head and neck and the hips and legs open naturally, you can begin to carry the baby on your back using a baby carrier. This position allows you to be close to your baby and have a lot of mobility. Center the baby in the carrier and tighten the shoulder straps. The baby should feel snug against your body, but still be able to move. The heavier the baby, the tighter the straps need to be. When you are first learning to use the baby carrier, practice over a bed for safety purposes. It may also be helpful to have another person help you. Always read the weight requirements and instructions before you use the baby carrier. Your baby should be ready for back carrying at about 6 months of age."
    },
    {
      "title": "Lift your baby into a car seat.",
      "content": "Lift your baby into a car seat. If the car seat is in one of the outside seats, put one leg into your car and face the car seat to put the baby in and out of the car seat. This position takes some of the pressure off of your back. If the car seat is in the middle seat, get in the car and face the car seat to lift your baby into the seat. It can be hard to do this if your baby is moving a lot or you are in a rush, but try to be in a good position the majority of the time. The worst thing you can do is keep both of your feet on the ground and twist your entire body to place the baby in the car seat. You can injure your shoulders, knees, back, wrists, and neck."
    },
    {
      "title": "Use a carrier with wide straps.",
      "content": "Use a carrier with wide straps. As your baby becomes heavier, you may begin to feel a strain on your shoulders, neck, and back. Look for carriers with wide, padded straps and a waistband. The waistband helps support the baby's weight and takes the pressure off of your shoulders. [13] X Research source Choose baby carriers that are made from soft fabrics and are easy to clean. Try on different baby carriers before you purchase one. [14] X Research source"
    },
    {
      "title": "Remember the BACK acronym.",
      "content": "Remember the BACK acronym. The proper technique for lifting and carrying a baby can be overwhelming, and it can be easy to forget all of the steps involved. However, there a a few key points that will always apply. The BACK acronym is a quick way to remember the most important things to keep you safe. B is for keeping your back straight. A is for avoiding twisting to lift or carry the baby. C is for keeping the baby close to your body. K is for keeping your movements smooth."
    },
    {
      "title": "Avoid mommy thumb.",
      "content": "Avoid mommy thumb. New mothers and people who lift infants often experience inflammation near the thumb and wrist. This condition is called mommy thumb (i.e. De Quervain's tendinitis). If you have pain or swelling around your thumb, a sticking sensation, or difficulty pinching or grasping something with your thumb, you may have mommy thumb. Apply ice or a cold compress to your wrist to alleviate symptoms. Use your palms instead of relying on your wrist to lift your baby. Cradle the baby with your forearm and fingers and relax your fingers as you hold the baby. See a physician if icing or resting your thumb and wrist does not alleviate the symptoms."
    },
    {
      "title": "Improve your hip and back flexibility.",
      "content": "Improve your hip and back flexibility. Hip and back injuries are common among new parents. Restoring your hip and back flexibility will help you prevent injuries. Stretching and light yoga are good ways to get more flexible. [15] X Research source If you are a new mother, talk to your doctor before you begin exercising again. Make sure that it is safe for you to begin exercising and discuss what type of exercises are safe and realistic for you. Even some light stretching while your baby is taking a nap will be beneficial."
    },
    {
      "title": "Do not carry the baby on your hip.",
      "content": "Do not carry the baby on your hip. Carrying your baby on one hip is convenient and allows you to do other things with your free hand. However, balancing the baby on your hip puts a strain on your back and hips on one side of you body. Hip carrying can result in pelvic pain and alignment (e.g. back, hip, and pelvis) issues. Alternate hips and hold the baby with both arms if you carry the baby on your hip. If you do carry the baby on your hip, try not to stick your hip out. Stand as upright as possible and keep your back straight. Use your bicep to hold the baby instead of your wrist and forearms. [16] X Research source"
    }
  ]
}