{
  "url": "https://www.wikihow.com/Instax-Mini-11-Flashing-Light",
  "title": "How to Fix Blinking Orange Light on Fujifilm Instax Mini 11",
  "steps": [
    {
      "title": "Power on the Instax camera.",
      "content": "Power on the Instax camera. Press the power button on the side of the lens to turn it on. The lens should be fully extended when the camera is on. Flashing lights usually means there's a battery error. You'll need to replace the batteries with new ones. [1] X Research source"
    },
    {
      "title": "Open the battery lid.",
      "content": "Open the battery lid. When looking at the front of the camera, this is the panel on the left side. Press your thumb into the small groove and push it open. [2] X Research source"
    },
    {
      "title": "Remove the old batteries.",
      "content": "Remove the old batteries. Be sure to dispose of the old batteries properly, or recycle them ."
    },
    {
      "title": "Insert new batteries.",
      "content": "Insert new batteries. The Instax Mini 11 camera needs two AA batteries. For best results, use alkaline batteries. These can be purchased online or at your local electronics store. [3] X Research source Make sure the batteries are inserted correctly."
    },
    {
      "title": "Replace the battery lid.",
      "content": "Replace the battery lid. Slide the panel back into place and press gently until you hear a click. The blinking light should turn off."
    },
    {
      "title": "Power on the Instax camera.",
      "content": "Power on the Instax camera. Press the power button on the side of the lens to turn it on. The lens should be fully extended when the camera is on."
    },
    {
      "title": "Check the lens.",
      "content": "Check the lens. If the lens is stuck and not fully extended, there could be something making it stick, such as a spill. In this case, power off your Instax camera."
    },
    {
      "title": "Clean the lens.",
      "content": "Clean the lens. Similar to cleaning other electronics, such as a computer , you'll need to be extra careful handling the components. Try using isopropyl alcohol and a lint-free cloth to remove any stubborn spills."
    },
    {
      "title": "Check the lens again.",
      "content": "Check the lens again. Power on the Instax camera. Gently twist the lens if it needs some help fully extending. When it's fully extended, the blinking light should turn off."
    },
    {
      "title": "Open the back of the Instax camera.",
      "content": "Open the back of the Instax camera. Use the tab on the back to gently pull the cover off. The Instax Mini 11 works similarly to a Polaroid camera . If it's blinking orange, it could mean there's film trapped inside the removal slot."
    },
    {
      "title": "Make sure the film cartridge is aligned properly.",
      "content": "Make sure the film cartridge is aligned properly. If the cartridge isn't aligned, the camera won't be able to print the film. Align the colored tab with the corresponding tab inside of the camera, and then press firmly until it locks in."
    },
    {
      "title": "Replace the back cover.",
      "content": "Replace the back cover. You should hear a click when it's replaced properly. The film jam should be fixed, and the blinking light should turn off. You should be able to take photographs again."
    },
    {
      "title": "Call, fax, or email Fujifilm INSTAX for repairs.",
      "content": "Call, fax, or email Fujifilm INSTAX for repairs. If the above methods didn't work, it may be due to a mechanical error. Fujifilm offers a 1-year warranty from the date of purchase within the United States; you may be eligible for a replacement if the camera can't be fixed. [4] X Research source Phone number : 1-800-800-3854 [5] X Research source Email inquiry form : https://www.fujifilm.com/us/en/consumer/support/instax/contact Fax : 1-732-857-3471"
    }
  ]
}