{
  "url": "https://www.wikihow.com/Know-That-a-Girl-Hates-You",
  "title": "8 Signs She Doesn’t Like You (& Why You’re Unpopular with Women)",
  "steps": [
    {
      "title": "She narrows her eyes or frowns while talking.",
      "content": "She narrows her eyes or frowns while talking. Although this isn't a perfect method, a lot of what people feel is expressed in their face. Faces can show a lot. She might always squint her eyes when angry, or she might purse her lips when she’s upset. There are lots of other different things you can look for. Usually, just having one of these won't mean that the girl hates you, but having more than one can indicate that there is dislike on her part. [1] X Research source Crinkling her nose could be an expression of disgust at your presence (unless, of course, there is a bad smell). Narrowed eyes, or eye rolling when you're around (especially if you're speaking). If she doesn't make eye contact with you that could mean she is shy, but it could also be an indicator of dislike."
    },
    {
      "title": "She has negative or closed-off body language.",
      "content": "She has negative or closed-off body language. Body language is another good indicator, although you have to remember that it is not an exact science. Look at what she is telling you in how she physically reacts to your presence. It can tell you a lot about how she's feelings about you. Arms crossed over the chest is often considered a closed off gesture. There's a possibility if she stands or sits with her arms crossed across her chest when she's around you that she's trying to keep away from you. Of course, some people simply stand that way, so the gesture, taken by itself, might not mean anything. Another good thing to look for is if she's consistently turning away from you. If she's not meeting your eyes and angling her body in a direction away from you, it could be that she wants you to leave her alone and she's seeking some way to escape from you. Keep in mind that there aren't any universal, definitive body language cues that can tell you what a girl is thinking. Some women are proactive, while others are simply more passive or reserved."
    },
    {
      "title": "Her friends ignore you.",
      "content": "Her friends ignore you. Chances are, if she hates you, she'll have told her friends so. They'll be looking to protect her (because they will be on her side). Watching how her friends behave towards, like if they ignore you when you try to talk to them, will give you a pretty good indication of her feelings. [2] X Research source If you both are at a party and you are trying to get across to her, but keep finding her friends running interference and stopping you from talking to her, that's a pretty good sign that she wants nothing to do with you. If you two are somewhere by yourselves and her friends keep popping to drag her away or interrupt, that's another pretty good sign that she might dislike you and her friends are trying to protect her from having to be around you. If you see her smirking and laughing with her friends while looking at you, that's another good sign that there's some dislike on her side. Of course she might not be looking at you, but if it happens consistently, and with the other signs, that's a pretty clear signal of dislike."
    },
    {
      "title": "She ignores you.",
      "content": "She ignores you. Obviously there is more to her behavior than just her body language. Her actions will also help you figure out how she's feeling about you and whether she hates you. [3] X Research source For instance: Every time you try to talk to her, she pulls a Houdini and disappears. This means that the minute you try to speak to her, she's managed to be somewhere else. Now, if this only happens once or twice that doesn't mean anything, but if it happens more than that, it's likely that she doesn't like you, or is upset about something. She never answers when you call or text. This is a big one, because it's pretty easy to shoot back even a quick text in reply. If she never replies to you or if she replies only in one word answers, that's a good sign that something is up."
    },
    {
      "title": "She bails on plans.",
      "content": "She bails on plans. If the two of you have made plans together, even simple things like a coffee shop study session, or other and she always manages to hedge about meeting you for the plans, that's a good sign that she doesn't want to spend time with you. If she blows off plans by not showing up and doesn't say anything, or apologize, again she probably doesn't want to spend time with you. [4] X Research source If she's constantly 'forgetting' plans, then it’s likely that she doesn’t want to spend time with you. Some people are flaky, but not that flaky. Remember, this doesn't necessarily mean that she hates you. You might annoy her by pestering her to do things with you, or she might be completely indifferent to you."
    },
    {
      "title": "Her tone of voice is flat or monotone.",
      "content": "Her tone of voice is flat or monotone. Tone of voice is a huge indicator of someone's feelings. She might say all the right things, but her tone can tell you more about her emotions. Listen to her tone of voice to see how she’s feeling. [5] X Research source Using a flat tone of voice when she talks to you means she's probably not that keen on the conversation (unless of course, she always speaks in monotone). Usually when a girl is with someone she likes, there will be inflections in her voice. Try to tell if she’s being sarcastic . Sarcasm can be a great way for her to tell you that she doesn't like you without actually having to do so. It's all about the inflections in her voice. If she says something like, \"That'd be fun\" if you ask her out to coffee, notice how she says it. Couple this with facial expressions and body language and you should get a pretty good idea how she's actually feeling."
    },
    {
      "title": "She uses negative words often.",
      "content": "She uses negative words often. The words she uses can often tell you how she's feeling, even if she doesn't come right out and say, \"I hate you\" (since few people actually do that). However, if she is saying, \"I hate you\" and she's serious about it, that's another great sign that she does, indeed, hate you. If she's replying to your questions and conversation with 1 word answers, she may not be super into the conversation. If she never initiates conversation and it's always you doing the talking, again she's probably not that interested in talking with you. Although, it doesn't necessarily mean she hates you, it’s unlikely that she likes you."
    },
    {
      "title": "She’s talked negatively about you to other people.",
      "content": "She’s talked negatively about you to other people. Even though she might not have told you directly that she hates you, it's likely that she's told other people, like her friends, or even some of her acquaintances. Ask around to see what she's been saying (if anything) about you. [6] X Research source The best people to ask are her friends. Although it might be difficult to talk to one of them alone, if you have the chance, simply ask the friend if everything is okay between you and the girl and if there's anything you did wrong. If you're polite about it, chances are the friend will tell you."
    },
    {
      "title": "Give her space.",
      "content": "Give her space. If someone hates you, it's a good idea to give them some time and space to cool off. If you're constantly around her, she's probably going to start hating you even more. Giving her space can even remind her why she liked you in the beginning (if she did). [7] X Research source This means don't pester her with invites to go places, or ask her why she's mad at you. Just let it be for a while. There is no perfect amount of time to wait, so use your judgment."
    },
    {
      "title": "Examine your actions.",
      "content": "Examine your actions. People don't just start hating someone without some sort of cause, whether you feel it's legitimate or not. Think about how you've acted towards her and try to determine what might have caused her to feel the way she's feeling to tell if she hates you . [8] X Research source Here are some common reasons why a woman might be upset with you: She feels like you’re using kindness to form a sexual relationship with her. Sometimes, guys will use “being nice” as an excuse to get upset when a woman doesn’t want to be intimate with them. Remember that being nice doesn’t mean a woman owes you anything, even if you have a crush on her. You act like you’re just friends, but you secretly want a relationship with her. Many women can tell when their guy friend is attracted to them. If you’ve said that you just want a platonic relationship but she can tell your feelings run deeper, she might want to distance herself from you. She tried flirting with you, but you shut her down. Maybe she has a crush on you, but you haven’t realized it yet. It’s possible that she tried to shoot her shot, and now she’s feeling rejected."
    },
    {
      "title": "Apologize",
      "content": "Apologize if you were in the wrong. Don't try to tell her to 'lighten up' or 'can't you take a joke?' and especially never ever do the faux apology 'I'm sorry you felt that way.' Instead, offer up a sincere apology, and let her know that you’ll try to do better in the future. [9] X Research source It's best to apologize in private. Having an audience might force one or both of you to act in a certain way that you wouldn't in private."
    },
    {
      "title": "Be courteous",
      "content": "Be courteous toward her. A good way to show her that you're wanting reconciliation and that you're worth reconciling with, is to be courteous to her, even as she's hating you. You'll show that you're a good enough person to take the high road and not get sucked into the potential drama. [10] X Research source When you see her around, say hello and ask how she's doing. Leave it at that. Just enough interaction to show that you care and are interested in her well being and not enough interaction to get on her nerves."
    },
    {
      "title": "End the relationship",
      "content": "End the relationship if she still hasn’t warmed up. At a certain point you can't keep trying to have a relationship (whether in a friend way or a romantic way) with someone who consistently hates. There could be a good reason for her hatred, or no reason at all. The best thing for you to do if you've tried the other steps and failed is to end the relationship. [11] X Research source If you've tried apologizing and giving her space, and being courteous and nothing has worked to get her to change her mind, it’s time to walk away. Even though it’s a bummer to have to cut ties, you did your best to mend things, and that’s amazing. Now, you can focus on building new relationships that better serve your happiness!"
    }
  ]
}