{
  "url": "https://www.wikihow.com/Hockey-Stop",
  "title": "How to Hockey Stop",
  "steps": [
    {
      "title": "Skate a few strides forward.",
      "content": "Skate a few strides forward. Begin along the boards, holding the boards with your hands. Take it slow, at first. You don't want to pick up too much speed until you have gotten a feel for how to hockey stop. You should be looking forward, not down at your feet."
    },
    {
      "title": "Practice pushing from side to side and stopping.",
      "content": "Practice pushing from side to side and stopping. Spread your feet slightly apart, and keep your skates running parallel in the direction you're headed. You may find that you are able to stop your side-to-side motion with just your inside foot."
    },
    {
      "title": "Rotate your hips in the direction you want to turn.",
      "content": "Rotate your hips in the direction you want to turn. Rotate your left hip to turn the left skate, and rotate your right hip to turn the right skate. At the same time, try to angle the skate blades slightly back to shave the ice. Be careful! If you dig in too much, you will \"catch an edge\" and fall forward."
    },
    {
      "title": "Bend your knees deeply.",
      "content": "Bend your knees deeply. As you rotate your hips, be sure to bend your knees. Keep your weight low, and work on balance. Staying low will help you stop with less effort. It might also make the falls more bearable. The deeper the bend, the quicker the stop. If your knees aren't bent, you will almost always fall!"
    },
    {
      "title": "Drag your skates across the ice to stop.",
      "content": "Drag your skates across the ice to stop. First, identify the \"hollow\" or \"flat edge\" on each of your skates. All skates have an inside edge, an outside edge, and a \"flat edge,\" which is really the concave space between the two. The \"flat edge\" allows the skate to slide sideways across the ice without digging in. As you enter the stop, rotate your hips, bend your knees, and turn your skates to allow them to slide on their \"flat edges.\" Hold this position until you stop. [1] X Research source To clarify: reduce your weight off the outside skate, and turn both skates parallel to the direction you are travelling. Apply pressure to the inside edge of the outside skate and simultaneously to the outside edge of the inside skate."
    },
    {
      "title": "Practice to build speed and finesse.",
      "content": "Practice to build speed and finesse. Keep working on your hockey stop. Gradually work up to skating faster and faster, and to stopping at high speeds. If you're playing competitive hockey, you'll often need to stop on a dime to change directions or avoid colliding with something. Once you feel comfortable turning one direction to stop: practice turning the opposite direction, using the same technique."
    },
    {
      "title": "Pick a direction to turn, and perfect it before trying the other direction.",
      "content": "Pick a direction to turn, and perfect it before trying the other direction. Most skaters find it easier to turn in one direction. If turning right, your left skate should be on the outside. If turning left, your right skate should be on the outside."
    },
    {
      "title": "Find someone to hold one end of a hockey stick while you hold the other.",
      "content": "Find someone to hold one end of a hockey stick while you hold the other. Have them pull to your side as you try to resist their motion. When done correctly, they will be able to slowly pull you to your side as you form small amounts of snow at your blades. This will help you become more familiar with proper body angle relative to the ground as well as general balance."
    },
    {
      "title": "Work up to a quick transition.",
      "content": "Work up to a quick transition. One of the keys to stopping at speed is being able to quickly switch from a skating position to having both feet perpendicular to your line of travel. Start by having someone pull you. Then, practice transitioning from a \"gliding\" position to a \"stopping\" position. Once you are comfortable with this transition, work on skating and stopping: from low speeds to higher speeds."
    },
    {
      "title": "Be persistent.",
      "content": "Be persistent. It takes time to train your knees, your hips, and your feet to work in sync – and that means a lot of time down on the ice. Chances are that you will fall a few times until you can get your balance right. Just keep trying and getting back up. With a bit of determination, you should be hockey stopping in no time!"
    },
    {
      "title": "Take a few strides forward to pick up a little speed.",
      "content": "Take a few strides forward to pick up a little speed. Knees should be bent. Start slowly, at first, for safety."
    },
    {
      "title": "Pick a direction to turn that feels the most natural.",
      "content": "Pick a direction to turn that feels the most natural. If you want to turn clockwise, you will be sliding on your left foot. If you want to turn counterclockwise, you will be sliding on your right foot."
    },
    {
      "title": "Turn your body until the sliding foot is in front of you.",
      "content": "Turn your body until the sliding foot is in front of you. Your foot should be perpendicular to the direction you are traveling. This will create friction against the floor. Hold this position until you come to a stop. Straighten the leg and angle the wheels so they slide on the floor. This friction is what will cause you to stop. Keep the other leg bent at the knees as the skate rotates approximately 180 degrees. All your weight should be on this leg."
    }
  ]
}