{
  "url": "https://www.wikihow.com/Help-a-Sick-Person-Feel-Better",
  "title": "How to Help a Sick Person Feel Better",
  "steps": [
    {
      "title": "Make sure they rest in a quiet, comfortable spot with access to fresh air.",
      "content": "Make sure they rest in a quiet, comfortable spot with access to fresh air. The sick person may have a high temperature and can feel chilled in a room that is too cold, or uncomfortable in a room that is too hot. As well, loud noises and a stuffy room can make the sick person feel worse, rather than better. Ensure the person is set up on a bed, couch, or comfy chair that is in a comfortable spot in the house and that a window is open to allow fresh air into the room. You can also make the person feel more comfortable by making sure they have access to warm blankets and lots of pillows, especially if they have a cold or a flu. A sick person may need to get up to 10 hours of rest. Encourage the person to rest when they are tired so that they can recuperate better."
    },
    {
      "title": "Give her/him liquids, like water and herbal tea.",
      "content": "Give her/him liquids, like water and herbal tea. Most ill people suffer from dehydration due to symptoms like diarrhea or fever. Make sure they stay well hydrated by giving them glasses of water and cups of warm, comforting herbal tea. Encourage them to take small sips of the liquid and to try to finish at least three to four cups of water or tea. Though providing beverages is a simple gesture, it can be reassuring to the person, as they may not be able to get water or tea for themselves due to their illness. The average adult needs to drink eight 8 ounce glasses of water or more every day and should urinate at least three to four times a day. Gauge the sick person's hydration level and note if they do not go to the bathroom often during the day. This may be a sign they are dehydrated."
    },
    {
      "title": "Prepare the person's comfort food.",
      "content": "Prepare the person's comfort food. Most people will have a go-to comfort food they crave when they are ill, such as chicken noodle soup. Studies have shown that sick people crave chicken noodle soup because it contains a protein in the form of chicken, a hearty chicken broth full of vitamins, minerals, and some fat, noodles to keep you full, as well as vegetables like carrots, celery, and onion, which contain vitamins and antioxidants. In general, soups make good comfort foods for a sick person as they are warm, filling, and easy to digest. [1] X Research source Avoid giving the person unhealthy foods high in trans fats and empty calories, as this will not support her immune system as she recovers from her illness. Nourishing foods like soup, porridge, oatmeal, and fruit smoothies are all good meal options for a person who is feeling ill and weak."
    },
    {
      "title": "Help the sick person stay clean.",
      "content": "Help the sick person stay clean. Depending on how severe the person's sickness is, she may have a difficult time bathing herself or maintaining a level of cleanliness. It is very important that the sick person is kept clean to avoid more serious illnesses or infections. If the person is very ill, she may have a home nurse who is attending to her bathing needs. You can help make the sick person feel better by assisting with the changing of the bedding every day and helping to person to change positions in bed. If the person is very physically weak, she may have a hard time turning over on her own in bed. You can assist her home nurse or ask someone in the house to help you lift and turn the person at least once a day to prevent the development of bedsores."
    },
    {
      "title": "Play a favorite game or watch a favorite movie or show.",
      "content": "Play a favorite game or watch a favorite movie or show. Another simple way to cheer up a sick person is to distract her from her illness by suggesting you both play a favorite game or watch a favorite movie or show together. Spending quality time with the person doing something easy and fun can make the sick person feel less weak and give her something else to focus on besides her illness. You can also bring their favorite novel for them to read to distract them from their illness and provide some entertainment for them. You can both also do a fun craft or a small project together that involves multiple visits to see the person. This will give the sick person something to look forward to and allow you to spend quality time more often with the person."
    },
    {
      "title": "Express your sympathy and desire to make them feel better.",
      "content": "Express your sympathy and desire to make them feel better. When you first visit the sick person, it's important that you tell them you care for them and are rooting for them to get better. You should also offer to help them in a clear and direct way. Rather than ask, “What can I do?” or “Tell me what I can do to help”, you can offer to help the person with specific things. For example, “I'm going to the grocery store later, I can pick up some chicken noodle soup for you” or “I'll be close to the pharmacy later, can I get your prescription for you?” This will make it easier for the person to accept your help with little effort. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source For instance, you might say something like, \"Is there anything I can do to help? I'm happy to drop by after work, even if it's just to visit for a while.\" You might also offer to help with things like making a meal, vacuuming, shopping, or providing transportation. [3] X Expert Source Ran D. Anbar, MD, FAAP Pediatric Pulmonologist & Medical Counselor Expert Interview. 1 July 2020. However, if they say no, don't offer repeatedly—that will just cause them to feel unheard or disrespected. [4] X Expert Source Ran D. Anbar, MD, FAAP Pediatric Pulmonologist & Medical Counselor Expert Interview. 1 July 2020. When trying to cheer the person up with words, avoid using phrases like “Look on the bright side” or “It could have been much worse”. These phrases, though full of good intention, can make the person feel guilty for being sick or feel they do not have a right to be sick when there are other people less fortunate than them."
    },
    {
      "title": "Be willing to listen.",
      "content": "Be willing to listen. Most sick people tend to feel better when they have someone who is willing to listen to them talk with empathy and understanding. Rather than tell the person that they look fine or that they don't seem all that sick, try to listen to the person and talk about their feelings and emotions about there sickness or illness. Ask the person if they'd like to talk about their illness before you bring it up. If so, listen, but don't try to help them solve their problem. Instead, talk to them in a positive but realistic way. [5] X Expert Source Ran D. Anbar, MD, FAAP Pediatric Pulmonologist & Medical Counselor Expert Interview. 1 July 2020. Don't say that you understand how they feel, since each person's feelings are different. [6] X Expert Source Ran D. Anbar, MD, FAAP Pediatric Pulmonologist & Medical Counselor Expert Interview. 1 July 2020. Avoid forcing an opinion on the person and focus instead on being there as a sympathetic ear. Many sick people find it helpful to know someone is sitting with them at least once a day and listening to them talk. Often, being sick can be a boring and lonely experience. Having someone who is willing to listen can help a sick person feel acknowledged and cared for. Reader Poll: We asked 141 wikiHow readers how they like to cheer someone up, and 55% of them said listening and affirming their feelings without any judgment or criticism. [Take Poll]"
    },
    {
      "title": "Read to her.",
      "content": "Read to her. If the sick person is too weak to talk or sit up, you can comfort her by reading aloud from her favorite novel or story. This will help them remember that they are not alone in the room and that they have someone who cares about them."
    }
  ]
}