{
  "url": "https://www.wikihow.com/Know-If-Your-Friends-Are-Using-You",
  "title": "How to Know If Someone Is Using You: 18 Signs",
  "steps": [
    {
      "title": "They only reach out when they need something.",
      "content": "They only reach out when they need something. If your friend only wants to talk to you or spend time with you when they need a favor (or it’s always about their needs), it's possible you're being used. [1] X Research source Does your \"friend\" ever call or text to hear about your day? Or do they only run to you when in need of something? It could be a ride to work, help with moving, or a place to stay for the night—you're their go-to when they need something. Notice if they ask you for favors regularly. Helping out friends is a part of friendship; sometimes, people get down on their luck and need you. However, if your friend only reaches out when they need something, then it’s possible you are being used. If they keep asking you to buy things for them, they may be using you for money. Also, see if they complain or whine when you refuse to do something they want. Reader Poll: We asked 1779 wikiHow readers, and 53% of them agreed that the biggest red flag that someone might be using you is if you feel like they are friends with you for your money . [Take Poll]"
    },
    {
      "title": "They rarely (or never) return a favor.",
      "content": "They rarely (or never) return a favor. Actions speak louder than words; if your friend is always saying that they will do something nice for you in return but never does, it's possible you're being used. [2] X Research source For example, you may have taken your friend out to dinner a few times because they were upset about something. Your friend then promises to return the favor but never does; they then continue to complain about what first upset them. If this goes on and on, your friend may be using you. Ask yourself whether your friend is grateful. Does your friend value you when you help them out? If so, maybe your friend is not using you but just requires some friendly aid. If your friend doesn't seem to care much when you help, this could be a sign of them taking advantage of you . Clinical psychologist Tala Johartchi states, “If you're feeling like you're constantly being needed, it’s a red flag . Evaluate the dynamic and make sure that there is balance in the friendship, that it's not one-sided, and that you're not giving all of your time consistently, and then feeling like your energy is being sucked up.”"
    },
    {
      "title": "They only want to hang out when it’s convenient for them.",
      "content": "They only want to hang out when it’s convenient for them. If you show interest in getting together, only to have them ghost you, and then they come looking to hang out when they’re free, they’re more concerned with their convenience than yours. They may contact you to hang out when they know you’re working or with family but then expect you to drop everything when they feel like hanging out. [3] X Research source"
    },
    {
      "title": "They're interested in what you can do for them.",
      "content": "They're interested in what you can do for them. If they’re aware that you have connections that could benefit them, they’ll do everything they can to get on your good side. Once they’re no longer interested, they’ll go back to ignoring you most of the time. [4] X Research source For instance, if you work for a company they’re trying to get a job with, they’ll ask to meet you for lunch repeatedly, while showing up to the office to talk themselves up to your superiors."
    },
    {
      "title": "They're not there for you.",
      "content": "They're not there for you. When you’re going through hardship or feeling frustrated about a job, relationship, or personal matter, they’re nowhere to be found. They don’t listen to your problems, check in to see how you’re doing, or ask other friends about your emotional well-being. Unless it’s them needing you to help them through something, they dedicate little to none of their time and energy to helping you. [5] X Research source For example, if your parent gets sick, a true friend might send a supportive text, send flowers, or ask if you want to talk. A fake friend likely won’t reach out at all (even though they’re aware of the situation)."
    },
    {
      "title": "They don't listen to you.",
      "content": "They don't listen to you. They’re more focused on the sound of their own voice instead of hearing what you have to say. When you tell them things about your day or people in your life, they act like they take it in, but really don’t. If you ask them about the things you said later, they probably won’t remember at all. [6] X Research source"
    },
    {
      "title": "They don't respect your boundaries or opinions.",
      "content": "They don't respect your boundaries or opinions. They may set strict boundaries when it comes to you (like keeping a separate circle of friends) but insert themselves into every part of your life, no matter how personal. [7] X Research source For example, you might have told them something personal about your life and asked them to keep it quiet, but they blurt it out in front of a group."
    },
    {
      "title": "They keep score.",
      "content": "They keep score. Even though you may have done a lot for them as a friend, all they can do is remind you about the times they did something nice for you. No matter how infrequent or insignificant it is, they’ll talk about how thoughtful they were or the favor they did for you(that one time). [8] X Research source"
    },
    {
      "title": "They don’t express appreciation.",
      "content": "They don’t express appreciation. Whenever you do favors for them (which is likely to be often), they don’t offer gratitude or say thank you. They act as if you were expected to do these things for them and will probably expect that you’ll do more for them in the future. [9] X Research source If you get them a discount on a piece of clothing where you work, they’ll say something like “Great!” or “I love this shirt,” instead of “Thank you so much for doing this.” You’ll also hear from them the next time they’re interested in a discount."
    },
    {
      "title": "They break their promises.",
      "content": "They break their promises. Have they promised you things that they never delivered on? People who use friends often make empty promises as a way to control them. They may have told you they could get tickets to a concert after getting you to do something for them, but then don’t mention the tickets. If you ask them about it, they’ll either say it wasn’t a sure thing or may even pretend they never said it. After a while, you’ll feel like nothing that comes out of their mouth is truthful. [10] X Research source"
    },
    {
      "title": "They act superior to you.",
      "content": "They act superior to you. No matter what subject you’re discussing, they act like they know more than you do and talk down to you often. They don’t show you support as a friend and automatically assume you’re going to make mistakes. [11] X Research source For example, if you went to a school that they think isn’t as impressive as the one they attended, they’ll make negative comments about your school to drive home the point."
    },
    {
      "title": "They’re not trustworthy.",
      "content": "They’re not trustworthy. A real friend won’t betray your secrets, especially in a way that could hurt you. To decide whether your friend can be trusted, think about whether they’ve leaked private information about you, especially for personal gain. If so, it’s possible that you are being used. [12] X Research source Look at their relationship with other friends. Does your friend betray the trust of their other friends or use them? If so, this is a sign that your friend may be using you as well."
    },
    {
      "title": "They exclude you.",
      "content": "They exclude you. Does your friend often leave you out of their plans? A friend is someone who you expect to be both inclusive and inviting, especially in connection with a group of friends who you both already know. [13] X Research source Keep in mind that friends don’t need to invite each other to every social event they attend, but if your friend never invites you to anything and only reaches out when they need something, they may be using you. If your friend mentions having plans with a group of friends that you also know but you haven’t been invited, try asking if you can come too. Pay attention to their response—if there are no real logistical reasons why you can’t attend and your friend still doesn’t invite you or makes up some flaky excuse for why you can’t attend, it’s possible you are being used, and this friend is not genuine. An example of a legitimate logistical concern would be if your friends were going camping, but there was no more space in the car for you."
    },
    {
      "title": "They make you feel bad about yourself.",
      "content": "They make you feel bad about yourself. No matter what their specific behaviors include, they end up causing you to feel down about who you are or some aspect of your life. Whether they condescend to you, aren’t there when you need them, or make promises they won’t keep, their actions constantly disappoint you enough so you feel dejected or depressed about yourself. [14] X Research source Remember that only you can recognize the signs of a friend who is using you; it’s only your fault if you continue to let it happen. Take the time to truly think about what kind of a friend they are, and how they treat you."
    },
    {
      "title": "The relationship feels one-sided.",
      "content": "The relationship feels one-sided. They don’t make an effort to truly get to know you as a friend because it’s always about them. They’re more focused on what they need and want from you instead of the opposite. [15] X Research source"
    },
    {
      "title": "They guilt trip you.",
      "content": "They guilt trip you. If your friend often tries to manipulate you with tactics such as trying to guilt you into things that you don’t want to do, it's possible you're being used. [16] X Research source Ask yourself whether you would have helped your friend if they did not try to make you feel guilty or feel bad about the situation. If the answer is yes, then maybe you aren’t being used but are being helpful instead. [17] X Research source"
    },
    {
      "title": "They try to control you.",
      "content": "They try to control you. If your friend is always trying to boss you around and tell you what to do, particularly if it benefits them or their friends, they may be using you. [18] X Research source To figure out if your friend is controlling, consider if they use anger, guilt, or sadness to get you to do their bidding, or otherwise emotionally manipulate you. [19] X Research source Your friend may also try to isolate you so that you have less outside social support and are more likely to give in and do as they demand. They may try to accomplish this by criticizing your other friends and family to get you to spend less time with them. [20] X Research source Do they disrespect you? If they always talk poorly about the people you care about, walk all over you, take advantage of you, act immaturely, or revert to their original behavior after apologizing, it may be time to let them go."
    },
    {
      "title": "They boast about how good they are at manipulating people.",
      "content": "They boast about how good they are at manipulating people. Instead of being proud of their accomplishments, they are more interested in talking about what they got out of others. They’ll brag about how they got one friend to get them theater tickets and another to pass along their resume to the boss, but never about what great friends those people are. When you hear a friend boasting about how they talked others into getting them things or doing favors for them, remember that they’re probably also telling others about what you do for them. [21] X Research source"
    },
    {
      "title": "Make time to talk to your friend.",
      "content": "Make time to talk to your friend. Pick a quiet place where you two can have a discussion. Don’t bring other friends into the mix, even if they have the same complaint. Having other friends there could be overwhelming and end up scaring your friend off or making them especially upset. If one person criticizes someone for something, they may be willing to take the advice and change. If several people criticize them at the same time, they may feel threatened and get offended—no one likes to be ganged up on. [22] X Research source"
    },
    {
      "title": "Confront your friend about their actions.",
      "content": "Confront your friend about their actions. Bring up the issue directly, and let them know how their behavior has affected you. Express how they’ve let you down as a friend or made the relationship feel one-sided. [23] X Research source"
    },
    {
      "title": "Speak calmly but assertively.",
      "content": "Speak calmly but assertively. Explain your reasons for suspecting that your friend is using you and see what they say. Lay out specific details so that your friend can’t just shrug it off or call you a liar. [24] X Research source Focus on your friend's actions and not their character. If you make it about specific actions, your friend will be less likely to get upset; if you call your friend a user, they may get defensive, which can lead to the conversation ending badly. Provide examples of things that have happened. For example, you could say something like, \"I gave you rides to work last month after your car was in the shop. My car broke down this week, and when I asked you for the same favor, you ignored me. I feel like you’re using me for stuff like this all the time.”"
    },
    {
      "title": "Ask for a sincere apology from your friend.",
      "content": "Ask for a sincere apology from your friend. If your friend apologizes and is willing to change their ways, and you notice that they’re changing for the better, there’s a chance your friend is just unaware of how selfish their actions were. Sometimes, people get caught up in their own lives and don’t pay attention to how their actions affect others. [25] X Research source If you’re not sure that your friend is using you, ask other people for their opinion, but be aware that people’s opinions are their own and may not always be true."
    },
    {
      "title": "End your friendship if you feel you’re being used.",
      "content": "End your friendship if you feel you’re being used. You can either tell them directly that you don’t want to be friends anymore, or simply stop making plans or answering their calls and texts. You deserve friends who have your best interests at heart, not those who only use you for personal gain. Licensed Clinical Psychologist Ashlyne Mullen advises reflecting on the relationship to help you process it. Recognize how they've used you and write out how you feel. Connect with friends and loved ones, confide in them, and talk through the situation. If needed, reach out to a professional to get additional support."
    },
    {
      "title": "Learn to say “no.”",
      "content": "Learn to say “no.” It can be very difficult to stand up for yourself, especially when others push you to do what they want. Show yourself respect by not being afraid to say “no,” even if you think it’ll have negative effects on the friendship or hurt someone’s feelings. Start with small things so you can build up your confidence. [26] X Research source There are alternatives you can use when a simple “no” feels difficult. For example, you can say, “Give me some time to think it over,” or “I’d like to figure out what’s best, so I’ll get back to you.”"
    },
    {
      "title": "Set boundaries and stick to them.",
      "content": "Set boundaries and stick to them. Every relationship in life requires certain boundaries, and it’s important to figure out what they are at the beginning of a friendship. Consider what values are the most important to you, what behavior and situations you want to avoid, and the kind of friendships you want. Write them down if you need to, and revisit the list any time you feel that a friend might be pushing you past them. [27] X Research source Examples include, “It’s always been hard for me to express myself. When you talk over me, it makes me feel like I don’t matter.” You can also say, “I need you to understand that my privacy is very important to me, and sometimes you don’t respect it.” Or, “You know I’ve had issues in the past with others taking advantage of me financially, so please stop always asking me to lend you money.”"
    },
    {
      "title": "Watch out for manipulative behavior.",
      "content": "Watch out for manipulative behavior. Try to stay conscious of other people’s behavior and notice how they treat other friends and loved ones. If you feel they behave badly with others in their life, you can probably assume that they’re not going to treat you any better. [28] X Research source Do your best to know if someone is your friend by using your intuition, and address any issues directly and as early on as possible."
    },
    {
      "title": "Trust your instincts.",
      "content": "Trust your instincts. When you meet new people, do they make you feel good about yourself? If you associate your experiences with them as positive, their friendship could be good for both of you; if you immediately feel negative, listen to your instincts and avoid getting closer to them. [29] X Research source By focusing on your own self-worth, you’re less likely to get caught up in pleasing others."
    },
    {
      "title": "You may experience anxiety and depression.",
      "content": "You may experience anxiety and depression. Being taken advantage of can make you feel dejected. It can seriously affect your level of happiness and well-being when you’re made to feel powerless in the relationship. Feeling disinterested or unexcited about anything in your life can be a sign of depression. [30] X Research source A good friend who doesn’t use you can only bring positive vibes into your life and is worth looking for."
    },
    {
      "title": "You might feel traumatized.",
      "content": "You might feel traumatized. You may end up feeling like everyone in your life is out to take advantage of you. It’s possible that a one-sided friendship where the other person gets what they want but isn’t there for you can end up making you feel victimized. [31] X Research source When you feel like a victim after a friendship where you felt taken advantage of, Marriage and Family Therapist Moshe Ratson explains, “The idea is not to take it personally. Understand that you're going to be sad for some time. You can try to overcome that feeling by filling your life with other activities or whatever makes you feel better.”"
    },
    {
      "title": "You could lose your ability to trust in other relationships.",
      "content": "You could lose your ability to trust in other relationships. Even if you break away from a friend who is using you, you may still feel the effects of their behavior in future relationships. It can be very difficult to trust others due to a fear that they’ll take advantage of you. [32] X Research source Take time for self-care after ending a toxic friendship so you feel ready to meet new people in your life again. Talk to those you trust, see a therapist, or join a support group so you feel heard."
    },
    {
      "title": "They’re motivated by selfishness and greed.",
      "content": "They’re motivated by selfishness and greed. The most common reason people use others is for personal gain. They can be looking to take advantage of people for money, status, sex, or favors. They need someone who will be there for them anytime they need something but are rarely prepared to return the favor. [33] X Research source"
    },
    {
      "title": "They see friendship as a means to control and manipulate.",
      "content": "They see friendship as a means to control and manipulate. Users in a friendship often need to have a feeling of control over others. Their idea of being a friend includes manipulating others so they end up on top. This can result in feelings of victimization for those in their circle of friends whom they end up hurting with their controlling actions. https://ideapod.com/why-do-people-use-others This behavior is sometimes caused by a feeling of insecurity on their part, which becomes toxic for those who are their friends."
    },
    {
      "title": "They lack empathy.",
      "content": "They lack empathy. Friends who use other friends tend to have a built-in or learned absence of empathy, compassion, and kindness for others. They can be overly self-focused, which blinds them to the needs of their friends. By not recognizing how other friends are feeling, they can’t offer any real support to them. [34] X Research source"
    },
    {
      "title": "They view friendships as a means to get things they want.",
      "content": "They view friendships as a means to get things they want. Oftentimes, friends with a tendency to use others believe that relationships are transactional; they only exist as a way for them to get what they need from someone else. Possible reasons for this behavior include their experiences growing up or relationships they had early on in life. [35] X Research source"
    }
  ]
}