{
  "url": "https://www.wikihow.com/Make-a-Harp",
  "title": "How to Make a Harp",
  "steps": [
    {
      "title": "Choose a style.",
      "content": "Choose a style. If you want to build your own harp, consider starting with a Celtic, or Lever harp. While there are many types of harp to choose from, the Lever harp is one of the more common types of harps, and may be easier to build for a beginner. [1] X Research source The Paraguayan harp, while less common, is gaining popularity. Paraguayan harps are much lighter than other harps, and are easier on the fingers due to a lighter string tension."
    },
    {
      "title": "Find a design for your harp.",
      "content": "Find a design for your harp. Look around at various harps and study them. Find qualities in each harp that you like, and those that you don't. If you're designing the harp for yourself, consider trying to copy the design of a harp you like. [2] X Research source You can find a variety of harp plans online, even some for free. Some designs are simple, while others can be complex and quite expensive. [3] X Research source If you feel confident in your abilities, you could try designing the harp completely from scratch. [4] X Research source If you copy someone's design, do not try to sell it. The original designer may file a lawsuit against you for plagiarism. [5] X Research source"
    },
    {
      "title": "Decide what kind of wood you want to use.",
      "content": "Decide what kind of wood you want to use. The type of wood you use in constructing your harp will have an effect on the sound quality and string tension. You can build harps out of several different types of wood, such as maple, oak, cherry, or spruce. [6] X Research source Harder woods will allow you to build a harp with more string tension. You can use softer woods, but it may affect the lifespan of the instrument. [7] X Research source"
    },
    {
      "title": "Buy your materials.",
      "content": "Buy your materials. Building a harp can get expensive, especially if you don't have access to the various tools required to work the wood. Other factors, such as what type of wood you decide to use, will also affect the final cost of your harp. [8] X Research source If you are building a harp for the first time, consider building a simple harp. Use inexpensive materials and focus on getting the technique right. You can even try to salvage the necessary lumber. [9] X Research source Building a harp also requires a serious investment in time. Expect to spend at least 28 hours on a simple design. It is possible to spend upwards of 100 hours or more on a complex harp build. [10] X Research source"
    },
    {
      "title": "Make the sound box.",
      "content": "Make the sound box. Sound boxes, or shells, typically come in three styles: square back, round back, and stave back. [11] X Research source The size of the shell depends on a few other dimensions on your harp. Consider the length and width of your soundboard, as well as the angles of the top and bottom of the harp relative to the shell. [12] X Research source Square shells are easier to build than round or stave shells. A simple square shell consists of four boards screwed together with a plywood back. [13] X Research source Stave shells consist of several planks attached to each other and then placed in a cradle to add a curve. Building a stave shell requires a lot of precision, as well as the construction of a cradle to curve the staves. [14] X Research source A round shell requires more time and skill than both the square and stave shells, as well as some specialized equipment. [15] X Research source If you purchased a harp plan, refer to your blueprints for shell construction."
    },
    {
      "title": "Build a soundboard.",
      "content": "Build a soundboard. The material you use for your soundboard will contribute to the sound quality of your harp. You can build your soundboard out of redwood, pine, or birch plywood. [16] X Research source Soundboards are constructed from several smaller pieces of wood glued and clamped together. Refer to your harp plans to determine how big your soundboard will be. Find several pieces of wood at least 1 ⁄ 4 inch (0.6 cm) thick. The size of your soundboard will determine how many pieces of wood you need. [17] X Research source Lay the pieces of wood out edge to edge, taking care to keep the grain horizontal on each piece. Glue the pieces together and clamp them for extra security. [18] X Research source Once the glue has dried, you can cut out the shape of your soundboard as required by your harp plans. Taper the soundboard so that it is 1 ⁄ 8 inch (0.3 cm) thick at the top, or treble, end. The bottom, or bass, end of the soundboard should be around 1 ⁄ 4 inch (0.6 cm) thick. If you use plywood, make sure the grain of the wood runs across the width of the soundboard. This will prevent any premature cracking. [19] X Research source"
    },
    {
      "title": "Attach the string ribs.",
      "content": "Attach the string ribs. The string ribs lay across the width of the soundboard. String ribs add support to the harp and prevent potential cracking. [20] X Research source String ribs come in various sizes and depend heavily on the dimensions of the soundboard, as well as the preference of the harp maker. Consult your harp plans to determine the shape and style of your string ribs. [21] X Research source You do not have to include string ribs in your harp. However, if you choose to omit them you will need to reinforce your harp. The tension from the strings may cause the wood to crack. [22] X Research source"
    },
    {
      "title": "Attach the soundboard.",
      "content": "Attach the soundboard. Using epoxy or a glue of your choice, align the soundboard on top of the shell. Have clamps ready to hold the pieces together while the glue dries. [23] X Research source Depending on the shape of your shell, glue may not be enough to securely fasten the soundboard. If you are using a round or stave shell, consider using staples or screws as well as glue. [24] X Research source If you use staples or screws, take care not to use too much force or you may damage the shell. [25] X Research source"
    },
    {
      "title": "Build the neck and pillar.",
      "content": "Build the neck and pillar. Follow your harp plans and trace the design of the neck and pillar on your chosen wood. Cut the neck and pillar to shape, and then sand any rough edges out. [26] X Research source Do not smooth the joining surfaces, surfaces where pieces connect, until it is time to combine the parts. [27] X Research source Drill holes in the neck for tuning pins. Use a 3 ⁄ 16 inch (0.5 cm) bit and work carefully. Don't try to drill all the way through in one plunge. Rather, make 3-5 plunges, each time moving a little deeper into the neck. Clear out any excess chips from the hole before starting the next plunge. [28] X Research source"
    },
    {
      "title": "Attach the neck to the pillar.",
      "content": "Attach the neck to the pillar. While there are many ways to attach the neck and pillar, one of the easier methods is to use dowels. Dowels are pegs that fit into holes drilled into both the neck and pillar. [29] X Research source To use dowels, drill three holes into the neck and pillar, taking care to remove any chips from the holes. Clearing the chips will keep your holes straight. [30] X Research source Make sure the holes in the pillar line up with the holes in the neck. Cut three dowels long enough to fit into both pieces. Make grooves in the dowels to keep glue from escaping the holes. [31] X Research source Test fit the neck and pillar before adding any glue. The dowels should be snug and you shouldn't see any gaps between the neck and pillar. If everything fits, add glue to the dowels and join the pieces. Use clamps to keep everything tight while the glue dries. [32] X Research source"
    },
    {
      "title": "Attach the sound box.",
      "content": "Attach the sound box. Use dowels to attach the neck and pillar to the sound box. Do not use glue to fix the neck and pillar to the sound box. The dowels are there to keep the parts aligned. The angle of the sound box relative to the neck and pillar will hold the pieces together. [33] X Research source Keep a gap about 1 ⁄ 8 inch (0.3 cm) thick on the side near the strings. Once you add the strings, the tension will cause this gap to close. Without this gap, you run the risk of cracking the wood. [34] X Research source Once you've attached the sound box, you can drill string holes in the sound board. Refer to your harp plans to determine the number of holes you need to drill. [35] X Research source"
    },
    {
      "title": "Mount the strings.",
      "content": "Mount the strings. You will need eyelets, bridge pins, and tuning pins to mount your strings. You can buy these online, or your local music shop may carry them. [36] X Research source Fit the eyelets into the holes in the soundboard. Coat the sides of the holes with glue, and push the eyelet into the hole. [37] X Research source Fit the bridge pins and tuning pins into their respective holes. You may need to adjust the holes in the neck to properly fit the bridge pins. Do not glue these pins into the wood. [38] X Research source Start at the bass end of the harp. Feed the string through the eyelet in the sound board and pull it up to the corresponding tuning pin. Wrap the string around the tuning pin a few times to set it. Don't worry about pulling it tight just yet. Mount all the strings before tightening them to the proper tension. [39] X Research source It may take several tunings before the strings hold the proper tension. [40] X Research source"
    }
  ]
}