{
  "url": "https://www.wikihow.com/Make-Money-Selling-Sweets",
  "title": "How to Make Money Selling Sweets",
  "steps": [
    {
      "title": "Decide how much money you would like to invest.",
      "content": "Decide how much money you would like to invest . After you have done this look at different options on sweets. Let's say you have 5 dollars and want to make 10 dollars, what do you do? You could buy fifty 10-cent sweets and sell them for twenty cents, or one hundred 5-cent candies and sell them for 10 cents, etc. It is your choice. If you don't think that you can sell a high volume, go for sweets with greater profit and sell fewer."
    },
    {
      "title": "Sell merchandise.",
      "content": "Sell merchandise. Selling merchandise to people can be the hardest part. Depending on the person, they might want more sweets than someone else. Choose wisely and try not to sell to someone who will scam you. Once you have established with some people that you are selling sweets, they might come back asking for some more."
    },
    {
      "title": "Ask how much money people are willing to spend if they offer to buy, and try to sell for more.",
      "content": "Ask how much money people are willing to spend if they offer to buy, and try to sell for more. Lower a bit if they aren't willing to spend as much, but try to stay in control of your prices."
    },
    {
      "title": "Buy more expensive sweets to sell at higher prices when your budget increases.",
      "content": "Buy more expensive sweets to sell at higher prices when your budget increases. This will increase your profits. [1] X Research source"
    },
    {
      "title": "Try to get a fan base not only in your year-group, but also lower ones.",
      "content": "Try to get a fan base not only in your year-group, but also lower ones. e.g if you're in year 10, sell to years 7,8, and 9, and 11."
    },
    {
      "title": "Try to record what you have sold, what profit you have made and so on.",
      "content": "Try to record what you have sold, what profit you have made and so on. It helps."
    },
    {
      "title": "Sell things that you think people will want on that day (e.g if it is a boiling hot day then lemonade or water sell really well).",
      "content": "Sell things that you think people will want on that day (e.g if it is a boiling hot day then lemonade or water sell really well)."
    },
    {
      "title": "Sell separate pieces of gum from a packet",
      "content": "Sell separate pieces of gum from a packet . These are easy to sell, and can produce a lot of money (especially if gum is banned in school) . If you can get away with selling gum for 10 cents apiece, and a pack of gum with 5 pieces costs 17 cents, you will make 50 cents, or a net profit of 33 cents easily."
    },
    {
      "title": "Sell things you will make the most profit on (e.g if you buy a pack of 4 chocolates for $1 in a shop, then sell them for 50 cents each and you will make 100% profit).",
      "content": "Sell things you will make the most profit on (e.g if you buy a pack of 4 chocolates for $1 in a shop, then sell them for 50 cents each and you will make 100% profit)."
    },
    {
      "title": "Get supplies/stock to sell at school.",
      "content": "Get supplies/stock to sell at school. Go to shops like the 99c stores. They usually have good deals on sweets and they also sell big packs of sweets for low prices."
    },
    {
      "title": "Advertise.",
      "content": "Advertise. Tell everyone by word and mouth about your 'business', If you make a facebook page and it all goes downhill, you'll look like an idiot! Spread the word to all your mates and tell them to tell all their mates too! [2] X Research source"
    },
    {
      "title": "Know your friends and enemies.",
      "content": "Know your friends and enemies. Try not to fall out with friends who know about your 'business', rumours could break out and your business will fold like a mum doing the ironing! Keep the sweets hidden, not somewhere obvious that people (who don't particularly like you) can find and steal for their personal gain."
    },
    {
      "title": "Be friendly to customers.",
      "content": "Be friendly to customers. Just like at restaurants, you don't see staff being rude, do you? Treat them right otherwise you could get a bad name for yourself and it won't work out! [3] X Research source"
    }
  ]
}