{
  "url": "https://www.wikihow.com/Indent-in-Excel",
  "title": "4 Easy Ways to Indent Text in Microsoft Excel",
  "steps": [
    {
      "title": "Open a project in Microsoft Excel.",
      "content": "Open a project in Microsoft Excel. If needed, you can begin a new Spreadsheet . Microsoft Excel is available on Windows and Mac. You can also use the online web version at the Microsoft 365 website ."
    },
    {
      "title": "Select the cell or cells.",
      "content": "Select the cell or cells. The cells must contain the content you wish to indent. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Home in the top toolbar.",
      "content": "Click Home in the top toolbar. This will open a new section of your toolbar."
    },
    {
      "title": "Click the \"Increase Indent\" icon.",
      "content": "Click the \"Increase Indent\" icon. This looks like lines of text with a blue right-facing arrow. The text in the selected cells will be indented to the right. You can continue clicking Increase Indent to indent the cells to your preference. To remove an indent space, click the Decrease Indent icon. This looks like lines of text with a blue left-facing arrow. You can continue clicking Decrease Indent to position the cells to your preference."
    },
    {
      "title": "Open a project in Microsoft Excel.",
      "content": "Open a project in Microsoft Excel. You can use Excel to make tables , type formulas , make graphs , and more."
    },
    {
      "title": "Select the cell or cells.",
      "content": "Select the cell or cells. The cells must contain the content you wish to indent."
    },
    {
      "title": "Right-click the cells and click Format Cells….",
      "content": "Right-click the cells and click Format Cells… . This will be underneath Clear Contents . You can also use the keyboard shortcut CTRL + 1 (Windows) or CMD + 1 (Mac). A pop-up window will open."
    },
    {
      "title": "Adjust the Indent settings.",
      "content": "Adjust the Indent settings. By default, the Indent will be 0. Click the up arrow next to the box to adjust your Indent to 1 or higher. You can also manually type the number into the Indent field."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This will be at the bottom-right corner of the window. Your cells will be indented."
    },
    {
      "title": "Open a project in Microsoft Excel.",
      "content": "Open a project in Microsoft Excel. You can also create a new project. Use this method if your text extends beyond the right side of the cell."
    },
    {
      "title": "Select the cell you want to indent.",
      "content": "Select the cell you want to indent. You can select one or multiple cells."
    },
    {
      "title": "Click Home in the top toolbar.",
      "content": "Click Home in the top toolbar. This will open a new section of your toolbar."
    },
    {
      "title": "Click the \"Wrap Text\" icon.",
      "content": "Click the \"Wrap Text\" icon. This looks like a blue left-right arrow in the Alignment section. The text will shift into multiple lines within the selected cell."
    },
    {
      "title": "Open a project in Microsoft Excel.",
      "content": "Open a project in Microsoft Excel. You can use a new or existing project."
    },
    {
      "title": "Select the cell you want to indent.",
      "content": "Select the cell you want to indent. In most cases, this is a cell with text that extends into another cell."
    },
    {
      "title": "Click Home in the top toolbar.",
      "content": "Click Home in the top toolbar. This will open a new section of your toolbar."
    },
    {
      "title": "Click the \"Wrap Text\" icon.",
      "content": "Click the \"Wrap Text\" icon. This looks like a blue left-right arrow in the Alignment section. The text will shift into two lines within the selected cell."
    },
    {
      "title": "Click the space before the second line of text.",
      "content": "Click the space before the second line of text."
    },
    {
      "title": "Press Alt+↵ Enter on Windows or ⌥ Option+⏎ Return on Mac.",
      "content": "Press Alt + ↵ Enter on Windows or ⌥ Option + ⏎ Return on Mac. This will separate the two lines of text."
    },
    {
      "title": "Press the spacebar to input a manual indent.",
      "content": "Press the spacebar to input a manual indent. You can add as many spaces as you'd like. To delete additional spaces, use the backspace or delete key. Your cell is now indented."
    }
  ]
}