{
  "url": "https://www.wikihow.com/Make-Rosemary-Hair-Oil",
  "title": "5 Ways to Make Homemade Rosemary Oil for Hair",
  "steps": [
    {
      "title": "Heat 1 cup (about 225 grams) of carrier on low in a small saucepan.",
      "content": "Heat 1 cup (about 225 grams) of carrier on low in a small saucepan. You can use any carrier oil that's safe for hair—olive, almond, argan, castor, grapeseed, avocado, and coconut oil are all popular. Place the oil in a small pan and place it over low heat for about 5 minutes to gently warm the oil. [1] X Research source If you’re using coconut oil, make sure it melts completely. If you’re using a thick oil like castor, coconut, or almond, consider mixing it with an equal amount of a lighter-weight oil like jojoba or argan so it doesn't weigh your hair down. Some people prefer to use a double boiler so the oil doesn’t burn—place a shallow bowl on top of a small saucepan filled with water, then add the oil and rosemary to the bowl."
    },
    {
      "title": "Add 6–8 springs of fresh rosemary to the oil.",
      "content": "Add 6–8 springs of fresh rosemary to the oil. Stir the rosemary to coat it in the oil and let it sit on low heat for about 20 minutes or until you see a few small bubbles forming. Make sure the rosemary is completely submerged in the oil. If you need to, trim the springs down some so they’ll fit. [2] X Research source Some people prefer to leave the rosemary sprigs whole because they’re easier to remove from the oil. But if you want, you can remove the rosemary leaves from the stem and them lightly to release more of their aroma. If you’d prefer to use dried rosemary, add about 3 tbsp (9 g) to the pot."
    },
    {
      "title": "Strain out the rosemary after the oil is completely cooled.",
      "content": "Strain out the rosemary after the oil is completely cooled. Pour the rosemary oil from the pan into a small bowl, straining it through a fine mesh strainer , coffee filter, or cheesecloth . You may need to squeeze the cheesecloth or press the mixture through the strainer with the back of a spoon to extract all of the oil. Repeat as needed until you don’t see any bits of rosemary left in the oil. [3] X Research source If you used coconut oil, strain the rosemary while the mixture is still warm enough to be liquid, but not hot enough that you’ll burn yourself. If you used whole rosemary sprigs, remove them with tongs, then strain the oil to remove any pieces that are left behind. You can allow the leaves to steep in the oil for up to 2 hours, or you can strain the oil as soon as it’s cooled."
    },
    {
      "title": "Transfer the mixture into a sterilized glass jar or container.",
      "content": "Transfer the mixture into a sterilized glass jar or container. Use a glass bottle meant for essential oils or pour the mixture into a mason jar. Seal the container tightly, then keep it in a cool, dark place. [4] X Research source If you store it properly, this mixture will last about 10 days. If you used coconut oil, the mixture will solidify at room temperature. To use it, scoop out about 1 tsp (4.5 g) and heat it for 10–15 seconds in the microwave. Test it with your finger to make sure it’s not too hot before you apply it to your scalp."
    },
    {
      "title": "Fill a mason jar about halfway with dried rosemary.",
      "content": "Fill a mason jar about halfway with dried rosemary. Remove the rosemary leaves from the stem so you can fit more in the jar. You’ll probably need about 1 oz (28 g) of rosemary, but the measurements don’t have to be exact. [5] X Research source"
    },
    {
      "title": "Add enough carrier oil to cover the rosemary, plus 1 in (2.5 cm).",
      "content": "Add enough carrier oil to cover the rosemary, plus 1 in (2.5 cm). Because you’re not heating the oil, use a carrier oil that’s in a liquid state at room temperature, like olive, castor, jojoba, argan, or grapeseed. Pour the oil into the jar until the rosemary is completely covered, then add about another 1 in (2.5 cm) above that. [6] X Research source You’ll need about 2 parts oil to every 1 part rosemary."
    },
    {
      "title": "Place the lid on the jar and shake it well.",
      "content": "Place the lid on the jar and shake it well. This will help coat each individual rosemary leaf with oil, and it will also help remove any air bubbles that could escape later and pop the seal on your jar. [7] X Research source You can also stir the mixture with a spoon to remove the air bubbles if you prefer."
    },
    {
      "title": "Place the mixture in a sunny spot for 2-3 weeks.",
      "content": "Place the mixture in a sunny spot for 2-3 weeks. A little heat and sunlight will help speed up the process, so place the jar in a sunny window or on a counter with good natural light. Every day or two, roll the jar slowly in your hands to gently stir the rosemary. This will help the extraction process. [8] X Research source Over the next few weeks, the rosemary oils will slowly seep into the carrier oil, creating an aromatic extraction that you can use on your hair. The longer you leave the extraction, the more rosemary you’ll extract—some people recommend leaving the rosemary in the jar for up to a month. [9] X Research source"
    },
    {
      "title": "Strain the rosemary out of the oil and pour it into a glass container.",
      "content": "Strain the rosemary out of the oil and pour it into a glass container. Filter the rosemary oil through a coffee filter, fine mesh strainer, or cheesecloth, squeezing or pressing it through to extract as much of the oil from the leaves as possible. You may need to repeat the straining process several times to remove all of the rosemary. [10] X Research source Once the oil is strained, pour the oil into a dark-colored, airtight jar or bottle and store it in a cool, dry place. It can last for up to a year, but if it smells bad before that, throw it out and make a new batch."
    },
    {
      "title": "Mix 1 drop of rosemary essential oil into 1 tsp (4.5 g) of carrier oil.",
      "content": "Mix 1 drop of rosemary essential oil into 1 tsp (4.5 g) of carrier oil. Adding 1 drop of essential oil to 1 tsp (about 4.5 g) of carrier oil creates a 1% dilution, or you can add 2 drops for a 2% oil. Certified aromatherapist Renee Hughes says, “If you’re planning to use rosemary oil to encourage hair growth, blend it at 1%, maximum 2%. That way, it will be gentle enough to use every day.” Clinical herbalist Lorena Barcal recommends mixing rosemary essential oil with jojoba and coconut oils. You can also use argan, grapeseed, castor, almond, or avocado oil if you prefer. If you want to make a larger batch of oil, just be sure to measure carefully so you keep the same proportion of ingredients. Don’t use undiluted rosemary essential on your scalp—it could cause irritation, itchiness, dryness, flaking, or even allergic reactions in some people. [11] X Research source"
    },
    {
      "title": "Add dried mint or peppermint essential oil to rosemary oil for hair growth.",
      "content": "Add dried mint or peppermint essential oil to rosemary oil for hair growth. If you’re using dried mint leaves, use about half as much mint as you have rosemary, and add it to the oil at the same time as the rosemary leaves. [12] X Research source If you’re using peppermint essential oil, use about 5 drops for every 1 cup (225 g) of oil. Add it after you steep the rosemary leaves for the cold or hot extractions, or add it at the same time as the rosemary essential oil if that’s what you’re using. [13] X Research source Peppermint oil has been shown in studies to help increase hair growth and thickness. [14] X Research source"
    },
    {
      "title": "Boost growth by adding dried lavender in your rosemary oil.",
      "content": "Boost growth by adding dried lavender in your rosemary oil. Add a small handful of dried lavender flowers to your oil when you’re steeping the rosemary to add a beautiful floral scent and even more hair-boosting power to your rosemary oil. [15] X Research source If you have access to fresh lavender, pick a handful of flowers and dry them on low heat in your oven or food dehydrator. If you don’t have dried lavender, add 5 drops of lavender essential oil to every 1 cup (225 g) of rosemary oil."
    },
    {
      "title": "Apply a few drops to a small area at first.",
      "content": "Apply a few drops to a small area at first. Anytime you use a new product on your skin, it’s a good idea to test it in a small area first to make sure you don’t have an adverse reaction. Apply a few drops to one part of your scalp, then let it sit for a few hours or overnight. If you don’t notice any side effects, you can continue using the oil. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have a reaction to the oil, shampoo it out right away and stop using it."
    },
    {
      "title": "Work about 1 tsp (4.5 g) into your scalp for hair growth.",
      "content": "Work about 1 tsp (4.5 g) into your scalp for hair growth. If you’re using rosemary oil to stimulate hair growth, focus on applying the oil to your scalp—it won’t have too many benefits for the lengths of your hair. Leave it on for a few hours or overnight, then shampoo it out. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For best results, apply the mixture to dry hair."
    },
    {
      "title": "Use the oil at least 2–3 times a week for 6 months.",
      "content": "Use the oil at least 2–3 times a week for 6 months. It can take a while to see results from using rosemary oil. As long as the oil doesn't irritate your scalp, keep applying it consistently for about 6 months, then evaluate whether you notice a difference."
    },
    {
      "title": "Add the oil to your shampoo if you’re in a hurry.",
      "content": "Add the oil to your shampoo if you’re in a hurry. Although rosemary oil is most effective when you apply it directly to your scalp, you may still get some benefits by adding it to your shampoo. Just squirt a little shampoo into your hand, then add a few drops of oil to the shampoo, lather, and wash your hair as usual. [18] X Research source"
    },
    {
      "title": "Put the oil in a spray bottle for all-over application.",
      "content": "Put the oil in a spray bottle for all-over application. If you want to use rosemary oil all over your hair—an option if your hair is thick and dry—try putting it in a spray bottle. Just be mindful that this will work best with thinner oils like olive or argan. Thicker oils may clog the nozzle on the spray bottle."
    },
    {
      "title": "Rosemary may help stimulate hair growth.",
      "content": "Rosemary may help stimulate hair growth. A study in 2016 found that rosemary oil was as effective as minoxidil at helping participants with androgenetic alopecia regrow hair. Just keep in mind that in the study, the oil was applied daily and it took 6 months for there to be a noticeable difference. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Participants who used rosemary oil also experienced less scalp itching than those who used minoxidil."
    },
    {
      "title": "It may help with dandruff or scalp inflammation.",
      "content": "It may help with dandruff or scalp inflammation. Rosemary oil has an anti-inflammatory effect. As a result, it may help relieve issues related to inflammation, like seborrheic dermatitis (more commonly known as dandruff). [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Rosemary oil can help with hair dryness.",
      "content": "Rosemary oil can help with hair dryness. If your hair is dry and brittle, rosemary oil can be a great way to restore moisture and shine. Just work the oil through the ends of your hair and let it sit for a few hours. If your hair is really dry, you may not even need to rinse it out—but do wash your hair if the oil leaves it feeling heavy or greasy."
    },
    {
      "title": "Does rosemary oil really help hair growth?",
      "content": "Does rosemary oil really help hair growth? Yes, there’s some evidence that after 6 months of regular use, rosemary oil is as effective as the drug minoxidil at regrowing hair. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Can rosemary make gray hair turn back?",
      "content": "Can rosemary make gray hair turn back? There’s not enough evidence on this to say for sure, but rosemary could potentially decrease the environmental stress that leads to gray hairs—si maybe. [22] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Does rosemary oil work for all hair types?",
      "content": "Does rosemary oil work for all hair types? You can use rosemary oil on any hair type. However, if your hair is especially fine, you may find that rosemary oil looks heavy or greasy after you apply it. It may help to use a lighter carrier oil, or you may need to apply less oil to your scalp. [23] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Can anyone use rosemary hair oil?",
      "content": "Can anyone use rosemary hair oil? Avoid using rosemary oil if you’re pregnant or breastfeeding. Although health warnings generally apply to undiluted rosemary essential oil, it’s better to stay on the safe side. [24] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "How can you tell if rosemary oil is still good?",
      "content": "How can you tell if rosemary oil is still good? The best way to know if your rosemary oil has gone bad is to smell it. If it smells clean and fresh, with a pleasant herbal scent, it’s still good. If it smells sour, off, or rancid, toss it out."
    }
  ]
}