{
  "url": "https://www.wikihow.com/Make-a-Go-Bag",
  "title": "How to Make a Go Bag",
  "steps": [
    {
      "title": "Purchase a heavy-duty duffel bag or a suitcase.",
      "content": "Purchase a heavy-duty duffel bag or a suitcase. For your go bag, you want a bag that is large enough to carry the necessary items but not be filled to the brim. It should also be sturdy enough to carry all of the items without ripping or getting damaged in some way. If you have a backpack that you are no longer using, this can work. You might even want to consider getting a solar backpack that can charge various devices."
    },
    {
      "title": "Purchase necessary food items.",
      "content": "Purchase necessary food items. You will also need to bring a 3-day supply (per person) of nonperishable food. Canned foods are the best for lasting a long time and preventing animals or other pests from getting into your food supply, but they can also be quite heavy. Your best bet is to buy some canned goods along with some other lighter options – like beef jerky, peanut butter, granola bars, and applesauce. [1] X Research source You can find these nonperishable food items at your local grocery store. You should also bring several days’ worth of food for any household pets you expect you would bring with you in an emergency."
    },
    {
      "title": "Get potable water and/or a water filtration method.",
      "content": "Get potable water and/or a water filtration method. You need to plan on bringing one gallon of potable water per day per person, or a portable water filtration system. You can also try boiling water to purify it for drinking, or adding iodine tablets. Bring a small bottle of bleach. A few drops of bleach can be used to purify water for drinking in an emergency situation. [2] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Pack practical tools.",
      "content": "Pack practical tools. For your emergency kit, try to think of all the scenarios that you might need to prepare for. You’ll need tools and other items to help you deal with these emergent situations. Consider packing the following: [3] X Research source Lamp or flashlight, preferably a hand crank one so you don’t have to worry about batteries Emergency radio Solar chargers for phones or batteries Swiss army knife, with scissor component Can opener Duct tape Matches"
    },
    {
      "title": "Pack extra clothing and blankets.",
      "content": "Pack extra clothing and blankets. In order to protect yourself from the elements, you’ll need to bring extra clothing items that will help you if you are stuck outdoors. Keep your specific area in mind, as your local weather/outdoor conditions will influence what items you choose to pack. Try bringing: [4] X Research source Spare clothes – gloves, walking shoes, extra socks, underwear, layers, wind/rain-resistant clothing. Mylar blankets – they are lighter than full sleeping bags, but still good for warmth."
    },
    {
      "title": "Bring camping supplies if possible.",
      "content": "Bring camping supplies if possible. If you anticipate that you’ll need to sleep outdoors during an emergency situation, consider bringing camping supplies like a tent and sleeping bags for each member of your family. These can be life-saving if you’re stuck out in the cold. [5] X Research source Remember that these supplies can be difficult to carry unless you have a special backpacking backpack that you can attach the tent and sleeping bags to."
    },
    {
      "title": "Bring necessary sanitary products.",
      "content": "Bring necessary sanitary products. You will still need to take care of your sanitary and hygiene-related needs while you’re stuck outdoors or away from home for an extended period of time. Consider the following items: [6] X Research source Dust mask to protect you from possibly harmful airborne debris Sanitary towelettes Feminine products First aid kit – including bandages of various sizes, sterile gauze, antibiotic cream, antiseptic wipes, adhesive tape, antibacterial soap, hydrocortisone cream, tweezers, and a splint. [7] X Research source"
    },
    {
      "title": "Pack all of your necessary medications and prescriptions.",
      "content": "Pack all of your necessary medications and prescriptions. Bring any medications or prescription items you might need while you’re away from home. This includes prescription eye glasses , prescription medication, and over-the-counter medications. [8] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you have to take medications, make sure you keep them all in one place, and can sweep them into the go bag without any searching. Refill your prescriptions before you're nearly out of them. Remember that medications expire, so you will need to keep checking your go bag once you’ve packed it to ensure that the medications aren’t out of date. Once they expire, toss them and replace them. You should also bring any medications your pet may need."
    },
    {
      "title": "Bring important paper items in sealed plastic bags.",
      "content": "Bring important paper items in sealed plastic bags. You may want to include copies of important documents, a paper map of your area, and some extra cash in your go bag. To prevent these items from being damaged, make sure you put them in plastic water-resistant bags. Some documents you should consider bringing include: [9] X Research source Copy of your passport or driver’s license Children’s birth certificates Marriage or divorce papers Insurance information Titles for any property you own Tax information"
    },
    {
      "title": "Pack the heaviest items first.",
      "content": "Pack the heaviest items first. The bulkiest items should line the bottom of your bag. This will help distribute the weight more evenly and make the bag easier to carry in general. Put things like walking shoes, canned food, bottles of water, and bulky lamps in the bottom of the bag."
    },
    {
      "title": "Put clothing in resealable plastic bags.",
      "content": "Put clothing in resealable plastic bags. Consider using plastic Zip-Lock or vacuum bags to store your clothes in inside your go bag. This will ensure your clothes stay dry in the event of a flood. [10] X Research source Using vacuum bags will also help save space inside your emergency kit, as they minimize the volume that bulky clothing and blankets take up."
    },
    {
      "title": "Organize everything in your bag.",
      "content": "Organize everything in your bag. To avoid squishing/damaging items in your bag, you should try organizing everything accordingly. Packing the heaviest items first (in the bottom of the bag) will help. Then you can add things according to weight after that, with the lightest items on the top. [11] X Research source Try to group things together by kind as well. If you pack clothing in plastic bags, try to put each person’s clothing all in one bag. Or put all of your undergarments in one smaller bag and the heavier/warmer items in a larger bag. You can also keep all of the hygiene products together in one bag or one section of the go bag, as well as all of the tools you packed in another bag."
    },
    {
      "title": "Store food goods in plastic or metal containers.",
      "content": "Store food goods in plastic or metal containers. If you have food items (other than canned goods), you need to store them in plastic or metal containers. This will help keep the food items from spoiling or being invaded by pests, as boxes of food or free-floating food items can be easy targets for insects or animal scavengers. [12] X Research source The food containers can then be placed inside the emergency kit bag."
    },
    {
      "title": "Store the bag in a cool, dry place.",
      "content": "Store the bag in a cool, dry place. Food items need to be stored in certain conditions to avoid spoilage or contamination. If your go bag contains food items, keep it in a cool, dry place away from vents or doorways that could expose it to gusts of heat or cold. Your go bag also needs to be stored somewhere that is safe and out of the way. It should be stored in a place that keeps it away from the normal traffic of your everyday life. [13] X Research source This will also help keep household pests from accessing the items inside your bag. Consider storing it in the top of the hall closet, or in a cabinet in the laundry room."
    },
    {
      "title": "Put the bag somewhere that is easily accessible.",
      "content": "Put the bag somewhere that is easily accessible. If you ever need to grab your emergency kit, it will be because something is happening and you need to act quickly. Put your bag somewhere in a place that you can locate swiftly in a rush out the door. You may also want to consider storing your go bag in the trunk of your car for easy access. But remember that the contents may get extremely hot or cold, depending on the season, which aren’t the best conditions for food items."
    },
    {
      "title": "Keep it out of reach of children and animals.",
      "content": "Keep it out of reach of children and animals. You don’t want to grab your bag on your way out the door in an emergency situation only to realize later that your dog chewed through the fabric to get some of the food inside, or your child thought the flashlight was a toy and drained all the batteries."
    }
  ]
}