{
  "url": "https://www.wikihow.com/Get-a-Healthy-and-Strong-Body",
  "title": "How to Get a Healthy and Strong Body",
  "steps": [
    {
      "title": "Drink water whenever you’re thirsty.",
      "content": "Drink water whenever you’re thirsty. Every cell, organ, and bit of tissue in your body needs water to function. In general, adults should consume between 11.5 cups and 15.5 cups (2.7-3.7 litres) of liquid every day. The general guideline to ensure you’re staying hydrated is to have some water whenever you feel thirsty. Jumpstart the habit by having a glass or bottle of water with every meal. [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Other liquids can help hydrate you, including milk, herbal tea, fruit juices, and soup. Some foods, such as fruits and vegetables, also contain water, so they can help you get more liquids as well. You may need liquid, but that doesn't mean that every liquid is beneficial. Drink caffeinated beverages and sugary fruit juice in moderation, and skip sugary sodas completely."
    },
    {
      "title": "Eat lean proteins.",
      "content": "Eat lean proteins. Protein is what your body uses to build and repair muscles. To get lots of healthy, lean protein, eat things like chicken, other poultry, fish, lean beef, and lean pork. Try to limit your consumption of more fatty cuts of beef and pork. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Protein is mainly found in meats, but you can also get it from beans, tofu, nuts, dairy, and eggs. [3] X Expert Source Danny Gordon Certified Personal Trainer Expert Interview. 18 October 2019. If you eat a lot of dairy, consider choosing low-fat options to get all the protein and other nutrients with less of the fat."
    },
    {
      "title": "Choose whole grains over refined grains.",
      "content": "Choose whole grains over refined grains. Whole grains contain more fiber and protein than refined grains. Grains include wheat, rice, oats, cornmeal, barley, millet, bulgur, quinoa, and more. Grains can be found in foods like pasta, oatmeal, cereals, breads, and tortillas. When you’re purchasing different grain-based food items, try to buy the whole grain variety whenever possible. [4] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source For example, choose brown rice over white rice. Brown rice has the whole grain kernel, so it contains more nutrients than white rice, which has the bran and germ removed. When it comes to bread, loaves of multi-grain bread are a great choice because they contain a variety of healthy whole grains."
    },
    {
      "title": "Eat plenty of fruits and vegetables.",
      "content": "Eat plenty of fruits and vegetables. Fruits and vegetables are a great source of fiber, vitamins, and minerals. Load up on fresh produce whenever you’re grocery shopping. Try to include fruits or vegetables as part of every meal and/or eat them as snacks throughout the day. [5] X Research source For example, add a handful of berries to your oatmeal for breakfast or have an apple between breakfast and lunch. Complement meals of lean proteins like chicken or fish with a side of roasted vegetables like green beans, carrots, or asparagus for an easy-to-make option."
    },
    {
      "title": "Opt for healthy fats.",
      "content": "Opt for healthy fats. Our bodies do require a certain amount of fat to function properly. Healthy fats include oils made from canola, corn, cottonseed, olive, safflower, soybean, or sunflower. Avocados are another great source of healthy fat. [6] X Research source Eat butter in moderation as it contains a lot of saturated fat — the less healthy form of fat. Try to avoid processed foods as much as possible because they often contain a lot of the unhealthy fat, as well as high levels of sodium, sugar, and “empty” calories."
    },
    {
      "title": "Get 700 mg of calcium and 10 micrograms of vitamin D a day.",
      "content": "Get 700 mg of calcium and 10 micrograms of vitamin D a day. These keep your bones healthy and strong. Dairy products like milk and cheese are good sources of calcium. If you’re including dairy as part of a balanced diet, you should be getting all the calcium you need. Vitamin D can be a little harder to get enough of, because you mainly get it from the sun. Take a vitamin D supplement during fall and winter when you aren’t getting much sun. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Calcium is what actually makes your bones stronger and keeps them healthy. Vitamin D just helps your body better absorb the calcium it gets. Other good sources of calcium are green leafy vegetables, like broccoli and cabbage, soya beans, tofu, nuts, and fish where you eat the bones, such as sardines. You can also find foods and drinks that are fortified with calcium and vitamin D. For example, there are fortified breads, breakfast cereals, spreads, and soya beverages. Oily fish like salmon, sardines, and mackerel are a good source of extra vitamin D, as are egg yolks."
    },
    {
      "title": "Avoid tobacco and limit alcohol consumption.",
      "content": "Avoid tobacco and limit alcohol consumption. Tobacco and alcohol are linked to weak bones and other health issues. Quit using tobacco if you currently do — and don’t be afraid to get help if you’re addicted! [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Stick to no more than 1 alcoholic drink a day if you’re a woman and 2 if you’re a man. Besides contributing to your risk of osteoporosis, cardiovascular disease, and other conditions, drinking heavily dehydrates you and saps your energy. This hurts your body’s overall performance and inhibits your ability to do physical activities. Tobacco use also raises your risk of lung cancer and can damage other organs in your body."
    },
    {
      "title": "Aim to walk a minimum of 10,000 steps a day.",
      "content": "Aim to walk a minimum of 10,000 steps a day. This improves your cardiovascular health and can help you lose weight. Don’t worry, you don’t have to actually count your footsteps all day. Wear a pedometer or download a smartphone app that counts your steps. Walk more throughout the day by walking to work instead of driving. Or, start going for lunchtime or evening walks. [9] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Walking is one of the best aerobic exercises you can perform because it is not harmful to your body, specifically your joints. There are plenty of creative ways to work more steps into your daily routines. For example, if you go to the mall, park on the opposite side of the mall from the store you’re going to so you have to walk further. If you take public transit, get off a stop or two early and walk the rest of the way to your destination Take the stairs whenever they're an option. Pretend elevators and escalators don’t exist to get more steps in!"
    },
    {
      "title": "Perform moderate and/or vigorous exercise every week.",
      "content": "Perform moderate and/or vigorous exercise every week. There are a few ways to exercise enough and get stronger and healthier. Aim for 150 minutes of moderate-intensity activity or 75 minutes of vigorous-intensity activity per week. Moderate exercises include riding a bike, walking briskly, hiking, dancing, or doing water aerobics. Some vigorous exercises are jogging, running, swimming fast, riding a bike fast or up hills, jumping rope, or walking up stairs. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You can do a mix of moderate and vigorous exercises throughout the week by doing 2 minutes of moderate-intensity activities for every 1 minute of vigorous-intensity activities. If you’re new to exercise or just getting back into the routine, start off slowly. For example, instead of walking for 30 minutes a day 5 days a week to meet the goal of 150 minutes the first week, do 5 or 10 minutes a day to start. Once you get into the swing of exercising, you can break up your activities however you like. For example, you could do 25 minutes of vigorous exercise 3 times a week or do 15 minutes 5 days a week. If losing weight is your main goal, double the amount of time you do moderate or vigorous exercise for each week. Try to find physical activities you enjoy doing. That way, you’re more likely to stay active and consistent with your exercise routine. Making physical activity social can make it more fun. For example, you could form a walking or hiking group with friends or get a gym buddy to lift weights with."
    },
    {
      "title": "Do muscle-strengthening workouts at least twice a week.",
      "content": "Do muscle-strengthening workouts at least twice a week. This makes your muscles actually grow. Incorporate a couple of 20-30 minute strength training exercises into your weekly exercise routine to get stronger. Use free weights, weight machines, your own bodyweight, or resistance bands to do various exercises that target different muscle groups. [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Examples of great strength training exercises are push ups, pull ups, squats, curls, shoulder presses, bench presses, and deadlifts. If you aren’t familiar with different resistance training exercises, get a friend who works out to show you the ropes or sign up for a personal training class at a gym to get started. Aim to do sets of between 10 and 15 reps when you start strength training. This is the range where most people hit muscle fatigue. Shoot for 1-3 sets of any exercise you do. When an exercise becomes easier and 10-15 reps doesn’t feel hard, add weight or resistance to make it more difficult and keep your muscles growing."
    },
    {
      "title": "Do yoga a few times a week.",
      "content": "Do yoga a few times a week. Yoga can build flexibility and increase muscle strength. It can also benefit your cardiovascular and respiratory systems and help you lose weight. Try to do 2 to 5 sessions of yoga per week at home or in a local class to get started! [12] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Yoga is also great regardless of your age or previous exercise experience. There are tons of free yoga classes on YouTube for people of all experience levels and fitness levels."
    },
    {
      "title": "Stand up more throughout the day.",
      "content": "Stand up more throughout the day. Extended periods of sedentary activities can cause many health problems. If you work at a desk, get up at least once every hour and do some stretches or go for a little walk. Spend at least 2 minutes standing for every hour you’re sitting to break up periods of being seated. [13] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Spending more time standing also helps maintain a healthy posture. There are many ways to spend more time standing during work. For example, stand up when you’re talking on the phone or talking to colleagues, or try using a standing desk. At home, consider limiting your screen time to certain hours each day. That way, you’re likely to find other activities to do and spend less time sitting down."
    },
    {
      "title": "Get 7-8 hours of sleep every night.",
      "content": "Get 7-8 hours of sleep every night. Sleep heals, builds muscle, and strengthens your immune system. Choose a bedtime that allows you to get 7-8 hours of sleep every night and do your best to stick to it. Try to avoid taking naps in the afternoon or evening, so you can get to sleep easily at night. [14] X Trustworthy Source Health.gov Online collection of health and fitness standards set by the U.S. Office of Disease Prevention and Health Promotion Go to source Teenagers and children can benefit from a little more sleep than adults. About 9-10 hours is ideal for teenagers and 10 hours or more is good for school-aged children. Reader Poll: We asked 599 wikiHow readers to tell us their favorite way to track their physical fitness, and 59% of them said a fitness tracker or smartwatch . [Take Poll] When you’re keeping track of your daily food, water, sleep, and exercise, try using tech that can do the heavy lifting for you."
    }
  ]
}