{
  "url": "https://www.wikihow.com/Go-to-Space",
  "title": "How to Go to Space",
  "steps": [
    {
      "title": "Consider whether you have the financial means to travel to space commercially.",
      "content": "Consider whether you have the financial means to travel to space commercially. Because commercial space travel is such a new industry and there are only a few companies planning to offer space tourism in the foreseeable future, the price for a ticket on a commercial spacecraft can be incredibly expensive, ranging from hundreds of thousands to tens of millions of USD. Also, since no companies are sending tourists to space at this time, you'll likely be paying a large sum of money to reserve a seat for a future, unconfirmed date. [1] X Research source If money isn't an issue for you, reserving a seat on a future commercial spaceflight may be one of your best chances to travel to space."
    },
    {
      "title": "Look for companies that are currently testing commercial spacecraft.",
      "content": "Look for companies that are currently testing commercial spacecraft. Companies like Virgin Galactic and SpaceX are testing a variety of commercial spacecraft that could transport tourists into space, where they'd experience weightlessness and get the chance to see Earth out of their windows. While there isn't a set date for when these spacecraft will be open to the public, some companies are claiming that they'll be able to start commercial operations within a few years. Depending on the company, you might be able to reserve a spot in advance. [2] X Research source Other companies that are working on commercial space travel that you can look into include Blue Origin (founded by Amazon CEO Jeff Bezos), Space Adventures, and XCOR Aerospace."
    },
    {
      "title": "Stay up to date on the space industry to learn about any breakthroughs.",
      "content": "Stay up to date on the space industry to learn about any breakthroughs. You can learn about advances in the industry by following companies on social media, reading space-related blogs and websites, and reading the news. That way, you'll know if any new commercial space flights become available or if a company you're interested in gets one step closer to launching a commercial flight. For updates on commercial space travel, check out websites like https://www.space.com/ , https://www.nasa.gov/ , and http://www.esa.int/ESA . You can also follow companies like Virgin Galactic and SpaceX on social media to get updates."
    },
    {
      "title": "Wait for space tourism to become more affordable if you can't get a ticket yet.",
      "content": "Wait for space tourism to become more affordable if you can't get a ticket yet. As the space tourism industry becomes more practical and accessible, the cost of space travel should drop. If traveling to space commercially isn't an option for you right now, don't get discouraged! As technology continues to advance, you may start to see more affordable options for traveling to space. [3] X Research source"
    },
    {
      "title": "Make sure you live in a country with a space agency that travels to space.",
      "content": "Make sure you live in a country with a space agency that travels to space. Not all countries have a space agency, and some countries that do have a space agency don't actually send astronauts to space. In order to become an astronaut, you'll need to be a citizen of a country that actually sends people into space. If you're really passionate about becoming an astronaut but your country doesn't have a space agency that needs them, you could always become a citizen of a country that does have a space agency that sends astronauts to space, like the U.S. or a country within the European Union."
    },
    {
      "title": "Do well in school",
      "content": "Do well in school and get a degree to meet the educational requirements. Governments are looking for smart, hardworking candidates for their space programs, so it's important that you start getting good grades in school as early as possible. Also, you should plan on getting an undergraduate degree in something like math, science, or engineering if you don't already have one since most space agencies will require one. [4] X Research source For example, NASA requires astronauts to have a Bachelor's degree in engineering, biological sciences, physical science, computer science, or mathematics. [5] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source"
    },
    {
      "title": "Eat healthy",
      "content": "Eat healthy and exercise regularly so you're physically fit. Being an astronaut is a physically demanding job, and you'll be expected to pass physical exams and training in order to be considered. To make sure you up for it, adopt a healthy lifestyle by eating healthy foods and getting in routine exercise each week. [6] X Research source To eat healthy, focus on eating a variety of healthy foods, like fruits, vegetables, whole grains, and low-fat dairy products. You should also make sure you're eating plenty of protein, complex carbohydrates, and healthy fats. [7] X Trustworthy Source Health.gov Online collection of health and fitness standards set by the U.S. Office of Disease Prevention and Health Promotion Go to source To exercise, aim to get in around 150 minutes of moderate aerobic exercise—like walking, running, and playing sports—once a week, as well as strength-training exercise twice a week. [8] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source In addition to being physically fit, there may be other physical requirements, like having 20/20 vision or falling within a certain height range."
    },
    {
      "title": "Cultivate the right personality traits for the job.",
      "content": "Cultivate the right personality traits for the job. In addition to being physically fit, astronaut candidates are required to have certain personality traits that are useful on a mission to space. While these traits may vary depending on your space agency's requirements, in general, you should work on being flexible, good at working with a team, and able to function well under pressure. You should also love to learn new things! If you're still in school, joining academic clubs can be a great way to develop good interpersonal skills and a passion for learning. [9] X Research source To become more flexible and able to adapt to change, try new things and put yourself out there as much as possible, even if you're a little nervous. Exposing yourself to new situations is a great way to develop the skills you need to be flexible."
    },
    {
      "title": "Gain some relevant professional experience.",
      "content": "Gain some relevant professional experience. The exact amount of professional experience you'll need to become an astronaut will depend on your space agency, but generally, you'll be required to work in a related field, like engineering, computer science, or mathematics, for a few years before you can be considered for the job. After you complete school, try to find work doing something that's related to your degree, which will help you meet the experience requirements and also better prepare you for being an astronaut. [10] X Research source For example, NASA requires 3 years of professional experience or 1,000 hours of pilot-in-command time spent flying a jet aircraft. [11] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source Depending on your space agency's requirements, you may be able to supplement this professional experience with an advanced degree, like a master's or doctorate. [12] X Research source"
    },
    {
      "title": "Apply to be an astronaut through your government's space agency.",
      "content": "Apply to be an astronaut through your government's space agency. The right way to submit an application will depend on your space agency's application process. Try visiting their website or searching something like “NASA astronaut application” online to find a list of instructions and requirements. After you submit your application, you'll likely be required to undergo a variety of interviews, tests, and physical exams to determine if you're qualified for the job. [13] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source Keep in mind that the application process for becoming an astronaut is highly competitive. For example, in 2016, NASA received over 18,000 applications, and only 120 of those applicants were called in for the first round of interviews. [14] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source Even if you don't make the cut the first time you apply, you can still apply again and work on improving your qualifications in the meantime."
    },
    {
      "title": "Go skydiving to see the Earth from a new perspective.",
      "content": "Go skydiving to see the Earth from a new perspective. While you won't be able to see nearly as much of the planet as you would from space, skydiving is still a great opportunity to witness the Earth in a new way. Skydiving will also let you experience a feeling of weightlessness, kind of like how you'd feel if you were in space. Skydiving is also a great way to experience the kind of adrenaline you'd feel during a space launch!"
    },
    {
      "title": "Try a sensory deprivation tank to experience zero gravity.",
      "content": "Try a sensory deprivation tank to experience zero gravity. Also called floating tanks, these tanks are filled with water and a high concentration of Epsom salts, which allows you to float at the surface of the water effortlessly. In a sensory deprivation tank, you can experience zero gravity similar to how you would feel if you were traveling aboard a spacecraft. You can book an appointment to use a sensory deprivation tank at a local spa or wellness center. Try searching for “Sensory deprivation tanks near me” online if you're interested."
    },
    {
      "title": "Experience space using virtual reality.",
      "content": "Experience space using virtual reality. There are a variety of virtual reality systems and headsets available on the market today, as well as virtual reality games that will make you feel like you're actually in space. With virtual reality, you can experience what it would look like to be on the International Space Station, walking on the moon, or orbiting the Earth in a spacecraft."
    },
    {
      "title": "Take a flight on a zero-gravity aircraft to feel what it's like to be weightless.",
      "content": "Take a flight on a zero-gravity aircraft to feel what it's like to be weightless. Zero-gravity flights fly along a parabolic flight path (they fly up at a 45-degree angle, level out, and then descend at a 45-degree angle). Because of this flight path, passengers experience 20-30 seconds of weightlessness, like you would if you were in space. If you're interested, there are a variety of companies that sell tickets for a trip aboard a zero-gravity aircraft. Search \"zero-gravity flights\" online to find tickets."
    }
  ]
}