{
  "url": "https://www.wikihow.com/Keep-Multiple-Canaries",
  "title": "How to Keep Multiple Canaries",
  "steps": [
    {
      "title": "Quarantine new birds.",
      "content": "Quarantine new birds. Even if kept in separate cages, new birds can spread disease. For the first six weeks after bringing them home, keep new birds in a separate cage in a different room away from the rest of the birds. This will prevent the spread of disease or parasites."
    },
    {
      "title": "Get one cage for each canary.",
      "content": "Get one cage for each canary. Canaries can be extremely territorial over small spaces, and they are often happier living alone than with other canaries. They will each need their own cage with separate food bowls, water dishes, and perches. [1] X Research source The best cage for a canary is a rectangular cage that is 16 inches (41 cm) tall and 30 inches (76 cm) wide. Do not use round cages. Canaries should have at least two perches at either end of their cage. Each perch should have a different width. Canaries may enjoy having a swing in their cage or toys like vine balls or bells."
    },
    {
      "title": "Place cages near one another.",
      "content": "Place cages near one another. As long as all the birds are healthy, you can place the cages in the same room. If the birds don't fight through the bars, you can put their cages next to one another. [2] X Research source Males may sing more than usual if kept in cages next to one another. Keep all cages away from windows, doors, and air vents or anywhere there is a draft. Do not place the cages in the kitchen or in rooms where air fresheners, scented candles, or aerosol sprays are used."
    },
    {
      "title": "Determine their gender.",
      "content": "Determine their gender. Learning the gender of each canary will tell you if they can share a cage or not. Unfortunately, male and female canaries do not have any external differences. There are a few methods to check their gender, however. [3] X Research source Use a DNA sexing technique. Ask your vet to recommend you to a lab or go online to see what organizations offer this service. This is typically an inexpensive option. You can get an ultrasound test at the vet, but this can be expensive. If the bird sings, you can be fairly certain it is a male. Very few females sing. Most will chirp. If you have baby birds, try tapping the nest. Female birds tend to look at you while male birds will bend their heads and stick their rears up in the air."
    },
    {
      "title": "Separate by gender outside of breeding season.",
      "content": "Separate by gender outside of breeding season. Canaries can fight for many reasons, but competition over mating is one of the biggest causes. To reduce the tension, keep the males in one cage and females in another after their first molt in late summer. [4] X Research source Use caution when putting males in a cage together. While some males are able to live peacefully together outside of breeding season, others may still attack, and can often kill each other. [5] X Research source"
    },
    {
      "title": "Feed the birds all at once.",
      "content": "Feed the birds all at once. Each bird in the cage will need their own food dish. Otherwise, more dominant birds may prevent less dominant birds from eating. To make sure that no fights erupt over food, make sure to feed all of the canaries in the same cage at the same time. [6] X Research source Each canary needs about a teaspoon of seed or pellet mix. Fresh veggies like kale, broccoli, grapes, or apples can round out their diet."
    },
    {
      "title": "Separate birds before breeding season starts.",
      "content": "Separate birds before breeding season starts. Occasionally, canaries of the same sex can be kept in the same cage after the first molt in summer until roughly midwinter. During the beginning of the year, they may start to fight and attack one another again. If they do, you should move them back to separate cages. [7] X Research source It is a good idea to have your separate cages ready in case the birds start to fight. This can make the transition from the group cage to the single cage much easier."
    },
    {
      "title": "Move mating pairs to breeding cages in late March.",
      "content": "Move mating pairs to breeding cages in late March. The breeding season typically begins in the later half of March. [8] X Research source Get a breeding cage with both a solid and a wire partition in it. Put each bird on different sides of the partitions in the cage. [9] X Research source Remove the solid partition when the female starts building her nest. Once the two birds start kissing through the wire, you can remove the wire one as well. Once the birds start to molt, breeding season is over, and they can go back to their gendered cages."
    },
    {
      "title": "Supervise them carefully.",
      "content": "Supervise them carefully. Some canaries may learn to live well with each other, but it is difficult to predict which ones will be at peace and which will start fights. When you first move the canaries in, keep an eye on them to make sure that they do not squabble over space. Canaries can sometimes kill each other, so watch them carefully. If the canaries fight, they need to be kept in separate cages."
    },
    {
      "title": "Build an outdoor aviary.",
      "content": "Build an outdoor aviary. If you have space outside, you can make a beautiful outdoor aviary to keep your canaries in. These aviaries will supply plenty of room for your birds, reducing the chance that territorial fights will break out. [10] X Research source You should have about 5 inches (13 cm) of space per bird. So an aviary that is 60 inches (150 cm) long can accommodate twelve canaries. You should aim to have at least three or four males at the beginning. They will be less likely to fight with each other than two males."
    },
    {
      "title": "Transform a spare room into a bird room.",
      "content": "Transform a spare room into a bird room. An alternative to the outdoor aviary is to have a room devoted in your home to the birds. This should be a spare room with no furniture. The windows and doors should be sturdy so that the canaries do not escape. [11] X Research source Pick a room with plenty of natural light or even a skylight. You can install special full spectrum bird lamps if necessary. Tile or concrete are the best type of flooring as they are the easiest to clean. You can line the floor with paper towels to help. As with aviaries, you will need at least 5 inches (13 cm) of space per bird. Most indoor rooms should be able to accommodate a large number of canaries."
    },
    {
      "title": "Install a few seed dispensers.",
      "content": "Install a few seed dispensers. Your aviary should have at least three food and water stations to prevent fights. A large seed dispenser or bird feeder works well to keep the canaries fed and happy. You can also place a few heavy water dishes in the aviary for them to drink and bathe in, though these should only be left in for short periods of time. [12] X Research source Seed dispensers will dispense seed and pellet mix slowly over time. You can fill these up to the top, and refill when they get low, typically once every few days or week."
    },
    {
      "title": "Put in enough nest boxes for each hen.",
      "content": "Put in enough nest boxes for each hen. During breeding season, hens will fight over nesting boxes to lay their eggs in. If you make sure that there are enough nesting boxes, they will not need to fight as much over one. [13] X Research source Even if you have more than enough nest boxes, there is a chance that two hens may still fight over one box. Since there is more space in aviaries, these arguments will generally sort themselves out. Do not separate them into cages unless you feel that your canaries are in danger."
    },
    {
      "title": "Add enough perches for all birds.",
      "content": "Add enough perches for all birds. Canaries love having perches as high in the aviary as possible, and they may start fighting for the best one. To solve this problem, keep enough perches for each canary. Place them up high in the aviary. [14] X Research source Similarly, you may want to keep a large supply of toys in the aviary, such as vine balls, bells, branches, and swings. Try to place these in different places around the aviary to avoid fights over territory."
    },
    {
      "title": "Add in other small species of birds.",
      "content": "Add in other small species of birds. Canaries can live well with other species of finches, such as the star finch, and smaller, non-aggressive birds. Never add in larger birds, such as parrots, or aggressive species, such as budgies, to an aviary with canaries. [15] X Research source If you want to mix canaries with other birds, you will need an aviary that is at least 4 feet (1.2 m) wide so that all the birds can have their own space."
    }
  ]
}