{
  "url": "https://www.wikihow.com/Make-a-Guy-Your-Best-Friend",
  "title": "How to Make a Guy Your Best Friend",
  "steps": [
    {
      "title": "Hang out in a group to spend more time with him.",
      "content": "Hang out in a group to spend more time with him. It’s easier to hang out in a group setting when you’re first becoming friends. Join a group event where you know he’ll be present or invite him to hang out with your friends. This will give you more time to talk and interact without either of you feeling pressured by a one-on-one setting. [1] X Research source You might say, “A bunch of us are going to the game on Friday. Do you want to sit with us?” or “My friend group is going bowling this Saturday. If you come, we’ll have an even number.”"
    },
    {
      "title": "Make small talk to start a conversation.",
      "content": "Make small talk to start a conversation. Small talk focuses on neutral topics, like the weather, your environment, or upcoming holidays. Say “hi” to him, then make a general comment about what’s going on. Alternatively, ask him a basic question about what he thinks about your location or the weather. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Say, “Wow, it’s busy in here!” or “It never stops raining!” You could also ask something like, “What do you normally order here?” or “What are you doing for spring break?”"
    },
    {
      "title": "Ask him questions about his interests to continue the conversation.",
      "content": "Ask him questions about his interests to continue the conversation. Talking about his interests will keep him engaged in the conversation and helps you get to know him. Question him about what he likes, then follow-up on his answers. As he talks, nod along and give him encouraging words, like “go on” or “that’s interesting.” [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You could ask, “What are your favorite sports teams?” “Which bands do you listen to the most?” “What clubs are you joining this year?” or “What do you like to do in your free time?”"
    },
    {
      "title": "Share personal details about yourself to make a connection.",
      "content": "Share personal details about yourself to make a connection. Opening up to someone helps build intimacy with them, which will grow your friendship. However, don’t feel pressured to tell your guy friend all of your deepest secrets. Instead, share small personal details with him at first. Over time, you can share things you consider a secret. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Start by telling him about your hobbies, interests, and goals. You might say things like, “My favorite thing to do is play guitar. I’m hoping to be a singer-songwriter some day.” You could also tell him funny or embarrassing stories that aren’t a secret. Say, “I’m kind of known for my burping skills. Two years ago I accidentally burped during the talent show and thought it would be a good idea to burp the rest of the song. Now I’m a legend.”"
    },
    {
      "title": "Send him friendly texts and memes to keep the conversation going.",
      "content": "Send him friendly texts and memes to keep the conversation going. It’s common to text your closest friends on a daily basis, so send him a short text every day. Ask him about how his day is going or about a common interest. As another option, send him funny memes that you think he’ll like. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Text him, “How’s Thursday going?” or “Did you see the game last night?” Don’t text him more than twice in a row before letting him respond. He might feel like you’re bombarding him with texts."
    },
    {
      "title": "Follow him on social media so you can comment on his posts.",
      "content": "Follow him on social media so you can comment on his posts. Add him as a friend on your social media accounts so you can interact with him there. Then, like or comment on his posts so he sees you care about him. Focus on what he’s doing and how he’s feeling. Don’t comment on his looks because it might make him think you want to be more than friends. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You might say, “This is hilarious!” or “Looks like you’re having fun!”"
    },
    {
      "title": "Look for things you have in common.",
      "content": "Look for things you have in common. Most friendships are based around common interests. It’s unlikely that you and your guy friend will like all of the same things, but you’ll probably have some overlap between your interests. Pay careful attention during your conversations with him and when you’re reading his social media posts. Find your common interests so you can base your friendship on them. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For instance, you might both enjoy art and science fiction movies."
    },
    {
      "title": "Be your authentic self",
      "content": "Be your authentic self so he likes you for you. When you want to impress someone, it’s tempting to pretend to be someone else so they like you more. However, your friendship won’t be genuine, and eventually you’ll drift apart. Be honest with him about your interests and ideas. Don’t pretend to enjoy something that you don’t like just because he likes it. [8] X Research source For instance, let’s say you know he likes football but you aren’t a fan. Be honest about not liking football. Instead, focus on something you both enjoy."
    },
    {
      "title": "Invite him to do an activity that you both like.",
      "content": "Invite him to do an activity that you both like. If you want to deepen your friendship, you’ll need to spend some one-on-one time with him. Pick an activity that relates to your shared interests, then invite him to go with you as friends. Focus on just having fun with him so you can grow closer together. [9] X Research source If you’re both into baseball, you might invite him to a game. You might invite him to see the latest superhero movie if you both like comic books. If you both like the same local band, you might invite him to watch them perform at a local coffee shop."
    },
    {
      "title": "Give the friendship time to grow rather than rushing things.",
      "content": "Give the friendship time to grow rather than rushing things. It’s normal to want to be fast friends with someone you really like, but it takes time for most friendships to develop. If you rush things, he may pull away from you. Let your friendship gradually develop over time to increase your chances of becoming best friends with your guy friend. [10] X Research source Enjoy the process of becoming besties! You get to hang out, try new things, and get to know each other better. In time, you’ll develop a strong bond as friends."
    },
    {
      "title": "Listen",
      "content": "Listen to what he has to say. Good friends are always there to listen, so be there when your guy friend needs to talk. Pay attention to what he has to say, and nod along so he knows you’re listening. Then, paraphrase what he said back to him so he knows you were listening. This will show him that you’re there when he needs you. [11] X Research source For instance, he might need to talk about the stress he’s going through with school or his anger at his parents."
    },
    {
      "title": "Show him you’re reliable by keeping your promises.",
      "content": "Show him you’re reliable by keeping your promises. Friends can rely on each other, so it’s important to prove that your word is good. When you say you’ll do something, always follow through so he knows you really care about him. This will show him that you’re a valuable friend. [12] X Research source If you do need to back out of a promise, tell him immediately, apologize , and try to make it up to him. You might say, “I know I said I’d help you study tonight, but my mom is making me go to my brother’s soccer game. I’m so sorry for letting you down, but I promise I’ll call after the game to talk about the areas you need the most help with.”"
    },
    {
      "title": "Be supportive when he’s going through a tough time.",
      "content": "Be supportive when he’s going through a tough time. Friends are there for each other during tough times, so be there for him when he's struggling. Offer him encouragement, give him advice, and be his shoulder to cry on. These actions will show him you're a true friend. [13] X Research source As an example, comfort him when he's going through a break-up or encourage him when he's struggling to pass a class."
    },
    {
      "title": "Keep his personal stories and secrets to yourself.",
      "content": "Keep his personal stories and secrets to yourself. Friends share personal details with each other, so he may tell you things he doesn’t want everyone knowing. Protect his privacy by keeping this information to yourself. Don’t tell anyone the secrets he tells you. If you do, you’ll likely lose his trust. [14] X Research source Assume that what he tells you is meant to be private. Unless it’s common knowledge, don’t talk about it with everyone else. Additionally, don’t try to “help” him using the information he tells you. For instance, he might tell you that he likes a specific girl. Don’t try to set them up unless he asks because he may feel like you violated his trust."
    },
    {
      "title": "Avoid being affectionate if you date guys.",
      "content": "Avoid being affectionate if you date guys. When your friendship is new, being too affectionate with him might send the wrong signals. Don’t caress his skin, lay your head on his shoulder, or hug him until you both feel comfortable in the friendzone. Otherwise, he might think you’re flirting with him because you want to date him. [15] X Research source After you’ve been best friends for a while, you might both feel comfortable hugging and showing other types of affection. However, give yourself time to get there!"
    }
  ]
}