{
  "url": "https://www.wikihow.com/Increase-Your-Running-Stamina",
  "title": "How to Increase Your Running Stamina",
  "steps": [
    {
      "title": "Eat high-energy foods 2 hours before you run.",
      "content": "Eat high-energy foods 2 hours before you run. Aim for a 300- to 400-calorie meal so you have energy. While it's tempting to fill up before a big run, you'll feel uncomfortable if you eat too much. Eat carbohydrates that are easy to digest. These give your body glycogen, which is like fuel for your muscles. Don't forget to include lean protein in order to build muscle and recover. For instance, eat bananas, berries, carrots, oatmeal, whole-wheat bread, or sliced avocado. [1] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Skip foods that take a while to digest like beans, broccoli, cheese, and high-fiber fruits."
    },
    {
      "title": "Drink 2 hours before you run so you're hydrated.",
      "content": "Drink 2 hours before you run so you're hydrated. Consume 17 to 20 fl oz (500 to 590 ml) of water before you run. Try to drink fluids a few hours before you run so your body has a chance to become hydrated. Then, drink an extra 7 to 10 fl oz (210 to 300 ml) of water every 10 to 20 minutes of your run. Staying hydrated helps your body regulate temperature and deliver energy to your cells. It also protects your joints from impact which is important when you're running. [2] X Research source If you're slightly dehydrated, don't just fill up on fluids and immediately go for a run. Your body needs some time to rehydrate before you exercise. Going on a run that's over 1 hour long? Drink a sports drink instead of water to replace electrolytes and carbohydrates."
    },
    {
      "title": "Run in shoes that fit your needs and give you support.",
      "content": "Run in shoes that fit your needs and give you support. A great pair of shoes goes a long way in preventing injuries. Go to a local running shoe store and try on several pairs to figure out what's most comfortable for you. Staff should be able to learn what kind of running you do and which shoes work best for it. They may also recommend specific supports so you can comfortably run for longer. For example, if your feet have high arches, they may recommend a shoe or insert that gives extra cushioning. These supports can absorb shock, too so you may be able to run for longer without feeling the same impact. Replace your worn-out running shoes instead of hanging on to them. New shoes really protect your feet and enhance your running."
    },
    {
      "title": "Focus on good running posture.",
      "content": "Focus on good running posture. Your posture supports your muscles so they're more efficient when you run. Hunching forward or tensing your body can cause damage, so keep your trunk tall when you run. It's fine to lean forward a bit, but raise your torso forward so your lungs can expand. You should also let your arms swing from your sides instead of keeping them crossed in front of your torso. Try to keep your hands and wrists loose as you run. [3] X Research source Staying relaxed can prevent muscle strain and keep them flexible. When you run, remember to plant your heel before you push onto your toes."
    },
    {
      "title": "Practice performance breathing.",
      "content": "Practice performance breathing. By using less oxygen, you can put more energy into running. If you find yourself panting or breathing rapidly after a run, focus on improving your breathing. If you make your breaths deeper and more efficient, you'll be able to send more energy to your muscles. To get you started with performance breathing repeat this cycle: [4] X Research source Inhale through your nose for 2 counts Hold the breath for 2 counts Exhale through your nose for 4 counts"
    },
    {
      "title": "Run on challenging terrain.",
      "content": "Run on challenging terrain. Set your treadmill to intervals and incline or run up hills. These challenge your body and build cardio endurance. Plus, they're harder than running on flat surfaces so if your body gets used to the difficult terrain, you'll have an easier time when you run on the track. [5] X Research source Remember to do a warm-up and cool-down when you're running. If you're using your treadmill, make sure there's a warm-up and cool-down period programmed into the machine. If not, take a few minutes to get your body ready for the workout and slow it down at the end."
    },
    {
      "title": "Include interval training in your workouts.",
      "content": "Include interval training in your workouts. Break your runs into intense and moderate bursts of speed. Interval training sounds complicated, but it's basically alternating between shorts bursts of intense activity that last around 30 seconds with moderate activities that last for 1 to 2 minutes. You'll burn a lot of calories and your aerobic capacity will improve so you can run for longer. For example, do a 10 minute warm-up—start with a rapid walk that becomes a slow jog. Then, ease into your regular jog for a few minutes before you spring at top speed for 30 seconds. Go back to a light jog for 1 to 2 minutes before you spring again. Play around with the amount of time that you spend in intense activity. Keep in mind that you'll need a little longer recovery time with moderate activity if you're really active."
    },
    {
      "title": "Increase your workout goals by 10% a week.",
      "content": "Increase your workout goals by 10% a week. Aim to improve your running distance or time by up to 10% every week. You might be excited to really push yourself for big gains, but give your body a chance to build new muscles slowly. By gradually extending your workout time or distance, you'll build stamina. [6] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. For example, you may do an interval workout and run 3 miles (4.8 km) for 5 days of the week. Go for a longer run on 1 day to test your endurance and rest the next day. The following week, you may extend your interval workouts by 10 minutes and run an extra 1 ⁄ 2 mile (0.80 km) each day to build your endurance."
    },
    {
      "title": "Come up with a personalized workout plan.",
      "content": "Come up with a personalized workout plan. Create a mix of running and exercises that you enjoy. If you like doing a mix of high- and low-intensity workouts, you might do a jog, followed by a moderate run, then a brief sprint on one day. The next day, you may do a moderate run and jumping rope or lifting weights, for instance. Try to choose workouts that you are eager to do so you're more likely to stick to your workout schedule. Need some more ideas? Check out the sample workouts we've included at the end of the article."
    },
    {
      "title": "Exercise to upbeat music.",
      "content": "Exercise to upbeat music. Turn on energizing music to see an increase in endurance. This might sound too good to be true, but researchers found that listening to motivational pop or rock music while working out can endurance by 15%! Music can also have a positive effect on your mood, so you feel better about your run or workout. [7] X Research source Come up with a motivational playlist that you use just for running. This way you can tune in and get going."
    },
    {
      "title": "Do low-impact activities like walking and swimming.",
      "content": "Do low-impact activities like walking and swimming. Running can be rough on your body—you may get impact injuries over time. To build stamina without risking injury, jump in the pool! Swimming works your legs, shoulders, and arms. Walking is another great low-impact exercise that builds endurance. For every 4 to 7 minutes you run, plan on walking for 1 minute. [8] X Research source To work swimming into your schedule, try swimming as a break after a tough workout or just go swim a few laps when you have time. Other low-impact activities include roller skating, jogging in the pool, cycling, yoga, and cross-country skiing."
    },
    {
      "title": "Do plyometrics exercises 3 times a week to work your muscles.",
      "content": "Do plyometrics exercises 3 times a week to work your muscles. Mix up your workout with exercises like jumping rope or skipping drills. These types of exercises strengthen your muscles so you use them more efficiently. This gives you more energy or endurance for your run. Here are some other great plyometrics to add to your schedule: [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Lunges Jump squats Clap push-ups Bounding"
    },
    {
      "title": "Add pilates to your schedule.",
      "content": "Add pilates to your schedule. Pilates improves your flexibility and can increase your stamina. You probably think of pilates as a stretching activity, but it's a great way to strengthen your legs, core, and back. Even just an hour or two a week can help you become more flexible, which supports the muscles you're developing. To get you started with helpful pilates exercises, try: [10] X Research source Side leg kick: Lay flat on your stomach and raise your upper body on your forearms. Bring one leg back toward your butt. Then, lower it and draw back the opposite leg. Do 20 reps. Rowing: Sit up straight with your legs stretched in front of you. Wrap a strap around your legs and cross the ends when you hold them. Then, pull the straps up to your torso and release. Repeat this 10 times. Kneeling sidekick: Kneel on a mat and tip your upper body to 1 side. Stick your arm down to support you and bring the other arm behind your head. Then, stretch out the opposite leg and lift your leg—you can go up and down or move it in circles. Do this about 10 times before you work the other side."
    }
  ]
}