{
  "url": "https://www.wikihow.com/Make-a-Bully-Bored",
  "title": "How to Make a Bully Bored",
  "steps": [
    {
      "title": "Ignore the bully.",
      "content": "Ignore the bully. The easiest technique to try if you’re being bullied is to simply Ignore a Bully. It’s no fun for them to pick on someone who ignores them. Avoid replying to any of their insults or threats, and many times you will find that they grow bored of bullying you and will stop doing it."
    },
    {
      "title": "Avoid retaliation.",
      "content": "Avoid retaliation. Don’t come down to the bully’s level and retaliate against them. They want to see you lose your cool and fight back physically or verbally. Refusing to retaliate will make your bully bored because they aren’t getting the angry or emotional reaction that they wanted from you. [2] X Research source"
    },
    {
      "title": "Be assertive.",
      "content": "Be assertive. Make eye contact, square your shoulders, and firmly ask the bully to leave you alone. This is especially disengaging for bullies who have counted on you to be a meek, easy target. Showing that you’re strong and unwilling to accepting teasing and taunting might be enough to make the bully tired of bullying you. [3] X Research source Even if you feel intimidated or scared, unless you’re in imminent physical danger, assertively standing up to your bully builds confidence, and bullies will quickly grow bored with calm, collected people who don’t respond to their harassment."
    },
    {
      "title": "Prepare effective comebacks.",
      "content": "Prepare effective comebacks. Bullies count on you being submissive to their taunts and harassment. However, if you think about strategic things to say ahead of time to deter the bully, you might make them give up on harassing you. [4] X Research source Some examples of good comebacks include “Is that the best you can do?” or “You’re acting like a bully. Please stop.” Laughing and saying their criticisms are ridiculous is also a great way to disengage a bully. [5] X Research source Kill them with kindness. Take their taunts as a compliment and pretend to agree with everything they say. For example, if someone harasses you about an incident that happened a long time ago, tell them they have a sharp memory and ask them how they can remember so far back."
    },
    {
      "title": "Don’t become emotional.",
      "content": "Don’t become emotional. Bullies thrive on getting a reaction from the people they harass. Bullying makes them feel powerful and important. However, if you remain calm and avoid crying, yelling, or otherwise engaging your bully, they will eventually get bored of picking on you. [6] X Research source"
    },
    {
      "title": "Walk away from the situation.",
      "content": "Walk away from the situation. If the bully is online or only throwing around insults in person, then you can simply walk away from the situation. Physically removing yourself from the bully will shut them down because you are no longer there to be the butt of their jokes and taunts. Eventually they will move on from harassing you because you’ve removed yourself from their presence."
    },
    {
      "title": "Do your best to avoid physical altercations.",
      "content": "Do your best to avoid physical altercations. This is especially important if your bully is older and bigger than you and walking away from the situation didn’t work. If they shove or push you, do your best to calmly walk away from the altercation. However, if they won’t let you walk away, do your best to Defend Yourself until you can get away from them. [7] X Research source Put your arms up in front of your chest and face to deflect any incoming slaps or punches. Do your best to dodge any punches or kicks. As soon as you spot a friend or adult, shout to them that you need help. Bullies will usually stop physical altercations immediately when adults are around because the consequences for fighting are severe. Never throw the first punch or slap at your bully. If you do, you will probably get in just as much trouble as the bully. If the bully is physically hurting you, you cannot wait for them to become bored and leave you alone. Tell an adult immediately."
    },
    {
      "title": "Employ the buddy system.",
      "content": "Employ the buddy system. If the bully is outnumbered by you and your friends, they will often be deterred from bullying you. Bullies also tend to stop harassing others when adults are around, so try to stay near a trusted adult at school. Avoid private settings where the bully could corner you and hurt you. [8] X Research source"
    },
    {
      "title": "Take a different route to school.",
      "content": "Take a different route to school. If you know where your bully will be at a particular time, such as during their trip to and from school, avoid taking the same route. If possible, take the bus so there will be an adult around or ride with a friend or parent to school to minimize possible interaction time with the bully. [9] X Research source Avoiding your bully doesn’t mean that they won or that you’re scared of them. It just means that you are looking out for your own safety and well-being. [10] X Research source"
    },
    {
      "title": "Block the bully online.",
      "content": "Block the bully online. There are different ways to Handle Cyber Bullying. If you have tried ignoring your bully and assertively asking them to stop harassing you, then you will need to block them on social media and email. Once they are blocked, be sure to adjust your privacy setting across all your social media accounts so that only your friends and family can see you and contact you. [11] X Trustworthy Source StopBullying.gov Website run by the U.S. Department of Health and Human Services providing information related to identifying and preventing bullying Go to source If you are being repeatedly harassed on social media, consider disabling comments on your social media accounts. [12] X Expert Source Dr. Niall Geoghegan, PsyD Clinical Psychologist Expert Interview. 24 July 2019. Some bullies might go so far as to create alternate accounts to regain access to you. Be skeptical of friend requests from people you don’t know. Only accept new followers and friend requests from people you know personally. [13] X Trustworthy Source StopBullying.gov Website run by the U.S. Department of Health and Human Services providing information related to identifying and preventing bullying Go to source If the bully has your phone number, you might need to get a new number to make sure that they are completely cut off from you. Some newer phones have call block features which help you Block a Number from Texting You or calling you. Simply list the number as the one you want blocked, and you will have no further contact with that phone number."
    },
    {
      "title": "Keep evidence of cyberbullying.",
      "content": "Keep evidence of cyberbullying. If your bully won’t go away, you might have to take corrective action by going to your teacher or the police. When you speak with a teacher, parent, or even the police, if needed, it will assist them in helping you if you have evidence of exactly what the bully is doing to you. Take screenshots or photos of written threats so you have evidence of the bullying. Or, if they’re verbal threats, consider recording them with your phone to play back for a trusted adult."
    },
    {
      "title": "Confide in a teacher or parent.",
      "content": "Confide in a teacher or parent. Let your parents know what’s going on with your bully. If the bullying occurs at school, inform your teacher or school counselor that you are being bullied. They will intervene and help you, especially if you have witnesses or evidence to show the bullying. [14] X Research source"
    },
    {
      "title": "Inform the police.",
      "content": "Inform the police. If things do not improve with your bully after involving other adults in your life, for safety purposes, you might need to involve the police. Bring a parent with you to help you file a police report or formal complaint. Often, bullies will stop their bullying before you have to involve the police because most bullies are just insecure and attention seeking. However, don’t feel embarrassed if you do have to contact the authorities in the end. Remember that you are not the one in the wrong, and you have a fundamental right to feel safe when you leave your home or are online."
    },
    {
      "title": "Report the bully on social media.",
      "content": "Report the bully on social media. Bullying violates the terms of service on many social media platforms like Twitter, Facebook, and Instagram. Report instances of cyberbullying to the social media platform you’re using. [15] X Research source Social media platforms take cyberbullying very seriously, and many times the platforms will disable or delete the bully’s account for violating their terms of service."
    },
    {
      "title": "Remember that bullying affects everyone.",
      "content": "Remember that bullying affects everyone. The hostile, scary environment created in the presence of bullying is unpleasant for everyone, including innocent bystanders and those not being actively bullied. If you stop a bully, no matter which measures you use, you’re helping your peers, as well. Take pride in helping to make your school or online community a safe space."
    }
  ]
}