{
  "url": "https://www.wikihow.com/Hook-up-Jumper-Cables",
  "title": "How to Connect Jumper Cables to a Dead Car",
  "steps": [
    {
      "title": "Park the vehicles so the batteries are near each other.",
      "content": "Park the vehicles so the batteries are near each other. Drive the vehicle with the live battery, which is the “donor” car, towards the vehicle with the dead battery. Car batteries are typically located underneath the car’s hood, so either park the cars next to each other or facing one another so that the hoods are close and easily accessible, and the jumper cables can reach both batteries. [1] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Engage the parking brake on both cars.",
      "content": "Engage the parking brake on both cars. The parking brake ensures that the cars stay in place as you jump the battery. Use the gear stick if your car has one. Shift the car to “P” or “Park” to engage the brake. Setting the car to “N,” or “Neutral,” will also prevent it from rolling. If your car has manual transmission , set it to neutral, then engage the emergency brake. [2] X Research source The emergency brake is usually located near the gear stick or gas pedal."
    },
    {
      "title": "Turn the cars off and remove the keys.",
      "content": "Turn the cars off and remove the keys. Make sure the donor car is completely off. Listen to the engine shut down and test the radio to see that it doesn’t have any power running to it. Also take the key out of the car with the dead battery so it can’t start up when the jumper cables are attached. Doing this protects both engines from power surges and reduces the risk of electrical shock."
    },
    {
      "title": "Clean the battery terminals with a wire brush or other coarse material.",
      "content": "Clean the battery terminals with a wire brush or other coarse material. Pop the hood and examine the battery terminals for signs of dirt, corrosion, or leakage. If there’s white or greenish discharge, clean the battery with a wire brush or aluminum foil to wipe it away, taking care not to let the substance come in contact with your skin. Do not try to jump batteries that have physical damage, like cracks or broken components. Physically damaged batteries may pose a risk of electrocution or damage to your car when jumped."
    },
    {
      "title": "Locate the positive and negative battery terminals in each car.",
      "content": "Locate the positive and negative battery terminals in each car. The cables leading to the positive terminal are almost always red. The negative terminal’s cables are black. Likewise, the terminals are often identified with red and black components or symbols such a “+” and “-” sign to mark the positive and negative terminals, respectively. [3] X Research source"
    },
    {
      "title": "Attach a red clamp to the positive terminal of the dead battery.",
      "content": "Attach a red clamp to the positive terminal of the dead battery. Double-check the “+” and “-” labels on the battery before attaching the clamp. Squeeze the clamp to open it, then fit it securely around the metal terminal, so that the metal of the clamp is fixed to the metal of the terminal. [4] X Expert Source Duston Maynes Automotive Repair Specialist Expert Interview. 14 July 2021. On some vehicles, you may have to remove a plastic cover from the positive battery terminal before you can make this connection . Remove it by twisting it counterclockwise by hand, or by lifting the cap. Connect each clamp 1 at a time, and work slowly and deliberately. Jumping a car with improperly connected cables can damage your car’s electrical system or cause injury to yourself."
    },
    {
      "title": "Secure the other red clamp to the positive terminal on the donor battery.",
      "content": "Secure the other red clamp to the positive terminal on the donor battery. Carry the other red clamp to the other car and fit in on the positive terminal. Make sure it is secure so it won’t slip off when the engine is activated later. [5] X Expert Source Duston Maynes Automotive Repair Specialist Expert Interview. 14 July 2021. As you attach the clamps, make sure no 2 clamps touch each other as you move them about or while they dangle freely, which may cause electrocution."
    },
    {
      "title": "Connect a black clamp to the negative terminal on the donor battery.",
      "content": "Connect a black clamp to the negative terminal on the donor battery. Take the donor battery’s corresponding black clamp and fit it directly on the black “-” terminal on the battery. Make sure not to touch it to the “+” terminal or the red clamps. [6] X Expert Source Duston Maynes Automotive Repair Specialist Expert Interview. 14 July 2021. If you attach a clamp incorrectly, stop and immediately remove the clamps carefully, working 1 at a time to avoid touching them together."
    },
    {
      "title": "Connect the other black clamp to an unpainted metal surface in the car.",
      "content": "Connect the other black clamp to an unpainted metal surface in the car. The black clamp of the dead battery does not connect to a battery terminal. Instead, find a bit of metal at least a foot away from the battery, such as a clean bolt in the engine block. You may also place the clamp on an unpainted part of the car’s body underneath the hood. [7] X Expert Source Duston Maynes Automotive Repair Specialist Expert Interview. 14 July 2021. This clamp is “grounded” away from the battery to eliminate the risk of a wayward spark combusting the hydrogen gas created in the air when the battery is jumped. [8] X Research source Don’t dig too far down to find a metal surface. The fuel lines are deeper in the engine block and you are better off keeping the clamp away from them. Make sure the jumper cable doesn’t hang down into the engine compartment, since it can get caught by the moving parts within."
    },
    {
      "title": "Start the donor vehicle and let it idle for a few minutes.",
      "content": "Start the donor vehicle and let it idle for a few minutes. Use the ignition key to start the engine. The electrical systems, such as the lights and radio, will start while electricity flows to the dead battery. Give the battery at least 30 seconds to build power before you attempt to start the other car. [9] X Research source Depending on the dead battery’s age and condition, it may require more time to charge, so let it run for an additional minute if your first attempt doesn’t work. Step on the gas pedal to run the RPM up to about 3,000 to drive more power towards the dead battery. [10] X Research source"
    },
    {
      "title": "Start the dead car’s engine and let it run for 10-15 minutes.",
      "content": "Start the dead car’s engine and let it run for 10-15 minutes. Turn the key in the ignition to activate the car. The electrical systems should immediately activate. If the lights, radio, or other electrical components don’t come on, give the battery more time—shut off the car, make sure the cables are attached properly, and then try revving the working car to increase the power supply. [11] X Research source If the car doesn’t start after repeated attempts, your car may have a different problem. Call a mechanic, tow service, or other roadside assistance for aid. If the car’s lights come on but the engine won’t start, the battery is fine, and your issue is caused by another problem. A clicking noise may indicate that it’s time to replace the starter ."
    },
    {
      "title": "Disconnect the jumper cables in reverse, starting with the black clamps.",
      "content": "Disconnect the jumper cables in reverse, starting with the black clamps. Remove the cables in the exact opposite order from earlier. Start with the negative (black) grounding cable you attached to a metal component on the dead car, followed by the black clamp on the donor battery. Then remove the red clamp from the donor battery, followed by the red clamp on the newly-charged battery. Take the jumped car for at least a 15-minute drive to charge the battery before you shut it down again. Be careful when handling the cables. Make sure the clamps do not touch until all of them are removed from the batteries."
    }
  ]
}