{
  "url": "https://www.wikihow.com/Make-a-Horse-Blanket",
  "title": "How to Make a Horse Blanket",
  "steps": [
    {
      "title": "Measure the length of the horse.",
      "content": "Measure the length of the horse. Put the tape measure in the middle of the horse's chest, then wrap it around the side of the horse, over the largest bulge in the shoulder. Measure to the base of the tail, or where the tail and the horse's butt connect. Make a note of the measurement on a piece of paper. [1] X Research source If your tape measure isn’t long enough, you can pull a piece of yarn from the chest to the tail, then measure the piece of yarn. The length of a horse’s body will be anywhere from 64 inches (1.6 m) to 90 inches (2.3 m)."
    },
    {
      "title": "Measure from above the horse's elbows to the top of his back.",
      "content": "Measure from above the horse's elbows to the top of his back. Place the tape measure above the horse's elbows, right under its shoulders, up to the top of his back. Multiply this measurement by two so that the blanket can drape off both sides of the horse. Write the measurement down. This will determine how wide your blanket has to be."
    },
    {
      "title": "Purchase the fabric for the blanket.",
      "content": "Purchase the fabric for the blanket. Go to a fabric or craft store and choose a fabric that will keep your horse warm and that falls within your budget. If you are housing the horse indoors, cotton, wool, or nylon will work. If you are keeping the horse outside, you'll need to get a breathable and waterproof fabric like Gore-Tex. Buy enough fabric so that you can create a blanket that fits within the measurements that you took down. [2] X Research source Your goals for the blanket should drive which fabric you choose. You can also buy these fabrics online. Purchase additional fabric in case you make a mistake and need to start over. You can purchase waterproof/breathable materials from companies like Polartec, eVent, Pertex, and Gore-Tex. [3] X Research source If you don't use a waterproof fabric and keep your horse outside, the blanket will get wet from the rain or snow and will make the horse colder. It can also cause rubs and sores where it touches the horse. Cotton and nylon will be the cheapest fabrics, while breathable and waterproof fabrics are the most expensive."
    },
    {
      "title": "Cut the fabric to size.",
      "content": "Cut the fabric to size. Use scissors to cut out a rectangular square to your measurements. If you bought extra fabric, set it aside in case you make a mistake. [4] X Research source"
    },
    {
      "title": "Fold the fabric in half and cut a shallow semicircle in the top left corner.",
      "content": "Fold the fabric in half and cut a shallow semicircle in the top left corner. This semi-circular cut will create a hole in your blanket that your horse’s neck can go through. This cut should be very shallow, as you can adjust the depth of the neck hole more accurately after fitting the blanket over the horse. [5] X Research source"
    },
    {
      "title": "Drape the fabric over your horse to see if it fits.",
      "content": "Drape the fabric over your horse to see if it fits. Pin the front of the blanket together so that it closes over the horse’s chest. See if the hole that you cut for the neck was large enough. The blanket should fit comfortably above the horse’s shoulders. If the fabric is bunching up on the top of the horse’s neck, you’ll need to trim the neck hole a little more. Adjust and refit the blanket on the horse until the blanket fits snugly around the horse's neck. [6] X Research source If the blanket droops below their shoulders or withers, you’ve made your neck hole too large. In this case, you’ll have to recut a new piece of fabric. Make sure that the blanket doesn’t restrict movement in the horse’s shoulders. The blanket should fit loosely around the shoulders and shouldn't impede the horse's movement."
    },
    {
      "title": "Draw a line under the neck hole.",
      "content": "Draw a line under the neck hole. With the front of the blanket still pinned, use a marker to draw a line on the bottom of the neck hole. This will let you know where to attach the straps that will close the blanket in the front. Make sure that the neck hole doesn't droop or sag off the horse's neck."
    },
    {
      "title": "Pin hook-and-loop fastener strips to the front of the blanket.",
      "content": "Pin hook-and-loop fastener strips to the front of the blanket. Cut out three 2 inches (5.1 cm) hook-and-loop fastener strips. The hook-and-loop fastener strips will attach the horse blanket to your horse by closing the blanket on the front. [7] X Research source Take the hook side of the hook-and-loop fastener and pin it to the righthand side of the blanket. Pin the strips 2 inches (5.1 cm) apart, one over the other. Take the loop side of the hook-and-loop fastener and pin it to the other side so that they run parallel to the hook side of the hook-and-loop fastener. [8] X Research source"
    },
    {
      "title": "Measure a strap for under the horse’s belly.",
      "content": "Measure a strap for under the horse’s belly. Use a well-fitting girth as a guide, and add 5-10 in (12.7-25.4 cm) to create an appropriately sized belly strap. When secured, this belly blanket strap will fit around the largest part of the horse’s chest where the girth normally fits. This will help keep your blanket from sliding off the side of the horse. If you like, you can also measure and create a loop at the end of the blanket for the tail to go through. This is up to you."
    },
    {
      "title": "Sew the hook-and-loop fastener to the front of the blanket.",
      "content": "Sew the hook-and-loop fastener to the front of the blanket. Attach the hook-and-loop fastener strips to the fabric using a cross stitch . To cross stitch, thread your needle and make a knot at the end of the thread. Then, insert the thread into the hook-and-loop fastener in one of the corners and create a diagonal line across the width of the hook-and-loop fastener strip. Pull the needle back through the other corner, then, make another diagonal line with the thread so that your thread forms an X. Continue doing this down all the strips of hook-and-loop fastener until they are attached to the blanket. [9] X Research source Sew your belly strap and tail straps in place as well. Use a mechanical sewing machine if you want to save time."
    },
    {
      "title": "Secure the blanket to the horse and walk it around.",
      "content": "Secure the blanket to the horse and walk it around. Drape the blanket over the horse again and close the hook-and-loop fastener strips that you added to the front. Examine the horse’s movement. If you notice that it’s having difficulty walking or running, you may have to trim the blanket again."
    },
    {
      "title": "Use a blanket if the temperature dips below 10 °F (−12 °C).",
      "content": "Use a blanket if the temperature dips below 10 °F (−12 °C). If you keep your horse outside, it's especially important to cover it in a blanket during freezing weather. The blanket will provide the additional warmth the horse needs to stay comfortable. In extreme cases, where the temperature dips below 0 °F (−18 °C), make sure that your blanket is constructed of a heavier material like Gore-Tex or wool. [10] X Research source Be sure to provide a 3-sided shed for your horse to take shelter in as well when the weather is bad."
    },
    {
      "title": "Use one if your horse is going from a warm to a cold climate.",
      "content": "Use one if your horse is going from a warm to a cold climate. Horses that get moved to a colder climate will need a blanket during their first winter. This is especially true for horses transported after the autumn equinox because their winter coat will not have enough time to grow for the winter. [11] X Research source A horse's coat is sensitive to temperature. If it's acclimated to living in a warmer climate, its body won't need to grow a thick winter coat."
    },
    {
      "title": "Cover the horse in a blanket to shorten the horse’s winter coat.",
      "content": "Cover the horse in a blanket to shorten the horse’s winter coat. During the winter months, a horse will grow a longer coat to keep it warm during the cold weather. While a blanket won’t prevent the growth of the coat, it will reduce how much it grows and will keep the horse’s hair padded down. If you have a show horse, you may want to keep the horse's hair short with regular body clippings. [12] X Research source If you want to reduce your horse’s coat, you should put the blanket on it when the temperature dips below 50 °F (10 °C) or lower. Take the blanket off the horse so that you can groom it regularly. When you remove it, check for any areas of chafing or excess sweat. Don’t put a blanket on a horse in the hot weather, or you may overheat it."
    }
  ]
}