{
  "url": "https://www.wikihow.com/Get-a-Job-at-Chipotle-Mexican-Grill",
  "title": "How to Get a Job at Chipotle Mexican Grill",
  "steps": [
    {
      "title": "Know Chipotle's Vision.",
      "content": "Know Chipotle's Vision. You might be asked this at the interview, but even if you aren't, this is very important to know when you get hired. Chipotle's vision is to \"develop a team of top performers who are empowered to achieve high standards.\" Everybody must work together and work to accomplish the goal of making your general manager a restaurateur every day. Good is no longer good enough and great can be even better. Living the vision is the only way to become restaurateur. Your general manger needs 3 things to become a restaurateur: top performers, empowerment, and knowledge of high standards."
    },
    {
      "title": "Understand what '\"Food with Integrity\"'",
      "content": "Understand what '\"Food with Integrity\"' means. Steve Ells, the founder of Chipotle, says that it is \"our commitment to always look closer, dig deeper, and work harder to ensure that our actions are making things better, not worse. It's our promise to run our business in a way that doesn't exploit animals, people or the environment . It is the philosophy that guides every decision we make at Chipotle.\" In other words, Chipotle does whatever it can to make sure livestock is not put through harsh conditions or given antibiotics livestock lives on a vegetarian diet the produce is locally farmed and organic whenever possible If their food ever doesn't meet their high standards, they make sure to let people know and sometimes will even pull the food item in question. This happened in January 2015 when the pigs from a supplier were found during a routine audit being put through conditions that did not meet Chipotle's standards. All Chipotle restaurants that got their carnitas from that supplier immediately donated their carnitas and no longer served that meat. [1] X Research source Food With Integrity makes a difference in how everything tastes and also takes a big step in changing the way people think about food."
    },
    {
      "title": "Be able to define what it takes to be a top performer in your own words.",
      "content": "Be able to define what it takes to be a top performer in your own words. This is something that may be asked during the interview. Chipotle's definition of a top performer is \"A person who has the desire and ability to perform excellent work , and whose constant effort to do so elevates them , their team , and Chipotle .\" Being a top performer is not just about being awesome at everything you do, but about how much you want to be awesome and how you help your team to be awesome and to achieve high standards ."
    },
    {
      "title": "Know what high standards means and be able to explain it off the top of your head.",
      "content": "Know what high standards means and be able to explain it off the top of your head. This is something that may be asked during the interview. Chipotle's definition of high standards is \"Creating a uniquely extraordinary restaurant experience for every one of your customers and crew .\" Remember that high standards means always . Always make the best food. Always have great work ethic. Always give your customers great customer service. Always keep the restaurant ship-shape. Always have high standards. It's the way everything should be."
    },
    {
      "title": "Understand empowerment.",
      "content": "Understand empowerment. This is something that may be asked during the interview. Chipotle's definition of empowerment is \"To be confident in your ability and encouraged by your circumstances such that you feel motivated and at liberty to devote all of your talents to a purpose .\" Remember that empowerment is a feeling . Empowerment is a feeling of ownership . Empowerment is a feeling of motivation . Empowerment is a feeling of wanting to be a top performer . Empowerment is a feeling of always having high standards . Empowerment is a feeling of passion for what you do and what you can accomplish. It is important that everybody working in a team at Chipotle feels empowered to be the best."
    },
    {
      "title": "Understand what a Restaurateur is.",
      "content": "Understand what a Restaurateur is. This is something that may be asked during the interview. Chipotle's definition of a Restaurateur is \"a person who develops a team of top performers who are empowered to achieve high standards .\" [2] X Research source All Restaurateurs are Chipotle general managers, but not all Chipotle general managers are Restaurateurs. It takes a special person with a special team to be a Restaurateur."
    },
    {
      "title": "Know what you're getting yourself into.",
      "content": "Know what you're getting yourself into. When you get the job, you will most likely start as a crew member because Chipotle tends to only hire managers from within. Understand that you probably aren't coming in and exclusively working the line, or the cash resister, or the grill, or whatever you want to do; you will be trained to do everything. When you are handed your black Chipotle shirt with the nifty typography on the back and non-slip shoe covers, you have officially become a potential Chipotle restaurateur . You'll have to do hard work to be a top performer . You'll have to be empowered to make your own decisions on how to achieve high standards . If you are not inspired, Chipotle might not be the right place for you to work. [3] X Research source"
    },
    {
      "title": "Dress for success.",
      "content": "Dress for success. Groom yourself before you go in; take a shower, brush your teeth, comb your hair, rub on some deodorant, put on a nice outfit, do your makeup if you wish. Make sure you are presentable as that is one of the 13 characteristics they look for when they hire you. You don't need to wear anything formal, but try to look presentable. Ladies, try a skirt and a nice top or a nice pair of pants and a sweater or a casual dress. Wear flats or Mary Janes or nice dress shoes. Gentlemen, try a nice pair of pants with a button up top or a polo."
    },
    {
      "title": "Come in a good mood.",
      "content": "Come in a good mood. Happiness is one of the 13 characteristics they look for when they hire you. Don't pretend to be happy either. Shake your interviewer's hands and introduce yourself. You are likely to have more than one interviewer so shake everybody's hands. If you are being interviewed with other people, introduce yourself to them as well. Smile, and look like you want to be there. [4] X Research source"
    },
    {
      "title": "Answer all questions truthfully.",
      "content": "Answer all questions truthfully. Honesty is one of the 13 characteristics they look for when they hire you. It's better to be honest than to have problems later along the road because you lied."
    },
    {
      "title": "Show that you have high energy.",
      "content": "Show that you have high energy. High energy is one of the 13 characteristics they look for when they hire you. If asked to do icebreaker games or to do group activities, show that you are excited to do them and that you love to be there. Have a good night's sleep before you come in because you can give off a bad impression if you look tired or bored."
    },
    {
      "title": "Think about what you're going to say before you say anything.",
      "content": "Think about what you're going to say before you say anything. Being smart is one of the 13 characteristics they look for during the interview. Make sure you know about the company and thoroughly read through the 'Do Your Research' section of this article. You don't need to memorize anything just yet, but be able to answer questions Chipotle's vision and what high standards , empowerment , and a top performer is. You might also be asked what you are passionate about, and about what makes a person a good or bad leader."
    },
    {
      "title": "Be polite.",
      "content": "Be polite. Being polite is one of the 13 characteristics they look for when they hire you. Wait your turn to answer questions if in a group setting. Say please and thank you whenever needed. Don't fiddle with anything. [5] X Research source"
    },
    {
      "title": "Show that you want to do something with your life.",
      "content": "Show that you want to do something with your life. Being ambitious is one of the 13 characteristics they look for when they hire you. If asked what your dreams are or where you see yourself in five years, don't feel pressured to say anything Chipotle-related if that's not where you see yourself. [6] X Research source Do not answer with \"I don't know\". That answer sounds lazy and gives off the impression that you lack ambition. It's okay to not know, but say something along the lines of, \"As of right now, I don't know where I'll be career-wise, but I'm considering . . . \" and say something you might like to do."
    },
    {
      "title": "Don't treat the interview as a competition.",
      "content": "Don't treat the interview as a competition. There is no reason to put others down. Being respectful is one of the 13 characteristics they look for when they hire you. When you're in a group interview, there is no reason to act like it's you against them. Let others answer their questions and don't hog the spotlight. If the team likes you, they like you. If they don't, then they don't see the 13 characteristics in you and working at Chipotle isn't the right job for you."
    },
    {
      "title": "Ask questions.",
      "content": "Ask questions. Curiosity is one of the 13 characteristics they look for when they hire you. Ask anything that comes to mind during the interview. There's no such thing as a stupid question, especially when you are asking questions about your future as a Chipotle employee. Come in with a list of questions, because coming up with questions on the spot might be difficult. [7] X Research source"
    },
    {
      "title": "Show that you are motivated.",
      "content": "Show that you are motivated. Motivation is one of the 13 characteristics they look for when they hire you. Show you are excited to work at Chipotle and that you are motivated to do well."
    },
    {
      "title": "Show how you can be hospitable.",
      "content": "Show how you can be hospitable. Hospitality is one of the 13 characteristics that the Chipotle team looks for when they hire you. Be kind and friendly to everybody in the room and explain how you love people. If asked how you would handle rude customers, explain that you would be kind to them (if that's true--remember honesty is one of the 13 characteristics)."
    },
    {
      "title": "Be a team player.",
      "content": "Be a team player. Being conscientious is one of the 13 characteristics that Chipotle looks for when they hire you. Chances are, your interview will have group activities. Be able to do your part thoroughly but don't try to steal the show."
    },
    {
      "title": "Be infectiously enthusiastic!",
      "content": "Be infectiously enthusiastic ! That is one of the 13 characteristics that Chipotle looks for when they hire you. Have fun at the interview. Don't be afraid to make a few jokes and make the interview enjoyable for everybody."
    }
  ]
}