{
  "url": "https://www.wikihow.com/Lower-Amylase-Levels",
  "title": "How to Lower Amylase Levels",
  "steps": [
    {
      "title": "Get tested to determine the cause of your elevated levels.",
      "content": "Get tested to determine the cause of your elevated levels. The only real way to lower your amylase levels is to treat the underlying condition that caused them to spike. If a recent blood test showed that you have hyperamylasemia, talk to your doctor to see what additional testing is necessary to determine the cause. [1] X Research source Pancreatitis, tumors, gallbladder infections, kidney infections, and the use of certain medications are all common causes of increased amylase levels. Additional testing may include further blood tests, a urine test, and an ultrasound or CAT scan of your abdomen."
    },
    {
      "title": "Develop a pancreatitis treatment plan with your doctor.",
      "content": "Develop a pancreatitis treatment plan with your doctor. If your elevated amylase levels are caused by pancreatitis , you will need to work with your health care practitioner to develop a treatment and management plan. Initially, you may be asked to fast, take pain medication, and receive IV fluids to manage your inflammation. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Once your pancreatitis is under control, your health care practitioner will help treat the underlying cause. Depending on the cause, treatment may include surgery to remove bile obstructions, gallbladder surgery, pancreas surgery or treatment for alcohol dependence."
    },
    {
      "title": "Work with your doctor to manage cholecystitis.",
      "content": "Work with your doctor to manage cholecystitis. Cholecystitis is an inflammation of the gallbladder, usually caused by gallstones or infection. If your amylase levels are elevated due to gallbladder complications, your doctor may recommend a conservative management plan, pain management for gallstones, and/or surgery to remove your gallbladder. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source A conservative management plan may include fasting to minimize strain on your gallbladder, receiving IV fluids, and taking medication to manage pain symptoms. Gallstone removal isn’t recommended in all cases. Once you have your initial inflammation under control, your doctor may recommend additional testing and analysis to see if removal is recommended."
    },
    {
      "title": "Drink fluids and take antibiotics to manage kidney infections.",
      "content": "Drink fluids and take antibiotics to manage kidney infections. If your elevated amylase levels are due to a kidney infection , your doctor will likely prescribe antibiotics to treat your infection. Take the medication exactly as prescribed by your doctor. In addition, your doctor may recommend additional fluids to prevent dehydration and fever. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source The amount of fluids you need will differ depending on your overall health, your symptoms, and your medical history. Talk to your doctor about the right fluid intake for you. Be sure to take your full course of antibiotics, even if you start feeling better before your course is complete."
    },
    {
      "title": "Seek emergency medical help if your symptoms interfere with daily life.",
      "content": "Seek emergency medical help if your symptoms interfere with daily life. If your symptoms cause extensive diarrhea, abdominal pain, a fever, or rashes, or if they impact your ability to eat, seek immediate medical care. These could be signs of an acute infection or other serious medical conditions that need immediate treatment. [5] X Research source"
    },
    {
      "title": "Stop taking any medication raising your amylase levels.",
      "content": "Stop taking any medication raising your amylase levels. If medications are responsible for your increased amylase, stop taking them or switch to an alternative. If these medications are prescription or if you use them to manage a chronic condition, consult with your health care practitioner prior to stopping. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Medications that may raise amylase levels include opiates, birth control pills, cholinergic medications, thiazide diuretics, asparaginase, aspirin, ethacrynic acid, and methyldopa. [7] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source You may need to get an alternative prescription from your health care practitioner if you take your medication to manage a chronic condition. If you’re taking medication as part of a short-term treatment, it may be better to continue treatment and let your amylase levels return to normal once your course is completed. Talk to your doctor before stopping any prescription."
    },
    {
      "title": "Take a non-steroidal anti-inflammatory (NSAID) drug to manage pain.",
      "content": "Take a non-steroidal anti-inflammatory (NSAID) drug to manage pain. If your amylase levels increased due to pancreatic or gallbladder inflammation, taking an NSAID such as naproxen or ibuprofen can help manage your pain. Take the medication as directed by your doctor, or as otherwise advised on the product packaging. [8] X Research source If you can’t take NSAIDs, you may still be able to take up to 4000 mg of acetaminophen each day. Always talk to your doctor before starting a new medication."
    },
    {
      "title": "Stop consuming alcohol.",
      "content": "Stop consuming alcohol. If your high amylase is caused by excessive alcohol consumption, take steps to quit drinking alcohol immediately. Even if alcohol isn’t the cause of your elevated levels, you should still try to reduce the amount of alcohol you consume. This is because drinking can exacerbate the underlying conditions that cause high amylase. [9] X Research source Ideally, you should avoid drinking altogether if you have high amylase. If you are unable to do that, keep the number of drinks you have per week as low as possible. If you need help managing an alcohol abuse problem, check in your area for support groups, recovery centers, and therapists specializing in addiction. These can offer you support and resources to help you in your journey. [10] X Research source"
    },
    {
      "title": "Eat a healthy, balanced diet rich in fresh produce.",
      "content": "Eat a healthy, balanced diet rich in fresh produce. Eating a healthy diet can help reduce your risk of gallstones and pancreatitis. Strive for a diet that consists of at least 5 portions of fruits and vegetables every day. Opt for whole grains over processed carbohydrates whenever possible. Avoid added sugars and fatty foods with a high cholesterol content. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Always talk to your doctor before you make any major changes to your diet, especially if you are being treated for a chronic health condition."
    },
    {
      "title": "Maintain a healthy weight.",
      "content": "Maintain a healthy weight. Both obesity and restrictive eating disorders such as anorexia and bulimia can increase your chance of gallstones and kidney complications. Try to maintain a healthy weight to reduce this risk. Depending on your lifestyle and medical history, this may involve modifying your diet, getting regular exercise, and making other lifestyle adjustments. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Everyone’s caloric needs and exercise plans will vary. There’s no one-size-fits-all diet or exercise routine. Talk to your health care practitioner or a registered dietitian about finding the right mix of diet, exercise, and lifestyle adjustments for you. While losing weight is important if you are obese, be sure to avoid very low-calorie diets, as these may actually increase your risk of gallstones."
    },
    {
      "title": "Quit smoking.",
      "content": "Quit smoking. Along with consuming alcohol, smoking greatly increases your risk of pancreatitis. If you currently smoke, including marijuana and e-cigarettes, take steps to stop smoking immediately. Look for local quitting support groups, and seek help from an addiction therapist if necessary. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you are in the U.S., you can call the Center for Disease Control’s national Quitline at 1-800-QUIT-NOW (1-800-784-8669) to get connected with resources in your area."
    }
  ]
}