{
  "url": "https://www.wikihow.com/Know-When-a-Girl-is-Hiding-Something",
  "title": "Signs She Is Hiding Something (And How to Confront Her about It)",
  "steps": [
    {
      "title": "She avoids certain topics.",
      "content": "She avoids certain topics. Do you notice that every time you bring up a specific topic or person, she gets shifty? Maybe she quickly changes the subject, or stops replying if you two are texting. This could mean that she doesn’t want to talk about something related, so she’s avoiding it all together. [1] X Research source Does her demeanor change when a particular subject is brought up? Does the change occur when a certain person is around? Does she seem to feel uncomfortable when she is in a specific location? Is there an upcoming event that she does not want to discuss?"
    },
    {
      "title": "She is fidgety or nervous when talking about something.",
      "content": "She is fidgety or nervous when talking about something. Take note of anytime she can't stop moving or seems anxious when you bring up a topic. This is a telltale sign that she's hiding something or doesn't want to talk about a certain subject. [2] X Research source Other signs of nervousness include: She seems to be thinking really hard [3] X Research source Her eyes frequently flickering toward an exit [4] X Research source She frequently pauses when giving responses [5] X Research source She changes the subject abruptly She crosses her arms across her chest or protects other vulnerable areas, like her throat She shares too many details She leans backward, as if trying to physically distance herself [6] X Research source There's a stillness in her arms and legs [7] X Research source There's a lack of emphatic gesturing [8] X Research source She stops using “I” statements and refers to people by names instead of “him” or “her” [9] X Research source She avoids answering questions completely [10] X Research source She clears her throat and swallows hard frequently [11] X Research source"
    },
    {
      "title": "She becomes more protective of her phone.",
      "content": "She becomes more protective of her phone. Maybe she used to have no problem with you grabbing her phone to look up a song or take a quick pic. If she’s hiding something, she might change the passcode to something you don’t know or take her phone with her wherever she goes. This is probably because there’s something on her cell that she doesn’t want you to see. [12] X Research source She might also turn the screen away from you when she’s texting, or keep her phone on silent so it doesn’t ring when someone calls her."
    },
    {
      "title": "She seems absent-minded or distracted.",
      "content": "She seems absent-minded or distracted. Maybe you’re telling a funny story, when you look over and see she’s deep in thought. Or maybe you ask her a question, and all she can answer is, “Hmm?” If she’s got other stuff on her mind that she doesn't want to share with you yet, she might be thinking about that instead of what’s in front of her. [13] X Research source She might also start leaving her belongings behind in public places, or forgetting to do simple tasks and chores."
    },
    {
      "title": "She gets angry or annoyed easily.",
      "content": "She gets angry or annoyed easily. If she’s hiding something that’s making her upset, she might be struggling to keep that anger in. You may notice that she blows up at small things, or gets mad at you for simple mistakes. These are signs that she’s struggling with something internally (that may or may not have to do with you). [14] X Research source"
    },
    {
      "title": "Other people notice a change in her behavior.",
      "content": "Other people notice a change in her behavior. Ask a mutual friend's opinion on your suspicions. Choose someone who knows both of you and ask your friend if they have noticed the same odd behavior. If this friend has noticed something off, they might be able to make sense of her behavior."
    },
    {
      "title": "Something just seems off about her.",
      "content": "Something just seems off about her. If this is someone that you spend a great deal of time around, you will likely become aware pretty quickly that something seems different or off. Make a mental note and continue making observations about when she seems different than she usually does. [15] X Research source This can be a tough one to quantify, but you’ll know it when you see it: maybe she’s not as bright and bubbly as she usually is, or maybe she’s being overly nice to you when she’s usually more subdued."
    },
    {
      "title": "Consider the severity of what she seems to be hiding.",
      "content": "Consider the severity of what she seems to be hiding. As you observe her behavior and what triggers it, think about what she might be hiding and how serious it is. If you think it’s something small or trivial, it may not be worth it to confront her about it. [16] X Research source If you are in a relationship with her, then perhaps she is hiding that she is cheating or that she picked up a bad habit she promised she would quit, like smoking. Or, if she is a friend, maybe she is hiding something that was said about you behind your back. There is always the chance that she is hiding something positive, like a surprise gift or party. It’s important to give her the benefit of the doubt."
    },
    {
      "title": "Write down your suspicions beforehand.",
      "content": "Write down your suspicions beforehand. Creating a list of your suspicions, or detailing one big suspicion, will help you to both look and feel more prepared as you confront her. It also gives you the opportunity to refer to what behaviors, words, or actions made you come to these conclusions. Include anything strange about her behavior, including things she has said, ways she has acted, and odd behaviors she has displayed. Note your observations about what topics or people seem to trigger these changes in her demeanor."
    },
    {
      "title": "Find a quiet time to talk to her.",
      "content": "Find a quiet time to talk to her. If she’s your significant other, talk to her at home. If you two are just friends, go out to lunch or find a quiet cafe to sit down and chat. [17] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source If you’re making plans in advance, don’t tell her that you want to talk about her behavior. Instead, just invite her to hang out so she doesn’t have her guard up."
    },
    {
      "title": "Bring up the topic calmly and rationally.",
      "content": "Bring up the topic calmly and rationally. Do your best to diffuse the situation by remaining calm. [18] X Expert Source Maya Diamond, MA Relationship Coach Expert Interview. 17 January 2019. Keep your tone of voice level, and state your concerns in a way that doesn’t accuse her or make her feel like the bad guy. However, this doesn’t mean that you should be evasive or vague about what you’re getting at. Be clear and straightforward about her secrecy so that she fully understands the conversation. “I get the feeling lately that you're keeping something from me. My relationship with you is important to me, so I'd like to talk about it.” “You've had some interesting reactions to comments I've made lately. I don't want to offend you, but it seems like you might be keeping a secret. Can we talk about it?” “I've noticed recently that you've been extremely nervous most of the time I've been around you. Is something going on that you would like to talk about?”"
    },
    {
      "title": "Explain your thoughts and observations to express your concerns.",
      "content": "Explain your thoughts and observations to express your concerns. You are having this conversation with her because you are concerned about what is going on, and you want to resolve it, so help her understand that with your words and gestures. [19] X Expert Source Maya Diamond, MA Relationship Coach Expert Interview. 17 January 2019. Bring up examples in a kind, non-accusatory way. “I've noticed lately that when Bryan is around, you become distant and closed-off. I'm wondering what has happened to bring on this change in you toward him? I'm here to help you.” “Recently, you've become a little secretive when we talk about our plans with other people. I'm concerned, and I want to know if there's something that you need to tell me.” “The last time that we were in Mrs. Smith's class, you seemed really jumpy and fidgety. I'm here for you if you want to talk about what happened to cause that.” “You told me the other night that you stayed in and read a book until you fell asleep, but Stacy said that the two of you went out dancing. I'm hurt that you lied to me, and I'm wondering why you felt the need to do that.”"
    },
    {
      "title": "Listen attentively",
      "content": "Listen attentively to her response. Remember to stay calm , and give her the opportunity to respond to you without interrupting. If she continues to appear secretive, let her know that you are observing particular behaviors that indicate she might be lying, like an inability to maintain eye contact, making frequent pauses in her response, or giving too many details. Then, ask her again to be honest with you. [20] X Research source “I heard you say that...” “I understand that you feel...” “I appreciate that you agreed to talk about this with me, but I get the sense that you're still not being completely honest. Can you share the whole truth with me?” “I'm really glad that we're getting the opportunity to talk about this. However, it seems like you have more you want to say but haven't yet. Go ahead and share.” If she continues to withhold what is really going on, consider the value of this friendship or relationship. What does it say about your relationship with her if she will not tell you the truth?"
    },
    {
      "title": "Give yourself time to process what she shares.",
      "content": "Give yourself time to process what she shares. In the event that she does share with you what she has been hiding, give yourself some time to think it over, especially if it’s something negative. [21] X Expert Source Maya Diamond, MA Relationship Coach Expert Interview. 17 January 2019. You might ask her to give you some space or request that you don’t talk to each other for a few days so that you can gather your thoughts. “I really appreciate you sharing with me. I have to admit that my feelings are a little bit hurt. I’m going to collect my thoughts, and I’ll reach out in a couple days when I’m ready to talk more.” Consider her reasons for hiding it from you and the validity of those reasons. Should she have been honest with you from the beginning, or is her secrecy understandable? Evaluate the relationship, whether it was right of her to hide information from you, and what can be done to repair any hurt that was caused."
    }
  ]
}