{
  "url": "https://www.wikihow.com/Make-a-Medusa-Costume",
  "title": "How to Make a Medusa Costume",
  "steps": [
    {
      "title": "Curl your hair.",
      "content": "Curl your hair. This look works best is you start with wavy hair. There are numerous ways to curl your hair. For a long-lasting curl, use a curling iron or foam hair rollers. A curling iron works on most hair textures, but women with especially fine hair may need to use rollers in order to get a lasting wave. You could also add a wave to your hair using braids. Braid your hair into multiple pigtails and wear the braids overnight, or at least for several hours before the event. Unravel the braids and comb them lightly to separate them into waves. The more braids you use, the wavier your hair will be. Create beach waves by applying a thorough coating of hair gel to your hair. Working in sections, push the tips of your hair to the base of your head, allowing the hair to fold on itself as you work. The gel will continue to look wet even after it dries, but it will hold waves for a few hours. Spray hair with green hairspray. Note that if you have short hair or would like an easier option, you could also buy a green wig with a long, wavy hairstyle."
    },
    {
      "title": "Attach 15 large rubber snakes to a wig.",
      "content": "Attach 15 large rubber snakes to a wig. Bind the rubber snakes to the wig with green craft wire and hot melt glue. [1] X Research source Place one snake across the wig, letting the head fall to the side. Keep the snake's body looking \"wavy\" rather than straightening it out. Tie it in place by wrapping wire around it. Attach another snake to the wig, arranging its head to face in the opposite direction. Tie the remaining large snakes to the wig by punching holes into the wig and gluing them in place, also using more wire. Arrange the snakes so that they are balanced on both sides of your head but not perfectly symmetrical."
    },
    {
      "title": "Place the wig on your head.",
      "content": "Place the wig on your head. Arrange the attached snakes as necessary so that they are not falling in front of your face. Note that you may need to hold the snakes in place by tying them to your head with wire."
    },
    {
      "title": "Tie smaller rubber snakes directly to your wig.",
      "content": "Tie smaller rubber snakes directly to your wig. If your head is not already overwhelmed by rubber snakes, tie a few more snakes directly to your wig by twisting wire around the small snakes and locks of your wig hair. Hide the wire underneath your hair, if possible."
    },
    {
      "title": "Check yourself in the mirror.",
      "content": "Check yourself in the mirror. Make any necessary adjustments to the curls and snakes in your hair, holding them in place using hairspray, wire, and hot glue as needed."
    },
    {
      "title": "Braid your hair.",
      "content": "Braid your hair. Create many small braided ponytails, using all your hair. You should aim for at least 10 to 12 braids, but the more braids you have, the better. If you have short hair, you can add hair extensions or use a wig. You could also use a wig if you have long hair but want something that will be easier to work with. Simply braid and work with the wig before placing it on your head. Tie each braid off with a small elastic or rubber band."
    },
    {
      "title": "Leave your hair down or pin it up.",
      "content": "Leave your hair down or pin it up. The simplest option is to leave your hair down, but for a more elegant look, you can also pin your braids into a bun at the top of your head. For a more traditional, snake-covered style, leave your hair down. For something a little more classy and subdued, wrap the braids into a bun and pin it to the top of your head."
    },
    {
      "title": "Weave the snakes into your hair.",
      "content": "Weave the snakes into your hair. Wrap small rubber snakes in between your braids, tying them in place with additional elastic bands when needed. If wearing your hair down, wrap one to three snakes around each braid. If you have a smaller number of braids, go for three snakes per braid. If you have a large number of braids, stick with one snake per braid. Weave the snakes in between the braids and tie them loosely in place with the elastics. Make sure that some are looking up toward the top of your head while others are hanging their heads down. If wearing your hair up, weave anywhere from four to six snakes into the braids. [2] X Research source Some snakes should face outward while others should hang down. Secure dangling snakes in place by tying a thread to a bobby pin and poking that thread into the snake with a sewing needle. Slide the pin into your hair and adjust as needed to hold the snake."
    },
    {
      "title": "Wear a Grecian-style dress.",
      "content": "Wear a Grecian-style dress. For the simplest approach, buy a Greek goddess costume from the store or wear a Greek-inspired white dress. A Grecian-style dress is traditionally very long, straight and column-like, but it is made from fabric that drapes well and appears very “flowy”. The dress may come over both shoulders or over one shoulder, and it may or may not have sleeves. It usually has some sort of band across the waist. For a more modern, attractive twist, opt for a one-shoulder dress made of draping, flowing fabric that stops just above the knee. [3] X Research source"
    },
    {
      "title": "Create a no-sew \"peplos\" dress.",
      "content": "Create a no-sew \"peplos\" dress. A peplos gown is a type of ancient Greek gown that was long and worn only by women. Fold a white sheet or large piece of material in half. The width should be a little less than twice the length of your arm span, and the length of the material should be equal to your height plus 18 inches (46 cm). Fold it in half so that it reaches from elbow to elbow. Fold the top 18 inches (46 cm) over. Wrap the fabric around you. The folded portion should be just below your arms, and one side should be open. Fasten the fabric at your shoulders. Bring up enough of the fabric on both sides so that it overlaps on each shoulder. Hold it in place by knotting it or by fastening it with decorative brooches or safety pins. Fasten together the open side. Bring the material together so that it overlaps, and hold it in place with safety pins or by knotting it in several places along the side. If desired, you could also tack it in place with a needle and thread. Tie a belt around your waist. You can either use a white sash or a decorative gold metal belt. Pull extra material up so that it hangs gently and loosely over the belt."
    },
    {
      "title": "Sew an easy \"chiton\" dress.",
      "content": "Sew an easy \"chiton\" dress. The ancient Greek chiton was worn by men and women, and it could be short or long. Use white material, like a sheet, that is twice the length of your arm span and equal to your height. For a shorter chiton, use material that is a little shorter than your height. Fold the material in half. Fold the width of the material in half so that it extends from fingertip to fingertip. Do not alter the height. Sew along the open seam at your side. Turn the fabric inside-out and use a straight stitch or backstitch to create a sturdy seam along the open side of the garment. Then turn the fabric right-side-out again. Slip it on and secure the open top. While the top is still open, the garment should fall just below your arms. Leave enough of a gap for your arms and head to fit through, but join the rest of the top edge together with brooches, safety pins, or knots. You could also tack the top edge together with a needle and thread at various points. The points at which the top edge come together should be connected to each other by draping arches of fabric, revealing the skin of your shoulders and arms in between each spot. Do not overlap the fabric into a single straight, solid line over your arms. Tie a belt around your waist. Use a white sash or gold metal belt. Pull a little extra material over the belt so that it hangs over slightly."
    },
    {
      "title": "Highlight your eyes and lips.",
      "content": "Highlight your eyes and lips. You can use heavy make-up for this outfit, covering your entire face with thick coats of gray and green greasepaint. Apply large black circles around your eyes, insert yellow fright-contact lenses, and stage blood to your mouth. Keep in mind that Medusa should be as beautiful as she is horrifying. Apply make-up so that it looks freaky, scary, and very morbid. Use green foundation, As one who lived in relative darkness, Medusa would not have had bronze skin or rosy cheeks. Instead, she would have been fairly pale, with cracked skin that is peeling from her face. Draw attention to your eyes by applying more heavy black eyeliner and black mascara. You can use dark eyeshadow to make your eyes look gaunt, or you could use a bolder metallic shade of green or purple for something a little more subdued and crazy. Use either black lipstick or red lipstick. Go for black lipstick if you want something spooky. To emphasize the more alluring aspect of Medusa, use bright red or deep red lipstick. Apply tooth black out to make your teeth look authentic and decayed."
    },
    {
      "title": "Add horrifying scales.",
      "content": "Add horrifying scales. Use facial paint to draw small scales around the top of your forehead, the edges of your face, and along the sides of your hands and feet. You could also use black or green eyeliner to draw the scales, or for 3D effect, cut scales from colored construction paper, and apply with water and flour mixture, or cellophane tape. Note that this is strictly optional. Even without the use of scales, you should still clearly resemble Medusa."
    },
    {
      "title": "Carry around other snakes.",
      "content": "Carry around other snakes. You could wear a large rubber snake around your shoulders or waist, or weave a smaller one around your fingers. Hold a rubber snake in each hand, or glue using skin-adhesive squares. If wrapping a large snake around you, make it large enough so that it coils around you without needing to be held in place."
    },
    {
      "title": "Opt for simple footwear.",
      "content": "Opt for simple footwear. Flat, gold or beige sandals work best. Paint all exposed skin with green tempera paint (non-toxic)."
    },
    {
      "title": "Use a lot of jewelry.",
      "content": "Use a lot of jewelry. Antique-looking earrings, bracelets, or brooches can be worn, but don't worry about getting too fancy or too gaudy because the Medusa was a hedonistic demon."
    }
  ]
}