{
  "url": "https://www.wikihow.com/Make-Hips-Smaller",
  "title": "How to Make Hips Smaller",
  "steps": [
    {
      "title": "Include regular cardio exercises each week.",
      "content": "Include regular cardio exercises each week. [1] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. Regardless of what area of your body you want to make smaller, cardio exercises of all types will help support weight loss. Most health professionals recommend including at least 150 minutes or about 2 1/2 hours of moderate-intensity cardio activities each week. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source In addition to supporting weight loss and toning different parts of your body, cardio has also been shown to help better manage diabetes or high blood pressure, improve your sleeping patterns and even improve your mood. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Try any cardio activity like running, dancing , swimming , hiking or biking. Reader Poll: We asked 157 wikiHow readers if they found cardio effective for losing weight, and 73% of them said yes. [Take Poll]"
    },
    {
      "title": "Go running.",
      "content": "Go running . Running is a great cardiovascular exercise. It burns a significant amount of calories per hour and primarily uses your thigh muscles for power. Running can build not only cardiovascular endurance but also builds muscular strength and endurance. Professionals suggest running for at least 20 minutes per session to help tone and slim down your thighs."
    },
    {
      "title": "Take the stairs",
      "content": "Take the stairs . Stair climbing requires hard work from the hip flexors, quads and lower abs. In addition, this exercise burns a significant amount of calories per minute. Add a two to five minute stair run or five to ten minute stair walk three times per week. Or try using the stair master at your gym for at least 20 minutes. Doing stairs not only helps burn calories and fat, it's also a great exercise to tone your legs and buttocks."
    },
    {
      "title": "Take a spin class.",
      "content": "Take a spin class. Many cyclists are known for their great legs. Cycling is a great exercise that torches calories and is great for sculpting your legs. Cycling works a large variety of your leg muscles including your hamstrings, quadriceps, calves, abductors and glutes. It's a very well rounded workout for your legs. In addition, cycling is great for those with knee injuries or knee pain as this is a higher intensity, but low-impact exercise."
    },
    {
      "title": "Go to a kickboxing class.",
      "content": "Go to a kickboxing class. Kickboxing is an aerobic class that uses many moves from martial arts. It's great for toning both the upper and lower body. Kickboxing is also known for burning a large amount of calories per hour. It's a great class to incorporate to help burn calories and decrease your overall body fat. Kickboxing uses a variety of kicks that use almost every muscle in your legs. This is another workout that will help tone your thighs in addition to your lower legs."
    },
    {
      "title": "Incorporate regular strength training exercises.",
      "content": "Incorporate regular strength training exercises. In addition to cardio, it's important to include regular strength and resistance training exercises. There are many exercises that can help you strengthen your thighs and buttocks. Remember that muscle takes up less space than fat, so strengthening leg muscles will only improve the appearance of your hips and thighs. Focus on performing a high number of repetitions, working through a comfortable range of motion. Consider doing fast exercises for your legs like jumping moves, leg lifts, high knee jogs and heel kick backs. Quick movements work different muscle fibers than slow movements. Slow power and strength moves — like weighted squats, deadlifts and lunges — will work the rest of the muscle fibers in the hips. Strength training exercises do not burn as many calories compared to cardio, but will help build and tone muscle mass. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source In addition, the more muscle mass you build over time, the more calories your body burns at rest. Incorporate about two to three days of strength training each week. If you're focusing specifically on your hips and thighs, make sure you have a rest day between days you target those muscles. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Do a hip bridge series.",
      "content": "Do a hip bridge series. The bridge exercise pose is a common activity that helps tone your lower back, stomach, buttocks and most importantly, your hips. [6] X Research source Lie on your back, bend your knees and keep your feet hip-width apart. Focus on keeping a neutral spine. Contract your stomach muscles. Lift your hips slowly until you form a plank from your shoulders to your knees. Hold the position for three seconds and slowly lower down to the floor. Repeat 10 to 20 times. To increase the intensity of this exercise, hold the elevated position and lower your hips down one inch (2.5 cm) and then move your hips back up. Do this for one minute. Then, lower your hips down."
    },
    {
      "title": "Do squats",
      "content": "Do squats . [7] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. This exercise helps tone your lower body but especially targets your hips and thighs. Stand with your legs hip-width apart. Contract your ab muscles and place your weight in your heels. Sit back as if you are sitting into a low chair. Keep your knees behind your toes. Do the posture sideways next to a mirror to check your form. Pause for three seconds at the lowest point you can squat. Push through your heels and rise to a standing position. Repeat 10 to 20 times."
    },
    {
      "title": "Do curtsy lunges.",
      "content": "Do curtsy lunges . The curtsy lunge is a modified one-legged squat. It requires extra work from your hips to perform making this a great exercise to tone your hips and thighs. Stand with feet hip width apart. Reach your right foot back behind your left foot as though you are going to curtsy in front of royalty. Bend both of your knees and squat. Try to bring your right leg as low to the ground as you can. Contract your muscles throughout and keep your back straight. You should not pitch forward. Repeat 10 to 20 curtsies on each side."
    },
    {
      "title": "Do sidestepping.",
      "content": "Do sidestepping. This exercise helps target the outside of your hips specifically. It's great for toning and strengthening the outside of your thighs. Find a resistance band that is a small circle. Step into it and pull it up above your knees. It should have some resistance when you step to the side. Sidestep as far out to the right as you can. Bring your left leg to meet your right very slowly. Sidestep back the other direction, allowing your left leg to lead. Repeat between 10-20 exercises in each direction."
    },
    {
      "title": "Cut calories.",
      "content": "Cut calories. In order to make your hips and thighs smaller, you'll need to reduce your overall body fat. You cannot spot treat this area, so following a calorie restricted meal plan will help reduce the fat in your hips, thighs and overall body. You typically want to aim for slower, more safe weight loss. This generally equates to about 1-2 pounds weekly. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Cut out about 500-750 calories from your current eating plan. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This will generally result in safe, gradual weight loss. Use a food journal or online app to get an idea of how many calories you currently eat each day. This will help you determine a calorie limit that will result in weight loss."
    },
    {
      "title": "Make most of your meals protein and produce.",
      "content": "Make most of your meals protein and produce. There are a variety of dieting styles on the market. Studies, however, show that lower carb diets result in the quickest amount of weight loss and fat reduction. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you're following a lower carb diet, most of your meals should be protein, vegetables, and some fruit. This combination of foods will also provide you with enough nutrients to maintain a nutritious diet. Include a source of lean protein at each meal. [11] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. Aim for a 3-4 oz serving at most meals and snacks (about the size of a deck of cards). [12] X Research source This will help you reach your daily recommended amount. Also include about one to two servings of fruit daily (1/2 cup chopped or one small piece) [13] X Research source and four to five servings of vegetables each day (1 cup chopped or 2 cups loose leafy greens). [14] X Research source Examples of lower carb meals featuring mostly protein and produce include 1 cup cottage cheese and sliced fruit, 1/4 cup of hummus with sliced raw veggies, or a grilled chicken salad."
    },
    {
      "title": "Limit higher carb foods.",
      "content": "Limit higher carb foods. If you're following a lower carb diet to help reduce body fat and trim down your hips and thighs you'll want to monitor the total amount of carbohydrates you consume each day. Carbs are found in a wide variety foods including fruits, dairy products, starchy vegetables, legumes, and grains as well as in sugar and sweetened drinks like soda or energy drinks. Foods like dairy products or fruit offer a lot of other beneficial nutrients outside of carbohydrates (like fiber and protein). Include minimal servings of these. It's not recommended to completely avoid these foods. [15] X Research source Limit the grain food group the most. Many of the nutrients found in this group can be consumed from other foods. Limit items like bread, rice, pasta, bagels, and crackers."
    },
    {
      "title": "Drink adequate fluids.",
      "content": "Drink adequate fluids. Maintaining adequate hydration is essential for any balanced diet, but especially so if you're working out more often. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Most health professionals recommend consuming at least eight to thirteen glasses of fluids each day. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You may need more fluids depending on how active you are. It's also recommend to drink enough fluids to replace what you've lost in sweat during your exercise. Choose caffeine and sugar free fluids like water, flavored water, decaf coffee, and decaf tea."
    }
  ]
}