{
  "url": "https://www.wikihow.com/Make-Paper-Cups",
  "title": "How to Make Paper Cups",
  "steps": [
    {
      "title": "Use 1 piece of origami paper if you don’t want the cup to hold liquid.",
      "content": "Use 1 piece of origami paper if you don’t want the cup to hold liquid. The standard size of origami paper is 6 in × 6 in (15 cm × 15 cm) and you can purchase this from department and craft stores. Begin with the colored side facing down. [1] X Research source This will create a small cup that is suitable for holding small objects and dry foods. Origami paper isn’t able to hold liquid for more than 1 second. If you want to make more than 1 paper cup at a time, you will need 1 extra piece of origami paper for each cup. If you don’t have origami paper, measure out a 6 in × 6 in (15 cm × 15 cm) square on regular paper and cut it to size. [2] X Research source"
    },
    {
      "title": "Use greaseproof paper to make a cup that holds liquid.",
      "content": "Use greaseproof paper to make a cup that holds liquid. Measure out one 6 in × 6 in (15 cm × 15 cm) square of greaseproof paper and cut it to size. This paper cup will be more water-resistant than a cup that is made out of origami paper. [3] X Research source Alternatively, you can use foil paper instead. [4] X Research source"
    },
    {
      "title": "Fold the paper in half to create a triangle.",
      "content": "Fold the paper in half to create a triangle. Bring 1 corner of the paper over to the opposite, diagonal corner. Make sure that all of the corners and edges line up. Press down on the paper to create a fold. Press the creases with your thumbnail to ensure clean folds, and make sure you’re folding on a flat surface for the best results. [5] X Research source Try to make the creases as strong as possible. This helps to hold your paper cup in shape."
    },
    {
      "title": "Fold the top corner of the triangle to the base to create a crease.",
      "content": "Fold the top corner of the triangle to the base to create a crease. Face the base of the triangle towards you. Bring the top corner down to the base from the side so that the edges line up. Press down on the paper to form a crease and then return the top corner back to its original position. [6] X Research source This step is just about creating a crease. The crease runs from a base corner to approximately the center of the opposite edge."
    },
    {
      "title": "Bring the base corner to the crease on the opposite edge.",
      "content": "Bring the base corner to the crease on the opposite edge. Line the tip of the base corner up with the crease along the opposite edge of the triangle. Push down on the paper to create a neat fold. [7] X Research source If you folded the top corner down to the base from the left in the previous step, then you need to fold the left base corner to the crease on the right side edge. Similarly, if you folded the top corner down from the right, then you need to fold the right base corner to the crease on the left edge."
    },
    {
      "title": "Fold the other base corner up to the opposite edge.",
      "content": "Fold the other base corner up to the opposite edge. Bring the second base corner up so that it lines up with the top edge of the fold that you just made. Press down on the paper to form another fold. [8] X Research source The paper will be shaped like a pentagon."
    },
    {
      "title": "Bend the 2 triangles at the top downward.",
      "content": "Bend the 2 triangles at the top downward. The top of your pentagon shape will have 2 triangles. Bend each one outward and towards the base of the pentagon. Push down on each fold to create a crease. [9] X Research source This creates the opening for the cup."
    },
    {
      "title": "Open the cup outwards.",
      "content": "Open the cup outwards. Gently squeeze the sides of the cup so that the paper at the top of the cup spreads apart. Place your fingers inside the cup and gently push the paper outwards from the center. [10] X Research source When the cup is open, you may need to press gently on the outer edges to create light folds to help the cup to stay open. [11] X Research source"
    },
    {
      "title": "Push the base of the cup in slightly to flatten it.",
      "content": "Push the base of the cup in slightly to flatten it. The base of the cup will be pointed, which means that it cannot balance upright. Gently push the paper at the base inward slightly to make the base flatter so that it is able to balance on a flat surface. [12] X Research source You don’t have to do this if you don’t need your cup to balance anywhere. However, this is recommended if you want your paper cup to be able to hold liquid."
    },
    {
      "title": "Press the corners of the base flat against the cup.",
      "content": "Press the corners of the base flat against the cup. Once the base of the cup is flat, push the 2 small, pointed corners flat against the base. You may find it easier to do this with 1 hand inside the cup, creating a solid surface for you to fold the corners up against. [13] X Research source"
    },
    {
      "title": "Fill the cup with a beverage or use it to store small items.",
      "content": "Fill the cup with a beverage or use it to store small items. If you made your paper cup with greaseproof paper or foil, then it is now ready to have liquid added. Carefully pour a small amount of liquid into the cup. Alternatively, if your cup is made with origami paper, fill it with small trinkets or snacks. Origami cups are great for storing coins, paperclips, and candy. [14] X Research source If you are putting liquid into your cup, you will need to drink it relatively fast as the cup is only water-resistant rather than watertight. Try to drink your beverage within 30 minutes. Your paper cup may hold liquid for a longer or shorter period of time depending on how tightly and accurately it has been folded. Never put hot beverages into your paper cup. Origami paper cups are also commonly used for storing small stuffed animals, pens, flowers, and small children’s toys."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}