{
  "url": "https://www.wikihow.com/Make-a-Phone-Call",
  "title": "9 Ways to Make a Phone Call: Full Step-by-Step Guide",
  "steps": [
    {
      "title": "Open the \"Phone\" application.",
      "content": "Open the \"Phone\" application. This app will usually resemble an image of a phone and be located on the home screen of your device. This method applies to smartphones (like Android and iPhone) and other cell phones. [1] X Research source Other or older models of cell phones may have their phone \"application\" located as a button or key on the phone. Cell phones are great for both social phone calls and business phone calls !"
    },
    {
      "title": "Dial the number you want to call.",
      "content": "Dial the number you want to call. In your application or on your phone's keypad, dial the number you want to call. Make sure the phone number consists of all necessary numbers, such as the number's area code. [2] X Research source Press \"Call\" to begin your call. This is usually a green button with a phone icon on it. If you’re making an international call , make sure to include the country code at the beginning of the phone number. It's important your cell phone has service and is able to make calls. If you have not purchased a cell phone plan or a working subscriber identity module (SIM) card inserted in your mobile phone, you will not be able to make calls on your cell phone."
    },
    {
      "title": "Call an existing contact.",
      "content": "Call an existing contact. On your phone, open the \"Contacts\" app. A list of saved contacts will appear and you can find the name of the person you want to call. Here you can view the contact's information to find out their number and to call them. [3] X Research source Some smartphones will have a phone symbol located beside your contact's name or number. Simply press the symbol to dial the number. Some mobile phones will display an option to call the contact. Select this option to begin your call. Check out our guide on how to start a phone conversation for communication tips."
    },
    {
      "title": "End the phone call.",
      "content": "End the phone call. You can end a call by waiting for the other person on the line to hang up or by touching the “end call” button on your phone. [4] X Research source Most buttons that end calls will be red. They typically show a phone facing down. With flip phones, you can simply flip the phone closed to hang up."
    },
    {
      "title": "Make sure the phone is working.",
      "content": "Make sure the phone is working. You will need to check a couple of things to make sure your phone can function: Check to see that the phone line from the phone set is plugged into a phone jack in the wall. Make sure you are covered by a phone company. In order to make any calls, your phone line must be covered and activated by a phone company."
    },
    {
      "title": "Remove the handset.",
      "content": "Remove the handset. Phone sets can come in all shapes and sizes, but most will have a handset that can be removed from the rest of the device so that you can hold it to your ear and mouth. If the receiver piece does not have a keypad on it, it should be connected to a second device with a keypad and receiver dock. Ensure your receiver is connected to a dock. Portable landline phones will have their own docking station to be charged but otherwise do not need to be connected to it at all times."
    },
    {
      "title": "Wait for a dial tone.",
      "content": "Wait for a dial tone. After you have picked up the handset, hold it to your ear and make sure that you hear the continuous buzzing sound that tells you that you are able to make a call. Portable landline phones will have a button you will need to press to start a call. In most phones, this button will be green or labeled \"Call\" or \"Dial\"."
    },
    {
      "title": "Dial the number you want to call.",
      "content": "Dial the number you want to call. Depending on the type of phone you have, you can do this by pressing buttons on the handset or keypad. Make sure your phone number consists of all necessary numbers such as the number's area code. Your call should automatically go through after you complete dialing. A ringing tone should sound. If the call doesn’t start automatically, press the call button on the handset. If you want to add an additional person, see our guide on making a three-way phone call ."
    },
    {
      "title": "Hang up.",
      "content": "Hang up. When you are done with your conversation, hang up the phone. This may be different for different models of phones. Some phones have a hang-up button (often colored red), while others must be placed back into the cradle on the phone set. If you do not hang up properly or forget to, you will hear a beeping sound that tells you to. If you’re ending a business call, make sure to speak professionally . According to etiquette coach Tami Claytor, you should also thank the individual for their time."
    },
    {
      "title": "Open the FaceTime app.",
      "content": "Open the FaceTime app. This iPhone and iPad app has a white video camera icon on a green background. FaceTime allows you to make video and phone calls with other users who have an Apple device (iPhone, iPad, Mac)."
    },
    {
      "title": "Tap New FaceTime.",
      "content": "Tap New FaceTime . This is a green button in the top right of the FaceTime app."
    },
    {
      "title": "Type in the name of the person you want to call.",
      "content": "Type in the name of the person you want to call. A list of contacts matching that name will appear."
    },
    {
      "title": "Tap the person you want to FaceTime with.",
      "content": "Tap the person you want to FaceTime with. This will add this person to the “To:” section at the top of the app. You can add additional people to FaceTime with multiple individuals at the same time."
    },
    {
      "title": "Tap FaceTime.",
      "content": "Tap FaceTime . It’s the green button above the keyboard in the FaceTime app. This will start the FaceTime call and send an invite notification to the people in the “To:” list. [5] X Research source"
    },
    {
      "title": "Go to voice.google.com.",
      "content": "Go to voice.google.com . If you're not already signed in, you can sign in with your Google account by clicking Sign in in the upper-right corner. If you've never used Google Voice before, follow the on-screen instructions to set up your Google Voice number."
    },
    {
      "title": "Click the Call tab.",
      "content": "Click the Call tab. It's on the left-hand side."
    },
    {
      "title": "Choose a contact or dial a number.",
      "content": "Choose a contact or dial a number. You can choose a number from your contacts list or your recently called numbers or dial their number using the keypad on the screen. [6] X Research source"
    },
    {
      "title": "Open the Google Voice app.",
      "content": "Open the Google Voice app. If you don't have the Google Voice app, you can download it from the App Store or Google Play Store . If you aren't signed in, sign in when you launch the app and follow the on-screen instructions to set up your Google Voice number."
    },
    {
      "title": "Tap Calls.",
      "content": "Tap Calls . It's at the bottom of the screen."
    },
    {
      "title": "Choose a contact or dial a number.",
      "content": "Choose a contact or dial a number. You can choose a number from your contacts list or recently called numbers or dial their number using the keypad on the screen. [7] X Research source"
    },
    {
      "title": "Launch Phone Link.",
      "content": "Launch Phone Link. Phone Link comes preinstalled on Windows 11 PCs and allows you to connect your Android or iPhone to your Windows computer via Bluetooth. [8] X Research source To launch Phone Link, search for it using the taskbar search bar, then click Phone Link . To use this method, you must have Bluetooth on your phone and computer."
    },
    {
      "title": "Click iPhone or Android.",
      "content": "Click iPhone or Android . Choose the option that matches the phone you have. To take advantage of all of Phone Link's features, your iPhone must be on iOS 15 or later, and your Android must be on Android 8 or later."
    },
    {
      "title": "Scan the QR code with your camera.",
      "content": "Scan the QR code with your camera. If you can't scan the QR code, click Continue manually without a QR code and follow the on-screen instructions for how to set up Phone Link."
    },
    {
      "title": "Follow the instructions on your device to set up Phone Link.",
      "content": "Follow the instructions on your device to set up Phone Link. This will involve allowing your phone to connect to your computer via Bluetooth. When prompted, click/tap the Pair button on your computer and your phone."
    },
    {
      "title": "Choose your notification settings.",
      "content": "Choose your notification settings. Use the Phone Link app on your computer to finish choosing how your computer will handle notifications from your phone."
    },
    {
      "title": "Dial a number.",
      "content": "Dial a number. In the Phone Link app, use the keypad to dial a number. You can also sync your contacts by clicking Show me how on the \"Calls\" tab, and following the on-screen instructions."
    },
    {
      "title": "Download Link to Windows on your Android (if needed).",
      "content": "Download Link to Windows on your Android (if needed). Many Android smartphones come with the Link to Windows app preinstalled. If your device doesn’t have it, download it from the Google Play Store . [9] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You’ll need an Android smartphone with Android 7.0 or later to use Link to Windows."
    },
    {
      "title": "Open Microsoft Phone Link on your Windows PC.",
      "content": "Open Microsoft Phone Link on your Windows PC. This built-in app allows you to connect your Android smartphone to your computer. Then, you can make calls directly from the Phone Link app. [10] X Research source You’ll need a computer with Windows 10 April 2018 Update or later to use Microsoft Phone Link."
    },
    {
      "title": "Click Get Started.",
      "content": "Click Get Started ."
    },
    {
      "title": "Sign in with your Microsoft Account.",
      "content": "Sign in with your Microsoft Account ."
    },
    {
      "title": "Open the Link to Windows app on your Android.",
      "content": "Open the Link to Windows app on your Android."
    },
    {
      "title": "Pair your phone to your PC.",
      "content": "Pair your phone to your PC. You can either select Pair with QR code or Pair manually to complete this process. After accepting the permissions, you’re done pairing! [11] X Research source"
    },
    {
      "title": "Make a call from your PC.",
      "content": "Make a call from your PC. To do so: Open Phone Link on your Windows PC. Select Calls . Search for a contact, or enter the phone number directly using the dial pad. Click the Dial button (a green circle with a phone icon) to call the number or contact selected."
    },
    {
      "title": "Turn on Wi-Fi Calling on your iPhone.",
      "content": "Turn on Wi-Fi Calling on your iPhone. Wi-Fi calling allows you to make calls using your Mac when your iPhone is connected to the same network. To turn on Wi-Fi Calling: [12] X Research source Go to the Settings app. Go to Phone . Turn on Wi-Fi Calling on This iPhone or Add Wi-Fi Calling For Other Devices . You’ll see one of these options depending on what carrier you have."
    },
    {
      "title": "Open FaceTime on your Mac.",
      "content": "Open FaceTime on your Mac. The FaceTime app is a green square with a white video camera icon."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . This is located in the menu bar."
    },
    {
      "title": "Click General.",
      "content": "Click General . This is an option in the Settings pop-up menu."
    },
    {
      "title": "Click Calls from iPhone.",
      "content": "Click Calls from iPhone . Once this is turned on, you’re ready to make calls from your Mac! [13] X Research source If you see Upgrade to Wi-Fi Calling , your carrier allows you to use Wi-Fi Calling from your Mac even if your iPhone is off or not connected to the same network. Select this option to enable this feature."
    },
    {
      "title": "Make a call using FaceTime.",
      "content": "Make a call using FaceTime. You’re ready to make a call using FaceTime on your Mac. To do so: Open FaceTime on your Mac. Click New FaceTime . Enter the phone number you want to call using the dial pad. Press Return on your keyboard. This will initiate the phone call."
    },
    {
      "title": "Create a Skype account.",
      "content": "Create a Skype account. If you already have a Microsoft account, you can sign in to Skype with that. Otherwise, create a Microsoft account by going to signup.live.com . Note: Microsoft is discontinuing Skype in May of 2025. Once Skype is discontinued, users will have the following options: Migrate to Microsoft Teams Free: To do this, sign into Microsoft Teams Free with your Skype account. Your contacts and chats will automatically be moved over. [14] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Export your Skype data: Go to go.skype.com/export and sign in with your Skype account. Choose what you'd like to export, then submit the export request. [15] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Transfer your Skype Number: If you want to keep your Skype number, you'll need to contact the provider you want to move it to initiate the process. [16] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Download Skype.",
      "content": "Download Skype. To make calls, you will have to install Skype as an app on your computer or smartphone. Desktop: Download from Skype's website . Mobile: Download from the Google Play Store or App Store ."
    },
    {
      "title": "Sign in.",
      "content": "Sign in. Once you have installed Skype, you can sign in using the username and password that you registered. If you have forgotten your password or username, click \"Can't access your account?\" to reset or recover your account information."
    },
    {
      "title": "Add a contact.",
      "content": "Add a contact. To add a contact in Skype: Add your contact or contacts. If you have the Skype username of a friend that you want to call, click on the \"+\" icon near the right-hand side of your window that is next to the \"Search\" bar. Click \"Add Contact...\". Enter the username and click \"Find.\" Add the contact once you have found them by clicking the green \"+\" button on the right side. You can send a message to your friend or contact to let them know who it is. [17] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Wait for your friend to accept your contact request. Click your \"Contacts\" icon on the left side of your Skype window."
    },
    {
      "title": "Skype call a contact.",
      "content": "Skype call a contact. You can choose to have a video or audio-only call with a contact or several contacts at the same time for free. To make a Skype call with a contact, select from these three options: In the Chats tab, click New Chat to start a text conversation. In the Contacts tab, click the contact you want to call. Then press the phone icon to start an audio call, or the video icon to start a video call."
    },
    {
      "title": "Make a phone call to a phone number.",
      "content": "Make a phone call to a phone number. This is different from Skype calling a contact, which you can do for free. Instead of calling someone's Skype, you are actually calling someone's phone number which may be connected to a landline or cell phone. A connection fee may also apply depending on the region that you are calling to. In order to make a phone call on Skype: [18] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Make sure you have enough credits or that you have purchased a phone plan from Skype. If you do not have enough Skype credits, add credits to your account by clicking the button below your display name in the top left. Or purchase a subscription plan on the website. New Skype users cannot purchase Skype credit, due to Skype's retirement in May 2025. Click the dial pad icon in the top left portion of the window. It’s next to the search bar under your name. This will open a phone number pad on your screen. Dial the number. You may have to add a country code, which can be easily done by clicking the downward-facing arrow next to the country at the top of the window. Press the \"Call\" button to begin your call."
    },
    {
      "title": "Hang up.",
      "content": "Hang up. Whether you called a contact or another phone number, you will see a red \"Hang Up\" button. Click on this to end your call."
    }
  ]
}