{
  "url": "https://www.wikihow.com/Make-a-Single-Cup-of-Coffee",
  "title": "How to Make a Single Cup of Coffee",
  "steps": [
    {
      "title": "Measure out 21 grams, or about 2-3 tablespoons, of coffee grounds.",
      "content": "Measure out 21 grams, or about 2-3 tablespoons, of coffee grounds. If you have a digital kitchen scale , use it to measure out 21 grams of grounds for the most precise brew. However, if you don't have a kitchen scale available, you can just measure out about 2-3 tablespoons' worth of coffee grounds instead. Adjust up or down depending on how strong you like your coffee. You can set the measured coffee grounds aside for now. Don't forget to calibrate your digital scale before you start measuring!"
    },
    {
      "title": "Insert a #4 cone filter into the pour-over brewer.",
      "content": "Insert a #4 cone filter into the pour-over brewer. Tuck the cone filter inside the coffee maker, making sure the sides of the filter are as flat as possible against the brewer's walls. You may need to line up the folded sides of the filter with the brewer's handle, but not all brewers require this. Your brewer should come with a glass carafe that goes underneath the brewer. If it doesn't, use a tall glass mug."
    },
    {
      "title": "Add 2 cups (470 ml) of water to a kettle and bring it to a boil.",
      "content": "Add 2 cups (470 ml) of water to a kettle and bring it to a boil. Fill your kettle with about 2 cups (470 ml) of water and place it on the stove. Turn your burner to HIGH and wait for the kettle to whistle, which indicates the water is boiling. [1] X Research source The typical ratio of water to coffee grounds is .5 cups (120 ml) of water for each tablespoon of coffee. You're using about 3 tablespoons of coffee, so you'll need 1.5 cups (350 ml) of water to make 1 serving of coffee. You're boiling a total of 2 cups (470 ml) of water so you can use the other .5 cups (120 ml) of water to rinse out the filter. [2] X Research source If you don't have a kettle, you can always use a regular pot for this. Just be extra careful when you're pouring the boiling water into the brewer!"
    },
    {
      "title": "Pour about .5 cups (120 ml) of hot water into the filter to rinse it out.",
      "content": "Pour about .5 cups (120 ml) of hot water into the filter to rinse it out. Take the kettle off the stove and pour a small amount of hot water into the filter. Aim to use about .5 cups (120 ml) of hot water, but it doesn't have to be exact. [3] X Research source Rinsing out the filter first gets rid of the papery residue on its surface, which can affect the taste of the coffee, and warms up the brewer. You can discard the rinsing water immediately."
    },
    {
      "title": "Place the kettle on a heat-safe surface.",
      "content": "Place the kettle on a heat-safe surface. You can place the kettle back on the stove if you'd like, but you don't need to continue heating the water over a hot burner. The boiled water needs to sit for about 60 seconds before you use it, so any heat-safe surface will do. [4] X Research source 60 seconds is the perfect amount of time to finish preparing the filter and coffee grounds!"
    },
    {
      "title": "Add the pre-measured coffee grounds to the filter.",
      "content": "Add the pre-measured coffee grounds to the filter. Dump the grounds into the rinsed filter and make sure to level them off so that the surface of the grounds is as flat as possible. You don't need to do anything special for this—you can just gently shake the brewer until the grounds settle evenly into the filter. [5] X Research source"
    },
    {
      "title": "Pour in enough hot water to saturate the coffee grounds completely.",
      "content": "Pour in enough hot water to saturate the coffee grounds completely. Slowly and steadily pour the hot water from the kettle over the coffee grounds in the filter. Aim for the center of the grounds and use slow, circular motions to saturate from the center out toward the edges. Stop as soon as the grounds are fully saturated and before brewed coffee starts to drip through the filter. [6] X Research source This technique is called a “bloom pour” and it prevents your coffee from tasting too bitter or too weak."
    },
    {
      "title": "Pour the rest of the hot water slowly into the filter.",
      "content": "Pour the rest of the hot water slowly into the filter. Stay in the center of the grounds as you continue to pour. Be sure to keep the dripper about half full during this time, which means your pouring pretty slowly! It will take approximately 3-4 minutes for you to pour the rest of the water and brew the full cup of coffee. [7] X Research source"
    },
    {
      "title": "Remove the coffee filter and brewer and enjoy your coffee.",
      "content": "Remove the coffee filter and brewer and enjoy your coffee. Transfer the freshly brewed coffee from the glass carafe to your coffee mug. Stir in sugar, cream, milk, cinnamon, or any other add-ins of your choice and enjoy your brew! [8] X Research source"
    },
    {
      "title": "Put 2 tablespoons (10 grams) of coarse grind coffee in the bottom of the press.",
      "content": "Put 2 tablespoons (10 grams) of coarse grind coffee in the bottom of the press. When you're using a French press, coarse grind coffee will definitely give the best flavor and prevent you from ending up with a bitter cup of coffee. The granules should be about the size of breadcrumbs. Measure the grounds out and dump them into the bottom of your French press. [9] X Research source You can adjust the amount of coffee grounds to suit your personal preference."
    },
    {
      "title": "Bring 1 cup (240 ml) of water to a boil over high heat.",
      "content": "Bring 1 cup (240 ml) of water to a boil over high heat. Fill your kettle with about 1 cup (240 ml) of water and place it on your stove. Crank the burner up to HIGH and wait for the water to come to a rolling boil. For the best flavor, use bottled or filtered water. If you want to use water from your tap, let it run for a few seconds before adding it to the kettle. [10] X Research source"
    },
    {
      "title": "Take the kettle off the burner and let it sit for 30-60 seconds.",
      "content": "Take the kettle off the burner and let it sit for 30-60 seconds. If you pour the water in immediately while it's still boiling, it will scald the coffee grounds and negatively affect the test. Remove the kettle from the heat, place it on heat-safe surface, and let cool for about a minute. [11] X Research source If you want to get super technical, the water should cool to 195 °F (91 °C) before pouring it into the French press. It should reach that temperature in about 1 minute, but you can always use a thermometer if you want to be certain. [12] X Research source"
    },
    {
      "title": "Fill the press carafe halfway with water and set a timer for 4 minutes.",
      "content": "Fill the press carafe halfway with water and set a timer for 4 minutes. It's important to start with half of the water so that your coffee doesn't end up too bitter or too weak. This saturation technique is called the “bloom.” Once you've poured the water, set a timer for 4 minutes. [13] X Research source"
    },
    {
      "title": "Stir the grounds after 60 seconds have passed.",
      "content": "Stir the grounds after 60 seconds have passed. 1 minute into the 4-minute brewing process, you need to stir the grounds to break up the caked-together blobs that are floating to the top of the water. Use a spoon to separate the coffee grounds on the water's surface. [14] X Research source You may need to use a vigorous up-and-down motion to get the grounds to break up fully. [15] X Research source"
    },
    {
      "title": "Pour in the remaining water and put the lid on the French press.",
      "content": "Pour in the remaining water and put the lid on the French press. Right after breaking up the grounds, pour the rest of the hot water into the press, starting in the center and working in a circular motion outward. Then, place the lid on your French press, but don't engage the plunger yet. [16] X Research source"
    },
    {
      "title": "Engage the plunger at the 4-minute mark.",
      "content": "Engage the plunger at the 4-minute mark. When your timer goes off, it's time to plunge! Press the plunger all the way down to the bottom. The plunger should move easily and without resistance. Then, pour your coffee into your mug and enjoy it immediately. [17] X Research source If the plunger seems resistant, make sure the mesh filter is lowered evenly. Be sure to pour all of the coffee out of the press right away to prevent it from over-steeping and getting bitter."
    },
    {
      "title": "Measure out 2 tablespoons (10 grams) of finely ground coffee.",
      "content": "Measure out 2 tablespoons (10 grams) of finely ground coffee. If you're using an Aero Press, it's important to use finely ground coffee for the best tasting brew. Avoid coarse brews when using this gadget. [18] X Research source If you only have coarsely ground coffee on hand, try popping it in a coffee grinder for 15 seconds or so before using it."
    },
    {
      "title": "Bring 1.25 cups (300 ml) of water to a boil over high heat.",
      "content": "Bring 1.25 cups (300 ml) of water to a boil over high heat. You'll use about 1 cup (240 ml) of water to brew your coffee, but you need the other .25 cups (59 ml) cup of water for rinsing out the filter. Once it comes to a boil, remove the kettle from the heat and place it on a heat-safe surface. It needs to sit for about 60 seconds before you start using it. [19] X Research source Rinsing the filter first ensures a better-tasting cup of coffee. Bottled or filtered water will give you the best tasting coffee, but tap water will work fine if that's all you have on hand."
    },
    {
      "title": "Situate the filter into the Aero Press's cap and put it over your mug.",
      "content": "Situate the filter into the Aero Press's cap and put it over your mug. Nestle the paper filter into the filter slot located in the press's cap. Once it's in place, put the Aero Press right on top of your coffee mug. [20] X Research source The press is made to fit over a mug perfectly."
    },
    {
      "title": "Dribble a small bit of hot water on the filter to get it wet.",
      "content": "Dribble a small bit of hot water on the filter to get it wet. You'll only need to use about .25 cups (59 ml) of water for this process, if even that amount. Aim to saturate the filter but don't pour in so much water that it starts dripping through the press."
    },
    {
      "title": "Add the pre-measured coffee grounds to the filter.",
      "content": "Add the pre-measured coffee grounds to the filter. All you need to do is dump the grounds into the filter opening and you're all set. Try to make the surface of the grounds as flat and even as possible once you dump them into the filter. To flatten the surface of the grounds, shake the filter gently so the grounds settle. You can also just use a spoon the smooth out the surface."
    },
    {
      "title": "Pour in the rest of the hot water and stir the coffee mixture 1 time.",
      "content": "Pour in the rest of the hot water and stir the coffee mixture 1 time. Dump the rest of the water out of the kettle into the filter, right on top of the coffee grounds. Then, use a spoon or paddle stirrer to give the coffee mixture 1 brief stir. [21] X Research source Avoid stirring vigorously—1 brief stir is all you need."
    },
    {
      "title": "Insert and engage the plunger to brew your cup of coffee.",
      "content": "Insert and engage the plunger to brew your cup of coffee. Put the plunger right over the coffee and water mixture and press down on the plunger until you hear a hissing sound. The coffee will brew straight into your coffee mug. The hissing sound simply indicates that the brewing process is complete. Be sure to let the liquid cool off a little before enjoying your java!"
    }
  ]
}