{
  "url": "https://www.wikihow.com/Make-Sex-Less-Painful",
  "title": "How to Make Sex Less Painful",
  "steps": [
    {
      "title": "Talk with your doctor.",
      "content": "Talk with your doctor. Make an appointment with your primary care physician or OBGYN. Come prepared with a list of topics that you’d like to discuss. Be prepared to talk about how you’ve experienced pain during sex. Ask them about possible treatments. Depending on the potential diagnosis, your doctor may also order tests or bloodwork. [1] X Research source For example, endometriosis is a painful medical condition that can effect women and must be diagnosed by a physician. If left untreated, it can cause a woman a great deal of pain during intercourse. [2] X Research source Other medical causes of painful sex include eczema in sensitive areas, vaginismus or spasms in the vagina, pelvic inflammatory disease, ovarian cysts, or scarring from surgery. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Describe what type of pain you have.",
      "content": "Describe what type of pain you have. Different types of pain might signal certain issues. Tell your doctor when during intercourse you feel pain and what type of pain it is. Some questions you might want to answer include: [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Do you have pain during penetration or only during thrusting? Does the pain last after sex? Does the pain throb, burn, or ache? Is this a new pain or an old condition?"
    },
    {
      "title": "Address any hormonal imbalances.",
      "content": "Address any hormonal imbalances. If you are suffering from a lack (or excess) of testosterone, estrogen, or another hormone, this could impact your level of pleasure or pain during sex. Talk with your doctor about possible treatment options to correct any hormonal problems. They may suggest a cream, a medicated ring, oral medications, or a treatment patch. [5] X Research source Some of these treatments can be highly successful with up to 75 percent of patients stating that their sexual pain lessened. [6] X Research source Menopause, birth, breastfeeding, and polycystic ovary syndrome can all affect your hormones, leading to painful sex."
    },
    {
      "title": "Treat any infections.",
      "content": "Treat any infections. If you have any type of sexual transmitted disease (STD), make sure to talk with your doctor before engaging in sexual intercourse. Also, seek out treatment if you are suffering from any type of genital infection as it could likely cause dryness and pain during sex. [7] X Research source For example, men and women can both suffer from cystitis, which is a bladder infection that can cause pain during intercourse. Another common cause is a urinary tract infection (UTI). Visit your doctor get a prescription for an antibiotic."
    },
    {
      "title": "Enroll in physical therapy.",
      "content": "Enroll in physical therapy. If you have a prior injury, then working with a physical therapist could help to increase your movement and flexibility. These changes may also lessen your pain during sex. Older persons may find physical therapy helpful as well, especially if they suffer from nerve conditions. [8] X Research source"
    },
    {
      "title": "Meet with a sex therapist.",
      "content": "Meet with a sex therapist. You can find a therapist in your area by going to the American Association of Sexuality Educators, Counselors and Therapists (AASECT) website. A sex therapist will talk with you alone, or with you and your partner, about any concerns regarding your sex life. They might be able to offer exercises or communication tactics to lessen pain during intercourse. [9] X Research source If you’ve been sexually assaulted in the past, it is probably a good idea to talk with a counselor. This will help you to find pleasure, instead of pain, from sex. [10] X Research source"
    },
    {
      "title": "Relax.",
      "content": "Relax. Take some deep breaths, concentrating on having the air go in your nose and out of your mouth. Do a few yoga stretches before going out or spending time with someone. Repeat, “Relax,” to yourself until you can feel the stress slipping away. If you are stressed, you will likely hold your tension in your body and make sex less pleasurable. [11] X Research source Sometimes it also helps to give voice to your fears. You might tell your partner, “I’m nervous about this, so I may need to relax more.”"
    },
    {
      "title": "Create a peaceful environment.",
      "content": "Create a peaceful environment. Try to have sex in an environment where you can concentrate all of your focus and energy on your partner. Minimize outside noises and distractions. Turn off your cell phone. Make sure that you will not be interrupted. Fostering a calm environment will help you to fully relax and be yourself. [12] X Research source You’ll want to think about what type of environment is relaxing to you. Some people prefer candles and soft lighting, whereas others like music on in the background."
    },
    {
      "title": "Communicate with your partner.",
      "content": "Communicate with your partner. You may think that having a sex conversation with your partner is unromantic, but not talking can be much more detrimental. If you talk before you have sex about what you like, you’ll be far more likely to express your likes/dislikes in bed as well. It also important to know each other’s sexual boundaries. [13] X Research source For example, you might say, “I’d really like to start off slow.” Or, “I will relax more if we turn off the lights.” If you have some sort of health problem, such as endometriosis, it is a good idea to make your partner aware of this as well. Be open and don’t be afraid of rejection. Your partner may be able to brainstorm ways to make sex better for you. [14] X Research source"
    },
    {
      "title": "Take good care of your body.",
      "content": "Take good care of your body. You will have better, less painful sex if you eat right, exercise, and get enough sleep. Sex can be similar to a workout in that it might push your body to its limits. If you are not healthy, then your body may respond to sex painfully. Try to eat a balanced diet. Work out at least three times a week. Get at least eight hours of undisturbed sleep a night. [15] X Research source Getting healthy and losing weight has also be associated with a decrease in the symptoms of Polycystic Ovary Syndrome (PCOS) for women. For men, losing weight can balance out testosterone levels, leading to better sexual performance."
    },
    {
      "title": "Go slowly.",
      "content": "Go slowly. Take your time with your partner before, during, and after sex. Rushing things will likely cause your stress levels to rise, increasing the possibility of pain. When you are having sex, take your time finding out what gives your partner pleasure and don’t be afraid to express your wishes, too. [16] X Research source If sex is painful, there is nothing wrong with stopping and trying again at another point. It is best to avoid the “let’s get this over with” mentality."
    },
    {
      "title": "Have more sex.",
      "content": "Have more sex. This may sound odd, but engaging in sex more frequently can actually get your body more used to the process, making it less painful as a result. For certain men and women, the sexual organs can suffer from varying degrees of atrophy if not stimulated. Having intercourse prevents this and increases blood flow to the genital region. Being more sexually active, in a safe way, can also lessen some of the fear and stress associated with sex. [17] X Research source If increased intercourse is not an option, many people see a lessening of pain if they try masturbation or other sexual practices aside from penetration. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Engage in foreplay.",
      "content": "Engage in foreplay. Give yourself at least 20-30 minutes for foreplay, as this is the average amount of time that it takes most people to become aroused and prepared for sex. Use this time as an opportunity to make sure that your partner is mentally and physically ready. Experiment with various types of touch to discover what works best for you both. [19] X Research source For example, try out different degrees of touch pressure. Intermix soft touches with more forceful caresses. Reader Poll: We asked 698 wikiHow readers if they think kissing and cuddling make sex better, and 50% of them said yes. [Take Poll]"
    },
    {
      "title": "Use lubrication.",
      "content": "Use lubrication. As part of foreplay, you may want to apply lubricant to yourself and perhaps your partner as well. Water-based vaginal lubricant can be placed directly on the vagina, vulva, or penis. A few drops is usually sufficient to reduce friction and pain. There are also vaginal moisturizers, which provide wetness and relief for multiple days. [20] X Research source Many people find lubrication especially helpful if you are having sex with a condom. [21] X Research source"
    },
    {
      "title": "Try out different positions.",
      "content": "Try out different positions. Experiment with a variety of sexual positions to see which ones are the most pleasurable, and least painful, for both you and your partner. Side-by-side can be comfortable for some women as it provides more shallow penetration. Both men and women sometimes prefer to assume a top position as it gives more control. [22] X Research source To reduce spine pain, medical experts often recommend the missionary position as it allows the person laying down to put a towel or some other soft item under the curvature of their spine for support. [23] X Research source"
    },
    {
      "title": "Stop if you need to.",
      "content": "Stop if you need to. If at any point during sex you experience pain and wish to stop, then tell your partner and separate. Don’t feel pressure to continue on just for your partner’s benefit. Communicate how you are feeling and work together to try once more under better conditions. [24] X Research source"
    },
    {
      "title": "Avoid any irritants.",
      "content": "Avoid any irritants. If you notice that you are experiencing redness, itching, or irritation immediately during or after sex then it is possible you’ve been exposed to an irritant. Some people have a latex allergy, which makes them react badly to certain condoms. Some women even have a semen allergy. For both men and women, the use of spermicides or certain lubricants can also cause irritation. [25] X Research source If you discover that a certain product causes irritation to your skin, you can always avoid it or find a product alternative. For example, people with a latex allergy often use natural lambskin condoms."
    }
  ]
}