{
  "url": "https://www.wikihow.com/Insulate-Windows",
  "title": "How to Insulate Windows",
  "steps": [
    {
      "title": "Check the windows before insulating them.",
      "content": "Check the windows before insulating them. To save time and money, determine which windows need to be sealed instead of sealing them all. There are multiple ways to check your windows, so choose the option that works best for your current conditions. If in doubt, you can still insulate a window you aren't sure about. Since many forms of insulation are fairly inexpensive, doing so may ultimately prove more cost-effective than leaving it alone."
    },
    {
      "title": "Wait for a very cold or windy day.",
      "content": "Wait for a very cold or windy day. Feel around the window frame during the next cold or windy day. If you can feel air coming through the seals, you'll need to insulate the window. To detect small leaks, you may need to moisten your fingertips before running them along the seams. Wet skin is more sensitive to shifts in air current than dry skin."
    },
    {
      "title": "Look at the windows when it rains.",
      "content": "Look at the windows when it rains. Moisture trapped between panels or in the frame indicates a leak. When moisture builds up in the corner of the window or along one of its edges, the problem likely lies in the seams. Moisture that builds up in the middle of the window panel may indicate some type of crack or chip in the glass."
    },
    {
      "title": "Perform a light check.",
      "content": "Perform a light check. On the next sunny day, look around the edges of the window frame and determine if any light peeks through. This can be a difficult type of check to perform since the sun needs to shine directly on the window. You'll also need to verify that the light you see is coming from beneath the frame instead of the glass itself."
    },
    {
      "title": "Do a smoke test.",
      "content": "Do a smoke test. To check the window regardless of current weather conditions, light a candle or incense stick and hold it around various places around the frame. Watch the smoke coming from the candle. If it gets sucked into the frame at any given point, there is a leak at that specific point."
    },
    {
      "title": "Use foam rubber weather sealing.",
      "content": "Use foam rubber weather sealing. Trim down self-adhesive weather sealing strips to match the dimensions of your window, then simply stick the strips directly to the inner frame to seal off any spaces along the edges. This option is fairly inexpensive and easy to apply, but you'll need to replace the strips periodically. When you peel them away, they may leave a residue or cause chips in your paint, so be prepared to touch up the area if you don't plan on immediately applying another strip. The surfaces must be very clean and very dry or the strips won't stick long. On a cold day, these surfaces will be slightly wet from condensation, so dry them with a hair drier. To clean them, use fine sand paper or steel wool."
    },
    {
      "title": "Try rope caulk.",
      "content": "Try rope caulk. Rope caulk comes in the form of packaged strips. Use a knife to cut the strips down to match the length of each window seam, then press each strip into its respective seam to seal the area. Manipulate and press the putty in place using your fingers. If you need to remove the caulk, you can peel it away with your fingers, as well."
    },
    {
      "title": "Apply high-performance sealant",
      "content": "Apply high-performance sealant . For something a little more durable than rope caulk, use high-performance caulk sealant or low-expansion foam. You can squeeze caulk into the gaps along the exterior side of your window seam using a caulk gun or apply expansion foam to the same seams using a shooter foam gun. Apply an even, continuous bead of caulk along the entire exterior seam. You should be able to use it on most building materials. When cured, the sealant should block drafts and moisture, making it resistant to mildew and other fungi. Cured caulk can also be painted. When applying expansion foam, test its expanded volume with a small drop placed in the corner of the window. Once you've determined how much it expands, use that knowledge to apply the necessary bead amount around the entire seam."
    },
    {
      "title": "Make a draft snake for sliding windows and steel casement windows",
      "content": "Make a draft snake for sliding windows and steel casement windows . Sew a simple fabric tube to match the width of the window. Fill it with dried rice or polyester stuffing, then place it along the bottom of your window inside your home. You can also purchase draft snakes or draft snake kits online and at some superstores or department stores. Foam-and-fabric draft snake kits will allow you to customize the snake to fit the length of your windowsill; simply cut the enclosed foam tube down to size and insert it into the washable cover. When making your own draft snake, note that heavier materials (denim, corduroy, etc.) tend to work better than lighter materials (linen, knits, etc.). Note that this will only insulate the seam along your windowsill. You won't be able to use a draft snake to seal the top and side seams."
    },
    {
      "title": "Seal the gap between the upper and lower sashes on wooden double hung windows.",
      "content": "Seal the gap between the upper and lower sashes on wooden double hung windows. This is often the main source of air leakage. Large paint drops on either surface create a gap. If any thumb latches are missing or broken, replace them. They pull the sashes together to close the gap. Scrape off drops of paint on the contacting surfaces of the upper and lower sashes. Lower the upper sash and raise the lower sash as far as they can go. This will expose both surfaces so you can scrape off the paint. If the upper sash can't be lowered, try cutting off the drops of paint by sliding a hack saw blade between the sashes."
    },
    {
      "title": "Paint the crack with nail polish.",
      "content": "Paint the crack with nail polish. For small cracks in the glass, apply several coats of clear nail polish directly over the damaged area. Wait until each coat dries before applying another. [1] X Research source Note that this is only a temporary fix. The polish should seal the crack and prevent it from spreading for several months, but it will eventually wear off. Cracked window glass will need to be replaced."
    },
    {
      "title": "Use weather-seal tape.",
      "content": "Use weather-seal tape. Cut a small strip of clear weather-seal tape and place it directly over the crack in the glass. The tape should last for several months and prevent air from flowing through the crack. As with nail polish, weather-seal tape should only be used as a temporary fix. You'll eventually need to replace the cracked window glass to prevent the crack from getting worse."
    },
    {
      "title": "Apply window insulation film",
      "content": "Apply window insulation film . Trim the film down to size, if necessary, then stick it to the inner glass of your window using double-sided tape. You'll also need to shrink the film with a hair dryer for an improved seal. This is another inexpensive and simple solution, and it's as simple to remove as it is to apply. You may wish to soak the tape in rubbing alcohol before peeling it away, though, to minimize the risk of peeling away any paint or leaving any sticky residue. The film will create a noticeable haze over your window. Light should still shine through, but it may not be the most aesthetically pleasing option."
    },
    {
      "title": "Stick bubble wrap onto the window.",
      "content": "Stick bubble wrap onto the window. Spray the window with water, then press a sheet of trimmed bubble wrap directly onto the wet glass. It should stick without difficulty and remain in place for several months. [2] X Research source Bubble wrap can be even cheaper than window insulation film. Opt for bubble wrap with large bubbles since it tends to insulate better than the smaller bubble type. Trim the bubble wrap so that it slightly overlaps the seams of your window. When applying it to the window, the bubble-side should face the glass. If desired, you can apply a double layer of bubble wrap for even better insulation. If the bubble wrap won't stick to your window on its own, you may need to use double-sided tape to help it stay in place. Bubble wrap will block the view from the window, but it should allow light to come through without difficulty. To remove the bubble wrap, simply peel it away, moving from one corner to the diagonally opposite corner. The bubble wrap itself usually won't leave any stain, but you may need to clean the window to return the glass to full visibility."
    },
    {
      "title": "Layer shades and curtains.",
      "content": "Layer shades and curtains. Install cellular shades over your window, then fit heavy curtains over the shades. Either option on its own should provide considerable insulation, but pairing the two together will help even more. [3] X Research source Cellular shades are also known as honeycomb shades due to their unique structure. Folds of fabric create layers of air pockets, and these layers trap more air than standard shades can. These shades allow light to filter in and can be custom-fitted to match the dimensions of your windows, but they can also be fairly expensive. Heavy curtains have an elegant appearance, but they can also be somewhat expensive, and they'll only insulate your windows when drawn closed. Unlike cellular shades, curtains will block out the light when closed."
    },
    {
      "title": "Install window insulation panels.",
      "content": "Install window insulation panels. Mount the aluminum frame of the window to the interior side of your window. Each frame has weatherstripping around the perimeter, and that weatherstripping should seal the existing window. When you purchase a window panel kit, you should get all the necessary components and specific installation instructions. You won't be able to custom-fit the panel, though, so make sure that the dimensions of the aluminum frame match the dimensions of your window before purchasing the kit. The panel creates a secondary air pocket in between it and the existing window, and excess air flowing through cracks and leaks should get trapped inside that pocket."
    }
  ]
}