{
  "url": "https://www.wikihow.com/Group-on-Canva",
  "title": "Grouping on Canva: 2 Ways to Move and Edit Multiple Objects",
  "steps": [
    {
      "title": "Open your project in Canva.",
      "content": "Open your project in Canva. Go to https://www.canva.com/ , log in, then click Projects from the panel on the left side of your screen to find your existing projects. You can also create a new project instead and add more than one element to group, like a picture and text box."
    },
    {
      "title": "Select your elements.",
      "content": "Select your elements. Drag your cursor over the elements you want to group. Alternatively, press Shift while you click the elements to add them to your selection."
    },
    {
      "title": "Click Group.",
      "content": "Click Group . You should see this in the white editing space to the top right of your project. If you don't, click the horizontal three-dot menu to see more options, then click Group . You can instead press the keyboard shortcut to group your selected items: Ctrl + G (Windows) or Cmd + G (Mac). To ungroup these elements, click Ungroup from the menu on your screen or press the keyboard shortcut again. [1] X Research source"
    },
    {
      "title": "Open your project in Canva.",
      "content": "Open your project in Canva. Tap the Canva app icon on your Android, iPhone, or iPad's Home screen, tap Projects , then tap your project to open it."
    },
    {
      "title": "Tap and hold an element.",
      "content": "Tap and hold an element. This can be a graphic, text, sticker, or shape. Let go when a menu slides up from the bottom of your screen."
    },
    {
      "title": "Tap Select multiple.",
      "content": "Tap Select multiple . This text is under an icon of a square made out of dashed lines."
    },
    {
      "title": "Tap other elements that you want to group.",
      "content": "Tap other elements that you want to group. As you tap on other things, you will see them outlined with purple and the menu item will display how many elements you're adding to the group."
    },
    {
      "title": "Tap Group.",
      "content": "Tap Group . This is also found in the menu near the bottom of your page. You may need to swipe a few times to see the option. To ungroup, tap and hold to select the group and tap Ungroup from the menu."
    }
  ]
}