{
  "url": "https://www.wikihow.com/Let-Go-of-Past-Hurts",
  "title": "How to Let Go of Past Hurts",
  "steps": [
    {
      "title": "Forgive others for your own good.",
      "content": "Forgive others for your own good. When you forgive someone who has hurt you, you are giving yourself a wonderful gift. You may experience health benefits, including lower blood pressure and better heart health, as well as psychological benefits, including less stress and fewer symptoms of depression. You will also be increasing your chances of having more successful relationships in the future. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Forgiving someone who has wronged you is a sign of strength, not weakness. It does not mean that you condone the hurtful actions, but rather that you will not allow those actions to burden you any longer. Forgiving a person does not necessarily mean reconciling with him. Depending on the situation, this may not be possible or it may not be a good idea. Forgiving simply means that you are letting go of any resentment you feel and any desire for revenge. Try to be compassionate and empathetic to the person who has hurt you, as hard as it may be. It is important to understand that people often hurt others because they are hurting themselves. You may have to forgive yourself as well if you bear some responsibility for your past hurts. It is important to recognize this responsibility, but don't hold on to it. Forgive yourself with compassion and understanding. [2] X Research source"
    },
    {
      "title": "Stop allowing yourself to be the victim",
      "content": "Stop allowing yourself to be the victim . Although another person may be responsible for hurting you in the past, he is not responsible for your decision to continue dwelling on the past. The first step towards healing is to take back control of your life and realize that you have the power to make your future better than your past. [3] X Research source When you continue to blame the person who has hurt you for everything negative that happens in your life, you are allowing him to control you. The next time you have a thought like this, consciously remind yourself that you are in control. Then try thinking of something positive you can do to help yourself feel better. It can be very empowering to take control of your own recovery. In order to stop letting others control your actions and your emotions, make your own plan for how you will let go of your past hurts. You can take advice from others, but keep reminding yourself that you are the boss of your own life."
    },
    {
      "title": "Repeat positive affirmations to yourself.",
      "content": "Repeat positive affirmations to yourself. If your past hurts have left you with damaged self-esteem, try taking a moment to think about some of your most positive qualities. Then remind yourself every single day that you are a wonderful, worthy person. Try different ways of affirming your self-love. Sing it, write it, or say it aloud or to yourself. Create a piece of artwork that incorporates the affirming words and keep it where you will see it often."
    },
    {
      "title": "Express your feelings.",
      "content": "Express your feelings. Allowing yourself to express the pain and hurt you feel can be freeing. Try writing about what happened in a journal or write a letter to the person who hurt you (but don't send it). Getting it all out at once will help you to process your feelings and understand why you are still hurting. [4] X Research source"
    },
    {
      "title": "Revisit the past for positive reasons.",
      "content": "Revisit the past for positive reasons. Revisiting the past is usually a negative thing, but if you choose to do it for the right reasons, it can help you move on from your past hurts. If you are holding on to guilt or other negative feelings about yourself, try thinking through the events of your past and reviewing them to figure out why you feel that way. Then consider all the reasons why your negative feelings are not grounded in truth. [5] X Research source This exercise is best used for revisiting traumatic events for which you are unnecessarily blaming yourself. If, for example, you feel responsible for your parents' divorce or you feel that you are to blame for your partner's infidelity, revisit the event to help yourself understand the source of your negative feelings. If you take the time to analyze the situation, you will realize that the negative feelings you are harboring about yourself are not based in truth. Be careful about placing too much blame on others. The point of this exercise is not to begin holding a grudge against someone else, but rather to recognize why you feel badly about yourself and to stop yourself from feeling that way."
    },
    {
      "title": "Get the support you need.",
      "content": "Get the support you need. Depending on what kind of hurt you are trying to let go of, you might need different kinds of support. Don't keep your feelings to yourself if you feel trapped by them. Talking to someone can help you sort through your feelings, and sometimes it just feels good to let it out. [6] X Research source Talk to friends or family members about your feelings, but make sure they don't have anything to do with the issues you are dealing with. They will be in a much better position to support you if they are completely impartial. Look for a support group that addresses your issues (for example, a bereavement or childhood trauma group). Find an individual or group therapist with expertise in past hurts or trauma recovery. Your therapist may be able to help you understand why you feel the way you do and learn how to overcome your negative feelings."
    },
    {
      "title": "Focus on something positive.",
      "content": "Focus on something positive. If you allow negative thoughts and memories to consume you, it can feel like there is no room in your life for anything positive or happy. Instead of allowing this to happen to you, take the opposite approach: fill your life with so many positive things that there is no room for negativity. [7] X Research source Choose to occupy yourself with something goal-oriented, like school or your career, or things that make you feel good about yourself, like volunteer work or quality time with your friends."
    },
    {
      "title": "Reframe painful experiences as learning opportunities.",
      "content": "Reframe painful experiences as learning opportunities. Reframing negative thoughts can be very helpful in allowing you to move forward. Everyone experiences painful things at times, but finding opportunities for personal growth can help you move past the hurt. [8] X Research source For example, perhaps you are hurt that your partner broke up with you. Rather than dwelling on the pain of this experience, try reframing it: \"I am hurt because I lost my partner, but I learned a lot from that relationship that I can take with me into the next one.\" Or, as another example, perhaps someone was unkind to you. You can reframe this as \"That person was hurtful, but I am strong and resilient and her behavior won't keep me down.\""
    },
    {
      "title": "Be mindful of intruding thoughts.",
      "content": "Be mindful of intruding thoughts. When you begin to think about what happened, gently move these thoughts away and remind yourself about what it is that you are currently focusing on in your life. It's okay the acknowledge the memory, but quickly replacing it with a reminder of something positive in your life will help keep you from dwelling on it. [9] X Research source When you become preoccupied with thoughts about the past, try repeating the following phrase: \"Bad things have happened to me in the past, but it is now the present and I don't have time to worry about the past because I am focusing on _______.\" Alternatively, you can take a moment to list all of the positive things in your life. If you fill your mind with happy thoughts, there will be no room for the negative ones."
    },
    {
      "title": "Be open to others.",
      "content": "Be open to others. If you've been hurt by someone in the past, it can be easy to assume that others will hurt you in the future as well. Unfortunately, this kind of thinking can cause you to enter into new relationships with anger. If you want to develop healthy relationships in the future you will need to do your best to leave your anger behind and to avoid assuming the worst of others based on what has happened to you in the past. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}