{
  "url": "https://www.wikihow.com/Make-Unleavened-Bread",
  "title": "The Best Recipes for Unleavened Bread that’ll Make Your Mouth Water",
  "steps": [
    {
      "title": "Place an upside-down baking sheet in the oven and turn the oven to 500 °F (260 °C).",
      "content": "Place an upside-down baking sheet in the oven and turn the oven to 500 °F (260 °C). You'll be cooking the matzo on the baking sheet and heating it ensures that the matzo will become crisp. [1] X Research source If you prefer, use a pizza stone instead of a baking sheet."
    },
    {
      "title": "Mix the flour, salt, olive oil, and water in a bowl.",
      "content": "Mix the flour, salt, olive oil, and water in a bowl. Put 2 cups (240 g) of all-purpose flour into a mixing bowl and add 1/2 teaspoon (2.5 g) of kosher salt along with 2 tablespoons (30 ml) plus 1 teaspoon (4.9 ml) of olive oil. Use your fingers or a spoon to stir in 1 ⁄ 3 cup (79 ml) plus 3 tablespoons (44 ml) of water. [2] X Research source You can use virgin or extra-virgin olive oil or substitute another oil, such as canola, coconut, or vegetable oil, if you prefer."
    },
    {
      "title": "Knead the matzo dough for 4 to 5 minutes.",
      "content": "Knead the matzo dough for 4 to 5 minutes. Use your fingers to fold and stretch the dough in the bowl until it pulls away from the sides of the bowl. Keep folding and stretching the dough until it's soft and easy to knead . [3] X Research source If the dough is still too dry, mix in 1 tablespoon (15 ml) of water at a time."
    },
    {
      "title": "Divide the dough into 4 pieces and roll each as thin as possible.",
      "content": "Divide the dough into 4 pieces and roll each as thin as possible. Portion the dough into equal pieces and set them on a floured work surface. Take a rolling pin and roll each piece out so it's as thin as you can make it. If you can, roll the matzos so thinly that you can hold them up and see light coming through them. [4] X Research source Roll the matzos into any shape you like so they're at least 6 inches (15 cm) in diameter. Try simple ovals or rectangles, for instance."
    },
    {
      "title": "Poke the surface of the matzos with a fork and brush them with oil if you like.",
      "content": "Poke the surface of the matzos with a fork and brush them with oil if you like. Push the tines of a fork into the surface of each matzo piece to prevent them from puffing up too much as they bake. If you'd like the matzos to be golden on top, dip a pastry brush into vegetable or olive oil and brush it over the top of each matzo. [5] X Research source"
    },
    {
      "title": "Lay 1 or 2 matzos on the hot baking sheet.",
      "content": "Lay 1 or 2 matzos on the hot baking sheet. You might be able to fit 2 pieces on the sheet if your sheet is large enough. If it isn't big enough, you'll have to bake 1 matzo at a time. [6] X Research source It's fine to place the matzos close together on the baking sheet since they won't expand as they bake. Just ensure that the pieces aren't touching."
    },
    {
      "title": "Bake the matzos for 3 to 4 minutes and flip them halfway through the baking time.",
      "content": "Bake the matzos for 3 to 4 minutes and flip them halfway through the baking time. Let the matzos bake on the sheet until they're crisp and brown. To help them cook evenly, use tongs to carefully flip them over halfway through the cooking time. [7] X Research source"
    },
    {
      "title": "Cool the matzos on a rack and store them at room temperature for up to 1 week.",
      "content": "Cool the matzos on a rack and store them at room temperature for up to 1 week. Arrange the matzos in a single layer on a cooling rack. Serve the matzos once they're completely cool or put them into an airtight storage container and use them within 1 week. [8] X Research source The matzos will soften the longer they're stored, so eat them quickly if you like them crisp."
    },
    {
      "title": "Combine whole-wheat flour, salt, and oil in a bowl.",
      "content": "Combine whole-wheat flour, salt, and oil in a bowl. Put 3 cups (390 g) of whole-wheat flour into a large mixing bowl and add 1 teaspoon (5.5 g) of kosher salt along with 2 tablespoons (30 ml) of vegetable oil. Use your fingers or a spoon to stir until the oil is distributed and the mixture is crumbly. [9] X Research source If you prefer, substitute melted butter or ghee for the vegetable oil."
    },
    {
      "title": "Mix in 1 cup (240 ml) of the water to form a soft dough.",
      "content": "Mix in 1 cup (240 ml) of the water to form a soft dough. Pour 1 cup (240 ml) of the water and set the rest aside since you may not need it all. Use your fingers or a spoon to stir the mixture until the flour absorbs all of the water and begins to pull away from the side of the bowl. [10] X Research source If the dough is too dry to stay together, slowly mix in more of the remaining 1 ⁄ 2 cup (120 ml) of water. Avoid pouring all of the water in at once or your dough might become too sticky to work with."
    },
    {
      "title": "Knead the roti dough for 10 minutes.",
      "content": "Knead the roti dough for 10 minutes. Stretch and fold the dough in the bowl until it's smooth and elastic. The dough will become easier to knead as you continue to work it. [11] X Research source There's no proper way to knead dough, so try folding and stretching the dough until you find a method that you prefer. Don't sprinkle more flour over the dough or it may become too dry to roll out."
    },
    {
      "title": "Cover the dough and let it rest at room temperature for 20 to 30 minutes.",
      "content": "Cover the dough and let it rest at room temperature for 20 to 30 minutes. Lay a damp cloth on the dough to prevent it from drying out. Leave the dough at room temperature for 20 to 30 minutes so the gluten in the dough relaxes. [12] X Research source You could also use an overturned bowl to cover the dough."
    },
    {
      "title": "Heat a skillet or tawa over medium heat.",
      "content": "Heat a skillet or tawa over medium heat. Set an ungreased or nonstick skillet on the stove and turn the burner to medium. If you have a tawa, an Indian skillet, use this instead. Let the skillet or tawa heat while you begin rolling out the roti."
    },
    {
      "title": "Divide the dough into 12 pieces and roll each piece into a ball.",
      "content": "Divide the dough into 12 pieces and roll each piece into a ball. Pull off the dough to make 12 equal portions. Then, roll a piece in between the palms of your hands to make a smooth ball. Set the balls on your work surface and lay the damp cloth over them. [13] X Research source If you prefer, cut the dough into 12 equal pieces."
    },
    {
      "title": "Roll each ball into a 6 to 8 in (15 to 20 cm) circle.",
      "content": "Roll each ball into a 6 to 8 in (15 to 20 cm) circle. Press down on 1 ball to flatten it slightly. Dip it into a little whole-wheat flour and place it on a flat surface. Then, roll the ball into a thin circle. [14] X Research source Turn the dough circle as you roll it out to prevent it from sticking to your work surface."
    },
    {
      "title": "Place 1 circle in the skillet and cook it for 1 minute.",
      "content": "Place 1 circle in the skillet and cook it for 1 minute. Slowly lower 1 of the rolled pieces of dough into the hot, ungreased skillet. Let the roti cook for 1 minute so it begins to puff up in the center. [15] X Research source"
    },
    {
      "title": "Flip the roti over and cook it for 1 more minute.",
      "content": "Flip the roti over and cook it for 1 more minute. Use tongs or a spatula to turn the roti over. Cook it until it blisters in a few spots and no longer looks doughy on either side. [16] X Research source Continue to cook the roti in the skillet 1 at a time."
    },
    {
      "title": "Brush the roti with melted butter or ghee.",
      "content": "Brush the roti with melted butter or ghee. Transfer the cooked roti to a serving plate and spread some melted butter or ghee across the top. Stack the cooked roti on each other and lay a clean dry towel over them to keep them warm. Store the leftover roti in an airtight container at room temperature for up to 2 days."
    }
  ]
}