{
  "url": "https://www.wikihow.com/Grow-an-Aloe-Plant-With-Just-an-Aloe-Leaf",
  "title": "How to Duplicate an Aloe Vera Plant: Propagation Guide",
  "steps": [
    {
      "title": "Understand that a leaf may not form roots and grow.",
      "content": "Understand that a leaf may not form roots and grow. While it is possible to grow an Aloe Vera plant from a leaf, the chances of the leaf taking root are very slim. Aloe Vera leaves have a lot of moisture, and tend to rot before they can take root. Growing an Aloe Vera plant from an \"offset\" is more effective. [1] X Research source Aloe can be grown from cuttings, but it needs to be a stem cutting, not a leaf cutting. [2] X Expert Source Artemisia Nursery Plant Nursery & Garden Shop Expert Interview. 7 August 2020."
    },
    {
      "title": "Find an aloe leaf that is at least 8 centimeters (3.15 inches) long.",
      "content": "Find an aloe leaf that is at least 8 centimeters (3.15 inches) long. If this is not your personal plant, ask for the gardener's permission first."
    },
    {
      "title": "Cut the leaf at the base using a sharp, clean knife.",
      "content": "Cut the leaf at the base using a sharp , clean knife. Try to cut at a downward angle, towards the stem. The knife must be very clean, or you risk infecting the leaf."
    },
    {
      "title": "Leave the leaf some place warm, long enough for a film to form over the cut part.",
      "content": "Leave the leaf some place warm, long enough for a film to form over the cut part. This can take as little a few days to as long as two weeks. This film will help keep the cut part from getting infected by the soil. [3] X Research source An infected Aloe Vera leaf won't survive for very long."
    },
    {
      "title": "Find a pot with a drain hole in the bottom.",
      "content": "Find a pot with a drain hole in the bottom. Like most plants, Aloe Vera likes water, but it hates to sit in it. If your pot does not have a drain hole, the soil will stay soaking wet. This can lead to root rot, which can kill a plant—including the hardy Aloe Vera."
    },
    {
      "title": "Fill the pot with cactus soil, and dampen it with water.",
      "content": "Fill the pot with cactus soil, and dampen it with water. If you don't have any cactus soil, you can mix your own by mixing one part sand and one part potting soil. [4] X Research source Consider filling the bottom of your pot with gravel first. This will help the pot drain even more. The pH level should be 6.0 to 8.0. If the pH is not high enough, add some gardening lime. You can buy it from a garden shop."
    },
    {
      "title": "Stick the leaf cut-side-down into the soil.",
      "content": "Stick the leaf cut-side-down into the soil. Make sure that about one-third of the leaf is in the soil. Consider dipping the cut base in some sort of root hormone first. If you don't have any on hand, ground cinnamon or honey will work as well. [5] X Research source This is not the same as root hormone, which chemically induces rooting in plants. You can also try combining root hormone and honey to get the benefits of both. If you do not want to use a chemical rooting hormone, then another option is to make your own using willow."
    },
    {
      "title": "Put the plant some place warm and sunny, and water it with care.",
      "content": "Put the plant some place warm and sunny, and water it with care. For the first four weeks of so, you will want to keep the soil moist. Once the leaf is done transplanting, wait until the soil is completely dry before you water it again. Don't worry if the leaf shrinks or dries while it is developing roots."
    },
    {
      "title": "Find an offset.",
      "content": "Find an offset. Offsets, also known as \"pups\" are part of the main plant. They are usually smaller and brighter in color. They will also have their own set of roots. Search for them along the base. Here are some things you should look for when selecting an offset to cut: The offset should be one-fifth the size of the main plant. Choose an offset that has at least four leaves, and is several inches tall."
    },
    {
      "title": "Take the entire plant out of the pot, if you can.",
      "content": "Take the entire plant out of the pot, if you can. This will make it easier to find where the offshoot joins the main plant. You may have to brush the soil away from the roots to see the offshoot better. It may be attached to the main plant, but it should have its own set of roots."
    },
    {
      "title": "Pry or cut the offshoot away from the main plant, but try to keep the roots intact.",
      "content": "Pry or cut the offshoot away from the main plant, but try to keep the roots intact. The offshoot may come away easily. If it doesn't, you will need to cut it using a sharp, sterile knife. (Sterilize the knife with ethyl alcohol first because this will not harm the plant.) Just cut the pup directly from the stem. [6] X Expert Source Artemisia Nursery Plant Nursery & Garden Shop Expert Interview. 7 August 2020. Let the wound scab over for a few days before you move on. This will prevent any infections. The offshoot must have some roots attached to it. Once you have pried the offshoot away from the main plant, you can put the larger plant back into its pot."
    },
    {
      "title": "Find a pot with a drain hole at the bottom.",
      "content": "Find a pot with a drain hole at the bottom. This is very important. Like most plants, Aloe Vera likes water, but it hates sitting in it. If your pot does not have a drain hole, the soil will become waterlogged. This can lead to root rot, which can kill your Aloe Vera."
    },
    {
      "title": "Fill the pot with cactus soil.",
      "content": "Fill the pot with cactus soil. If you don't have any cactus soil, mix one part sand with one part soil. Consider filling the bottom of your pot with gravel first. This will help the pot drain even more. The pH level should be 6.0 to 8.0. If the pH is not high enough, add some gardening lime. You can buy it from a gardening shop."
    },
    {
      "title": "Make a small hole in the soil and stick the offshoot into it.",
      "content": "Make a small hole in the soil and stick the offshoot into it. The hole should be deep enough to fit the roots as well as one-fourth of the plant (from where the roots end, and upwards). Many expert gardeners recommend that you dip the roots in root growth hormone first, to help the roots grow faster."
    },
    {
      "title": "Pat the soil around the plant, and water it.",
      "content": "Pat the soil around the plant, and water it. Water the plant enough so that the soil is damp, but not soaking. Aloe Vera is a desert plant, so it really does not need much water."
    },
    {
      "title": "Place the plant in a sunny spot and wait one week before you water it again.",
      "content": "Place the plant in a sunny spot and wait one week before you water it again. After this, you can water your Aloe Vera like your normally would. [7] X Research source"
    },
    {
      "title": "Make sure that your plant gets plenty of bright sunlight.",
      "content": "Make sure that your plant gets plenty of bright sunlight . Ideally, Aloe Vera should get 8 to 10 hours of sunlight each day. You can get this by placing it in a south or west-facing window. If necessary, move the plant from window to window throughout the day. If it is cold where you live, move the plant away from the windows at night. These areas tend to get very cold, which can kill your plant. [8] X Research source"
    },
    {
      "title": "Wait until the soil is completely dry before you water it again.",
      "content": "Wait until the soil is completely dry before you water it again. When you do water the plant, make sure that the soil is completely soaked through. Also, make sure that the water is draining freely from the pot. Do not over-water your plant. Aloe Vera tends to go dormant during the winter months. It won't need as much water. [9] X Research source Aloe Vera will need more water during the summer months, especially when it is hot and dry."
    },
    {
      "title": "Fertilize once a year during spring.",
      "content": "Fertilize once a year during spring. The fertilizer should be water-based, and heavy in phosphorus. Prepare the mix at half strength. [10] X Research source"
    },
    {
      "title": "Watch out for bugs, disease, and fungus.",
      "content": "Watch out for bugs, disease, and fungus. Use a natural, organic pesticide to keep pests, such as mealy bugs and scale, at bay. You can avoid fungus easily simply by keeping the soil dry. If you notice any mealy bugs or scale, then you can wipe them off with a cotton swab and some ethyl alcohol. [11] X Research source"
    },
    {
      "title": "Watch the leaves.",
      "content": "Watch the leaves. They are great indicators of health, and what your Aloe Vera needs. Aloe vera leaves should be plump and straight. If you notice the leaves becoming thin and curly, give your Aloe Vera more water. Aloe Vera leaves should grow straight up. If the leaves droop, the plant needs more sun."
    },
    {
      "title": "Know what to do if your plant grows too slowly.",
      "content": "Know what to do if your plant grows too slowly. Sometimes, Aloe Vera does not grow well. Fortunately, it is easy to figure out what is wrong. It is even easier to fix these common problems. The soil is too damp. Water the plant less often. The plant needs more sunlight. Move it to a sunnier spot. You added too much fertilizer. Move the plant to a new pot and add more soil. The soil might be too alkaline. Add some soil sulfur. The plant doesn't have enough room for its roots. Move it to a bigger pot."
    }
  ]
}