{
  "url": "https://www.wikihow.com/Make-a-Black-Tooth-Grin",
  "title": "How to Make a Black Tooth Grin",
  "steps": [
    {
      "title": "Consider filling a shot glass with a few ice cubes.",
      "content": "Consider filling a shot glass with a few ice cubes. The Black Tooth Grin is typically served chilled or over ice. If you don't want yours that cold, skip the ice."
    },
    {
      "title": "Fill the glass with 1½ ounces (45 milliliters) of Crown Royal Canadian whisky.",
      "content": "Fill the glass with 1½ ounces (45 milliliters) of Crown Royal Canadian whisky. For a stronger drink, use 2 ounces (60 milliliters) instead. [1] X Research source"
    },
    {
      "title": "Add half the Coca-Cola.",
      "content": "Add half the Coca-Cola. You'll add the rest later."
    },
    {
      "title": "Pour in 1½ ounces (45 milliliters) of Seagram's 7 whisky.",
      "content": "Pour in 1½ ounces (45 milliliters) of Seagram's 7 whisky. For a stronger drink, use 2 ounces (45 milliliters) instead. [2] X Research source"
    },
    {
      "title": "Top off with the rest of the Coca-Cola.",
      "content": "Top off with the rest of the Coca-Cola. This will turn the drink its trademark dark color."
    },
    {
      "title": "Serve.",
      "content": "Serve. The Black Tooth Grin is served as is, without any garnishes."
    },
    {
      "title": "Try a simple Black Tooth Grin, without the Seagram's 7 whisky.",
      "content": "Try a simple Black Tooth Grin, without the Seagram's 7 whisky. Fill a shot glass with 1½ ounces (45 milliliters) of Crown Royal Canadian whisky. Add a splash of Coca-Cola to turn the drink's color. Serve and enjoy. Serve this over ice for an added chill. This is also known as the Crown and Coke."
    },
    {
      "title": "Try it with Jack Daniel's and Coca-Cola.",
      "content": "Try it with Jack Daniel's and Coca-Cola. Will a shot glass with 1 ounce (30 milliliters) of Jack Daniel's whiskey. Add a splash of Coca-Cola to turn the drink a darker color. Serve immediately. [3] X Research source"
    },
    {
      "title": "Skip the Coca-Cola, and use a mixture of alcohols instead.",
      "content": "Skip the Coca-Cola, and use a mixture of alcohols instead. Fill a cocktail shaker 2/3 of the way with ice. Add ½ ounce (15 milliliters) of each of the following: Goldschlager Cinnamon Schnapps, Jagermeister herbal liqueur, and Rumple Minze Schnapps. Shake for a few seconds, then strain into a chilled shot glass. Serve and enjoy."
    },
    {
      "title": "Use Amaretto Di Saronno liqueur instead of Seagram's 7 to make an Everhart.",
      "content": "Use Amaretto Di Saronno liqueur instead of Seagram's 7 to make an Everhart. Fill a highball glass with ice. Add 1 ounce (30 milliliters) of Crown Royal, 1 ounce (30 milliliters) of Amaretto Di Saronno, and 2 ounces (60 milliliters) of Coca-Cola. Serve and enjoy."
    },
    {
      "title": "Use Captain Morgan spiced rum instead of the Seagram's 7 to make a Pirate's Treasure.",
      "content": "Use Captain Morgan spiced rum instead of the Seagram's 7 to make a Pirate's Treasure. Fill a glass with 2 ounces (60 milliliters) of Captain Morgan's spiced rum, 1½ ounces (45 milliliters) of Crown Royal, and 12 ounces (355 milliliters) of Coca-Cola. Serve immediately."
    }
  ]
}