{
  "url": "https://www.wikihow.com/Get-a-Still-Image-from-a-Video",
  "title": "How to Get a Still Image from a Video",
  "steps": [
    {
      "title": "Play a video.",
      "content": "Play a video. You can play a video on the internet, such as a YouTube video, or you can play a video saved locally on your computer, or from a DVD using a media player such as Windows Media Player, Quicktime, or VLC. Some videos may have DMR copyright protection such as videos on iTunes or Apple TV. This can prevent your from taking a screenshot of the video."
    },
    {
      "title": "Click to pause the video.",
      "content": "Click to pause the video. It's usually at the bottom of the video in the center. Click the icon with two vertical lines to pause a video."
    },
    {
      "title": "Drag the playhead to the frame you want to capture.",
      "content": "Drag the playhead to the frame you want to capture. The playhead is the round dot or circle that appears in the time bar at the bottom of the video. You can click and drag the playhead to any part of the video. You may need to unpause and pause the video again to get to the exact part you want to screen capture."
    },
    {
      "title": "Switch to full screen mode.",
      "content": "Switch to full screen mode. The icon to switch to full screen mode is usually in the lower-right corner of the video. It may be an icon with a rectangle, or two arrows pointing out. If you are using QuickTime, click View followed by Enter Full Screen to enter full screen mode."
    },
    {
      "title": "Press ⊞ Win+prt scn on Windows, or ⇧ Shift+⌘ Command+3 on Mac to capture the entire screen.",
      "content": "Press ⊞ Win + prt scn on Windows, or ⇧ Shift + ⌘ Command + 3 on Mac to capture the entire screen. This takes an image of the entire screen. On Mac, you will hear the sound of a camera taking a photo. On Windows, the screen will dim for about a second. The \"Print Screen\" button may be labeled as \"PrntScn\", \"PrntScrn\", or \"Prt scr\" on different computers. On some Windows laptops, you may need to press \"Win + Ctrl + Prt scn\" or \"Win + Fn + Prt scn\" [1] X Research source On Windows tablets, press \"Win + Volume down\" buttons. On Mac, you can press \"Shift + Command + 4\" and click and drag to take a screenshot of a section of the screen instead of the whole screen. You can also press \"Prt scn\" on Windows to save the image to your clipboard. You can then immediately paste the image into an image editing program such as Photoshop, GIMP, or MS Paint."
    },
    {
      "title": "Locate the saved screenshot image.",
      "content": "Locate the saved screenshot image. You can find the image in the following locations: Windows: Pictures > Screenshots Mac: Desktop."
    },
    {
      "title": "Play a video.",
      "content": "Play a video. You can play a video on the internet, such as a YouTube video, or you can play a video saved locally on your computer or a DVD using a media player such as Windows Media Player, or VLC. Some videos may have DMR copyright protection such as videos on iTunes or Apple TV. This can prevent your from taking a screenshot of the video."
    },
    {
      "title": "Click to pause the video.",
      "content": "Click to pause the video. It's usually at the bottom of the video in the center. Click the icon with two vertical lines to pause a video."
    },
    {
      "title": "Drag the playhead to the frame you want to capture.",
      "content": "Drag the playhead to the frame you want to capture. The playhead is the round dot or circle that appears in the time bar at the bottom of the video. You can click and drag the playhead to any part of the video. You may need to unpause and pause the video again to get to the exact part you want to screen capture."
    },
    {
      "title": "Switch to full screen mode.",
      "content": "Switch to full screen mode. The icon to switch to full screen mode is usually in the lower-right corner of the video. It may be an icon with a rectangle, or two arrows pointing out."
    },
    {
      "title": "Press ⊞ Win+G.",
      "content": "Press ⊞ Win + G . This opens the Windows Game Bar on Windows."
    },
    {
      "title": "Click the camera icon.",
      "content": "Click the camera icon. It's the first icon on the right in the \"Capture\" panel. This takes a screenshot of your Windows desktop:"
    },
    {
      "title": "Locate the saved image.",
      "content": "Locate the saved image. The saved Game Bar screenshot images can be found at the following locations: Videos > Captures ."
    },
    {
      "title": "Play a video.",
      "content": "Play a video. You can play a video on the internet, such as a YouTube video, or you can play a video saved locally on your computer using a media player such as Windows Media Player, Quicktime, or VLC. Some videos may have DMR copyright protection such as videos on iTunes or Apple TV. This can prevent your from taking a screenshot of the video."
    },
    {
      "title": "Click to pause the video.",
      "content": "Click to pause the video. It's usually at the bottom of the video in the center. Click the icon with two vertical lines to pause a video."
    },
    {
      "title": "Drag the playhead to the frame you want to capture.",
      "content": "Drag the playhead to the frame you want to capture. The playhead is the round dot or circle that appears in the time bar at the bottom of the video. You can click and drag the playhead to any part of the video. You may need to unpause and pause the video again to get to the exact part you want to screen capture. You can switch full-screen mode or keep the video on-screen, or in a separate window."
    },
    {
      "title": "Press ⇧ Shift+⌘ Command+5.",
      "content": "Press ⇧ Shift + ⌘ Command + 5 . This displays the screen capture menu on macOS Mojave and later. On all versions of MacOS, you can press \"Shift + Command + 4\" and click and drag to take a screenshot of a section of the screen instead of the whole screen."
    },
    {
      "title": "Select a screen capture option.",
      "content": "Select a screen capture option. There are several options you can use to save an screen capture image in the screen capture menu. Use one of the following options to save a screen capture image: [2] X Research source Full Screen: To screen capture the whole screen, click the icon that resembles a computer monitor. Then click anywhere on the screen. Window: To capture an image of a particular window, click the icon that resembles a window and then click the window you want to capture. Screen Section: To capture an image of a section of the screen, click the icon that resembles a rectangle with dashed lines. Then click and drag a square around the section you want to capture. Then click Capture in the screen capture menu bar."
    },
    {
      "title": "Locate the saved image.",
      "content": "Locate the saved image. After taking a screen capture, the image will appear as a thumbnail in the corner of the screen. You can then find it on your desktop."
    }
  ]
}