{
  "url": "https://www.wikihow.com/Get-a-Girlfriend-in-Middle-School",
  "title": "How to Get a Girlfriend in Middle School",
  "steps": [
    {
      "title": "Make her notice you.",
      "content": "Make her notice you. If you want to get a girlfriend in middle school, then the first thing you have to do is make her notice you. You won't be able to make her your girlfriend if she has no idea who you are. To make her notice you, you should not only maintain clean clothes, good hygiene, and a killer smile, but you should find a way to make her see you — preferably when you're at your best. [1] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. If you know that you'll be running into her on a certain day, make sure to look your best. Even if you're in a bad mood, make an effort to smile and give her a positive vibe, so she wants to get to know you."
    },
    {
      "title": "Have a great time.",
      "content": "Have a great time. Invite her to hangout. Get to know her. Be upfront and friendly. It's always about the other person in a relationship. When you hang out try to get to know her more. No one likes to get into a relationship with someone they don't know. She won't be impressed if she sees you sleeping in class, or kicking your locker because it won't open. You should make her see that it's really fun to hang out with you."
    },
    {
      "title": "Get her attention in class.",
      "content": "Get her attention in class. You don't have to be the teacher's pet to get the girl's attention in class. But you should do a few things to make her want to get to know you. Let her see you talking with friends before class starts so she knows you're social. Pay attention and answer some questions correctly so she knows you're smart. And don't be rude to the teacher just to make her laugh. [2] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. You can make some jokes in class to show that you like to have fun, but not at the expense of others or the teacher. That'll make her think that you're too much of a wise guy. If you make eye contact or walk into the room together, don't be afraid to say hi. If you're sitting next to her, you can make small talk about whether she's ready for the test, if she understood the homework, or just ask her how her day is going. You can ask her to help you in class or have her tutor you. Just go up to her and say, \" Listen I'm having trouble in math and I was wondering if you could help me after school sometime?\"."
    },
    {
      "title": "Get her attention outside of class.",
      "content": "Get her attention outside of class. You can also make a big impression on the girl if you run into her in the hall, the mall, or at a party. You don't have to do a backflip to make her see that there's something special about you. If you see her out in an unexpected place, don't be shy and avoid her because you weren't prepared to see her. Instead, go up to her and ask her how she's doing. [3] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. If you see her in the hall, say hi and even walk next to her if you're feeling bold. If you see her at the mall or at a party, let her see you talking to your friends, acquaintances, and other girls to make her see that you're a cool guy who can get along with anyone."
    },
    {
      "title": "Be friendly.",
      "content": "Be friendly. You may think that it's not cool to be friendly, to smile, or to actually act like you care about the girl, but the opposite is true. She should be able to see your face light up when she comes your way, and to start to see that you may like her without feeling smothered or put off. So, if you see her, give her a big smile or a wave and ask her how she's doing. Don't be afraid that you don't look cool just because you're not ignoring her. [4] X Research source Remember that most guys in middle school are nervous about how to talk to girls. If you keep your cool and say hi to her like it's no big deal, you'll stand out from the pack."
    },
    {
      "title": "Start a good conversation with her.",
      "content": "Start a good conversation with her. Saying hi and making her see you having a great time is a great way to make her notice you, but when the time comes, you have to be able to put your money where your mouth is and to actually talk to the girl. She'll be more likely to want to date you if she knows that you can actually hold up your end of a conversation and make her have fun and feel at ease. [5] X Research source Here's how to do it: Start off by making her feel at ease. Pay attention to her and make eye contact without cornering her or making her nervous. Ask her about whatever's coming up next. If you see her in the halls, ask about her next class. If you see her in the halls, ask her if she's going to a club meeting or what she's up to after school without being too nosy. Make her laugh. If you start off by poking fun at yourself or making a harmless joke about a teacher or someone you both know, you'll start off on the right foot."
    },
    {
      "title": "Show an interest in her life.",
      "content": "Show an interest in her life. If you want the girl to feel like she means something to you, then you have to show an interest in her life. This doesn't mean you should grill her and make her feel like you're interrogating her, but it does mean that you should make her see that you care about her interests, her friends and family, and the things that are important to her. [6] X Research source Here are some things to keep in mind: Ask her about her dance classes or any sports she plays. Girls love talking about their interests. Ask her about her pets. If she has a cat or a dog, she'll love that you care. Ask her about her friends. Girls love talking about their friends — and any drama that they may be dealing with. Make sure that you have a balance. She should find out things about you, too, instead of revealing a lot without getting anything back."
    },
    {
      "title": "Ask for her opinion.",
      "content": "Ask for her opinion. If you want the girl to see that she matters to you, then you should ask for her opinion on a variety of subjects to let her see that you care about what she thinks. You can flirt with her just by asking if she likes your new shoes or asking what she thinks you should do for your next haircut, but you can also ask her opinion on more serious matters. If you had an interesting debate in a class you had together, you can talk to her after class to see what she thinks on the matter. If you know that you both just saw a new movie, you can ask her if she liked it and why or why not. Ask about her favorite music. See what she likes and doesn't like to listen to -- who knows, you may even end up going to a concert together."
    },
    {
      "title": "Compliment her.",
      "content": "Compliment her. If you want to make her feel special, then you should compliment both her appearance and her personality. You shouldn't go over the top and say anything that makes her uncomfortable; for example, don't say, \"You are the most beautiful girl in the world,\" instead, say, \"Hey, I like your shirt. It matches your eyes perfectly.\" [7] X Research source Here are some other nice complements that can make her feel special without overwhelming her: \"I have so much fun talking to you.\" \"You have a great laugh.\" \"Has anyone ever told you that you look like...(name of cute actress here)?\" \"It's cool that you have time to do well in school and play soccer.\""
    },
    {
      "title": "Flirt with her.",
      "content": "Flirt with her. Once you've gotten to know each other a bit better, you can start flirting with the girl by teasing her, being playful, and let her see that you like her in cute and subtle ways. If you want to flirt with her, then you have to use your body language to let you know you care by facing her, making eye contact, and smiling at her, and to drop subtle hints that you like her. [8] X Research source Tease her a bit and let her tease you back. Don't tease her about anything too serious that can be taken the wrong way. Instead, tease her about her love for the color purple or her obsession with any boy band. You can break the touch barrier by playfully hitting her arm or letting her push you a bit if you've said something that makes her laugh."
    },
    {
      "title": "Let her see that you're paying attention.",
      "content": "Let her see that you're paying attention. If you want the girl to start thinking that you want her to be your girlfriend, then you have to make her see that you actually pay attention to the things she says or does. If she gets a new haircut or wears a new outfit, let her know it looks great. If she told you on Friday that she was nervous about her weekend ballet recital, ask her how it went on Monday. It's the little things that will make her see that you're important to her. If she once mentioned that Ryan Gosling is her favorite actor, you can mention that a new movie that he's in is playing that weekend. She'll be touched that you remember what she's interested in -- and may even want to go to the movie with you. If you've been talking to her for a while and can tell that she's not being her usual chipper self, you can casually say, \"I can see that something's wrong. Do you want to talk about it?\" Even if she's not ready to talk, she'll appreciate that you care. If you know she has a big test that she's nervous about, wish her luck and ask her how it went afterwards. You don't have to memorize her entire schedule to be aware of the key moments that matter to her."
    },
    {
      "title": "Go out of your way for her.",
      "content": "Go out of your way for her. If you're already flirting and getting to know each other, then you can start going out of your way for the girl to let her know she matters to you. You don't have to make any grand gestures to make her see that you're willing to do things for her and care about how she's feeling. Here are some things that you can do: If you know she's really busy during lunch because she has to study for a test, offer to stand in line for lunch for her. If you've started talking in the halls a lot, walk out of your way so you can escort her to her next class. If your friends are waiting for you to catch up with them, don't just leave her right away; talk until you find a natural stopping point in the conversation to show her that talking to her is important, even if it means making your friends wait for a minute or two."
    },
    {
      "title": "Make sure she likes you.",
      "content": "Make sure she likes you. Though there's no guaranteed way to know if a girl likes you without asking, there are a number of signs that can let you know that she likes you as more than a friend. If you're pretty sure she likes you or even just suspect that she likes you, then you'll have much more confidence when you ask her to be your girlfriend. Here are some signs that she likes you: [9] X Research source If her face lights up every time you approach her and you can tell that she really likes talking to you. If she's always laughing or giggling when she talks to you, even if you're not being that funny. If her friends start giggling or abruptly stop talking when they pass you when she's around. When she's dropped hints that it would be cool to have a boyfriend or has asked about your plans for the weekend, hoping you'll invite her to something."
    },
    {
      "title": "Find the right time and place.",
      "content": "Find the right time and place. If you want to raise your chances of success when you ask her out, then you should try to ask her in the right time and place, when it's most convenient for both of you. Pick a place where you two can be alone, or reasonably alone, so she has time to think and doesn't feel pressure to report right back to her friends. Pick a time when she's in a good mood and not stressed out about rushing off to her soccer game or to her next class. [10] X Research source You don't have to worry too much about finding the perfect or even the most romantic place to ask her out. If you wait too long for everything to be just right, you may miss your chance. Asking her in the hallways after school is a good idea as long as it doesn't make her late for practice."
    },
    {
      "title": "Let her know that you like her.",
      "content": "Let her know that you like her. You don't have to tell her that she's the most beautiful girl you've ever seen or that you can't stop thinking about her, even if that's what you're feeling. Start small by telling her that you think she's really cool and that you've enjoyed getting to know her. And if you have a lot in common, you can mention that, too. This shouldn't take more than a minute. You don't have to list every reason that you like her. [11] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. Say, \"I just really wanted to tell you that\" so she feels flattered and like you've put a lot of time into telling her how you feel. This would also be a good time to gauge her reaction. If she leans closer to you, smiles or blushes, or even starts telling you that she feels the same way, then you can ask her out. If she backs away, says she has to go, or doesn't respond well, then you may not want to upset her even more by asking her out."
    },
    {
      "title": "Ask her out.",
      "content": "Ask her out. Once you've told her how you feel about her, you should ask her to go out with you. In middle school, this usually is the same thing as asking her to be your girlfriend, so don't be afraid to ask that. Look her in the eyes and ask her with confidence. Don't look at the floor or mumble. You can even practice asking her out in the mirror if that makes you more comfortable. [12] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. Just a simple, \"Do you want to go out with me?\" will do the trick. She'll appreciate that you're being forward and direct."
    },
    {
      "title": "React maturely.",
      "content": "React maturely. The last thing you have to do is to react maturely once you've asked the girl out. If she says yes and tells you that she likes you too, you should let her see how happy you are. You don't have to jump up and down and celebrate, but don't worry about looking too cool to really care -- making her see how much she means to you will get your relationship off on the right foot. Be prepared with a date idea if she does say that she wants to go out with you. You can ask her to go to the movies or to an upcoming dance. This will make her see that you've put a lot of thought into asking her out. If she turns you down, don't be mean or walk off without saying goodbye. Thank her for talking to her and tell her you hope she has a nice day. Even if she doesn't want to go out with you, she'll appreciate your maturity. And whatever happens, remember not to take yourself or the relationship too seriously. Middle school is the perfect time for you to get some relationship experience without getting in over your head. At some point before or during the date kiss her. But make sure both you and her are comfortable and in a good mood"
    }
  ]
}