{
  "url": "https://www.wikihow.com/Make-a-Blow-Job-Shot",
  "title": "How to Make a Blow Job Shot",
  "steps": [
    {
      "title": "Pour the coffee liqueur.",
      "content": "Pour the coffee liqueur. Pour 1/2 an ounce of the coffee liqueur into the shot glass. This should fill about 1/3 of the shot glass. [1] X Research source"
    },
    {
      "title": "Pour the Irish cream.",
      "content": "Pour the Irish cream. Gently pour 1 ounce of Irish cream into the shot glass. You don't want to pour it too fast because you want the Irish cream to layer on top of the coffee liqueur. There should be a clear delineation between the two liqueurs. [2] X Research source If you are having a hard time getting the liqueurs to stack, try tipping the shot glass to the side and gently tipping the Irish cream over the side of the shot glass. This will help regulate the stream of liqueur and prevent them from combining. Although Irish cream is the most common ingredient, there are variations. Instead of using Irish cream, some people prefer Amaretto almond liqueur or banana and orange liqueur. If you make this variation, use a 1 ounce of Amaretto or 1/2 an ounce of each of banana liqueur and orange liqueur."
    },
    {
      "title": "Top with whipped cream.",
      "content": "Top with whipped cream. Once you have stacked the two liqueurs, you need to top the shot with a dollop of whipped cream. Shake the can well. Tip the can over the shot glass and press down the nozzle. Cover the top of the shot in whipped cream. [3] X Research source If it is someone's first time taking a Blow Job shot, bartenders will often put a stemless maraschino cherry on top."
    },
    {
      "title": "Put your arms behind your back.",
      "content": "Put your arms behind your back. There is a very specific way to take a Blow Job shot. Standing in front of the shot, put your hands behind your back. [4] X Research source If you have long hair, you might want to push it behind you or tie it back. You don't want your hair to get in the whipped cream."
    },
    {
      "title": "Pick up the shot with your mouth.",
      "content": "Pick up the shot with your mouth. Bend over the shot, placing your lips around the edge of the shot glass. Check to see if you have the glass securely in your mouth and your lips cover every edge. You don't want the glass to fall out of your mouth or have the shot spill out on your face. [5] X Research source Make sure you place the shot on a surface that you can easily reach with your mouth. You don't want to have to bend over too far to reach the shot glass."
    },
    {
      "title": "Take the shot.",
      "content": "Take the shot. Grasping the shot in your mouth, lift back up. Lean your head back, pouring the shot into your mouth. Pulling your arms from behind your back, take the empty shot glass from your mouth and sit it back on the table. [6] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}