{
  "url": "https://www.wikihow.com/Make-Chinese-Fried-Rice",
  "title": "How to Make Chinese Fried Rice",
  "steps": [
    {
      "title": "Rinse the rice.",
      "content": "Rinse the rice. Before cooking your rice, it’s a good idea to rinse it in a strainer. That will remove any dust, starch, or other debris that might be on the surface of the rice. Place the rice in a strainer, and rinse it with cold water. [1] X Research source If you’re short on time, you can skip rinsing the rice. Be aware that you may wind up with stickier cooked rice if you don’t, though."
    },
    {
      "title": "Bring the water to a boil.",
      "content": "Bring the water to a boil. In a small to medium pot, add water in a 1:2 rice to water ratio. For this recipe, you’ll need to add 2 cups (473 mL) of water to the pot. Place the pot on the stove on high heat and bring it to a boil. [2] X Research source Keep in mind that rice expands when it cooks so be sure your pot is large enough. A 2-quart (2.5 L) pot is usually large enough for 1 cup (195 g) of uncooked rice."
    },
    {
      "title": "Add the rice and salt.",
      "content": "Add the rice and salt. Once the water comes to a boil, pour 1 cup (195) of medium-grain white or brown rice and ½ teaspoon (2.84 g) salt into the pot. Lower the heat to medium low to bring the pot back to a gentle simmer. [3] X Research source 1 cup of uncooked rice should produce approximately 3 cups of cooked rice. In addition to the salt, you can also flavor your rice with butter. Mix in 1 tablespoon (approximately 14 g) butter if you desire."
    },
    {
      "title": "Cover the pot and let it cook for at least 18 minutes.",
      "content": "Cover the pot and let it cook for at least 18 minutes. After the pot comes back to a gentle simmer, turn the burner’s heat down to low. Place the lid on the pot, and allow the rice to cook for at least 18 minutes. At that point, start checking on the rice. It's ready when it is firm but tender or no longer crunchy. Your rice may be slightly sticky when it’s finished cooking, but it shouldn’t be gummy. [4] X Research source Brown rice takes longer to cook, so begin checking it after it’s cooked for approximately 30 minutes. Don’t take the lid off the pot before the 18- or 30-minute mark, depending on what type of rice you’re cooking. You’ll allow steam to escape, which can actually lengthen the cooking time. If there’s still water in the pot when the rice is finished, drain the excess into the sink."
    },
    {
      "title": "Turn the heat off and let the rice stand.",
      "content": "Turn the heat off and let the rice stand. When you’re sure that the rice is done, turn off the burner and let it to sit in the pot with the lid still on for 2 to 3 minutes. That will allow the rice to steam for a few more minutes to ensure that it’s finished cooking. [5] X Research source"
    },
    {
      "title": "Spread the rice on a tray and set under a fan for an hour.",
      "content": "Spread the rice on a tray and set under a fan for an hour. You want your rice to be slightly dry when you fry it, so spread the cooked rice out in a single layer on tray, cookie sheet, or other large pan. Set the pan beneath a table fan for approximately 1 hour to help dry out the rice. [6] X Research source"
    },
    {
      "title": "Heat a wok on the stove.",
      "content": "Heat a wok on the stove. Traditionally, fried rice is made in a wok, so that's the best option when you’re frying the dish at home. Set the pan on the stove, and turn the heat to medium to preheat it for approximately five minutes. [7] X Research source If you don’t have a wok, a large skillet or frying pan can work for frying your rice too."
    },
    {
      "title": "Add a neutral to the pan.",
      "content": "Add a neutral to the pan. When the pan is heated, pour 2 tablespoons (approximately 30 mL) of a neutral oil, such as canola or grapeseed, in it. Turn the pan slowly to ensure that the oil evenly coats the bottom. [8] X Research source Neutral oils are those that don't have a strong taste on their own, so they won't add any extra flavor to your dish. In addition to canola and grapeseed, corn, peanut, and safflower are others to consider."
    },
    {
      "title": "Cook the ginger, garlic, onion, peas, and carrots until tender.",
      "content": "Cook the ginger, garlic, onion, peas, and carrots until tender. Add 1 small white onion that’s been chopped, 1 cup (150 g) frozen peas and carrots that have been defrosted, 1 teaspoon (5 g) finely chopped ginger, and 1 teaspoon (5 g) finely chopped garlic to the pan. Turn the heat up to medium high, and fry the vegetables until they are tender. It should take approximately 10 minutes. [9] X Research source You can add any type of vegetable to the fried rice that you like. Some options you may want to consider include chopped cabbage, chopped French beans, chopped bell peppers, chopped mushrooms, chopped water chestnuts, or chopped green onions. Check out more fried rice recipes from wikiHow users on the “Need an easy way to make fried rice” forum ."
    },
    {
      "title": "Pour the beaten eggs into one half of the pan and scramble them.",
      "content": "Pour the beaten eggs into one half of the pan and scramble them. When the vegetables have finished cooking, use a spatula to push them to one side of the pan. Next, pour 2 eggs that have been lightly beaten into the pan. Scramble them with the spatula, and once they’ve set up, mix them into the vegetables. [10] X Research source If you prefer, you can use an egg substitute in place of the eggs."
    },
    {
      "title": "Mix in the cooked rice, soy sauce, and sesame oil.",
      "content": "Mix in the cooked rice, soy sauce, and sesame oil. Once the eggs are cooked and mixed with the vegetables, add in the 3 cups of cooked rice. Pour 2 to 3 tablespoons (30 to 44 mL) of soy sauce, depending on your personal taste, on top of the rice. [11] X Research source Next, mix in 1 tablespoon (15 mL) of sesame oil, and stir all of the ingredients together until well combined. [12] X Research source In place of the soy sauce, you can use fish sauce or oyster sauce. You can also add in some cooked chicken or steak that’s been cut into strips or chopped if you want to make a meal out the rice. It's a good idea to taste the rice after you mix in the soy sauce and sesame oil. If necessary, add salt and freshly ground black pepper to taste."
    },
    {
      "title": "Fry the mixture until heated through.",
      "content": "Fry the mixture until heated through. Continue stirring the mixture in the pan as it cooks on medium heat. Fry the rice until all of the ingredients are fully heated through, which should take approximately 5 minutes. [13] X Research source If it seems like the rice is starting to scorch, lower the heat. Add a few additional drops of oil to the pan if the rice mixture is sticking to it. You may want to garnish the finished rice with chopped green onions."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}