{
  "url": "https://www.wikihow.com/Lighten-Blonde-Hair",
  "title": "How to Lighten Blonde Hair",
  "steps": [
    {
      "title": "Use lemon juice.",
      "content": "Use lemon juice. Lemon juice has be used as a natural bleaching agent in hair for a very long time. This is how it works: the citric acid in lemon juice opens up the hair cuticle and pulls out pigment, leaving hair stripped of color. Mix half a cup of fresh squeezed lemon juice with half a cup of water and pour into a spray bottle. Spritz the lemon juice mixture into damp hair, then sit outside in the sun for 30 minutes, as the sunlight activates the citric acid. After 30 minutes (and no longer) rinse the stick lemon juice from your hair and use a deep conditioning treatment, as lemon juice can be very drying on your hair and scalp. [1] X Research source"
    },
    {
      "title": "Use honey and olive oil.",
      "content": "Use honey and olive oil. Honey is a natural lightening agent, while olive oil helps to nourish your hair, making this a less damaging lightening treatment than most. Add 1/4 cup of honey to 1/4 cup of olive oil and stir until well combined. Use your hands to work the sticky mixture into damp hair, ensuring even coverage. Cover your hair with a plastic shower cap or some cling wrap. Leave the honey and olive oil mixture to sit in your hair for at least 30 minutes. When you're ready, rinse the mixture out in the shower -- it make take a couple of shampoos to get the sticky honey out of your hair. Honey will only subtly lighten your hair each time you apply. Reapply the mixture as often as you'd like to get the lightening effect you're looking for."
    },
    {
      "title": "Use chamomile tea.",
      "content": "Use chamomile tea. Chamomile flowers contain natural compounds that help to lighten blonde hair, making chamomile tea an easy and effective treatment. Boil a pot of water, then place five chamomile tea bags to steep in the pot. When the water has cooled completely, remove the teabags and pour the cold tea over your hair (preferably in the shower). Allow the chamomile tea to sit in your hair for about half an hour before rinsing. Like with the lemon juice, the chamomile will work more effectively if you sit in the sun for a while as it dries into your hair."
    },
    {
      "title": "Use cinnamon.",
      "content": "Use cinnamon. To add some caramel blonde tones to your hair, you can use cinnamon in a nourishing and delicious-smelling treatment. Depending on your natural undertones, this could also result in a strawberry blonde tint to your hair. Take a teaspoon of cinnamon (from a new jar to ensure it hasn't gone stale) and mix it with a generous handful of your regular conditioner. Work the conditioner through your hair, using a comb to ensure that it's evenly distributed. Cover your hair with a plastic shower cap or some cling wrap and leave the cinnamon condition to sit in your hair for several hours, or overnight if possible. Wash the cinnamon out in the shower with shampoo."
    },
    {
      "title": "Use rhubarb.",
      "content": "Use rhubarb. Rhubarb adds a yellowish tint to hair, which is good for people with darker blonde hair. It's best to use fresh, in-season rhubarb during the summer months. Take two stalks of rhubarb, wash them, then roughly chop them into small chunks. Add the rhubarb chunks to a pot of cold water, then bring the pot of water to the boil over a medium heat. Once boiled, remove the pot from the heat and allow the water to cool completely. Once the water has cooled, strain the out the rhubarb piece, then pour the water over your hair. Leave the rhubarb water to sit in your hair for 10 to 15 minutes (while sitting in the sun, if you like) then rinse out with fresh water."
    },
    {
      "title": "Use baking soda.",
      "content": "Use baking soda. Baking soda can be used to strip chemical build-up from the hair while also helping to lighten blonde hair over time. Take the baking soda into the shower and sprinkle it over your hair once it's wet. Use your fingers to work the baking soda into the hair. It should form a paste-like consistency when mixed with water. Always be sure to condition after you use baking soda. This treatment can be drying, so it's important to replenish moisture and add some softness to your strands by conditioning after every baking soda treatment. Use this baking soda treatment to clean your hair (instead of using shampoo) at least once a week. Your hair will gradually lighten over time."
    },
    {
      "title": "Use vitamin C.",
      "content": "Use vitamin C. Vitamin C is not only great for your health, it will also help to strengthen, nourish and lighten your locks. Take 5 to 10 tablets from a bottle of vitamin C supplements and crush them up using a pestle and mortar until they form a fine powder. Add this vitamin C powder to your regular shampoo and wash your hair as normal. Do this once a week to gradually lighten your hair over time. [2] X Research source"
    },
    {
      "title": "Use vinegar.",
      "content": "Use vinegar. Vinegar has been discovered as an effective hair lightener -- apple cider vinegar in particular. Although it's possible to apply vinegar to your hair straight from the bottle, this can be very drying and damaging for your hair. Therefore, it's better to dilute the vinegar to half strength with water first. Pour the diluted vinegar over your hair and leave to sit for at least 15 minutes before rinsing out and shampooing. Repeat once a week for a gradual lightening effect."
    },
    {
      "title": "Use Sun-In.",
      "content": "Use Sun-In. Sun-In is a classic hair-lightening product that became popular in the 90s. It is a very cheap and effective way to lighten blonde to medium brown hair, although the results tend to look more golden yellow than white blonde. Sun-In can be purchased in most drug stores and online. It should be spritzed into damp hair, then worked through with a comb (this will prevent the color from developing unevenly). Once the color is in, you should sit in the sun to activate the lightening agents. Alternatively, the heat from a hair dryer will also work. The more often you use Sun-In, the lighter your hair will be."
    },
    {
      "title": "Use peroxide.",
      "content": "Use peroxide. Peroxide will effectively bleach your hair, leaving it a lighter shade of blonde. However, peroxide is also quite damaging for your hair, so it's best not to repeat this treatment too frequently. This treatment is also not recommended for those who already have damaged locks, as it will leave hair more dry, damaged, and brittle. Bottles of hydrogen peroxide can be purchased at the drugstore. Mix one part hydrogen peroxide with one part water and pour it into a clean spray bottle. Apply the peroxide solution evenly over your entire head of hair, but try to avoid your scalp as it is easily irritated by the peroxide. Leave the peroxide solution in your hair for 20 to 40 minutes -- the longer you leave it, the lighter your hair will become. Just don't leave the peroxide in for any longer than 40 minutes, as it can severely dry out your hair. Shampoo your hair twice to remove all traces of the peroxide and apply a deep conditioning treatment to your hair."
    },
    {
      "title": "Use lemon vodka.",
      "content": "Use lemon vodka. Some sources recommend using lemon-flavored vodka to lighten blonde hair. The alcohol combined with lemon juice helps to strip pigment from the hair. If you're under the legal drinking age in your country, you will need your parent's permission to use this treatment, and their assistance in purchasing the vodka. Pour the lemon vodka over your hair and use a comb to distribute it evenly. If you want more of a highlighted effect, dip a cotton ball in the alcohol and use it soak individual strands of hair, from the roots to the tips. Sit in the sun for up to 30 minutes to intensify the bleaching effect of the alcohol, then rinse thoroughly and wash with shampoo."
    },
    {
      "title": "Use a lightening shampoo.",
      "content": "Use a lightening shampoo. If you're looking for a less damaging option that will still effectively lighten your blonde hair over time, you should use a lightening shampoo and conditioner combo -- such as John Frieda's \"Go Blonder\" range. These lightening shampoos and conditioners use a combination of lightening ingredients that includes chamomile and citrus. They can be substituted for your regular hair care products and used on a daily basis. They work best on hair that is already a light to medium shade of blonde, though darker blondes will still notice a gradual lightening effect over time."
    },
    {
      "title": "Use blonde hair dye.",
      "content": "Use blonde hair dye. Of course, if you want lighter blonde hair in a hurry and you're willing to spend a little more money, you can always use hair dye. Most store-bought kits will do a pretty good job of lightening hair (provided you follow the instructions), though the results can differ depending on your natural hair color. All-over dyes are probably the simplest option, but if you are significantly changing the color of your hair the regrowth will be quite obvious, so you will have to reapply the dye every couple of months or so. Alternatively, you can buy an at-home highlighting kit, where you only apply the color to strands of hair on top of your head and around your face (where the sun would naturally hit). These are a little trickier to apply, but don't require quite as much maintenance. [3] X Research source If you don't feel comfortable putting color in your hair at home, see a professional stylist instead -- just be prepared to pay a lot of money for blonder hair!"
    },
    {
      "title": "Protect lightened hair from the sun.",
      "content": "Protect lightened hair from the sun. Once your hair has been lightened, it tends to be a little more sensitive to sunlight. Blonde hair, in particular, can become brassy, yellow or faded by the sun. Therefore, it's important that you protect your lightened hair by wearing a sunhat or by spritzing your hair with hairspray containing UV protection when outdoors."
    },
    {
      "title": "Invest in a high-quality purple shampoo.",
      "content": "Invest in a high-quality purple shampoo. Since blonde hair is prone to orange and brassy undertones, it's a good idea to look for a quality purple toning shampoo. Rinsing your hair with this 1-2 time a week in place of your regular shampoo will help eliminate brassy tones from both natural and bottle blonde hair. Not every shampoo with a purple tint is a blonde toning shampoo. Be sure to read the label and instructions carefully to make sure the shampoo you're looking at is meant for blonde hair. You don't want to use purple shampoo too much or else you might over-intensify your color."
    },
    {
      "title": "Be careful with saltwater and chlorine.",
      "content": "Be careful with saltwater and chlorine. Saltwater can fade and damage blonde hair, while chlorine dries it out and causes it to take on a green tinge. You can prevent this from happening by rinsing your hair with fresh water before and directly after you go swimming. You can also buy special protective hair masks which you apply to your hair before swimming to shield it from salt and chlorine. [4] X Research source"
    },
    {
      "title": "Don't over-wash your hair.",
      "content": "Don't over-wash your hair. The detergents in most store-bought shampoos and conditioners can strip the blonde color from your hair over time. Therefore, you should avoid washing your hair every day -- most hair types don't even need it. Try to cut back to once every two or three days -- you can use a dry shampoo in between washings if necessary. When you do wash your hair, try to use a sulfate-free shampoo and conditioner as these are kinder to hair."
    },
    {
      "title": "Deep condition your hair at least once a week.",
      "content": "Deep condition your hair at least once a week. Lightened or dyed blonde hair is more susceptible to damage and color fading than other hair types. Therefore, it is important to keep your hair well-conditioned in order to keep the color looking as luminous as possible. You can do this by deep conditioning your hair once or twice per week. Use a store-bought deep conditioning product, a natural oil such as coconut or argan oil, or use a homemade hair mask using ingredients from your kitchen."
    }
  ]
}