{
  "url": "https://www.wikihow.com/Make-a-Discover-Card-Payment",
  "title": "How to Make a Discover Card Payment without Complications",
  "steps": [
    {
      "title": "Visit the Discover website.",
      "content": "Visit the Discover website. Head over to https://www.discover.com/credit-cards/ from your desktop computer or mobile device. From there, you can create an account, review your existing credit card balance, and make payments. The mobile version of the Discover card website may look a little different from the full version, but you should have no trouble tracking down the links you need. Download the Discover Mobile app to manage your payments and account details all from one convenient hub. [2] X Research source"
    },
    {
      "title": "Create an account.",
      "content": "Create an account. Click the “Register Account” option in the small Login box in the upper righthand side of the page. You’ll be prompted to provide your account number and the expiration date of your card, along with your birth date and the last 4 digits of your Social Security number. [3] X Research source Once you’ve registered your account, you’ll be able to set a custom user ID and password. Be sure to write this information down somewhere secure so you won’t lose it. If you already have an account on the Discover website, you can skip this step and put in your login info instead."
    },
    {
      "title": "Log in to the Discover Account Center.",
      "content": "Log in to the Discover Account Center. If you’re creating an account for the first time, you should be logged in automatically after submitting all the necessary user info. Otherwise, you’ll need to return to the main website and locate the Login box in the upper righthand corner of the page. Specify your account type, then type in your user ID and password to log in. If you’re bad about forgetting your login info, check the “Remember User ID” box to store it in your computer for future visits. Avoid choosing the “Remember User ID” option if you’re using a public computer where someone else might be able to access your credit card information."
    },
    {
      "title": "Click the \"Make a Payment\" link.",
      "content": "Click the \"Make a Payment\" link. Doing so will redirect you to a separate page where you can handle the particulars of your credit card payments."
    },
    {
      "title": "Enter the amount you want to pay.",
      "content": "Enter the amount you want to pay. Refer to your existing card balance displayed at the top of the page to determine how big a payment you want to make. You’ll need to enter at least the minimum amount specified in order for your payment to be accepted. When you're done, click the \"Submit Payment\" button to send your payment info off for processing. [4] X Research source The money for your payment will be deducted directly from your bank account. It’s not an option to pay your credit card bill using a debit card or another credit card. However, you can make up to two payments a day using different bank accounts. If possible, pay more than the minimum required amount. Not only is this good for your credit score, it can also help you avoid accumulating late fees and interest charges."
    },
    {
      "title": "Detach the payment coupon from your monthly account statement.",
      "content": "Detach the payment coupon from your monthly account statement. At the top of your statement you’ll see your total balance, your required monthly minimum payment, and all recent transactions. At the bottom, you’ll find a detachable payment coupon. Tear off this portion of the statement so you can send it in along with your payment. [5] X Research source Remove the payment coupon carefully to avoid ripping it and losing any important info."
    },
    {
      "title": "Fill out a check or money order with your minimum monthly payment.",
      "content": "Fill out a check or money order with your minimum monthly payment. Provide all the necessary details of your payment, including your name, the day’s date, and the numerical and written amount that the check is worth. Write your account number on the memo line to identify what the payment is for. If you’re sending a payment via money order, you’ll also need to sign the front side of the form. Never send cash through the mail, as it could easily be intercepted and stolen by a third party."
    },
    {
      "title": "Address your envelope to Discover’s Financial Services department.",
      "content": "Address your envelope to Discover’s Financial Services department. When providing the recipient information, make sure you put down the address for the main Discover billing office rather than the company headquarters or a regional office. The address for Discover’s Financial Services department is P.O. Box 6103, Carol Stream, IL 60187-6103. [6] X Research source This address is also conveniently listed on the top of the payment coupon, so you shouldn’t have to worry about forgetting it. If you accidentally mail your payment to the wrong place, there’s a chance it may not be processed before the due date."
    },
    {
      "title": "Mail your payment 7-10 business days before it’s due.",
      "content": "Mail your payment 7-10 business days before it’s due. It’s called “snail mail” for a reason. If you want to be certain that your payment will be received on time, it’s a good idea to send it out at least a week before the listed due date. Otherwise, there’s no telling when it might arrive. Keep in mind that the mail doesn’t run on the weekends in some parts of the world. To make sure your payment will be received on time, only include business days in your 7-10 day window."
    },
    {
      "title": "Take processing times into account.",
      "content": "Take processing times into account. Payments can be made online at any time, but they’re not always credited instantly. For your payment to successfully go through on the same day, you must submit it by 5:00pm EST. Transactions initiated after that time will be credited to the following day. Weekends are the only exception to standard processing times. Any payment made after 5:00pm EST on Friday won’t be credited until Sunday. Website unavailability may affect the timeliness of a payment. Be aware that you’re responsible for any payments that are received late due to technical difficulties."
    },
    {
      "title": "Always make the minimum payment to avoid incurring additional fees.",
      "content": "Always make the minimum payment to avoid incurring additional fees. Check your bank balance before you finalize your payment. If you don’t have enough money in your account to cover the minimum required amount, you could be charged a “return check fee.” This means that the company has the right to apply an additional fee to your account if the first payment is rejected. [7] X Research source Return check fees are also levied for cancelled checks and payments that come from an account that has been recently closed. On top of a return check fee, you’ll be at risk of a late fee if you don’t provide an alternative form of payment before your bill’s due date."
    },
    {
      "title": "Schedule a payment for later if you don’t currently have enough money.",
      "content": "Schedule a payment for later if you don’t currently have enough money. Look for the “Schedule a Payment” link among the other payment options in the Account Center. Use the calendar tool to provide an exact date for the payment. This feature can come in handy if you want to go ahead and set up a payment while it’s on your mind but need to wait to until you have more funds in your account to actually withdraw the money. After choosing a date, you can decide whether you want to send the money from your account manually or have it drafted automatically. You’ll need to make your payment by 5:00pm EST on the payment posting date for it to be considered on time."
    },
    {
      "title": "Set up billing notifications to avoid forgetting your due dates.",
      "content": "Set up billing notifications to avoid forgetting your due dates. Visit Discover’s reminders page and fill out your account information to set up email notifications. You can customize your settings to send out reminders when your bill is due, when a payment has been received, or when you’ve recently made a large purchase. Be sure to mark your email notifications from Discover as “important” so they don’t end up in your spam folder. If you prefer, you can also have billing alerts texted directly to your cell phone."
    },
    {
      "title": "Call Discover directly if you have any questions.",
      "content": "Call Discover directly if you have any questions. If you live in the US, you can get in touch with the company directly by calling 1-800-DISCOVER. For callers outside the US, the number is 1-801-902-3100. Representatives are available to field questions and concerns 24 hours a day, 7 days a week, so you should have no problem getting someone on the phone. [8] X Research source You can also mail general inquiries to P.O. Box 30943, Salt Lake City, Utah 84130-0943."
    }
  ]
}