{
  "url": "https://www.wikihow.com/Live-to-Be-100-Years-Old",
  "title": "How to Live to Be 100 Years Old",
  "steps": [
    {
      "title": "Exercise to make your body strong enough to live for 100 years.",
      "content": "Exercise to make your body strong enough to live for 100 years. Doing a small amount of exercise will keep your body strong and fit as you age. Develop an exercise routine while you are young and then maintain it over the decades to come. This will make you healthier now by managing your weight, building muscle, and reducing stress. It will also benefit your future health by strengthening your bones, improving your balance, and boosting your immune system. An ideal exercise program includes 15–30 minutes of aerobic exercise five times per week and strength training twice per week. You can do both without having to purchase expensive gym memberships. Many people enjoy jogging, walking, or biking. Strength training is particularly important for postmenopausal women, who become more vulnerable to osteoporosis. Doing weight training will not only make you stronger, but it will also build bone density. This will make you less likely to break a bone if you fall as you get older. You can purchase weights at your local athletics shop. [1] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source"
    },
    {
      "title": "Get an annual check-up.",
      "content": "Get an annual check-up. Don’t skip the annual check-ups just because you feel healthy. The best time to catch health problems is right at the beginning. Then they can be quickly and easily dealt with. Be aware of your family history. If you have a genetic predisposition to some diseases, get screened regularly. In addition, you can ask your doctor if there are any preventative measures you should do to minimize your chances of developing the disease. These days, having a well-managed chronic health problem is not likely to prevent you from living to be at least 100."
    },
    {
      "title": "Don’t gamble with your life by using illegal drugs.",
      "content": "Don’t gamble with your life by using illegal drugs. Illegal drugs can cause sudden and severe health conditions. Because they are unregulated, there is no quality control for illegal drugs. This means that dosages are inconsistent and they may contain other substances that are dangerous for your health. Overdoses are frequently fatal, but even less than fatal effects can cause severe health risks such as: [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Coma Brain damage Seizures Psychosis Confusion Memory loss"
    },
    {
      "title": "Go easy on alcohol consumption.",
      "content": "Go easy on alcohol consumption. The Mayo Clinic recommends no more than one drink per day for women and one to two drinks per day for men. Binge drinking is extremely unhealthy. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source High levels of alcohol intake raise your risk for cancers of the digestive tract, heart problems, pancreatitis, strokes, high blood pressure and liver disease. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you enjoy a glass of wine or a beer in the evenings, ask your doctor about whether it could interact with any medications you may be taking. Even over-the-counter medications or herbal remedies and supplements may interact with alcohol. If you do drink, do not drive. Alcohol consumption impairs your ability to drive safely and puts your life at risk and the lives of others who are on the road. Plan ahead and either take a taxi or appoint a friend as a designated driver who will stay sober."
    },
    {
      "title": "Don’t smoke, and if you do, quit.",
      "content": "Don’t smoke, and if you do, quit . Even people who smoked for decades can increase their lifespan and quality of life by quitting. Quitting will improve your health and reduce your risks of: Heart attacks Strokes Lung diseases, including cancer Cancer of the esophagus, larynx, throat, mouth, bladder, pancreas, kidney, and cervix Respiratory infections Diabetes Eye disorders like cataracts Gum disease"
    },
    {
      "title": "Wear appropriate safety gear.",
      "content": "Wear appropriate safety gear. Safety gear can prevent fatal injuries during accidents. This includes common activities like riding in a car or sports activities. Always wear your seatbelt when driving or riding in a car. If you are driving, do not speed, especially during bad weather conditions such as ice, rain, snow, or fog. Car accidents are a frequent cause of death. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Research what safety gear is necessary for risky or full contact sports. You may need protective padding and helmets when skiing, snowboarding, riding a horse, or playing football. If you are doing sports like skydiving, rock climbing, or bungee jumping make sure that all the gear you are using is in perfect working order."
    },
    {
      "title": "Limit your exposure to toxic substances.",
      "content": "Limit your exposure to toxic substances. In high doses, some substances can put you at risk for developing severe health problems which could lead to an early death. For example: Asbestos can cause lung disease. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Pesticides in high doses are not healthy. Though both organic and non-organic farmers’ produce is monitored and regulated to ensure that pesticide residues do not exceed the legal limits, some people prefer organic produce. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Pollution and chemical fumes are damaging when you are exposed over a long period of time. If you live in a high pollution area, such as near a highway, you may want to avoid being outside during times when pollution is highest. Many communities provide pollution alerts when the air quality has reached an unsafe level."
    },
    {
      "title": "Avoid exhaustion by getting enough sleep.",
      "content": "Avoid exhaustion by getting enough sleep. Sleep deprivation adds physical stress on your body and lowers your immune system. It also makes you more vulnerable to stress. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Most people need at least eight hours of sleep each night. If you have trouble staying awake during the day, you are probably not getting enough sleep. If you have insomnia , talk to your doctor about ways to treat it. This may include implementing lifestyle changes like always going to sleep at the same time, keeping the room dark and free of distracting noises, and using relaxation techniques before bed."
    },
    {
      "title": "Stay young and vibrant by enjoying a diet with diverse fruits and vegetables.",
      "content": "Stay young and vibrant by enjoying a diet with diverse fruits and vegetables. Fruits and vegetables are great sources of the vitamins and minerals that your body needs. Vitamins and minerals are important when you are young for growing a strong and healthy body, but they are also important when you are older for staying healthy. Eat at least four servings of fruits and five servings of vegetables per day. Fruits include berries, apples, pears, plums, bananas, pumpkin, squash, beans, olives, peppers, corn, peas, cucumber and tomatoes. Vegetables include beets, carrots, spinach, cauliflower, lettuce, broccoli, celery, and others. Fresh fruits and vegetables are the healthiest, but in the winter months, when they are not available, purchasing frozen fruits and vegetables is a good solution. Avoid fried and breaded fruits and vegetables because they also contain a lot of fat. A healthy diet rich in fresh produce lowers your risk of cancers, heart disease, high blood pressure, strokes, and diabetes."
    },
    {
      "title": "Stay resilient by eating sufficient protein.",
      "content": "Stay resilient by eating sufficient protein. Protein is necessary for your body to repair and rebuilt cells after sustaining damage. Cell turnover is a natural part of life and maintaining a healthy body. [9] X Research source People who eat meat often get much of their protein from meat and animal products such as beef, pork, poultry, and eggs. Vegetarians (people who do not eat meat) and vegans (people who do not eat animal products) get protein from soy, beans, legumes, and nuts. Vegetarians may also supplement this with milk and cheeses. The average adult requires two to three servings of protein per day. Talk to your child’s doctor to determine what your child may need. Children’s requirements change as they age and grow."
    },
    {
      "title": "Maintain youthful energy levels by eating healthy carbohydrates.",
      "content": "Maintain youthful energy levels by eating healthy carbohydrates. Sugars, starches, and fiber are all types of carbohydrates. When they are digested, your body obtains energy. Simple sugars are digested more quickly than complex carbohydrates. Because it takes complex carbohydrates longer to break down, your body will be getting that energy at a steady pace instead of all at once. This means it will provide you with energy for longer and it will also keep your blood sugar stable. [10] X Research source Supply your body with complex carbohydrates by eating beans, parsnips, corn, peas, lentils, peanuts, and whole-grain breads. Many breads will say on the packaging if they are whole-grain. Substitute complex carbohydrates for simple sugars like cakes, candy, cookies, and processed sweets. In order to have enough energy to maintain an active lifestyle, you should be getting about half of your calories from complex carbohydrates."
    },
    {
      "title": "Stay hydrated by drinking sufficient water.",
      "content": "Stay hydrated by drinking sufficient water. Drinking enough water will dilute and help you pass toxins and keep your kidneys and urinary tract healthy. [11] X Research source While drinking eight glasses of water a day is a good start, there is new science suggesting you may need more fluids than that. Taking into account the water contained in drinks like milk and tea and in foods like watermelon, your daily intake of fluids can be determined by dividing your weight in half. The resulting number is the number of ounces of fluids you need each day. So if you weigh 180lbs., you need 90oz of fluids each day. [12] X Research source If you are an athlete, you should be drinking about two-thirds of your body weight in ounces. How much you need to drink to stay well hydrated will depend on how physically active you are, how warm and dry the weather is, and your body size. You may need four or more liters of water per day. If you are urinating less than usual or have dark or cloudy urine, this is a symptom of dehydration. Carry a reusable water bottle with you during the day to help remind you to stay hydrated."
    },
    {
      "title": "Eat fats sparingly.",
      "content": "Eat fats sparingly. A small amount of fat is necessary so you can absorb fat soluble vitamins, control inflammation, clot blood, and maintain proper brain function, but many people eat too much. A diet that is high in fat increases your chances of obesity, high cholesterol, heart disease, and strokes. [13] X Research source Foods that have a high fat content include butter, cheese, whole milk, cream, meats, and vegetable oils. You can reduce your fat intake by trimming fat off of meats, eating lean meat like poultry and fish, drinking low-fat milk, and eating low-fat yogurt. [14] X Research source Choose healthier fats by cooking with monounsaturated fats, polyunsaturated fats, and fats that are high in omega-3 and omega-6 fatty acids. Healthy sources of fat include olive oil, safflower oil, peanut oil, corn oil, flaxseed oil, canola oil, and soybean oil. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Protect your heart with a low-sodium diet.",
      "content": "Protect your heart with a low-sodium diet. Too much sodium may lead to high blood pressure which raises your risks for heart disease and stroke. While some salt is necessary to maintain proper nerve and muscle functions, most people acquire plenty of salt naturally through their diet without adding it to their food. [16] X Research source Adults should consume no more than about a teaspoon of salt per day. If you have a health condition, you may need to eat much less. Avoid fast food. Not only is it high in fat, but it is also usually very high in salt."
    },
    {
      "title": "Enjoy your 100 or more years of life.",
      "content": "Enjoy your 100 or more years of life. Stay mentally young and fit with hobbies you enjoy. No matter how old you are, you can still engage in hobbies you look forward to doing. Activities where you learn and grow mentally will help keep you psychologically young and mentally active. If money is a concern, you can consider many activities that are low-cost and available year-round. Many people enjoy doing handiwork, reading, listening to music, art or photography. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Find people with similar interests and do your hobbies together. This will help you maintain a social network and enable you to share your enjoyment. Possibilities include joining a sports club, volunteering, or joining clubs for traveling."
    },
    {
      "title": "Keep in touch with those you love.",
      "content": "Keep in touch with those you love. Maintaining your social network of friends and family will protect your psychological health. Friends and family will help buffer you against loneliness, depression, stress, and anxiety, all of which frequently occur as people age. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have difficulty getting out or your loved ones are far away, consider keeping in touch by phone, through writing letters, writing emails, video chat, or using social media. If you feel isolated, consider locating a support group or counselor to help you. Your doctor will likely be able to recommend support groups in your area. You can also call the health department or your local senior center to determine what resources may be available to you."
    },
    {
      "title": "Relax",
      "content": "Relax . Stress causes physiological changes in your body which lower your immune system and makes you more vulnerable to infections. By learning to manage stress you can improve your overall health. There are many relaxation techniques and you can try several until you find what works best for you: [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Meditation Visualization of calming images Deep breathing Massage Yoga Tai chi Progressive muscle relaxation in which you concentrate on tensing and then relaxing each muscle group in your body Music or art therapy"
    }
  ]
}