{
  "url": "https://www.wikihow.com/Link-Instagram-to-Tiktok",
  "title": "Add Your Instagram to TikTok: Link Profiles & Cross-Post Videos",
  "steps": [
    {
      "title": "Open TikTok.",
      "content": "Open TikTok. Tap the app icon that looks like a music note."
    },
    {
      "title": "Tap the Profile button.",
      "content": "Tap the Profile button. This looks like an outline of a person in the bottom right corner of your screen. [1] X Research source"
    },
    {
      "title": "Tap Edit Profile.",
      "content": "Tap Edit Profile . It's in the middle of your screen. [2] X Research source"
    },
    {
      "title": "Tap Add Instagram.",
      "content": "Tap Add Instagram . You'll see this under the \"Social\" header near the bottom of the page. [3] X Research source The Instagram login screen will load. If you don't see the Instagram option here, there are a few ways that you can proceed: If you have 2 Instagram accounts with the same login information, you may need to change one before you can link it to TikTok. You can also make sure that your Instagram account has been verified via email. If not, you may not be able to link your TikTok and Instagram. If those methods don't work, make sure all your drafts are saved to your phone, then delete and reinstall the app from your phone."
    },
    {
      "title": "Login with Instagram.",
      "content": "Login with Instagram. You can either enter your Instagram username, email, or phone number and password, or you can log in with Facebook. Tap Log in to continue. Once you successfully enter your Instagram information, you'll need to confirm that TikTok can access it. Tap Allow to continue. Your Instagram information will appear next to \"Instagram\" under the \"Social\" header. If you view your profile, you'll see that your Instagram account has been linked. Linking your TikTok account just adds the link in your bio, nothing else. [4] X Research source If you want to remove your Instagram account from TikTok, just return to the Edit Profile section, tap your Instagram name, and select Confirm to remove it."
    },
    {
      "title": "Open TikTok.",
      "content": "Open TikTok. Tap the app icon that looks like a music note. Doing this will post your new video to both TikTok and Instagram. You can, however, share a TikTok video without linking your accounts. You'll just need to post the video first, then tap the Share icon, and select Instagram."
    },
    {
      "title": "Create a new video.",
      "content": "Create a new video. Tap the + button to create a new video , where you can record a video or upload one from your gallery. [5] X Research source Once you're done recording or uploading, tap Next to continue."
    },
    {
      "title": "Tap \"Who can watch this video\" and choose Everyone.",
      "content": "Tap \"Who can watch this video\" and choose Everyone . You do not want to make a video that no one can see! [6] X Research source"
    },
    {
      "title": "Tap the Instagram icon under \"Automatically share to.\"",
      "content": "Tap the Instagram icon under \"Automatically share to.\" This is near the bottom of your screen. You can share the video as a Feed post or as a Story."
    },
    {
      "title": "Tap Post.",
      "content": "Tap Post . The video will post to TikTok and you'll be redirected to Instagram."
    },
    {
      "title": "Create the Instagram post.",
      "content": "Create the Instagram post. Depending on if you're making a Feed or Story post, you'll have slightly different options to create your post . Both will allow you to add stickers and text to your video before posting it."
    },
    {
      "title": "Tap Publish.",
      "content": "Tap Publish . Once you do that, your video is live on both TikTok and Instagram without you having to do a ton of extra work! [7] X Research source You can also share longer videos to Facebook using Instagram. Just make sure your Instagram and Facebook accounts are connected and you can then cross-post that way!"
    },
    {
      "title": "Can I add my TikTok profile to Instagram?",
      "content": "Can I add my TikTok profile to Instagram? You can! However, there is only space for one link , so services like Linktree might be your solution. To add your link to Instagram , go to your Instagram profile and tap Edit Profile > Website . Enter your TikTok URL there and then your TikTok is linked in your Instagram bio! [8] X Research source"
    },
    {
      "title": "Can I share my Instagram posts to TikTok as easily?",
      "content": "Can I share my Instagram posts to TikTok as easily? Unfortunately, the linking process only shares your TikToks to Instagram. You'll have to save your posts from Instagram to repost them to TikTok."
    },
    {
      "title": "Can I link TikTok and YouTube?",
      "content": "Can I link TikTok and YouTube? Yes! The steps for linking TikTok and YouTube are identical to the steps to linking TikTok and Instagram, but instead, you tap \"YouTube\". [9] X Research source"
    },
    {
      "title": "What if I only see the option to link YouTube?",
      "content": "What if I only see the option to link YouTube? In this case, you're pretty much out of luck but there are a few things you can try: If you have 2 Instagram accounts with the same login information, you may need to change one before you can link it to TikTok. You can also make sure that your Instagram account has been verified via email. If not, you may not be able to link your TikTok and Instagram. If those methods don't work, make sure all your drafts are saved to your phone, then delete and reinstall the app from your phone."
    }
  ]
}