{
  "url": "https://www.wikihow.com/Get-over-a-Fear-of-Deep-Water",
  "title": "How to Get over a Fear of Deep Water",
  "steps": [
    {
      "title": "Acknowledge your fear",
      "content": "Acknowledge your fear . Many people with this phobia are further traumatized by feeling embarrassed or ashamed about it. They’ll go to great lengths to avoid facing their fear. However, accepting your phobia is the first step towards addressing it. [1] X Research source"
    },
    {
      "title": "Put your fear into perspective.",
      "content": "Put your fear into perspective. Being afraid of deep water is a common thing that affects millions of people. Everyone has a different degree of comfort with water, and very few people are entirely comfortable in deep-water situations. It’s nothing to ashamed of. [2] X Research source Studies indicate that over half of American adults are fearful of deep water. [3] X Research source"
    },
    {
      "title": "Identify the origin of your fear.",
      "content": "Identify the origin of your fear. Before you try to face water, take time to think back about when you first realized that your were afraid of it. Was there a particular incident or influential person that sparked your phobia? If you can recognize the origin of your fear, it can sometimes help to understand and deal with your anxiety. For example, if your father was terrified of deep water, it’s likely that he passed on the fear to you. Or, if you were in a boat that capsized, that might have triggered your phobia. If you understand that there’s a logical starting point, it may allow you to cope better with what can seem like an irrational terror."
    },
    {
      "title": "Pick a safe, comfortable body of water.",
      "content": "Pick a safe, comfortable body of water. If you’re afraid of water, you don’t want to start by facing an ocean with high surf. Instead, go to a pool where the water temperature, depth, and flow is controlled. You want to limit any other discomforts you might feel, like freezing water or lots of spectators, so find a body of water that is comfortable in every other way besides your fear of the deeps. It’s also probably best to opt for clear water so that you can see the bottom. Dark or opaque waters can add to your anxiety about the deeps. A calm bay or lake might also work if you prefer to be outside. However, ideally, you’ll choose a body of water that has a gradual descent so that you can enter it slowly."
    },
    {
      "title": "Have someone you trust present.",
      "content": "Have someone you trust present. If your fear embarrasses you, you might find that it’s easier to have a trained professional like a swimming instructor or lifeguard there who knows water safety and how to deal with water-shy people. At the very least, you should have a responsible person who is willing to support your efforts without pressuring or making fun of you. [4] X Research source For the sake of calming your fears, it’s best if you choose someone who is an experienced swimmer and comfortable in the water."
    },
    {
      "title": "Wade into the water, stopping when you feel fearful.",
      "content": "Wade into the water, stopping when you feel fearful. Go in as far as you can, noting the point where you first get nervous. If you do feel a jab of fear, stop where you are and breathe deeply for a few counts before turning back towards the shallows."
    },
    {
      "title": "Push yourself to go a bit deeper, one step at a time.",
      "content": "Push yourself to go a bit deeper, one step at a time. Now, walk in slow circles through the water, starting in the shallows and gradually increasing the circumference of your path so that you’re pushing yourself to go slightly deeper each time. Take this process as slowly as you need to. Some people may be able to work their way up to depths that are over their head within a few hours. Others might need to spread this process out over a longer period of time, going from knee-deep one day to waist-deep the next and so on. Keep reminding yourself that you are in control of this process. While it’s good to keep pushing yourself further if you can, you should stop immediately if you feel like you’re losing control. If you can, reorient your engagement with the water by focusing on the pleasurable sensation of it flowing against your skin and limbs as you walk. Doing so can help distract you from the feelings of fear."
    },
    {
      "title": "Be mindful of your breathing.",
      "content": "Be mindful of your breathing. If you concentrate on keeping your breath slow and regular, it can help mitigate panic or other bodily responses to the fear that you’re facing. As you walk in circles, focus on breathing in deeply to the count of five and exhaling slowly to the count of seven."
    },
    {
      "title": "Put your head underwater.",
      "content": "Put your head underwater. Taking the plunge is often one of the trickiest things for people with aquaphobia, so it’s wise to work your way up to going under water in steps, starting in a controlled, shallow setting. When you’re comfortable with the feeling of having your head submerged, it’s much easier to dunk in deep water. [5] X Research source Wade into the water until you’re about waist-deep, so that you can easily bend over and reach the water with your face. Begin by splashing water on your face to allow it to adjust to the feeling and temperature. Then, hold your breath and lean over until just your lips are touching the water. Once you’re comfortable with that, crouch down with your mouth closed so that your chin and lips are submerged. Take deep breaths through your nose, noticing that you can still breathe with your mouth under water. Once you’re feeling comfortable with that step, hold your breath and submerge your nostrils a few second before standing up and breathing. While water may enter your nose, it won’t go as far as your sinuses, which is the only way it would affect you negatively. The last step is to completely submerge your head, holding your breath and staying under a few seconds before you stand up and breathe. Similarly to your nose, you’ll note how the water gets into your ears but shouldn’t hurt you since it won’t go past your ear drums."
    },
    {
      "title": "Blow bubbles.",
      "content": "Blow bubbles. This exercise teaches you that you can exhale underwater without sucking water in through your mouth or nose. It’s helpful for becoming more comfortable being underwater out deep and understanding how you can train your body to interact safely with water. [6] X Research source Start waist-deep, crouching down so that your mouth is directly over the surface of the water. Inhale through your nose and exhale through your mouth several times, noticing the water ripple under your breath. Then, submerge your mouth but keep your nose above water. Breathe in through your nose and slowly blow the air out through your lips. Your exhalation should create bubbles in the water. Next, take a deep breath, submerge your nose, and blow bubbles by slowly exhaling out of your nostrils. Once you’ve finished exhaling, stand up and breathe. Lastly, take a deep breath in and hold it. Try submerging your entire head and blowing bubbles out of both your nose and mouth. When you’re finished exhaling, stand up and breathe."
    },
    {
      "title": "Try floating.",
      "content": "Try floating . Realizing that water is buoyant and will hold your body afloat if you let it can go a long way towards easing your anxieties about the deeps. If you’re just learning to float, it’s best to work with a partner to help you get the hang of it in a safe, supportive environment. [7] X Research source Since your natural bodily reactions to fear (like curling up or pushing your legs down) might make it difficult for you to float, start by having someone gently pull your arms through the water while you lie flat and relax your entire body. Alternately, you can have the person support you in a stationary position by placing their arms under your back while you lie on your back in the water. Once you get the feel for assisted floating, have the person release you and float for as long as you can without their assistance. When you’re able to remain afloat after they’ve released you, try to start floating on your own."
    },
    {
      "title": "Swim",
      "content": "Swim where you can hang onto something. When you’re first testing yourself in deep water where you can’t touch the bottom, be sure to stick to an area where you can easily reach out and grab something to steady yourself. [8] X Research source For instance, you might swim along the edges in a deep pool. Every now and then, let go of the sides and swim, float, or tread water for as long as you’re able without getting nervous. Try to extend the time you’re not holding onto anything with each release. If you’re swimming in a lake, stay close to a sturdy boat or raft, so that you can easily hang on or climb out whenever you need to."
    },
    {
      "title": "Enroll in an adult swimming course.",
      "content": "Enroll in an adult swimming course . Many local aquatics facilities, like public pools or YMCAs, offer courses taught by specialists who are trained to deal with aquaphobia. Taking a formal course can be beneficial for overcoming your fear since it’s safe and supervised by an expert. Enrolling in a class will also force you to commit to addressing the issue. [9] X Research source Pick a class that’s designed especially for adults. While some may advertise themselves specifically as lessons in overcoming aquaphobia, all adult swimming courses will assume that the students have some degree of fear or discomfort with the water. This option is also great for those who value the support of a community. Since your fellow students will have shared experiences and feelings, you can help each other overcome your fear of deep water without embarrassment."
    },
    {
      "title": "Seek help from a qualified mental health professional.",
      "content": "Seek help from a qualified mental health professional . If your phobia feels too overwhelming to cope with on your own or if you feel entirely unable to face deep water, contact your healthcare provider for a referral to a mental health professional. A psychologist, therapist, or anxiety counselor can train you to manage your fears through exercising self-control over your thoughts, feelings, and reactions. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try exposure therapy.",
      "content": "Try exposure therapy. Exposure therapy repeatedly exposes you to the situation you fear in slow increments so that you can learn to control your reaction to it over time. If you’re having trouble facing the water, get help from a trained psychotherapist who can oversee the process through exposure therapy. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get cognitive behavioral therapy.",
      "content": "Get cognitive behavioral therapy . Search for a qualified mental health professional, like a psychologist or therapist, who can provide cognitive behavioral therapy to treat your phobia of deep water. This form of therapy changes your relationship to fear by teaching you how to better cope with and exercise control over thoughts and feelings that seem overwhelming. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}