{
  "url": "https://www.wikihow.com/Heal-Your-Gallbladder-Without-Surgery",
  "title": "How to Heal Your Gallbladder Without Surgery",
  "steps": [
    {
      "title": "Visit the doctor if you have sudden abdominal pain.",
      "content": "Visit the doctor if you have sudden abdominal pain. Generally, the pain will be in the upper right of your abdomen or in the center directly under the breastbone. This pain may come on all at once and then get worse quickly. You may also experience referred pain in your right shoulder or between your shoulder blades, as well as vomiting and nausea. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have pain so bad you have trouble getting comfortable or a high fever with these symptoms, go to the emergency room. Jaundice (yellowing of the skin and the whites of your eyes) is also a symptom that requires medical care right away."
    },
    {
      "title": "Be ready for a physical exam.",
      "content": "Be ready for a physical exam. The doctor will ask you questions about your symptoms, so come prepared to talk about when the symptoms came on, what they are, and how often you have them. Also, they may feel your stomach area to see where the pain is and whether it could be caused by something else. [2] X Research source For instance, the doctor may want to make sure the pain isn't coming from something like appendicitis. Your doctor may also want to take imaging tests, such as CT scans, MRIs, a HIDA scan, or an ERCP scan. [3] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Fast for 8 hours if your doctor requests an ultrasound.",
      "content": "Fast for 8 hours if your doctor requests an ultrasound. With some imaging tests, such as ultrasounds, they may want you to go in with an empty stomach to make it easier to see what's going on. Usually, you can only have water on these fasts, but check with your doctor for exact instructions. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source With an ultrasound, they will typically put a gel on your abdomen and run a wand-like device over it to look at your gallbladder. It won't hurt."
    },
    {
      "title": "Expect blood tests to check for other issues.",
      "content": "Expect blood tests to check for other issues. A blood test can reveal if you are having complications from your gallbladder, such as infections or pancreatitis. You can also become jaundiced due to complications with your gallbladder. [5] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source For a blood test, a technician will draw your blood with a needle then send it off to be tested."
    },
    {
      "title": "Discuss ursodeoxycholic acid tablets or other medications to dissolve gallstones.",
      "content": "Discuss ursodeoxycholic acid tablets or other medications to dissolve gallstones. This treatment is sometimes used for people who can't have surgery. Your doctor may let you try this treatment, but keep in mind, it's not always effective. Plus, this treatment can take a long time to work. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You may need to take these medications for up to 2 years before they are effective, if they ever are. The typical medications prescribed for gallstones are ursodiol (Actigall) and chenodiol (Chenix). Gallstones can recur after you stop taking these medications."
    },
    {
      "title": "Ask if lithotripsy if an option for you.",
      "content": "Ask if lithotripsy if an option for you. This treatment uses sound waves to break up gallstones. It's only done in a clinic or hospital, and the machines to perform the procedure aren't that common. However, it can be a non-surgical option to treat gallstones. [7] X Research source Usually, this treatment is only used for people who have tiny, soft stones. Gallstones can reoccur after this treatment."
    },
    {
      "title": "Wait to see if you have another attack.",
      "content": "Wait to see if you have another attack. If you only have a mild attack, it's possible you won't have symptoms again. In fact, about a third of people don't have another attack. You can wait to see if your situation improves or worsens before deciding if you need surgery."
    },
    {
      "title": "Cut back on fat",
      "content": "Cut back on fat , but not too much. Fatty foods may contribute to some gallstones, so limiting your intake is a good idea. [8] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source However, cutting back too much can lead to you dropping weight too quickly, which is also not a good idea. Therefore, eat fatty foods in moderation. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Talk to your doctor about what an appropriate amount of fat in your diet is. They may suggest you focus on healthy fats like nuts, avocados, vegetable oil, and olive oil."
    },
    {
      "title": "Discuss cutting dairy products from your diet.",
      "content": "Discuss cutting dairy products from your diet. With certain types of gallstones, dairy products may make them worse. Talk to your doctor about whether that's the case for you, and if you can, lower your intake or eliminate these foods from your diet. [10] X Research source Dairy products include foods like cow's milk, cheese, yogurt, ice cream, and butter."
    },
    {
      "title": "Increase the fiber",
      "content": "Increase the fiber in your diet. Increased fiber may reduce your likelihood of needing surgery. Fiber is found in foods like vegetables, fruits, and whole grains, so try to incorporate more of these into your diet. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Aim to eat at least 5 servings of fruits and veggies every day. You don't have to eat fresh fruits and vegetables. Frozen and canned can have just as many health benefits. Just be sure to opt for no-sugar and low-sodium options. [12] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Whole grains include whole wheat bread, whole wheat pasta, oatmeal, bulgur, quinoa, barley, and buckwheat, just to name a few."
    },
    {
      "title": "Eat 4-5 1-ounce (28-gram) servings of nuts per week.",
      "content": "Eat 4-5 1-ounce (28-gram) servings of nuts per week. Any kind of nut is fine, including almonds, walnuts, pecans, pistachios, and peanuts. Eating nuts throughout the week may reduce your chances of needing surgery. [13] X Research source Scientists are not exactly sure why nuts help you avoid a gallbladder surgery, but it's likely due to the fiber, bioactive components, magnesium, and phytosterols that nuts contain. Phytosterols may lower cholesterol, while magnesium can help increase your insulin sensitivity, both of which may decrease your chances of developing gallstones. [14] X Research source"
    },
    {
      "title": "Try to avoid dropping weight quickly if you need to lose weight.",
      "content": "Try to avoid dropping weight quickly if you need to lose weight. While being at a healthy weight can help with gallstones, dropping weight rapidly can make you more susceptible to having them. Therefore, if you need to lose weight, go at a slow, steady pace. Talk to your doctor about how fast you should be losing weight if you need to. Aim to only lose 5-10% of your body weight over 6 months. [15] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Losing weight gradually is not only safer than quick weight loss, but ultimately more effective. You're more likely to keep the weight off if you lose weight at a rate of 1–2 pounds (0.45–0.91 kg) per week than if you lose it more quickly. [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source In order to lose weight successfully and keep it off, you will need to commit to long-term lifestyle changes, including healthy eating and exercise habits. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Limit your intake of alcoholic beverages.",
      "content": "Limit your intake of alcoholic beverages. Some alcohol is okay, as long as you stay within the recommended limits. However, try not to overindulge, particularly if you have a liver condition contributing to your gallbladder disease. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source By most recommendations, women can consume up to 1 drink a day and men can consume up to 2. [19] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Stop smoking to reduce your chances of getting gallstones.",
      "content": "Stop smoking to reduce your chances of getting gallstones. You probably know that smoking carries a whole host of risks with it. You may not know that it can contribute to problems with your gallbladder. Stop smoking to lower your risks. [20] X Research source Talk to your doctor about quitting. You may want to try nicotine patches or gum to help you quit. Discuss quitting with your friends and family so they can help you stay away from tobacco."
    },
    {
      "title": "Exercise",
      "content": "Exercise at least 30 minutes a day most days of the week. Exercise may reduce your risk of developing further gallstones, likely by increasing your production of bile. You don't have to do 30 minutes all at once! Try 10-minute increments throughout the day. [21] X Research source Exercise doesn't have to mean going to the gym. Try taking a walk at lunch, taking the stairs instead of the elevator, and parking further out at the store. Housework and gardening can also count as exercise. Try different exercises to see what you like. If running isn't your thing, try swimming or basketball. If you're not into biking, try Zumba or yoga. If you're overweight, you may want to increase your time to 45 minutes a day."
    },
    {
      "title": "Try probiotic foods.",
      "content": "Try probiotic foods. Some holistic medicine practitioners believe that probiotics can help relieve gallstone symptoms. Try incorporating foods such as probiotic yogurt, kefir, sauerkraut or kimchi, kombucha, or raw cheese into your diet. [22] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Talk to your doctor about the risks of eating probiotic foods if you are pregnant, have a weakened immune system, or have other serious health concerns. [23] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Ask your doctor about trying dietary supplements.",
      "content": "Ask your doctor about trying dietary supplements. Alternative medicine specialists recommend a variety of herbs and supplements to treat and prevent gallbladder symptoms. Talk to your doctor about trying natural treatments such as milk thistle, dandelion root, turmeric, rosemary essential oil, bile salts, or lipase enzymes to help manage your symptoms. Always talk to your doctor before trying any herb or dietary supplement. Let them know if you are pregnant or nursing, have any other health conditions, or are currently taking any other supplements or medications. It's not always clear whether herbal supplements are actually helpful in the treatment of gallbladder diseases. For example, there is not much definitive evidence to support the use of milk thistle to treat liver and gallbladder conditions. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Replace artificially formulated skin care products with natural oils.",
      "content": "Replace artificially formulated skin care products with natural oils. Some common chemicals in skincare products, such as phthalates and parabens, may disrupt the natural balance of your hormones. [25] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Hormone imbalances can contribute to a variety of health problems, including gallbladder disease. Try replacing these products with more natural alternatives, such as: Coconut oil Shea butter Essential oils, such as clary sage, geranium, and thyme [26] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use caution when using essential oils, since some of these—including lavender and tea tree oil—may also disrupt your hormone balance. [27] X Research source"
    }
  ]
}