{
  "url": "https://www.wikihow.com/Korean-Perm",
  "title": "Korean Perms: How to Ask For One, Haircare Tips, & More",
  "steps": [
    {
      "title": "A Korean perm usually adds voluminous waves, not tight curls.",
      "content": "A Korean perm usually adds voluminous waves, not tight curls. When you picture a perm, you may imagine tight, ringlet-style curls with a lot of volume all over. Korean perms tend to look more natural. They typically feature softer waves, with most of the volume focused at the roots and from the mid-shaft down. [1] X Research source Korean perms are also considered to be low-maintenance compared to regular perms, and they may last longer."
    },
    {
      "title": "Find a salon near you that specializes in this style.",
      "content": "Find a salon near you that specializes in this style. If there are any Korean salons near you, check with them first. But Korean perms are quickly growing in popularity, so if there aren’t any Korean salons close by, other salons in your area may offer Korean perms. A quick search for “Korean perm near me” will show you salons where you might be able to get a Korean perm, although you should verify that the service is offered when you call to make your appointment."
    },
    {
      "title": "Request a perm style based on the curl pattern you want.",
      "content": "Request a perm style based on the curl pattern you want. Talk to your stylist about what you want to accomplish with your perm—like extra volume at the roots, effortless tousled waves, or taming straight hair that sticks out. Here are some curl types that you might request: S curl: Hair bends in a wavy S-shape. This style works best on longer hair and gives a subtle, natural look. C curl: Plenty of volume at the roots and a pronounced bend at the ends. This is a good look for mid-length hair. Cloud perm: Volume at the roots, then waves starting about mid-way down your hair length. [2] X Research source Grace perm: S-shaped waves that start at the root and go all the way down to the ends. Hippie perm: Tight, tousled waves from the roots all the way to the ends of your hair. Root perm: Adds volume close to your scalp. Down perm: Smooths the hair on the sides of your head so it lays flat. Good for short, thick hair. [3] X Research source Magic perm: A Korean perm technique that leaves the hair straight and smooth. [4] X Research source"
    },
    {
      "title": "Use inspiration pictures to show your stylist what you like.",
      "content": "Use inspiration pictures to show your stylist what you like. When you go in for your consultation, bring pictures of the type of curl you’re hoping to accomplish. Your stylist will be able to recommend the perm procedures that are right for you."
    },
    {
      "title": "Korean perms usually work best on fine or medium hair.",
      "content": "Korean perms usually work best on fine or medium hair. They’re a great way to add extra volume and definition to thin, straight hair. [5] X Research source That said, magic perms and down perms can be a good option for taming thick, unruly hair. Avoid getting a Korean perm if your hair is damaged from chemical treatments like bleaching or relaxing. [6] X Research source"
    },
    {
      "title": "Ask for a two-block cut for a masculine Korean perm style.",
      "content": "Ask for a two-block cut for a masculine Korean perm style. The two-block cut is longer on the top and shorter on the sides. It’s similar to an undercut, but the sides may be more tapered. This cut will give you plenty of length on top for a Korean perm without adding too much volume on the sides. The result is a natural-looking, tousled wave."
    },
    {
      "title": "Go with longer, soft layers for a feminine look.",
      "content": "Go with longer, soft layers for a feminine look. If you’re going in for a Korean perm, you probably won’t want to get a dramatic cut at the same time—for a feminine look, the softer waves of a Korean perm usually look best on longer hair. Ask for a trim to remove a few straight ends, and light layers to help your waves have more definition and movement."
    },
    {
      "title": "Expect to spend 2–5 hours at the salon.",
      "content": "Expect to spend 2–5 hours at the salon. A Korean perm usually takes several hours, although the exact time can vary based on the thickness and length of your hair, the size of the curling rods that are used, and the time your hair needs to process. The curling process will take the most time, since the stylist needs to carefully place and wrap small sections of hair to create the waves. [7] X Research source"
    },
    {
      "title": "Korean perms can last 6 months or more.",
      "content": "Korean perms can last 6 months or more. Like any perm, this style will last longer if you care for it properly. However, your hair type will also determine how long your Korean perm will last—some hair types accept chemical processing more easily, which will result in a longer-lasting perm. [8] X Research source If you get looser waves, your perm may not last as long as if you get waves with a more defined pattern."
    },
    {
      "title": "Wait at least 48 hours before washing your hair after a Korean perm.",
      "content": "Wait at least 48 hours before washing your hair after a Korean perm. According to Waldman, it can take up to 48 hours for the bonds in your hair to reform. He says, “Waiting 48 hours to shampoo your hair will make your curls more durable and resilient.” If you can wait 3 days to wash your hair, that’s even better."
    },
    {
      "title": "Use sulfate-free shampoos and conditioners.",
      "content": "Use sulfate-free shampoos and conditioners. To properly care for your perm , choose perm-safe shampoo, conditioner , and styling products that are designed to help keep your permed hair shiny and healthy. In general, sulfate-free shampoos and conditioners are a good place to start since they don’t have harsh detergents that can damage chemically-treated hair. Waldman recommends checking the label for terms like “moisture-infusing.” He also says that the wrong shampoo can make your hair look frizzy or cause the curls to flatten out."
    },
    {
      "title": "Massage your hair gently when you wash it.",
      "content": "Massage your hair gently when you wash it. According to Waldman, rubbing your hair roughly while you wash it will cause your hair to lose its elasticity and curl. Instead, he says, “Use a gentle massaging motion down the mid-lengths and ends of your hair.”"
    },
    {
      "title": "Use a wide-toothed comb to detangle your hair.",
      "content": "Use a wide-toothed comb to detangle your hair. Waldman says that brushing your hair can overstretch it, causing you to lose curls and elasticity. He recommends using a width-tooth comb to keep your curls from looking droopy. It may even help to finger-comb your hair, especially in the first few days after you get it permed. [9] X Research source"
    },
    {
      "title": "Blot your hair dry with a soft towel.",
      "content": "Blot your hair dry with a soft towel. After you wash and detangle your hair, Waldman says to use your towel to pat it dry—don’t rub your hair with the towel, as this can make it look frizzy. Try switching to microfiber or satin hair towels for the gentlest way to towel-dry your hair. [10] X Research source"
    },
    {
      "title": "Ask your stylist to recommend the right products to use at home.",
      "content": "Ask your stylist to recommend the right products to use at home. You may need to use products like curl-defining creams or hair oil to keep your Korean perm looking smooth, soft, and defined. Your stylist is a good resource for learning about new products, but don’t be afraid to experiment—in the end, finding the right products for your hair usually requires a little trial and error. Use a heat protectant ] to prevent heat damage if you blow-dry or heat style your hair. [11] X Research source If your hair is damaged after a perm , use moisturizing masks and hot oil treatments to help restore it to a healthier state."
    },
    {
      "title": "Consult with your stylist about the look you want.",
      "content": "Consult with your stylist about the look you want. First, you’ll meet with the stylist for a consultation. They'll analyze your hair type, the condition of your hair, and the look you’re going for. They’ll also ask for your hair history, like if you’ve previously chemically treated your hair—the perm won’t work as well if your hair is damaged. [12] X Research source After the consultation, the stylist may trim and shape your hair. This will get rid of any split ends and create the shape that will work best with your waves."
    },
    {
      "title": "Perming solution is applied to your hair.",
      "content": "Perming solution is applied to your hair. To get the perm underway, the stylist will saturate your hair with an acidic chemical treatment. This will help loosen the di-sulfide bonds in your hair that help hold each strand in its natural shape. [13] X Research source Typically, the stylist will allow this solution to sit on your hair for about 10–15 minutes before rinsing it out. The perm solution smells like eggs—this is because of the chemicals that are used."
    },
    {
      "title": "The stylist will curl your hair.",
      "content": "The stylist will curl your hair. After the perm solution is rinsed out of your hair, the stylist will wrap your hair in curls. They may use hot tools or their fingers to curl your hair, but the most common way is to wrap your hair around perm rods. [14] X Research source This is usually the most time-consuming part of the process. If you get a Korean digital perm, the stylist will wrap your hair around rollers that are attached to a machine. The machine digitally controls the temperature of the rollers. Because heat will help set the curls, the stylist may use a milder perm solution. [15] X Research source After any rollers are out of your hair, the stylist will apply a neutralizing solution to set your hair into its new shape. They'll rinse the neutralizer out after about 10–15 minutes, and your perm is finished! [16] X Research source"
    },
    {
      "title": "How do Korean perms work?",
      "content": "How do Korean perms work? Korean perms use the same chemical process as other types of perms. According to Waldman, when perm solution is applied to your hair, it helps loosen the chemical bonds that give your hair its natural shape. Then, your hair is shaped into curls using rollers or heat tools, and a naturalizing solution is applied to set your hair into that shape."
    },
    {
      "title": "Will a Korean perm damage my hair?",
      "content": "Will a Korean perm damage my hair? All chemical treatments can be somewhat damaging, but Korean perms are considered somewhat gentle. However, it’s important to have it done by a stylist who’s familiar with the process for the best results."
    },
    {
      "title": "How do I remove a Korean perm if I don’t like it?",
      "content": "How do I remove a Korean perm if I don’t like it? To get rid of a perm you don’t like, try washing your hair within the first 3 days after the perm, which may help some of the curl fall out."
    },
    {
      "title": "Is a Korean perm the same thing as a digital perm?",
      "content": "Is a Korean perm the same thing as a digital perm? No, but a stylist may use digital perm techniques when giving you a Korean perm. A digital perm is a technique that uses controlled heat to help set waves into your hair. A Korean perm refers more to the finished style of loose, soft waves."
    },
    {
      "title": "How long should your hair be for a Korean perm?",
      "content": "How long should your hair be for a Korean perm? If you have short hair, let it grow out until the front comes down to about your eyebrows and the sides are close to your ears. The longer your hair is, the more there will be to work with, and the more natural your waves will look. [17] X Research source"
    },
    {
      "title": "How much do Korean perms cost?",
      "content": "How much do Korean perms cost? In general, expect to pay up to $200 for a Korean perm. But like any salon procedures, the cost can vary pretty widely depending on where you live and the salon you choose. [18] X Research source Keep in mind that the cost of your haircut may or may not be included in the cost of the perm, so be sure to ask whether that will be extra."
    },
    {
      "title": "What’s the difference between a Korean perm and a Japanese perm?",
      "content": "What’s the difference between a Korean perm and a Japanese perm? Korean and Japanese perms are similar, but Japanese perms tend to focus more on adding volume and a subtle wave, while Korean perms feature a slightly more defined wave. [19] X Research source"
    }
  ]
}