{
  "url": "https://www.wikihow.com/Make-Ricotta-Cheese",
  "title": "How to Make Ricotta Cheese",
  "steps": [
    {
      "title": "Prepare the strainer.",
      "content": "Prepare the strainer. Line the fine-mesh strainer with a large piece of cheesecloth, and set it over the nonreactive bowl. Set this contraption on your work surface so to have it ready for the cheese mixture. If you don't use cheesecloth, it will be difficult to separate the cheese curds from the whey. You can substitute a double layer of paper towels or a thin cotton dishcloth in a pinch."
    },
    {
      "title": "Heat the milk, cream and salt.",
      "content": "Heat the milk, cream and salt. Place the milk, cream and salt in the saucepan and heat the mixture over medium-high heat. Allow it to heat until it reaches 200 degrees F. When the mixture is hot enough, turn off the heat and move the saucepan so the milk can begin to cool. It should take about 5 minutes to reach the correct temperature. Stir the mixture as it's heating to prevent it from scorching on the bottom. [1] X Research source Use raw milk if you can since the natural bacteria will help the cheese ferment. Use your candy thermometer or an instant-read thermometer to determine whether the mixture has reached the right temperature. If you don't let it cook long enough, the curds won't separate from the whey. If you overcook it, the texture will be ruined."
    },
    {
      "title": "Slowly add the vinegar.",
      "content": "Slowly add the vinegar. Use one hand to stir constantly while the other hand slowly pours the vinegar into the heated milk and cream mixture. The vinegar will cause the curds to coagulate and separate from the whey. You'll see solid bits forming and floating to the top of the liquid. Keep stirring until all of the vinegar has been added. The curdling agent in this case is vinegar, but some people prefer to use other substances. Try substituting 3 tablespoons (44.4 ml) of lemon juice for a different flavor. For a more traditional touch, try using animal rennet as your coagulant. [2] X Research source Mix 1 teaspoon of rennet with 1/4 cup of cold water, then stir it into the milk mixture."
    },
    {
      "title": "Let the mixture sit until it's thick.",
      "content": "Let the mixture sit until it's thick. Wait about 10 - 20 minutes for the coagulant to go to work and cause the curds to separate from the whey. It's ready when the curds have floated to the top to form a thick layer, leaving the liquid whey underneath."
    },
    {
      "title": "Ladle the curds into the strainer.",
      "content": "Ladle the curds into the strainer. Scoop out the thick top layer of curds and ladle them over the cheesecloth-covered strainer. Keep ladling out the curds until all that's left in the saucepan is the whey. You can discard the whey at this point."
    },
    {
      "title": "Let the ricotta drain.",
      "content": "Let the ricotta drain. Wait at least an hour for the last of the whey to drain from the ricotta through the cheesecloth into the bowl. It will take about half an hour for the ricotta to fully drain. Don't attempt to stir it or push it through the cheesecloth, as this will just push the curds into the cloth. If you'd like a creamier final product, stop draining the ricotta after 5 - 10 minutes. For a drier final product, wait an hour for it to drain. [3] X Research source"
    },
    {
      "title": "Spoon the ricotta into a bowl.",
      "content": "Spoon the ricotta into a bowl. The finished ricotta is now ready to use in your favorite recipe. It's delicious as part of a savory dish or a dessert. Ricotta will keep in the refrigerator for about a week."
    },
    {
      "title": "Save the whey from making cheese in a non-reactive pot.",
      "content": "Save the whey from making cheese in a non-reactive pot. When you make homemade cheese, you'll have curds at the bottom of the pot, and you'll pour off the whey. Filter as many of the curd particles out as you can since they would otherwise form tough \"beads\" in the final ricotta. Cover the whey and let it sit for at least 12 hours at room temperature to develop sufficient acidity. Acidified whey acts as its own coagulant, making it unnecessary to add vinegar or lemon juice to separate the curds."
    },
    {
      "title": "Heat the acidified whey.",
      "content": "Heat the acidified whey. Pour it into a saucepan and heat it while stirring, taking care to avoid sticking or burning. Heat until the temperature has risen to about 175 degrees Fahrenheit and a white appears on the surface. Continue heating and stirring until the temperature reaches 200 degrees Fahrenheit. Note that the foam will build up somewhat. Be careful . If it boils, it can boil over."
    },
    {
      "title": "Remove the whey from heat and wait for it to curdle.",
      "content": "Remove the whey from heat and wait for it to curdle. Cover it and allow it to cool undisturbed until comfortable to the touch. The curds will soon appear like clouds suspended in the whey, while the whey will be clear and yellowish green."
    },
    {
      "title": "Strain the ricotta.",
      "content": "Strain the ricotta. Do not stir up the curd. Instead, set up a receiving pot with a large strainer and a fine clean cloth on top. Ladle the curds into the cloth, leaving the whey in the saucepan. Discard the whey. Be sure to scoop out the curds gently. Because the curds are very fine and delicate, they can stop up the cloth easily. This will cause very slow draining if they are broken up."
    },
    {
      "title": "Drain the whey through the cloth.",
      "content": "Drain the whey through the cloth. It can take 2-3 hours for the whey to completely drain. If you prefer, you can set the strainer in the refrigerator and let it drain overnight."
    },
    {
      "title": "Remove the ricotta from the cloth.",
      "content": "Remove the ricotta from the cloth. Pack it into a container, cover it and store in the refrigerator. Use it soon after making. Ricotta will keep up to a week in the refrigerator. Alternatively, ricotta freezes very well."
    }
  ]
}