{
  "url": "https://www.wikihow.com/Help-Your-Dog-After-Giving-Birth",
  "title": "How to Help Your Dog After Giving Birth",
  "steps": [
    {
      "title": "Keep an eye on your dog while she is giving birth.",
      "content": "Keep an eye on your dog while she is giving birth. If it doesn’t make her anxious to have your presence, watch your dog while she is laboring. You don’t need to hover. Expect her to be uncomfortable during contractions, just like a woman would be. This is part of the process. In many cases, puppies are born in the middle of the night when you are sleeping. Make it a habit to check on your dog as soon as you wake up as she approaches her due date."
    },
    {
      "title": "Make sure the mother cleans her puppies right away.",
      "content": "Make sure the mother cleans her puppies right away. The mother dog should clean her puppies right after they are born. Give her a minute or two to take the sac off the puppy and start licking and cleaning the puppy. If your dog is taking longer than that, you can step in and get the sack off and vigorously rub the puppy to dry and stimulate breathing. [1] X Research source If necessary, you can carefully tie off the umbilical cord about an inch from the puppy and cut it with clean scissors."
    },
    {
      "title": "Make sure the puppies are nursing.",
      "content": "Make sure the puppies are nursing. Puppies should start nursing within 1-3 hours after birth. You may need to place the puppy in front of a nipple and gently squeeze a little milk out for the puppy to get the idea. If the puppy absolutely will not nurse, or your dog won’t let the puppy nurse, there may be something wrong with the puppy, like a cleft palate. Open the puppy’s mouth and look at the roof of the mouth. It should be a solid surface without any holes into the sinuses. Consult your veterinarian if there are any concerns. You may need to tube feed or bottle feed the puppy with puppy formula if they are not able to nurse and are otherwise healthy."
    },
    {
      "title": "Count the puppies.",
      "content": "Count the puppies. After the puppies are born, count them so you know exactly how many there are. This will help you keep tabs on the pups."
    },
    {
      "title": "Don’t remove the placentas immediately.",
      "content": "Don’t remove the placentas immediately. The mother dog may want to eat the placentas, which is not harmful. She is getting back all the nutrients she put into her pregnancy. Don’t feel compelled to remove them immediately. If she does not eat them, dispose of them in the trash. In some cases, eating the placentas may cause vomiting later. Remember that every puppy will have its own placenta."
    },
    {
      "title": "Keep the birthing area warm.",
      "content": "Keep the birthing area warm. Puppies do not regulate their body temperature well and need to be kept warm. For the first few days after birth, keep one area of the whelping box around 85 degrees F. Then you can drop the temperature down to 75-80 degrees F. Provide extra heat with the help of a heat lamp in one corner of the whelping box. If a puppy gets cold, it will not move much. Check to sure the birthing area is warm and the puppy is staying close to mom and the other puppies."
    },
    {
      "title": "Take the mother and puppies to the vet for checkups.",
      "content": "Take the mother and puppies to the vet for checkups. Schedule a visit with your vet for checkups after the puppies are born. The vet will make sure that the mother is healing properly and that the puppies are growing."
    },
    {
      "title": "Keep other dogs away from the mother and puppies.",
      "content": "Keep other dogs away from the mother and puppies. If you own the father dog, ensure that he is in an area separated from the female dog and the puppies. Other dogs in the household should not be allowed to bother the momma dog and her puppies either. There is a risk of fighting between the adult dogs and possible risk to the puppies themselves. The female may get aggressive because she is protecting her puppies. This is normal and you shouldn't punish her for this instinct. Protective aggression toward humans may occur as well, so prevent children from bothering the puppies too."
    },
    {
      "title": "Do not bathe your dog immediately after birth.",
      "content": "Do not bathe your dog immediately after birth. Unless she is filthy, wait a few weeks to give her a bath with a mild oatmeal shampoo formulated for dogs. Make sure to rinse her well in order to avoid leaving a residue that the puppies would come in contact with while nursing."
    },
    {
      "title": "Feed puppy food to the mother dog.",
      "content": "Feed puppy food to the mother dog. The lactating dog needs to eat a high quality puppy food that is high in protein and calcium. This will allow her to produce substantial amounts of milk. She should eat puppy food until the puppies are weaned. Let her eat as much as she wants, which can often be four times her non-pregnant intake. You cannot overfeed her during this period, as making milk for puppies requires a lot of calories. Be aware that the first 24-48 hours after giving birth, she is likely not going to eat much of anything at all. [2] X Research source"
    },
    {
      "title": "Do not add calcium supplements to the mother’s food.",
      "content": "Do not add calcium supplements to the mother’s food. Do not add more calcium to the mother dog’s diet without first talking to your veterinarian. Getting too much calcium can set her up for milk fever later on. [3] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Milk fever is caused by a significant drop in blood calcium levels and typically occurs 2-3 weeks into lactation. The dog’s muscles will start stiffening and the dog may develop tremors. This can lead to seizures because the calcium levels in the blood are too low. If you suspect milk fever, seek immediate veterinary attention."
    },
    {
      "title": "Allow the new mom to set her schedule.",
      "content": "Allow the new mom to set her schedule. During the first 2-4 weeks, the new mom will be very busy keeping track and taking care of the puppies. She won’t want to be too far from the puppies for very long. It will be important for her to have access to them to keep the puppies warm and fed and clean. Take her out for short bathroom breaks for only 5-10 minutes."
    },
    {
      "title": "Trim hair on dogs with long fur.",
      "content": "Trim hair on dogs with long fur. If your dog has long fur, give her a “sanitary cut” around her tail and hind legs and her mammary glands to help keep these areas clean once the puppies are born. A groomer or your veterinarian can do this procedure if you do not feel comfortable or do not have the equipment."
    },
    {
      "title": "Check the mammary glands of the lactating dog daily.",
      "content": "Check the mammary glands of the lactating dog daily. Mammary gland infections (mastitis) do occur and can get very serious very quickly. If you see mammary glands that are very red (or purple), hard, hot or painful, there is a problem. In some cases, mastitis has the potential to kill the nursing mother dog. If you suspect mastitis, take the dog immediately to your veterinarian. Even if you have to take her to an emergency veterinary hospital, it must happen immediately. [4] X Research source , [5] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source , [6] X Research source"
    },
    {
      "title": "Expect to see vaginal discharge.",
      "content": "Expect to see vaginal discharge. It is normal for you to see vaginal discharge from the momma dog for a few weeks (up to 8 weeks) after birth. This discharge can look brownish red and look stringy. Occasionally a mild odor will be noticed. If you see yellow, green or gray material, or notice a foul odor, take your dog to your veterinarian. She may have an infection in her uterus. [7] X Research source"
    },
    {
      "title": "Monitor the nursing puppies.",
      "content": "Monitor the nursing puppies. Make sure the puppies are nursing every few hours during the first few weeks. They should eat every 2-4 hours at minimum. Happy puppies are sleeping puppies; if they are crying a lot, they may not be getting enough nutrition. Check for fat little bellies and clean coats to signal that they are well cared for. Try weighing the puppies on a digital scale to make sure that they are gaining weight every day. Puppies should double their weight in the first week. [8] X Research source Do not disregard a puppy looking skinnier or less active than the other puppies. Take him to your veterinarian right away. He may require supplemental feeding or other help."
    },
    {
      "title": "Monitor the puppies for abnormalities.",
      "content": "Monitor the puppies for abnormalities. If after the first few days, you see the rest of the puppies growing and one that is still small and skinny, this may be a sign of insufficient feeding or another problem. Take the puppy to a vet right away for an exam immediately. Newborn puppies, like newborn humans, can get sick and dehydrated quickly."
    },
    {
      "title": "Keep the whelping box clean.",
      "content": "Keep the whelping box clean. As the puppies get older and more mobile, the confined area will get messier. Cleaning up after the puppies at least 2-3 times per day will be needed to keep the whelping box sanitary."
    },
    {
      "title": "Handle the puppies to socialize them.",
      "content": "Handle the puppies to socialize them. Puppies need healthy socialization to their new world, including introductions to people. Hold each puppy several times per day. Get the puppies accustomed to being touched everywhere on their bodies so that it will not seem strange when they are older."
    },
    {
      "title": "Wait until your puppies are 8 weeks old before giving them away.",
      "content": "Wait until your puppies are 8 weeks old before giving them away. If you are selling or giving away the puppies, wait until they are 8 weeks old before handing them over to the new owners. In some states, like California, it is illegal to sell or give away puppies before 8 weeks of age. Puppies should be fully weaned and eating dog food on their own before they leave for a new home. Starting a deworming and vaccination program is often recommended before the pup leaves. Consult with your veterinarian and follow her recommendations."
    },
    {
      "title": "Take your dog to the vet for a checkup.",
      "content": "Take your dog to the vet for a checkup. Schedule an appointment with the vet, so she can check on your pregnant dog. The vet will confirm the pregnancy and check for any complications. [9] X Research source"
    },
    {
      "title": "Make a nesting area for your dog.",
      "content": "Make a nesting area for your dog. Provide a nesting area at least a week before you think she is due to give birth. You want to give her the space she needs by putting her in her bed or in a box with towels or blankets for comfort. Choose an area that is secluded, such as in a separate room, so that she can have privacy and quiet."
    },
    {
      "title": "Keep food and water in or near the nesting area.",
      "content": "Keep food and water in or near the nesting area. Make food and water available near your dog so she has easy access. This will also make it possible for her to not leave her puppies to eat and drink."
    },
    {
      "title": "Feed puppy food to your pregnant dog during the final 1/3 of her pregnancy.",
      "content": "Feed puppy food to your pregnant dog during the final 1/3 of her pregnancy. The pregnant dog should eat a high quality puppy food that is high in protein and calcium in the last 1/3 of her pregnancy. This will prepare her body to produce substantial amounts of milk. Your dog should eat puppy food in the final 1/3 of her pregnancy, and then until the puppies are weaned. [10] X Research source Nursing mother dogs require more calories to make enough milk to feed their puppies. [11] X Research source"
    }
  ]
}