{
  "url": "https://www.wikihow.com/Identify-an-Australian-Shepherd",
  "title": "How to Identify an Australian Shepherd",
  "steps": [
    {
      "title": "Look at the dog's body size and shape.",
      "content": "Look at the dog's body size and shape. The Aussie's body is slighter longer than it is tall. They stand about 20-23 inches tall at the shoulders for males, and about 18-21 inches tall at the shoulders for females. [1] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The Aussie has a sturdy build that is solid but well balanced."
    },
    {
      "title": "Look for a smooth, thick coat.",
      "content": "Look for a smooth, thick coat. The Aussie has a signature coat. It typically consists of medium length fur that is relatively smooth and thick. This fur is especially pronounced at the back of the legs, where it is typically feathered. [2] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The coat is also water-resistant, which helps the Aussie work all day in the outdoors, rain or shine."
    },
    {
      "title": "Look for a multi-colored coat.",
      "content": "Look for a multi-colored coat. The Aussie is a multi-colored dog that usually has exciting and dynamic color combinations. The American Kennel Club (AKC) recognizes four different coat colors: black, blue merle, red, or red merle. \"Merle\" refers to a \"marbling\" of colors that has a mixture of colored and silver fur. [3] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The AKC also recognizes three distinct markings, which can be added to any of the coat colors. These include tan points, white markings, or a combination of both."
    },
    {
      "title": "Observe how the dog stands.",
      "content": "Observe how the dog stands. The Aussie's hind legs generally extend just a little behind its body, so it should not give the impression of being squared off like a table. However, it does have a flat back and a strong neck, which gives it a strong appearance. [4] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The front legs should seem to be set back from the front of the dog's body, as the chest of the Aussie puffs out."
    },
    {
      "title": "Check the dog's head shape and proportion.",
      "content": "Check the dog's head shape and proportion. An Aussie's head should look in proportion to the size of its body. The dog's muzzle should have a slightly protruding look and should be a little less than half the length of the skull. [5] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Look for folded ears.",
      "content": "Look for folded ears. The Aussie has ears that are connected high on its head. They are folded down, but they do not look floppy. Instead, they are triangular, with rounded points, and are stiff in appearance. Overall, they should reach down to, or slightly past, the pivot area of the lower jaw. There is some debate about whether an Aussie should have folded or upright ears. While show dogs are required to have folded ears, there are many purebred dogs that have upright, or pricked, ears. [6] X Research source"
    },
    {
      "title": "Look for large, multi-colored eyes.",
      "content": "Look for large, multi-colored eyes. Not all Aussies have multi-colored eyes, but many do. If the dog has two colors in the same eye or a different color in each eye, this condition is called heterochromia. Aussies can have a mix of any colors, including brown, yellow, green, orange, and blue. However, brown is dominant, so most likely. [7] X Research source Any combination of colors, whether solid or marbled, is acceptable for show dogs. Even with marbled colors in their eyes, the pupils of an Aussie should be clearly differentiated from the iris."
    },
    {
      "title": "Look for a bobbed tail.",
      "content": "Look for a bobbed tail. Most Aussies have a naturally bobbed tail. However, breeders will dock the tail to about 4 inches long if it is longer than average. [8] X Research source If the tail is present, it should arc slightly upwards when the dog is holding it upright. [9] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The tail can be described as bushy. It is normally about level to the head when the dog holds both upwards. Tail docking is cosmetic. It is not needed for the health or wellness of the dog. Some breeders may decide not to dock the tails of the dogs."
    },
    {
      "title": "Look for large, oval feet.",
      "content": "Look for large, oval feet. They should be oval and densely compact. Aussies have somewhat large feet, with thick pads and arched toes that should be resilient to the environment around them. [10] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Look for high energy.",
      "content": "Look for high energy. Australian shepherds are known to be high energy dogs. This is because they were originally bred to herd sheep in difficult terrain. If you are just keeping an Australian shepherd as a pet and not as a work dog, you will need to give them lots of exercise to keep them happy and healthy. If your dog has lots of energy and can keep up with vigorous activity, then you may have an Aussie. This high energy can translate into having a love of being involved in a wide variety of activities, such as training sessions, hiking, running errands, or playing in a park."
    },
    {
      "title": "Pay attention to herding behavior.",
      "content": "Pay attention to herding behavior. Aussies are working dogs that love to have a job, such as other herding animals do. They will stay by your side and will eagerly respond to commands you give them. [11] X Research source If you don't have other animals for the Aussie to herd, it may try to herd you or other people it comes into contact with. You should train them not to do this."
    },
    {
      "title": "Assess whether the dog has high intelligence.",
      "content": "Assess whether the dog has high intelligence. Australian shepherds are highly intelligent dogs that can learn most commands very quickly. Because of this, they are typically easily housebroken and taught house rules. [12] X Research source This means that you can teach your dog to follow a wide variety of commands and you can do all kinds of activities with it, such as obstacle courses or fetching games."
    }
  ]
}