{
  "url": "https://www.wikihow.com/Get-the-Hex-Code-of-a-Color-on-Your-Computer-Screen",
  "title": "Simple Ways to Find the Hex Code of Any Color on Your Computer",
  "steps": [
    {
      "title": "Install Color Cop.",
      "content": "Install Color Cop. Color Cop is a small, free utility you can use to quickly identify the hex code of any color on the screen. Here's how to get the app: Go to colorcop.net/download in a web browser. Click colorcop-setup.exe under \"self-installing.\" If the file doesn't download automatically, click Save or OK to start the download. Double-click the downloaded file (it's in the Downloads folder, and usually at the bottom-left corner of the browser tab). Follow the on-screen instructions to install the application."
    },
    {
      "title": "Open Color Cop.",
      "content": "Open Color Cop. You'll find it in your Start menu."
    },
    {
      "title": "Drag the eyedropper icon to the color you want to identify.",
      "content": "Drag the eyedropper icon to the color you want to identify. You can identify any color on the screen, including those in other applications and on websites."
    },
    {
      "title": "Let go of the mouse button to reveal the hex code.",
      "content": "Let go of the mouse button to reveal the hex code. The code will appear in the blank at the center of the application."
    },
    {
      "title": "Double-click the hex code and press Ctrl+C.",
      "content": "Double-click the hex code and press Ctrl + C . This copies the hex code to your clipboard."
    },
    {
      "title": "Paste the code where you need it.",
      "content": "Paste the code where you need it. You can use Ctrl + V to paste the hex code anywhere you wish, such as in your HTML or CSS code."
    },
    {
      "title": "Open Digital Color Meter on your Mac.",
      "content": "Open Digital Color Meter on your Mac. This tool, which comes with macOS, can identify the color value of any color on the screen. [1] X Research source Open Finder, double-click the Applications folder, double-click the Utilities folder, and then double-click Digital Color Meter to open it."
    },
    {
      "title": "Move the mouse cursor to the color you want to identify.",
      "content": "Move the mouse cursor to the color you want to identify. As you move the mouse, the values in the tool will update in real-time. Don't move your mouse from this location until you lock both the horizontal and vertical apertures. You can also use the tool to identify colors on the web. Just open Safari (or your preferred browser) and navigate to a website that contains the color you want to identify. If Digital Color Meter is showing RGB colors instead of hex codes, go to View > Display Values > as Hexadecimal ."
    },
    {
      "title": "Press ⌘ Command+L.",
      "content": "Press ⌘ Command + L . This locks both the horizontal and vertical apertures, which means the color value will not change when you move the mouse."
    },
    {
      "title": "Press ⇧ Shift+⌘ Command+C to copy the hex code to the clipboard.",
      "content": "Press ⇧ Shift + ⌘ Command + C to copy the hex code to the clipboard. You can also copy the hex code by clicking the Color menu and selecting Copy Color as Text ."
    },
    {
      "title": "Press ⌘ Command+V to paste the copied code.",
      "content": "Press ⌘ Command + V to paste the copied code. You can paste it directly into your HTML code, a text file, or any other typing area."
    },
    {
      "title": "Press ⌘ Command+L to unlock the apertures.",
      "content": "Press ⌘ Command + L to unlock the apertures. If you want to identify another color, this releases the lock so the cursor once again acts as a color value identifier."
    },
    {
      "title": "Go to imagecolorpicker.com on your computer, phone, or tablet.",
      "content": "Go to imagecolorpicker.com on your computer, phone, or tablet. You can use this free tool to identify the hex code of any color in an uploaded image. This method will work in any web browser, including those on your Android, iPhone, or iPad."
    },
    {
      "title": "Upload an image or enter a URL.",
      "content": "Upload an image or enter a URL. You'll need to decide whether you want to upload your own image or use an image or website already online. Either method can be used to display a picture or webpage so you can select your desired color. To get started, click Use your image in the lower-right part of the screen. Choose how you want to use your image. You can pick Upload image , Color on your Screen , Website Url , Image Url , Paste clipboard , or Search . Upload image will allow you to upload an image from your computer. Click Browse or drop image and choose the image you want to upload. Color on your Screen will allow you to pick a color that's currently on your screen. Click Start to begin. Website Url and Image Url allow you to paste a URL to a website or image you want to find a color from. Paste clipboard allows you to paste an image from your clipboard into imagecolorpicker.com. Search allows you to find an image on Pexels (a stock photo site)."
    },
    {
      "title": "Click or tap the color you want within the image/site preview.",
      "content": "Click or tap the color you want within the image/site preview. This displays the color hex code to the right of the image. You can also see the RGB color under the hex code. Click Show more to see shades, tints, and color combinations with the hex code you picked. Look under your image to see a color palette of the main colors in the image."
    },
    {
      "title": "Click or tap the copy icon to copy the hex code to your clipboard.",
      "content": "Click or tap the copy icon to copy the hex code to your clipboard. It's the two overlapping squares to the right of the hex code. You can then paste it into any text file or typing area."
    },
    {
      "title": "Open Firefox on your PC or Mac.",
      "content": "Open Firefox on your PC or Mac. The Firefox web browser comes with a free Eyedropper tool you can use to identify the hex code of any color on the web. If you have Firefox, you'll find it in the Start menu (Windows) or in the Applications folder (macOS). You can download Firefox for free at mozilla.org/en-US/firefox . Firefox will only tell you the value of a color on a website. You can't use it outside of the browser."
    },
    {
      "title": "Go to a website that contains the color you want to identify.",
      "content": "Go to a website that contains the color you want to identify. Make sure the element you need the color for is in view."
    },
    {
      "title": "Click the menu ☰.",
      "content": "Click the menu ☰ . It's the three horizontal lines at the top-right corner of Firefox."
    },
    {
      "title": "Click More tools > Eyedropper.",
      "content": "Click More tools > Eyedropper . Your mouse cursor will turn into a large circle."
    },
    {
      "title": "Click the color you want to identify.",
      "content": "Click the color you want to identify. You'll notice the hex value of the colors update live as you move the mouse to the location. Once you click the mouse, Firefox will save the hex code to your clipboard."
    },
    {
      "title": "Paste the code where you need it.",
      "content": "Paste the code where you need it. You can use Control + V (PC) or Command + V (Mac) to paste the hex code into your HTML, CSS, or any other type of text file."
    },
    {
      "title": "Install the ColorZilla browser extension.",
      "content": "Install the ColorZilla browser extension. ColorZilla is a browser extension with several functions, one of which is an eyedropper tool to find the hex codes of colors in your browser. [2] X Research source Get ColorZilla for Firefox and Chrome . The Chrome extension can also be added to other Chromium browsers, like Microsoft Edge and Opera."
    },
    {
      "title": "Pin the extension to your toolbar.",
      "content": "Pin the extension to your toolbar. Click the extensions icon in your toolbar to view all extensions, then click the pin icon next to ColorZilla to pin it for easy access. The extensions icon will vary based on your browser; it might be a puzzle piece, a star, or a cube, but it's always to the right of your address bar."
    },
    {
      "title": "Click the ColorZilla extension.",
      "content": "Click the ColorZilla extension. It looks like an icon of an eyedropper. You will immediately be able to pick out colors on your screen."
    },
    {
      "title": "Left-click on a color to copy the color to your clipboard.",
      "content": "Left-click on a color to copy the color to your clipboard. The ColorZilla extension will remember the last color you picked and show it as a box over the eyedropper icon in your toolbar. To cancel without picking a color, you can either click the X button in the ColorZilla bar at the top of your screen, or you can right-click on the page."
    },
    {
      "title": "Paste the code where you need it.",
      "content": "Paste the code where you need it. You can use Control + V (PC) or Command + V (Mac) to paste the hex code into your HTML, CSS, or any other type of text file."
    },
    {
      "title": "",
      "content": "If you can't find the color you're looking for, you can copy and paste the code from this extensive list of colors: HTML Color Chart Color Color Name HTML Hex Code maroon #800000 dark red #8B0000 brown #A52A2A firebrick #B22222 crimson #DC143C red #FF0000 tomato #FF6347 coral #FF7F50 indian red #CD5C5C light coral #F08080 dark salmon #E9967A salmon #FA8072 light salmon #FFA07A orange red #FF4500 dark orange #FF8C00 orange #FFA500 gold #FFD700 dark golden rod #B8860B golden rod #DAA520 pale golden rod #EEE8AA dark khaki #BDB76B khaki #F0E68C olive #808000 yellow #FFFF00 yellow green #9ACD32 dark olive green #556B2F olive drab #6B8E23 lawn green #7CFC00 chartreuse #7FFF00 green yellow #ADFF2F dark green #006400 green #008000 forest green #228B22 lime #00FF00 lime green #32CD32 light green #90EE90 pale green #98FB98 dark sea green #8FBC8F medium spring green #00FA9A spring green #00FF7F sea green #2E8B57 medium aqua marine #66CDAA medium sea green #3CB371 light sea green #20B2AA dark slate gray #2F4F4F teal #008080 dark cyan #008B8B aqua #00FFFF cyan #00FFFF light cyan #E0FFFF dark turquoise #00CED1 turquoise #40E0D0 medium turquoise #48D1CC pale turquoise #AFEEEE aqua marine #7FFFD4 powder blue #B0E0E6 cadet blue #5F9EA0 steel blue #4682B4 corn flower blue #6495ED deep sky blue #00BFFF dodger blue #1E90FF light blue #ADD8E6 sky blue #87CEEB light sky blue #87CEFA midnight blue #191970 navy #000080 dark blue #00008B medium blue #0000CD blue #0000FF royal blue #4169E1 blue violet #8A2BE2 indigo #4B0082 dark slate blue #483D8B slate blue #6A5ACD medium slate blue #7B68EE medium purple #9370DB dark magenta #8B008B dark violet #9400D3 dark orchid #9932CC medium orchid #BA55D3 purple #800080 thistle #D8BFD8 plum #DDA0DD violet #EE82EE magenta / fuchsia #FF00FF orchid #DA70D6 medium violet red #C71585 pale violet red #DB7093 deep pink #FF1493 hot pink #FF69B4 light pink #FFB6C1 pink #FFC0CB antique white #FAEBD7 beige #F5F5DC bisque #FFE4C4 blanched almond #FFEBCD wheat #F5DEB3 corn silk #FFF8DC lemon chiffon #FFFACD light golden rod yellow #FAFAD2 light yellow #FFFFE0 saddle brown #8B4513 sienna #A0522D chocolate #D2691E peru #CD853F sandy brown #F4A460 burly wood #DEB887 tan #D2B48C rosy brown #BC8F8F moccasin #FFE4B5 navajo white #FFDEAD peach puff #FFDAB9 misty rose #FFE4E1 lavender blush #FFF0F5 linen #FAF0E6 old lace #FDF5E6 papaya whip #FFEFD5 sea shell #FFF5EE mint cream #F5FFFA slate gray #708090 light slate gray #778899 light steel blue #B0C4DE lavender #E6E6FA floral white #FFFAF0 alice blue #F0F8FF ghost white #F8F8FF honeydew #F0FFF0 ivory #FFFFF0 azure #F0FFFF snow #FFFAFA black #000000 dim gray / dim grey #696969 gray / grey #808080 dark gray / dark grey #A9A9A9 silver #C0C0C0 light gray / light grey #D3D3D3 gainsboro #DCDCDC white smoke #F5F5F5 white #FFFFFF"
    }
  ]
}