{
  "url": "https://www.wikihow.com/Know-if-Someone-Is-Online-on-Facebook-Messenger",
  "title": "How to Check if Someone's Online in Facebook Messenger",
  "steps": [
    {
      "title": "Open Facebook Messenger.",
      "content": "Open Facebook Messenger. It's the multi-colored chat bubble icon with a white lightning bolt inside. You'll find it on your home screen or in the app drawer (Android). [1] X Research source If you're not signed in, follow the on-screen instructions to sign in now. Facebook Messenger is available for iOS in the App Store and for Android in the Google Play Store . Keep in mind that you can only see other people's active status if you have your own active status enabled."
    },
    {
      "title": "Tap People.",
      "content": "Tap People . This is the tab at the bottom-right corner of the screen."
    },
    {
      "title": "View your active friends.",
      "content": "View your active friends. You'll see a list of everyone who is currently active on Messenger. If a friend is online, you'll see a green circle next to their profile picture. If they are not active on Messenger, you'll see Active (minutes/hours) ago . If you don't see any active statuses, make sure your active status is enabled ."
    },
    {
      "title": "Go to the Messenger website in a web browser.",
      "content": "Go to the Messenger website in a web browser. This is Facebook's official Messenger app for desktop browsers. If you don't see your conversations, click Continue as (your name) or enter your login information as prompted. If you don't remember your password, you can reset it ."
    },
    {
      "title": "Click the \"People\" tab.",
      "content": "Click the \"People\" tab. This looks like an icon of two people. You'll find it underneath the Chat tab."
    },
    {
      "title": "View active contacts.",
      "content": "View active contacts. You'll now see a list of your Messenger contacts who are actively online. [2] X Research source If you see Active contacts (0) , this means no one is currently active on Messenger. If you return to the Chats tab, you can see a list of recent friends. If they are not active on Messenger, you'll see Active (minutes/hours) ago . You can always add new contacts or create a post on a friend's timeline. If you don't see any active statuses, make sure your active status is enabled ."
    },
    {
      "title": "The green dot means the user is currently or has been recently active on Facebook or Messenger.",
      "content": "The green dot means the user is currently or has been recently active on Facebook or Messenger. In some cases, the green dot may appear even if the user isn't currently chatting. This could be due to Facebook being open in the background, network issues, or having push notifications enabled. If you want to know if the user is currently active in the same chat, you must have \"Show When You're Active Together\" enabled in your Active Status settings. Currently, this feature is only available on mobile. [3] X Research source The green dot won't show for users who have adjusted their privacy settings to disable activity status."
    },
    {
      "title": "Open the Facebook app.",
      "content": "Open the Facebook app. If you aren't already logged in, do so now. You can also edit your Active Status on the Messenger app. Tap ☰ > Settings > Active Status . Toggle on Show when you're active . [4] X Research source"
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . This is the menu button."
    },
    {
      "title": "Tap Settings & Privacy, then Settings.",
      "content": "Tap Settings & Privacy , then Settings . Your settings will open."
    },
    {
      "title": "Tap Active Status.",
      "content": "Tap Active Status . You can find this underneath Audience and visibility ."
    },
    {
      "title": "Toggle on \"Active Status\".",
      "content": "Toggle on \"Active Status\". This is next to Show when you're active . You must have Active Status enabled to see other users' active status."
    },
    {
      "title": "Go to the Facebook website in a web browser.",
      "content": "Go to the Facebook website in a web browser. If you aren't logged into your account, do so now. You can also edit your Active Status on the Messenger website. Click your profile picture, and then click Preferences . Then, set Active Status to On ."
    },
    {
      "title": "Click the Messenger icon.",
      "content": "Click the Messenger icon. This is the lightning bolt in a speech bubble."
    },
    {
      "title": "Click ••• .",
      "content": "Click ••• . This is next to Chats . A menu will open."
    },
    {
      "title": "Click Active Status.",
      "content": "Click Active Status . This is towards the bottom of the menu."
    },
    {
      "title": "Toggle on \"Active Status\".",
      "content": "Toggle on \"Active Status\". The switch will turn blue. You must have Active Status enabled to see other users' active status. If you only want this enabled for some people, click Edit next to Active Status: ON for some , and then select the users."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . This will apply your changes."
    }
  ]
}