{
  "url": "https://www.wikihow.com/Make-a-Cheese-Sandwich",
  "title": "How to Make a Cheese Sandwich",
  "steps": [
    {
      "title": "Butter two slices of bread.",
      "content": "Butter two slices of bread. Spread ½ tablespoon of butter on each slice of bread. Only coat one side of the bread; leave the other side bare. You can use any type of bread you want, but sourdough works especially well in grilled cheese sandwiches. For a twist, pour some olive oil into the skillet instead of coating the sandwich with butter."
    },
    {
      "title": "Heat up a skillet over medium heat.",
      "content": "Heat up a skillet over medium heat. You do not need to oil the skillet because the bread already has butter on it."
    },
    {
      "title": "Layer the bread and cheese onto the skillet.",
      "content": "Layer the bread and cheese onto the skillet. Place a slice of bread, butter-side-down, onto the skillet. Add 1 to 2 slices of Cheddar cheese on top of the bread. You can also try another type of cheese, such as Monterey Jack, for a gourmet sandwich."
    },
    {
      "title": "Add some extras, if desired, then the last slice of bread.",
      "content": "Add some extras, if desired, then the last slice of bread. You can leave your sandwich plain, or you can pile some extra ingredients on top of the cheese. When setting down the last slice of bread, make sure that the buttered side is facing upwards this time. Add cooked, sliced or crumbled bacon on top of the cheese. Place a slice of ham on top of the cheese. Sprinkle dried herbs, such as basil, oregano, or rosemary, on top of the cheese. [4] X Research source This will work especially well if you put herbs on your sandwich. Add slices of tomato and cooked bacon. [5] X Research source"
    },
    {
      "title": "Grill the sandwich until it starts to turn a light brown color.",
      "content": "Grill the sandwich until it starts to turn a light brown color. This will take about 2 to 3 minutes. You can also wait for the cheese to start melting instead."
    },
    {
      "title": "Flip the sandwich over and continue grilling it.",
      "content": "Flip the sandwich over and continue grilling it. Once the sandwich has started to turn golden-brown and the cheese has melted, slide a spatula under it and flip it over. Grill the sandwich for another 1 to 2 minutes."
    },
    {
      "title": "Serve the sandwich.",
      "content": "Serve the sandwich. Use a spatula to transfer it from the skillet and to a plate. Leave the sandwich whole, or cut it in half. You can cut it vertically or diagonally."
    },
    {
      "title": "Slice a Ciabatta roll in half lengthwise.",
      "content": "Slice a Ciabatta roll in half lengthwise. You can also try another type of bread roll instead."
    },
    {
      "title": "Layer the ham and cheese on top of the bottom slice.",
      "content": "Layer the ham and cheese on top of the bottom slice. Set the bottom half of the roll down, cut-side-up. Place 2 slices of ham on top of it, followed by 2 slices of Swiss cheese. If you don't like Swiss cheese, you can try another type of cheese, such as Monterey Jack."
    },
    {
      "title": "Prepare the honey-mustard spread.",
      "content": "Prepare the honey-mustard spread. Scoop the mayo into a small cup or bowl. Add the honey, dried mustard, and poppy seeds. Stir everything together with a fork or mini whisk until evenly combined."
    },
    {
      "title": "Spread the honey-mustard over the top roll.",
      "content": "Spread the honey-mustard over the top roll. Flip the top half of the bread roll over so that the under/cut side is facing you. Use a butter knife to spread the honey-mustard across the roll."
    },
    {
      "title": "Assemble the sandwich.",
      "content": "Assemble the sandwich. Place the top half of the roll down onto the cheese, with the honey-mustard side facing down. For a fancier sandwich, stir a pinch of poppy seeds into ¼ tablespoon of melted butter, then spread it across the top of your sandwich with a pastry brush."
    },
    {
      "title": "Bake the sandwich, if desired.",
      "content": "Bake the sandwich, if desired. To turn this into a tasty, gourmet sandwich, preheat your oven to 350°F (175°C). Once the oven reaches the correct temperature, place the sandwich onto a baking sheet and tuck it inside. Bake the sandwich for 15 to 20 minutes."
    },
    {
      "title": "Serve the sandwich.",
      "content": "Serve the sandwich. If you baked the sandwich, let it cool for about 3 to 5 minutes before digging in. If you want a fancier presentation, cut the sandwich in half. Stick a fancy, sandwich/cocktail toothpick through the middle of each half."
    },
    {
      "title": "Spread some butter onto your choice of bread.",
      "content": "Spread some butter onto your choice of bread. Cut 2 slices of crusty bread, such as French bread. Spread some softened butter over one side of each slice of bread. For a fancier sandwich, try pesto, olive oil, or hummus. You can also use mayo or a thick, creamy salad dressing, such as Ranch, Italian, or Green Goddess."
    },
    {
      "title": "Layer the lettuce on top of the bottom slice.",
      "content": "Layer the lettuce on top of the bottom slice. Place the bottom slice down, buttered-side-up. Place 1 to 2 leaves of lettuce on top. If the lettuce leaves are much larger than the sandwich, cut them into halves or thirds first. Some types of lettuce have a very thick stem in the middle. Reduce bulk by cutting this stem out with a sharp knife."
    },
    {
      "title": "Add some spice with onion.",
      "content": "Add some spice with onion. Cut a thin slice off of a red onion. Separate the slice into rings. Place as many rings as you want onto the lettuce. You can leave the onion rings off if you want to."
    },
    {
      "title": "Top it off with some tomato slices.",
      "content": "Top it off with some tomato slices. Cut off two thick slices of tomato. Stack them on top of the lettuce and onion. A thick, meaty tomato would work the best for this."
    },
    {
      "title": "Add some reasoning, if desired.",
      "content": "Add some reasoning, if desired. Add a sprinkle of salt and a dash of pepper on top of the tomato slices. How much you use is entirely up to you!"
    },
    {
      "title": "Finish it off with a few slices of cheese.",
      "content": "Finish it off with a few slices of cheese. Carefully lay 1 to 2 slices of sharp, white Cheddar on top of the sandwich. Make sure that they are covering the tomatoes entirely. They will keep your sandwich from getting soggy. If you don't like Cheddar, try Swiss, Monterey Jack, or Provolone instead."
    },
    {
      "title": "Place the final slice on top and serve the sandwich.",
      "content": "Place the final slice on top and serve the sandwich. For an extra-fancy touch, slice the sandwich in half diagonally from corner-to-corner. Stick a fancy toothpick or cocktail stick through each sandwich half to hold it together."
    }
  ]
}