{
  "url": "https://www.wikihow.com/Make-Vitamin-C-Serum",
  "title": "How to Make Vitamin C Serum",
  "steps": [
    {
      "title": "Collect your ingredients.",
      "content": "Collect your ingredients. You can find everything that you will need to make a basic vitamin C serum from a health food store or grocery store. To make a basic vitamin C serum, you will need to gather these ingredients and materials: 1/2 teaspoon of vitamin C powder 1 tablespoon of hot (not boiling) distilled water a tablespoon and a 1/2 teaspoon a small glass bowl a plastic whisk a small funnel a brown or cobalt (dark blue) glass container"
    },
    {
      "title": "Add the vitamin C powder to the hot water.",
      "content": "Add the vitamin C powder to the hot water. Pour one tablespoon of hot water into your bowl. Then, measure out ½ teaspoon of vitamin C powder and add it to the hot water.Mix the ingredients together until they are well-combined. Sometimes, vitamin C powder meant for oral use can clog your pores or cause a rash. Test the powder on a patch of skin to see if it causes any irritation. [3] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021"
    },
    {
      "title": "Transfer the basic vitamin C serum to your brown or cobalt glass container.",
      "content": "Transfer the basic vitamin C serum to your brown or cobalt glass container. Place the funnel spout in the bottle and pour the serum into the funnel to avoid spilling any of the serum. Seal the bottle and store it in the refrigerator for up to two weeks. [4] X Research source The cold, dark environment of your refrigerator will help to keep the vitamin C serum fresh and potent. You can make a fresh batch of vitamin C serum every two weeks or as needed."
    },
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. You can get all of the ingredients that you will need to make moisturizing vitamin C serum from a health food store or a well-stocked grocery store. To make vitamin C serum, you will need: 1/2 teaspoon of vitamin C powder 1 tablespoon of hot (not boiling) distilled water 2 tablespoons of vegetable glycerin OR non-comedogenic oil. Non-comedogenic oils are those that will not clog your pores such as hempseed oil, argan oil, sunflower oil, or calendula oil. 1/4 teaspoon of vitamin E oil 5-6 drops of an essential oil of your choice such as rose, lavender, frankincense, or geranium oil measuring spoons bowl for mixing the serum ingredients something to mix the ingredients such as a fork or small whisk small funnel to transfer the serum to the glass container dark colored glass container for storing the serum"
    },
    {
      "title": "Combine the vitamin C powder and water.",
      "content": "Combine the vitamin C powder and water. Dissolve ½ teaspoon of the vitamin C powder in one tablespoon of hot water. Place the tablespoon of hot water in your bowl and then add ½ teaspoon of vitamin C powder to the water. Mix the water and vitamin C powder together with a fork or whisk."
    },
    {
      "title": "Mix in two tablespoons of vegetable glycerin or oil.",
      "content": "Mix in two tablespoons of vegetable glycerin or oil. Add the vegetable glycerin or non-comedogenic oil to the water and vitamin C powder mixture. Vegetable glycerin and non-comedogenic oils both work well as a base for the vitamin C serum, but some people like to use oil because it is similar to the sebum on our skin. Sebum acts as a protective barrier for your skin."
    },
    {
      "title": "Add ¼ teaspoon of vitamin E oil.",
      "content": "Add ¼ teaspoon of vitamin E oil. [5] X Research source Vitamin E acts as an emollient, which means that it will help soften your skin. This ingredient is optional, but it is a nice addition if you would like the serum have more moisturizing qualities."
    },
    {
      "title": "Include 5-6 drops of essential oil.",
      "content": "Include 5-6 drops of essential oil. Adding an essential oil is optional, but it can add a pleasant scent and enhance the properties of your vitamin C serum as well. If you do not want to add the essential oil, then you can just move on to the next step."
    },
    {
      "title": "Mix the ingredients well.",
      "content": "Mix the ingredients well. Use your whisk or fork to mix the oil in with the vitamin C powder and water. Mix until all of the ingredients are well-combined. Keep in mind that oil separates from water over time so you will need to shake your vitamin C serum before each use."
    },
    {
      "title": "Use the funnel to transfer the moisturizing vitamin C serum to your glass container.",
      "content": "Use the funnel to transfer the moisturizing vitamin C serum to your glass container. Use your funnel to transfer the vitamin C serum to your dark glass container. You may also want to use a spatula to scrape any excess serum from the bowl and pour it into the funnel. Place the lid on your bottle after you have transferred all of the serum to the bottle."
    },
    {
      "title": "Store your vitamin C serum.",
      "content": "Store your vitamin C serum. While basic vitamin C serum will last for up to two weeks, you should make a fresh batch of the moisturizing vitamin C serum every three days. [6] X Research source If you want the serum to last longer, then you can store your vitamin C serum in the refrigerator for up to a week. Even though the serum will be somewhat protected from light in a dark glass bottle, you can also wrap the bottle in tin foil to make sure that no light can get to the serum at all."
    },
    {
      "title": "Test the serum on a small patch of your skin.",
      "content": "Test the serum on a small patch of your skin. Before using the serum for the first time, you may want to test it on a small patch of your skin to make sure that it is not too acidic. [7] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021 Place a small amount on the inside of your wrist and wait a few hours to see if you have any reaction to it. Do not use the serum if you notice any redness or a rash after using it. If you notice any burning or tingling, then you may want to add a little more water to the serum to reduce the acidity."
    },
    {
      "title": "Use the serum on your skin twice daily.",
      "content": "Use the serum on your skin twice daily. Use your vitamin C serum twice daily after washing your face and moisturizing. If you used oil to make your serum, then the serum can take the place of your normal moisturizer. If you notice any tingling, burning, redness, or other reaction to the serum, wash it off right away and do not use it again."
    }
  ]
}