{
  "url": "https://www.wikihow.com/Grow-a-Cactus",
  "title": "How to Grow a Cactus",
  "steps": [
    {
      "title": "Pick seed pods from existent cacti or buy commercial seeds.",
      "content": "Pick seed pods from existent cacti or buy commercial seeds. When it comes to obtaining seeds for your cactus, you have two options: buying seeds from a gardening store or supplier or picking your own from a cactus that you already have at your disposal. Here, you are essentially choosing between price and convenience — store-bought seeds are cheap and pre-packaged, while self-picked seeds are free but require a little more work. [1] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source If you're buying seeds, you shouldn't have too much trouble finding them for sale. Many brick-and-mortar garden supply stores sell cactus seeds, while online shopping sites can allow you to effortlessly browse hundreds of varieties before ordering. If, on the other hand, you want to pick your own seeds, start by finding the seed pods or fruits on your cactus. Usually, these are brightly-colored offshoots of the main cactus body which bear a flower. When the flower falls off, the pod or fruit is ripe and is ready to be harvested (assuming it has been pollinated)."
    },
    {
      "title": "If harvesting seeds from cactus pods, gather the pods.",
      "content": "If harvesting seeds from cactus pods, gather the pods. Remove the pods or fruits from the cactus before they dry out. The pods should not be full of moisture but should still be damp to the touch inside. The seeds themselves, which are inside the pod or fruit can vary in appearance from cactus to cactus. Some seeds will be discrete black or reddish dots clearly visible from one another, while other seeds can be so small as to appear like sand or dust. \"Ripe\" pods with mature seeds should come off with a slight twist of the hand, leaving the interior fiber/cotton on the cactus. If the pod does not come off easily, it is not ready to be removed."
    },
    {
      "title": "Next, harvest the seeds from the pods.",
      "content": "Next, harvest the seeds from the pods. Once you've removed all of the mature pods from your cactus, it's time to remove the seeds themselves from the pods. Begin by using a sharp knife to slice the tops off of the pods. Next, slice down one side of the pod to expose the seeds. Finally, remove the seeds by carefully scraping them from the inside of the pod. Obtaining the seeds from tropical varieties of cactus can be different than obtaining the seeds from a desert cactus, but the general concept is the same — remove the fruit from the plant and open it up to expose the seeds. For example, the seeds of a Christmas Cactus, a type of tropical cactus, can be harvested by removing the blueberry-like fruit and squeezing or tearing it open to produce small black seeds. [2] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Plant the seeds in high-drainage soil.",
      "content": "Plant the seeds in high-drainage soil. Whether you bought seeds or harvested them from an existent cactus, you'll want to plant them in clean, shallow containers filled with suitable soil. Moisten the soil thoroughly before planting but do not allow any standing water to remain. Next, spread the seeds across the top of the soil (don't bury them). Finally, lightly cover the seeds with a very thin layer of soil or sand. Cactus seeds only have a small amount of stored energy and if planted too deeply will not reach the surface before they run out. Cacti require well-draining soil, especially desert varieties that are vulnerable to diseases from standing water. Try a mix of ⅓ compost, ⅓ horticultural sand, and ⅓ perlite. [3] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source If the soil you use for planting hasn't been pasteurized (it should say whether or not on the packaging), you may want to consider heating it in the oven at 300 o F (about 150 o C) for half an hour. This kills any pests or pathogens in the soil."
    },
    {
      "title": "Cover the container and expose it to sun.",
      "content": "Cover the container and expose it to sun. Once you've moistened the soil and planted your cactus seeds, cover the container with a transparent lid (like plastic wrap) and place it in a location where the seeds will receive a good amount of sun — a sunny window is a good location. Sunlight should not be intense and constant, but should be strong for at least a few hours each day. The transparent lid will retain moisture in the container as the cactus begins to sprout while allowing light to reach the cactus. Be patient as you wait for your cactus to germinate. Depending on the species of cactus you are growing, germination can take anywhere from several weeks to several months. Tropical cacti are used to the shady environment under the jungle canopy and thus generally require less sun than desert cacti. You can usually get away with growing a tropical cactus in a brightly-lit spot that receives no direct sunlight. For instance, hanging pots under a shaded awning are a great location for tropical cacti."
    },
    {
      "title": "Keep tropical cacti at a steady, warm temperature.",
      "content": "Keep tropical cacti at a steady, warm temperature. While desert cacti in their natural environment are routinely exposed to extreme temperature swings (from extremely hot during the day to extremely cold at night), tropical cacti enjoy balmy, consistently warm weather. Thus, it's a wise idea to grow tropical cacti in locations where they won't experience intense, direct sunlight during the day or chilly cold at night. Try to keep tropical cacti at a temperature of roughly 70-75 o F (21-24 o C) — greenhouses are great for this. If you don't live in the tropics, you'll probably need to grow your tropical cacti indoors, where temperature and access to sunlight is much easier to control."
    },
    {
      "title": "When the first spines show, allow the plant to ventilate.",
      "content": "When the first spines show, allow the plant to ventilate. In the weeks after you plant your new cactus seeds, your seedling should begin to germinate. Cacti typically grow fairly slowly, so this can take a month or more. Eventually, you should be able to see the first tiny emergence of your cactus's spines. When this happens, start giving your cactus a chance to breathe by removing the transparent cover during the day. As the cactus grows, you may leave the cover off for longer periods of time until the plant is well-established and no longer needs the cover. [4] X Research source It's worth noting, however, that this will increase the rate at which water evaporates from the soil. This means that you'll need to start watering. Try to do so cautiously — don't let the soil dry out completely, but don't ever leave standing water in the container from over-watering. Note that many tropical cacti won't have spines, so in this case simply remove the cover once the seedling sprouts up through the soil."
    },
    {
      "title": "Repot your cacti when they are well-established.",
      "content": "Repot your cacti when they are well-established. As noted above, cacti grow fairly slowly. Depending on the type of cactus you have, it should take about 6 months to 1 year to grow to roughly the size of a large marble. At this point, it's a wise idea to repot the cactus in a different container. Like most potted plants, keeping a cactus in a container that's too small for it can cause the plant to become nutrient-starved, inhibiting its growth and even killing it. To repot your cactus, use sturdy gloves or a spade to remove the entire plant, roots and all, from its growing medium. Place it in a new, larger container with a the same type of soil, pack the soil around the cactus, and water."
    },
    {
      "title": "Allow cacti to recover from repotting in the shade.",
      "content": "Allow cacti to recover from repotting in the shade. As the visible, above-ground portion of your cactus grows, its roots will as well. As your cactus becomes larger and larger, which can take years, it may need to be repotted multiple times. However, because the transplantation process can be stressful for plants, it's important that you allow your cactus to \"recover\" after each time you repot it. Instead of keeping the repotted cactus in a location where it receives a good amount of sunlight, try keeping it in a shaded or partially-shaded area until its roots re-establish. Gradually re-introduce the cactus to sun over a period of a month or so."
    },
    {
      "title": "Water",
      "content": "Water infrequently. Established cacti have less vigorous watering requirements than most other potted plants. Though they do require some water, their reputation as hardy desert survivors is well-earned. Most varieties of desert cactus require little water once they're fully established. Though individual species of cactus may differ in the amount of water they require, a good general rule is to let the soil dry out completely before watering. Depending on the temperature, this mean waiting a month or longer between waterings. [5] X Research source Remember that cacti experience slow, gradual growth. Thus, they don't need very much water. Watering more frequently than is necessary can lead to problems for the plant, including root disorders that can cause the eventual death of the plant. Tropical cacti are something of an exception to this rule, as they are naturally acclimatized to more humid environments than desert cacti. While you can get away with a little more watering if you have a tropical cactus, you should still wait until the soil dries out before each new watering."
    },
    {
      "title": "Fertilize young plants during the growing months.",
      "content": "Fertilize young plants during the growing months. Though cacti grow slowly, their growth can be supplemented during the growing months of spring and summer with the light application of fertilizer or plant food. Cacti generally require less fertilizer than other plants — try using a diluted solution of liquid fertilizer once a month. Mix a small quantity of liquid fertilizer with an equal volume of water. Use this mixture to water your cactus every second or third watering. [6] X Research source The precise amount of fertilizer you should use can vary based on both the species of cactus you are growing and its size. Specific information should be on the fertilizer's packaging."
    },
    {
      "title": "Prevent rot by avoiding over-watering.",
      "content": "Prevent rot by avoiding over-watering. One of the most common problems when it comes to potted plants is fungal rot (also called root rot ). This affliction typically occurs when the roots of a plant are held in contact with moisture that is unable to properly drain, which becomes stagnant and encourages fungal growth. This can happen to most potted plants, but desert cacti are especially susceptible as they naturally require only a small amount of water compared to other plants. The best cure for rot is a preventative one: simply avoid over-watering in the first place. As a general rule, it's better to under-water than to over-water when it comes to cacti. You'll also want to use a good-quality potting soil with a high level of drainage for all cacti. If your plant has rot, it may appear swollen, soft, brownish, and/or decayed, with the possibility of splits in its surface. Often, but not always, this condition moves from the bottom of the plant up. The options for treating rot after it has set in are limited. You can try to remove the cactus from its pot, cut away any slimy, blackened roots and any dead tissue above ground, and re-plant it in a new container with clean soil. However, if the damage to the roots is extensive, it may die anyway. In many cases, it's necessary to discard plants with rot to prevent the spread of the fungus to other adjacent plants. [7] X Research source"
    },
    {
      "title": "Gradually increase exposure to sunlight to treat etiolation.",
      "content": "Gradually increase exposure to sunlight to treat etiolation. Etiolation is a condition in which a plant experiences pale, sickly growth because it is not exposed to enough light. Cacti with etiolated growth will often have a thin, flimsy quality and a pale, light-green color. The etiolated portion of the plant will grow towards a nearby light source, if there are any. While etiolation is permanent in the sense that any sickly growth that has already occurred cannot be reversed, future etiolation can be curbed by ensuring the plant receives a sufficient amount of sunlight. However, you won't want to throw a cactus with etiolated growth into intense, direct sunlight immediately. Instead, gradually increase the amount of sun the plant receives each day until you notice that its growth has become normal. Exposing any plant to drastically increased sunlight can be stressful for the plant, while exposing an etiolated cactus to such levels of sunlight can be fatal."
    },
    {
      "title": "Avoid phototoxicity by limiting sun exposure after using pesticides.",
      "content": "Avoid phototoxicity by limiting sun exposure after using pesticides. If you've ever noticed that you've gotten an especially-bad sunburn after being in water, you've experienced something similar to phototoxicity, a harmful malady that can affect your plant. After applying an oil-based pesticide to a plant, the oil from the pesticide remains on the surface of the plant, acting as a sort of \"tanning lotion\" by increasing the intensity of the sun's rays. This can cause the portions of the plant on which the oil is present to become burnt, grey, and dried-out. To prevent this, place the cactus in a shaded location for a few days until the oil-based pesticide has done its work before returning it to the sun."
    },
    {
      "title": "Don't be frightened by natural \"corking\".",
      "content": "Don't be frightened by natural \"corking\". One aspect of the cactus life cycle with which most people are not familiar is the process of \"corking\", in which the bottom portions of a mature cactus slowly start to develop a tough, brown, bark-like exterior. Though this condition can appear serious because it replaces the natural green exterior with one that appears dead, it's not actually a sign that the plant is in any danger and can usually be ignored. Natural corking usually starts at the base of the plant and can slowly creep upwards. If the corking starts elsewhere on the plant, this can be a sign of a problem. For instance, if the top of the cactus and the side facing the sun bear this weathered appearance but the base of the cactus does not, this can be a sign that the cactus is receiving too much sun, rather than the result of natural corking. [8] X Research source"
    }
  ]
}