{
  "url": "https://www.wikihow.com/Make-Instagram-Forget-Your-Login-Info",
  "title": "How to Make Instagram Forget Your Login Info (Turn off Auto Login Permanently)",
  "steps": [
    {
      "title": "It's the outline of a person (or your profile photo) at the bottom-right corner.",
      "content": "It's the outline of a person (or your profile photo) at the bottom-right corner. This takes you to your profile. If you're already signed out, simply open the Instagram app and skip to step 6."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's the three horizontal lines at the top-right corner."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's the gear icon on the menu."
    },
    {
      "title": "A confirmation message will appear.",
      "content": "A confirmation message will appear. The confirmation asks if you want to log out of Instagram."
    },
    {
      "title": "You may be asked whether you want to remember your login info.",
      "content": "You may be asked whether you want to remember your login info. To make sure Instagram doesn't save your login info, remove the checkmark from \"Remember my login info\" or select Not Now when prompted. [1] X Research source"
    },
    {
      "title": "It's on the pop-up window.",
      "content": "It's on the pop-up window. This signs you out of Instagram and displays any logins that your phone or tablet has saved."
    },
    {
      "title": "You will see one of these two options next to each login name on the screen.",
      "content": "You will see one of these two options next to each login name on the screen. The option you see depends on your version. If there are no displayed logins, Instagram has not saved any login information and you don't have to continue."
    },
    {
      "title": "A confirmation message will appear.",
      "content": "A confirmation message will appear. This confirmation asks if you want to remove the account."
    },
    {
      "title": "The login information for the selected account is now erased.",
      "content": "The login information for the selected account is now erased. You can tap Done editing to exit this screen."
    }
  ]
}