{
  "url": "https://www.wikihow.com/Invert-Colors-on-Chromebook",
  "title": "Inverting Colors on Chromebook to Enable High Contrast Mode",
  "steps": [
    {
      "title": "Press Ctrl + Search + H.",
      "content": "Press Ctrl + Search + H . The Search key is where the Caps Lock key usually is and has an image of a magnifying glass on it. Pressing Ctrl + Search + H at the same time will instantly switch to high contrast mode, which inverts the colors on your screen. The Search key might be the Launcher key instead and feature a colored-in circle. Whether it's the Search or Launcher key, it's still a part of the keyboard shortcut to turn on high contrast mode. [1] X Research source Press the shortcut again to toggle off high contrast mode and change your screen's colors back to normal."
    },
    {
      "title": "Click the clock .",
      "content": "Click the clock . It's at the bottom-right corner of your screen."
    },
    {
      "title": "Click the Settings icon .",
      "content": "Click the Settings icon . This gear icon will open your Chromebook's settings."
    },
    {
      "title": "Click Advanced.",
      "content": "Click Advanced . You'll see this in the panel on the left side of the window. It's also at the bottom of the Settings page when you scroll all the way down."
    },
    {
      "title": "Click Accessibility.",
      "content": "Click Accessibility . If you clicked Advanced on the menu on the left side of the window, you'll see this option here. If you clicked Advanced at the bottom of the page, you'll see the option expand down into the center window."
    },
    {
      "title": "Click Manage accessibility features.",
      "content": "Click Manage accessibility features . You'll see this after you click Accessibility and will be redirected to accessibility feature settings."
    },
    {
      "title": "Click the switch next to \"Use high contrast mode\" to toggle it on .",
      "content": "Click the switch next to \"Use high contrast mode\" to toggle it on . You'll find this under the \"Display\" header. If you want to disable high contrast mode, repeat these steps and click the switch to toggle it off. [2] X Research source"
    }
  ]
}