{
  "url": "https://www.wikihow.com/Lose-Weight-Fast-(Teens)",
  "title": "How to Lose Weight Fast (Teens)",
  "steps": [
    {
      "title": "Consult with a medical professional.",
      "content": "Consult with a medical professional. It is advisable for anyone embarking on a diet to talk with a doctor or registered dietitian first because making sudden lifestyle changes, even good ones, can harm an unprepared body. [1] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Teens especially should consult with a professional because their growing bodies have particular nutritional needs and because teens often have unrealistic views of what constitutes a healthy weight. To repeat, weight loss should never be undertaken alone, without any guidance, especially for teens. A sensible plan tailored to your specific needs in combination with the right support network will increase the odds of weight loss success and reduce the possibility of negative health impacts. [2] X Research source"
    },
    {
      "title": "Determine if you actually need to lose weight, and if so, how much.",
      "content": "Determine if you actually need to lose weight, and if so, how much. Due to the types of peer pressure common in high school settings, as well as unrealistic, “airbrushed” body image ideals promoted in popular culture, many teens who are sure they need to shed pounds are actually already at a healthy weight. Some may only need to put on weight more slowly to match their growing bodies. [3] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Sadly, in a culture where millions of teens would benefit from losing weight, many who don’t need to lose weight end up endangering their health and well-being by attempting to do so. This is why it is important to consult with a healthcare professional first. Establish whether you need to lose weight, and if so, set up realistic, healthy goals for your weight loss regimen. It is unwise and possibly harmful to try to do this on your own. Determining your Body Mass Index (BMI) is one way to gauge your goal for weight loss (or weight gain, for that matter). BMI calculators are available online, specifically calibrated for teen girls, for instance. A BMI calculation is not a substitute for medical advice from a professional, however, which will factor in details like your overall health and medical and family histories."
    },
    {
      "title": "Make sure you’re losing weight for the right reasons.",
      "content": "Make sure you’re losing weight for the right reasons. Teens should only undertake a weight loss regimen in order to improve their health and their mental/emotional well-being. [4] X Research source Being overweight can cause undue stress, negative self-image, and possibly problems like depression or even a desire to harm yourself. Under the proper guidance, and with the right emotional support network—perhaps including professional assistance—a healthy weight loss plan can help resolve such issues. Don’t try to lose weight to make your partner happy or to look like a model in a magazine ad. Do it for you, for your health, and your happiness."
    },
    {
      "title": "Be realistic about losing weight fast.",
      "content": "Be realistic about losing weight fast. Yes, this article promises help in losing weight “fast,” but “fast” in this case is a relative and realistic term. Generally speaking, unless you are under the specific guidance of a physician, any regimen that averages more than two pounds lost per week is not considered safe or healthy. [6] X Research source “Quick fix” plans and fad diets can be bad for your health in and of themselves and are unlikely to address the root causes of why you are overweight. [7] X Expert Source Alyssa Chang Wellness Coach & Personal Trainer Expert Interview. 16 October 2019. They make it more likely that your weight will rebound back up after a short-term loss, which can have negative physical and psychological effects. Think of it in terms of the old story of the tortoise and the hare. We all want to shed the excess pounds quickly, but “slow and steady” tends to win the battle against obesity."
    },
    {
      "title": "Make your health your priority.",
      "content": "Make your health your priority. This cannot be stated often enough, especially for teens. Lose weight only to improve your health and don’t endanger your health by losing weight. Wellness coach Alyssa Chang explains that “people often run themselves into the ground by training intensely without giving themselves enough recovery time.” [8] X Expert Source Alyssa Chang Wellness Coach & Personal Trainer Expert Interview. 16 October 2019. Chang then stresses the importance of a good sleep schedule, as “sleep helps the body restore muscle tissues, detoxify itself, and more.” [9] X Expert Source Alyssa Chang Wellness Coach & Personal Trainer Expert Interview. 16 October 2019. Skip the diet pills that can have unknown or damaging side effects and the starvation diets (anything under 1600 calories for the average teen) that can lead to ongoing health problems. [10] X Research source Losing weight is about changing your life for the better, not risking long-term damage for some temporary satisfaction. Teens can have trouble thinking in the long term, which is why the right support network, including family, friends, and experts, is of such importance."
    },
    {
      "title": "Limit restaurant meals.",
      "content": "Limit restaurant meals. [11] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source While it's possible to stick to your diet at a restaurant, you really have no idea what's going into your food back in the kitchen. You might think the fish is a great, low-calorie option without realizing that the first and last thing that went into the dish was butter. There's nothing more frustrating than seeing weight gain or slowed loss when you think you're sticking to the plan. Preparing your own meals at home lets you control what you're putting in your body and keeps you on track. Sometimes, you want to grab food with your friends on the weekend. That's okay—you don't have to miss out on your social life for your diet. When you do eat out, ask the waiter about how the dishes you're interested in are cooked to prevent any surprises that might frustrate your diet. Don't be afraid to ask them to ask the kitchen if they don't know the answers. Consider the portion sizes of restaurant foods. Ask if they have smaller portion options (like a ½ rack of ribs instead of the full rack), or before you even start eating, put a portion of the meal into a “to go” bag."
    },
    {
      "title": "Monitor your portion sizes.",
      "content": "Monitor your portion sizes. If you live in the United States, you may have a concept of meal size that differs from most of the rest of the world. While the serving sizes on our nutrition labels are accurate, the portion sizes we serve ourselves in restaurants and at home are often enormous. [12] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source Always start with less food than you think you'll need. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Eat slowly to give your body time to process how full your stomach is getting—the brain needs about 20 minutes before it can tell the stomach is full. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you're still hungry after that, eat a little more until you're satisfied. Use your hand to measure your portion sizes. [15] X Trustworthy Source Dairy Council of California Resource center focused on providing nutrition education to help consumers make healthy choices about eating and lifestyle habits. Go to source For example, the recommended 3 oz (85 g) of meat in a serving fits in the palm of your hand. A cup of any food is about the size of a fist, while ½ a cup fits into a cupped palm (a handful)."
    },
    {
      "title": "Get plenty of exercise.",
      "content": "Get plenty of exercise. [16] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source While changing your diet is essential to effective weight loss, regular exercise will enable you to burn off excess calories without sacrificing the nutritional value of the food you consume. In other words, if you reduce calories strictly by eating less, you risk missing out on nutrients; reducing calories in part through exercise avoids this problem. The best way to get fast results that keep you motivated is to combine your diet change with an active lifestyle. [18] X Expert Source Alyssa Chang Wellness Coach & Personal Trainer Expert Interview. 16 October 2019. Plus, staying active during your teen years raises your chances of staying active into adulthood, ensuring healthy weight down the road. Talk to your doctor, a trainer, or a professional at the gym to help you plan a safe and effective exercise program. Try to make it fun—you don't have to grind it out at the gym by yourself! Enlist your friends to keep you company and make it a social activity, as long as you can stay focused. Joining a sports team is a great way to spend time with your friends while getting a lot of structured exercise. Even walking has health and weight-loss benefits and is a good way to start. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Drink a lot of water.",
      "content": "Drink a lot of water. No matter what kind of diet plan you're on, drinking lots of water will help you lose weight and keep it off. A recent study showed that drinking just 17 oz (½ liter) of water increased both men and women's metabolisms—the rate at which the body burns calories—by 30%. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source On top of that, drinking enough water can keep your body from confusing thirst for hunger, reducing your need to snack between meals. Drink a glass of water before meals, then drink another glass while you’re eating. Taking sips between bites slows you down as you eat and keeps you from eating past the point of fullness. Make sure to drink about 15.5 cups (3.7 liters) of water every day for men or 11.5 cups (2.7 liters) for women, but don't be afraid to drink more. [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Drinking water also keeps your skin hydrated and can help keep acne in check."
    },
    {
      "title": "Stop drinking your calories.",
      "content": "Stop drinking your calories. All those sodas and energy drinks are flooding you with calories that don't satisfy your hunger. Water is the perfect, calorie-free drink that goes with every meal and keeps your body healthy to boot. [22] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source If you need a morning pick-me-up, replace your Frappuccino with a black coffee."
    },
    {
      "title": "Avoid fad diets.",
      "content": "Avoid fad diets. When you want to lose weight fast, it's tempting to try any of the number of diets that promise immediate results. However, these “fad diets” often only result in temporary weight loss—usually from water weight. [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Furthermore, they can pose real health risks if taken too far because they drastically limit what you can eat and can cause nutritional imbalance. For instance, eating nothing but grapefruit for two weeks will certainly help you lose weight, but you'll feel terrible. The weight will come back as soon as you return to a regular diet. Be wary of any diet that: Promises quick weight loss. Helps a company sell a product (like a supplement or detox drink, for example). Lacks credible scientific research to support its claims. Seriously restricts your food options (for example, eating cabbage soup for a week)."
    },
    {
      "title": "Don’t undertake a calorie reduction plan without proper guidance.",
      "content": "Don’t undertake a calorie reduction plan without proper guidance. Some experts even advise against calorie counting plans for teens because growing bodies have particular and changing nutritional needs that may not be met with such diets. [24] X Research source Any calorie counting plan (or calorie reduction plan in general) needs to emphasize the nutritional value of the calories consumed first and foremost. The advice of a health professional in setting up your plan is the best way to ensure this necessity."
    },
    {
      "title": "Learn how calorie counting works.",
      "content": "Learn how calorie counting works. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There's a big difference between calorie counting and just “eating less.” Calorie counting is a thoughtful approach that makes sure you stay within healthy energy and nutrition levels. Without this thoughtful approach, you may end up with malnutrition. When we eat more calories than we need to get through the day, the body stores that energy away for later. Unfortunately, it stores it as fat. By limiting our calorie intake, we encourage the body to burn off our excess fat for energy."
    },
    {
      "title": "Determine your activity level.",
      "content": "Determine your activity level. Calorie counting works by making sure you spend more calories through activity than you take in through food. Thus, you can’t set your new calorie limit until you figure out how many calories you burn on an average day. [26] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Decide where you fit among the following three options: Sedentary Lifestyle: You spend most of your day sitting, whether at a desk at school or on the couch at home. Exercise isn’t part of your regular routine. Moderate Activity: You’re active throughout the day, stay on your feet, and do heavier chores around the house like lawn mowing or vacuuming. You make room in your schedule for exercise several times a week, whether on your own or with a team at school, and you work yourself hard during these sessions. Very Active: You exercise every single day and push yourself as hard as you can."
    },
    {
      "title": "Figure out how many calories you burn, then how many you should consume for healthy weight loss.",
      "content": "Figure out how many calories you burn, then how many you should consume for healthy weight loss. For teenagers of high school age (14–18 years old), each activity level burns approximately the following amount of calories per day: Sedentary: 1,800 in girls and 2,000 – 2,400 in boys [27] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Moderately Active: 2,000 in girls and 2,400-2,800 in boys Very active: 2,400 in girls and 2,800-3,200 in boys One pound of fat is equal to 3,500 calories, so to lose one pound per week, you need to consume on average 500 fewer calories per day (3,500 per week) than you burn. [28] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Therefore, if you are a moderately active girl who wants to lose one pound per week, you need to eat 500 calories less per day than the 2,000 you burn (about 1,500 calories). Please note, however, that teens who consume less than 1,600 calories per day risk malnutrition, so only undertake such a diet under the supervision of a medical professional. [29] X Research source"
    },
    {
      "title": "Do not over-restrict your calorie intake.",
      "content": "Do not over-restrict your calorie intake. This is always worth repeating when it comes to teens and weight loss. [30] X Research source The most important thing about counting calories is making sure you still give your body enough fuel to get through the day. Pushing the limit will put a lot of strain on your vital organs and could result in serious health risks. It is also bad for weight loss, as your body gets tricked into thinking it's starving. When this happens, it lowers its metabolism and hangs onto energy (in the form of fat) as long as it can, slowing down weight loss. Under no circumstances should you eat fewer than 1,200 calories per day."
    },
    {
      "title": "Count your calories carefully.",
      "content": "Count your calories carefully. The FDA requires all food labels to give accurate information about nutritional content, including calorie count. [31] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Use the information on those labels to keep track of how many calories you're eating throughout the day. Make sure to stay as close to your daily limit as possible. There are many websites and phone apps you can use to track your calorie intake throughout the day. Some phone apps even have barcode scanners that let you input calorie data just by pointing your phone camera at the label. Make sure to measure out your servings. That small bag of chips from the gas station might have 2.5 servings in it (not just 1 serving). Input your calorie information accurately. [32] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Look up the caloric content of non-packaged foods.",
      "content": "Look up the caloric content of non-packaged foods. Ideally, you should be eating a lot of healthy fresh fruits and vegetables that don't come with nutrition labels on them. This can make it hard to tell how many calories you're consuming. Luckily, you can just look up the calorie count of these items online. [33] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For produce, fish, and other unlabeled foods, use the USDA’s FoodData Central webpage to find calorie and nutrition information. Measure out your serving sizes to make sure you're getting your real calorie count. Measuring cups and food scales are the best way to ensure accuracy."
    },
    {
      "title": "Swap high-calorie for low-calorie foods.",
      "content": "Swap high-calorie for low-calorie foods. Although you can lose weight through pure calorie restriction alone, regardless of how healthy the food is, it's better to eat nutritious options. [34] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Those foods, coincidentally, are usually lower in calories to begin with. Look for foods that are low in calories, but dense in nutrition. Examples include raisins, leafy greens like spinach and kale, fresh vegetables and fruits like strawberries and carrots, and lean proteins like chicken and fish. [35] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Educate yourself on carbs and low-carb plans.",
      "content": "Educate yourself on carbs and low-carb plans. Carbohydrates are sugars and starches that the body converts to glucose, a type of sugar the body can use for energy. [36] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source There are simple carbs (such as in fruits and vegetables) as well as complex carbs (bread, cereal, rice, potatoes, etc.). Some low-carb diets focus particularly on cutting out the latter. The biggest problem, however, is probably the consumption of “empty carbs,” or carb-rich foods with limited nutritional value (think potato chips, for instance). There’s no single way to reduce carbohydrate intake. Some plans allow a limited amount of complex carbs, while others cut them out of the diet completely. If you stick to the diet, cutting carbs has been shown to quickly reduce weight, though it can return when you resume a normal diet. [37] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source A good baseline for a low-carb diet is 60–130 grams of carbohydrates per day. Compare that to the 225–325 grams recommended for a regular (but still healthy) diet. [38] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Once again, your safest bet is to consult with a healthcare professional about low-carb diet options. Don’t blindly trust what you hear on commercials or see online."
    },
    {
      "title": "Consider the other benefits and possible risks of low-carb dieting.",
      "content": "Consider the other benefits and possible risks of low-carb dieting. [39] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Cutting carbs is a quick way to lose weight, but studies show that it can have other health benefits as well. That said, it is not without risk. Low-carb diets do seem to have an advantage over other diets in short-term weight loss; the evidence regarding long-term weight loss is less clear, although low-carb diets seem to be at least as effective in this realm as other diets. [40] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Low-carb diets may decrease your chances of heart disease by improving your HDL cholesterol and triglyceride levels. It may also lower your blood sugar, decreasing your risk of developing diabetes. [41] X Research source These benefits are associated with any weight-loss regimen, though, not just low-carb diets. When you begin a low-carb plan, you may experience headaches, fatigue, constipation, and other symptoms as your body attempts to adjust. If your carb intake is too low, you risk nutritional deficiencies and disorders like ketosis, which occurs when you don’t have enough glucose stored for energy and your body responds with several unpleasant effects."
    },
    {
      "title": "Fill your meals with nutritious, low-carb foods.",
      "content": "Fill your meals with nutritious, low-carb foods. Because so many of our calories usually come from carbohydrates, many people don't bother counting calories when they're on a low-carb diet. The foods you eat on a low-carb diet will fill you up and provide nutrition without bombing your body with calories. Typical foods on a low-carb diet include: [42] X Research source Any type of fish or shellfish (excluding mussels and oysters). Any type of poultry (chicken, turkey, etc.). Any type of meat, assuming carbs haven't been added through processing. The most common culprits are bacon and ham that are cured in sugar. Dark, leafy greens like spinach, arugula, and kale. All vegetables except for starchy ones like potatoes and parsnips. Small amounts of cheese (about 1 gram per day). Healthy fats and oils (butter, cold-pressed vegetable oils, olive oil, mayonnaise with no added sugar)."
    },
    {
      "title": "Avoid carbohydrate-rich foods.",
      "content": "Avoid carbohydrate-rich foods. The best thing you can do for yourself is stop eating processed foods. Though they're cheap and often delicious, they fill your body with empty calories without providing any significant nutrition. Foods to avoid include: [43] X Trustworthy Source American Diabetes Association Health-based nonprofit focused on preventing and researching diabetes Go to source Sugars: Some people choose to cut even simple sugars from fruits and juices out of their low-carb diets. At the very least, avoid the refined sugars found in soft drinks, candies, desserts, and sugary breakfast cereals. Avoid processed fruits (canned in syrup, dried). Grains: This includes pasta, bread, rice, and cereal. Again, some people choose to cut all grains out of their diets. At the least, cut refined grains (white bread, white rice, regular pasta) out and opt for whole grain options (wheat or whole-grain bread, brown rice, whole-wheat pasta). Starchy vegetables: Although potatoes and parsnips are vegetables, their starch content makes them a bad fit for a low-carb diet."
    },
    {
      "title": "Track your carbohydrate intake.",
      "content": "Track your carbohydrate intake. Just like with calories, it's important to count your carbohydrates to make sure you're staying on track. This is especially important if you've decided to limit, but not completely eliminate, common carbohydrate sources like bread and rice. [44] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Check nutrition labels for carbohydrate counts. Measure food with measuring cups and a food scale. Keep track of your daily intake and make sure you stay within your daily limit."
    },
    {
      "title": "Think about why you (over)eat.",
      "content": "Think about why you (over)eat. Many people who are overweight tend to overeat not because they are hungry all the time, but because of boredom, unhappiness, social or family expectations, or just a lack of good information about healthy eating. [45] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This is one of the reasons why healthy, lasting weight loss is about more than just trying to eat less. Only by identifying and addressing root behaviors can a proper weight loss plan succeed. This is also why the right support network is so important. If depression or some other condition is at the root of your struggle with your weight, the proper help is essential before any concern about weight loss. Teen weight loss is often most effective when the entire family is fully supportive. This does not necessarily mean that everyone has to go on a diet; it may, however, mean changing mealtime routines and replacing unhealthy eating habits with more nutritious alternatives."
    },
    {
      "title": "Think about your long-term goals.",
      "content": "Think about your long-term goals. [46] X Expert Source Alyssa Chang Wellness Coach & Personal Trainer Expert Interview. 16 October 2019. The hardest part of a diet is keeping yourself positive and motivated. Don't think about what you're missing out on. Instead, focus on how good it's going to feel when you can feel comfortable in your own skin and wear the clothes you want to wear. [47] X Research source When you see other people who look great, don't get jealous. Focus on how good you’ll look (and feel) if you stick to your plan!"
    },
    {
      "title": "Focus on the allowed foods you enjoy.",
      "content": "Focus on the allowed foods you enjoy. When you frame your diet in terms of what you're missing out on, you start dreading your meals. Don't even think about what you can't eat. Instead, focus on the foods you're allowed to eat that you actually enjoy! [48] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You don't have to eat broccoli if you don't like it—stick to munching on the carrots you love. So what if you can't eat bread? You can still eat the turkey from your favorite turkey sandwich. A diet shouldn't be a punishment. Put some thought into making your meals enjoyable so you look forward to them."
    },
    {
      "title": "Give yourself a cheat day.",
      "content": "Give yourself a cheat day. No matter how hard you try to focus on the positives, it can be hard to give up a food you really love, whether it's donuts or potato chips. If you deny yourself completely, you may get frustrated and give up. [49] X Research source A good way to avoid this is to allow yourself one structured cheat day a week. When the day is over, you'll have satisfied all your cravings and will be ready to put in another six days of healthy eating. Don't cheat mindlessly. When you're eating forbidden foods on cheat day, really savor the experience. Enjoy that burger with all five senses, and eat it slow to make the experience last longer."
    },
    {
      "title": "Forgive yourself for occasional slip-ups.",
      "content": "Forgive yourself for occasional slip-ups. It's important to hold yourself accountable and stick to your diet. But every once in a while, the urge to accept an offered cookie or soft drink might get the better of you—and that's okay! [50] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you ate 100 calories too much today, don't beat yourself up about it. Just work out a little harder tomorrow or eat especially healthy food. Even though you want to lose weight fast, don't forget that weight loss is still a long-term process. Little mistakes here and there won't ruin your diet. Cut yourself some slack, but rededicate yourself to your plan. You'll get there soon enough!"
    },
    {
      "title": "Talk to other people about your journey.",
      "content": "Talk to other people about your journey. Getting positive feedback and support from other people is a great way to stay motivated. If you have a friend or two who are also trying to lose weight, talk to them about your struggles on bad days or how you're feeling really positive on good days. Or, find people to talk to in online weight loss forums where you can share your frustrations and successes with a lot of people who are going through the same thing. Consider joining Weight Watchers or another respected weight-loss program for extra support and information. Many hospitals and medical clinics also have weight-loss centers to help teenagers lose weight effectively and safely. Starting a friendly competition with friends and relatives can help you exceed your goals. Who can get the most steps in on their pedometer this week?"
    }
  ]
}