{
  "url": "https://www.wikihow.com/Make-a-Discord-Guild",
  "title": "An Overview of the Discord Guilds Experiment + Guilds FAQ",
  "steps": [
    {
      "title": "Guilds are small Discord servers dedicated to gaming communities.",
      "content": "Guilds are small Discord servers dedicated to gaming communities. A Guild can have up to 200 members. Being in a Guild adds the Guild tag next to your name in every server you're in, not just the Guild server. [1] X Research source"
    },
    {
      "title": "The ability to make Guilds isn't available to all users.",
      "content": "The ability to make Guilds isn't available to all users. As with many experimental features, Discord only rolled Guilds out to some users. If you weren't chosen for the Guild experiment, you can't create a Guild."
    },
    {
      "title": "Discord is ending the Guilds experiment.",
      "content": "Discord is ending the Guilds experiment. On February 11, 2025, Discord announced that the Guild experiment would be ending soon, but did not explicitly state when the Guilds experiment would be ending. They may make new, standalone experiments for certain features of the Guild experiment. [2] X Research source The steps below on how to make a Guild and how to join a Guild may or may not work for you, depending on if you still have Guild access."
    },
    {
      "title": "Create a new server, or convert an existing server to a Guild.",
      "content": "Create a new server, or convert an existing server to a Guild. If you are in the Guilds experiment, you'll see a banner when you visit a server you own inviting you to the Guilds experiment. If you want to create a new server for your Guild, click the + button at the bottom of the Discord sidebar and make a new server. Then, once your server is created, go into your server settings. If you're converting an existing server into a guild, simply go to the server settings."
    },
    {
      "title": "Click Guild Settings in your server settings.",
      "content": "Click Guild Settings in your server settings. To get to server settings, click the down arrow next to the server's name in the upper-left corner of the screen, then click Server Settings . The Guild Settings option will be under the \"Community\" heading."
    },
    {
      "title": "Choose the game(s) your Guild will play together.",
      "content": "Choose the game(s) your Guild will play together. Type the game name in the search bar and click on a game to choose it. You can always add or remove games from this list later."
    },
    {
      "title": "Choose your Guild's play style.",
      "content": "Choose your Guild's play style. There are four options: very casual, casual, competitive, and very competitive. This will help potential Guild members figure out the Guild's vibe, so they can join one that fits their own personal play style."
    },
    {
      "title": "Choose a target audience.",
      "content": "Choose a target audience. This is optional, but it's recommended to choose a few traits to better define the vibe of your Guild. You can choose some game-specific tags (such as server location, voice chat preference, ranks, etc.) as well as minimum age, traits (such as \"beginner friendly\", \"LGBTQIA+\", \"streamers\", etc.), and languages."
    },
    {
      "title": "Add at least three topics that your Guild members like to talk about.",
      "content": "Add at least three topics that your Guild members like to talk about. When not talking about the game, what do your Guild members chat about? Discord offers up a number of ideas to choose from, or you can type your own. Some of the pre-set options include \"anime\", \"sleeping\", \"DnD\", \"hiking\", \"late night tacos\", and \"travel\", to name a few."
    },
    {
      "title": "Write a short description of your Guild.",
      "content": "Write a short description of your Guild. If you don't know what to write, Discord suggests describing your Guild in just three words."
    },
    {
      "title": "Make a Guild tag and badge.",
      "content": "Make a Guild tag and badge. This tag will be displayed after all Guild members' usernames in all servers they are in, though members can adjust their Guild tag display settings as well. Tags are a max of 4 characters. They are not unique, so multiple Guilds could have the same tag. Badges are a small image that is displayed next to your Guild tag. You can choose from a number of images (such as a sword, mushroom, heart, flower, and more). You can also edit the badge's color by using one of the predefined color choices or picking your own."
    },
    {
      "title": "Customize your Guild banner.",
      "content": "Customize your Guild banner. You can choose from several banner styles (Night Sky, Castle, World Map, Sea Foam, Warp, House, Pulsar, Mesh, and Splatter). You can also choose a predefined color palette for the banner, or select your own."
    },
    {
      "title": "Create your Guild application.",
      "content": "Create your Guild application. When users join a Guild, it's not just as simple as clicking the invite link—they must fill out an application and be accepted, as well. When you make your Guild, you are, therefore, in charge of making up the questions for the application. You must have at least one question in your Guild application to create the guild. Answers to the application questions can be short paragraph, long paragraph, or multiple choice."
    },
    {
      "title": "Finalize your Guild.",
      "content": "Finalize your Guild. After completing the Guild application, your Guild server is now live. If you've upgraded an existing server, you likely don't need to do much else after finishing Guild setup. However, if you created a brand new server, you can start adding channels and more ."
    },
    {
      "title": "Click an invite link.",
      "content": "Click an invite link. Just like a normal Discord server, clicking an invite link to a Guild will bring you to that Guild's server. However, before you can join, you'll have to fill out the application and wait to be accepted. If you weren't chosen for the Guild experiment, it seems like you can still join a Guild by clicking an invite link for one."
    },
    {
      "title": "Click a Guild tag.",
      "content": "Click a Guild tag. Additionally, you can join a Guild by clicking on someone's Guild tag and clicking Apply To Join . If you don't see Apply To Join but instead see Join Waitlist for Guilds , you aren't part of the Guild experiment. Since Discord is ending the Guild experiment, it's likely that if you see someone with a Guild tag and try to join that Guild or the Guilds waitlist, you may not get in."
    },
    {
      "title": "How do I get added to the Guilds experiment?",
      "content": "How do I get added to the Guilds experiment? As of February 2025, Discord will be ending the Guilds experiment, so no more users will be added. However, there is no way to guarantee that you'll be given access to this experiment or any future Discord experiments. Discord tends to roll its experiments out in waves, and some experiments are only given to a portion of its users."
    },
    {
      "title": "Can I disable Guild tags from showing up in my server?",
      "content": "Can I disable Guild tags from showing up in my server? No, Guild tag visibility can only be set by individual users."
    },
    {
      "title": "How do I leave a Guild?",
      "content": "How do I leave a Guild? Leaving a Guild is the same as leaving any other server. Simply click the dropdown next to the server's name (or right-click the server's icon) and choose Leave Server ."
    },
    {
      "title": "How do I make my server not a Guild anymore?",
      "content": "How do I make my server not a Guild anymore? Go to Server Settings > Guild Settings , then click Disable Guild ."
    }
  ]
}