{
  "url": "https://www.wikihow.com/Make-a-Match-Rocket",
  "title": "How to Make a Match Rocket",
  "steps": [
    {
      "title": "Cut a square of aluminum foil.",
      "content": "Cut a square of aluminum foil. A match rocket is simple to make: all you need is a few match heads, plus a piece of foil to wrap around them. You'll end up with a tiny rocket that shoots out smoke and hot air when lit, pushing itself up and away. To get started, cut out a foil square about 5 x 7 inches (13 x 18 cm) works well. [1] X Research source There are two types of foil: normal and heavy-duty. Heavy duty foil makes a better seal, but it will weigh down your rocket if you use too much."
    },
    {
      "title": "Wrap the foil around a skewer.",
      "content": "Wrap the foil around a skewer. Lay the skewer down along the long side of the foil. Roll the skewer along the foil to wrap a foil tube around it. Try to keep the foil tight against the skewer, and as even as you can. Pull out the skewer, leaving a hollow foil tube behind. You can buy wooden skewers at most grocery stores. If you don't have one, wrap a smaller piece of foil around a matchstick instead."
    },
    {
      "title": "Cut the heads off matchsticks.",
      "content": "Cut the heads off matchsticks. Snip off the match heads with a pair of scissors. You only need one match head for each rocket. [2] X Research source Do this over a cloth or cloth-lined container so the match heads don't bounce away. Paper matches are a good option since they weigh less, but any type of match should work."
    },
    {
      "title": "Push a match head into the foil tube.",
      "content": "Push a match head into the foil tube. Use the skewer to push a single match head into the foil tube. Stop once it's about ½ to 1 inch (1.25–2.5 cm) from the end. [3] X Research source If one end of the tube is more uneven or ragged than the other, put the match head near this end. You can put more match heads into the rocket if you want, as long as you leave that space in the end. Because the match heads won't all ignite at the same time, this doesn't increase the rocket power as much as you'd think."
    },
    {
      "title": "Crimp the end of the foil tube.",
      "content": "Crimp the end of the foil tube. Crimp the end next to the match head closed with a pair of pliers. Repeat this from several angles, until the tube is as tightly closed as possible. If there are any holes in this end, smoke will escape and the rocket will not fly nearly as far. [4] X Research source For extra insurance, fold this end over itself, as though it were a tube of toothpaste. Fold a tiny piece of foil and wrap it around this to stop it unrolling."
    },
    {
      "title": "Wrap the other end around a paper clip.",
      "content": "Wrap the other end around a paper clip. Push the paper clip into the end of the tube that still has a hole. Wrap the foil around this object, narrowing the tube. [5] X Research source A narrower opening means more pressure, which will shoot the rocket farther. You can leave the paper clip in there for now. Use a metal paper clip, not one with a plastic coating. A standard sized paper clip should be fine. If you used a large number of match heads, you might need an over-sized clip to support the rocket."
    },
    {
      "title": "Make fins (optional).",
      "content": "Make fins (optional). Fins add more than just style; their shape helps keep the rocket pointed in the direction of movement. This is the most aerodynamic position, reducing the slowing effect of the air. If you decide to make fins, here's an easy way to do it: [6] X Research source Cut a small square of heavy tape with an anti-stick backing. Aluminum foil tape works best. Fold it along the diagonal, then turn it over and crease the same fold the other way. Unfold and repeat along the second diagonal. Fold it along both folds and cut off the central corner. You should now have a square with a hole in it. Remove the anti-stick backing. Push the tape into an X shape and slide it onto the hollow end of the rocket. It should now have four fins."
    },
    {
      "title": "Make a stable stand.",
      "content": "Make a stable stand. A stable, relatively heavy stand that won't move much on launch will get you the farthest distance. Here's one easy way to make one if you don't need your matchbox anymore: [7] X Research source Empty your matchbox and fill one half with pebbles or other dense objects. Punch a hole in the lid of the matchbox, near one end Stick the paper clip currently in the rocket into this hole. Slide the lid until you get the desired launch angle. If the paper clip falls over, tape it onto the matchbox base or weight it down."
    },
    {
      "title": "Loosen the rocket around the paper clip.",
      "content": "Loosen the rocket around the paper clip. If the foil is wrapped too tightly around the paper clip, the rocket might cling and fail to launch. Rotate the rocket and wiggle it slightly until you're satisfied it's slightly loose. If this is very tight, the rocket could explode."
    },
    {
      "title": "Move to an outdoor location.",
      "content": "Move to an outdoor location. The smoking rocket tip will be hot enough to leave scorch marks on carpet and furniture. Find a concrete surface outdoors with at least 40 feet (12m) of space. Make sure to find an area to light the rocket away from the street and pedestrians. Keep the rocket pointed away from people, animals, or another person's property."
    },
    {
      "title": "Light the rocket tip.",
      "content": "Light the rocket tip. Stand to the side of the rocket and hold a torch or lighter to the tip of the rocket, where the match head is. Soon, smoke will shoot out the end with the paper clip, and the rocket will fly forward. Have fun! The rocket usually flies at least 20 ft (6m) if it is pointed at a 45º angle. It can occasionally fly up to 40 ft (12m). On a windy day, point the rocket in the direction the wind is blowing. Screen the flame from wind while lighting."
    },
    {
      "title": "Retrieve the smoldering rocket with gloves.",
      "content": "Retrieve the smoldering rocket with gloves. The rocket tip will keep smoldering for some time, and could cause a fire if it lands in brush. Always pick it up after launch, but wear gloves. It will be hot enough to burn skin."
    }
  ]
}