{
  "url": "https://www.wikihow.com/Keep-Birds-Off-the-Roof",
  "title": "How to Keep Birds Off the Roof",
  "steps": [
    {
      "title": "Place fake predators on your roof to scare birds off.",
      "content": "Place fake predators on your roof to scare birds off. Because birds have developed various senses to keep them safe from danger, you can scare small fowls away from your roof by using statues that mimic their natural predators. Look for the following decoys at garden or farming supply stores: [1] X Research source Owl decoys, great for pigeons, crows, seagulls, and sparrows. Raven decoys, great for magpies and other small birds. Falcon decoys, great for pigeons, turtle doves, and songbirds."
    },
    {
      "title": "Play sounds made by predator animals to keep birds away.",
      "content": "Play sounds made by predator animals to keep birds away. Similar to predator decoys, you can scare birds away from your roof by purchasing loud, sonic speaker systems that play pre-recorded predator noises and distress calls. Look for systems featuring sound effects specific to the bird you’re trying to get rid of. [2] X Research source"
    },
    {
      "title": "Blast ultrasonic frequencies for a silent deterrent.",
      "content": "Blast ultrasonic frequencies for a silent deterrent. If you don’t want to disturb your neighbors, try getting an ultrasonic repellent. These devices play high frequency sounds that annoy and disorient birds without affecting humans. These devices are designed specifically for birds and should not annoy dogs, cats, and other pets. [3] X Research source Look for sound-based bird repellents from pest control companies."
    },
    {
      "title": "Install electric pads over perching spots to teach birds not to land there.",
      "content": "Install electric pads over perching spots to teach birds not to land there. For birds that aren’t convinced by your decoys, try placing a strip of avian-specific, low-voltage electric diodes along the areas they normally sit. Even if they can perch in a spot a few feet over, the shocks will make the birds avoid the area altogether. [4] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source These strips are typically available from companies specializing in pest control. Though unpleasant, the shocks emitted by the electricity strips are not enough to harm the birds."
    },
    {
      "title": "Install bird spikes over popular perching spots.",
      "content": "Install bird spikes over popular perching spots. Bird spikes are strips of small, thin rods that jut up toward the sky. Generally made from plastic or steel, the spikes will not hurt the birds but will remove their perching spots. Birds spikes are particularly effective when protecting thin areas like gutters and ledges. [5] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Bird spikes are popular deterrents that you can often find at garden and home improvement stores."
    },
    {
      "title": "Put a bird spider on your roof to remove landing space.",
      "content": "Put a bird spider on your roof to remove landing space. Bird spiders, also known as 360 deterrents, are perch prevention devices made from a series of long, floppy rods connected to a central hub. The rods are incredibly thin and fan out over a wide area, making it impossible for birds to land. [6] X Research source Bird spiders are often used in boating, so look for them at marine storefronts in addition to pest control shops."
    },
    {
      "title": "Cover shingles and tiles with perch repellent gel.",
      "content": "Cover shingles and tiles with perch repellent gel. Available from pest control and home improvement stores, bird repellent gel is a non-noticeable deterrent that turns your roof into an uncomfortable perch. Applied similarly to hot glue, the gel makes your tiles or shingles feel sticky, causing any feathered friends to flee. [7] X Research source Expect to reapply the gel every 6 to 8 months. Check the gel’s warning label for information on whether it is dangerous to other animals."
    },
    {
      "title": "Lay a net over your roof to remove all perching spots.",
      "content": "Lay a net over your roof to remove all perching spots. If you’re dealing with an entire flock of birds, individual deterrents may not be good enough. Instead, purchase a long roll of bird netting from a garden or pest control store. When pulled over your entire roof, the netting will prevent birds from making a solid landing, keeping them away from the area. Each net you buy will come with different installation recommendations, so read the included instructions carefully. If you can’t afford to cover the whole roof, protect important areas like the top of your chimney."
    },
    {
      "title": "Clear out any nesting areas present around your roof.",
      "content": "Clear out any nesting areas present around your roof. Often, birds stay in a specific area because they’ve created a nest there. This may be a traditional nest, formed by a bird out of twigs, mud, and other objects, or a nesting area they visit for warmth and shelter. To get a bird to leave, you’ll need to find its nest and either remove it or block the area from reentry. Before removing a nest, check any local or national animal conservation laws. For example, in the US it is illegal to disturb a nest that has chicks or eggs in it."
    },
    {
      "title": "Remove intended and unintended food sources causing the birds to stay.",
      "content": "Remove intended and unintended food sources causing the birds to stay. In many cases, birds stay in a specific area because it gives them ample access to food. The source may be intentional, such as when people give pigeons leftover bread, or unintentional, like when you throw away crumbs outside or leave your garbage can open. Until you remove these sources of food, the fowls may refuse to leave."
    },
    {
      "title": "Spray nearby plants with methyl anthranilate to keep birds away.",
      "content": "Spray nearby plants with methyl anthranilate to keep birds away. Methyl anthranilate is an eco-friendly product that, when applied to plants, makes them taste and smell bad to birds. To use the product, purchase a solution from a pest control or garden supply store and, if necessary, pour it into a spritzing bottle. Then, spray it over your plants. [8] X Research source After the first application, you should see birds disappear from the area since a major source of food is now gone. Some brands of methyl anthranilate advertise themselves explicitly as goose repellent. Methyl anthranilate should not make food taste bad to humans."
    },
    {
      "title": "Trap birds that keep coming back.",
      "content": "Trap birds that keep coming back. If a bird returns in spite of your best deterrent efforts, try trapping and physically moving it to a forest or wildlife preserve. Before placing a trap, set out bread, berries, or similar food items for a few days in a row, conditioning the birds to take bait. Then, set your chosen food item in 1 of the following traps and wait for a bird to get captured: [9] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source A bob trap, in which a bird goes through a gate that closes behind it. A funnel trap, where a bird walks through a large opening that has spikes on the other end, preventing escape."
    }
  ]
}