{
  "url": "https://www.wikihow.com/Keep-Outdoor-Plants-Watered-when-You%27re-on-Vacation",
  "title": "How to Keep Outdoor Plants Watered when You're on Vacation",
  "steps": [
    {
      "title": "Give your plants a good feeding the month before your trip.",
      "content": "Give your plants a good feeding the month before your trip. Make sure your plants are very well fed during the month before you leave. This will ensure they are extra healthy and robust when it’s time for you to take your trip. You can find plant fertilizer at your local gardening supply store. [1] X Research source Use a granular fertilizer for your garden and a liquid fertilizer for potted plants. You can also use organic matter to fertilize your plants, like manure or compost ."
    },
    {
      "title": "Trim the foliage of your plants one week before leaving.",
      "content": "Trim the foliage of your plants one week before leaving. Well-trimmed plants will use less water when you are gone. First, remove any dead, dying, or diseased parts of the plant. Next, cut out older growth and trim the plant into a particular shape if you prefer. Do this about a week or so before you leave. [2] X Research source Be sure to trim only the very well-established plants in your garden."
    },
    {
      "title": "Add mulch to your plants to help them retain moisture.",
      "content": "Add mulch to your plants to help them retain moisture. Purchase organic mulch online or in a gardening store for best results. Apply the mulch to your garden by layering about 3 inches (7.6 cm) of mulch around the plants to help them retain more water while you are gone. Use this technique in conjunction with another watering method. [3] X Research source Don’t leave the mulch in your garden untouched for more than a couple of weeks or it will introduce rot. Adding mulch in this way is a temporary measure for when you are on vacation only. Make your own mulch by shredding leaves, twigs, and other organic matter from your yard. Don’t forget to mulch your potted plants, too. Simply add layers of heavily watered peat moss to the pot. A moist rag wrapped loosely around the base of your plant also works."
    },
    {
      "title": "Find a trustworthy plant sitter to ensure your plants will thrive.",
      "content": "Find a trustworthy plant sitter to ensure your plants will thrive. If you want to be certain your plants will survive your vacation unscathed, you can hire a professional plant sitter before you leave. You can also find a plant-savvy friend or neighbor. Consider offering to water their plants when they are on vacation in exchange. [4] X Research source Even a conscientious friend or neighbor who doesn’t have plant experience can help water your plants. Give them a full tour of the garden and show them what’s involved at least a week before you leave. It can help if you group plants with similar watering needs together. If you sitter is inexperienced, write down detailed instructions your plant sitter can refer to while you are gone You may want to monitor how much water each plant needs for a few weeks before you go. Then, leave specific watering instructions such as, “Give this plant 1 ⁄ 2 cup (120 ml) of water every Wednesday.”"
    },
    {
      "title": "Move portable plants to a cool area if you will be gone for a short time.",
      "content": "Move portable plants to a cool area if you will be gone for a short time. If you’ll only be gone a few days or a week, move your plants into a cool place away from the sun, such as a shady area of your deck or your garage. Place drip pans under the plants and water them extra well. Unless there is a heat wave while you are gone, they should be fine. [5] X Research source Insulate the plants even more by double potting them. Place each pot into a larger pot, then fill the space between them with soil or fine mulch."
    },
    {
      "title": "Make a mini-greenhouse to water a small group of plants long term.",
      "content": "Make a mini-greenhouse to water a small group of plants long term. Buy a ready-to-use terrarium for your plants, or make your own. To do this, place a clear plastic bag in a cool area out of direct sunlight. Lay a moist towel along the bottom of the bag. Place as many potted plants inside as you can fit. Then, pull the sides of the bags up and over the top of the plants. Blow some air into the bag so it puffs up. Finally, twist the top of the bag shut and secure it with a rubber band. [6] X Research source Because the plants will release water and the excess will drip back down to feed their roots, your plants can live happily in their greenhouse for months. Remember to keep your mini-greenhouse out of direct sunlight or it will heat up your plants too much and could kill them."
    },
    {
      "title": "Rig a short-term self-watering system with a plastic bottle.",
      "content": "Rig a short-term self-watering system with a plastic bottle. Cut off the bottom of a 2-liter (½ gallon) plastic bottle. Remove the lid. Secure a small piece of gauze around the opening with a rubber band. Insert the neck of the bottle into the soil next to your plant. Fill the bottle with water the day before you leave and top it up once again on your way out. [7] X Research source The plant will take in water from the bottle as needed while you’re away. Depending on how much water the plant consumes, you can use this method for up to 1 week. For smaller pots, use smaller plastic bottles or cough syrup bottles."
    },
    {
      "title": "Use watering bulbs for a self-watering solution that’s decorative.",
      "content": "Use watering bulbs for a self-watering solution that’s decorative. Watering bulbs are small watering systems made from glass or plastic that you can fill with water and stick into the soil next to your plant. The water flows down from the bulb when the soil becomes dry. They are not only quite effective, but they also come in lots of different colors and shapes, so you can use them as permanent decoration in your garden. [8] X Research source You can find watering bulbs at your local gardening store or online. They can provide water to small plants for up to 2 weeks. To prevent the watering bulb from getting clogged with dirt, secure some cheesecloth on the tip with a small rubber band before you insert it into the soil. [9] X Research source"
    },
    {
      "title": "Use a bathtub for a simple yet effective solution.",
      "content": "Use a bathtub for a simple yet effective solution. Place pots with holes in the bottom in a long, shallow container filled with about 3–4 inches (7.6–10.2 cm) of water. You can use a large basin or other container, or move your plants into your bathtub. [10] X Research source Be sure that your container is in a cool, dry place away from direct sunlight. Standing water can attract various insects. If you will be gone for more than a week, spray the container with a plant-friendly mold and bug deterrent. Make your own by mixing 1 tablespoon (15 ml) of 3% hydrogen peroxide with 1 cup (240 ml) of water and 3 drops of dish soap. Spray the mixture on the container filled with water before you add your plants."
    },
    {
      "title": "Put your sprinkler on a timer for a simple solution.",
      "content": "Put your sprinkler on a timer for a simple solution. If you have a sprinkler system in your yard, buy a timer and set it to water your plants on a fixed schedule while you are away. To find the right schedule, first monitor exactly how much water you give each area of your garden in one week. Then, place small cans in different parts of your garden and run the sprinklers for 10 minutes. Measure how much water was collected in each can. The individual sprinkler heads can be programmed on different schedules to accommodate the different watering needs of your plants. [11] X Research source If your sprinkler system does not have a rain sensor, you may want to entrust a friend or neighbor to manually turn off the sprinkler system in case it rains while you are away. Otherwise, the sprinkler will still run when it’s raining and will overwater your plants."
    },
    {
      "title": "Set up a wicking system that can serve several plants at once.",
      "content": "Set up a wicking system that can serve several plants at once. Gather an absorbent wicking material (thick yarn, natural fiber rope, or strips of a cotton T-shirt) and a container to hold water. Place 1 end of your wicking material in the water, making sure it reaches all the way to the bottom of the container. Put the other end about 3 inches (7.6 cm) into the plant’s soil. When the soil gets dry, the water will travel up the wicking material to replenish the moisture. [12] X Research source Large bottles, bowls, or pails work well as containers. Insert 1 wick into every plant. You can use the same container of water for several nearby plants. Be sure your wicking system is working before you leave. Sometimes the wicks don’t work effectively and you’ll have to switch them out for new ones. Put the wicking system together and test it for at least a week before you leave. If you are having trouble getting the water to wick properly, try positioning the container of water higher than the plant and use a shorter wick. [13] X Research source Some plants, such as cactus or succulents, grow best when their soil dries out completely between waterings. Watering these plants with a wicking system is not recommended. [14] X Research source"
    },
    {
      "title": "Invest in a permanent, professional wicking system with self-watering pots.",
      "content": "Invest in a permanent, professional wicking system with self-watering pots. Self-watering pots use a wicking system inside the pot. All you need to do is fill the reservoir at the bottom of the pot with water, and the wick inside will provide water to the plant when the soil becomes dry. Test out the self-watering pots about a month before your trip so you know how long a full reservoir will last. [15] X Research source Find self-watering pots in your local gardening store or online. Some self-watering pots also have an indicator that shows how much water is left in the reservoir so you know when you need to fill it up. [16] X Research source Self watering containers aren’t a good idea to use for plants that need to dry out between waterings, like cactus or succulents."
    },
    {
      "title": "Install an automatic drip irrigation system for large outdoor gardens.",
      "content": "Install an automatic drip irrigation system for large outdoor gardens. If you have many outdoor containers or an extensive outdoor garden, it may be worth it to install an automatic drip irrigation system. A drip irrigation system uses tubes lying on the ground to supply water. It is easy to install and operates on an automated timer to water your plants at the right time intervals. You can easily customize it to fit your garden’s layout or individual plant needs. [17] X Research source Use a rain gauge with your drip irrigation system when you leave for vacation. That way, if it rains your irrigation system won’t overwater your plants while you’re gone. [18] X Research source"
    }
  ]
}