{
  "url": "https://www.wikihow.com/Hide-Gynecomastia-at-the-Beach",
  "title": "How to Hide Gynecomastia at the Beach",
  "steps": [
    {
      "title": "Invest in a compression shirt or vest designed for gynecomastia.",
      "content": "Invest in a compression shirt or vest designed for gynecomastia. Go for a sleeveless compression vest with a low neckline, which wouldn't be noticeable under a button-up or swim shirt. You can find compression apparel designed for gynecomastia online and at medical supply stores. [1] X Research source If you have trouble finding a garment labeled for gynecomastia, go with a surgical compression vest, which people wear after chest operations to help incision sites heal. If you plan on swimming, check your product’s label to make sure it can get wet. Most compression garments can be worn in saltwater. However, chlorine can damage elastic fabric, so don’t wear a compression vest in a chlorinated pool."
    },
    {
      "title": "Conceal your chest with men's shapewear or performance apparel.",
      "content": "Conceal your chest with men's shapewear or performance apparel. Men’s shapewear and performance sportswear can also do the trick, even if they’re not specifically designed for gynecomastia. While they’re more expensive, some performance vests have cooling strips, which can help make wearing layers more comfortable. [2] X Research source Find shapewear and performance apparel online, at athletic supply stores, or in the menswear section of most major department stores. Like compression garments, shapewear and performance apparel are usually made of materials that shouldn't be exposed to chlorinated water."
    },
    {
      "title": "Wear a swim shirt or rash guard.",
      "content": "Wear a swim shirt or rash guard. A rash guard is a tight-fitting top worn by surfers and other water sports aficionados, and a swim shirt is a less fitted version. They’re on-trend, so you might feel less out of place if you wear one. [3] X Research source Many fashion brands manufacture swim shirts, and rash guards are available at any store that sells sportswear. You can also find either garment online. If a swim shirt alone doesn't conceal your chest, you could a wear one over a compression or performance vest. Remember that a garment with cooling strips can help keep you from getting too hot."
    },
    {
      "title": "Cover up with a slimming striped or patterned button-up shirt in bright colors.",
      "content": "Cover up with a slimming striped or patterned button-up shirt in bright colors. [4] X Expert Source Spencer Shimada Image Consultant Expert Interview. 22 October 2021. You could try wearing a compression vest under a button-up, but you wouldn’t be able to go in the water. For a beachy look, go with a vertical striped, checkered, or tropical print button-up shirt. Avoid white, and go for colors that won’t contrast sharply with your swim trunks. [5] X Research source White can make your upper body look broader, and a sharp contrast between your shirt and trunks will draw attention to your upper body. Vertical stripes and patterns are slimming and can draw the eye away from body shape. A button-up offers more structure than a tee, so it’s less likely to cling to your chest. [6] X Research source If anyone asks, you could say that you’re wearing a shirt to protect your skin from the sun."
    },
    {
      "title": "Consult your doctor for an accurate diagnosis.",
      "content": "Consult your doctor for an accurate diagnosis. Gynecomastia involves the enlargement of the breast glands, and working out doesn’t reduce the glands' size. On the other hand, pseudogynecomastia is due to fat deposits in the chest, so dietary changes and exercise are management options. [7] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source If you haven’t already, see your doctor to determine if your chest size is due to gland enlargement. Try not to be embarrassed; your doctor is there to help you, not to judge you."
    },
    {
      "title": "Discuss potential underlying causes with your doctor.",
      "content": "Discuss potential underlying causes with your doctor. Medications, recreational drugs, and anabolic steroids can all cause gynecomastia. Thyroid issues, hormone imbalances, and other medical conditions are also potential underlying causes. If necessary, work with your doctor to identify and manage any underlying medical issues. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Prescription drugs that can cause gynecomastia include corticosteroids, hormone cancer therapies, and some heart and anti-anxiety medications. If necessary, ask your doctor if they can recommend an alternative with fewer side effects. If you use recreational drugs or anabolic steroids, ask your doctor for advice about quitting ."
    },
    {
      "title": "Try to lose weight if you have pseudogynecomastia.",
      "content": "Try to lose weight if you have pseudogynecomastia. If your issue isn’t related to enlarged glands, do your best to eat less fatty foods and cut your calorie intake. Try to get 30 minutes of moderately intense aerobic exercise per day, and do strength-training exercises that target the chest, such as push-ups and bench presses. Talk to your doctor before starting a new exercise routine, especially if you have a history of medical issues."
    },
    {
      "title": "Talk to your doctor about surgical options.",
      "content": "Talk to your doctor about surgical options. The only way to reduce chest size due to enlarged mammary glands is breast reduction surgery. Depending on the scope of surgery, it can cost several thousand dollars (USD) and, typically, is not covered by insurance. [9] X Research source If you decide that breast reduction surgery is right for you, your doctor or surgeon can recommend the best procedure. Be sure to ask them about the potential risks and complications of any surgical procedure. Liposuction is fairly non-invasive, and recovery time is usually just a few days. However, it only removes fatty tissue, not the mammary glands. A mammectomy, or removal of mammary gland tissue, is the best option for larger chest sizes. Your chest will be sore and swollen for a few weeks after a mammectomy, and you’ll need to limit your activities for at least a month. While scars from the procedure are permanent, they usually fade over time."
    },
    {
      "title": "Remind yourself that everyone has insecurities.",
      "content": "Remind yourself that everyone has insecurities. There’s really no such thing as a “normal” body, and everyone is self-conscious about some aspect of their body. Plenty of people get anxious about swimsuit season, so don’t feel like everyone is seeking to judge you. The effects of gynecomastia on self-esteem aren’t easy to overcome, and it’s normal to feel like you’ll never be able to go shirtless in public. [10] X Research source As difficult as it is, do your best to accept your body, and try not to let other people’s perceptions define you. If you don’t want to go shirtless, focus on wearing a swim shirt or other concealing garment at the beach without worrying what people think."
    },
    {
      "title": "Focus on your body’s function and everything it does for you.",
      "content": "Focus on your body’s function and everything it does for you. For some people, cultivating an appreciation for their body helps them overcome fear, anxiety, and embarrassment. Instead of hating your body or focusing on things you don’t like, look for positive aspects. Think about the incredible things your body does, from basic things like processing oxygen to allowing you to vividly sense the world. [11] X Research source Try listening to music, looking at beautiful natural scenery, or smelling your favorite scent. Think about how wonderful it is that your body allows you to experience such enjoyable sensations. Pay attention to the things your body does to keep you alive. Listen to your heartbeat, and appreciate how hard your heart works every second of the day. Think about how great it is that so many parts of your body do their job automatically without your conscious thought. Try saying or thinking a positive mantra, such as, “I’m happy to be alive. My body is wonderful for keeping me alive, and I'm grateful for it.”"
    },
    {
      "title": "Remind yourself that you deserve a fun, relaxing beach day.",
      "content": "Remind yourself that you deserve a fun, relaxing beach day. When you’re at the beach, pay attention to the sound of the ocean, the refreshing breeze, and how nice the sun feels. Give yourself permission to enjoy the moment without fear of judgment. If you’re comfortable, try taking off your shirt, and let the sensations of the warm sun or soothing water replace your fear and anxiety. Tell yourself, “There are so many great things I’ll miss out on if I dwell on what other people think. I deserve to feel comfortable and to enjoy this day, and it doesn’t matter if my body isn’t perfect. I refuse to punish myself anymore.”"
    },
    {
      "title": "Try going shirtless around family and close friends first.",
      "content": "Try going shirtless around family and close friends first. If you’re not ready to take your shirt off on a public beach, doing so around trusted loved ones might be a good place to start. If your family or trusted friends have a small pool party, try going swimming without your shirt. [12] X Research source If you don’t plan on ever taking off your shirt in public, try wearing a swim shirt around your family first to get used to it."
    }
  ]
}