{
  "url": "https://www.wikihow.com/Hair-Theory",
  "title": "What is Hair Theory? A Guide to the Viral TikTok Concept",
  "steps": [
    {
      "title": "Hair theory suggests that your hairstyle changes how you’re perceived.",
      "content": "Hair theory suggests that your hairstyle changes how you’re perceived. The theory came from a viral 2023 TikTok video in which user @lipsandlattes (real name Nicole Smith) explained the importance of keeping up with hair trends. She compared side-by-side pictures of celebrities in their 50s like Cindy Crawford and Jennifer Aniston: first with their actual trendy hairstyles, and then edited to have dated hairstyles which she claimed aged them. In her caption, Smith stated that the takeaway from hair theory is that you can look 10 years younger by staying on top of hair trends, while outdated hairstyles make you look older."
    },
    {
      "title": "TikTokers test the theory by showing themselves with different hairstyles.",
      "content": "TikTokers test the theory by showing themselves with different hairstyles. The videos feature short (one-second) clips of the TikToker looking into the camera with a new hairstyle. The person is in the same place, with the same expression and makeup, in each clip—only their hair changes. In these videos , they ask viewers to comment if hair theory works—that is, if they perceive the person differently with each style. Common hairstyles in these TikToks include wearing hair over the shoulders and behind the head, doing a middle versus a right or left side part, doing a half-up and half-down look, wearing a ponytail, and tying hair in a bun. In some videos, TikTokers will show pictures and clips of different hair colors and styles they’ve had over the years. In others, the poster simply moves their hair around with their hands to show several styles in quick succession. These TikToks usually include lip-syncing to the audio, “One for the money, two for the show,” sung in different voices to go with different hairstyles."
    },
    {
      "title": "Some hair theory TikToks focus on other perceptions in addition to aging.",
      "content": "Some hair theory TikToks focus on other perceptions in addition to aging. While it’s obvious that different hairstyles change how you look, people expanded on Smith’s video to consider how hairstyles change how people think of and treat you. For example, sleek updos are associated with being professional and put-together, while messy beach waves could make people perceive you as free-spirited or lazy. [1] X Research source TikTok users shared anecdotes in Smith’s comments and on other hair theory videos claiming that they’re treated differently when they straighten their hair, dye it a certain color, or wear hair extensions. They may receive more attention or be told they’re more attractive or professional."
    },
    {
      "title": "Hair theory has also been tied to the concept of enclothed cognition.",
      "content": "Hair theory has also been tied to the concept of enclothed cognition. TikTok user @burcibasi made a now-deleted viral video connecting hair theory to the psychological phenomenon of enclothed cognition. The TikTok led to the misconception that enclothed cognition is when others’ behavior changes towards you because of your clothes—but it’s actually about how the wearer’s psychological processes change based on their clothes. [2] X Research source In the study that introduced the term “enclothed cognition,” researchers found that participants were more attentive during a task when wearing lab coats which they symbolically associated with doctors, versus participants who did not wear a lab coat or associated it with artists. [3] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "TikTok’s hair theory has a psychological basis for being a real phenomenon.",
      "content": "TikTok’s hair theory has a psychological basis for being a real phenomenon. Studies show you may use your hairstyle to try to control how you appear to other people—including how old you look. One study found that older women spend more on their hair as they age because they feel they must control their hair to avoid being stereotyped or negatively perceived. [4] X Research source Research also suggests that women maintain the hairstyle and grooming rituals of their 20s and 30s later in life. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This supports Smith’s theory that hairstyles can age you, because we may associate outdated hairstyles with the decades when they were first popular."
    },
    {
      "title": "Experiment with new hairstyles to update your look.",
      "content": "Experiment with new hairstyles to update your look. Changing up a hairstyle that’s associated with a specific age group or time period (like “The Rachel” or the Millennial side part) may make you look younger . However, blindly following trends might leave you with a hairstyle that doesn’t match your personality or complement your features. Experiment with hairstyles that are timeless or trends that you feel personally drawn to instead. Timeless hairstyles include a chin-length bob, straight hair with a middle part, and long layers with wispy bangs. [6] X Research source"
    },
    {
      "title": "Wear different hairstyles to see if they change how people treat you.",
      "content": "Wear different hairstyles to see if they change how people treat you. This can be hard to measure, since there are many factors that influence how others perceive and behave toward you—their relationship to you, the setting, your clothing, your confidence, and more. Still, if you pay attention, you may notice you get approached more when you wear your hair down, or that people are more polite to you when your hair is a certain style."
    },
    {
      "title": "Choose a hairstyle that makes you feel good.",
      "content": "Choose a hairstyle that makes you feel good. At the end of the day, how others perceive you shouldn’t determine how you choose to look. A hairstyle that makes you feel confident and attractive is always the right choice—no matter what hair theory dictates. Use your hairstyles for self-expression (and practicality, when needed). [7] X Research source"
    },
    {
      "title": "Server hair theory or pigtail theory",
      "content": "Server hair theory or pigtail theory In a viral TikTok posted in April 2024, a server named Autumn shared a video to test if different hairstyles would get her more tips from customers. She found that wearing pigtails got her the most tips, captioning the video with the hashtag “pigtailtheory.” Viewers speculated that men would tip her more when she wore pigtails because it was a girly, youthful style. Some commenters thought there wasn’t enough evidence in her video to validate pigtail theory, while other servers agreed with the theory based on their own anecdotal experiences. [8] X Research source"
    },
    {
      "title": "Half-up, half-down hair theory",
      "content": "Half-up, half-down hair theory Hair theory led to a similar theory about the half-up, half-down hairstyle. Female TikTokers made videos claiming that men (particularly boyfriends or spouses) do not like when women wear half-up, half-down hairstyles. Many TikTokers attempted to debunk this theory by asking their partners what they thought of their hair while wearing a half-updo—in these videos , most of the partners either liked it or were indifferent."
    },
    {
      "title": "Black, brunette, and blonde hair theory",
      "content": "Black, brunette, and blonde hair theory In several viral videos posted to TikTok, women shared the theory that women with black or brunette hair are seen as intimidating and serious, while women with blonde hair are seen as innocent, youthful, and childish—especially by men. The claim that blonde women are more approachable to men has been supported in some psychological studies. One study of British men found that they were more likely to approach a woman when she was blonde than when she was brunette or red-haired. [9] X Research source Another study found that women wearing blond wigs at a nightclub were more frequently approached by men than when wearing brown, black, or red-colored wigs. [10] X Research source In the same study, men wearing blonde wigs who asked women to dance at the nightclub did not receive more acceptance from women than men wearing other colored wigs."
    },
    {
      "title": "Red hair theory",
      "content": "Red hair theory Responding to black hair theory, user @meowwitsmee claimed in a TikTok that she received more attention from men and women when she had bright red hair than when she had black hair. She claims it was because of the aura she was giving off, and believes people perceive her differently even with different shades of red hair."
    },
    {
      "title": "Hollywood hair theory",
      "content": "Hollywood hair theory The Hollywood hair theory is based on the idea that many celebrities have a distinctive hairstyle—for example, Billie Eilish’s green hair or Sabrina Carpenter’s curtain bangs. It states you need a distinctive hairstyle to become famous. [11] X Research source The theory took off on TikTok when people claimed that Chappell Roan was a case study. Roan adopted distinctive, curly red hair and became famous soon after, though she’d been trying to make it as an artist for years before changing her hair."
    }
  ]
}