{
  "url": "https://www.wikihow.com/House-Train-Corgi-Puppies",
  "title": "How to House Train Corgi Puppies",
  "steps": [
    {
      "title": "Keep your corgi in sight at all times for the first couple weeks.",
      "content": "Keep your corgi in sight at all times for the first couple weeks. You need to make sure your dog is comfortable with you, and you need to know when it needs to go to the bathroom. Keeping it nearby allows you to react to a mess and train your Corgi more quickly. If you must leave your corgi, put it in a room that is easy to clean, such as one with a tile or linoleum floor."
    },
    {
      "title": "Create a schedule for food.",
      "content": "Create a schedule for food. Schedules are very important for a puppy. It teaches it when to expect a meal, and when to expect time outside. In the beginning, do not \"free feed\" your puppy by leaving food out all the time. Provide food at scheduled times. [1] X Research source Veterinarians typically recommend two meals a day."
    },
    {
      "title": "Note when your corgi needs to use the bathroom.",
      "content": "Note when your corgi needs to use the bathroom. Usually, corgis need to use the bathroom after eating or drinking, after playing, and after napping. [2] X Expert Source David Levin Professional Dog Walker & Trainer Expert Interview. 19 December 2019. Watch your corgi carefully and check for signs that it needs to use the bathroom, such as: [3] X Research source Pacing in circles ”Searching” for something Whining Running back and forth between you and the door"
    },
    {
      "title": "Take your dog out 5-10 minutes before their usual bathroom time.",
      "content": "Take your dog out 5-10 minutes before their usual bathroom time. Once you can predict when your dog needs to go, try and bring it outside before it happens. Once outside, wait 10-15 minutes for it to go to the bathroom. Younger corgis have smaller bladders and less control, so take them out frequently, even if you don’t think they need to go."
    },
    {
      "title": "Reward your corgi every time it goes to the bathroom outside.",
      "content": "Reward your corgi every time it goes to the bathroom outside. [4] X Expert Source David Levin Professional Dog Walker & Trainer Expert Interview. 19 December 2019. Give it a treat, shower it with praise and petting, and let it play with a toy. You want your dog to associate going outside to pee with positive experiences and reinforcement. [5] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Never punish a corgi for going inside.",
      "content": "Never punish a corgi for going inside. Dogs, especially puppies, do not often have the ability to associate punishment with their own actions. [6] X Expert Source David Levin Professional Dog Walker & Trainer Expert Interview. 19 December 2019. For the dog, going to the bathroom is natural, but the punishment will make it fearful and nervous. More often than not, the dog will resort to hiding its mess, not taking it outside. [7] X Research source"
    },
    {
      "title": "Continue taking your corgi outside and rewarding it until it learns.",
      "content": "Continue taking your corgi outside and rewarding it until it learns. This usually takes between two weeks and a month. Through positive reinforcement, care, and attention, your intelligent corgi can be house trained quickly."
    },
    {
      "title": "Clean up accidents immediately with a solution of white vinegar and baking soda.",
      "content": "Clean up accidents immediately with a solution of white vinegar and baking soda. Mix the two into a paste and let it sit atop the area for five minutes, then wipe away. This will get rid of any odors and hopefully prevent your puppy from repeating the same mistake in that spot. [8] X Expert Source David Levin Professional Dog Walker & Trainer Expert Interview. 19 December 2019."
    },
    {
      "title": "Put your corgi in a comfortable crate when you cannot be with it.",
      "content": "Put your corgi in a comfortable crate when you cannot be with it. Unless the puppy came from a pet store, it will rarely urinate where it sleeps. Getting your corgi accustomed to the crate is the best way to care for your corgi when you can’t be with it. Do not leave young corgis in a crate for more than two hours."
    },
    {
      "title": "Choose a crate big enough for the corgi to stretch and turn around, but no bigger.",
      "content": "Choose a crate big enough for the corgi to stretch and turn around, but no bigger. If the crate is too large, a puppy might go the bathroom at one end and sleep in the other. This is not only a pain to clean, but unsanitary for the dog. [9] X Research source If you want a big crate for the dog to grow into, buy a divider to limit the space it can use when it is small."
    },
    {
      "title": "Put a comfortable, easily washed pad at the bottom of the crate.",
      "content": "Put a comfortable, easily washed pad at the bottom of the crate. To keep your corgi comfortable, fold a thick blanket or purchase a dog pillow for the bottom of your crate. Use one you can clean in the washing machine following an accident. [10] X Research source"
    },
    {
      "title": "Wait before letting a whining corgi out of its crate.",
      "content": "Wait before letting a whining corgi out of its crate. This may be difficult to do if the dog is complaining, but it takes some time for a corgi to get used to its crate. Give your dog time – if you remove it when it whines, you will have a hard time coaxing it back in. In time, your dog will become accustomed to its new home."
    },
    {
      "title": "Reward your dog for getting into its crate.",
      "content": "Reward your dog for getting into its crate. Provide positive reinforcement to your dog, so it associates its crate with comfort and love."
    },
    {
      "title": "Take the dog outside immediately when you arrive home.",
      "content": "Take the dog outside immediately when you arrive home. Cooped up, your corgi has likely been holding back from peeing or pooping since you put it in the crate. Take you dog out for a walk so it gets fresh air and the chance to relieve itself. [11] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    }
  ]
}