{
  "url": "https://www.wikihow.com/Have-More-Than-Eight-Family-Members-in-Sims-2",
  "title": "How to Have More Than Eight Family Members in Sims 2",
  "steps": [
    {
      "title": "Download a mod that allows more than eight Sims per lot.",
      "content": "Download a mod that allows more than eight Sims per lot. There are two popular mods that allow this, so pick the one you prefer. 5th LMNt's and Numenor's Larger Households CJ's Bigger Families"
    },
    {
      "title": "Place the mod into your Sims 2 Downloads folder.",
      "content": "Place the mod into your Sims 2 Downloads folder. On Windows, this is under Documents > EA Games > The Sims 2 > Downloads . If you're playing the Super Collection on a Mac, the filepath is Library > Containers > com.aspyr.sims2.appstore > Data > Library > Application Support > Aspyr > The Sims 2 > Downloads . It's a good idea to create a subfolder in your Downloads folder and name it \"Mods\" or \"Hacks\", since it keeps it separate from any other custom content you may have."
    },
    {
      "title": "Edit your userstartup file, if you plan to merge preexisting households.",
      "content": "Edit your userstartup file, if you plan to merge preexisting households. If you want to combine existing households, you'll need to take another step before you start your game. Open Documents > EA Games > The Sims 2 > Config . (For the Super Collection, go to Library > Containers > com.aspyr.sims2.appstore > Data > Library > Application Support > Aspyr > The Sims 2 > Config . Look for a file called userstartup.cheat and open it in Notepad or TextEdit. If you don't have one, create a new file in Notepad or TextEdit. Add the line uintprop maxTotalSims 50 . Add the line uintprop maxTotalHumans 35 . Add the line uintprop maxTotalPets 15 . Save your userstartup.cheat file. (Make sure there's no file extension tacked on at the end.)"
    },
    {
      "title": "Start the game.",
      "content": "Start the game. Allow the game to load."
    },
    {
      "title": "Enable custom content.",
      "content": "Enable custom content. A popup will come up warning you that you have mods in your game; near the bottom of the popup, check the box for \"Enable custom content\". You need to restart your game for the changes to take effect."
    },
    {
      "title": "Enter a household.",
      "content": "Enter a household. You should now be able to add more Sims to the household, even if there are already eight Sims living there. You may need to move the family out and back into their house for the changes to take effect."
    },
    {
      "title": "Enter a household.",
      "content": "Enter a household. It doesn't matter which neighborhood it's in or how many Sims already live on the lot."
    },
    {
      "title": "Press Ctrl+⇧ Shift+C.",
      "content": "Press Ctrl + ⇧ Shift + C ."
    },
    {
      "title": "Enable testingcheats.",
      "content": "Enable testingcheats. Type in boolprop testingcheatsenabled true and hit ↵ Enter ."
    },
    {
      "title": "Shift-click a Sim on the lot.",
      "content": "Shift-click a Sim on the lot."
    },
    {
      "title": "Spawn the Tombstone of Life and Death.",
      "content": "Spawn the Tombstone of Life and Death. Click Spawn... , then Tombstone of L and D . A tombstone should appear near your Sim."
    },
    {
      "title": "Click on the tombstone.",
      "content": "Click on the tombstone. Select any of the New _____ options (for example, New Adult Male ). Continue generating Sims like this until you've passed the eight-Sim household limit. These Sims will be randomly generated, with random names, appearances, and personalities. They will not be related to each other."
    }
  ]
}