{
  "url": "https://www.wikihow.com/Get-to-the-Elite-Four-in-Pok%C3%A9mon-FireRed-and-LeafGreen",
  "title": "How to Get to the Elite Four in Pokémon FireRed and LeafGreen",
  "steps": [
    {
      "title": "",
      "content": "Fly to Viridian City and travel west—along the way, prepare to fight your rival one last time. Once you’ve defeated him, continue going left (west) along Route 22 until you find a large building at the end of the path. Enter this building to embark on Route 23, a long path with a variety of different terrains. Continue along this new path; along the way, you’ll pass various checkpoints where officers ensure you have the necessary badges to reach Victory Road and beyond. Once you’ve cleared all these checkpoints, spot the cave entrance to Victory Road. Route 23 starts in a building, continues on a grassy path, switches to water, and then switches back to a grassy path. You’ll need a Pokémon that knows Surf to navigate the water-covered part of the road. Pro tip: As a cave/tunnel, Victory Road is full of wild Pokémon that will randomly spawn, like Onix, Machop, Geodude, Zubat, Arbok (FireRed only), Sandslash (LeafGreen only), Golbat, Machoke, and Marowak. Use Repels throughout your Victory Road journey to prevent unnecessary battles that’ll slow down your progress. [1] X Research source"
    },
    {
      "title": "",
      "content": "Head to the boulder that’s close to the Victory Road entrance. Using a Pokémon that knows Strength, push it to the right (east) until it covers the circular white switch on the far right side of the cave. Cool Trainer Naomi and Rolando are found on this floor, but they can be avoided with some careful maneuvering. Expect to fight a Persian, Ponyta, Rapidash, Vulpix, and Ninetales if you square off against Naomi, and a Raticate, Ivysaur, Wartortle, Charmeleon, and Charizard if you fight Rolando. [2] X Research source"
    },
    {
      "title": "",
      "content": "Once you’ve ascended the ladder that’s right next to Rolando, walk down (south) until you find another boulder. Using Strength, push this boulder onto the circular white switch nearby."
    },
    {
      "title": "",
      "content": "Turn around and walk up the stairs (north) to reach a higher platform. Walk to the right (east) until you run into Black Belt Daisuke. True to his name, his Pokémon team consists of the Fighting-type Pokémon Machoke, Machop, and a second Machoke. Defeat him and continue walking to the right."
    },
    {
      "title": "",
      "content": "Take the staircase down from the platform to the floor and avoid triggering a battle with a trainer on the right side of the platform. Head to the right (east), working your way around the platform until you’re heading up (north). Ascend the first ladder you spot in this area that’s immediately next to the trainer who’s wandering in circles. [3] X Research source Tamer Vincent is the trainer who’s moving around in circles. If you end up running into him, prepare to fight his Persian and Golduck."
    },
    {
      "title": "",
      "content": "Use Strength to push the boulder up twice, to the left 22 times, down once, to the left 4 times, down 3 times, and to the right once—this allows the boulder to cover the switch in the northeast corner of the third floor. [4] X Research source"
    },
    {
      "title": "",
      "content": "Go back the way you came, taking the steps to ascend the platform. If you’re careful, it’s possible to avoid the trainer there. As you descend the steps from the platform to the floor, do a little more careful maneuvering to avoid the pair of trainers waiting. Keep walking to the right (east) until you reach a large boulder next to an opening on the floor. [5] X Research source"
    },
    {
      "title": "",
      "content": "Jumping down this hole takes you back to the 2F, directly next to the boulder. Now, push this same boulder to the left (west) towards an empty switch. This lifts the barrier guarding a ladder on the plateau above you."
    },
    {
      "title": "",
      "content": "Move to the right (east) and climb up the second platform staircase (immediately beneath the trainer). Turn to the right and climb up the ladder on the far right side of the platform. Move up (north) and to the left (west) so you’re directly behind the trainers. Then, ascend the ladder that’s there."
    },
    {
      "title": "",
      "content": "Quickly side-step to the right to avoid having to fight the double team of trainers. Then, go down the ladder behind them. [6] X Research source"
    },
    {
      "title": "",
      "content": "Continue heading right (east), and then go down (south) to go through the lit-up cave exit. Don’t worry about the person you pass—they’re a Move Tutor, not a trainer who’s lying in wait. The Move Tutor can teach one of your Pokémon Double Edge, a strong Normal-type move with 100% Accuracy. While this move is strong, it often leaves your Pokémon taking recoil damage. [7] X Research source"
    },
    {
      "title": "",
      "content": "After exiting the cave, continue up the grassy path until you reach a stone-covered section of the map that’s covered in Pokémon statues. Weave your way through this maze until you make it up the staircase behind. This takes you to the Indigo Plateau, where you’ll face off against the Elite 4 . Happy fighting!"
    }
  ]
}