{
  "url": "https://www.wikihow.com/Make-Dreads-Grow-Faster",
  "title": "How to Make Dreads Grow Faster",
  "steps": [
    {
      "title": "Get more vitamin A.",
      "content": "Get more vitamin A. Vitamin A can help make hair grow faster. If you're looking to grow out your dreads, find ways to add more vitamin A to your diet each day. [1] X Research source Liver, fish oils, milk, and eggs are good sources of vitamin A. [2] X Research source Vitamin A is found in fruits and vegetables such as leafy greens, sweet potatoes, cantaloupe, carrots, squash, apricot, and broccoli."
    },
    {
      "title": "Up your vitamin E intake.",
      "content": "Up your vitamin E intake. Vitamin E can also aid with hair growth. Try adding extra vitamin E to your diet and see if your dreads grow faster. [3] X Research source Nuts, seeds, and vegetable oils are the best sources of vitamin E. It is also found in leafy green vegetables and fortified cereals. [4] X Research source Sunflower seeds, almonds, hazelnuts, corn oil, peanut butter, and peanuts are good sources of vitamin E. Vitamin E is also found in spinach, kiwi, tomato, and mango."
    },
    {
      "title": "Add flaxseed oil to your diet.",
      "content": "Add flaxseed oil to your diet. A small amount of flaxseed oil can help your hair grow faster. Try picking up some flaxseed oil at a local grocery store and adding it to your diet. Try sprinkling ground flaxseed over various foods throughout the day. You can sprinkle it over fruits, vegetables, yogurts, and cereals. Try adding it to hummus and butters. [5] X Research source Look for things like breads, muffins, and other wheat items that are supplemented with flaxseed oil at your local supermarket."
    },
    {
      "title": "Increase your protein intake.",
      "content": "Increase your protein intake. Protein promotes hair health. If you want to grow out your dreads, look for protein-rich foods and incorporate them into your diet. Fish, whole grains, nuts, and beans are excellent sources of protein."
    },
    {
      "title": "Take a biotin supplement.",
      "content": "Take a biotin supplement. [6] X Expert Source Courtney Foster Licensed Cosmetologist Expert Interview. 9 December 2019. Biotin and other B vitamins help improve the overall look of both your hair and skin and can help stimulate new growth. Add more biotin to your diet by eating more nuts, eggs, and cauliflower, or take a biotin supplement once a day with one of your meals. [7] X Research source"
    },
    {
      "title": "Wash your hair once a week.",
      "content": "Wash your hair once a week. Many people believe dreads should not be washed. However, this is not true. Dreads need regular washing starting two weeks after being created. Do not wash your dreads every day, as this can adversely affect their growth, but make a point of washing them once a week. For the best results, look for shampoos specifically designed to wash dreads. Be sure to rinse thoroughly for 2-5 minutes to make sure there is no shampoo residue left in your dreads. Shampoo that is not properly washed out can cause flaking and drying."
    },
    {
      "title": "Care for your hair at night.",
      "content": "Care for your hair at night. Protecting your scalp at night can help your dreads grow faster. Wrap a scarf, blanket, or hair cap over your head at night. Silk caps work particularly well. Do this each night to keep your dreads safe and promote growth. [8] X Research source If shedding is an issue, wrapping your hair before bed can also help catch stray hairs."
    },
    {
      "title": "Massage your scalp.",
      "content": "Massage your scalp. Gently massaging your scalp once a day helps keep your hair healthy, prevent dead skin cells from building up, stimulate blood flow, and promote growth. This will also help you relax. Once a day, gently massage your scalp for about 5 minutes."
    },
    {
      "title": "Use castor oil or coconut oil in your hair.",
      "content": "Use castor oil or coconut oil in your hair. [9] X Expert Source Courtney Foster Licensed Cosmetologist Expert Interview. 9 December 2019. Once a week, before shampooing, mix castor oil and coconut oil together and apply the mixture to your hair. Let it sit in for about 30 minutes and then wash it out. This may result in your dreads growing faster in a couple of weeks."
    },
    {
      "title": "Talk to a hairdresser.",
      "content": "Talk to a hairdresser. If your hair isn't growing as fast as you want despite your efforts, see a hairdresser. Go over your hair care routine to see if you're doing anything wrong. A qualified hairdresser should be able to help you manage your dreads to keep them healthy and growing."
    },
    {
      "title": "Try a supplement.",
      "content": "Try a supplement. You can buy supplements online designed to help dreads grow faster. However, you should always talk to a doctor before trying any dietary supplement. They should only be used as a last resort when other means are not working. [10] X Research source"
    },
    {
      "title": "Get more sleep.",
      "content": "Get more sleep. Make sure you're getting enough sleep. Poor sleep habits can affect your health, including your rate of hair growth. Also, make sure you're using the right pillow. A silk pillow helps prevent hair from tangling and breaking."
    }
  ]
}