{
  "url": "https://www.wikihow.com/Install-an-Ethernet-Jack-in-a-Wall",
  "title": "How to Install an Ethernet Jack in a Wall",
  "steps": [
    {
      "title": "Choose a convenient location for your Ethernet jack.",
      "content": "Choose a convenient location for your Ethernet jack. Scan the room for an open spot down low on the wall, preferably near an electrical outlet. Use an electronic stud finder to determine the exact location of the stud closest to the outlet. You can either put your Ethernet jack on the opposite side of this stud or on either side of the next stud in the row. [1] X Research source Ideally, the location you select should be free from surrounding obstructions and provide a clear path to run your Ethernet cable later on. Most Internet installers recommend setting up a new network jack a few inches from an existing outlet to establish a sense of symmetry and limit the number of potentially-unattractive wiring fixtures on other parts of the wall."
    },
    {
      "title": "Mark the spot on the wall where you want to place the jack.",
      "content": "Mark the spot on the wall where you want to place the jack. Use a pencil to draw a small ‘X’ where the jack will go. Don’t obsess over the placement too much—you’ll be able to make any necessary adjustments when marking the exact location of the mounting bracket. Make your mark dark enough to be plainly visible so you won't have to hunt for it while you're doing other things."
    },
    {
      "title": "Place your mounting bracket over the marking and trace around the inside.",
      "content": "Place your mounting bracket over the marking and trace around the inside. Once you’ve got the bracket situated right where you want it, run the tip of your pencil along the inner edge of the wall plate mounting bracket for your network jack. When you’re done, you’ll have a rough outline that you can use as a template for cutting the hole for the wall plate. Line the wall mounting bracket up as evenly as you can with the nearby electrical outlet. If desired, use a bubble level to ensure that the top and bottom edges of your outline are perfectly parallel with the floor."
    },
    {
      "title": "Shut off the electricity to any electrical circuits in the immediate vicinity.",
      "content": "Shut off the electricity to any electrical circuits in the immediate vicinity. Head to the main circuit breaker panel or electrical control box for your building and flip the switch corresponding to the outlet you’ve chosen to install your network jack next to. Doing so will minimize your risk of electrical shock, as you’ll be working close by. [2] X Research source Individual circuits should be plainly labelled on your breaker panel. If you’re attempting to install an Ethernet jack somewhere other than your own home, you may need some assistance finding the right breaker. If for some reason your breakers aren’t labelled, or they’ve been labelled incorrectly by mistake, an electronic circuit breaker finder can help you figure out which breaker to flip."
    },
    {
      "title": "Cut around the outline you just drew using a utility knife.",
      "content": "Cut around the outline you just drew using a utility knife. Score the outline lightly to make sure your lines are neat and precise. Then, go back over each line multiple times, applying more pressure each time. After a few passes, the excess drywall will simply pop out and you’ll be left with a nice clean hole for your Ethernet jack’s wall plate. [3] X Research source You can also cut out the outline for your wall plate using a drywall saw, if you prefer. Be careful not to make the hole too big. If you cut it too small, you can always go back and enlarge it, but if it ends up being larger than the mounting bracket for the wall plate, you’ll be out of luck."
    },
    {
      "title": "Drill a hole in the floor or ceiling behind your jack outlet if necessary.",
      "content": "Drill a hole in the floor or ceiling behind your jack outlet if necessary. Depending on where your Internet equipment is located, you may need to run your Ethernet cable either up or down a level to its termination point. Fit a power drill with a 1 ⁄ 2 in (1.3 cm) drill bit and bore a hole directly above or below the outlet opening you just cut behind the wall. This will make it possible to route the cable from your networking hardware to the new jack. [4] X Research source In most cases, the hardware setup that provides wired access to the Internet will be found in the attic, basement, or crawl space beneath your home."
    },
    {
      "title": "Run your Ethernet cable from your networking hardware to the jack outlet.",
      "content": "Run your Ethernet cable from your networking hardware to the jack outlet. If you’ve drilled through the floor to reach your Internet equipment, feed the cable through the outlet opening and down into the lower level. If you’ve drilled up through the ceiling, it will make more sense to start at your networking center and guide the cable down a level to the location of the jack. In other words, always work from top to bottom. [5] X Research source Avoid running the cable too close to electrical lines, water pipes, or other fixtures hidden behind your walls or beneath your floor. If for some reason you have no choice but to cross an electrical line, do it perpendicularly at a single point to reduce potential electrical interference."
    },
    {
      "title": "Secure the mounting bracket for your wall plate in the wall.",
      "content": "Secure the mounting bracket for your wall plate in the wall. After threading the slack end of your Ethernet cable through the middle, insert the rectangular plastic bracket into the opening you cut out earlier. Fasten the bracket by drilling the included installation screws directly into the drywall through the molded holes at the top and bottom corners. [7] X Research source Avoid overtightening the installation screws, as this could cause visible cracks in the drywall around the finished wall plate."
    },
    {
      "title": "Cut the cable emerging from the outlet to a length of 6–12 inches (15–30 cm).",
      "content": "Cut the cable emerging from the outlet to a length of 6–12 inches (15–30 cm). Use a pair of wire cutters to snip off the excess cabling. Aim for a clean, 90-degree cut straight across the cable’s width, and be sure to leave around 1 ⁄ 2 –1 ft (15–30 cm) of cabling hanging out of the outlet to ensure a comfortable fit and prevent unnecessary pull. [8] X Research source If you cut the cable too short, the resulting tension could damage the internal wiring or cause the entire cable to pull loose of the jack over time."
    },
    {
      "title": "Strip the outer sheathing from the last 2 inches (5.1 cm) of cable.",
      "content": "Strip the outer sheathing from the last 2 inches (5.1 cm) of cable. Place the cable inside a wire stripper in the appropriate notch for its gauge size. [9] X Expert Source Ricardo Mitchell Electrician & Construction Professional, CN Coterie Expert Interview. 6 May 2020. Squeeze the handles of the tool to clamp the jaws down around the cable and cut through the sheathing, then slide off the loose sheathing while holding the cable steady. [10] X Research source You should be able to find the exact gauge of your Ethernet cable listed somewhere on the package. If you don’t have a cable stripper, you can also slice through the cable covering using a utility knife or pair of scissors. Just be careful not to sever or otherwise damage any of the wires themselves. [11] X Research source"
    },
    {
      "title": "Thread the exposed wires into the color-coded slots on the keystone connector.",
      "content": "Thread the exposed wires into the color-coded slots on the keystone connector. Most Ethernet cables contain 4 pairs of similarly colored wires. Untwist each pair to separate the individual wires, then fan them out to bring them closer to their respective slots. Align each wire with its corresponding slot and slip it down inside. [12] X Research source Keep in mind that you’ll need to do this for the end of the cable leading to your modem, as well. If you want to make things a lot easier on yourself, pick up a pre-connectorized Ethernet cable. This type of cable already comes fitted with the keystone connector ends designed to fit into your new jack, making it possible to simply plug-and-play. [13] X Research source"
    },
    {
      "title": "Force the wires down into their respective slots using a 110 punch-down tool.",
      "content": "Force the wires down into their respective slots using a 110 punch-down tool. Align the pointed end of the tool with the top of the first slot and push straight down. As you do, the forked prongs will seat the wire snugly at the bottom of the slot, which will in turn slice through sheathing to enable conductivity. Repeat this action for each of the 7 remaining wires. [15] X Research source Many newer punch-down tools also clip the excess wire at the edge of each slot automatically. If yours doesn’t, just grab your wire cutters and trim them as close to the connector as possible. It may help to use a punch-down puck to brace the keystone connector as you work. A punch-down puck is a type of stabilizer base that holds small connector heads in place during crimping."
    },
    {
      "title": "Plug the wired connector head into the backside of the wall plate.",
      "content": "Plug the wired connector head into the backside of the wall plate. If your keystone connector came with protective cover plates, snap them into place on the top or bottom of the connector head. Then, insert the connector into the wall plate on the side facing the interior of the wall. You’ll hear a click letting you know that the connection is secure. [16] X Research source Be sure to buy a cover designed specifically for a keystone connectors. Otherwise, your cable won’t fit. If you like, you can use a cable tester to confirm that your Ethernet cable and keystone connector are wired properly before moving on. That way, you won’t have to disassemble the outlet later on if you experience connectivity issues. [17] X Research source"
    },
    {
      "title": "Fasten the wall plate over the jack mounting bracket to complete installation.",
      "content": "Fasten the wall plate over the jack mounting bracket to complete installation. Slip the included installation screws into the holes at the top and bottom of the wall plate. Use a power drill or screwdriver to tighten them inside the corresponding holes in the mounting bracket. Give the wall plate a quick jostle to make sure it’s secure, then connect to your computer or router to get online. [18] X Research source Don’t forget to vacuum up any loose drywall or other debris that’s found its way onto the floor in front of the outlet."
    }
  ]
}