{
  "url": "https://www.wikihow.com/Grow-Chickpeas",
  "title": "How to Sow, Grow, Care for, and Harvest Chickpeas",
  "steps": [
    {
      "title": "Germinate the chickpea seeds 4 to 5 weeks before the last frost.",
      "content": "Germinate the chickpea seeds 4 to 5 weeks before the last frost. Soak dried kabuli or desi chickpeas or chickpea seeds in cold water for about 8 hours. Spread the seeds out evenly on a damp paper towel and wrap them up. Place the paper towel in a sealed plastic bag and leave it in a warm area indoors for around 3 days, checking periodically to ensure that they’re sprouting. [1] X Research source It’s best to germinate the seeds first and plant them in the garden when spring starts so they won’t be damaged by the cold and have plenty of time to grow pods. This method can give you a higher yield and ensure your plants are safe from frost. Germinating is recommended, but if you’d like to plant chickpeas directly in the ground, wait 1 to 2 weeks before your last expected frost to plant them. Cover them at night with a light mulch , an insulating grass , or a polycarbonate cloche . If you’d like delicious bean sprouts at home, germinate the chickpeas. Once they sprout, wash them, dry them with a paper towel, and enjoy!"
    },
    {
      "title": "Plant the seeds indoors about 4 weeks before the last frost.",
      "content": "Plant the seeds indoors about 4 weeks before the last frost. Plant the chickpea seeds in small biodegradable seedling pots about 1 to 2 in (2.4 to 5 cm) deep in the soil. Plant one seed in each individual pot. [2] X Research source Look up your area’s average last frost date by entering your zip code into this tool . Chickpea seedlings do not transplant well, so use paper or peat seedling pots that can be planted directly into the ground instead of using plastic or ceramic containers. Chickpeas have a long growing season and may take 90 to 100 days until they are ready to harvest. That's why it's important to plant them as early as possible."
    },
    {
      "title": "Give the seeds 6 hours of direct sunlight daily and water them weekly.",
      "content": "Give the seeds 6 hours of direct sunlight daily and water them weekly. Place the seedling pots near a window that receives 6 hours of direct sunlight and keep the surface of the soil evenly moist until the seedlings sprout. Water the soil a little bit every day—no more than 1 in (2.5 cm) per week. After about a week, apply a low-nitrogen fertilizer . The seeds should sprout about 2 weeks after sowing. [3] X Research source If the climate in your area tends to be hot and sunny, the seedlings may need 2 in (5 cm) of water per week instead. Do not soak the seed before sowing it. Avoid heavy watering after sowing the seeds since they can cause the seeds to crack. The soil's surface should be slightly moist but do not drench the soil beyond that. You may grow chickpeas in partial shade, but doing so will dramatically decrease the eventual yield."
    },
    {
      "title": "Fill your garden with nitrogen-low well-draining soil and compost.",
      "content": "Fill your garden with nitrogen-low well-draining soil and compost. Chickpeas naturally produce nitrogen, so choose a gardening soil with low nitrogen content . To improve the condition of the soil and ready it for your plants, chop in a few handfuls of aged compost before transplanting the seedlings. [4] X Research source Plant chickpeas in areas without clay soils. If the soil is too heavy, mix in agricultural sand, fine gravel, or a soil perfecter to make it less dense and to improve drainage. Add a fertilizer rich in potassium and phosphorus to encourage a higher yield. Avoid planting chickpeas in areas where green manures have grown or in soils that have a naturally high nitrogen content. Nitrogen will cause the leaves to become large and bushy, but they may produce fewer chickpea pods. Try to avoid mixing in mosses that tend to trap too much water."
    },
    {
      "title": "Transplant the seedlings after they frost when they're 4 to 5 in (10 to 12.7 cm) tall.",
      "content": "Transplant the seedlings after they frost when they're 4 to 5 in (10 to 12.7 cm) tall. Thin out the base with gardening scissors. Then, transplant them into your garden when daytime temperatures reach between 70 to 80℉ (21 to 27℃) and night temperatures stay above 65℉ (18℃). [5] X Research source Chickpea seedlings are considered “frost tolerant,” but they still plant best after the last frost passes. As they grow, the plants will start crowding into each other, which will give them support."
    },
    {
      "title": "Space the seedlings 5 to 6 in (12.7 to 15.2 cm) apart in the garden.",
      "content": "Space the seedlings 5 to 6 in (12.7 to 15.2 cm) apart in the garden. If you’re planting your chickpeas in rows, space the rows about 18 to 24 in (46 to 61 cm) apart. Dig holes as deep as the seedling pots. Place the pots in each hole and lightly cover the edges with additional soil. [6] X Research source Try not to remove the seedlings from their pots. Doing so can shock the delicate root system and cause the plants to die. Chickpea blooms are self-pollinating, and as the flowers die away, flat green pods will begin to form."
    },
    {
      "title": "Germinate the chickpea seeds a month before the last frost.",
      "content": "Germinate the chickpea seeds a month before the last frost. Soak dried kabuli or desi chickpeas or chickpea seeds in cold water for about 8 hours. Then, place the seeds on a damp paper towel and wrap them up. Put the paper towel in a sealed plastic bag and place it in a warm area indoors. Over the next 3 days, check periodically to ensure that the seeds are sprouting. [7] X Research source"
    },
    {
      "title": "Plant chickpeas in large pots that are at least 8 in (20.3 cm) deep.",
      "content": "Plant chickpeas in large pots that are at least 8 in (20.3 cm) deep. Because they need lots of sunlight, airflow, and well-draining soil, chickpeas don’t tend to do well in containers. However, it’s possible to plant a couple if you have a deck or patio garden. Buy deep large pots or gardening containers so the roots will have enough space to grow. [8] X Research source Plan to keep your containers on a sunny patio or deck where you can move them inside when it’s cold or under cover if periods of excessive heat are in the weather forecast."
    },
    {
      "title": "Fill your pot or container with low-nitrogen potting soil and add compost.",
      "content": "Fill your pot or container with low-nitrogen potting soil and add compost. Place low-nitrogen potting soil into your container. Add about 5 in (12.7 cm) of aged compost to the top of your pots to provide additional nutrition for the plant. [9] X Research source Add a mild low-nitrogen fertilizer and a light mulch to the top of the pots each month to help them retain moisture. [10] X Research source"
    },
    {
      "title": "Plant seedlings 3 to 6 in (7.6 to 15.2 cm) apart and 1 to 2 in (3.8 to 5 cm) deep.",
      "content": "Plant seedlings 3 to 6 in (7.6 to 15.2 cm) apart and 1 to 2 in (3.8 to 5 cm) deep. After germinating the seeds and the last frost passes, plant them in your pots outdoors. Using a trowel, dig a hole large enough to fit the biodegradable seedling pots. Place a handful of compost inside the hole, then put the seedling pot in. Cover the edge with dirt. Sprouts will appear after about 2 weeks. [11] X Research source Alternatively, plant the chickpeas ungerminated directly in the containers inside and away from the frost outside. Then, move the chickpea plants outside once they start to sprout and the last frost passes. Chickpea plants usually don’t require a lot of support, but you may stake them if you’d like to guide their growth and give them more airflow access."
    },
    {
      "title": "Give chickpeas 1 inch (2.5 cm) of water per week.",
      "content": "Give chickpeas 1 inch (2.5 cm) of water per week. You may not need to water regularly if you get regular rainfall. If you live in a dry area or you’re going through a dry period, try to water the chickpeas once a week. When flowers start growing in the middle of the summer and later when pods start to appear, aim to water around twice a week. [12] X Research source Water at the base of the plant, not from above. Watering from above can get the flowers and pods wet, causing them to break off, and may also cause mildew to develop on the leaves. When pods mature and the plant begins to die back on its own, water only about once every 1 to 2 weeks. This encourages the drying process, which is necessary if you’d like to harvest dried chickpeas."
    },
    {
      "title": "Add mulch to the base of the chickpea plants in late spring.",
      "content": "Add mulch to the base of the chickpea plants in late spring. Once the weather warms up, add a light coat of mulch around the stems to help them retain moisture in full sun. Mulch can also help prevent weeds from invading if your chickpeas are planted in a garden bed. Add more mulch during colder weather to insulate the plants. [13] X Research source Add an aged compost or similar organic material to the soil mid-season. Just avoid nitrogen-rich materials. [14] X Research source"
    },
    {
      "title": "Handle the chickpeas carefully when removing weeds or adding to the soil.",
      "content": "Handle the chickpeas carefully when removing weeds or adding to the soil. The root system of a chickpea plant tends to be shallow, so working too close to the base of the plant can cause damage to its roots. Try to also avoid handling the plants when they’re wet to stop fungus spores from spreading."
    },
    {
      "title": "Plant companion plants like cucumber, corn, or strawberries.",
      "content": "Plant companion plants like cucumber, corn, or strawberries. Companion planting can repel pests and provide shade for smaller plants. Chickpeas also naturally produce nitrogen, which can be highly beneficial for other plants. [15] X Research source Plant: Cucumber, celery, potatoes, strawberries, corn, melon, and summer savory. Avoid: Garlic or onion."
    },
    {
      "title": "Spray pests with water or insecticidal soap.",
      "content": "Spray pests with water or insecticidal soap. Chickpeas are vulnerable to attacks by a range of different pests, including aphids, bean beetles, leafhoppers, flea beetles, and mites. Just spray these pests away with a blast from the water hose, neem oil , or insecticidal soap . Look for eggs on your chickpea plant’s leaves and crush them between your fingers. [16] X Research source Cut and dispose of any leaves with eggs on them if you don’t want to crush them. If you notice chickpea leaf miners, remove leaves with trails and apply neem oil. Cover your garden with a mesh covering to prevent them from invading again. Keep your garden clean and free of debris before winter to reduce the number of pests in the spring."
    },
    {
      "title": "Keep your garden free of weeds and dispose of diseased plants.",
      "content": "Keep your garden free of weeds and dispose of diseased plants. To reduce the risk of disease, plant disease-resistant chickpea varieties, like Sanford or Sierra, and keep your garden free of debris and weeds. If you notice diseased plants, put them in a paper bag and throw them away. Here are common signs of diseases you may see and how to avoid them in the future: Flour-like powder on leaves: Mildew. Ensure the plant has good airflow and water at the base of the plants, avoiding the leaves, flowers, or pods. Brown marks or black spots on leaves: Ascochyta blight. Grow more disease-resistant varieties or apply a copper fungicide 4 to 6 weeks after sowing. Drooping leaves, split stems, and wilting leaves: Fusarium wilt. Avoid handling the plants when wet and rotate your crops so they don’t grow in the same location more than every three years. Warped yellowed leaves and stunted growth: Bean mosaic virus. Sow disease-resistant chickpea varieties and reduce pests that can transmit the disease."
    },
    {
      "title": "Harvest fresh green chickpeas any time you’d like.",
      "content": "Harvest fresh green chickpeas any time you’d like. If you want to eat the chickpeas fresh, pluck the pods off the stems of the plant while they are still green and immature. [17] X Research source Many people say they taste like green snap peas, with a sweet and nutty twist. Store them in the fridge for up to 1 week. Each pod has a length of less than 1 inch (2.5 cm) and contains one or two beans each. Around 4 to 8 plants can feed 1 household member. Both fresh and dried chickpeas can be frozen or canned. Cook fresh chickpeas in a slow cooker, an oven, or by boiling them."
    },
    {
      "title": "Harvest dried chickpeas after the plant starts to wither.",
      "content": "Harvest dried chickpeas after the plant starts to wither. The more popular way to harvest chickpeas is to harvest them once they've matured, as dried chickpeas. To do so, harvest the entire plant once the leaves start to turn brown and die. When the plant is completely dead, dig it up and place it on a flat, warm surface. Let the pods air dry naturally in a warm, well-ventilated location for several weeks, and collect the seeds as they split open. [18] X Research source The chickpeas are completely dry if they barely dent when they’re bitten into. If the weather is getting damp, bring the harvested plant or pods indoors to finish drying them. Otherwise, mold could develop on the pods and ruin the chickpeas inside. Keep dried, shelled chickpeas in an airtight container placed in a cool, dry location for up to one year. Cook dried chickpeas by soaking them first or by boiling them. Try making parmesan chickpeas as a healthy snack or side!"
    }
  ]
}