{
  "url": "https://www.wikihow.com/Identify-Turtles",
  "title": "How to Identify Turtles",
  "steps": [
    {
      "title": "Identify box turtles by their big, domed shells.",
      "content": "Identify box turtles by their big, domed shells. Box turtles are a very common species that live in the east and southwest U.S. as well as in northern Mexico. A box turtle is easy to spot since it’s a small turtle carrying a big dome of a shell it can retreat into when threatened. Box turtles often tend to be very colorful with bright yellow or orange markings all across their shells. [1] X Research source Box turtles live near ponds and streams. They like muddy areas and frequently end up in backyards. Unlike other freshwater turtles, box turtles have the same shell shape as tortoises. Look for the color markings and the small, flat feet to tell them apart."
    },
    {
      "title": "Recognize painted turtles by the red markings on their shells.",
      "content": "Recognize painted turtles by the red markings on their shells. Painted turtles have a relatively flat olive or black-colored shell. The red “paint” is on the edge or underside of the shell. A southern painted turtle will also have a red stripe down its back. These turtles are often spotted near freshwater all across the U.S. Painted turtles tend to live in areas with shallow water, sloping logs, and flat rocks. It isn’t uncommon to see a painted turtle sunbathing! Tell painted turtles apart from other species by looking for the markings. Red-bellied cooters, for instance, often have red streaks across the top of their shells. Red-eared sliders are another common species, but they have red streaks behind their eyes."
    },
    {
      "title": "Note the horrible smell if you encounter a musk turtle.",
      "content": "Note the horrible smell if you encounter a musk turtle. Musk turtles, also known as Stinkpots, have a very distinctive odor. They emit a strong, almost sweet smell when they feel threatened. They are also identifiable by their small size since they tend to be no bigger than 5 in (13 cm). They have flat, brown shells that can be speckled with color, although the yellow stripes behind their eyes are easier to spot. These turtles live in slow-moving, muddy-bottomed rivers as well as reed-covered areas near lakes and ponds. They are common in the eastern and southern U.S."
    },
    {
      "title": "Identify mud turtles by the 11 shell plates they have.",
      "content": "Identify mud turtles by the 11 shell plates they have. Mud turtles are only about 5 in (13 cm) long at most and have round, relatively indistinct shells. The shells are round and smooth with dark brown and yellow on the bottom. The most recognizable part of this species are the scutes, or plates, on the shell. While most turtles have 12 plates, mud turtles have 11. [2] X Research source Mud turtles live in warm, muddy areas with streams, marshes, and other slow-moving water. They usually crawl along the bottom and go onto land more often than musk turtles. They are common in areas like the eastern and southern U.S."
    },
    {
      "title": "Recognize map turtles by their ornate, ridged shells.",
      "content": "Recognize map turtles by their ornate, ridged shells. Map turtles have brown shells, but the swirling lines on the scutes make them recognizable. The design makes this turtle’s shell look like a cartographer’s map. Many types of map turtles have shells that rise to a peak in the center. These turtles also usually have long necks and a flat head complete with lots of yellow stripes. [3] X Research source Map turtles tend to live in a broad range of areas, including cooler climates. For example, they can live anywhere from Ontario, Canada to Alabama, U.S. Map turtles usually prefer larger water sources like lakes and rivers. Many other freshwater turtles stick to shallow waters with lots of plants and sunlight."
    },
    {
      "title": "Find softshell turtles by their smooth, leathery shape.",
      "content": "Find softshell turtles by their smooth, leathery shape. Softshell turtles have a very unique shell that looks flat, smooth, and almost rubbery. They're brown and can be spotted with black dots. Unlike with other turtles, the shell won’t be divided up into plates. Spiny soft shells, unlike smooth softshells, have ridges along the front of their shells. These turtles tend to live near gravel-bottomed streams and lakes. They prefer mud and sand to hide in when they aren’t swimming. These turtles can live in a wide variety of places, including cooler climates. For instance, they are common in Minnesota in the U.S. since it has lots of streams and lakes."
    },
    {
      "title": "Spot snapping turtles by their big size and squashed heads.",
      "content": "Spot snapping turtles by their big size and squashed heads. Snapping turtles are unique since they are big, up to 3 ft (0.91 m) wide, like some tortoises. They are well-known for being cranky reptiles that won’t hesitate to snap with their powerful jaws when they are upset. Their shells also look rough and have sharp, jagged edges. These turtles actually have long necks but tend to keep their heads pulled back into the opening of their shells. [4] X Research source Snapping turtles live near muddy-bottomed freshwater with a lot of plant cover. They can be found all across the U.S. and Canada but are most common in the east."
    },
    {
      "title": "Note the pointy shell that spurred tortoises have.",
      "content": "Note the pointy shell that spurred tortoises have. Spurred turtles are pretty big and can be up to 3 ft (0.91 m) long. They have tank-like shells that grow rings as they age. The plates, or scutes, on the brown shell are distinct and pointed as well. [5] X Research source Some spurred tortoises are common in grassy areas in southern Africa. They enjoy warm weather but eat a lot of plants. The most recognizable species is the African Spurred tortoise, but another common one is the Mediterranean spur-tight or Greek tortoise. It is smaller, with an olive-colored shell that is a little spiky. It lives in the Mediterranean like in Greece and northern Africa. Tortoises, in general, have elephant-like clawed feet that help them walk over rough ground. Freshwater turtles have flat feet for swimming, while sea turtles have flippers."
    },
    {
      "title": "Identify the black and yellow coloring of a Russian tortoise.",
      "content": "Identify the black and yellow coloring of a Russian tortoise. Russian tortoises are relatively small, about 8 in (20 cm) long. They have bulky, round shells with brown or black scutes. The lines dividing the scutes are yellow or brown. These tortoises also have a point at the end of their tail that makes it look like a claw. [6] X Research source Russian, or Horsfield’s, tortoises, are commonly found in Russia but live in places like Iran, Afghanistan, and Pakistan. They like dry or sandy areas, particularly ones more than 5,000 ft (1,500 m) high."
    },
    {
      "title": "Check for a star pattern to identify Indian Star tortoises.",
      "content": "Check for a star pattern to identify Indian Star tortoises. These tortoises are unique because of the patterns on their shells. They have black, pointy shells with white lines connecting the points on the scutes. They are otherwise pretty small, about 8 in (20 cm) long. Indian star tortoises live in areas like India, Sri Lanka, and Pakistan. [7] X Research source Another type of patterned tortoise is the leopard tortoise, which has a brown shell with black spots instead of stars. It lives in eastern and southern Africa, so it is easy to distinguish from star tortoises."
    },
    {
      "title": "Look for red spots to identify red-footed tortoises.",
      "content": "Look for red spots to identify red-footed tortoises. Their bright coloring makes them popular pets. They have black skin with red spots on their legs as well as more spots right behind their eyes. Their shells are black with spiked scutes that are pale yellow. Their undersides are also black with a pale yellow stripe down the center. [8] X Research source Red-footed tortoises are a South American species. There are several different types, including a yellow-footed one that lives in the Amazon."
    },
    {
      "title": "Note the yellow and brown coloring of Hermann’s tortoises.",
      "content": "Note the yellow and brown coloring of Hermann’s tortoises. Hermann’s tortoises are pretty small, only about 8 in (20 cm) long. They are most notable for their black-colored shell with ringed scutes divided by yellow lines. They also happen to be mild-mannered around people but are pretty active and can even be seen running as fast as they can in the wild. [9] X Research source Hermann’s tortoises live in similar areas to Greek tortoises. They can be found around the Mediterranean, particularly in Europe."
    },
    {
      "title": "Note the flat, ridged shell that leatherbacks have.",
      "content": "Note the flat, ridged shell that leatherbacks have. Leatherback turtles have a very unique appearance compared to all other sea turtles. The shell is thin and flat but has a series of ridges like stripes running from top to bottom. These turtles tend to live in the warm parts of the Pacific, Atlantic, and Indian oceans, but they can travel as far as Canada and New Zealand. They usually stay in open water, but they sometimes come near shore to eat. Remember that all sea turtles have flippers instead of clawed feet. It can help you distinguish a leatherback from other smooth species like softshells. Sea turtles will always be in the ocean and only come up on land to nest."
    },
    {
      "title": "Check for a round head and a long shell when identifying loggerheads.",
      "content": "Check for a round head and a long shell when identifying loggerheads. Loggerheads look pretty similar to other types of sea turtles, so pay close attention to their shape. The first sign is the long, almost heart-shaped brown shell. The shell has 5 plates, or scutes down the center and 5 longer ones on each side. You may also be able to see the turtle’s big head and thick neck. [10] X Research source For instance, hawksbill turtles have a slightly pointed head similar to a bird’s beak, which can help you distinguish them from the more common loggerheads. Loggerheads live in warm waters close to the coast, so they can be found from Argentina all the way up to Canada."
    },
    {
      "title": "Look for an oval shell with mottled colors to identify green turtles.",
      "content": "Look for an oval shell with mottled colors to identify green turtles. Green turtles are probably what you think of when you picture a sea turtle. Their shells actually aren’t just green and can be speckled with yellow and brown, although they turn more green as they age. Their shells have a column of rounded scutes down the center and 4 wider ones on each side. [11] X Research source Green turtles also have short necks with rounded heads and eyes that look half-closed. Their skin has big, brown blotches that look like shell plates. These turtles live in warm and tropical waters. They can be found around the world, including in spots like the Caribbean. Green turtles are the only type of sea turtle to exclusively eat plants."
    },
    {
      "title": "Recognize olive ridley sea turtles by their numerous shell plates.",
      "content": "Recognize olive ridley sea turtles by their numerous shell plates. These turtles look somewhat similar to loggerheads but have a shorter, rounder shell. Their shells are a gray or olive green color. The main difference is the scutes on the sides of the shell—olive ridleys have 6 or more plates on each side. Other sea turtles have 5 of them. [12] X Research source Olive ridleys have a pretty wide range and are the most common type of sea turtle. They can be found in tropical waters near India, Japan, South America, Africa, and many other areas. There is a similar turtle called a Kemp’s ridley, but it has 5 scutes on its shell. This type of turtle also lives in a limited area, such as in the Gulf of Mexico. Seeing one is rare."
    }
  ]
}