{
  "url": "https://www.wikihow.com/Handle-Essential-Oil-Poisoning-in-Cats",
  "title": "How to Handle Essential Oil Poisoning in Cats",
  "steps": [
    {
      "title": "Take your cat to the vet.",
      "content": "Take your cat to the vet. If your cat exhibits any of the symptoms associated with essential oil poisoning, or if you know definitively that your cat ingested essential oils, get it to the vet immediately. Veterinary care is important for both solving and diagnosing essential oil poisoning, since there are a number of other conditions that could produce similar or identical symptoms. [1] X Research source"
    },
    {
      "title": "Contact the pet poison helpline.",
      "content": "Contact the pet poison helpline. In the event that your vet’s office is closed or your vet is unavailable, contact your local pet poison hotline. This service is available 24 hours each day and is used by pet owners and vets alike. The hotline will be able to give you advice and directions that could help you save your cat. [2] X Research source To contact the pet poison helpline in your area, run a search like “pet poison helpline” for the number in your preferred search engine. The pet poison helpline may have a different name in your area. For instance, in the U.S., the helpline is called the Animal Poison Control Center Phone Number. In the U.K., the helpline is called the Animal Poison Line. The personnel of the poison helpline may wish to know the type of essential oil your cat ingested (if known). Be aware that you will be charged by the pet poison hotline, as they are not funded by the government. However, the cost will be worth saving the life of your cat."
    },
    {
      "title": "Do not induce vomiting.",
      "content": "Do not induce vomiting. Unless otherwise directed, do not use activated charcoal or attempt to induce vomiting in any other way. Doing so might actually harm your cat. [3] X Research source Your vet will make the determination about whether or not inducing vomiting is a good idea for your cat. Depending on what was digested, the vet may give your cat activated charcoal."
    },
    {
      "title": "Have blood work done.",
      "content": "Have blood work done. Your vet will probably need to analyze your cat’s blood before making a decision about what to do next. This involves drawing your cat’s blood, then checking it for enzymes produced by the liver and kidneys. The degree to which enzymes from these organs are present or absent will allow your vet to identify how compromised your cat’s health is, and select the best course of action. [4] X Research source Depending on what your cat has ingested, its body will try to clear it through the kidneys, liver, or both. This can damage your cat's organs, so treatment will need to focus on protecting these organs."
    },
    {
      "title": "Give your cat medication.",
      "content": "Give your cat medication. Depending on which oil your cat ingested and the quantity that was consumed, your vet might recommend anti-vomiting medication, medications to protect the stomach, pain medication, and/or medication to protect the liver. If your cat has ingested essential oils or had them applied to their skin, medicine to relieve inflammation and irritation may be necessary. [5] X Research source Your doctor will advise you regarding which medicine to give your cat, and in what quantity."
    },
    {
      "title": "Wash your cat.",
      "content": "Wash your cat. If your cat came into direct contact with essential oils, you or your vet might wash the cat to remove any residual essential oil from its skin. Using a medicated anti-inflammatory shampoo or skin treatment might also be in order. [6] X Research source Medicated shampoos generally work the same as regular ones do. Simply wet your cat in a tub, apply a small dab of shampoo to its fur, and gently scrub it into a lather. Rinse the cat off, then pat dry with a soft towel. If the substance is sticky, use a degreasing shampoo or dish washing detergent to remove the substance before applying your medicated cat shampoo."
    },
    {
      "title": "Look for a lack of coordination.",
      "content": "Look for a lack of coordination. If your cat has been poisoned by essential oils, it might not be able to walk properly. It might trace a crooked line across the floor, weaving this way and that as if inebriated. In less pronounced cases, you might notice a general slowness of motion or an apparent lack of energy. [7] X Research source"
    },
    {
      "title": "Monitor your cat for tremors.",
      "content": "Monitor your cat for tremors. Your cat might shake or shiver in response to poisoning. In serious cases, essential oil poisoning in cats can cause seizures – an extremely violent case of uncontrollable shaking. [8] X Research source If your cat has a seizure, it is a medical emergency and you should contact your vet immediately."
    },
    {
      "title": "Check your cat’s temperature.",
      "content": "Check your cat’s temperature. When you observe tremors in your cat, they may or may not be linked to a reduction in its core body temperature. Use a pet thermometer to take your cat’s temperature if you notice it shaking. [9] X Research source Your cat’s normal body temperature is about 101.5 degrees Fahrenheit (39 degrees Celsius)."
    },
    {
      "title": "Look for skin irritation.",
      "content": "Look for skin irritation. Another symptom of essential oil poisoning in cats is redness and irritation of the skin. This is especially coming when the cat in question had essential oil applied to its skin. You might also note swelling, bumps, blistering, or redness on the lips, tongue, and gums. [10] X Research source"
    },
    {
      "title": "Look for eating troubles.",
      "content": "Look for eating troubles. If your cat throws up, it could be due to essential oil poisoning. If the vomit stinks of the essential oil the cat was recently exposed to, odds are that you’re dealing with a case of essential oil poisoning. [11] X Research source A less extreme symptom related to digestion might be a sudden disinterest in eating or a poor appetite. [12] X Research source"
    },
    {
      "title": "Keep your essential oils out of your cat’s reach.",
      "content": "Keep your essential oils out of your cat’s reach. Cats are natural explorers. But if your cat ingests, inhales, or otherwise comes in contact with concentrated essential oils, the poisoning that results will be swifter and more serious. Therefore, lock your essential oils away in a high, out-of-the-way cabinet that your furry friend is unlikely to get into. [13] X Research source If your essential oil bottles exude a significant scent even without being sprayed, place them in a resealable plastic bag, then stash them in your locked cabinet."
    },
    {
      "title": "Limit your pet’s exposure to essential oils.",
      "content": "Limit your pet’s exposure to essential oils. If you spray essential oils in a room, place your cat in another room and do not allow it to enter the space where you sprayed the essential oils until the scent has dissipated. To prevent the possibility of low-level buildup, do not use oils for more than two weeks at a time. Wait at least one week before resuming your use of essential oils. [14] X Research source Use these same rules for liquid potpourri, hydrosols, scented cleaning products, and other concentrated sprays. You can accelerate the dissipation of essential oils by opening a window or turning on a fan."
    },
    {
      "title": "Avoid oils containing polyphenolic compounds.",
      "content": "Avoid oils containing polyphenolic compounds. Cats are especially sensitive to essential oils containing polyphenolic compounds (or “phenols”). These include oils like: [15] X Research source Thyme Citronella Clove Eucalyptus Birch Cinnamon Melaleuca Wintergreen / peppermint Tea tree Lemon"
    }
  ]
}