{
  "url": "https://www.wikihow.com/Graduation-Card-Messages",
  "title": "What to Write in a Graduation Card: 140 Message Ideas",
  "steps": [
    {
      "title": "Encourage the graduate and show them that you’re as excited for their future as they are!",
      "content": "Encourage the graduate and show them that you’re as excited for their future as they are! Share some inspiring words to show that you support them and all their past and future accomplishments. Here are some examples: [1] X Research source “May you always find yourself as happy and full of dreams as you are today! Congratulations.” “Never stop growing, exploring, learning, and challenging yourself. Congratulations and best wishes for your future.” “Congratulations! Today is just the start of all the wonderful things that life has in store for you.” “School may be over, but life’s lessons are yet to be learned. Keep an open heart and mind. Happy graduation!” “Follow your dreams, and they will always lead you in the right direction. Congratulations on earning your degree!” “Today is a route marker. It tells you how far you’ve come, not that you have finished your journey. Keep learning, keep trying, and keep accomplishing. Congratulations!” “Your graduation is only a glimpse of what lies ahead in your bright future. Wishing you the very best for the coming years.” “May your future be adorned with delightful coincidences, invaluable setbacks, and boundless achievements.” “Congratulations on your graduation! Remember, if opportunity doesn't knock, build a door.” “As you embark on this new chapter of your life, remember that every challenge is an opportunity in disguise. Keep striving for greatness!”"
    },
    {
      "title": "Congratulate the grad with a heartfelt message.",
      "content": "Congratulate the grad with a heartfelt message. Graduation signals the end of one chapter and the start of a brand new one, so it will likely be an emotional moment for the graduate. Be supportive by congratulating them on their achievement and supporting them on their next adventure. Remember to speak from the heart. Here are some examples: [2] X Research source “To a happy ending and a new beginning. Wishing you the best in your new chapter. Congratulations!” “Today is your day. Wishing you all the best for what life now has in store for you.” “You have reached a great milestone in your life, so hold on to the moment! The world is yours for the taking.” “Congratulations on graduating and making it to the next chapter in your life. Now, go out there and take the world by storm!” “Look at how far you've come! Cheers to more sweet victories and incredible journeys along the way. Congratulations!” “Never stop dreaming! The world is filled with exciting new adventures and life lessons. Best wishes on your next journey!” “Wishing you happiness and success, not only on your special day, but always. Congratulations!” “Congratulations on your graduation! Here's to your next adventure. May it be as awesome as you are.” “Following your dreams requires dedication, passion, and sacrifice. We can't wait to see you accomplish everything you set out to do.” “Congratulations on your graduation. Your next adventure awaits, and we're excited to see where it leads you. Nothing can stop you now.”"
    },
    {
      "title": "Tease the graduate if you're close to make them laugh.",
      "content": "Tease the graduate if you're close to make them laugh. The days and weeks leading up to graduation can sometimes be stressful, so help the graduate relax once the big moment is finally over. In addition to congratulating them, feel free to lightheartedly poke fun at them to make them smile. Here are some examples: [3] X Research source “Did you ever think this day would come? Neither did we!” “All that work for a piece of paper?” “The tassel is worth the hassle! You did it! Congrats!” “Congratulations! Isn’t it amazing how far people can go with Google and Wikipedia around to help?” “Good looks, brains, heart, and now a diploma, too? Stop making me look bad!” “I always knew you were a smart aleck, now you have a degree to show it!” “Congratulations! Why didn't you tell me you were so smart?” “As you graduate don't forget to thank those who helped you get here: Google, Command C, and Command P.” “Congratulations on getting through the easiest part of life!” “Now it’s time to enter the real world. Don’t worry, none of us know what we’re doing here either!”"
    },
    {
      "title": "Provide the graduate with some words of wisdom.",
      "content": "Provide the graduate with some words of wisdom. While the majority of your message should be focused on congratulating the graduate, consider offering them a bit of advice if you’ve already been in their shoes. Don’t make it a warning, but instead offer them encouraging words for the future. Here are some examples: [4] X Research source “Failure is inevitable in life, but the greatest successes come from making mistakes.” “Be proud of this moment and know you deserve all the successes you work toward.” “Going forward, understand that all paths are different. Always remember that you are exactly where you are supposed to be.” “Find comfort in being uncomfortable. Take the opportunities presented to you even if they're scary; you have to leave your comfort zone to grow as an individual.” “Go into the world and do well, but more importantly, go into the world and do good.” “You can never cross the ocean until you have the courage to lose sight of the shore.” “When it comes to career decisions, close your eyes, take your time, and listen. What does your heart say?” “Live each day as if your life had just begun.” “Close some doors today. Not because of pride, incapacity, or arrogance, but simply because they lead you nowhere. Now, look forward.” “There is nothing more beautiful than finding your course in life.”"
    },
    {
      "title": "Let the graduate know what a big achievement they’ve made.",
      "content": "Let the graduate know what a big achievement they’ve made. For many, high school graduation is one of the first big accomplishments of a person’s life. Regardless of what the graduate plans to do in the future, celebrate the moment and let them know how proud you are of everything they’ve done. Continue to cheer them on as they start the next chapter of their life. Here are some examples: [5] X Research source “I can’t wait to see where life takes you next! Congratulations!” “As you celebrate your graduation, remember to cherish the friends and memories you’ve made along the way, and look forward to the bright opportunities ahead!” “We all know that you’ve worked incredibly hard to graduate, and now the world is yours for the taking!” “Wishing you boundless success and fulfillment in all your future endeavors! Congrats, grad!” “Your high school graduation is not just a milestone; it’s a testament to your hard work. This is where things start to get fun!” “High school may be over, but your life is just beginning. Here’s to a future filled with endless possibilities, exciting adventures, and memorable experiences!” “May your next adventure be as vibrant and full of life as you are. Congratulations on graduating high school!” “As you turn the page to a new chapter, remember: the world is your oyster. Congratulations on this monumental achievement!” “To a bright future ahead—may your dreams be as limitless as the sky. Congratulations on your high school graduation!” “Your dedication and hard work have led you to this day. Congratulations on your high school graduation and best wishes for your next adventure!”"
    },
    {
      "title": "Celebrate four years (or more) of hard work.",
      "content": "Celebrate four years (or more) of hard work. Whether the graduate is earning their Bachelor’s, Master’s, or their Doctorate, a college graduation is a huge accomplishment. Celebrate their achievement and wish them the best as they enter the “real world.” Feel free to add a touch of humor, as well—they’re probably ready for a good laugh after all their hard work. Here are some examples: “Your college graduation is not the end; it’s a new beginning filled with promise and potential. Cheers to your bright future!” “The piece of paper may be about academics, but the experience was a lesson in life. Congratulations.” “Your college years are behind you, but the memories will be with you forever. Kind of like your student loans, but let’s not get into that.” “Here's to the end of eating ramen noodles and takeout. Congrats on graduating!” “Congratulations on your graduation, and best of luck as you embark on your career!” “Congrats on your well-earned degree! Never forget how impressive it is to have earned one.” “Congratulations on finally escaping the clutches of academia! Now the real fun begins—adulting!” “Your college graduation is just the beginning of an exciting journey ahead. Dream big, work hard, and keep your eyes on the prize!” “Here's to the late nights, the early mornings, and all the moments in between. Your hard work has paid off. Congratulations, graduate!” “With your college degree in hand, you're ready to take on whatever comes next. Congratulations on an incredible achievement!”"
    },
    {
      "title": "Celebrate younger graduates, as well.",
      "content": "Celebrate younger graduates, as well. These days, graduation ceremonies aren’t just for high school or college; many schools also have ceremonies for kindergarten, elementary school, or middle school graduations. Celebrate a child as they move up a grade, and encourage them to continue focusing on their education. Here are some examples: “Sending you high fives and hugs! You made it! Congratulations on this incredible achievement!” “Yay! You made it! Dream big and never stop believing in yourself.” “Congrats on a job well done! This is just the first step toward your dreams. Make it happen!” “Congrats! Way to go! You are awesome!” “This is just the beginning! You can do anything you put your mind to. Congrats, graduate!” “Congratulations! Never stop growing, exploring, learning, and challenging yourself.” “Here's to a bright future. Congratulations!” “Cap, gown, it's going down! Congratulations!” “Onto the next chapter! Congrats!” “You’re one smart cookie! Congratulations on graduating!”"
    },
    {
      "title": "Keep things short and sweet if you don’t know them well.",
      "content": "Keep things short and sweet if you don’t know them well. If you’re celebrating the graduation of someone you don’t know well, like a distant relative or a friend’s child, don’t feel like you have to write a long, inspiring paragraph. A short sentence or two will be enough to express your congratulations. Here are some examples: [6] X Research source “Oh, the places you’ll go! Congrats on your graduation.” “All your hard work paid off. It’s time to celebrate!” “ConGRADulations! What an impressive achievement!” “Congrats on your graduation! Keep reaching for the stars!” “Cheers to the best four years! Congrats, grad!” “Caps off to you, graduate!” “You did it. Way to go! Success is yours.” “You have what it takes to do truly wonderful things. Congratulations!” “Congratulations! The world is waiting for you.” “Congratulations on graduating! Wishing you a most beautiful future!”"
    },
    {
      "title": "Cheer on a friend as they start their next chapter.",
      "content": "Cheer on a friend as they start their next chapter. Whether you’re graduating with them or simply cheering them on from the stands, you’ve probably made many lasting memories with your friend while they were in school. Look back on your shared experiences and inside jokes and support your friend as they take a step into their future. Here are some examples: [7] X Research source “Congratulations! After the last four years, I can officially add \"copy editor\" to my resume.” “To the grad who deserves it all: adventure awaits.” “Congratulations on graduating! Keep reaching for the stars and remember that I’ll always be here cheering you on.” “You did it! From the bottom of my heart, congratulations on your graduation, my friend.” “It's been a journey full of laughter and learning. Cheers to your amazing achievement and to many more adventures ahead!” “Watching you reach this milestone fills me with pride and joy. Congratulations to an incredible friend and, now, a graduate!” “Graduation is not the end; it's the beginning of a beautiful journey. Excited to see where life takes you next. Congratulations!” “The world awaits your talents, your passion, and your ideas. Go out there and make your mark. Congratulations!” “There's nothing better than graduating with my best friend! I will forever treasure every memory with you. Thank you for making these past 4 years memorable and tolerable.” “Here's to the end of late night studying, early morning classes, and eating cup noodles! Welcome to the world of endless bills and job hunting! Congrats, my friend!”"
    },
    {
      "title": "Let your child know how proud they make you.",
      "content": "Let your child know how proud they make you. Graduation isn’t just an important day for the person graduating—it’s also important for their parents. If your child is graduating, celebrate how special and talented they are and let them know just how proud you are of all their accomplishments. Here are some examples: [8] X Research source “Congratulations, our sweet [daughter/son]. Aim for the stars because the sky is the limit!” “You’ve come a long way since you were that frightened little [boy /girl] on your first day of kindergarten. Look at you now! We are so proud of you.” “I am proud of who you’ve turned out to be. This is the beginning of many more achievements. Let’s toast to your success today!” “We’re so proud of you, but it’s more important that you’re proud of yourself. Celebrate your accomplishment.” “You’ve made your mother/father so happy and I couldn’t be more proud of you!” “One degree equals two happy parents. So proud of you, honey!” “As your biggest cheerleaders, we are so honored to be standing by you today and celebrating all your hard work!” “My beautiful, unique, and hard-working graduate—you are full of so much potential and we are so proud. Congratulations.” “To our wonderful graduate: go confidently toward your dreams, live the life you have imagined, and keep making us proud.” “As a parent, today marks a significant milestone in your life and mine, and I couldn’t be prouder of the person you’ve become.”"
    },
    {
      "title": "Honor a beloved grandchild on their special day.",
      "content": "Honor a beloved grandchild on their special day. Graduation is a great time for a family to come together to celebrate a loved one’s achievements. If your grandchild is graduating, be sure to let them know how proud you are, and show your support for their goals and dreams. Here are some examples: [9] X Research source “May your feet always take you where your heart wants to go. Congratulations—we’re so proud of you!” “I’ve always known you were destined for greatness. Watching you graduate fills my heart with pride and joy!” “While you embark on the next chapter of your life, know that my love and support will always be with you. Continue to soar to new heights and achieve your dreams.” “As you graduate, know that you carry with you the love, wisdom, and blessings of your grandparents. We’ll be cheering you on every step of the way.” “As your grandparents, we have watched you grow into an amazing individual, and we couldn’t be prouder. May your journey ahead be filled with happiness and success.” “I’m so honored and blessed to have such a kind and intelligent grandchild. Congratulations on your graduation.” “Dear [grandson/granddaughter], today marks a significant milestone in your life. We are so proud of you and everything you’ve accomplished. Congratulations!” “We've watched you grow and achieve so much. We couldn't be prouder on your graduation day. Congratulations!” “I can't believe this part of your life is over. It seems like it was only yesterday when you graduated from kindergarten! Congratulations, darling!” “No matter what your decision is from here on, I'll be here to support you. Remember, your education is a valuable investment that nobody can take away from you. I'm so proud of you!”"
    },
    {
      "title": "Celebrate your sibling’s dedication and perseverance.",
      "content": "Celebrate your sibling’s dedication and perseverance. Put any sibling rivalry aside for the day to let your brother or sister know how excited you are for their graduation. Let them know how much you love and support them, and acknowledge all of the hard work and dedication that led them to this moment. Here are some examples: [10] X Research source “Our family just got a graduate! Your hard work and dedication have truly paid off. Congratulations, we love you!” “To my dear [sister/brother], your graduation is a testament to your perseverance and tenacity. Here's to many more successes!” “To my partner in crime, we've shared countless memories, and today, we share your success. Congratulations on your graduation!” “Graduation is just the beginning. Believe in yourself as much as we believe in you. Congratulations!” “I couldn't be any prouder to be your sibling! The whole family is super excited for you and life's next adventures. Congratulations!” “Cue the confetti! We couldn't be prouder of your accomplishments. ConGRADulations!” “Cheers to a future that is beyond bright! I cannot wait to celebrate more achievements with you. Keep it up!” “Congrats on your graduation from your biggest supporter! I knew you could do it, and I’m so proud of you!” “Congratulations to my favorite sibling! Remember, you are all kinds of wonderful!” “As your sibling, I can’t wait to watch you follow your dreams and achieve all your goals. Congratulations!”"
    },
    {
      "title": "Show support for your former students.",
      "content": "Show support for your former students. As a teacher, seeing your students graduate each year can be a very rewarding experience. As they move forward, wish them the best of luck for their future and encourage them to keep learning, whether they’re continuing their formal education or not. Mention their best qualities and let them know you’ll be cheering them on. Here are some examples: “It has been an honor to watch you grow over these years. Remember to stay curious, keep learning, and don’t stop chasing your dreams.” “Congratulations! Keep your love of knowledge, take on new challenges, and never lose sight of your dreams.” “Congratulations on graduating! As you move on, know that your teachers are cheering you on every step of the way.” “Today is about you, but it’s also about your hard work, determination, and resilience. It’s been a joy to watch your growth and development, both academically and personally.” “As your teacher, I’ve watched you blossom into an incredible graduate, and I’m so excited to see what you accomplish next. Best of luck with your future.” “Congratulations! Believe in your abilities, and you’ll achieve remarkable things.” “You’ve shown resilience and adaptability throughout your academic journey. I’ve always known you have a bright future ahead of you. Congratulations.” “It’s an honor to have been your teacher. You’ve grown into a well-rounded individual and I know you’ll do great things in the future.” “Congratulations on this incredible milestone! Take the lessons you’ve learned with you as you move forward.” “As your teacher, I think you’ve taught me as much as I’ve taught you. Your character and values will guide you towards success.”"
    },
    {
      "title": "Include an inspirational quote if you’re not sure what to say.",
      "content": "Include an inspirational quote if you’re not sure what to say. Finding the right words can be difficult, so if you’re struggling to come up with an inspiring message for your graduate, consider including a famous quote from a celebrity, writer, or historical figure. Many famous people have spoken at college graduations, so feel free to borrow their words to help you along. Here are some examples: [11] X Research source “Shoot for the moon. Even if you miss, you’ll land among the stars.” – Les Brown “Your education is a dress rehearsal for a life that is yours to lead.” – Nora Ephron “It always seems impossible until it’s done.” – Nelson Mandela “Success is loving life and daring to live it.” – Maya Angelou “Optimism is the faith that leads to achievement; nothing can be done without hope and confidence.” – Helen Keller “What lies behind us and what lies before us are tiny matters compared to what lies within us.” – Ralph Waldo Emerson “All dreams are within reach. All you have to do is keep moving towards them.” – Viola Davis “Accept no one’s definition of your life, define yourself.” – Harvey Fierstein “Be bold, be courageous, be your best.” – Gabrielle Giffords “If you can imagine it, you can achieve it. If you can dream it, you can become it.” – William Arthur Ward"
    },
    {
      "title": "Personalize your message.",
      "content": "Personalize your message. Graduating is a huge achievement, so it’s important to make the moment as special as possible for the graduate. Avoid using generic phrases, and try to tailor your message to them specifically. Mention their specific achievements (like if they were valedictorian or class president) and express excitement for their future, whether they’re continuing their education or entering the workforce. [12] X Research source"
    },
    {
      "title": "Be positive and congratulatory.",
      "content": "Be positive and congratulatory. While it may be okay to poke fun at the graduate depending on your relationship, your overall tone should be positive. Express excitement for their achievements and their future goals, and avoid “warning” them about what’s to come. Offer genuine well-wishes and speak from the heart. [13] X Research source"
    },
    {
      "title": "Offer words of wisdom.",
      "content": "Offer words of wisdom. If you’ve already been in the graduate’s shoes, consider offering them some (brief) words of advice. Share any lessons you’ve learned from your own experiences and let them know you’ll be there to support them as they continue to learn and grow. [14] X Research source"
    },
    {
      "title": "Share personal anecdotes and memories.",
      "content": "Share personal anecdotes and memories. If you’ve spent a lot of time with the graduate, make your message even more personal by including shared experiences and memorable moments with them. Even if you don’t see them as much after graduation, this will likely put a smile on their face when they read the card again later on. [15] X Research source"
    },
    {
      "title": "It shows support for an impressive achievement.",
      "content": "It shows support for an impressive achievement. Getting through high school or college can be hard, even for the most dedicated students. Writing a graduation card helps show the graduate that their hard work was recognized, and it provides the encouragement they need as they begin the next chapter of their life. [16] X Research source"
    },
    {
      "title": "It creates a keepsake.",
      "content": "It creates a keepsake. It may feel like it takes forever to reach graduation, but the moment itself is fleeting. Writing a heartfelt graduation card can give the graduate a physical memory to hold onto for years to come, and it may put a smile on their face some day when they want to relive their glory days. [17] X Research source"
    },
    {
      "title": "It strengthens your relationship with the graduate.",
      "content": "It strengthens your relationship with the graduate. If you’re writing someone a graduation card, you likely already have a relationship with them, but a thoughtful card can really show you care. This is especially true if you can’t be there to celebrate their graduation in person."
    }
  ]
}