{
  "url": "https://www.wikihow.com/Magic-the-Gathering-Commander-Damage",
  "title": "How Commander Damage Works in EDH",
  "steps": [
    {
      "title": "Commander damage is an alternative win condition in EDH.",
      "content": "Commander damage is an alternative win condition in EDH. Every Commander (EDH) deck has a single legendary creature as its commander. Every player in an EDH match starts with 40 life points, and they lose if they run out of life. However, players can also die if they take 21 damage from a player’s commander directly. [1] X Research source For example, let’s say your deck’s commander is Atraxa, Praetors' Voice . She’s a 4/4. If you attack one of your opponents 6 times with Atraxa and she’s never blocked, you’ll deal 24 damage and kill that opponent."
    },
    {
      "title": "Commander abilities and triggers do not count.",
      "content": "Commander abilities and triggers do not count. Take a look at Niv-Mizzet, Parun . He deals 1 damage to any target whenever his owner draws a card. While Niv-Mizzet can 100% target an opponent with this ability, it won’t count towards the commander damage win condition. It will, however, count towards the 40 regular life points. Commander damage can only occur in combat. [2] X Research source Any activated or triggered ability cannot deal commander damage. However, any activated or triggered ability that buffs the commander in combat will help increase commander damage. For example, Greven, Predator Captain ’s +X/+0 ability will count towards commander damage. One strange outlier is Saskia the Unyielding . Her second ability seems like it would count as combat damage, but it doesn’t—that’s a state-based effect."
    },
    {
      "title": "Cards that double damage will double commander damage.",
      "content": "Cards that double damage will double commander damage. If you have a card like Furnace of Rath on the board that doubles the damage of all your permanents, it will help boost your commander damage value. For example, Atraxa, Praetors' Voice would deal 8 commander damage."
    },
    {
      "title": "Instants and enchantments that buff increase commander damage.",
      "content": "Instants and enchantments that buff increase commander damage. Cards like Giant Growth and Rancor will increase your commander’s damage so long as they’re the target of the buff. There’s actually an entire archetype of decks called “Voltron” decks (named after the TV show Voltron , which was about 5 robots that combine into one) built around buffing your commander to end the game quickly. [3] X Research source"
    },
    {
      "title": "Commander damage stays if the commander changes zones.",
      "content": "Commander damage stays if the commander changes zones. Let’s say your commander is Akiri, Fearless Voyager and you’ve dealt 9 commander damage to Player 2 thus far in the game. Player 3 casts Agent of Treachery and it resolves. They target your Akiri with Agent of Treachery’s ability, which gives Player 3 control of your commander. If they were to attack Player 2, Player 2 would be at 12 commander damage from Akiri—not 3. [4] X Research source Another way to think about this is that commander damage stacks—it can’t be removed, replaced, or reset. The same applies if your commander dies and you rebuy them and attack the same player again."
    },
    {
      "title": "Yes, commander damage only cares about player life totals.",
      "content": "Yes, commander damage only cares about player life totals. If you have a 5/5 commander and you attack a player but they block with a 4/6, nothing unique happens. The 4/6 takes 5 damage and survives, and the 5/5 takes 4 damage and survives. The fact that your commander was involved in the combat doesn’t impact anything. [5] X Research source In other words, commanders just deal normal damage to everything that isn’t a player."
    },
    {
      "title": "No, every commander gets its own set of 21 life.",
      "content": "No, every commander gets its own set of 21 life. Commanders don’t “share” their commander damage. For example, if you attack Player 2 with your Ur-Dragon commander, which is a 10/10, and Player 3 spends their turn attacking Player 2 with their 4/4 commander, Edgar Markov , Player 2 does not have 14 commander damage. They have 10 from the first commander and 4 from Player 3. [6] X Research source This is actually one of the reasons a lot of players don’t like commander damage. It can be a lot of effort to track all of the separate commander damages in addition to the standard 40 hit points."
    }
  ]
}