{
  "url": "https://www.wikihow.com/Make-Protein-Pancakes",
  "title": "How to Make Protein Pancakes",
  "steps": [
    {
      "title": "Mix your eggs, protein powder, baking soda, and water in a bowl.",
      "content": "Mix your eggs, protein powder, baking soda, and water in a bowl. Get a large bowl. Crack 2 eggs on your counter or the rim of the bowl, and empty the yolks and whites into the bowl. Add your 2 scoops (40 g) of vanilla protein powder, 1 teaspoon (5 g) of baking powder, and 6 tablespoons (90 g) of water. Mix the ingredients together with an egg whisk until the mixture has a uniform, thick texture and is even in color. [1] X Research source You can use almond milk instead of water if you want fluffier pancakes with a little more weight to them. This batter should be relatively thick, but may seem a little thinner than traditional pancake batter."
    },
    {
      "title": "Heat a large, non-stick skillet over medium heat and oil it.",
      "content": "Heat a large, non-stick skillet over medium heat and oil it. Get a non-stick skillet and place it on your stove burner. Spray it with cooking oil to lubricate it. You can also use coconut oil or butter for some heartier pancakes. Let the skillet heat for 1-2 minutes as you measure out your batter. [2] X Research source If you’re using butter, start on low heat first to prevent the butter from burning as you’re weighing out your batter."
    },
    {
      "title": "Measure your batter out in a measuring cup to make calculating pours easy.",
      "content": "Measure your batter out in a measuring cup to make calculating pours easy. Either pour your batter directly into the measuring cup or use a spoon or ladle to pour the batter into the cup. Fill your measuring cup with the batter and use your spoon to scoop out any batter sticking to the sides. This way you can pour the pancake batter accurately with the cup’s spout while being precise about how much batter you’re using in each pancake. [3] X Research source You can also just pour 3 evenly-sized pancakes if you don’t care about keeping them identical. This may affect the cooking time though, as bigger pancakes will take longer to cook than smaller pancakes."
    },
    {
      "title": "Pour 3 pancakes into your skillet with 1–2 in (2.5–5.1 cm) between them.",
      "content": "Pour 3 pancakes into your skillet with 1–2 in (2.5–5.1 cm) between them. Use your measuring cup to pour your pancakes into the skillet. Pour 3 pancakes, using 1 ⁄ 3 cup (79 mL) of the batter for each pour. Leave a few inches of space between each pancake so that the batter doesn’t overlap in the pan. [4] X Research source Your pancakes should be roughly 3–5 in (7.6–12.7 cm) in diameter. Give each pancake that you pour 2-3 seconds to settle on the skillet so that you can see where the batter pools up. If you lubricated the skillet with butter, turn the heat back up to medium right before you pour the batter."
    },
    {
      "title": "Flip each pancake after the batter starts to bubble on top.",
      "content": "Flip each pancake after the batter starts to bubble on top. After 3-4 minutes of cooking, you’ll notice the batter start to bubble on the top of the pancakes. This means that the bottom has fully cooked through. Take a spatula and dig it underneath each pancake before flipping it over quickly by turning your wrist. Do your best to flip each pancake on top of the location where it had just been cooking. [5] X Research source"
    },
    {
      "title": "Cook the other side of the pancakes for 3-4 minutes.",
      "content": "Cook the other side of the pancakes for 3-4 minutes. If you cooked your pancakes for 3 minutes on the first side, cook them for another 3 minutes on the other side. If you cooked them for 4 minutes, cook the other side for an additional 4 minutes. Once your pancakes are done cooking, remove them with your spatula and place them on your serving plates. You will be able to tell when the other side is done cooking by monitoring the edges of the pancake. If they’re turning brown and hardening, they’re finished."
    },
    {
      "title": "Garnish your pancakes with nuts, fruit, syrup, or powdered sugar.",
      "content": "Garnish your pancakes with nuts, fruit, syrup, or powdered sugar. Once your pancakes are on the serving plates, you can top them with whatever toppings you enjoy. Walnuts and fresh fruit makes for a healthier dish, while syrup or powdered sugar will sweeten your pancakes. [6] X Research source If you really enjoy syrup but don’t want the sugar, you can get sugar-free syrup and use that instead. You can store uneaten pancakes in the refrigerator for 1-2 days."
    },
    {
      "title": "Separate your egg yolks from the egg whites in 2 bowls.",
      "content": "Separate your egg yolks from the egg whites in 2 bowls. Crack your first egg by cracking it on the rim of the bowl or on your counter. Pour the egg yolk into your first bowl by keeping the yolk upright and pouring it back and forth between the 2 halves of the egg shell. Leave your yolk in the other bowl. Repeat this process for your second egg. [7] X Research source"
    },
    {
      "title": "Beat the egg whites for 2 minutes until they become soft.",
      "content": "Beat the egg whites for 2 minutes until they become soft. Use a mixer or whisk to beat your eggs. If you’re using a mixer, turn it on high and move it around in the bowl to thoroughly mix the whites. [8] X Research source If you’re using a whisk, use your wrist to spin the whisk in a circular motion around the sides and bottom of the bowl. It may take an additional 1-2 minutes to whisk the eggs manually. You can tell when they’re done if the eggs seem slightly thinner and fluffier than they did before."
    },
    {
      "title": "Cut your banana into smaller pieces and add them to the egg whites.",
      "content": "Cut your banana into smaller pieces and add them to the egg whites. Take your banana and peel it. Place it on a cutting board and use any kind of knife to cut the banana into a sequence of 1 inch (2.5 cm) slices. Add the banana slices to the bowl filled with your egg yolks. [9] X Research source"
    },
    {
      "title": "Add the rest of your dry ingredients to the bowl with the egg yolks.",
      "content": "Add the rest of your dry ingredients to the bowl with the egg yolks. Pour 2 scoops (40 g) of vanilla protein powder, 1/4 teaspoon (2 g) of baking powder, 1/4 teaspoon (2 g) of salt, and 1/8 teaspoon (.5 g) of cinnamon into the bowl with your egg whites and banana. Mix the ingredients with your whisk or mixer until they’re thoroughly combined, forming a thick batter. [10] X Research source You can use chocolate protein powder instead of vanilla if you prefer, but a lot of people think that chocolate protein powder tastes a little metallic when used in food."
    },
    {
      "title": "Pour your egg whites into the bowl with your ingredients and mix them.",
      "content": "Pour your egg whites into the bowl with your ingredients and mix them. Take your bowl filled with the egg whites and slowly pour it around the edges of your mixed ingredients. Fold the batter into the egg whites using a rubber spatula or wooden spoon. Continue mixing the ingredients together for 3-4 minutes until the batter is uniform in color and texture. [11] X Research source"
    },
    {
      "title": "Heat a large, non-stick skillet over low heat and lubricate it.",
      "content": "Heat a large, non-stick skillet over low heat and lubricate it. Take a large, non-stick skillet and place it on a large burner. Spray the skillet with cooking spray, or coat the skillet with coconut oil. You can use melted butter to coat the skillet if you want a heartier meal. Let the skillet heat for 1-2 minutes. [12] X Research source If you use butter to coat your skillet, be careful to avoid burning the butter. If you see smoke or smell it burning, reduce the heat and add little more butter."
    },
    {
      "title": "Fill a standard measuring cup with your batter.",
      "content": "Fill a standard measuring cup with your batter. Either pour the batter directly into your measuring cup by tilting the bowl over the rim, or use a spoon to scoop it out carefully. Fill your measuring cup with the batter. This will make it easier to calculate how much batter you’re using with each pour. It will also be much easier to pour the batter, since you can use the spout on the cup. [13] X Research source You can also choose to simply pour the batter directly into the pan, but this will make it a little harder to get even pancakes."
    },
    {
      "title": "Pour 4 pancakes into your skillet, leaving 1–2 inches (2.5–5.1 cm) between them.",
      "content": "Pour 4 pancakes into your skillet, leaving 1–2 inches (2.5–5.1 cm) between them. Use your measuring cup to pour 4 pancakes on your skillet, using 1 ⁄ 4 cup (59 mL) with every pour. Wait 3-4 seconds after pouring each individual pancake to determine where one will stop and another will start. Leave a little space between each pancake. [14] X Research source Your pancakes should be roughly 4–6 in (10–15 cm) in diameter."
    },
    {
      "title": "Let your pancakes cook 90-120 seconds on each side.",
      "content": "Let your pancakes cook 90-120 seconds on each side. Let your pancakes cook for at least 90 seconds. When the batter starts to brown around the edges, dig your spatula underneath each pancake and flip it. Cook your pancakes on the other side for the same amount of time that you cooked them on the first side. [15] X Research source These pancakes won’t bubble the same way that normal pancake batter does, so keep an eye on the edges of each pancake to make sure it’s fully cooked."
    },
    {
      "title": "Remove your pancakes from the skillet and garnish them as desired.",
      "content": "Remove your pancakes from the skillet and garnish them as desired. Use your spatula to remove the pancakes after they’re done cooking. Place them on their serving plates and garnish them based on your personal preferences. Fresh fruit, nuts, powdered sugar, honey, cinnamon, or syrup will all make excellent toppings for your protein pancakes. [16] X Research source If you enjoy syrup but want to keep your dish healthy, consider getting some sugar-free syrup. You can store your uneaten pancakes for 1-2 days in the refrigerator."
    }
  ]
}