{
  "url": "https://www.wikihow.com/Know-if-You%27re-in-a-Gaslighting-Relationship",
  "title": "How to Know if You're in a Gaslighting Relationship",
  "steps": [
    {
      "title": "Do they question your memories of events and conversations?",
      "content": "Do they question your memories of events and conversations? Even if you remember something perfectly, your partner may say, “You’re wrong. That never happened. You never remember things accurately.” [2] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source Even if you have some sort of evidence, this person may make an excuse for why you are wrong or are interpreting things incorrectly. [3] X Research source Your partner may often tell you, “You just have a bad memory,” or, “You remember things all wrong,” and this can lead to you questioning your memory. [4] X Research source They may even say, “That's not what happened.” They may also flat-out deny that something happened. For instance, you might say, “You told me you were going to be out with your friends but when I called Jeff's house you weren't there.” Your partner might respond with, “What are you talking about? I never said I was going to be with Jeff!”"
    },
    {
      "title": "Do they change the subject when they want to avoid your question?",
      "content": "Do they change the subject when they want to avoid your question? If you ask a direct question, the person may redirect or change the subject. For example, if you say, “I saw you with another woman,” your partner may say, “You’re acting crazy,” or, “You’re imagining things” or, “Is that another absurd idea you got from your therapist?” [5] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source This response may cause you to feel defensive and respond to the comment, yet not have your question answered. Your partner may try to bring their focus onto their problems so that you are no longer discussing the fact that you saw them with another woman, but that you hurt their feelings with your “wild” accusations. [6] X Research source For example, your partner may say, “I can't believe you would accuse me of doing something like that. You've really hurt me.” Even when you ask an outright or direct question, the person may not provide an answer. If you say, “I want you to say ‘yes’ or ‘no’ and nothing else,” you still may not get a straight answer."
    },
    {
      "title": "Do they trivialize your feelings?",
      "content": "Do they trivialize your feelings? If you often get responses such as, “You’re too sensitive,” or, “Why do you make such a big deal of these little things?” this may be a sign of gaslighting. [7] X Research source Your partner may minimize your feelings and tell you that they don’t matter or you’re overly sensitive. [8] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source Trivializing your feelings can also be a way of changing the subject and not answering your questions. Your partner may also try to bring their focus onto their problems so that you are no longer discussing the fact that you saw them with another woman, but that you hurt their feelings with your “wild” accusations. For example, your partner may say, “I can't believe you would accuse me of doing something like that. You've really hurt me.” Your partner may always have a way to blame you or put responsibility onto you and not onto themselves. They might say, “You’re so quick to accuse me just because you’re paranoid.” Reader Poll: We asked 972 wikiHow readers how they felt about their role in their relationship, and only 4% of them said I feel like my needs are met. [Take Poll] A lot of people might feel their needs aren't being met in a relationship. Loving partners want to make a change, but gaslighters aren't."
    },
    {
      "title": "Do they accuse you of being crazy?",
      "content": "Do they accuse you of being crazy? The abuser may not even do this to your face — they may tell others that you are crazy so that if you go to them later, they will not believe you about the abuse. Your partner may use your growing distress to ‘prove’ you are unstable or overly sensitive. [9] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source For example, they may say, “See? Here you go again, accusing me of something I didn’t do. You get like this when you’re stressed and it’s not my fault.” The effects of gaslighting may have caused you to withdraw from friends and family and feel as though you have no where else to turn or any form of support outside of the abuser. You may fear that others will not believe you, or be afraid that they will think you are crazy, too."
    },
    {
      "title": "Learn more about the common reasons that people gaslight.",
      "content": "Learn more about the common reasons that people gaslight. Gaslighting is meant to confuse the other person and cause them to question their reality. [10] X Research source It occurs sometimes around illicit affairs and addiction. If you begin to get suspicious about your partner having an affair and even find strong evidence, your partner may chastise you for the accusations and become upset that you do not trust them. Someone hiding their addiction may also manipulate you or the evidence and make you feel bad about bringing up the topic. Instead of focusing on their own problems, they place the focus on you. Ask yourself if your partner’s actions are suspicious and whether you are justified in your questioning."
    },
    {
      "title": "Identify feelings of disbelief.",
      "content": "Identify feelings of disbelief. At first, you might notice strange or incongruent behavior in the relationship. Gaslighting can begin very subtly. Having felt like you’ve had a good time together or that you really like the person, you might write off the strange behavior and move on. [11] X Research source Maybe it was a first or second date that went really well up until the end, when the person left abruptly or made a rude comment. If you’re upset yet the person insists that it’s “no big deal” or “just a joke,” go with your gut and don’t excuse the strange behavior. As gaslighting progresses, the thoughts may transform from, “Why do they behave so strangely?” to, “What’s wrong with me?” [12] X Research source"
    },
    {
      "title": "Recognize if you constantly feel blame.",
      "content": "Recognize if you constantly feel blame. Your partner may blame you or you may begin to blame yourself. [13] X Expert Source Jeremy Bartz, PhD Clinical Psychologist Expert Interview. 17 February 2021. Your partner may say, “I’m doing this for your own good,” or, “If you didn’t hurt me, I wouldn’t hurt you back. It’s your fault.” [14] X Research source You might blame yourself for not being a ‘good enough’ partner or for constantly letting your partner down. [15] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source If every problem in the relationship is your fault and you feel like the relationship isn’t working because of you, think again. You’re likely taking all the blame for what goes wrong when, in fact, it’s a joint effort."
    },
    {
      "title": "Identify emotional confusion.",
      "content": "Identify emotional confusion. Even if the facts don’t add up, you may feel confused and internalize the flaw instead of seeing the discrepancy in the situation. [16] X Research source You may try desperately to understand your partner’s point of view or to help them see yours, to no avail. You might feel like you cannot trust your emotions or yourself. This can lead to not feeling any sense of trust in yourself or your emotions. You might actually begin to think you’re going crazy. You may ask yourself, “Am I imagining things? My partner sounds rational, but I feel irrational. Is it a problem with me and how I interpret things?”"
    },
    {
      "title": "Notice obsessive thoughts.",
      "content": "Notice obsessive thoughts. When you experience discrepancies in how you think or feel and are told you are wrong, you may start to wonder, “Am I crazy? Is my perception off? Am I a monster? Am I overly sensitive?” These obsessive thoughts may run through your mind over and over throughout the day. [17] X Research source By your partner telling you that your reality is wrong and not real, you may begin to question every experience you have, both with and without your partner. You may begin to doubt who you are and how you see the world. You might ask yourself, “Am I too sensitive?” over and over until you’re really not sure what is real and what isn’t. [18] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source"
    },
    {
      "title": "Consider if you constantly second-guess yourself.",
      "content": "Consider if you constantly second-guess yourself. You may feel like you’re always wondering, “Is that right? Was that okay?” Making decisions may become increasingly difficult as you lose the ability to trust yourself. [19] X Research source Even simple decisions may feel burdensome as if you cannot trust yourself to make a good or ‘right’ decision. [20] X Expert Source Jeremy Bartz, PhD Clinical Psychologist Expert Interview. 17 February 2021. Simple things such as deciding what kind of coffee you want or where to meet a friend for lunch can start to feel overwhelming."
    },
    {
      "title": "Notice how you’ve changed.",
      "content": "Notice how you’ve changed. You may remember yourself as happy, independent, and confident, but now you feel none of those things apply to you. [21] X Research source You may feel like you barely recognize yourself anymore, which can lead to feelings of depression . You may feel cut off from family and friends, possibly because your partner has isolated you from them, or because you are afraid they will think you are going crazy. If you look at yourself now and barely recognize who you are since being in the relationship, this can indicate a gaslighting relationship."
    },
    {
      "title": "Recognize making excuses for their behavior.",
      "content": "Recognize making excuses for their behavior. Your partner may accuse you of being a bad spouse or not caring about them or their feelings when you make a mistake. Friends, family, or co-workers may question your fears of displeasing your partner or upsetting them over small things. You might consider making excuses for their behavior (or your own) to assure them that everything is okay and it’s not really a big deal. If you find yourself lying to other people or defending your partner’s demands, this can indicate gaslighting tendencies. [22] X Research source You might say, “My partner is really picky, but they’re not demanding,” or, “Well, I have to be a good spouse because I often mess up.”"
    },
    {
      "title": "Trust your gut.",
      "content": "Trust your gut. If something just feels a bit ‘off’ but you can’t pinpoint it, ask yourself what’s going on. Gaslighting can upset your inner compass and make you question the way you perceive things. If you find yourself questioning the words you say, your own actions, or whether you’re an awful person, this can be a warning sign. [23] X Expert Source Allison Broennimann, PhD Clinical Psychologist Expert Interview. 24 February 2022. Even if you can’t quite nail down what it is that’s ‘off,’ recognize that something isn’t working when you’re with this person. [24] X Research source"
    },
    {
      "title": "Talk to someone you trust.",
      "content": "Talk to someone you trust. If you’re doubting your own thoughts and feelings and asking yourself, “Am I being crazy?” talk to a friend you trust. [25] X Expert Source Allison Broennimann, PhD Clinical Psychologist Expert Interview. 24 February 2022. Bring the evidence to them and ask, “What do you think?” Having an outside perspective can help you know whether you’re overreacting or you should genuinely be concerned. [26] X Research source Talk about the behaviors you notice that upset you and ask whether your questioning is warranted. For example, you can say, “My partner has long weekend business trips and she doesn’t respond to calls or texts during this time. Should I be worried? She says that everything is fine and she just gets bad reception and that I am overreacting. What do you think?” Support from friends and family can help you begin to trust yourself again and rebuild your confidence. They can help provide you with the strength and courage to break the unhealthy bond of a gaslight relationship."
    },
    {
      "title": "Ask a professional.",
      "content": "Ask a professional. Perhaps your partner calls you crazy or that you have some kind of psychological disorder. You may even believe them. Take this as an opportunity to talk to a professional about your experience. [27] X Expert Source Jeremy Bartz, PhD Clinical Psychologist Expert Interview. 17 February 2021. They may identify this type of behavior from your partner as abusive. [28] X Expert Source Allison Broennimann, PhD Clinical Psychologist Expert Interview. 24 February 2022. Start by discussing the situation with a therapist individually and not in couples’ counseling. Getting an outside view from an expert can be helpful. [29] X Research source If you have already been diagnosed with a mental illness, your partner may be using it against you (\"That's just your anxiety talking.\"). If something doesn't feel right, take the evidence to your therapist or a mental health professional and get their opinion."
    }
  ]
}