{
  "url": "https://www.wikihow.com/Inflate-Bike-Tires",
  "title": "How to Inflate Bike Tires",
  "steps": [
    {
      "title": "A Schrader valve is also called an American valve, or a car valve.",
      "content": "A Schrader valve is also called an American valve, or a car valve. The valve stem is surrounded by a threaded valve core; to press down on the stem, you need to use a tool like a pen cap or your thumbnail. [1] X Research source Schrader valves are typically wider in diameter and shorter than Presta or Woods valves. They're usually found on cars, less expensive bikes and mountain bikes. To open a Schrader valve, simply unscrew the rubber cap at the top."
    },
    {
      "title": "Figure out the recommended PSI for your tires.",
      "content": "Figure out the recommended PSI for your tires. This is usually on raised print on the side of your bike tires and will consist of a range. Don't let your PSI go any lower than the lowest number; the high number is the recommended maximum PSI."
    },
    {
      "title": "Locate a pump.",
      "content": "Locate a pump. If you don't already have one, try to use a gas station pump, or borrow one from a friend. If you have a Schrader valve, you're in luck - you won't need an adapter to use a gas station pump. Ask the attendant for a pressure gauge and inflate your tires in small bursts, checking the pressure after each one. Gas station pumps are extremely high pressure, and you can pop your tires if you're not careful. If you're using a bicycle pump with two openings, the larger one is meant for the Schrader valve. Smart pumps with one opening will automatically adjust to accommodate a Schrader valve. [2] X Research source A pump with one opening may require you to reverse an internal rubber stop to fit a Schrader valve. Unscrew the face cap and find the rubber stop. The larger end should be facing out for a Schrader valve."
    },
    {
      "title": "Inflate the tire.",
      "content": "Inflate the tire. Unscrew the rubber cap on top of the valve and put it somewhere safe, like your back pocket. You don't want to lose it. Put the pump on the valve. If there's a lever near the nozzle, make sure it's in the open position (parallel to the nozzle) when you're putting it on the valve; snap the lever down into the closed position (perpendicular to the nozzle) when it's on. Keep an eye on the PSI as you pump. Flip the lever back up to remove the pump, then quickly return the rubber cap to the valve."
    },
    {
      "title": "To deflate a tire with a Schrader valve, simply press on the springy valve stem with a fingernail or other small tool until all the air escapes.",
      "content": "To deflate a tire with a Schrader valve, simply press on the springy valve stem with a fingernail or other small tool until all the air escapes. [3] X Research source"
    },
    {
      "title": "The Presta valve, also called a Sclaverand or French valve, is usually found on high-end road bikes.",
      "content": "The Presta valve, also called a Sclaverand or French valve, is usually found on high-end road bikes. Presta valves are longer and narrower in diameter than Schrader valves, and feature an external valve stem that is protected by a valve cap, instead of being surrounded by a valve core. [4] X Research source"
    },
    {
      "title": "Open the valve.",
      "content": "Open the valve. To open a Presta valve, unscrew the dust cap at the top and put it somewhere safe. Then, loosen the small brass cap on the valve stem - it won't come off completely, but you should be able to raise it a bit. To check if you've loosened the bras cap enough, press on the valve stem. If you can hear air escaping in a sharp burst, you've loosened it enough."
    },
    {
      "title": "Figure out the recommended PSI for your tires.",
      "content": "Figure out the recommended PSI for your tires. This is usually on raised print on the side of your bike tires and will consist of a range. Don't let your PSI go any lower than the lowest number; the high number is the recommended maximum PSI."
    },
    {
      "title": "Locate a pump.",
      "content": "Locate a pump. Try to use a gas station pump, or borrow one from a friend. You can also purchase pumps at your local cycle shop. To use a gas station pump on a Presta valve, you'll need a Presta adapter. This is a small cap you can screw onto a Presta valve to essentially turn it into a Schrader valve. [5] X Research source Some older bike pumps might also require you to have a Presta adapter. You can purchase one from your local cycle shop. When using a gas station pump, ask the attendant for a pressure gauge and inflate your tires in small bursts, checking the pressure after each one. Gas station pumps are extremely high pressure, and you can pop your tires if you're not careful. If you're using a bike pump with two openings, the smaller one is for a Presta valve. Smart pumps with one opening will automatically adjust to accommodate a Presta valve. A pump with one opening may require you to reverse an internal rubber stop to fit a Presta valve. Unscrew the face cap and find the rubber stop. The smaller end should be facing out for a Presta valve."
    },
    {
      "title": "Inflate the tire.",
      "content": "Inflate the tire. Open the Presta valve by unscrewing the dust cap and loosening the smaller brass cap. Put the pump on the valve. If there's a lever near the nozzle, make sure it's in the open position (parallel to the nozzle) when you're putting it on the valve; snap the lever down into the closed position (perpendicular to the nozzle) when it's on. Keep an eye on the PSI as you pump. Flip the lever back up to remove the pump, and screw the brass cap closed. Replace the dust cap."
    },
    {
      "title": "To deflate a tire with a Presta valve, open the brass cap and press on the springy valve stem until all the air escapes.",
      "content": "To deflate a tire with a Presta valve, open the brass cap and press on the springy valve stem until all the air escapes."
    },
    {
      "title": "A Woods valve, also known as a Dunlop or English valve, is commonly used in Asia and Europe.",
      "content": "A Woods valve, also known as a Dunlop or English valve, is commonly used in Asia and Europe. It is larger like a Schrader valve, but employs the same mechanism as a Presta valve. Refer to the Presta valve section for instructions on how to inflate a tire with a Woods valve. [6] X Research source"
    }
  ]
}