{
  "url": "https://www.wikihow.com/IMessage-Waiting-for-Activation",
  "title": "8 Simple Ways to Fix iMessage Waiting for Activation Error",
  "steps": [
    {
      "title": "iMessage must be activated properly before you can use it.",
      "content": "iMessage must be activated properly before you can use it. If you received a new iPhone recently, or even a new phone number, you may see the error message \"Waiting for activation\" when trying to use iMessage or FaceTime . This could be due to your connection, cellular data, software bugs, or carrier settings. You may also see the error messages: Activation unsuccessful An error occurred during activation Could not sign in, please check your network connection Unable to contact the iMessage server. Try again."
    },
    {
      "title": "Check your Wi-Fi or cellular connection.",
      "content": "Check your Wi-Fi or cellular connection. Before you sign into iMessage, make sure you're connected to a stable Wi-Fi network. If you're using cellular data, make sure you're in an area with coverage. If necessary, toggle on and off Airplane Mode to reset your Wi-Fi and cellular service."
    },
    {
      "title": "Disable iMessage and turn it on again.",
      "content": "Disable iMessage and turn it on again. Sometimes, toggling this feature on and off can fix it. Open Settings . Tap Apps . Tap Messages . Toggle off iMessage . Toggle it on again."
    },
    {
      "title": "Hard-restart your iPhone.",
      "content": "Hard-restart your iPhone. Before you restart your iPhone, toggle off iMessage and FaceTime first. Then, do the following: Quickly press and release the top volume button. Quickly press and release the bottom volume button. Press and hold the side button until the Apple logo appears. Toggle on iMessage and FaceTime . again."
    },
    {
      "title": "Wait for carrier verification.",
      "content": "Wait for carrier verification. If you have a brand new phone number, wait for your carrier to verify it with Apple. If it's been over 24 hours, you can contact your carrier to make sure your phone number is set to send and receive SMS messages."
    },
    {
      "title": "Add an email address to iMessage.",
      "content": "Add an email address to iMessage. iMessage automatically uses your phone number. However, if your number is giving you trouble, you can opt to send and receive iMessages using your Apple ID as well. Do the following: Open Settings . Tap Apps . Tap Messages . Tap Send & Receive . Select your email address. [1] X Research source"
    },
    {
      "title": "Update your iPhone.",
      "content": "Update your iPhone. iMessage may be unavailable due to a software bug. Do the following: Go to Settings. Tap General. Tap Software Update. Tap Download and Install."
    },
    {
      "title": "Check your timezone settings.",
      "content": "Check your timezone settings. If your Date & Time settings are incorrect, it may interfere with other apps and features. Do the following: Open Settings . Tap General . Tap Date & Time . Toggle on Set Automatically ."
    },
    {
      "title": "Check Apple's servers.",
      "content": "Check Apple's servers . If iMessage still won't work, make sure the server isn't down on Apple's end. If there's an issue with iMessage, you'll see Unavailable in red. If iMessage is unavailable, try again the next day."
    }
  ]
}