{
  "url": "https://www.wikihow.com/Help-Someone-Having-a-Panic-Attack",
  "title": "How to Help Someone Having a Panic Attack",
  "steps": [
    {
      "title": "Understand what they're going through.",
      "content": "Understand what they're going through. People with panic disorder have sudden and repeated attacks of fear that last for several minutes, up to an hour, but rarely over that, because the body simply does not physically have enough energy to panic for that long. Panic attacks are characterized by a fear of disaster or of losing control even when there is no real danger. [1] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source A panic attack can occur without warning and for no obvious reason. In extreme cases, the symptoms may be accompanied by an acute fear of dying. Although they are quite distressing and can last from 5 minutes to somewhere over an hour, panic attacks are not life-threatening on their own. Panic attacks arouse the body to a peak level of excitement which makes the individual feel not in control of themself. The mind is preparing for a false fight or flight mode, forcing the body to take over to help the victim face or run from the perceived danger, real or not. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The hormones cortisol and adrenaline are released from the adrenal glands into the bloodstream, and the process begins -- this forms the heart of a panic attack. [3] X Research source The mind cannot distinguish the difference between a real danger from the one that is in your mind. If you believe it, then it is real as far as your mind is concerned. They may act as if their life is in danger, and they feel like it is. Try to put it in perspective; if someone was holding a knife to your throat and saying \"I'm going to slit your throat. But I'm going to wait and keep you guessing when I'll decide to do it. It could be any time now.\" There has never been a recorded instance of a person dying of a panic attack. They can only be fatal if accompanied by pre-existing medical conditions, such as asthma, or if extreme behaviors subsequently result (like jumping out of a window)."
    },
    {
      "title": "Watch for the symptoms.",
      "content": "Watch for the symptoms. If the person has never experienced a panic attack before, they'll be panicking on two different levels -- the second for not knowing what's going on. If you can pinpoint that they're going through a panic attack, this alleviates half the problem. Symptoms include: Palpitations or chest pain Speeding up of the heart rate (rapid heartbeat) Hyperventilation (over-breathing) Trembling Dizziness/lightheadedness/feeling faint (this is usually from hyperventilating) Tingling/numbness in fingers or toes Ringing in the ears or temporary loss or hearing Sweating Nausea Abdominal cramping Hot flashes or chills Dry mouth Difficulty swallowing Depersonalization (disconnected feeling) Headache"
    },
    {
      "title": "Seek emergency medical attention if this is the first time the individual has experienced this.",
      "content": "Seek emergency medical attention if this is the first time the individual has experienced this. When in doubt, it is always best to seek immediate medical attention. This is doubly important if the individual has diabetes, asthma or other medical problems. [4] X Research source It is important to note that the signs and symptoms of a panic attack can be similar to those of a heart attack . Do keep this in mind when assessing the situation."
    },
    {
      "title": "Find out the cause of the attack.",
      "content": "Find out the cause of the attack. Talk to the individual and determine if they are having a panic attack and not another kind of medical emergency (such as a heart or asthma attack) which would require immediate medical attention. If they've experienced it before, they may be able to clue you in to what's going on. Many panic attacks don't have a cause or, at the very least, the person panicking isn't consciously aware of what the cause is. Because of this, determining the cause may not be doable. If the person doesn't know why take their word for it and stop asking. Not everything is for a good reason."
    },
    {
      "title": "Remove the cause or take the individual to a quiet area.",
      "content": "Remove the cause or take the individual to a quiet area. The person will probably have an overwhelming desire to leave where they are (never do this unless they ask you to. Taking them somewhere without telling them will cause more panic because when someone is having an anxiety attack they don't feel safe and aren't aware of their surroundings. If you are going to take them somewhere ask for their permission and tell them where you are taking them). To facilitate this but keep them safe, take them to a different area -- preferably one that's open and calm. Don't ever touch a person who's having a panic attack without asking and obtaining definitive permission to do so . In some cases, touching the person without asking can increase the panic and make the situation worse. [5] X Research source Sometimes a person with panic disorder will already have techniques or medication which they know will help them get through the attack, so ask them if there is anything you can do. They may have a place they'd prefer to be."
    },
    {
      "title": "Speak to them in a reassuring but firm manner.",
      "content": "Speak to them in a reassuring but firm manner. Be prepared for the possibility of the individual trying to escape. Even though you're fighting an uphill battle, it is of the utmost importance that you remain calm yourself. Ask the individual to remain still, but never grab, hold, or even gently restrain them; if they want to move around, suggest that they stretch, do jumping jacks, or go with you for a brisk walk. If they're at their home, suggest organizing the closet or other vigorous cleaning up as an activity. With their body keyed for fight or flight, directing the energy toward physical objects and a finite, constructive task can help them deal with the physiological effects. The actual accomplishment may change their mood, while a different activity to focus on may help break the anxiety. If they're not at home, suggest an activity that can help them focus. This can be something as simple as lifting their arms up and down. Once they start getting tired (or bored with the repetitiveness), their mind will be less focused on the panic."
    },
    {
      "title": "Do not dismiss or write off",
      "content": "Do not dismiss or write off their fears. Saying things like \"there's nothing to worry about,\" or \"it's all in your mind,\" or \"you're overreacting\" will exacerbate the problem. The fear is very real to them at that moment, and the best you can do is help them cope - minimizing or dismissing the fear in any way can make the panic attack worse. Just say \"it's okay\" or \"You'll be okay\" and move onto breathing. [6] X Research source Emotional threats are real as life and death threats to the body. That's why it's important to take their fears seriously. If their fears are not grounded in reality and they're reacting to the past, providing some specific reality checks can help. \"This is Don we're talking about, he never blows up in people's faces over mistakes the way Fred used to. He'll just react the way he always does and probably help. It'll be over soon and he won't see this as a big deal.\" Asking the question in a calm and neutral way \"Are you reacting to what's going on right now or to something in the past?\" may help the panic attack victim organize their thoughts to recognize flashbacks versus immediate danger signals. Listen and accept whatever answer is given - sometimes people who have been in abusive situations before have very strong reactions to real warning signs. Asking questions and letting them sort out what they're responding to is the best way to support them."
    },
    {
      "title": "Don't say, \"Calm down,\" or \"There's nothing to panic about.\"",
      "content": "Don't say, \"Calm down,\" or \"There's nothing to panic about.\" Patronizing them will just put them on higher alert. What's more, telling them there's nothing to panic about may just remind them how out of touch with reality they are, forcing them to panic more . Instead, try something like, \"I understand that you're upset. That's okay. I'm here to help.\", or \"It will be over soon, I'm here for you. I know you're scared, but you're safe with me.\" [7] X Research source It's important for you to look at this as an actual problem, like if their leg were cut severely and bleeding heavily. While you can't see what's actually going on, something very scary for them is. The situation is real from their side of the fence. Treating it as such is the only way you can help."
    },
    {
      "title": "Don't pressure the individual.",
      "content": "Don't pressure the individual. This is not the time to force the individual to come up with answers or to do things that will make their anxiety worse. Minimize the stress levels by being a calming influence and let them get into a relaxed state. Don't insist they figure out what caused their attack as this will just make it worse. Listen supportively if they spontaneously try to sort out what it is they're reacting to. Don't judge, just listen and let them talk."
    },
    {
      "title": "Encourage them to try to control breathing.",
      "content": "Encourage them to try to control breathing . Regaining control of their breathing will help eliminate the symptoms and will help calm them down. Many people take short, rapid breaths when they're panicking, and some people hold their breath. This reduces the oxygen intake which will cause the heart to race. Use one of the following techniques to help bring their breathing back to normal: Try counting breaths. One way of helping them to do this is to ask the individual to breathe in and out on your count. Begin by counting aloud, encouraging the individual to breathe in for two and then out for two, gradually increase the count to four and then six if possible until their breathing has slowed down and is regulated. Get them to breathe into a paper bag. If the individual is receptive, offer a paper bag. [8] X Research source But be aware that for some people, the paper bag itself may be a trigger of fear, especially if they've had negative experiences with being pushed into it during previous panic attacks. Since this is done to prevent hyperventilation, it may not be necessary if you're dealing with someone who holds their breath or slows their breathing when they panic. If it is necessary, however, this should be done by alternating around ten breaths into and out of the bag, followed by breathing without a bag for 15 seconds. It is important not to overdo the bag breathing in case carbon dioxide levels rise too high and oxygen levels fall too low, causing other more serious medical problems. Get them to breathe in through the nose and out through the mouth, making the exhale in a blowing fashion like blowing up a balloon. Do this with them."
    },
    {
      "title": "Keep them cool.",
      "content": "Keep them cool. Many panic attacks can be accompanied by sensations of warmth, especially around the neck and face. A cold object, ideally a wet washcloth, can often help minimize this symptom and aide in reducing the severity of the attack."
    },
    {
      "title": "Don’t leave them alone.",
      "content": "Don’t leave them alone. Stay with them until they have recovered from the attack. Never leave someone who is struggling to breathe. A person with a panic attack may seem like they're being unfriendly or rude, but understand what they are going through and wait until they're back to normal. Ask them what has worked in the past, and if and when they have taken their meds. Even if you don't feel all that helpful, know that you're a sense of distraction for them. If they were left alone, all they would have is themselves and their thoughts. You just being there is helpful to keep them grounded in the real world. Being alone while having a panic attack is terrifying. But, if in a public place, make sure people stay a good distance away. They may mean well, but will only make it worse."
    },
    {
      "title": "Wait it out.",
      "content": "Wait it out. Though it may seem like forever (even to you -- especially to them), the episode will pass . General panic attacks tend to peak at around ten minutes and get better from there on a slow and steady decline. [9] X Research source However, smaller panic attacks tend to last longer . That being said, the person will be better at handling them, so the length of time is less of an issue. [9] X Research source"
    },
    {
      "title": "Seek medical help.",
      "content": "Seek medical help. If the symptoms do not subside within a few hours, consider seeking urgent medical advice. Though it's not a life or death situation, make the call, even if only for advice. The ER doctor most likely will give the patient Valium or Xanax and possibly a Beta-Blocker like Atenolol to calm the heart and the adrenaline in the body. [10] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source If this is the first time they have had a panic attack, they may want to seek medical attention because they are frightened of what is happening to them. If they've had panic attacks in the past, however, they may know that getting emergency care will worsen their state. Ask them. This decision will ultimately depend on the individual's experience and your interactions with him or her."
    },
    {
      "title": "Help the person find therapy.",
      "content": "Help the person find therapy. Panic attacks are a form of anxiety that should be treated by a medical professional. A good therapist should be able to pinpoint the panic attack triggers or, at the very least, help the individual get a better grasp on the physiological side of the situation. If they do begin it, allow them to proceed at their own pace. Let them know that therapy is not for kooks. It is a legitimate form of help that millions of people are a part of. What's more, a therapist may prescribe a medication that halts the problem in its tracks. The medication may not stop the attacks completely, but will surely lower the amount and frequency of them."
    },
    {
      "title": "Take care of yourself.",
      "content": "Take care of yourself. You may feel incredibly guilty that you are the one freaking out during a friend's panic attack, but this is normal. Know that being alarmed and a bit scared is a healthy response to witnessing one of these episodes. If it'd help, ask the person if you can talk about it later, so you can handle it better in the future."
    }
  ]
}