{
  "url": "https://www.wikihow.com/Make-Laundry-Detergent-Slime",
  "title": "How to Make Laundry Detergent Slime",
  "steps": [
    {
      "title": "Mix together equal amounts of white school glue and water.",
      "content": "Mix together equal amounts of white school glue and water. Pour 1/2 cup (120 millilitres) of water into a bowl. Next, stir in 1/2 cup (120 milliliters) of white school glue. Make sure that you get all of the glue out of the measuring cup. Use a fork, spoon, or mini rubber spatula to get it all out. [1] X Research source"
    },
    {
      "title": "Add some food coloring or glitter if desired.",
      "content": "Add some food coloring or glitter if desired. Start with 2 drops of food coloring. Give the mixture a stir, then add more food coloring, if needed. If you want to make your slime sparkly, add 1 teaspoon of glitter. Give the mixture a stir, then add more glitter, if desired. [2] X Research source"
    },
    {
      "title": "Stir in 1/4 cup (60 milliliters) of liquid laundry detergent with a fork.",
      "content": "Stir in 1/4 cup (60 milliliters) of liquid laundry detergent with a fork. As you stir the laundry detergent into the glue, the mixture will begin to stick together. Keep stirring until you have a glob. [3] X Research source Use a clear laundry detergent or a color that matches your food coloring."
    },
    {
      "title": "Knead the slime with your hands for 1 to 2 minutes.",
      "content": "Knead the slime with your hands for 1 to 2 minutes. If the bowl is too small for this, dump the slime onto a smooth counter, and knead it there. The more you knead the slime, the firmer and less watery it will become. This will take about 1 to 2 minutes."
    },
    {
      "title": "Play with the slime, then store it in an airtight container.",
      "content": "Play with the slime, then store it in an airtight container. A plastic box with a tight-fitting lid or a zippered sandwich baggie will work the best for this. Keep in mind that the slime will eventually dry out after a couple of days and turn hard, especially if you play with it a lot."
    },
    {
      "title": "Pour 1/4 cup (60 milliliters) of clear school glue into a bowl.",
      "content": "Pour 1/4 cup (60 milliliters) of clear school glue into a bowl. Use a spoon, fork, or mini rubber spatula to get all of the glue out of the measuring cup and into the bowl. You can use regular clear school glue or glitter school glue. [4] X Research source If you are using clear school glue, add 2 drops of food coloring and 1 teaspoon of glitter to make it more interesting. [5] X Research source"
    },
    {
      "title": "Use a fork to stir in 2 teaspoons of liquid laundry detergent.",
      "content": "Use a fork to stir in 2 teaspoons of liquid laundry detergent. The glue will start to come together and turn into a glob. [6] X Research source You can use any type of laundry detergent you want, but be aware that it will color your slime. For best results, match the color of the detergent to the color of the glue. You can also use clear laundry detergent if you can find it."
    },
    {
      "title": "Add in 1 more teaspoon of liquid laundry detergent and stir again.",
      "content": "Add in 1 more teaspoon of liquid laundry detergent and stir again. The glue will get harder, so you will need to press the detergent into the glue with the flat side of the fork. [7] X Research source"
    },
    {
      "title": "Knead the slime by hand for about 1 to 2 minutes.",
      "content": "Knead the slime by hand for about 1 to 2 minutes. Pick the slime up with your fingers. Squeeze and squish it between your fingers until it starts to turn firm and become less watery. This will take about 1 to 2 minutes. [8] X Research source The more you knead the slime, the firmer and more putty-like it will become. If the slime is still too sticky, add some more liquid laundry detergent. Start with 1/2 to 1 teaspoon. [9] X Research source"
    },
    {
      "title": "Add some shaving cream for fluffy slime if desired.",
      "content": "Add some shaving cream for fluffy slime if desired. If you wish to give your slime a softer texture , place the slime back into the bowl and add a dollop of shaving cream on top. Knead the shaving cream into the slime, making sure to pick up all the shaving cream from the sides of the bowl. This will take a few minutes of kneading. [10] X Research source Make sure that you use the foam kind of shaving cream, not the gel. The slime will be lighter in color after you add the shaving cream."
    },
    {
      "title": "Play with the slime, then store it in an airtight container.",
      "content": "Play with the slime, then store it in an airtight container. A plastic box or a Ziploc baggie is the best place to store the slime. Keep in mind that the slime will eventually dry out after a few days and turn hard. How long the slime lasts depends on how much you play with it. The more you play with it and expose it to air, the faster it will dry out."
    }
  ]
}