{
  "url": "https://www.wikihow.com/Make-Confetti",
  "title": "How to Make Confetti",
  "steps": [
    {
      "title": "Choose paper or cardstock for the most color variety.",
      "content": "Choose paper or cardstock for the most color variety. Purchase paper in any weight or color you like. For simple confetti, use white printer paper or use multicolored paper if you'd like a burst of color. [1] X Research source For a simple way to make unique confetti, purchase origami paper that has designs or patterns printed on them. Consider the event where the confetti will be used to determine what color confetti to make. For example, if you're making confetti for a winter party, choose paper that's pale blue, white, or silver."
    },
    {
      "title": "Reuse scrap or wrapping paper.",
      "content": "Reuse scrap or wrapping paper. You don't need to buy new or expensive paper to make confetti. Look around your home for newspapers, envelopes, flyers, or wrapping paper that you can repurpose into confetti. [2] X Research source You can also choose thin metallic materials or cellophane to turn into confetti."
    },
    {
      "title": "Select tissue paper for the lightest confetti.",
      "content": "Select tissue paper for the lightest confetti. If you'd like confetti that floats in the air for a while before it lands, use tissue paper. It's also easy to punch out lots of tissue paper confetti since you can layer it before punching the pieces out. You can often purchase tissue paper that contains an assortment of complementary colors."
    },
    {
      "title": "Use ribbon or garland for confetti with texture.",
      "content": "Use ribbon or garland for confetti with texture. To add interest to plain confetti, cut bright ribbon or garland made of fringe or tinsel. Since these are often sparkly and vary in size, you'll get truly unique confetti when you cut them. Consider buying ribbons or garlands that vary in thickness. This will give you different sizes of confetti."
    },
    {
      "title": "Mix a variety of materials to create different textures or effects.",
      "content": "Mix a variety of materials to create different textures or effects. If you'd like to make your confetti more interesting, use a combination of materials. For example, use a few pages of newspaper, thick ribbons, thin garland, and bright tissue paper. Remember that you can also control how you shape these different materials. You can cut the different materials into uniform pieces or into unique shapes."
    },
    {
      "title": "Use scissors to cut the material into 1⁄2 inch (1.3 cm) wide strips.",
      "content": "Use scissors to cut the material into 1 ⁄ 2 inch (1.3 cm) wide strips. Fold the material several times in order to make layers every time you cut. You can use thin material, such as tissue paper, thicker material, such as construction paper, or scraps, such as ribbon. Once you've folded the material at least 3 times, use scissors to cut the material into 1 ⁄ 2 inch (1.3 cm) wide strips. [3] X Research source To make diced confetti, turn the strips 90-degrees and cut them again. You can make these diced cuts 1 ⁄ 2 inch (1.3 cm) in size."
    },
    {
      "title": "Create confetti shapes with specialized punches.",
      "content": "Create confetti shapes with specialized punches. Purchase paper punches from a local craft shop or online. While it will be easy to find classic hole punches, you'll also be able to choose from a variety of special shapes. For the best result, use sturdy paper, such as cardstock or construction paper, to punch the shapes or holes. After punching out the shapes, you can cut the leftover material to create more confetti and reduce waste. Look for specialized punches, such as hearts, flowers, birds, stars, baby rattles, and holiday shapes."
    },
    {
      "title": "Put the material through a shredder to make finely shredded confetti.",
      "content": "Put the material through a shredder to make finely shredded confetti. Feed regular-weight paper, such as printer paper, into a shredder until you've made as much confetti as you need. For the tiniest confetti, use a micro-cut shredder instead of a cross-cut shredder. [4] X Research source Avoid running materials, such as ribbons or garland, through the shredder since these may snag. If you use heavier cardstock paper, the edges of the paper may tear or look ragged."
    },
    {
      "title": "Trim garland to make very fine confetti.",
      "content": "Trim garland to make very fine confetti. Hold strands of tinsel garland or fuzzy garland over a container. Then cut across the material so bits of it fall into the bowl. For larger pieces of confetti, cut closer to the center of the garland. To make tiny pieces of confetti, make lots of very small cuts."
    },
    {
      "title": "Rip the material to make coarse confetti.",
      "content": "Rip the material to make coarse confetti. If you'd like rustic or uneven-looking confetti, tear the material into individual pieces. Keep in mind that it may be difficult to tear thin material like tissue paper into very small pieces. Instead, rip regular-weight paper or cardstock until it's the size you want. To rip a bunch of confetti at once, stack 2 to 3 pieces of paper before you begin to rip them."
    },
    {
      "title": "Fill a balloon with your homemade confetti.",
      "content": "Fill a balloon with your homemade confetti. Choose clear balloons so the confetti will be visible and measure 1/2 cup (170 g) of confetti. Open the balloon and use a funnel to pour the confetti into the balloon. Then blow up the balloon and tie the end closed. [5] X Research source"
    },
    {
      "title": "Make a confetti popper.",
      "content": "Make a confetti popper . Get out a balloon and tie the end off without blowing it up. Then cut off 1 ⁄ 2 inch (1.3 cm) from the other end. Pull the cut end of the balloon onto a toilet paper tube and tape it in place. Fill the tube with about 1/2 cup (170 g) of your homemade confetti. To make the confetti pop, pull down on the knotted end of the balloon and let go. [6] X Research source You can also use push-pop containers or paper cups instead of toilet paper tubes."
    },
    {
      "title": "Create slender confetti sticks.",
      "content": "Create slender confetti sticks. If you're looking for a fun party favor, fill straws halfway with confetti that your guests can open and throw. You'll need about 1 tablespoon (22 g) of confetti. Staple the end of a clear straw so it's shut and fill the straw with your confetti. Then staple the other end so the confetti stick is completely sealed. If you like, you can cover the ends with glitter or decorative paper. [7] X Research source To use the confetti stick, cut open one end and shake out the confetti. You can let your guests take these home to use them or set out a pair of scissors for them to use at the party. To display your confetti sticks, set a handful of them in a decorative bucket, basket, or vase."
    },
    {
      "title": "Put homemade confetti into cards or invitations.",
      "content": "Put homemade confetti into cards or invitations. If you made small confetti, put 2 tablespoons (42 g) into the middle of a card before you stuff it into the envelope. If you'd like to include a lot of confetti or your confetti is too large to fit into a card or invitation, print the card or invite on a waxed bag. Then fill the bag with the confetti and seal it shut using tape, glue, or a stapler. [8] X Research source"
    },
    {
      "title": "Scatter the confetti for an easy tabletop decoration.",
      "content": "Scatter the confetti for an easy tabletop decoration. To make a fun, simple tabletop decoration, sprinkle about 1 cup (240 g) of your homemade confetti around place settings. You can also put confetti on tables that will hold gifts or guest registries. Scatter confetti instead of flower petals for a simple wedding aisle decoration."
    }
  ]
}