{
  "url": "https://www.wikihow.com/Make-a-Mini-Flyable-Hot-Air-Balloon-with-Candles",
  "title": "How to Make a Mini Flyable Hot Air Balloon with Candles",
  "steps": [
    {
      "title": "Find a thin, plastic bag.",
      "content": "Find a thin, plastic bag. The best bag for this is a thin, cheap, trashcan liner. It should be translucent or clear. Do not use a regular trash bag; it will be too heavy. You can also use a dry cleaning bag instead. If you do, make sure that it is the short kind used for shirts; be sure to tape the hole at the top of the bag. Do not use plastic grocery bags. They are too small and too heavy. [1] X Research source"
    },
    {
      "title": "Make sure that the bag does not have any holes by putting it in front of a small fan.",
      "content": "Make sure that the bag does not have any holes by putting it in front of a small fan. Place the opening of the bag in front of a small fan. Make sure that there are no gaps. Turn the fan on. The bag should fill up like a balloon. If it does not fill up, it may have some holes. Find these holes and cover them with a piece of scotch tape. [2] X Research source"
    },
    {
      "title": "Check the weather if you are planning on flying outside.",
      "content": "Check the weather if you are planning on flying outside. Make sure that there is no wind; even the slightest breeze will keep the balloon from flying. The best time to fly would be at dawn or dusk as the weather is the most still. [3] X Research source Cold, winter days with high pressure are the best for flying."
    },
    {
      "title": "Choose a large, empty room if you are planning on flying inside.",
      "content": "Choose a large, empty room if you are planning on flying inside. You can also fly your balloon inside. Make sure that there is a lot of space, and that there are no curtains or carpets inside. If the balloon lands close to one of those, you could start a fire. A great place to fly is in a garage or a school gym."
    },
    {
      "title": "Keep a bucket of water or a fire extinguisher near by.",
      "content": "Keep a bucket of water or a fire extinguisher near by. You will be working with fire, so you want to be safe. If you are a child, make sure that you have an adult with you at all times."
    },
    {
      "title": "Cut a 4 inch (10 centimeter) square from a sheet of aluminum foil.",
      "content": "Cut a 4 inch (10 centimeter) square from a sheet of aluminum foil. This will be your basket. The edges will be sharp, so be careful."
    },
    {
      "title": "Make four dots inside the square using a marker.",
      "content": "Make four dots inside the square using a marker. Each dot should be 1 inch (2.54 centimeters) away from each corner. You will be placing your candles on these dots."
    },
    {
      "title": "Take two birthday candles and cut them in half.",
      "content": "Take two birthday candles and cut them in half. This will make the balloon lighter and easier to fly."
    },
    {
      "title": "Peel the wax away on two of the candles to expose the wick.",
      "content": "Peel the wax away on two of the candles to expose the wick. You may have noticed that two of the candle pieces still have the wick sticking out, and two do not. Using your fingernail, crumble the tip of those two candles until you have some wick showing. You want to end up with four mini birthday candles."
    },
    {
      "title": "Melt the bottom of each candle and stick it onto a dot.",
      "content": "Melt the bottom of each candle and stick it onto a dot. Use a lighter to melt the bottom of a candle. Let some of the wax drip onto the dot. Once you have a small pool of wax, stick the candle down onto it. Hold the candle still until the wax hardens. Do this for the other three candles. If you are a child, ask an adult to help you with this step."
    },
    {
      "title": "Fold up the edges of the square by ¼ to ½ inch (0.64 to 1.27 centimeters) to make a basket.",
      "content": "Fold up the edges of the square by ¼ to ½ inch (0.64 to 1.27 centimeters) to make a basket. Be careful not to bump the candles while you are doing this. They will pop off easily. This will help catch any melted or dripping wax from the candles. [4] X Research source"
    },
    {
      "title": "Measure across the bag's opening.",
      "content": "Measure across the bag's opening. Lay a ruler across the opening of the bag. Write down the length. This will be how long you will be making the sticks for the frame."
    },
    {
      "title": "Make two sticks out of straws according to that length.",
      "content": "Make two sticks out of straws according to that length. To connect two straws together, cut a small slit into the bottom of a straw. Side the cut part into another straw. Wrap a piece of tape around the joint. Keep doing this until the stick is the same width as the bag. If you are using bendable straws, cut the bendy part off. [5] X Research source"
    },
    {
      "title": "Make a cross or X out of the two sticks.",
      "content": "Make a cross or X out of the two sticks. Find the middle of one stick. Place the other stick on top of it."
    },
    {
      "title": "Tape the two sticks together.",
      "content": "Tape the two sticks together. Do not use too much tape, or the frame will be too heavy. The best tape to use is clear scotch tape. Masking tape will be too heavy."
    },
    {
      "title": "Consider using balsa wood sticks instead.",
      "content": "Consider using balsa wood sticks instead. Purchase some thin balsa wood sticks from an arts and crafts store. They look like squares or rectangles when you look down at them from the top. Cut the sticks down to the right length. Put a drop of wood glue in the middle of one stick. Place the other stick on top of it, making a cross or X shape. Wait for the glue to dry. Try to get the thinnest stick possible. It will be the lightest and easiest to fly. Do not buy dowels; those are not balsa wood and will be too heavy."
    },
    {
      "title": "Put the candle tray on top of the straw frame.",
      "content": "Put the candle tray on top of the straw frame. If you look down on the frame and tray, the candles should be between the straws. This is very important. If the candles are over the straws, the heat will burn and melt the straws. It will also distribute the weight the wrong way."
    },
    {
      "title": "Secure the tray to the frame with tape.",
      "content": "Secure the tray to the frame with tape. Take a piece of tape and put it under one of the arms of the X. Press the tape against the bottom of the tray. Do this for the other three arms and sides of the tray."
    },
    {
      "title": "Tape the opening of the bag to the frame.",
      "content": "Tape the opening of the bag to the frame. Tape one corner of the bag to one of the ends of the frame. Tape the opposite corner of the bag to the other end of the frame. Do this for the other two sides. You are making a square-shaped hole."
    },
    {
      "title": "Attach a long piece of string to the frame and hold onto the string.",
      "content": "Attach a long piece of string to the frame and hold onto the string. You can also tie the string to a table, chair, or fence. This is very important. If you do not do this, the balloon may fly out of reach and get caught. Choose a thin, light string, such as thread."
    },
    {
      "title": "Place the balloon on a flat surface and hold the bag up over the candles.",
      "content": "Place the balloon on a flat surface and hold the bag up over the candles. Try to keep the bag as loose as possible, It might be easier to do this step and the next step with a friend."
    },
    {
      "title": "Light the candles.",
      "content": "Light the candles. Be careful so that you do not knock or push any of the candles over or burn the bag. A long, stick lighter might work best for this step. If you are a child, ask an adult to light the candles for you."
    },
    {
      "title": "Keep holding the bag until it fills up and stands on its own.",
      "content": "Keep holding the bag until it fills up and stands on its own. This will take about a minute or so. [6] X Research source"
    },
    {
      "title": "Let go of the bag.",
      "content": "Let go of the bag. It will not fly at first, but after a few more moments, it will start to rise on its own. Be sure to keep holding onto the string, or attach the string to something. The balloon will float for as long as the candles are lit."
    }
  ]
}