{
  "url": "https://www.wikihow.com/Make-a-Bedtime-Skin-Care-Routine-(Teenage-Girls)",
  "title": "How to Make a Bedtime Skin Care Routine (Teenage Girls)",
  "steps": [
    {
      "title": "Choose products designed for your skin type.",
      "content": "Choose products designed for your skin type . Everybody's skin is different, so don't just buy whatever your sister or your best friend is using—make sure the products you use are tailored to you. [1] X Expert Source Adarsh Vijay Mudgil, MD Board Certified Dermatologist & Dermatopathologist Expert Interview. 8 October 2020. One way to tell what type of skin you have is to wash your face thoroughly with a gentle cleanser. Wait two hours, then check out your skin. If your face looks and feels: Smooth, oil-free, with no flakiness—you probably have normal skin. Shiny or slick—you likely have oily skin Tight, dull, patchy, or flaky—your skin is probably dry. Oily around your forehead nose, and chin, but normal or dry elsewhere—you probably have combination skin. You may need to use separate products on the different zones of your face to get the targeted treatment you need."
    },
    {
      "title": "Take off your makeup every night, if you wear it.",
      "content": "Take off your makeup every night, if you wear it. It might not seem like that big of a deal to crash with your makeup still on, but it can actually lead to clogged pores and breakouts. Every time you wear makeup, use makeup remover or micellar water on a cotton pad to remove every trace. [2] X Research source Don't leave on any eye makeup, either—it can irritate your eyes and lead to infections. Avoid relying on makeup remover wipes to take your makeup off at the end of the day. They're convenient, but they aren't super effective, so you usually end up scrubbing at your skin. That can lead to skin irritation and over time, it may cause your skin to age faster. [3] X Research source"
    },
    {
      "title": "Wash your face with a cleanser for your skin type.",
      "content": "Wash your face with a cleanser for your skin type. It's really important to wash your face with warm water and a gentle cleanser every single night. That will remove dirt, bacteria, and oil that's built up on your skin throughout the day. You'll also need to wash off your sunscreen—you're wearing it every day to protect your skin from UV rays, right? All that stuff can lead to breakouts if you don't wash it away. [4] X Research source No matter what skin type you have, look for a non-comedogenic cleanser, which means it won't clog your pores. [5] X Research source If your skin is normal or if it tends to be sensitive, stick to a mild, lightweight facial cleanser. You don't need anything fancy! Use a creamy or gel-based cleanser if you have dry skin. Avoid foaming cleansers and anything with a strong fragrance. [6] X Research source Opt for a foaming cleanser if you have oily skin. That will help break up any oil and clean out your pores. [7] X Research source If you're prone to breakouts and you want to limit how many products you use, try a cleanser with the acne-fighting ingredient salicylic-acid. However, do not use any other acne treatments unless your dermatologist directs you to. Reader Poll: We asked 800 wikiHow readers how many products they use in their skincare routine, and 56% of them agreed that they just use water or maybe 1 product. [Take Poll] Until you know what works best for your skin, experiment with different products and routines, then adjust to match your skin’s needs."
    },
    {
      "title": "Apply a targeted acne treatment if you need it.",
      "content": "Apply a targeted acne treatment if you need it. There are a lot of different products that treat acne, and there's no one right answer for what will work for you. If you tend to have a lot of breakouts, you might prefer a product you spread all over your face, for instance. If you only get an occasional blemish, you might prefer a spot treatment that you can put right where you need it. Regardless, apply the treatment after you wash your face, but before you put on moisturizer. Two of the most popular ingredients in over-the-counter acne treatments are benzoyl peroxide and salicylic acid. Benzoyl peroxide helps wipe out the bacteria that causes acne, while salicylic acid eases inflammation and unclogs your pores. [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Be patient—it can take several weeks for acne treatments to work. Give a product at least 4 weeks before you switch to a new one. If you use an acne-fighting face wash, you probably don't need any other products. Talk to your dermatologist if a single product isn't working well enough."
    },
    {
      "title": "Moisturize with an oil-free lotion or cream every night.",
      "content": "Moisturize with an oil-free lotion or cream every night. Washing your skin strips it of its natural oils. While that's kind of the point, it's important to add some of that moisture back. Finish up your nighttime routine by smoothing on a thin layer of non-comedogenic facial moisturizer—that will help your skin look radiant and plump in the morning! [9] X Expert Source Adarsh Vijay Mudgil, MD Board Certified Dermatologist & Dermatopathologist Expert Interview. 8 October 2020. You can use a night cream, if you'd like, although a plain moisturizer will also work. [10] X Research source Look for ingredients like ceramides and niacinamide, which will help strengthen your skin's protective barrier. If you have dry skin, choose a heavier cream labeled as \"moisturizing\" or \"hydrating.\" You might think you don't need to moisturize your skin if it's oily, but it's actually really important! If you don't, your skin will overcompensate by producing even more oil. Just stick to something lightweight, like a gel or water-based product. [11] X Research source"
    },
    {
      "title": "Don't pop your pimples if you have them.",
      "content": "Don't pop your pimples if you have them. If your new nighttime routine has you spending extra time in the mirror focusing on your skin, you might be especially tempted to squeeze any pimples you might see. Do your best to resist that urge! Popping pimples can push the infection deeper into your skin, which can make the inflammation a lot worse in the long run. [12] X Research source Use a spot treatment to help the pimple heal on its own. However, if you need to speed up the healing process or you're dealing with a major breakout, see your dermatologist for an extraction. Don't pick at blackheads, either—it can lead to inflammation and scarring. Try using a face wash with glycolic acid or salicylic acid to get rid of them, instead. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To help prevent breakouts, keep your skin clean and moisturized, and try not to touch your face throughout the day, since the oils and bacteria on your hands can cause breakouts. https://kidshealth.org/en/teens/skin-tips.html"
    },
    {
      "title": "Wash your face with a cleansing brush for a deeper clean.",
      "content": "Wash your face with a cleansing brush for a deeper clean. Cleansing brushes can make washing your face seem more fun, which might make you inclined to do it more often. If you do want to use one, choose one with soft bristles—stiff bristles will just irritate your skin! [14] X Research source If you have sensitive skin, even a soft brush might be a little too harsh. If you notice any redness or tenderness after you use it, switch back to washing your face the old-fashioned way. [15] X Research source Some brushes are battery-operated and some are manual. The difference is really a personal preference, kind of like choosing a toothbrush! Keep in mind that since your cleansing brush will exfoliate the dead skin from the surface of your face, you probably shouldn't use any additional exfoliants."
    },
    {
      "title": "Try an alcohol-free toner to rebalance oily skin.",
      "content": "Try an alcohol-free toner to rebalance oily skin. Toners aren't strictly necessary, but some people swear by their ability to help restore your skin after you wash it. If you do use a toner, put a little on a cotton ball and swipe it onto your skin after you wash your face, but before you apply your acne treatment or moisturizer. [16] X Research source Look for a toner with nourishing ingredients like antioxidants, hyaluronic acid, or ceramides. Avoid harsh toners with ingredients like alcohol, witch hazel, or any strong fragrance—they'll just dry out your skin."
    },
    {
      "title": "Add in a serum to add extra moisture to dry skin.",
      "content": "Add in a serum to add extra moisture to dry skin. Serums typically contain highly-concentrated ingredients. If you have a skincare issue you need to address, like an uneven or dull complexion, a serum can be a great way to get a more targeted treatment. Apply your serum right before your regular moisturizer. [17] X Research source For instance, if you tend to have patchy, dry skin, you might apply a hydrating serum just to that area, then use a lightweight moisturizer on the rest of your face."
    },
    {
      "title": "Treat yourself to a face mask about once a week.",
      "content": "Treat yourself to a face mask about once a week. Face masks are an indulgent way to hydrate and nourish your skin, but they aren't meant to be used every day. Try making them a part of your weekend routine, or use them to perk up your Tuesdays if you want! Put on the mask after you wash your face, but before you put on any other products. [18] X Research source The directions will vary depending on the mask you choose—some are supposed to dry on your face to draw out impurities, while others should be washed off after only a few minutes so they don't dry out your skin. Buy a face mask that's made for your particular skin type, or make your own by mixing up some nourishing ingredients from your kitchen. For instance, you can hydrate dry skin by mashing up 1 avocado and mixing it with 1 tbsp (15 ml) of honey and a handful of oats. If you're having an acne breakout, avoid using a mask, as this could irritate your skin even more."
    },
    {
      "title": "Exfoliate your skin about once a week.",
      "content": "Exfoliate your skin about once a week. Dead skin cells can build up on the surface of your skin, giving your face a dull texture. [19] X Expert Source Adarsh Vijay Mudgil, MD Board Certified Dermatologist & Dermatopathologist Expert Interview. 8 October 2020. Swipe on a gentle chemical exfoliant once a week to help dissolve these skin cells, leaving your skin glowing and bright. Chemical exfoliants might sound scary, but they're actually a lot gentler than harsh scrubs. You should definitely never use a scrub if you're struggling with acne—it will make the inflammation worse. Looking for a budget-friendly option? Use an acne-fighting pad that contains salicylic acid—also known as the chemical exfoliant BHA. Just run the pad lightly over your face, then let your face dry completely. Remember to moisturize after you're done!"
    }
  ]
}