{
  "url": "https://www.wikihow.com/Greet-People-in-Indonesia",
  "title": "Indonesian Greetings: How to Say Hello, Goodbye, and More",
  "steps": [
    {
      "title": "Use halo or apa kabar? to greet someone casually.",
      "content": "Use halo or apa kabar? to greet someone casually. Halo literally means “hello,” while apa kabar? means “how are you?” If you greet a person using apa kabar?, their answer will most likely be baik (good) or kurang baik (not good). [1] X Research source Both halo and apa kabar are used in casual situations among family and friends, so they aren’t appropriate greetings in formal settings or with strangers."
    },
    {
      "title": "Use selamat pagi in the morning and selamat siang/sore later in the day.",
      "content": "Use selamat pagi in the morning and selamat siang/sore later in the day. Selamat pagi means “good morning,” while selamat siang and selamat sore both mean “good afternoon.” Typically, you’d use selamat siang between 11 am and 3 pm and selamat sore between 3 pm and 6 pm. [2] X Research source Say selamat malam to greet someone with “good evening,” but it can’t be used to say goodbye to someone at the end of the night. Note that the 'e' in selamat is not pronounced. To pronounce it correctly, say “slamat.” When saying “good morning” in Indonesia, you can also omit the selamat completely and say pagi. This is similar to English, where “good morning” is often shortened to “morning.” When saying “good afternoon” in Indonesia, be careful to pronounce the “i” in siang as a long “ai” instead of “ee.” Otherwise, it’ll seem like you’re saying “sweetheart.” [3] X Research source"
    },
    {
      "title": "Ask someone’s name with the phrase Nama kamu siapa?",
      "content": "Ask someone’s name with the phrase Nama kamu siapa? Introduce yourself by saying nama saya ______, filling in the blank with your name. After introducing yourselves, it’s polite to say “nice to meet you,” or salam kenal. [4] X Research source"
    },
    {
      "title": "Say goodbye with selamat tinngal or sampai jumpa.",
      "content": "Say goodbye with selamat tinngal or sampai jumpa. The most common phrase for goodbye, selamat tinngal, can be used with both friends and strangers in any situation, formal or informal. Sampai jumpa, on the other hand, should only be used when you’re likely to see the other person again, like how you would use the English “see you later.” [5] X Research source If you’re saying goodbye because you’re going to sleep, use selamat tidur, which is different from the “good evening” greeting, selamat malam ."
    },
    {
      "title": "Gently shake someone’s hand when meeting for the first time.",
      "content": "Gently shake someone’s hand when meeting for the first time. Use a medium to soft handshake grip, as the firm handshake used in Western cultures may be seen as rude or aggressive. [6] X Research source Use your right hand to shake, as the left is considered unclean. [7] X Research source Smile! Indonesians are, as a whole, open and friendly people. Smiles will do magic to oil social interactions with them. A slight nod or bow is also a common practice. Bowing should not be equated with subservience but with extreme politeness. Westerners should not let it bother them. In some faiths, like Islam, followers won’t touch people of the opposite gender except for family members. If you’re unsure, let the other party initiate the handshake, and don’t take it personally if they don’t shake your hand."
    },
    {
      "title": "Perform a common Indonesian greeting called the salam.",
      "content": "Perform a common Indonesian greeting called the salam. Begin the salam by holding out both hands and gently touching the other person’s hands. They may loosely hold your hands for a few moments. Bring your hands back to your chest. This action shows sincerity and that your greeting comes from the heart. [8] X Research source The sembah is another traditional greeting in Bali and other areas of Hindu-Buddhist heritage. Join your palms together and position them vertically against your chest. [9] X Research source Bow slightly and use an appropriate greeting in the Indonesian language. The sembah is typically used when entering someone’s home."
    },
    {
      "title": "Use the appropriate honorific before a person’s name.",
      "content": "Use the appropriate honorific before a person’s name. The main honorifics in Bahasa Indonesia are Mas, Pak, Bu and Mbak. In formal situations, use Bapak (“Sir” or “Mister”) to address an adult male and use Ibu (“Madam” or “Mrs.”) to address an adult female. [10] X Research source When in doubt, you can safely address men by Pak and women by Bu, which are the shortened versions of Bapak and Ibu. Coworkers and friends who are around the same age typically address each other as Mbak (older sister) or Mas (older brother). For example, a middle-aged person named Djoko might be addressed as Bapak Djoko."
    },
    {
      "title": "Address people in Indonesia by their first name.",
      "content": "Address people in Indonesia by their first name. Indonesian people do not always use surnames or family names. If a person is named Arif Perdana, it does not mean his family name is Perdana. Feel free to call him Pak Arif . Some Indonesians are even named with one single first name, without a middle name or family name. Don’t be offended if an Indonesian person you barely know addresses you by your first name. Indonesian people use first name basis in daily life with whomever they meet. The exceptions are married women, nobles, and royalty."
    },
    {
      "title": "Address a married woman with the name she introduced herself with.",
      "content": "Address a married woman with the name she introduced herself with. Married women will likely use their husband’s name, but they will introduce themselves with whatever name they prefer. Add Bu or Ibu before her name when addressing her."
    }
  ]
}