{
  "url": "https://www.wikihow.com/Make-Fire-Without-Matches-or-a-Lighter",
  "title": "9 Quick and Easy Ways to Start a Fire by Yourself",
  "steps": [
    {
      "title": "Ignite a spark with a bundle of steel wool, a 9V battery, and tinder.",
      "content": "Ignite a spark with a bundle of steel wool, a 9V battery, and tinder. First, begin by making a small tinder nest out of dry grass, leaves, or sticks. Grab a 9-volt battery and rub the two circular receiving prongs against a piece of steel wool to create friction. You may need to do this a few times before you see a spark. [1] X Research source Gently blow on the steel wool to encourage the flame to grow and spread. Carefully transfer the steel wool to your tinder nest, blowing lighting until the tender catches. Add larger pieces of dry wood to continue building your fire."
    },
    {
      "title": "Place char cloth on a piece of flint, quickly striking a blade against it.",
      "content": "Place char cloth on a piece of flint, quickly striking a blade against it. Build a tinder nest using dry plant material. Take a flint rock and hold it between your thumb and forefinger. Use a piece of char cloth or lightweight tree fungus as charcoal. Quickly scrape the back of a steel striker or knife blade against the flint until sparks fly. Catch the sparks with the char cloth until it glows like an ember. Transfer the cloth to the tinder nest and gently blow it to induce a flame. [2] X Research source Generally, you can find flint in the Southeast and Midwest along river beds or in limestone. Flint is often a black or grey color with a glassy look on its surface. [3] X Research source You do not need to use char cloth. However, when striking your blade against the flint, aim the sparks towards the tinder so it can catch."
    },
    {
      "title": "Create friction with a spindle against a piece of wood.",
      "content": "Create friction with a spindle against a piece of wood. Find a piece of wood to use as the base of your hand drill, also called a fireboard. Cut a small, V-shaped notch in the center of your board with a knife. Place small pieces of bark beneath the notch. Then, place a .5-inch wide stick (spindle) into the notch. Rub the stick between your two flat palms, pressing firmly into the board until embers form. [4] X Research source Transfer the glowing embers to your tinder nest. Blow gently to create a flame."
    },
    {
      "title": "Make a bow using a flexible stick and string.",
      "content": "Make a bow using a flexible stick and string. Use a shoelace string, roots, or plant fibers to make a long string that attaches to each end of the flexible stick. Find a piece of wood for the base, carving a V-shaped notch with tinder or kindling placed over it. Place the stick in the middle of the notch, keeping it in place with a rock, while moving the bow back and forth in a sawing motion until a flame catches. [5] X Research source"
    },
    {
      "title": "Add a small amount of tinder into a fire piston to ignite a flame.",
      "content": "Add a small amount of tinder into a fire piston to ignite a flame. A fire piston is a small cylinder that compresses air to create heat. Insert a small amount of tinder or char cloth into the piston. Press the plunger rapidly to ignite the tinder. You may need to take a small stick or a knife to dig the flame out of the piston, transferring it to a bundle of tinder. Offer a slow and steady breath to nurture the flame. [6] X Research source"
    },
    {
      "title": "Use focused light from the sun to start a fire.",
      "content": "Use focused light from the sun to start a fire. Be sure it's a bright day with minimal clouds; otherwise, this method won't work. To create a fire with a magnifying glass , tilt a magnifying glass toward the sun until a small circle of focused light appears. Hold the lens over a small bundle of tinder until it begins to smoke and flame. You may have to try different angles to create the most focused beam of light possible. Blow lightly to nurture the flame. [7] X Research source You can also use eyeglasses or binocular lenses if you don't have a magnifying glass on hand. It may help to add a few drops of water to the lens to create a more intense beam of light."
    },
    {
      "title": "Use a clear piece of ice to create the shape of a lens.",
      "content": "Use a clear piece of ice to create the shape of a lens. You may need to shave the sides of a piece of ice with a knife, cement, or a stone to create a circular shape. Use the warmth of your hands to melt the ice lens smoothly. Then, hold your ice lens perpendicular to the sun to focus a beam of light on your tinder as you would with a magnifying glass. Wait until you see smoke, then the tinder will ignite. [8] X Research source Avoid dripping water onto the tinder, as this can prevent a flame from sparking."
    },
    {
      "title": "Use a resealable bag and water to create a lens.",
      "content": "Use a resealable bag and water to create a lens. Fill a resealable bag half-full with water. Twist the bag until it forms a liquid sphere, and hold it into the sun. You may have to adjust your angle until you get a steady, strong beam of light, like with an ice or glass lens. Aim the light on top of the tinder and hold the bag steady until the tinder starts to smoke and ignites. [9] X Research source You can also use urine if you don't have enough water."
    },
    {
      "title": "Potassium permanganate and glycerine create a chemical fire.",
      "content": "Potassium permanganate and glycerine create a chemical fire. Grab a flat rock and pour a quarter-size amount of Potassium Permanganate. Add equal amounts of glycerine and wait a few minutes. You can add a couple of drops of water to speed up the process, but wait for the mixture to burst into flames. [10] X Research source You may want to take a step back for this one! You can also use sugar instead of glycerine."
    }
  ]
}