{
  "url": "https://www.wikihow.com/Know-if-You-Should-Replace-Your-Refrigerator",
  "title": "How to Know if You Should Replace Your Refrigerator",
  "steps": [
    {
      "title": "Replace a fridge that would require expensive repairs.",
      "content": "Replace a fridge that would require expensive repairs. [2] X Expert Source Aaron Beth Appliance Technician Expert Interview. 14 July 2020. As a rule of thumb, if repair costs are 50% or more of the cost of a new fridge, you should buy a new fridge. There are two main reasons to do so. First, as refrigerators age, they will need more and more repairs. Second, replacing an older refrigerator allows you to get a more efficient model that will reduce your energy costs. [3] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Lean towards repairs on younger fridges.",
      "content": "Lean towards repairs on younger fridges. Different types of fridges are more prone to needing repairs and have varied overall lifespans. For instance, built-in refrigerators are generally worth repairing. In general, however, any fridge that is only a year or two old is worth repairing. [4] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Default to repairs depending on the type of the fridge.",
      "content": "Default to repairs depending on the type of the fridge. Side-by-side fridge and freezer appliances are usually worth repairing for the first five years of their life, and fridges with bottom freezers are usually worth repairing for seven years or so. Fridges with freezers on top can usually be repaired within the first three years of their life, but may need to be replaced in seven years or less. [5] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Retire fridges older than 10 years.",
      "content": "Retire fridges older than 10 years. Refrigerators are expected to last between 10 and 20 years. If yours is at least 10 years old and has begun to have issues, it's simply time for a replacement. Not only will repairs on older models be more expensive, but the fridge will also likely need additional repairs sooner than later, and a newer model will be more energy efficient. [6] X Research source"
    },
    {
      "title": "Consider downsizing whenever possible.",
      "content": "Consider downsizing whenever possible. If you find that you are not using all of the space in your present refrigerator, consider replacing it with a smaller model. For instance, if your children have grown up and moved out, you may find that a full-size fridge is no longer necessary for your household."
    },
    {
      "title": "Replace fridges with interior wall damage.",
      "content": "Replace fridges with interior wall damage. Another cause of condensation or frost may be a crack in the interior shell of your refrigerator. These cracks will allow cold air to escape and are extremely hard to repair. If your refrigerator is still under warranty, contact the retailer or manufacturer to see about getting a replacement. [7] X Research source It may be worth contacting an appliance repair professional before deciding to replace the fridge, but cracks in the shell usually mean the appliance will need to be replaced."
    },
    {
      "title": "Test the door seal if you find condensation.",
      "content": "Test the door seal if you find condensation. If water is collecting on any surface of your fridge, including the exterior, this may be a sign that the door seal is no longer airtight. Excessive frost in the freezer or on the exterior of the fridge may also indicate a faulty seal. [8] X Expert Source Aaron Beth Appliance Technician Expert Interview. 14 July 2020. Look at the rubber gasket all the way around the door to ensure it hasn't come loose somewhere. If so, you may be able to push it back in. Test the seal in multiple spots by closing the door onto a piece of paper money. Try to pull the bill out of the door slowly. If it easily slides out, you may be able to fix the fridge by replacing the rubber gasket that runs around the edge of the door."
    },
    {
      "title": "Replace the seal yourself",
      "content": "Replace the seal yourself . You may be able to replace your refrigerator's seal yourself. You can likely get a kit that contains the materials necessary to do so from your local hardware store or an online retailer. [9] X Research source Be sure any kit you purchase is compatible with your fridge. You may have to order a special kit from the refrigerator's manufacturer. Kits to replace the gasket on most refrigerators cost about $50."
    },
    {
      "title": "Have a pro look at a noisy fridge.",
      "content": "Have a pro look at a noisy fridge. You shouldn't be able to hear your fridge running all of the time. This indicates the motor is going at full blast trying to keep the fridge cold. If a fridge is running properly, the motor will only run periodically. [10] X Research source Note that your fridge's motor will run more often if the door is frequently opened. For instance, if you're having a party and people are going in and out of the fridge, the motor will run more frequently."
    },
    {
      "title": "Feel the air behind the fridge.",
      "content": "Feel the air behind the fridge. If you feel excessive heat coming from your fridge, have an appliance repair professional come take a look at it. There are coils on the back of the fridge that release heat regularly, but it shouldn't be too noticeable unless you're nearly touching the insulation that covers the coils. [11] X Research source If the fridge is emanating heat, it likely needs new coils. Weigh the cost of repairing your fridge against buying a new one. It is often worth buying a newer, more efficient fridge in these cases."
    },
    {
      "title": "Pay attention to the fridge's temperature.",
      "content": "Pay attention to the fridge's temperature. If you notice food going bad more quickly than expected, or that you have to keep turning the fridge's thermometer down to keep items cool, your fridge has probably become less efficient. [12] X Research source Whenever you notice a fridge is not working as well as it used to, have it looked at by a professional. For instance, a freezer that's running too cold is also an issue. Even if it is still working, the fridge may be using more energy than it should, not to mention increasing your energy costs."
    }
  ]
}