{
  "url": "https://www.wikihow.com/Keep-Rabbits-out-of-Your-Garden-Organically",
  "title": "How to Keep Rabbits out of Your Garden Organically",
  "steps": [
    {
      "title": "Fill a large container with water.",
      "content": "Fill a large container with water. A 1 gallon (4 liter) milk jug works well. Warm water will help your repellent mix faster, but cold water works fine too."
    },
    {
      "title": "Add a little dish soap.",
      "content": "Add a little dish soap. Squeeze in a little dish soap, about 1 tbsp (15 mL). This will help your mixture stick to your plants. This also causes the repellent to mix through the water, instead of floating on top."
    },
    {
      "title": "Shake in a spoonful of hot sauce or crushed red pepper.",
      "content": "Shake in a spoonful of hot sauce or crushed red pepper. If you are using a gallon (4 L) jug, mix in 1 tbsp (15 mL) hot sauce. If you have a smaller, 1 quart (1 L) jug, add 1 tsp (5 mL) instead. Close the lid and shake to combine."
    },
    {
      "title": "Add 5 crushed garlic cloves to the mixture.",
      "content": "Add 5 crushed garlic cloves to the mixture. Leave the bottle in the sun to speed up mixing. [1] X Research source"
    },
    {
      "title": "Transfer to a spray bottle.",
      "content": "Transfer to a spray bottle. If you have a large garden, you may wish to purchase a large garden sprayer from a home improvement store or gardening store. Otherwise, any spray bottle will do. Be cautious when using spray bottles that once contained commercial cleaning products. If the label warns against reusing the bottle, it may cause harm to the rabbit, plants, or people who eat the plants."
    },
    {
      "title": "Spray in the early evening.",
      "content": "Spray in the early evening. Most rabbits feed at night, so spray your plants shortly before the sun goes down. Spray any plants the rabbits have been feeding on. When the rabbits taste or smell the unpleasant substance, they should stop feeding. If you know where the rabbits enter the garden, you can spray the plants at that border. They may give up and turn around. Some plants may get \"scars\" on their leaves from this spray. If this happens, spray on the ground around the plant instead."
    },
    {
      "title": "Reapply regularly.",
      "content": "Reapply regularly. Spray the plants again every two or three days. Spray again any time rainfall or heavy dew washes off the mixture. Once there are no bite marks on your plants, the rabbits have learned their lesson and you can stop spraying those plants. This may take a few weeks, but in the meantime the rabbits shouldn't be eating enough to cause damage. If the rabbits are relentless, adjust your recipe to be more potent by adding more garlic. Don't add more soap, as this could damage the plants."
    },
    {
      "title": "Use other spicy materials.",
      "content": "Use other spicy materials. Just about any spicy materials will keep rabbits away. Always dilute them in soapy water to minimize harm, and so they will stick to the plant. Here are appropriate amounts to add to 1 gallon (4 liters) water: [2] X Research source Five to eight cloves crushed garlic 1–2 tsp (5–10 mL) crushed red pepper A few grinds of black pepper A mixture of the above may work best of all."
    },
    {
      "title": "Consider raw eggs.",
      "content": "Consider raw eggs. Rabbits dislike the smell of raw eggs, although they may get used to it over time. Shake the egg in a spray bottle with a wide nozzle and spray it onto the plants or around the border to your garden. This may attract other pests, such as ants."
    },
    {
      "title": "Try blood meal or bonemeal.",
      "content": "Try blood meal or bonemeal. These are available from gardening supply stores, for sprinkling on the soil around plants. Made from ground animal parts, they may keep rabbits away. These break down quickly when wet, so they are more effective in dry conditions. [3] X Research source Blood meal adds nitrogen to the soil, promoting green, leafy growth. Apply only during the growing season, and never to legumes. [4] X Research source Bone meal adds phosphorus to the soil, promoting root health. This is usually not necessary in home garden soil, and may even be detrimental if phosphorus is already high. Do not apply to Protea plants."
    },
    {
      "title": "Purchase predator urine.",
      "content": "Purchase predator urine. Spraying predator urine around a garden can keep rabbits and other prey animals away. How effective this is varies greatly depending on predator species, rabbit species, diet of the predator, and other difficult-to-find variables. Unfortunately, research on this topic is limited, but coyote and fox urine are the most commonly used options. You may wish to research the company before buying the product, to find out whether the urinating animals were humanely treated."
    },
    {
      "title": "Try commercial organic products.",
      "content": "Try commercial organic products. Most of these products use similar ingredients to those described above. Check the label for information on weather resistance, since this is the main advantage over home solutions."
    },
    {
      "title": "Plant rabbit-resistant plants.",
      "content": "Plant rabbit-resistant plants. This is usually an unreliable solution, and requires either replacing all tasty plants or planting a barrier around the entire garden. Some plants will still be eaten by young rabbits, or certain rabbit species. Ideally, get specific advice from a local university extension, to find plants that grow in your climate and deter rabbit species in your area. Yarrow, foxglove, digitalis, lilac, elderberry, and yucca have all been described as rabbit-proof plants — but again, this is no guarantee."
    },
    {
      "title": "Create a chicken wire fence.",
      "content": "Create a chicken wire fence. Any mesh fencing with 1\" (2.5 cm) holes or smaller should keep rabbits out of the garden. Place this around tree trunks or flowerbeds, or around the entire garden. Follow these guidelines to make sure the rabbits can't jump over or dig under: Bury the fence 4–6 inches (10–15 cm) deep. Not all rabbit species burrow, but better safe than sorry. Bend the base of the fence. Bending the buried end of the fence 90º outward makes burrowing much more difficult. Leave 2 feet (0.6 m) above the surface, or 3 ft (0.9 m) if you live near jackrabbits."
    },
    {
      "title": "Check local law before using traps.",
      "content": "Check local law before using traps. Even live traps can often cause injury to rabbits, and may cause health and legal problems as well. Due to rabbit-borne diseases, it may be illegal to handle or release wild rabbits in your area. Talk to your local extension office, agriculture office, or center of local government before using traps."
    },
    {
      "title": "Choose a trap based on species.",
      "content": "Choose a trap based on species. Traps are usually ineffective for jackrabbits. For cottontails (the most common small rabbit species), you'll need a trap with a 7 inch (18 cm) door. Bait the trap with cabbage, dried fruit, or flowers. Traps work best in winter or early spring, when food is scarce. If you're using lethal traps to reduce rabbit population, hunting is usually a more effective solution. Check local laws to find out if rabbits are a game species in your area."
    }
  ]
}