{
  "url": "https://www.wikihow.com/Make-a-Caterpillar-Habitat",
  "title": "How to Make a Caterpillar Habitat",
  "steps": [
    {
      "title": "Find a suitable container.",
      "content": "Find a suitable container. The first step to create a caterpillar habitat at home is to find a suitable container in which you can create a nice environment for your caterpillar. There are a wide variety of ways you can do this, including a well-ventilated glass tank, a plastic container, or even by using a couple of 1 liter plastic soda bottles. [1] X Research source The size of the container depends on the number of caterpillars that you will have living in the container. As a general rule, each caterpillar should have at least three times their body size in extra floor space. A container for 10 6cm long caterpillars should be at least 25x25cm of floor space. Caterpillars don’t tend to move around that much, but every caterpillar should be able to feed without coming into contact with the others. [2] X Research source Although you can raise a bunch of them together, it's important that you don't end up with a cage so full of caterpillars, or they might crowd each other out and not get enough food."
    },
    {
      "title": "Prepare the container.",
      "content": "Prepare the container. To make your container suitable for caterpillars you need to ensure that it’s well ventilated, has a little humidity, and that the caterpillars can’t crawl out of it. To keep it ventilated, punch lots of small holes in the lid of a plastic container. They should be big enough for air to pass through, but small enough that the caterpillar can’t escape. To make the habitat a little more humid, you can place a moistened paper towel inside the container. [3] X Research source Don’t add any open water into the container, as a caterpillar can easily fall in and drown. [4] X Research source"
    },
    {
      "title": "Add the caterpillar’s host plant.",
      "content": "Add the caterpillar’s host plant. Caterpillars don’t have complex needs, but you do need to make sure they have a constant supply of their host plant for feeding. The host plant is the plant that the caterpillar eats, and tastes can vary significantly across breeds. If you take a caterpillar you found in the wild, look at what plant he is on, and bring that too. Some common host plants include Aster, Hollyhock, Sunflower, Snapdragon, and Violet. [5] X Research source If you know the details about your caterpillar, you can search for host plants via the website of London’s Natural History Museum. Caterpillars will typically get most of their moisture from these plants, but you can wash the leaves with clean water to leave some extra moisture for them. You can add individual twigs and leaves, or a potted plant. If you add a potted plant, make sure it is kept watered, but also make sure that there is no standing water that could potentially be a drowning hazard. [6] X Research source"
    },
    {
      "title": "Avoid direct sunlight.",
      "content": "Avoid direct sunlight. The next step is deciding where to place your caterpillar habitat. There is a risk of your caterpillars drying out if they are in a place with too much heat, so don't place the container in direct sunlight, such as on a sunny windowsill. [7] X Research source Heating in the winter and air conditioning in the summer may also dry out the atmosphere and potentially harm your caterpillars. You can keep them in an unheated place, such as a garage, or introduce more moisture to their environment by placing a moist paper towel in the container. [8] X Research source"
    },
    {
      "title": "Clean the habitat regularly.",
      "content": "Clean the habitat regularly. Perhaps the biggest potential health problem for your caterpillars comes from their own poop (or frass). If you have an enclosed caterpillar environment, it is especially important that you pay close attention to this. In an enclosed environment, the frass will not dry out properly as it would in an open air environment. In a closed container, you should be checking and cleaning out frass every day. [9] X Research source You may want to place some tissue paper or a paper towel on the bottom of the container to help catch and absorb frass. You should still change this paper daily. [10] X Research source A more well-ventilated container could be cleaned of frass once a week. It’s important to monitor it closely and react accordingly. [11] X Research source"
    },
    {
      "title": "Find a bucket or open container.",
      "content": "Find a bucket or open container. Caterpillars don’t tend to move around too much once they find a good place to feed, so it’s perfectly possible to have a habitat that is open. A caterpillar habitat could be as simple as a single potted plant placed on a table, but if you want to have a bit more control of where your caterpillars can crawl to, find an open bucket or container. If you have a clear container, this will make it easier for you to observe the caterpillars. Make sure it’s clean, but doesn’t have any lingering cleaning substances on the surfaces."
    },
    {
      "title": "Add the host plant.",
      "content": "Add the host plant. Next you need to add the host plant to the container. You can do this in a variety of ways, such as just placing a potted plant into the bucket or container, or making some cuttings and placing them inside. Whichever method you use, make sure the leaves are a little damp to add some moisture. [12] X Research source If you are adding a whole plant, make sure the plant is healthy and will continue to thrive and grow. A plant will still need light to photosynthesis and remain healthy and a good food source for the caterpillars."
    },
    {
      "title": "Consider adding a screen or net.",
      "content": "Consider adding a screen or net. If you are opting for an open container, you might consider adding a mesh, screen or net over the top of the plant or container. Your caterpillars may attract attention from predators and parasites in and around your home, such as spiders. Adding a net, such as a butterfly net, over the container or the plant can reduce the risk of this. You will struggle to completely eliminate the danger of predators and especially parasites and parasitoids. [13] X Research source Regularly cleaning away frass can help, as spiders are drawn to the smell. [14] X Research source"
    },
    {
      "title": "Maintain the habitat.",
      "content": "Maintain the habitat. Once you have built up your caterpillar habitat, it’s important that you pay close attention to it. This means regularly cleaning out frass, adding fresh cuttings from the host plant, and ensuring the environment is not too dry. This is a bit of work, but it also gives you time to enjoy observing the caterpillars as they prepare to pupate. You can always add some extra things, such as pebbles or more greenery. Remember that once your caterpillar has found a good place to eat, he won’t be too interested in exploring. Try to avoid handling the caterpillars as much as possible. If you do need to handle them make sure your hands are clean, and ensure that you have rinsed off any excess soap. [15] X Research source"
    },
    {
      "title": "Recognise when your caterpillars are looking to pupate.",
      "content": "Recognise when your caterpillars are looking to pupate. Once your caterpillars have reached maturity and the last stage of their development, it will begin looking for a place to pupate. You may notice your caterpillars being more active than usual as they move around looking for a good spot to make their cocoon. [16] X Research source When it is ready to pupate, the caterpillar may move away from the host plant. Remaining near the host plant can make it especially vulnerable to predators, so he may look for an unusual spot. He will find a place to attach himself to form a cocoon, or, in the case of some species, he will dig into the ground and pupate there. [17] X Research source"
    },
    {
      "title": "Make sure he has a good environment.",
      "content": "Make sure he has a good environment. You should try to provide plenty of suitable places for your caterpillar to pupate in your container. Put some extra twigs in, and add a fresh layer of soil. Give him options and spots that are a little bit away from the host plant. For most butterfly species you should supply a vertical surface, such as a twig. For moths, you should give them some leaf litter or loose soil. [18] X Research source"
    },
    {
      "title": "Determine whether to move the chrysalis.",
      "content": "Determine whether to move the chrysalis. In some cases it might be necessary for you to move the chrysalis once it has formed. This should not be taken lightly, but it can be done safely if you are careful. When he emerges as a butterfly, it’s essential that he has enough space to fully unfold his wings. He needs space to stretch out and dry his wings or he won’t be able to fly and may fall and die. [19] X Research source If the pupae is on a stick that you can move, try to carefully move it to a more open space in the container. You might be able to make more space by removing other leaves and twigs while leaving the cocoon itself untouched. If you have to move a cocoon, moisten the silk that attaches it to the surface and very carefully pull it free. [20] X Research source Be sure you keep it the right way up and attach it to a string or stick that has more room. You can use a straight pin to attach it, or some glue that is warm and tacky but not hot."
    },
    {
      "title": "Monitor the chrysalis.",
      "content": "Monitor the chrysalis. Once your caterpillar has found his chosen spot and begun to pupate you should keep an eye on him. Not only will you be able to observe an amazing process of transformation, but you can also keep an eye out for any potential predators or parasites. Once he is in his cocoon he has no real defence, so if you have an open container he is very vulnerable. Most caterpillars will stay in their cocoon over the winter, so if they pupate in the fall, they will likely remain in there for months. He could, however, only be in his cocoon for a matter of days before emerging, so it’s important to pay attention. Remember that throughout this time they are still alive and still require some care. An occasionally misting of the container with water, or the addition of a wet paper towel will help provide the moisture he needs. [21] X Research source"
    },
    {
      "title": "Help him release safely.",
      "content": "Help him release safely. When he is about to break out of the cocoon you may notice a change to the colour of the pupae. This can happen just a few hours before he emerges. The actual emergence happens very quickly, but then you will be able to observe him stretching and drying out his wings for a couple of hours. Make sure he has plenty of space to expand his wings. [22] X Research source The butterfly will fly when he is ready, and then you have to choose whether to keep him, or release him into the wild. You should only release him if he is a native to your country. [23] X Research source"
    }
  ]
}