{
  "url": "https://www.wikihow.com/Make-a-Flower-Crown",
  "title": "Make 3 Types of Flower Crowns for All Occasions",
  "steps": [
    {
      "title": "Measure your head and add 2 inches (5.08 centimeters).",
      "content": "Measure your head and add 2 inches (5.08 centimeters). If you are going to be wearing this wreath over a hairstyle (such as for a wedding), get your hair into that style first and then measure your hair. Some hairstyles, such as French braids and braided crowns, can add bulk to your head."
    },
    {
      "title": "Cut a piece of sturdy wire according to that measurement.",
      "content": "Cut a piece of sturdy wire according to that measurement. Try to use some thicker floral, like the kind that has paper around it. This will help the florist's tape stick better to it. Do not use scissors to cut the wire or you will dull them. Use wire cutters instead."
    },
    {
      "title": "Make a ring with the wire and overlap the ends by 1 inch (2.54 centimeters).",
      "content": "Make a ring with the wire and overlap the ends by 1 inch (2.54 centimeters). The ring should hold its shape. If it is too floppy, twist two to three strands of wire together, and make the ring again. This should make it sturdier."
    },
    {
      "title": "Wrap florist's tape around the overlapping ends to secure them.",
      "content": "Wrap florist's tape around the overlapping ends to secure them. You can also wrap some more tape around the entire wire ring. This will give you a base to work on. It will also make the color more consistent."
    },
    {
      "title": "Choose your flowers and cut the stems down to 1 to 2 inches (2.54 to 5.08 centimeters) below the bloom.",
      "content": "Choose your flowers and cut the stems down to 1 to 2 inches (2.54 to 5.08 centimeters) below the bloom. [1] X Research source Use scissors to cut real or dried flowers, and wire cutters to cut fake flowers. Try to cut all the stems down to the same length. This will make the crown neater in the end. Try using large, medium, and small flowers. This will give your crown some variety."
    },
    {
      "title": "Arrange the flowers in a pattern you like.",
      "content": "Arrange the flowers in a pattern you like. Don't tape the flowers to the base just yet. You want to get your design down first. It is easier to make changes while the flowers are still on the table. Try alternating between different shapes, sizes, and colors. Here are some more design ideas: Place the largest flowers in the top/front of the crown. Use smaller and smaller flowers as you go towards the back of the crown. Try having all the flowers pointing in the same direction, towards or away the top of the crown. The flowers don't have to be right up against each other. You can have them spaced as close together or as far apart as you want. Instead of attaching flowers all the way around the wire base, place them only on the top."
    },
    {
      "title": "Attach the first flower to the wire base.",
      "content": "Attach the first flower to the wire base. Hold the flower against so that the stem is laying horizontally alongside the wire. Wrap some florist's tape around the stem and the wire. Start just below the bloom, and keep wrapping until you are ½ inch (1.27 centimeters) past the end of the stem. Cut the tape and press the edge down to seal it."
    },
    {
      "title": "Lay the second flower just behind first one and secure it with florist's tape.",
      "content": "Lay the second flower just behind first one and secure it with florist's tape. Place it so that the bloom overlaps the first flower's. The closer together the two blooms are, the fuller and heavier your crown will look in the end. The further away the blooms are, the thinner and more delicate your crown will look."
    },
    {
      "title": "Continue placing and taping the flowers.",
      "content": "Continue placing and taping the flowers. Keep working your way around the circle, until you've used up all of the flowers you laid out in the beginning."
    },
    {
      "title": "Consider adding some ribbon.",
      "content": "Consider adding some ribbon. Fold several long pieces of ribbon in half and place them just behind the spot where the wires overlap. Leave about 1 inch (2.54 centimeters) of the loop just above the wire. Wrap the ribbon ends over the wire and down through the loop. Gently tug on the ribbons to secure them."
    },
    {
      "title": "Try on your crown and make any adjustments, if necessary.",
      "content": "Try on your crown and make any adjustments, if necessary. If you see any gaps or places where you want it to look more full, gently part the flowers, insert another one and tape it in place."
    },
    {
      "title": "Choose flowers with thin, flexible stems.",
      "content": "Choose flowers with thin, flexible stems. You want the stems to be at least 3 inches (7.62 centimeters) long. You can use just one type of flower, or a variety. Daisies and dandelions are classical, but you can also use alyssum or forget-me-nots. Flowering herbs, such as mint, thyme, oregano, chamomile, and lavender work as well. Not only will they look beautiful but, they will smell amazing."
    },
    {
      "title": "Cut the stems so that they are all the same length and trim off any leaves.",
      "content": "Cut the stems so that they are all the same length and trim off any leaves. This will make the flowers easier to braid and take off any unnecessary bulk."
    },
    {
      "title": "Put the flowers into a bowl filled with cool water.",
      "content": "Put the flowers into a bowl filled with cool water. This will keep the flowers fresh while you work. Braided flower crowns can take a while to make, and the picked flowers may wilt by the time you get around to using them."
    },
    {
      "title": "Hold three flowers and loosely tie them together using piece of floral wire.",
      "content": "Hold three flowers and loosely tie them together using piece of floral wire. Wrap a small piece of wire around the stems a few times, and snip the excess off. Try to get wire as close to the blooms as possible. You want all the blooms to be at the same level; if one sits higher than the other, your crown will look uneven. The wire will hold the flowers together while you braid them. If you don't have any floral wire, use twist ties or thread instead."
    },
    {
      "title": "Start braiding the stems together.",
      "content": "Start braiding the stems together. Take the left stem and pull it over so it ends up between the middle and right stems. Take the right stem and bring over so that it ends up between the left and middle stems. Keep doing this until your braid is 1 inch (2.54 centimeters) long. [2] X Research source"
    },
    {
      "title": "Add a flower to the left stem.",
      "content": "Add a flower to the left stem. The new flower should sit just beneath the one that is already in the braid."
    },
    {
      "title": "Bring both stems over so that they end up between the right and middle stems.",
      "content": "Bring both stems over so that they end up between the right and middle stems. Keep them together; they will count as one stem."
    },
    {
      "title": "Add a flower to the right stem.",
      "content": "Add a flower to the right stem. The new flower should sit just below the flower that is already in the braid."
    },
    {
      "title": "Bring both stems over so that they end up between the left and middle stems.",
      "content": "Bring both stems over so that they end up between the left and middle stems. Don't let the stems spread apart. Try to keep them together and think of them as one thick stem."
    },
    {
      "title": "Keep repeating the last few steps until you get the length you want.",
      "content": "Keep repeating the last few steps until you get the length you want. The sections you are braiding will get thicker and thicker as you continue to add flowers. Try using different types of flowers. This will add color, texture, and beauty. Don't be afraid to weave in a few leaves, vines, or grasses."
    },
    {
      "title": "Stop when the garland is just a few inches too big.",
      "content": "Stop when the garland is just a few inches too big. You want the garland to be a little large, because you will be overlapping the two ends. This will make the crown more secure in the end."
    },
    {
      "title": "Wrap some wire around the end of the garland.",
      "content": "Wrap some wire around the end of the garland. Place the wire just beneath the blooms of the last bunch of flowers. Wrap the wire around the end of the garland a few times, then snip the excess off with a pair of wire cutters. This will hold your flowers together and keep the garland from unraveling."
    },
    {
      "title": "Bring both ends of the garland together.",
      "content": "Bring both ends of the garland together. Overlap the ends until the crown sits comfortably on your head. Hold the two ends together as you take the crown off."
    },
    {
      "title": "Wrap wire around both ends to hold them together.",
      "content": "Wrap wire around both ends to hold them together. When you come across a flower, thread the wire underneath the bloom. You are binding just the stems together. Once the crown is secure, snip the excess wire off. Gently tuck both ends of the wire into the braided stems."
    },
    {
      "title": "Find a plastic or metal headband that fits you.",
      "content": "Find a plastic or metal headband that fits you. You will be gluing the flowers to this headband."
    },
    {
      "title": "Consider adding some ribbon to the headband.",
      "content": "Consider adding some ribbon to the headband. This will help conceal the headband's original color and give the glue something to grab onto. You can use any color of ribbon you want, but green might blend in with the flowers better. If you don't want a green ribbon, then try to match the color to the flowers you are using instead. There are two ways you can attach the ribbon: Choose a ribbon that is the same width as your headband. Cut it so that it is 2 inches (5.08 centimeters) longer than your headband. Center the ribbon on top of the headband, and hot glue it down. There will be an inch (2.54 centimeters) of ribbon handing off of each end. Cover both ends of the ribbon with glue, and fold them under the headband. Put a drop of hot glue onto one end of the headband. Press the end of a long piece of ribbon down onto the glue. Wrap the ribbon around the headband, like a candy cane. Start from one end and move towards the other. Try to overlap the ribbon slightly. This way, you will cover the headband entirely and not get any patches. Secure the end of the ribbon with a drop of glue."
    },
    {
      "title": "Choose some fake flowers, and pull the blooms off of the stems.",
      "content": "Choose some fake flowers, and pull the blooms off of the stems. If the bloom won't come off, use wire cutters to snip it off. Try to cut as close to the bottom of the flower as possible."
    },
    {
      "title": "Snip the bottom part of the stem off, if necessary.",
      "content": "Snip the bottom part of the stem off, if necessary. Sometimes, when you pull the blooms off the stems, you may get a little nub on the bottom part of the flower. This may keep the flower from laying flat against the headband. If you want the flower to lay flat, then snip this nub off. Don't snip too much off, however. This little nub helps hold the flower together. If you cut too much off, the flower may fall apart."
    },
    {
      "title": "Squeeze out some hot glue onto the bottom of your first flower.",
      "content": "Squeeze out some hot glue onto the bottom of your first flower. Swirl the glue around the base first, where the stem connects to the flower. Next, place a large drop of glue right on the bottom of the stem."
    },
    {
      "title": "Press the flower down onto the headband.",
      "content": "Press the flower down onto the headband. Hold it there until the glue starts to harden."
    },
    {
      "title": "Move onto the next flower when the glue dries.",
      "content": "Move onto the next flower when the glue dries. Try to place the flower as close as possible to the first one."
    },
    {
      "title": "Fill in any gaps with smaller flowers or leaves.",
      "content": "Fill in any gaps with smaller flowers or leaves. Put the glue directly onto the headband, and gently press the flower or leaf into the glue."
    },
    {
      "title": "Pull off any glue threads before wearing the headband.",
      "content": "Pull off any glue threads before wearing the headband. Sometimes, hot glue will leave behind long thread-like strands of glue. This can make even the most beautiful headband look messy. Carefully go over your headband, and gently pull off any strands."
    }
  ]
}