{
  "url": "https://www.wikihow.com/Make-Fried-Rice",
  "title": "How to Make Fried Rice",
  "steps": [
    {
      "title": "Cook 4 cups of white rice.",
      "content": "Cook 4 cups of white rice. Just place the rice in boiling water and cook it for the amount of time listed on the instructions. Some types of white rice can take just 10 or so minutes to boil, while others can take 30 minutes or more. You can also microwave instant rice in the microwave, but it may not be as tasty. Once done, you can fluff it up so that it does not stick. [1] X Research source"
    },
    {
      "title": "Prepare the vegetables.",
      "content": "Prepare the vegetables. First, wash 2 cups of carrots, 1 medium onion, 1 clove of garlic, one ginger root, and 1 cup of bean sprouts. Then, dice the carrots and onions, and mince just 1 tsp. of fresh ginger. Set these ingredients aside."
    },
    {
      "title": "Pour 2 tbsp.",
      "content": "Pour 2 tbsp. of vegetable oil into a large pan. The pan should be very deep, almost like a wok. [2] X Research source Place it over medium heat. Make sure the pan is clear of any trace of water, because the oil crackles and flies everywhere."
    },
    {
      "title": "Cook the vegetables in the pan for 3 minutes.",
      "content": "Cook the vegetables in the pan for 3 minutes. Place the carrots, onion, garlic, bean sprouts, and ginger into the pan. Throw in 1 tsp. of salt and a pinch of black pepper. The vegetables should sweat a bit, but they shouldn't turn brown. [3] X Research source"
    },
    {
      "title": "Throw 1/2 lb.",
      "content": "Throw 1/2 lb. of cooked chicken into the pan. You can use chicken that you've cooked for another meal the day before, or buy or make cooked chicken especially for the fried rice. Just dice the chicken into thin strips and place it in the pan. [4] X Research source"
    },
    {
      "title": "Put up to 2 tablespoon (29.6 ml).",
      "content": "Put up to 2 tablespoon (29.6 ml). of sesame oil into the frying pan. You can gradually add the oil when it becomes necessary -- you don't have to throw it in at once. [5] X Research source"
    },
    {
      "title": "Add three eggs to the pan.",
      "content": "Add three eggs to the pan. Crack the eggs into a bowl and whisk them together. Then, pour the eggs into the pan. [6] X Research source"
    },
    {
      "title": "Toss the cooked rice into the pan.",
      "content": "Toss the cooked rice into the pan. Fry the rice and the other ingredients together for 2-3 minutes, just enough time to heat up the rice and mix the ingredients. Keep stirring as you fry the rice. Add 3 tablespoon (44.4 ml). of soy sauce to the mixture and fry the ingredients together for another 30 seconds. [7] X Research source Then, remove the pan from the heat."
    },
    {
      "title": "Serve.",
      "content": "Serve. Place the rice in a dish and garnish it with a few sprigs of green onion. Enjoy this dish as a main course. Check out more fried rice recipes from wikiHow users on the “Need an easy way to make fried rice” forum ."
    },
    {
      "title": "Heat 1/2 tbsp.",
      "content": "Heat 1/2 tbsp. of peanut oil in a large skillet over medium-high heat. [8] X Research source"
    },
    {
      "title": "Cook the eggs.",
      "content": "Cook the eggs. Add 2 lightly beaten eggs to the pan. Tilt the pan to coat the surface with the eggs. Cook the eggs in an even layer until they're cooked all the way through. Halfway through the cooking, after about 2 minutes, flip the eggs. Then, remove the eggs, dice them into small pieces, and set them aside. [9] X Research source"
    },
    {
      "title": "Add onion, garlic, and ginger to the pan.",
      "content": "Add onion, garlic, and ginger to the pan. Heat 1/2 cup of chopped onion, 3 cloves of minced garlic, and 2 tsp. of minced ginger to the pan. Cook these ingredients together for 2 minutes in the remaining peanut oil. [10] X Research source"
    },
    {
      "title": "Add 2 diced pork chops to the rice.",
      "content": "Add 2 diced pork chops to the rice. The pork chops should already be cooked. Cook the diced pork for an additional 3 minutes, or until they're golden brown. [11] X Research source"
    },
    {
      "title": "Add the rice, soy sauce, and sesame oil to the skillet.",
      "content": "Add the rice, soy sauce, and sesame oil to the skillet. Add 1 cup of cooked brown rice, 1/4 cup of reduced-sodium soy sauce, and 2 tsp. of sesame oil to the pan and cook them for 2 more minutes. Season the fried rice to taste with salt and black pepper. Then, remove the fried rice from heat. [12] X Research source"
    },
    {
      "title": "Stir in 1/4 cup of chopped cilantro leaves.",
      "content": "Stir in 1/4 cup of chopped cilantro leaves. Mix the cilantro well with the remaining ingredients. [13] X Research source"
    },
    {
      "title": "Serve.",
      "content": "Serve. Place this fried rice on a serving plate and top it with chopped eggs."
    },
    {
      "title": "Rinse and drain 1 ½ cups of long-grain white rice.",
      "content": "Rinse and drain 1 ½ cups of long-grain white rice."
    },
    {
      "title": "Bring the rice, ¾ cups of water, and 1 ½ cups of chicken broth to a full rolling boil in a 4-quart heavy saucepan.",
      "content": "Bring the rice, ¾ cups of water, and 1 ½ cups of chicken broth to a full rolling boil in a 4-quart heavy saucepan."
    },
    {
      "title": "Cover the pan and reduce the heat to low.",
      "content": "Cover the pan and reduce the heat to low. Cook the ingredients until the liquid is absorbed and the rice is tender. This should take about 15 minutes. Then, remove the pan from heat and let it stand covered for 5 minutes, giving the rice time to absorb the flavors."
    },
    {
      "title": "Transfer the rice mixture to a shallow bowl.",
      "content": "Transfer the rice mixture to a shallow bowl. Allow it to cool to room temperature – this should take about 30 minutes. Chill the rice mixture for 8 to 12 hours."
    },
    {
      "title": "Heat 1 quart of oil a 4-quart pot over high heat.",
      "content": "Heat 1 quart of oil a 4-quart pot over high heat. Heat it until a thermometer registers 375°F (190°C)."
    },
    {
      "title": "Cook the krupuk (optional).",
      "content": "Cook the krupuk (optional). Gently drop 2 krupuk in the oil. Fry the krupuk until they float to the surface and curl up and expand, which should take about 20 seconds. Then, turn the krupuk over and fry them until they’re pale golden – about ten more seconds. Then, transfer them to a paper towel with a slotted spoon until they drain. [14] X Research source Fry the remaining krupuk in 3 batches in the same way. When the krupuk is cooked, cool it and break it into pieces."
    },
    {
      "title": "Break up the rice into individual grains.",
      "content": "Break up the rice into individual grains. Do this with your fingers. This will help the rice absorb the other ingredients."
    },
    {
      "title": "Heat the remaining 3 tablespoon (44.4 ml).",
      "content": "Heat the remaining 3 tablespoon (44.4 ml). of oil in a wok over high heat. Heat it until it's hot but not smoking. Then, add 2 cups of thinly sliced shallots and fry them in the heat for 1 minute. Add 2 large chopped garlic cloves to the mixture and stir-fry them for an additional 30 seconds."
    },
    {
      "title": "Add the chicken to the stir-fry mix.",
      "content": "Add the chicken to the stir-fry mix. Add 1 lb. of sliced skinless boneless chicken breast to the mixture until the chicken is no longer pink, which should take about 2 minutes."
    },
    {
      "title": "Add the shrimp, chiles, and salt to the mixture.",
      "content": "Add the shrimp, chiles, and salt to the mixture. Add 1 lb. of peeled and deveined medium shrimp, 2 minced hot red chiles, and 1 1/4 tsp. of salt to the mixture and cook them for 2-3 minutes, until the shrimp are cooked through. [15] X Research source"
    },
    {
      "title": "Add the remaining broth and ketjab manis to the rice.",
      "content": "Add the remaining broth and ketjab manis to the rice. Add 1/4 cups of chicken broth and the ketjab manis (Indonesian sweet soy sauce) to the mixture and stir-fry it until the rice is heated, which should take another 2 minutes."
    },
    {
      "title": "Remove the mixture from the heat.",
      "content": "Remove the mixture from the heat. Stir in 1 tablespoon (14.8 ml). of Asian fish sauce and 4 sliced scallions until the mixture is combined well. [16] X Research source"
    },
    {
      "title": "Serve.",
      "content": "Serve. Serve the Indonesian fried rice on a platter with krupuk, cucumber slices, and hard-boiled eggs."
    },
    {
      "title": "Make vegetarian fried rice.",
      "content": "Make vegetarian fried rice. This type of fried rice is perfect for fried rice lovers who don't eat meat."
    },
    {
      "title": "Make Japanese fried rice.",
      "content": "Make Japanese fried rice. Make this fried rice with a healthy portion of scrambled eggs and peas."
    },
    {
      "title": "Make Chinese fried rice.",
      "content": "Make Chinese fried rice. Make this delicious fried rice with a few strips of bacon and a sliced omelet."
    },
    {
      "title": "Make shrimp fried rice.",
      "content": "Make shrimp fried rice. Make this version of fried rice if you love adding tasty shrimp to your meals."
    },
    {
      "title": "Make Thai fried rice.",
      "content": "Make Thai fried rice. Make this tasty fried rice with a variety of ingredients that include peanut oil, fish sauce, and chili pepper."
    }
  ]
}