{
  "url": "https://www.wikihow.com/Get-a-Photographic-Memory",
  "title": "How to Get a Photographic Memory",
  "steps": [
    {
      "title": "Practice taking an eidetic memory test.",
      "content": "Practice taking an eidetic memory test. To test whether or not you have an eidetic (photographic) memory, you can take a pretty basic test. It involves looking at 2 images that are similar, and trying to superimpose them over one another. You can take the test online via the University of Iowa. If you like it, talk to your doctor about taking a certified test. [1] X Research source If it turns out you don't have an eidetic memory, that's totally fine! This test is still a fun way to exercise your brain and improve your memory."
    },
    {
      "title": "Use image associations.",
      "content": "Use image associations. One way to help you remember something, whether it is the title of a book or where you left your keys, is to take a moment to visualize the item at hand. For example, if the object is a book called \"A Thousand Splendid Suns,\" take a moment to visualize what a thousand splendid suns would look like. Having the image imprinted in your mind can help you recall the title of the book later. Similarly, if you place your car keys down on the kitchen counter, try to imagine your keys doing something silly in the kitchen like cooking or eating the fruit in the fruit bowl. When it comes time to look for your keys later, you'll be unlikely to forget that silly image you created in your head."
    },
    {
      "title": "Repeat names.",
      "content": "Repeat names. Many people struggle to remember the names of people they have just met, even after only 30 seconds. This is likely because we tend to focus so much on ourselves (how we look, whether we're being polite, etc) that we neglect to listen to the other person's name. This can be especially difficult if you are being introduced to several people at once. [2] X Research source One way to combat this is to repeat the person's name right after meeting them: \"Nice to meet you, Sam.\" If you didn't hear the name properly or couldn't catch how to pronounce it, be sure to clarify this right away to avoid having to ask again later. Another way to remember names is to associate the new name with somebody you already know by that name. If you don't already know anybody by that name, then try to think of a character in a book or film with that name. Making this kind of association can help you recall the name later."
    },
    {
      "title": "Employ \"chunking.\"",
      "content": "Employ \"chunking.\" Chunking is a psychological term for a memory retention technique that involves clumping numbers, words, or items in a list together to help remember them. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source If you are trying to remember items on a grocery list, then try clumping them together in different categories like fruits, vegetables, frozen items, condiments, meats, etc. Alternatively, divide grocery lists into potential meals; for example, you could group lettuce, tomato, cucumbers, goat cheese, and vinegar into one \"chunk\" called \"salad items.\" The same can be done by dividing sets of numbers into smaller sections; this will come in handy when trying to remember your credit card number, social security number, or a telephone number. For example, instead of trying to remember the following sequence: 77896526, you could break it up into 77-896-526. Repeating the number back to yourself will be a lot easier if you do it in smaller sections."
    },
    {
      "title": "Minimize distractions",
      "content": "Minimize distractions . For many people, forgetfulness is not a memory issue, but a result of being too distracted to effectively learn the information in the first place. When possible, try not to multi-task. Focus all of your attention on completing one activity at a time. Though it's tempting to take care of several things at once to save time, you will be more likely to retain the information if you do each one individually, saving you time in the long run. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Read with purpose.",
      "content": "Read with purpose. If you want to retain information, it will help to clarify why you're reading. [5] X Research source For example, if you think to yourself, “I need to read this manual so that I know how to use my pressure cooker,” that can help you retain the information. Any purpose is fine! It can be as simple as, “I need to memorize the origins of the Civil War so I can pass my history test!” Having a purpose will help your brain remember why you're reading in the first place, and might help you retain information."
    },
    {
      "title": "Use association to categorize what you read.",
      "content": "Use association to categorize what you read. As you read, try to relate what you're reading to other parts of the book, chapter, or article. It's helpful to think about the general organization of the piece and mentally sort the information you're reading into the corresponding parts of the outline. For example, in a chapter on the Civil War, as you read about slavery you can associate that with the part of the chapter that is analyzing the origins of the war."
    },
    {
      "title": "Practice visualization to create a vivid memory.",
      "content": "Practice visualization to create a vivid memory. Creating a mental picture of what you're reading is a helpful way to memorize the information. If you're reading about how to bake a pie, picture each of the different parts as you read about them. Imagine the ingredients, the crust, the filling, and the finished product. [6] X Research source"
    },
    {
      "title": "Concentrate only on what you are reading.",
      "content": "Concentrate only on what you are reading. Avoid trying to multitask when you are reading for information. It will increase the likelihood that you won't have picture perfect recall. Instead, focus intently on what you are reading and tune everything else out. [7] X Research source Don't try to watch TV or have a conversation when you are reading something that you want to remember."
    },
    {
      "title": "Make relaxation a priority.",
      "content": "Make relaxation a priority. There are many ways to alleviate anxiety and stress. Spend more time doing activities that you enjoy, especially those that involve being outdoors. Take up activities that promote mindful awareness, like yoga or tai chi. Another way to help alleviate anxiety and depression is to socialize more often. [8] X Research source Reach out to friends, family members, and loved ones and avoid spending too much time alone with your thoughts."
    },
    {
      "title": "Play games and do puzzles to exercise your brain.",
      "content": "Play games and do puzzles to exercise your brain. Your brain is like the muscles of your body; the more exercise you give it, the better it will perform. Unfortunately, many people get so caught up in their daily routines that they can go days with their brains performing on \"auto pilot.\" Try to incorporate some of the following brain-stimulating activities into your week: [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Do crossword puzzles to get a great mental workout."
    },
    {
      "title": "Read something every day.",
      "content": "Read something every day. Learning new information is a great way to keep your memory sharp. Even if you're not an avid reader, make a point to read a little bit each day. Choose a book that interests you and commit to reading a chapter or even just 5 pages a day. It doesn't matter whether it is fiction or non-fiction. Read the newspaper to stay up to date on current events. This will also exercise your brain!"
    },
    {
      "title": "Learn something new to keep your brain fresh.",
      "content": "Learn something new to keep your brain fresh. In addition to reading on your own, you can learn new skills to give your memory a workout. Maybe you'd like to learn about a certain topic or try a new hobby or sport. Choose something that excites you! Learn a new language or instrument . Sign up for a class at your local community college."
    },
    {
      "title": "Get more exercise.",
      "content": "Get more exercise . Physical activity increases blood flow to every part of your body, including your brain. [10] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source This can help get more oxygen and essential nutrients to your brain so that it will perform better. Aim to get at least 30 minutes of aerobic exercise five days a week. It's important to spread out your exercises throughout the week so that you are regularly increasing blood flow to the brain. Even if you don't have time for a formal workout, you might have time to squeeze in at least a brisk 10 minute walk. Make small lifestyle changes to increase your mobility, like choosing the stairs over the elevator."
    },
    {
      "title": "Eat plenty of Omega-3s.",
      "content": "Eat plenty of Omega-3s. These fatty acids are great for overall brain health and have been shown to improve memory, in particular. Try eating fish a couple of times a week. Salmon, bluefin tuna, and sardines are great choices. Try grilling or baking the fish to get the most nutritional value. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you don't like fish, talk to your doctor about trying fish oil supplements instead."
    },
    {
      "title": "Enjoy multiple servings of veggies per day.",
      "content": "Enjoy multiple servings of veggies per day. A good guideline is to aim for about 3-5 servings of fresh veggies each day. Cruciferous veggies like broccoli and leafy greens like kale are especially helpful. Try eating a kale salad or whip up a broccoli and salmon stir fry ."
    },
    {
      "title": "Add walnuts to your daily diet.",
      "content": "Add walnuts to your daily diet. These nuts might be able to boost your cognition. You can eat a handful of walnuts as an easy, on the go snack. You can also add walnuts to your yogurt or salads for a satisfying crunch! Walnuts are also good for your heart and an excellent source of protein."
    },
    {
      "title": "Eat berries and cherries regularly.",
      "content": "Eat berries and cherries regularly. Adding these fruits to your daily diet can boost your memory. Add some blueberries to your morning oatmeal or have an evening snack of fresh cherries. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Frozen berries are also packed with nutrients, so keep those on hand."
    },
    {
      "title": "Drink in moderation",
      "content": "Drink in moderation . Drinking excessive alcohol can block key receptors in the brain that are necessary for memory retention, and may release a steroid that interferes with learning and memory. [13] X Research source There is some evidence, though, that drinking in moderation can actually protect your memory in the long run. It is probably okay to have 1-2 glasses of wine per day. Ask your doctor about what is right for you."
    }
  ]
}