{
  "url": "https://www.wikihow.com/Make-a-Protein-Shake",
  "title": "How to Make a Protein Shake",
  "steps": [
    {
      "title": "Add your base liquid.",
      "content": "Add your base liquid. Make sure the blender is in the off position, and then pour 1 cup (240 mL) of milk or juice into the blender. If you want to make a thicker protein shake, add a few ice cubes first. Then blend your ice and liquid on medium speed for about 10 seconds to break up the ice. If you're allergic to dairy, you can use soy milk, non-dairy almond milk, or coconut milk as a substitute. Plant-based milks are also better for weight loss. [1] X Research source Alternatively, you can use juice instead of milk. Non-dairy protein powders are another option if you are allergic to dairy. Instead of a dairy-based protein powder, look for soy protein, rice protein, or dried fruit powders."
    },
    {
      "title": "Add your whey protein mix.",
      "content": "Add your whey protein mix. Taking protein powder is one of the most efficient ways to ensure that your body is getting a proper daily dose of protein. After you add your milk or juice, pour the powder into your blender. Blend with the milk at medium speed for 15 seconds. Blending your protein powder with your milk before you add your other ingredients will ensure that the powder completely dissolves and doesn’t leave any chunks. Follow the serving size directions on your tub of protein powder to get the right amounts in your shake. As a rule of thumb, if you are trying to put on weight or muscle, men should use 2 scoops; women should use 1 scoop. Protein will help your body build muscles after you work out. [2] X Expert Source Shira Tsvi Personal Trainer & Fitness Instructor Expert Interview. 7 January 2020."
    },
    {
      "title": "Add fruits, yogurts, and other ingredients.",
      "content": "Add fruits, yogurts, and other ingredients. After you mix your powder and milk, you can add a variety of different ingredients to your protein shake. Fruits and yogurts not only add an extra boost of daily vitamins, but also add flavor. From nuts to frozen yogurt, your options are endless. [3] X Research source If you love your vanilla latte, try adding vanilla protein powder and 1 ⁄ 2 cup (120 mL) of low-fat frozen yogurt to your shake. Substitute regular milk for soy milk. Add 1 tablespoon (5g) of almonds, 1 tablespoon (15 mL) of sugar-free maple syrup, 1 tablespoon (15 mL) vanilla extract, and 1 tablespoon (15 mL) of low-fat Greek yogurt to get a delicious soy almond shake. If you're lactose intolerant, make sure the yogurt is lactose-free. If you love fruit, use a fruit-flavored whey protein or dried fruit powder. Then mix in a handful of berries, like strawberries, raspberries, or blueberries, and non-fat milk. Add your fruits after you've blended the powder with the milk or juice to get a smoother drink. Feel free to play around with mixing yogurts, fruit, and nuts together to get your perfect shake. Add these secondary ingredients after you've blended your protein powder with your liquid and ice."
    },
    {
      "title": "Gradually increase your blending speed.",
      "content": "Gradually increase your blending speed. With all your ingredients mixed in, start at a medium speed. After you hear less of a crunching noise, especially if you've added ice, work up to a high speed. Make sure to blend the ingredients for at least 45 seconds or until the fruit is completely dissolved."
    },
    {
      "title": "Turn off your blender.",
      "content": "Turn off your blender. Once you’ve blended your protein shake for about 45 seconds, turn off the blender and remove the lid. Pour the shake into a large glass. Pour a little bit of your shake into your glass first and do a taste test. See if the consistency is to your liking. If you see or feel ice chunks, blend the mixture again on high for another 10 or so seconds. If your protein shake is too watery, add a bit more milk or yogurt to thicken it up."
    },
    {
      "title": "Grab a large mixing container.",
      "content": "Grab a large mixing container. A water bottle with a sealable lid and large mixing bowl work well when you don't have a blender. Additionally, if you have a blender bottle or a spherical whisk, you can use that to shake up your ingredients. For this method, it's best to mix your liquids separately from your solids before blending everything together. You will have to mash your solids before adding them to your shake. A nonelectric food processor and chopper will also work well for mixing fruits and other solid foods."
    },
    {
      "title": "Pour your liquids into your bottle.",
      "content": "Pour your liquids into your bottle. Add 1 cup (240 mL) of milk or juice to your container before you add your powder. If you don’t have a blender, it’s best not to add any ice. The ice won’t be able to break up in your container and will prevent any of your other ingredients from fully mixing."
    },
    {
      "title": "Add your protein mix.",
      "content": "Add your protein mix. Before adding anything else, just like with a blender, mix in your protein. Use your whisk and shake the bottle, or stir the mixture with a fork. [4] X Research source Unless you can mash up nuts or chocolate into a fine powder by hand, use a flavor powder substitute. You can also use peanut butter instead of nuts. Try almond milk instead of almonds, and chocolate protein powder instead of chocolate. You can also buy fruit powder, which is similar to protein powder. Instead of a whey protein powder, you can use fruit powder, which contains all the nutrients of fruit. If you opt for fruit powder, mix it in like you would a protein powder, after you add juice or milk. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The easiest way to mix all the protein powder is to pour in a little in at a time, stir, and then pour in more. By adding a little protein at a time, you ensure that there is less powder that has to absorb at once. Once you’ve stirred in all your powder, screw the lid of your bottle on tightly and shake it for 10 to 15 seconds. Even if you don’t have a spherical whisk, shaking your bottle will help to break up any leftover protein chunks."
    },
    {
      "title": "Prepare your fruit or other ingredients.",
      "content": "Prepare your fruit or other ingredients. Because you don’t have a blender, you have to turn your fruit and other solid ingredients into a shake-like consistency by hand. Mash the fruit up with a mortar and pestle or in a bowl with a fork and spoon. Mash the fruit until you have a mushy consistency, then add a little juice, milk, yogurt, or water to the mix. Whisk your mix until it is blended to your satisfaction. It’s easiest to use soft fruits if you don’t have a blender. Fruits like bananas, mangos, and berries work well. Berries are also a healthy choice because they’re rich in antioxidants and vitamin C. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Add your other ingredients.",
      "content": "Add your other ingredients. If you mashed up fruit to add to your smoothie, pour your mixture in now and shake or stir it. Additionally, if you’re adding yogurt, mix it in now. Stir your mix for 10 to 15 seconds or until you’re satisfied. Screw the lid on your bottle and give it a good shake to make sure everything is mixed together. Do a taste test. If you’re satisfied, enjoy your shake."
    }
  ]
}