{
  "url": "https://www.wikihow.com/Make-a-Match-Head-Tennis-Ball-Bomb",
  "title": "How to Make a Match Head Tennis Ball Bomb",
  "steps": [
    {
      "title": "Purchase everything you need.",
      "content": "Purchase everything you need. Most of the items can be found in just one convenience store. Look to larger convenience stores such as Walmart or Target to find everything you need. Check hardware or DIY stores such as Home Depot or Lowes for hardware that might not be available at a convenience store, such as box cutters or bulk matches. Other types of balls are also viable for this explosive, provided they are hollow and support resealing, such as ping pong balls."
    },
    {
      "title": "Buy several packs of strike anywhere matches.",
      "content": "Buy several packs of strike anywhere matches. You want around 1,000 match heads in order to fill up the tennis ball completely. Safety matches will not work unless you also place a striker inside of the tennis ball along with the match heads. Remove the striker strip from a match box if you are using safety matches. The strip is small and pliable enough to be inserted into the tennis ball."
    },
    {
      "title": "Cut the match heads off of every match.",
      "content": "Cut the match heads off of every match. Use scissors to snip the match heads off of the body. Don’t worry about being too precise. The bomb will still function if some match heads have a bit of wood left over. Take care when handling the match heads. If you used strike anywhere matches, friction between the match heads could cause them to prematurely ignite. Separate the match heads into separate groups. That way, if a set of match heads accidentally ignite, you don't lose all of your work."
    },
    {
      "title": "Cut a small hole in the tennis ball.",
      "content": "Cut a small hole in the tennis ball. Use a pair of sharp scissors, a knife, or a box cutter to cut into the tennis ball. You only need to create enough room to be able to insert the match heads. A pea-sized opening will suffice. Make the hole a bit larger if you want to be able to insert several match heads at a time. A funnel is useful for adding match heads to the tennis ball, provided the funnel's material does not ignite the match heads as they are passing through."
    },
    {
      "title": "Fill the tennis ball with match heads.",
      "content": "Fill the tennis ball with match heads. Take care to not accidentally strike any of the match heads while placing them in the tennis ball. This will ruin the tennis ball and potentially cause injury. If you are using safety matches, insert the striker that you peeled from the match box only after you've placed all of the match heads into the tennis ball. The match heads will need to rub against this striker in order to ignite. [1] X Research source"
    },
    {
      "title": "Wrap with duct/electric tape.",
      "content": "Wrap with duct/electric tape. Use between 1 and 3 layers of tape to cover the tennis ball. Increasing the thickness of the ball with tape will increase the power of the explosion thanks to a greater build up of internal pressure. Don't use too many layers, however, as covering the tennis ball with too many layers of tape will prevent the tennis ball from exploding. Other types of tape, such as scotch or masking tape, do not provide the strength needed to build up enough internal pressure for the tennis ball to explode. Glue the hole in the tennis ball shut prior to wrapping in order to ensure the match heads are secured tight (optional)."
    },
    {
      "title": "Throw in an open area.",
      "content": "Throw in an open area. Give yourself and the explosive plenty of clearance. The tennis ball will detonate shortly after hitting the ground or receiving a solid jolt, so be careful when throwing the tennis ball. Sparks and debris will fly a greater distance depending on the number of matches in the tennis ball and how tightly it was wrapped. The tennis ball will emit a large crack sound upon exploding, not unlike a firecracker. Though the explosion itself will not be terribly large, expect sparks, match heads, and debris to disperse in a large, variable area, depending on how tightly the tennis ball was wrapped in tape. If done correctly, the explosion will look like a miniature firework display. If the tennis ball does not detonate shortly after throwing, wait between 15 and 30 seconds before attempting to pick the tennis ball up again. You want to make absolutely sure nothing in the tennis ball has ignited before handling. A delayed explosion is possible if only a few match heads ignite upon impact. The tennis ball may also be launched using a tennis ball launcher or other mortar devices. Note that harsh movement will ignite the match heads within the ball. Launch a few standard tennis balls first to make sure the mortar works properly."
    },
    {
      "title": "Acknowledge the law.",
      "content": "Acknowledge the law. Before purchasing any materials, make sure you understand the laws and regulations associated with explosives. These regulations range from the Federal level to more local jurisdictions. Make sure you are not performing something illegal in your area by doing your research. [2] X Trustworthy Source U.S. Bureau of Alcohol, Tobacco, and Firearms U.S. federal law enforcement agency dealing with crimes related to firearms and alcohol and tobacco products Go to source Go to your state police department website to read up on explosives and fireworks laws local to your area. Some states allow fireworks, but have a set definition on what the term includes. If you aren't using legal fireworks in that state, you are committing a felony."
    },
    {
      "title": "Read up on fireworks, explosives, and fire safety.",
      "content": "Read up on fireworks, explosives, and fire safety. It goes without saying that creating a bomb is dangerous. There are a number of precautions that must be taken for safety when handling explosives and explosive materials. Have an emergency supply of water nearby for putting out any fires. Wear safety glasses. Explosives (including a match head tennis ball bomb) create sparks and debris that can injure your eyes. Use explosives outdoors only. Give yourself, and the explosive, plenty of room to operate. Do not throw explosives at other people or animals. [3] X Research source"
    },
    {
      "title": "Find an area near you that minimizes the potential for fire.",
      "content": "Find an area near you that minimizes the potential for fire. Fire risk is determined by the surroundings of where you set of the explosive. Strong winds or dry weather also further increase the risk of a spreading fire – explosives should not be detonated during such weather. Do not set off the explosive near homes, sheds or other structures. Look for a site that is at least fifteen feet away from shrubs, trees or other flammable plant life. Detonate the bomb over dirt or gravel if possible. The explosion site should be surrounded by dirt and gravel for 10 feet in all directions. Once the bomb has exploded, travel to the detonation site to ensure embers are extinguished. Use water if necessary to put out kindling and cover with dirt and gravel to smother the remnants."
    }
  ]
}