{
  "url": "https://www.wikihow.com/Lower-Steering-Wheel",
  "title": "How to Lower Your Steering Wheel",
  "steps": [
    {
      "title": "Find the steering wheel release lever on the left side of the steering wheel.",
      "content": "Find the steering wheel release lever on the left side of the steering wheel. Once you find it, push down gently to release the steering wheel and unlock it. [1] X Research source This lever is usually right next to or underneath the steering column. Typically, it’s about 4 in (10 cm) long. In some electric vehicles, the process for adjusting your steering wheel is different. If you’re in a Tesla, hit Controls > Steering, then use the arrows to move your steering wheel up and down."
    },
    {
      "title": "Grab the steering wheel and move it to your desired position.",
      "content": "Grab the steering wheel and move it to your desired position. When the steering wheel is unlocked, grab it with both hands and push it down to lower it. You can also pull it up to raise it, or you can move it forwards and backwards. [2] X Research source Adjust the steering wheel so that the top of the wheel is about as high as the top of your shoulder. Make sure that your arms are relaxed while holding the wheel for the perfect placement. As you adjust, make sure you can still see the dashboard of your car behind the steering wheel."
    },
    {
      "title": "Lock your steering wheel again with the same release lever.",
      "content": "Lock your steering wheel again with the same release lever. Once you have the steering wheel adjusted to your liking, simply push the lever back up into place. [3] X Research source If the lever is sticking slightly, wiggle the steering wheel just a little bit as you push up on the lever. If your position still doesn’t feel quite right, try messing with your seat instead of the steering wheel. Adjust your seat to scoot forward or backward to find the most comfortable position for you."
    },
    {
      "title": "Push and pull on the steering wheel to make sure it’s locked.",
      "content": "Push and pull on the steering wheel to make sure it’s locked. It’s dangerous to drive with an unlocked steering wheel, so do a quick safety check before you hit the road again. Push, pull, and turn the steering wheel to make sure it stays in place. [4] X Research source If the steering wheel moves, push down on the lever and then push it back up again."
    }
  ]
}