{
  "url": "https://www.wikihow.com/Kill-Tomato-Worms",
  "title": "How to Kill Tomato Worms",
  "steps": [
    {
      "title": "Remove them by hand.",
      "content": "Remove them by hand. While time consuming, removing tomato worms by hand can be very effective. It's also the most environmentally-friendly way to get rid of them. [1] X Expert Source Artemisia Nursery Plant Nursery & Garden Shop Expert Interview. 7 August 2020. Adult tomato worms have a horn-like protrusion on their rear. But do not worry, they are not dangerous and will not sting you. Wearing gloves is a good way to help you feel more comfortable picking them up. Dropping the worms in bucket of soapy water can help if you are squeamish about crushing them. If you are having trouble seeing them, spraying the leaves with water will make them move. [2] X Research source"
    },
    {
      "title": "Spray plants with a homemade mixture.",
      "content": "Spray plants with a homemade mixture. Spraying plants liberally with a mixture of 2 cups water, 1 teaspoon each of cayenne pepper and liquid dish soap will deter the caterpillars from feeding. Adding garlic to the mixture can also help prevent moths from initially laying the eggs. Make sure to thoroughly cover both sides of the leaves and the stems. [3] X Research source"
    },
    {
      "title": "Introduce a predator insect.",
      "content": "Introduce a predator insect. By introducing a predator insect you can help control your tomato worm problem and benefit your garden at the same time. There are many of these insects that can help. Wasps feed on tomato worms and attach their larvae to them. Once attached, the wasp larvae will feed on the tomato worm until it is dead. If you see tomato worms with wasp larvae attached (they will look like tiny grains of rice on the back of the caterpillars) remove them from your garden but do not kill them. This way any damage will end but the wasps can still do their jobs and it will help populate your garden with wasps. Ladybugs and lacewings are also beneficial insects if you would prefer not to have many wasps around. These insects eat tomato worms, rather than lay their eggs on them as the wasps do. Birds are also an option as they can easily spot the worms and eat them. Placing a bird feeder or bird bath near your garden can help attract birds. [4] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Interplant your tomatoes with dill, basil, or marigolds.",
      "content": "Interplant your tomatoes with dill , basil , or marigolds . These plants and other can help keep away many pests including tomato worms and can be beneficial to your plants. Tomato worms enjoy these plants more than tomatoes. As they eat their way through the decoy plants, your tomatoes will be safe and you can eliminate the pests as you see fit. These plants also tend to attract beneficial and predatory insects that can repel tomato worms. There are added benefits to the presence of some of these plants, such as basil which can help enhance the flavor of your tomatoes as they grow."
    },
    {
      "title": "Decide on the type of insecticide.",
      "content": "Decide on the type of insecticide. There are many options of insecticide to pick from and the choices may seem daunting. Be careful in choosing as some may be harmful to beneficial insects. Botanical Bt (Bacillus Thuringiensis) is an organic insecticide that acts as a stomach poison and will not harm other plants or animals. Bt also kills cabbage worms, cabbage loopers, cutworms, and other harmful caterpillars. Pyrethrins are derived from the Chrysanthemum flower and are used to control fleas, flies, moths, ants and other pests. These organic insecticides are safer for human consumption than other inorganic compounds. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Spinosad is a natural substance made by soil bacterium. This insecticide is effective on tomato worms and pests such as spiders mites, mosquitoes, and ants. [6] X Research source Food-grade diatomaceous earth is a biosafe mineral that's harvested from the ocean. It will kill insects and worms if they come into contact with the fine dust. [7] X Expert Source Artemisia Nursery Plant Nursery & Garden Shop Expert Interview. 7 August 2020."
    },
    {
      "title": "Decide on a spray or dust.",
      "content": "Decide on a spray or dust. There is no right or wrong choice when picking a dust or spray. The size of your infestation and garden are the biggest factors in choosing. Dusts tend to last longer, provide a better coat, and do not require mixing before application. However, they can be harder to apply and drift to other plants in the wind. Sprays are mostly concentrated or in powder form and require you to mix them with water before use. Once this is done they can be spread quickly over a large area."
    },
    {
      "title": "Apply the insecticide to your plants.",
      "content": "Apply the insecticide to your plants. Each insecticide is different and may require a specific way to apply it. The most important thing to remember is to read the package of the insecticide you choose for any warnings and environmental factors when applying. With any chemical-based product, test a small section of the plant for sensitivity and wait 24 hours before covering the full area. [8] X Research source"
    },
    {
      "title": "Till the soil",
      "content": "Till the soil . Tilling the soil at the beginning and end of each planting season can help to destroy larvae. Studies show that tilling can cause up to a 90% mortality. Larvae lives in the soil below the plant so a root-tiller is the best choice for this. It helps to break up the larvae and reaches deeper below the surface to help get most of them. [9] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Rotate your crops each planting season.",
      "content": "Rotate your crops each planting season. Tomato worm larvae spend the non-growing season below the surface. When the next season begins they come back to your tomatoes. Moving the tomato crop to a different location can help prevent damage. Tomatoes also feed heavily on the soil, so rotating them with a light feeding plant can help the soil."
    },
    {
      "title": "Cover the ground.",
      "content": "Cover the ground. Using a black plastic mulch around your plants will prevent the tomato worms from coming out of the soil. There are regional drawbacks to covering the ground, so make sure whether it is appropriate for your climate."
    }
  ]
}