{
  "url": "https://www.wikihow.com/Make-Carbon-Fiber",
  "title": "How to Make Carbon Fiber",
  "steps": [
    {
      "title": "Find an appropriate mold.",
      "content": "Find an appropriate mold. Before starting, choose a mold that accurately shapes the carbon fiber part. You can buy molds online or from automotive and motorcycle supply stores. If the original part is undamaged, you can sometimes use it as a mold. [1] X Research source In some cases, you can use the original part as a mold to make the carbon fiber part. This will not work well if the part is damaged."
    },
    {
      "title": "Wear the appropriate protective equipment when dealing with carbon fiber.",
      "content": "Wear the appropriate protective equipment when dealing with carbon fiber. Always use gloves, safety goggles, and a face mask to prevent skin contact and inhalation of harmful fumes. Work in a well-ventilated space to avoid excessive buildup of toxic gases."
    },
    {
      "title": "Prepare the mold.",
      "content": "Prepare the mold. Apply a specialized release wax to the mold before adding resin. This prevents the carbon fiber part from sticking. Avoid confusing mold release wax with resin; the wax creates a separation layer, while resin hardens to form the final product. [2] X Research source The wax is not to be confused with the resin. The wax creates a layer between the mold and the resin, and does not harden."
    },
    {
      "title": "Spray the inside with resin.",
      "content": "Spray the inside with resin. For best results, make sure that all nooks and crannies of the mold are completely saturated with the resin. Depending on the size of the mold, you may need multiple cans of resin This will create the surface needed to apply the carbon fiber. [3] X Research source Unlike the wax, the resin will harden and be removed from the mold as part of the carbon fiber piece."
    },
    {
      "title": "Apply the fiber cloth.",
      "content": "Apply the fiber cloth. Quickly press carbon fiber sheets into the mold. As with applying the resin, make sure you completely cover all sections of the interior mold with the fiber cloth. If there are particularly small corners or angles, you may want to consider pressing the fiber cloth into the crannies with a screwdriver or other small tool. [4] X Research source"
    },
    {
      "title": "Add additional resin.",
      "content": "Add additional resin. Spray the inside of the mold with more resin. The fiber cloth should be completely saturated with the resin. This ensures the fibers bond properly, giving the part its strength. [5] X Research source"
    },
    {
      "title": "Use vacuum bagging for a better finish.",
      "content": "Use vacuum bagging for a better finish. To avoid dirt and dust falling into the resin and to get the fiber cloth to conform better to the mold, you can bag the mold. This means placing a bag over the mold with a vacuum attachment. Then, use a vacuum pump (or for a crude version a vacuum cleaner) to pull suction on the bag. This will also help the resin dry faster."
    },
    {
      "title": "Heat the carbon fiber.",
      "content": "Heat the carbon fiber. Heating the carbon fiber part will speed up the curing process. You should heat the part to between 250 °F (121 °C) and 350 °F (177 °C) for several hours. Alternatively, you can allow the part to cure more slowly without heat. This usually takes at least 24 hours. [6] X Research source Most resins will not cure well below 60 °F (16 °C). You should not cure the part in a kitchen stove. The fumes given off smell terrible and they are toxic. You need an autoclave or other heat source for the curing process."
    },
    {
      "title": "Apply at least three more layers of resin.",
      "content": "Apply at least three more layers of resin. These layers of resin are intended to improve the look of the part, not the strength or functionality. Allow each layer of resin to set up before putting on the next layer. This can take anywhere from a few minutes to hours, but you will be able to tell because the resin will get tacky (sticky) when it is ready for the next coat. [7] X Research source"
    },
    {
      "title": "Sand the top layer of resin.",
      "content": "Sand the top layer of resin. Once you have applied three to seven layers of resin, it is time to sand it. You should sand out any imperfections in the resin, like dust particles or uneven surfaces. Take care not to go through the resin, if you sand the fibers underneath you will destroy the part. [8] X Research source"
    },
    {
      "title": "Polish the part.",
      "content": "Polish the part. After you have sanded the imperfections out of the resin, you can polish it. You can buy a polish appropriate for your resin at the same retailer that you purchased the resin. Apply the polish with a clean, soft rag, and wipe it off with another clean, soft rag. This will give the part a nice shine. [9] X Research source"
    },
    {
      "title": "Inspect the carbon fiber part on all sides.",
      "content": "Inspect the carbon fiber part on all sides. Make sure that there are no cracks or other deformations on the part. If the part is damaged, you will have to start over and make another part. If you don’t see any imperfections, you can use the part."
    },
    {
      "title": "Dissolve the precursor.",
      "content": "Dissolve the precursor. Precursor is the material that you use to make the carbon fiber. Almost all carbon fiber is made from a polyacrylonitrile precursor. You should dissolve the polyacrylonitrile in an organic solvent such as dimethyl sulfoxide. [10] X Research source"
    },
    {
      "title": "Spin the polymer.",
      "content": "Spin the polymer. Once the precursor is dissolved, you put it in a coagulation bath. Then, run the slush through a spinneret. The material is forced through the fine holes of the spinneret to create long strands. [11] X Research source"
    },
    {
      "title": "Add oxygen.",
      "content": "Add oxygen. Oxygen is needed to crosslink the polymers and make them more suitable for fibers. To oxidize the strands, heat them in an oxidation oven that ranges from 200 °C (392 °F) to 300 °C (572 °F). You must maintain appropriate airflow during this process to avoid catching the strands on fire. [12] X Research source"
    },
    {
      "title": "Pyrolyze the polymer chains.",
      "content": "Pyrolyze the polymer chains. Once oxidized, the strands must be heated in an oxygen free environment. Since there is no oxygen, the strands will not burn. Instead, they undergo a process called pyrolysis, which removes almost all impurities, such as organic solvents. A series of pyrolysis ovens are used that range anywhere from 700 °C (1,292 °F) to 1,500 °C (2,730 °F). [13] X Research source"
    },
    {
      "title": "Treat the fibers.",
      "content": "Treat the fibers. Pyrolysis leaves you with carbon fiber threads. Before being shipped to customers or processing plants, the threads must be treated. This includes etching the fibers with an acid, such as nitric acid. After etching (referred to as treatment) the fiber is coated in a process called sizing. The coating increases the size of the fibers and makes them more sturdy for processing and customer use. [14] X Research source"
    }
  ]
}