{
  "url": "https://www.wikihow.com/Get-in-Shape-as-a-Teen",
  "title": "How to Get Fit as a Teenager",
  "steps": [
    {
      "title": "Start slowly and build up.",
      "content": "Start slowly and build up. Try to take a ten-minute walk every day after school. Add a minute every day until you're walking for an hour every day. If you don't have a safe place to take a walk, try climbing stairs instead. Walk up and down the stairs five times on the first day, and then add one more flight of stairs every day until you can go up and down twenty times without stopping. Doctors recommend that teens exercise at least one hour every day. If you aren't used to exercising, start with 15 minutes, then work your way up to 30 minutes, 45 minutes, etc."
    },
    {
      "title": "Do cardio exercises in front of the TV.",
      "content": "Do cardio exercises in front of the TV. If you can't stand to miss your favorite show, do jumping jacks during the commercials. Or make a game for yourself where you have to do five burpees every time a character does x, y, or z."
    },
    {
      "title": "Join a sport",
      "content": "Join a sport . Even if track or cross country running isn't your thing, there are lots of ways to get in cardio exercise as a teenager. Check out your school or rec league's basketball, swimming, soccer, lacrosse, or hockey teams. Rec leagues often practice less frequently than school teams, so this may be a good way for you to fit in some exercise if you can't commit all of the required time to a school sport. If you struggle with endurance, try a sport where you tend to run in short bursts, such as tennis, softball, or baseball."
    },
    {
      "title": "Try a solo activity.",
      "content": "Try a solo activity. If you're not into team sports, you can skateboard, rollerblade, ride a bike, swim laps, or shoot hoops in your driveway. Anything that gets you moving and elevates your heart rate will help you get in shape. [2] X Research source Another alternative is a non-team-based sport, such as martial arts, yoga, or gymnastics. You'll be training with other people in a non-competitive environment."
    },
    {
      "title": "Get a job that lets you be active.",
      "content": "Get a job that lets you be active. If you can have an afterschool or summer job, look for one that lets you move around. Camp counselors and daycare workers chase kids and play games with them all day long. Waiting tables at a busy restaurant can keep you on the move. Some moving companies will hire teens part time in their busy season, or you could stock groceries at your local supermarket. [3] X Research source Think about starting your own lawn care company, raking your neighbor's leaves in the fall, shoveling snow in the winter, and weeding their gardens in the spring and summer."
    },
    {
      "title": "Use what you have.",
      "content": "Use what you have. Most teenagers don't have access to a gym, so you may have to make do with what you have at home. Lots of strength training exercises don't require a gym or any special equipment. You can do push-ups, planks, crunches, or sit-ups in your own home. [4] X Research source It's a good idea to do body-weight exercises (like push-ups or sit-ups) before you move on to using weights. This will help you build muscle mass before you dive in and lift weights. [5] X Research source You can also use everyday objects for weightlifting. For example, save old milk jugs, and fill them up with water for homemade dumbbells. You can also keep an eye on Craiglist or at yard sales to see if you can score some simple weight lifting equipment to keep in your room, garage, or basement. Sometimes you can find these items for pretty cheap."
    },
    {
      "title": "Go to a gym if you can.",
      "content": "Go to a gym if you can. If you're on a sports team, you may have access to your school's gym, or your school may allow all students to use the gym during certain hours. Talk to a coach or athletic director about open gym time when you can use the school's equipment. [6] X Research source Alternatively, if your parents belong to a gym or YMCA, find out what a family membership would cost."
    },
    {
      "title": "Join a class or team.",
      "content": "Join a class or team. Lots of schools offer a weightlifting class, club, or team, or there may be one designed specifically for teens and young adults at your local gym or YMCA. This can be a great way to get some encouragement, training, and always have a spotter on hand. [7] X Research source"
    },
    {
      "title": "Get a spotter.",
      "content": "Get a spotter. Strength training almost always requires a buddy. Spotters can stand nearby to prevent you from dropping the barbell on your chest if you're weight lifting, or they can keep an eye on your technique for you. [8] X Research source"
    },
    {
      "title": "Ease in.",
      "content": "Ease in. It's going to take some time for your body to get used to strength training, so don't rush it. Start with very small weights and only a few reps, and build up. Rushing in can very easily cause you to injure yourself. [9] X Research source Remember that because you're a teenager, your body is still growing and changing. That means it's easy for you to injure your bones, joints, muscles, and tendons if you're not especially careful with strength training."
    },
    {
      "title": "Focus on technique.",
      "content": "Focus on technique. Research the correct way to do each kind of lifting, and start with small enough weights than you can master the technique before adding weight. Using the wrong technique can injure you, which won't help you get in shape in the long run. [10] X Research source"
    },
    {
      "title": "Don't overdo it.",
      "content": "Don't overdo it. Practice strength training about three times a week. Never lift weights on back-to-back days; your muscles need time to recuperate, and you will injure yourself if you overdo it. You can alternate your cardio days with your strength training days. [11] X Research source"
    },
    {
      "title": "Pay attention to your calorie intake.",
      "content": "Pay attention to your calorie intake. The number of calories you need will depend on how old you are, how much you weigh, and how active you are. Here are some general guidelines: Teenage boys ages 11–13 need an average of 1,800 to 2,600 calories per day. Teenage boys ages 14–18 need an average of 2,200 to 3,200 calories per day. Teenage girls ages 11–13 need an average of 1,800 to 2,200 calories per day. Teenage girls ages 14–18 need an average of 1,800 to 2,400 calories per day. Teens involved in strenuous sports need more calories than the average teen. Check out the U.S. Department of Health and Human Services’ recommendations at https://www.nhlbi.nih.gov/health/educational/wecan/downloads/calreqtips.pdf ."
    },
    {
      "title": "Get lots of complex carbs.",
      "content": "Get lots of complex carbs. Complex carbohydrates give you energy and help with digestion. Whether you want to lose weight, stay in shape, or bulk up, you should be eating plenty of complex carbs (about 50-60% of your diet.) The best sources of complex carbs are: [12] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Fruits (which are especially good for busy, on-the-go teens, because fruits like apples, oranges, pears, and bananas are so portable) starchy vegetables (such as potatoes and corn) Green vegetables Wholegrains Beans Legumes (such as peas, soy, and peanuts). [13] X Research source"
    },
    {
      "title": "Seek out good fats.",
      "content": "Seek out good fats. Less than 30% of your diet should be fats, but you have to stick to the good kind. (Don't be fooled by fast food and sweets. Those kind of fats aren't good for you.) Fats help absorb important vitamins, including A, D, E, and K, all of which you need to stay fit and healthy. The best fats are unsaturated. They are found in foods such as olives, peanuts, cashews, avocado, walnuts, salmon, and anchovies. Busy teens may want to ask their parents to stock up on packets of nuts as a great portable snack full of lots of good fat. Particularly if you're trying to bulk up, you may want to include some saturated fats (like milk and red meat) in your diet. Though too many can lead to heart disease, they're generally okay in moderation. If you're trying to lose weight, you may want to stay away from this kind of fat. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Trans fats are the bad ones. They are found in most commercially sold baked goods, fried foods, and box mixes. Stay away from these, especially if you're trying to lose weight. [15] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Consume healthy dairy products.",
      "content": "Consume healthy dairy products. They increase bone health, which is really important if you're trying to get in shape. If you're trying to bulk up, switch to whole-fat milk instead of low-fat. Low-fat or skim milk is a better option if you're trying to lose weight. [16] X Research source Mozzarella cheese sticks are a great snack if you're in a hurry. Yogurt is also pretty portable and even comes in squeeze-tubes now."
    },
    {
      "title": "Eat lean proteins.",
      "content": "Eat lean proteins. This is crucial if you're trying to get stronger or if you participate in sports. Protein helps you build muscle. Legumes, chicken, turkey, and fish are good options."
    },
    {
      "title": "Drink water.",
      "content": "Drink water. Stick with water over juice, soda, or even sports drinks (which tend to be quite sugary). You'll need lots of water (about 8 to 10 glasses if you're over 13) in order to stay hydrated if you're trying to get in shape."
    }
  ]
}