{
  "url": "https://www.wikihow.com/Lead-a-Heterosexual-Lifestyle-if-You-Are-Gay",
  "title": "How to Lead a Heterosexual Lifestyle if You Are Gay",
  "steps": [
    {
      "title": "Ask yourself why you feel the need to pretend to be straight.",
      "content": "Ask yourself why you feel the need to pretend to be straight. Understanding your reasons is important, so you can sort out your feelings and also recognize when things change. You might pretend to be straight for one (or many) of the following reasons: Your family is homophobic You could be kicked out of your home if you're LGBTQ Religious confusion Internalized homophobia"
    },
    {
      "title": "Tell yourself that you have a new hidden identity for now.",
      "content": "Tell yourself that you have a new hidden identity for now. Your straight identity is only a cover for you; it's not a better version of you. Your goal is to pass for straight. Your mission will eventually come to an end."
    },
    {
      "title": "Hang up pictures",
      "content": "Hang up pictures of 'opposite' gender people. Teens frequently decorate their walls and lockers with images of people they find attractive, so use images of traditionally 'opposite' gender people and celebrities to enhance your cover."
    },
    {
      "title": "Make up a crush on someone who is unattainable (optional).",
      "content": "Make up a crush on someone who is unattainable (optional). Direct your fake straight attraction toward a 'hot' celebrity. This is a low-risk method, as many teenagers (regardless of sexual orientation) have crushes on musical artists or actors. If you fake a celebrity crush, you can go to extra mile to convince people you're straight and say things like, \"his blue eyes make me swoon\" or \"I love her confidence and poise.\""
    },
    {
      "title": "Present 'according' to your gender if it would be risky not to do so.",
      "content": "Present 'according' to your gender if it would be risky not to do so. Adjust your appearance as part of your cover. Adhering to gender roles will help when you're undercover. Consider it like a costume. Draw the line on anything itchy or uncomfortable, because that's just no fun. If you're a expected to dress in a feminine way, try wearing dresses , shorts , skirts , jewelry, or feminine colors. If you're expected to dress in a masculine manner, wear jeans , t-shirts , and masculine colors."
    },
    {
      "title": "Be wary of groups that may coerce, bully, or otherwise abuse you into playing it straight.",
      "content": "Be wary of groups that may coerce, bully, or otherwise abuse you into playing it straight. Instead, find friends and people you can truly trust with your identity. A truly supportive friend group offers unconditional support and love. If they're \"supporting\" you but only if you pretend you're straight, that's not true support and may be toxic. A truly supportive community doesn't offer conditional support. If they're \"supporting\" you but only if you choose to act like you aren't gay, that isn't true support and it may be toxic."
    },
    {
      "title": "Keep an eye on your mental health and take care of yourself.",
      "content": "Keep an eye on your mental health and take care of yourself. Staying closeted involves increased mental health risks,so you need to take extra good care of yourself. Exercise daily, eat healthy foods, and get plenty of sleep at night. [1] X Research source [2] X Research source"
    },
    {
      "title": "Find a place where you can be completely yourself.",
      "content": "Find a place where you can be completely yourself. Find a place where you can simply be yourself without fear of being discovered or mistreated. This can be at a friend's house, grandparent's home, or your even your bedroom. [3] X Research source"
    },
    {
      "title": "Consider whether the loneliness of pretending to be interested in a \"straight\" activity you despise is worth it.",
      "content": "Consider whether the loneliness of pretending to be interested in a \"straight\" activity you despise is worth it. LGBTQ men may feel pressure to enjoy sports, and queer women might feel pressure to enjoy fashion and makeup, but it's okay to enjoy or not enjoy those things, regardless of gender."
    },
    {
      "title": "Confide in people you can trust.",
      "content": "Confide in people you can trust. Perhaps you can talk to a friend or family member, or maybe you can go to an online community for LGBTQ youth. This can be a source of unconditional love and support."
    }
  ]
}