{
  "url": "https://www.wikihow.com/Make-Rangoli-with-Flowers",
  "title": "How to Make Rangoli with Flowers",
  "steps": [
    {
      "title": "Create or print the design for your rangoli.",
      "content": "Create or print the design for your rangoli. Search for ideas online if you’re unsure of what you’d like your rangoli to look like. Most designs are geometric or resemble a large flower, though some are very complex and represent Hindu goddesses (especially Lakshmi). If you find a design online that you like, you can print it off to copy later, or start drawing your own unique idea either by hand or on the computer. [1] X Research source Symmetry can also be a big component of rangoli. North India values large, flowing designs, whereas the Tamil version focuses on intricacy and symmetry. Whichever way you choose to go, make sure to pick a pattern that you love! One of the lovely things about rangoli is that it can be any size you’d like, and it can follow simple or complex patterns."
    },
    {
      "title": "Practice sketching the design before you draw it on the ground.",
      "content": "Practice sketching the design before you draw it on the ground. If you’re designing your own rangoli rather than printing one from the computer to trace, it’s a great idea to practice drawing the design a few times before you commit to it. Use paper and pencil to sketch out the design and add any additional flourishes you’d like. Keep in mind that you’ll be drawing the rangoli in chalk, which can smear easily, so practice creating your design from the top down if you can. This will make it less likely that you’ll rub the chalk away with your hand or arm as you complete the design."
    },
    {
      "title": "Choose a location for the rangoli where it can be enjoyed.",
      "content": "Choose a location for the rangoli where it can be enjoyed. Traditionally, rangoli are placed on the ground near the entrance to a home. If you have a front porch, put the rangoli just outside the front door and off to the side so it’s out of the way of foot traffic. If you live somewhere where the weather is rainy or windy, you may want to draw the rangoli inside. Try placing it inside the house near the front door or the entrance to a sitting room. Make sure to leave enough space for people to walk by it. If you’re putting the rangoli inside and have pets, you may want to make your rangoli on top of a table or somewhere it’ll be out of reach."
    },
    {
      "title": "Use chalk to draw the outline of your rangoli on the ground.",
      "content": "Use chalk to draw the outline of your rangoli on the ground. Once you’ve decided on a design and practiced it a few times, lightly sketch out the design on the ground. On the smaller side, rangoli have a 1 ft (12 in) diameter, but they can be as big as 3 ft (36 in) across. Take your time and enjoy the process! [2] X Research source The chalk will end up being covered by the flowers, but the design will help you put those flowers in the right places to create your beautiful flower rangoli."
    },
    {
      "title": "Choose 3 or more colors or types of flowers for your design.",
      "content": "Choose 3 or more colors or types of flowers for your design. Depending on what’s available to you either from your own garden or from the store, choose a variety of flowers to fill your rangoli. Orange, yellow, white, red, purple, and green are common options. Mums, daisies, roses, and even peonies are great types of flowers to use. [3] X Research source Each section of your rangoli will be decorated with a different type or color of flower. Even within a section, you could create lines and patterns by alternating the colors."
    },
    {
      "title": "Trim the stems off of the flowers you intend to use whole.",
      "content": "Trim the stems off of the flowers you intend to use whole. Cut away the stems and any green leaves attached to your flowers so that just the head is left. Keep the types and colors of flowers separated so that it’s easier to access them once you start laying them out. Wait to gather and trim the flowers until the day you make your rangoli. That will keep your flowers looking fresh and vibrant for longer."
    },
    {
      "title": "Pick the individual petals from flowers to use as a loose decoration.",
      "content": "Pick the individual petals from flowers to use as a loose decoration. Roses and daisies have beautiful petals that you can pick off to fill in gaps in your rangoli design. When using loose petals, keep in mind where your rangoli is going to be located. Petals are easily blown away by wind or a fast-opening door. You may have to warn your family to be more cautious around the rangoli because there isn’t a way to secure them to the ground. [4] X Research source It’s okay if the petals are a little uneven in size—they’ll all be mixing together in the design and chances are that no one will notice."
    },
    {
      "title": "Fill the entire rangoli design with alternating colors and types of flowers.",
      "content": "Fill the entire rangoli design with alternating colors and types of flowers. Place one type of flower in each section of the rangoli. Don’t leave any gaps between the different kinds of flowers—you shouldn’t be able to see the floor through the petals and flowers. [5] X Research source For example, if you create a flower-shaped rangoli, the center of the flower could be filled with red rose petals, which could then be circled by yellow mums, and each petal of the design could be filled with a separate type of flower."
    },
    {
      "title": "Place candles around the rangoli to finalize the design.",
      "content": "Place candles around the rangoli to finalize the design. Candles are generally placed in the center and corners of the rangoli design. Put them on stands or in clay pots, and light them when the sun goes down. Never leave lit candles unattended! Make sure to blow them out when you go to bed or leave the house."
    },
    {
      "title": "Enjoy your rangoli for several days or for the entire course of Diwali.",
      "content": "Enjoy your rangoli for several days or for the entire course of Diwali. Because you’re using live flowers, the rangoli won’t last forever. Enjoy it for 2 to 3 days, or until the flowers start to wilt. If you made the rangoli for Diwali, leave it in place for the entire celebration and replace any wilting or browned flowers with fresh ones. Take the time to straighten up the flowers and petals if they get out of place. This will keep the design looking nice for the entire time it’s on display."
    }
  ]
}