{
  "url": "https://www.wikihow.com/Happy-Birthday-Old-Man-Funny",
  "title": "50 Funny Quotes, Jokes, & Birthday Messages for an Older Man",
  "steps": [
    {
      "title": "Poke fun at his age with a short and simple birthday message.",
      "content": "Poke fun at his age with a short and simple birthday message. Whether you’re writing a card , shooting a text, or saying your wish in person, throw in a lighthearted joke about aging to make him smile . Humor is one of the best ways to deepen your relationship. [1] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source So, craft a silly message to lift his spirits and shower him with love. Happy one year closer to retirement, old man! Best birthday wishes to my favorite senior citizen. Don’t count the years. Count the hairs left on your head! Happy birthday, old fart. So glad you’re still alive and cake-ing! Older? Definitely. Wiser? Not so much. Happy birthday, old man! Happy birthday, old sport. Cheers to another year…closer to death. Happy birthday. Remember, it’s better to be over the hill than under it! Don’t forget to smile (while you still have teeth). Happy birthday, ya old fart! A true friend remembers your birthday but not your age. Happy birthday, old man! Happy birthday, old man. Don’t forget to iron out the wrinkles in your birthday suit. You might be prehistoric, but at least you’re not extinct. Happy birthday, you fossil! It’s time to celebrate the oldest person I know. Happy birthday to an ancient artifact! Happy, happy birthday! I kept the receipt for your gift, just in case you didn’t make it! If anyone calls you old this year, don’t stress…Just throw your cane and dentures at them!"
    },
    {
      "title": "Crack a joke about the downsides of aging to make him laugh.",
      "content": "Crack a joke about the downsides of aging to make him laugh . If you’re writing to a friend or family member, feel free to tease him and show off your sense of humor. Bring up his lack of energy or deteriorating health, or make a joke about the limited number of birthdays he has left. Just make sure you’re close enough so you don’t offend him or hit a nerve! [2] X Research source Happy birthday, you old timer. Don’t hurt yourself blowing out all those candles! Whatever you do, don’t let aging get you down. It might be too difficult to get back up! I know you don’t like birthdays, but the good news is that you don’t have many more left! Age is just a number, but in your case, it’s a pretty huge one…Happy birthday, old man! Don’t worry about getting older. Pretty soon you won’t be able to remember your age anyway! Happy birthday, bud! You’ve reached the point where it’s probably best to start lying about your age. Happy birthday, grandpa ! Remember to save some air from your oxygen tank to blow out your candles. We might need a fire extinguisher to put out all the candles on your cake this year…Happy birthday, old man! I know they say, “with age comes wisdom,” but you’re the prime example that being older doesn’t make you wiser. Happy birthday, you dinosaur! I wish I could figure out how old you are, but you know I’ve never been good with big numbers. Happy birthday, old man! It’s amazing to be young, energized, and full of life. Do you remember what that feels like? Happy birthday, old timer! I’m a firm believer that you can be anything you want. In your case, that’s anything but young. Sorry, old man, you missed the train for that one!"
    },
    {
      "title": "Share a famous birthday quote when you’re at a loss for words.",
      "content": "Share a famous birthday quote when you’re at a loss for words. If you’re struggling to find the right sentiments, get help from someone else! Choose an author, celebrity, or public figure that the birthday boy admires, and use their words to share your well wishes. A silly quote is an easy way to get the laughs going and make him feel cared for . “I’m at an age when my back goes out more than I do.” —Phyllis Diller “Nice to be here? At my age, it’s nice to be anywhere.” —George Burns “The older you get, the better you get. Unless you are a banana.” —Betty White “You know you’re getting old when the candles cost more than the cake” —Bob Hope \"You know you’ve aged when you read events you lived in a history book.\" ―Will Ferrell “Just remember, once you’re over the hill you begin to pick up speed.” —Charles Schultz \"The secret of staying young is to live honestly, eat slowly, and lie about your age.\" ―Lucille Ball “I was brought up to respect my elders, so now I don’t have to respect anybody.” —George Burns Eventually you reach a point when you stop lying about your age and start bragging about it.” —Will Rogers “Growing old is like being increasingly penalized for a crime you have not committed.” —Anthony Powell “Inside every older person is a younger person—wondering what the hell happened.” —Terry Pratchett “You’ve heard of the three ages of man: Youth, middle age, and you’re looking wonderful.” —Cardinal Spellman “As you get older three things happen. The first is your memory goes, and I can’t remember the other two.” —Sir Norman Wisdom “Middle age is when you’re sitting at home on a Saturday night and the telephone rings and you hope it isn’t for you.” —Ogden Nash"
    },
    {
      "title": "Send him a belated birthday wish if you missed the big day.",
      "content": "Send him a belated birthday wish if you missed the big day. Even if your message didn’t arrive in time for the big day, shoot the birthday boy a belated message to let him know he’s in your thoughts. Incorporate humor to lighten the mood, like telling him that your message got stuck in traffic or that he should be more forgiving with age. It’s not my fault…Facebook forgot to remind me about your birthday! Yes, I forgot your birthday. But on the bright side, I forgot your age too! Sorry I wasn’t there to mourn the loss of your youth. Stay sharp, old man! With age comes patience. Thanks for waiting on my belated birthday wishes, old man! I’m sorry these birthday wishes are belated. To be honest, I didn’t think you’d live this long. These birthday wishes are a little late because I spent all day yesterday wondering when we got so old. Happy birthday, you old timer! I couldn’t decide what to get for your birthday, so I landed on the gift of suspense. Happy belated birthday to the oldest person I know! I know this message is a little late, but good things come to those who wait. Happy birthday, old man! Remember to enjoy all the time you have left! You know what they say—every year, you’re older, wiser, and more forgiving. So, please forgive me for missing your birthday…Love you, old fart! I’m running a little fashionably late to the party, but that doesn’t mean I can’t wish you the best of birthdays. Here’s to another year closer to hook-and-loop fastener shoes!"
    }
  ]
}