{
  "url": "https://www.wikihow.com/Hands-Behind-Back-Pose",
  "title": "What Does It Mean When Someone Puts Their Hands behind Their Back?",
  "steps": [
    {
      "title": "If their shoulders and chest are open, they feel confident.",
      "content": "If their shoulders and chest are open, they feel confident. When someone’s back is straight with their feet shoulder-distance apart, they take up a lot of space and look well-balanced. Their arms are behind their back, leaving their chest exposed, suggesting that this person is feeling confident, powerful, and comfortable in their environment. [1] X Research source Body language cues: The feet are slightly pointed out, shoulders are back, chest looks “puffed-out,” and arms are relaxed. Their hands might touch each other but are not clasped, ready to swing around in a split second if someone challenges them. Differences to note: This version of the pose is more expanded than the others, with the shoulders back and feet pointed out, which indicates dominance. Their relaxed arms and open chest indicate that this person isn’t afraid about what anyone else is going to do to them. [2] X Research source Examples: You might notice when people in positions of power go into this pose, like CEOs, royal figures, and politicians. [3] X Research source Policemen, priests, and teachers might also use this pose to show that they’re in charge."
    },
    {
      "title": "If their stance is relaxed and comfortable, they feel at ease.",
      "content": "If their stance is relaxed and comfortable, they feel at ease. When a person puts their hands behind their back with their back straight or slightly leaned forward, it might mean they feel open and comfortable. Their exposed chest suggests that they don’t feel anxious or threatened—instead, they feel completely at ease in their environment. Body language cues: Their feet are shoulder-width apart, their legs are slightly bent, their hands are located at the small of their back, and their back is straight or slightly bent. Differences to note: In the military, a leader might command their soldiers to be “at ease,” meaning they stand relaxed with their hands behind their backs. However, others might look even more relaxed, with their arms completely limp behind them. Examples: You might see a person taking a leisurely stroll through the park with their hands comfortably behind their back. Older or elderly people with back problems might also place their hands behind their backs because it’s more comfortable."
    },
    {
      "title": "If they clasp their wrist or arm behind their back, they feel insecure.",
      "content": "If they clasp their wrist or arm behind their back, they feel insecure. When someone stands with their shoulders slumped forward and one of their hands clasping their wrist or arm, they can appear smaller and less balanced. This less powerful, more submissive version of the pose might mean the person’s feeling insecure or uncomfortable. [4] X Research source Body language cues: A straight back, feet close together, noticeable arch in the lower back, and straight or tense arms. If they clasp their wrist, both arms are behind their back. If they clasp their arm, one of their arms is behind their body, and the other is visible but slightly pulled back. Differences to note: This pose has more tension than the first pose, which can slow the person’s reactions. The arm or wrist clasp might also be a way to comfort themselves. If their stance is even more tense, it might mean they’re trying to control frustration or anger. [5] X Research source Examples: You may see someone clasp their arm behind their back when they’re talking to their crush for the first time or when they’re about to give a presentation. This pose is most common in children and teens, but adults might also use this position."
    },
    {
      "title": "If their body is angled away, they want to leave the conversation.",
      "content": "If their body is angled away, they want to leave the conversation. When someone talks openly and confidently, they might make gestures with their hands . [6] X Research source However, a person with their hands behind their back and their body pointing away from you might want to leave the current situation as soon as possible. This pose can also be a sign they have something to hide. Body language cues: Their body is tilted away from you, they’re looking down or away, their hands are clasped together, and their feet are pointing in the opposite direction as the person they’re talking to. Differences to note: This pose is similar to the arm or wrist-clasp version, but usually their hands are clasped together and their body is turned away. Examples: You might see someone go into this pose in the middle of an awkward conversation or when someone brings up a topic they’re sensitive about."
    },
    {
      "title": "Facial expressions can reinforce what you think the other person is feeling.",
      "content": "Facial expressions can reinforce what you think the other person is feeling. In combination with body movement, posture, and gestures, reading facial expressions can help you estimate what the other person is thinking or feeling. Even something as small as a tilt of the head or a shift of the eyes can clue you into what the other person is knowingly or unknowingly expressing. [7] X Research source For example, when you bring up an uncomfortable topic, the other person might look away, their smile might falter, or they might subtly shift their feet to show that they want to leave the conversation. Unlike some gestures, facial expressions are universal across all cultures. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Inconsistencies can let you know if someone might not be telling the truth.",
      "content": "Inconsistencies can let you know if someone might not be telling the truth. Nonverbal communication repeats and often strengthens the message that the other person is making verbally. However, it can also contradict what the person says, indicating that they might not be telling the truth. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, when you ask someone a question, they might shake their head “no” while they verbally say “yes.” If your friend has a big presentation today, they might put their hands behind their back and slouch forward, but when you ask them how they’re feeling about it, they might lie and say that they feel confident and prepared."
    },
    {
      "title": "Context clues can help you figure out nonverbal signals.",
      "content": "Context clues can help you figure out nonverbal signals. Nonverbal body language can be interpreted in many different ways depending on the situation, the relationships between the people in conversation, and the person’s culture. [10] X Research source Try not to read too much into a person’s nonverbal cue, and instead consider how all the signals work together. For example, if you’re having a conversation with your boss and they have their hands behind their back, they’re probably feeling dominant and confident. On the other hand, if you’re talking to a person you don’t know very well or to someone who is known for being shy and they place their hands behind their back, they might be feeling more insecure or nervous."
    }
  ]
}