{
  "url": "https://www.wikihow.com/Make-Gray",
  "title": "How to Make Gray",
  "steps": [
    {
      "title": "Mix black and white.",
      "content": "Mix black and white. Combining black and white will result in a color known as \"neutral gray.\" Neutral gray is the purest type of gray you can create because it has no other tint or hue. Equal parts of black and white should create a mid-tone gray. Vary the shade by adding more of either color. More black creates a darker gray, and more white creates a lighter gray."
    },
    {
      "title": "Combine equal parts of complementary colors.",
      "content": "Combine equal parts of complementary colors. Mixing two complementary colors will result in a color classified as \"complementary gray.\" The basic color complements are: Red and green Yellow and purple Blue and orange Combining equal parts of any two complements will result in a flat gray, [1] X Research source but you can give the gray a slight tint by adding more of one color than the other. Adding more red, yellow, or orange will result in a \"warm\" gray, but adding more green, purple, or blue should result in a \"cool\" gray."
    },
    {
      "title": "Blend the three primary colors.",
      "content": "Blend the three primary colors. When you combine all three primary colors, the resulting color can be called \"primary gray.\" The three primary colors are red, blue, and yellow. Mixing equal parts should produce a flat gray, but you can create tints by using more or less of certain colors. Using more blue should result in a cooler tone, but using more red or yellow without additional blue can create warmer tones."
    },
    {
      "title": "Choose which type of gray to create.",
      "content": "Choose which type of gray to create. Neutral gray, complementary gray, and primary gray are easy to create with paint , but the best option depends on the paint colors you have and the desired application. [2] X Research source Neutral gray can be a great way to tone done other colors without altering the actual hue. Overall, it works best when you know you'll need gray in its purest form. Complementary gray works best if you want to give cool or warm tints to the hue of the gray. Primary gray works well when you need to create shadows or pair the gray next to a brighter color. Since primary gray contains all three primary colors, it can make nearby secondary colors look brighter. [3] X Research source"
    },
    {
      "title": "Combine equal amounts of the appropriate colors.",
      "content": "Combine equal amounts of the appropriate colors. Pour equal amounts of the involved colors into a paint dish or onto a paint palette. Mix thoroughly using a painter's stick until the colors are equally blended. To review, your color options are: Black and white Red and green Yellow and purple Blue and orange Red, yellow, and blue Blending the colors should result in gray paint. If you used “pure” hues, the resulting gray should be fairly flat in appearance. If the colors used weren't pure hues, however, you may notice a slight tint. [4] X Research source"
    },
    {
      "title": "Lighten or darken as desired.",
      "content": "Lighten or darken as desired. Examine the shade of the developed gray. If it seems too dark or too light, you can add white or black paint to alter the shade. Add white to lighten the gray or black to darken it. Work in small amounts of either color, though, to avoid altering the shade more than necessary. Use white and black to alter the shade regardless of which type of gray (neutral, complementary, primary) you made. Adding any other color will ultimately affect the hue instead of the shade."
    },
    {
      "title": "Tint as desired.",
      "content": "Tint as desired. Examine the hue of the developed gray. It it seems too dull for your liking, you can tint the gray by adding more color. Add small amounts of the color regardless of which one you use. If you don't like the results, it'll be easier to fix them if you've only altered the color in small degrees. If you made complementary or primary gray, add more of any color used to produce the original gray. In other words, if you made gray with blue and orange paint, you should only add more blue or more orange (not red, yellow, green, or purple). If you made neutral gray, you can still tint the gray with color. In fact, you can mix nearly any paint color into the gray to create a wider variety of tints."
    },
    {
      "title": "Pick the type of gray.",
      "content": "Pick the type of gray. Neutral gray is the easiest to create when working with icing , but you can still make complementary and primary grays. It's best to stick with neutral gray if you want a pure hue, but you can consider the other two types if you'd prefer a tinted gray. Since readily available packages of liquid food color come with red, yellow, green, and blue, you'll need to create primary (red, yellow, blue) gray or complementary (red and green) gray if you plan to use standard liquid food coloring . If you buy specialty gel or paste food coloring, however, you can create any of the three types since these food colorings have a wider variety of color options."
    },
    {
      "title": "Drop the involved colors into white icing.",
      "content": "Drop the involved colors into white icing. Spoon the needed amount of white frosting into a glass bowl. Gradually add the involved colors and mix until fully combined. As a reminder, the color options are: Black and white (note: you do not need to add white food coloring since the icing itself is white) Blue and orange Yellow and purple Red and green Red, yellow, and blue Add liquid food coloring by dropping it in with the bottle's dropper cap. Add paste or gel colors by dipping a toothpick into the color and swirling the same toothpick into the white icing, thereby transferring the color. [5] X Research source"
    },
    {
      "title": "Add black to darken the gray.",
      "content": "Add black to darken the gray. If you like the tint of the gray but want a darker shade, mix small amounts of black into the frosting until you reach the desired hue. You can darken the icing with black food coloring regardless of the colors used to produce the gray. Alternatively, you should be able to create a more vibrant shade by adding more of the original colors to the icing. The higher concentration of color will make the gray brighter. This can be tricky, however, since you'll need to use the exact same amounts of each color to avoid changing the hue."
    },
    {
      "title": "Tint the gray with color as desired.",
      "content": "Tint the gray with color as desired. If the gray seems a little too flat, try mixing in a small amount of some other color to slightly alter the hue. For neutral gray, you can tint the hue using nearly any other color. [6] X Research source For complementary and primary grays, you should only tint the hue by adding a greater amount of one color already involved. For instance, if you made the gray with red, blue, and yellow food dye, you should only use red, blue, or yellow tints (not green, purple, or orange)."
    },
    {
      "title": "Choose the gray you wish to create.",
      "content": "Choose the gray you wish to create. You can make neutral, complementary, or primary gray using polymer clay. Choose whichever option appeals most to you. If you want to create a pure gray without any tint, it's best to create a neutral gray. If you do want to tint the gray, though, primary or complementary grays can simplify the process and reduce your overall number of supplies."
    },
    {
      "title": "Pinch off equal parts of the involved colors.",
      "content": "Pinch off equal parts of the involved colors. Grab equal amounts of each involved color. Knead the colors separately, then knead them together. Your color options are: Black and white Blue and orange Red and green Yellow and purple Red, yellow, and green To knead the colors together, simply stick the separate colors together and roll the mashed ball in between your hands, flattening and re-rolling as needed. Continue until no marbling remains. The colors should be evenly mixed into a solid gray."
    },
    {
      "title": "Lighten the color, if desired.",
      "content": "Lighten the color, if desired. If you want to lighten the color without changing its value, knead a pinch of translucent clay into the ball of gray. [7] X Research source Translucent clay has no color, so it won't change the shade or hue of the gray. Instead, it will simply make the gray seem duller and less vibrant. When choosing how much translucent clay to use, the total amount should not exceed one-third the total amount of your gray clay."
    },
    {
      "title": "Lighten the shade, if desired.",
      "content": "Lighten the shade, if desired. When you want to lighten the actual shade of the gray, knead a small amount of white into the existing ball. You can add white regardless of the colors used to create the original gray. While you could technically darken the color by adding black, it can be difficult to mix black clay into other colors without ruining them. Darkening neutral gray in this manner is much easier, though, since it already contains a black component."
    },
    {
      "title": "Consider tinting the clay.",
      "content": "Consider tinting the clay. Once you're satisfied with the saturation of color and shade, determine whether or not you want to add a tint. Tint the clay by mixing in small amounts of one color. You should be able to use nearly any color when tinting neutral gray, but you'll need to stick with one of the original colors when tinting complementary or primary grays."
    }
  ]
}