{
  "url": "https://www.wikihow.com/Make-Chemical-Solutions",
  "title": "How to Make Chemical Solutions",
  "steps": [
    {
      "title": "Define a percent by weight/volume solution.",
      "content": "Define a percent by weight /volume solution. A percent solution simply means parts per hundred. For example by weight: A 10% solution by weight simply means that you have 10 grams of compound dissolved in 100 mL of solution. [1] X Research source For an example by volume: A 23% solution by volume simply means that you have 23 mL of liquid compound in every 100 mL of solution."
    },
    {
      "title": "Identify the volume of solution you want to make.",
      "content": "Identify the volume of solution you want to make. In order to determine the mass of the compound needed, you must first determine the final volume of the solution you want to make. The volume will be determined by how much solution you need for your task, how frequently you will need it, and the stability of the solution over time. For example: Make a 5% solution of NaCl in 500 mL of water. Make only the amount you need if the solution must be made fresh every time it is used. If the solution is stable long-term, you can make a larger volume to store and use later."
    },
    {
      "title": "Calculate the number of grams needed to make the solution.",
      "content": "Calculate the number of grams needed to make the solution. To calculate the number of grams needed to make your percent solution, you will multiply using the formula: # grams = (percent desired)(desired volume/100 mLs). The percent desired will be expressed in grams and the desired volume must be expressed in milliliters. [2] X Research source For example: Make a 5% solution of NaCl in 500 mL of water. # grams = (5)(500mL/100mL) = 25 grams If the NaCl was already dissolved in liquid form, you would add 25 mL of NaCl instead of grams of powder and subtract that volume from the final volume, i.e. 25 mL of NaCl into 475 mL of water."
    },
    {
      "title": "Weigh out the mass of the compound.",
      "content": "Weigh out the mass of the compound. Once you have calculated the desired mass, you need to weigh it out. Using a calibrated balance, place a weighing dish and zero it out. Weigh out the necessary amount of compound in grams and set it aside. For example: Weigh out 25 g of NaCl. Always clean the balance of any powder before continuing to make the solution."
    },
    {
      "title": "Dilute the compound with the necessary amount of solvents.",
      "content": "Dilute the compound with the necessary amount of solvents. Unless otherwise stated, you will probably be diluting the compound in water. Using a graduated cylinder (a measuring device used specifically for volume), measure out the desired amount of liquid. Mix with powdered compound until dissolved. [3] X Research source For example: Mix 500 mL of water and 25 g of NaCl to make a 5% solution. Remember, if you’re diluting a liquid compound, you must subtract out the volume of liquid being added from the final volume: 500 mL – 25 mL = 475 mL of water. Clearly label the container with both the chemical and the concentration."
    },
    {
      "title": "Identify the formula weight",
      "content": "Identify the formula weight (FW) of the compound you are using. The formula weight (often used interchangeably with molecular weight) of a compound will be listed in grams/mole (g/mol) on the side of the chemical bottle. If you cannot find the formula weight on the bottle, you can search for the compound online to find it. [4] X Research source For example: The formula weight of sodium chloride (NaCl) 58.44 g/mol. The formula weight of a compound is the mass in grams of one mole of the compound."
    },
    {
      "title": "Define the volume of the solution you are making in liters.",
      "content": "Define the volume of the solution you are making in liters. It is very simple to make a 1-liter solution since molarity is measured in moles/liter; however, you may need to make more or less than a liter depending on what you’re using the solution for. You will use the final volume of the solution to calculate the number of grams needed to make your molar solution. [5] X Research source For example: Make a 50 mL solution of 0.75 molar NaCl. To convert mL to L, divide by 1000: 0.05 L."
    },
    {
      "title": "Calculate the number of grams needed to make the desired molar solution.",
      "content": "Calculate the number of grams needed to make the desired molar solution. To calculate the number of grams needed you will use the equation # grams = (desired volume)(desired molarity)(formula weight). Remember, the desired volume needs to be in liters, molarity is in moles per liter, and formula weight is in grams per mole. [6] X Research source For example: If you want to make 50 mL of a 0.75 molar solution of NaCl (FW: 58.44 g/mol), you can calculate the number of grams of NaCl needed. # grams = 0.05 L * 0.75 mol/L * 58.44 g/mol = 2.19 grams NaCl. When you cancel all units, you should be left with grams of the compound."
    },
    {
      "title": "Weigh out the mass of the compound.",
      "content": "Weigh out the mass of the compound. Using a properly calibrated balance, weigh out the necessary mass of the compound. Place a weighing dish on the balance and zero it out before weighing. Add the compound to the dish until you have the correct amount. For example: Weigh out 2.19 grams of NaCl. Clean the balance when you are finished using it."
    },
    {
      "title": "Dilute the powder in the appropriate liquid volume.",
      "content": "Dilute the powder in the appropriate liquid volume. Most solutions will be diluted using water unless otherwise specified. The volume of the liquid to be used is the same that you used to calculate the mass of the compound. Mix the compound and the water together until the powder is fully dissolved. For example: Using a graduated cylinder (measuring equipment for volume), measure 50 mL of water and mix it with the 2.19 g of NaCl. Mix until the powder is fully dissolved. Clearly label the solution with the molarity and the compound so it can be easily identified in the future."
    },
    {
      "title": "Define the concentration of each solution.",
      "content": "Define the concentration of each solution. When diluting solutions, you must know the concentration of the working stock and the final concentration that you want your solution to have. This method is useful for diluting highly concentrated solutions into less concentrated solutions. [7] X Research source For example: Make 75 mLs of a 1.5 M stock of NaCl from a working stock of 5 M. The working stock is at a concentration of 5 M and you want to dilute to a final concentration of 1.5 M."
    },
    {
      "title": "Determine the volume of the solution you want to make.",
      "content": "Determine the volume of the solution you want to make. You must also define the total volume of the solution you want to make. You will calculate the amount of working solution that needs to be added in order to dilute it to the final concentration and volume. [8] X Research source For example: Make 75 mLs of a 1.5 M stock of NaCl from a working stock of 5 M."
    },
    {
      "title": "Calculate the volume of working stock to be added to the final solution.",
      "content": "Calculate the volume of working stock to be added to the final solution. To determine the amount of working stock that needs to be diluted, you use the formula V 1 C 1 =V 2 C 2 ; V 1 is volume of the working stock and C 1 is the concentration of the working stock; V 2 is the desired final volume and C 2 is the desired final concentration of the solution. [9] X Research source For example: Make 75 mLs of a 1.5 M stock of NaCl from a working stock of 5 M. To calculate the volume of the working stock needed, the equation gets rearranged to solve for V 1 : V 1 = (V 2 C 2 )/C 1 V 1 = (V 2 C 2 )/C 1 = (0.075 L * 1.5 M)/5M = 0.0225 L. Convert L back to mL by multiplying by 1000: 22.5 mL."
    },
    {
      "title": "Subtract the volume of the stock solution from the desired final volume.",
      "content": "Subtract the volume of the stock solution from the desired final volume. When diluting the stock solution, you need to make sure that you dilute to your final volume. By subtracting the volume of the stock solution to be added you will make sure the dilution is done properly. For example: You want a final volume of 75 mLs and will be adding 22.5 mL of the stock solution. Therefore, 75 – 22.5 = 52.5 mLs. This volume is the amount of dilution solution you will use."
    },
    {
      "title": "Combine the calculated volume of the stock solution with the volume of the dilution solution.",
      "content": "Combine the calculated volume of the stock solution with the volume of the dilution solution. Using a graduated cylinder (measuring equipment for volumes), measure out the volume of the stock solution and then mix it with the volume of the dilution solution. For example: Measure 22.5 mLs of the stock 5 M solution of NaCl and dilute it with 52.5 mLs of water. Stir to mix. Label the container with both the concentration and the compound: 1.5 M NaCl. Remember, if you are diluting an acid with water, always add the acid to the water."
    },
    {
      "title": "Wear proper personal protective equipment (PPE).",
      "content": "Wear proper personal protective equipment (PPE). When working with strong chemicals and solutions you want to make sure that your body is protected from harm. Wearing a lab coat, close-toed shoes, eye protection, and gloves are essentials when handling these compounds. Wear a lab coat that is made of an inflammable material. Eye protection should have side shields to protect from splashes across the face."
    },
    {
      "title": "Work in a ventilated area.",
      "content": "Work in a ventilated area. When mixing solutions together, volatile gases can be formed and escape into the air. Some chemicals can only be handled in a chemical fume hood found in a laboratory. If working at home, open windows and have a fan blowing to make sure the air circulates."
    },
    {
      "title": "Add acid to water.",
      "content": "Add acid to water. When diluting strong acids, always add the acid to the water. When water and acid mix, the reaction is exothermic (releases heat) and can be explosive if the water is added to the acid instead of the other way around. [10] X Research source Refresh your memory with the proper safety precautions every time you work with acids."
    }
  ]
}