{
  "url": "https://www.wikihow.com/How-Do-I-Find-My-Google-Password-on-My-Phone",
  "title": "How to Find Your Google Password on your Android or iPhone",
  "steps": [
    {
      "title": "Open Google Chrome on your Android.",
      "content": "Open Google Chrome on your Android. The passwords you've saved to your Google account, including any Google account passwords you've saved, are all available in the Chrome app. [1] X Research source"
    },
    {
      "title": "Tap the menu icon ⋮.",
      "content": "Tap the menu icon ⋮ . It's the three vertical dots at the top-right corner."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's the gear icon on the menu."
    },
    {
      "title": "Tap Password Manager.",
      "content": "Tap Password Manager . Chrome's Password Manager will expand. Your saved passwords are hidden until you choose to show them."
    },
    {
      "title": "Tap the Google password you want to view.",
      "content": "Tap the Google password you want to view. You can search for your Google account by typing google into the search bar. If you have multiple Google accounts, they will each display in the search results."
    },
    {
      "title": "Tap the Show Password icon.",
      "content": "Tap the Show Password icon. It's the eye icon. [2] X Research source"
    },
    {
      "title": "Enter your passcode or use a biometric to continue.",
      "content": "Enter your passcode or use a biometric to continue. You'll need to enter your PIN, fingerprint, or other verification method to display the password. If you didn't save the password you're looking for to your Google account, you can reset it . Tap the copy icon to copy your password to your Android's clipboard so you can paste it easily."
    },
    {
      "title": "Open your iPhone's Settings .",
      "content": "Open your iPhone's Settings . If you've saved your Google password when typing it into Safari or other apps on your iPhone, you should be able to find it easily in your Settings."
    },
    {
      "title": "Scroll down and tap Passwords.",
      "content": "Scroll down and tap Passwords . It's in the 5th group of settings. You'll be prompted to enter your PIN or verify Face ID or Touch ID. [3] X Research source"
    },
    {
      "title": "Tap your Google account.",
      "content": "Tap your Google account. You can search for it easily by typing google into the search bar at the top. You'll see your password represented by stars (*)."
    },
    {
      "title": "Tap your password to view it.",
      "content": "Tap your password to view it. This displays your password in plain text. Tap Copy Password to easily paste it somewhere else. If you can't find your Google password in your Settings and you use Google Chrome on your phone (or even on your home computer), try this method ."
    },
    {
      "title": "Open Google Chrome on your iPhone.",
      "content": "Open Google Chrome on your iPhone. If you've ever saved your Google password when typing it into Chrome, be it on your phone or your computer at home, you can access it using Chrome on your iPhone. If you haven't installed Chrome on your iPhone, you can do so from the app store. However, you'll need to log in with your Google account to access your saved passwords—if you don't know the password for your Google account, you can reset it , or use Chrome on your computer ."
    },
    {
      "title": "Tap the menu icon ••• .",
      "content": "Tap the menu icon ••• . It's at the bottom-right corner of Chrome."
    },
    {
      "title": "Tap Password Manager.",
      "content": "Tap Password Manager . It's the key icon at the top of the menu. You'll need to use Touch ID, Face ID, or your PIN to continue."
    },
    {
      "title": "Tap your Google account.",
      "content": "Tap your Google account. You can find it quickly by typing google into the search bar at the top."
    },
    {
      "title": "Tap the eye icon to the right of your password.",
      "content": "Tap the eye icon to the right of your password. This displays your Google password in plain text. To copy your password to paste it elsewhere, tap the password, then tap Copy ."
    }
  ]
}