{
  "url": "https://www.wikihow.com/Identify-Africanized-Honey-Bees",
  "title": "How to Identify Africanized Honey Bees",
  "steps": [
    {
      "title": "Look for a difference in size.",
      "content": "Look for a difference in size. Africanized honey bees look virtually identical to European honey bees (EHB) except for a slight difference in size. AHB are typically about 10% smaller than their counterparts, however, this is subtle and cannot be noticed with the naked eye. The size difference can usually only be noted using professional measuring instruments found in a laboratory. Not even experienced bee keepers can tell the difference simply on sight. Note the bee in the image on the left is a bumble bee. AHB are aggressive. You should not approach a hive intending to extract a bee to measure its size. Leave this to professionals."
    },
    {
      "title": "Look for differences in aggression.",
      "content": "Look for differences in aggression. European honey bees and AHB respond differently to provocation. While all bees will respond aggressively to perceived dangers to their hive, AHB much more so. Whereas a EHB may send out as few as 10-20 guard bees to respond to a threat within 20 yards (18.3 m) of the hive, AHB may send several hundred with a range of 120 yards (110 m) from the hive. [1] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source This is also seen in how many stings you can expect to receive if you encounter the hive. An AHB hive can administer as many as a thousand stings if disturbed whereas 10-20 strings is typical for a disturbed EHB hive."
    },
    {
      "title": "Notice how long it takes them to become calm after agitation.",
      "content": "Notice how long it takes them to become calm after agitation. A normal EHB hive will calm back down after around 20 minutes, resuming their normal activities and no longer buzzing with aggression. AHB on the other hand can remain aggressive for hours afterward."
    },
    {
      "title": "Look for bees that forage for pollen in small groups or alone.",
      "content": "Look for bees that forage for pollen in small groups or alone. Africanized honey bees are more solitary foragers than European honey bees and are typically considered opportunistic. AHB also tend to forage at different times than EHB. AHB forage very early in the morning or late in the evening when the sun is disappearing, unlike EHB. They also seem to be less prone to be discouraged by overcast, cold weather and even light rain whereas EHB tend to stick to sunny days and are more sensitive to poor temperatures and rain. [2] X Research source"
    },
    {
      "title": "Observe different swarm patterns in AHB.",
      "content": "Observe different swarm patterns in AHB. Swarming is when a queen leaves a hive and tens of thousands of worker bees follow in order to find and form a new hive. EHB tend to do this about once a year. AHB have smaller nests that they more readily abandon and thus will swarm 6-12 times a year. [3] X Research source This is why AHB are typically less sought after by beekeepers. This constant swarming can really reduce the population left behind in their hive and require them to introduce new queens regularly. Because of their frequency, AHB swarms tend to be much smaller than those of EHB."
    },
    {
      "title": "Use DNA testing for certainty.",
      "content": "Use DNA testing for certainty. While the common person will not have access to this sort of test, it is virtually the only way to tell with certainty whether an individual bee is a AHB. Scientist use DNA tests to confirm an African bloodline in the specimen. [4] X Research source"
    },
    {
      "title": "Look where AHB frequently nest.",
      "content": "Look where AHB frequently nest. EHB typically nest in dry, aboveground cavities. If you see an underground cavity brimming with bees, it is likely an AHB hive as they can tolerate the conditions better. Furthermore, EHB rarely nest in exposed areas whereas an AHB nest may be out in the open, such as hanging from an exposed tree branch. [5] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source AHB usually nest in much smaller places than EHB. For example, a typical EHB hive is a cavity around 10 gallons (38 L) large. For AHB the cavities are 1 to 5 gallons (3.8 to 19 L) in size. This also makes it more difficult to see AHB nests and they are usually only seen once they are provoked."
    },
    {
      "title": "Check chimneys or crawlspaces for nests.",
      "content": "Check chimneys or crawlspaces for nests. AHB will nest in many places regular European honey bees won't. Other possible nesting sites include empty containers, water meters, abandoned vehicles, old tires, lumber piles, outbuildings and sheds. [6] X Research source"
    },
    {
      "title": "Look for swarms of bees.",
      "content": "Look for swarms of bees. The best chance of identifying AHB is during their swarming season, which is March through July. Bees swarm as a means to reproduce their colonies. Worker bees will follow the queen from the hive during a swarm."
    },
    {
      "title": "Prepare your home to be bee-proofed.",
      "content": "Prepare your home to be bee-proofed. One way to avoid a run-in with AHB is to make sure they're not in or around your home. Make sure there are no gaps larger than 1 ⁄ 8 inch (0.3 cm) around chimneys or plumbing, as this is a favorite spot for bees. Install screens fine enough to prevent a bee from fitting through. Inspect any openings for bees coming and leaving your home regularly."
    },
    {
      "title": "Monitor nearby water sources.",
      "content": "Monitor nearby water sources. If you have drains, tubs, or evaporative water coolers, this can attract bees as a water source. Add a few ounces of pine-scented cleaner in the water, as long as its not a water source. If it is a bird-bath add 2 tablespoons (29.6 ml) of vinegar to deter bees in a way safe to the birds."
    },
    {
      "title": "Never attempt to remove a nest yourself.",
      "content": "Never attempt to remove a nest yourself. With the sheer aggressiveness of AHB, you should never try to remove a nest on your own, especially by hitting it, throwing rocks at it, or burning it. Look in your local yellow pages for a pest control company to call. You can also call a local beekeeper who may want the bees for their own purposes or have a more humane way to remove the colony without killing the hive."
    },
    {
      "title": "Run away quickly if AHB become aggressive.",
      "content": "Run away quickly if AHB become aggressive. Run away as fast as you can. Pull your shirt over your face to protect your head from stings. Do not run toward water as they will likely wait above the water for you. Run toward a well-lit area that may disorient the bees or shelter that can shut them out. Do not swat or flail your arms as you run. This movement will attract the bees further and possibly cause them to become more aggressive. If you see someone else being attacked, encourage them to run and find shelter but do not physically intervene. This will only increase the risk of you being dangerously hurt and do little to help the person running."
    },
    {
      "title": "Scrape, don't pull stingers.",
      "content": "Scrape, don't pull stingers. If you do get stung, do not pull the stinger out as this will release more venom. You should scrape the stingers to the side with a finger nail, dull knife, or credit card."
    },
    {
      "title": "Seek medical attention after being stung.",
      "content": "Seek medical attention after being stung. Since AHB swarm and sting so aggressively, you may not be aware of how many times you were stung. If you begin to feel ill, or know you were stung more than 15 times, seek help immediately. Other signs of when to seek help: itching, trouble breathing, dizziness, vomiting, and the swelling of your face, tongue or throat. These are all life threatening and you should not wait to see if the symptoms subside before getting help. [7] X Research source"
    },
    {
      "title": "Treat minor stings.",
      "content": "Treat minor stings. If you were only stung a few times and do not require emergency medical care, you can help alleviate the symptoms of the venom. Take an antihistamine immediately and apply hydrocortisone cream to the sting to help reduce swelling and itching. Use a cool, moist towel or ice to help alleviate sting site symptoms. Do not apply ice directly to the sting and do not use heat."
    }
  ]
}