{
  "url": "https://www.wikihow.com/Make-French-Knot-Easy-Way-Hair-Style",
  "title": "How to Make French Knot Easy Way Hair Style",
  "steps": [
    {
      "title": "Work with second day hair.",
      "content": "Work with second day hair. While some hairstyles may work best with freshly washed, perfectly clean hair, the French knot actually works best with slightly dirty hair. When hair is immaculately clean, it’s often silky and hard to hold in place. While satin hair is often nice, it will slide out of your pins and the hairstyle won’t hold for the entire day. Hair that hasn’t been washed in a day or two will be full of natural oils that will help you create a shape that stays. [1] X Research source If you have your heart set on wearing a French knot right now but you just washed your hair, don’t worry. You can mimic second day hair with product, which will be discussed later."
    },
    {
      "title": "Comb out your hair.",
      "content": "Comb out your hair. Before you start creating your French knot, it’s important to work out all the tangles and knots. Begin combing from the bottom, slowly bringing your comb higher and higher. Don’t tug on your hair, as that can cause breakage. If you come across a tangle, gently focus on that section of hair until it’s untangled. Continue combing until you’re confident all of the tangles have been worked out."
    },
    {
      "title": "Spray with dry shampoo or a texturizing spray.",
      "content": "Spray with dry shampoo or a texturizing spray. This step is especially important if your hair was recently washed, but it’s helpful to use a product on second or third day hair as well. Dry shampoo or texturizing spray both add a bit of “grit” to your hair, giving it texture that will keep it in your bobby pins. [2] X Research source If your hair is silky and sleek, spray your hair with one of these products to make it a bit more coarse. Start spraying the product about an inch from your roots, coating your hair thoroughly and then running your hands through your hair to work the product in."
    },
    {
      "title": "Divide your hair into three sections.",
      "content": "Divide your hair into three sections. There should be two front sections on either side of your face, and one section down the back of your head. All of the sections should be equal sizes, so the actual size of each section will differ depending on how much hair you have on your head! Part your hair however you normally do. Side or middle parts both work fine. You will be working with the back section first, so bring the two front sections in front of your shoulders. [3] X Research source If it is helpful, you can also clip the two front sections out of the way."
    },
    {
      "title": "Tease the hair in the back section.",
      "content": "Tease the hair in the back section. You want to tease the hair at the base, or roots, of the middle section of hair you created. Teasing your hair is a simple way to create volume and to create texture for bobby pins to hold onto. It will ensure that your French knot stays in place. [4] X Research source Grab a teasing comb, and place it a couple of inches away from the root of your hair. Gently back-comb, or push your hair up, by moving the comb towards the root of your hair. In other words, you are strategically roughing up the hair, creating a little patch of “tangles” at the root of your hair. Do this only on the hair at the bottom of the middle section. Feel free to clip the top of the middle section out of the way to do this successfully."
    },
    {
      "title": "Brush your hair into ponytail position.",
      "content": "Brush your hair into ponytail position. Use a flat brush to sweep the two front sections of hair toward the back. Use your hand and your brush to combine them with the middle section of hair, bringing them together as if you were creating a ponytail. Hold your hair in this position, but do not secure it with a hair tie. [5] X Research source"
    },
    {
      "title": "Twist your ponytail to create the knot.",
      "content": "Twist your ponytail to create the knot. Twist your ponytail at the base so that you feel it tighten up near your scalp. [6] X Expert Source Sarah Kosakowski Professional Hair Stylist Expert Interview. 3 September 2021. Then bring the length of your ponytail to your head, so that it’s flattened against your head. After your hair is tucked to your head, gently push on one side of the ponytail so that it becomes tucked into your hair. In other words, the hair from the ponytail should almost become concealed, pushed into the rest of your hair. [7] X Research source This is the part of your French knot that will require practice. It is helpful to bring up a YouTube tutorial for this part so you can see what this step actually looks like. After you understand the concept, practice it a few times. Soon, you will develop muscle memory and the French knot will become second nature!"
    },
    {
      "title": "Slide bobby pins into the knot to hold it in place.",
      "content": "Slide bobby pins into the knot to hold it in place. Open the bobby pins a bit with your fingers, so that they can grasp a bigger section of hair. Slide them into your knot so that they are holding both the “knot” section created by the ponytail and the hair at the base. [8] X Expert Source Sarah Kosakowski Professional Hair Stylist Expert Interview. 3 September 2021. Use as many bobby pins as you need until the knot feels secure. [9] X Research source Because you will probably end up using a fair amount of bobby pins, find ones that match your hair color. The French knot should appear simple and effortless, and the bobby pins should be invisible."
    },
    {
      "title": "Style any short pieces near your face.",
      "content": "Style any short pieces near your face. If you have bangs or short wisps that frame your face, style them however you like. Leave them untouched, create a soft curl with a curling iron, or make a sleek, straight style with a flat iron. If you would rather not have any hair near your face, use extra bobby pins to pull these strands back and secure them at the sides of your head."
    },
    {
      "title": "Spray your French knot with hairspray.",
      "content": "Spray your French knot with hairspray. Even if your hair feels completely secure with bobby pins, it’s smart to give your French knot a spritz of hairspray as well. [10] X Expert Source Sarah Kosakowski Professional Hair Stylist Expert Interview. 3 September 2021. This will ensure that your knot stays in place all day, and it will also help to eliminate frizz. Don’t over-do it– no one wants their hair to look like hard plastic. Hold the hairspray about 6 inches away from your hair and only hold down the spray for a second. Once you’ve applied the hair spray, avoid touching your French knot. This can cause frizz and ruin the sleek look you’ve created."
    },
    {
      "title": "Bring bobby pins along with you.",
      "content": "Bring bobby pins along with you. If you’re going to be out of the house all day, make sure you throw a couple of bobby pins in your purse or backpack. The French knot is a great style because of its simplicity and elegance, but one big stray hair can really throw off the entire thing. In case of stray pieces of hair, turbulence, or unforeseen bad weather, it’s always important to bring emergency touch-up supplies!"
    }
  ]
}