{
  "url": "https://www.wikihow.com/Jailbreak-an-iPhone",
  "title": "How to Jailbreak an iPhone",
  "steps": [
    {
      "title": "Make sure your iPhone is compatible.",
      "content": "Make sure your iPhone is compatible. Checkra1n works on iPhone 5s through iPhone X models running iOS 12 through iOS 13. For iOS 14.0 (not 14.1), Checkra1n currently offers preliminary support for iOS 14 and only works for iPhone 6s, 6s Plus, SE, iPad 5th generation, iPad Air 2, iPad mini 4, iPad Pro 1st generation, Apple TV 4 and 4K, iBridge T2. [1] X Research source Support for more iPhone and iPad models should be added in the coming weeks."
    },
    {
      "title": "Go to https://checkra.in/releases/0.11.0-beta in a web browser.",
      "content": "Go to https://checkra.in/releases/0.11.0-beta in a web browser. This is the official website for Checkra1n. Checkra1n is a semi-untethered jailbreak. This means that it will only work until your iPhone or iPad is rebooted. Once it is rebooted, you will need to use the Checkra1n app on your Mac or Linux computer to re-activate the jailbreak."
    },
    {
      "title": "Scroll down and click Download for MacOS or for whichever version of Linux you are using.",
      "content": "Scroll down and click Download for MacOS or for whichever version of Linux you are using. This downloads the install file for Checkra1n. [2] X Research source"
    },
    {
      "title": "Open the install file.",
      "content": "Open the install file. You can open it directly from your web browser or your Downloads folder. Follow any instructions needed to install the file. Especially on Linux. On Mac, just drag the Checkra1n icon into your Applications folder."
    },
    {
      "title": "Connect your iPhone to your Mac.",
      "content": "Connect your iPhone to your Mac. Use the lightning cable that came with your iPhone to connect it to a free USB port on your Mac or Linux computer."
    },
    {
      "title": "Open Checkra1n.",
      "content": "Open Checkra1n. It has an icon that resembles two Chess pieces. Click the icon in your Applications folder to open Checkra1n. Make sure you iPhone is detected by Checkra1n when it opens."
    },
    {
      "title": "Click Start.",
      "content": "Click Start . It's in the lower-right corner of the Checkra1n app. This begins the jailbreak process. If you are running an unsupported iPhone model, you can still try to install the checkra1n jailbreak on your device. Just be aware that it might not work properly. Proceed at your own risk. To allow it to install on an unsupported device, click Options and then check \"Allow untested iOS/iPadOS/tvOS versions\"."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . This puts your iPhone or iPad in recovery mode. You will see an image of a lightning cable on your iPhone screen."
    },
    {
      "title": "Read the instructions and click Start.",
      "content": "Read the instructions and click Start . You need to put your iPhone in DFU (Device Firmware Update) mode for this jailbreak to work. Read the instructions on the computer screen to learn how to do that. On most supported iPhones, you press and hold the Power button (top right corner) and the Home button (below the screen) at the same time. Read the instructions and then click start."
    },
    {
      "title": "Follow the instructions to put your device in DFU mode.",
      "content": "Follow the instructions to put your device in DFU mode. Press the home and power button at the same time when prompted. [3] X Research source"
    },
    {
      "title": "Release the power button.",
      "content": "Release the power button. Continue to hold the Home button, but release the power button when prompted. This will put your iPhone in DFU mode. You will see the Apple logo with the Checkra1n logo appear on your iPhone's screen. You will also see some text appear on the screen. When it is finished, the jailbreak will have been applied. If you open the Checkra1n app on your iPhone, it gives you the option to install Cydia, the unofficial app store for jailbreak apps and tweaks."
    },
    {
      "title": "Make sure your iPhone is running a supported version of iOS.",
      "content": "Make sure your iPhone is running a supported version of iOS. The software is frequently updated to work with new versions of iOS, but as of August 2020, the supported versions are iOS 11 – iOS 13.5.5 Beta (excluding 13.5.1). [4] X Research source To check, go to https://unc0ver.dev and scroll down to \"Compatible\" near the middle of the page. To find out which version of iOS you're using, open the Settings app, tap General , tap About , and look at the number to the right of \"Software Version.\" unc0ver is a semi-untethered jailbreak. This means that it will only work until your iPhone or iPad is rebooted. Once it is rebooted, you will need to use the unc0ver app on your Mac or Linux computer to re-activate the jailbreak."
    },
    {
      "title": "Install AltStore on your Mac.",
      "content": "Install AltStore on your Mac. This application allows you to access the tool that can jailbreak your iPhone. Use the following steps to download AltStore: Go to https://altstore.io and Click the macOS link at the bottom of the page. Unzip the downloaded file called altserver.zip in your default downloads folder. Once unzipped, you'll see a file called AltServer.app . In Finder, drag AltServer.app to your Applications folder. [5] X Research source"
    },
    {
      "title": "Open AltServer.",
      "content": "Open AltServer. You can do this by double-clicking its icon in the Applications folder. This adds a diamond-shaped icon to your Mac's menu bar near the top-right corner of the screen. AlterServer.app requires macOS 10.14.4 or higher to operate."
    },
    {
      "title": "Click the AltServer icon and select Install Mail Plugin.",
      "content": "Click the AltServer icon and select Install Mail Plugin . This installs a plugin for the Mail app."
    },
    {
      "title": "Enable AltPlugin for the Mail app.",
      "content": "Enable AltPlugin for the Mail app. Use the following steps to install the AltPlugin for the Mail app: Open the Mail app in the Applications folder. Select the Mail menu Select Preferences . Click the General tab. Click Manage Plug-ins . Check the box next to \"AltPlugin\". Apply the changes and restart the Mail app."
    },
    {
      "title": "Connect your iPhone to your Mac.",
      "content": "Connect your iPhone to your Mac. Use the lightning cable that came with your iPhone or one that's compatible and connect your iPhone to a free USB port on your computer. If your iPhone asks if you want to trust the computer, select the option to do so."
    },
    {
      "title": "Click the AltStore icon and select your iPhone.",
      "content": "Click the AltStore icon and select your iPhone. You'll be prompted to sign in."
    },
    {
      "title": "Log in with your Apple ID and click Install.",
      "content": "Log in with your Apple ID and click Install . Use the same Apple ID you use on your iPhone. This installs the AltStore app on your iPhone."
    },
    {
      "title": "Set up your iPhone to trust AltStore.",
      "content": "Set up your iPhone to trust AltStore. This is necessary for installing Unc0ver. Perform the following steps on your iPhone to do this: Open your Settings app. Select General . Tap Device Management . Tap your Apple ID. Tap Trust twice."
    },
    {
      "title": "Download unc0ver.",
      "content": "Download unc0ver. Now that you've allowed AltStore through your iPhone's security, you can install the jailbreak tool. Use the following steps to download UnC0ver: Open a web browser on your iPhone. Go to https://unc0ver.dev . Tap Download v8.0.2 . Tap Download to confirm. This starts the installation."
    },
    {
      "title": "Install unc0ver.",
      "content": "Install unc0ver. Use the following install the unc0ver jailbreak: Open AltStore on your iPhone. Tap My Apps at the bottom of the screen. Tap Refresh All Enter your Apple ID and password again and tap Sign in . Tap + in the upper-right corner. Tap the \"unc0ver_8.0.2.ipa\" file Tap the green 7 Days button next to unc0ver to complete the installation."
    },
    {
      "title": "Open UnC0ver.",
      "content": "Open UnC0ver. It's the white icon on your home screen with a black \"UO\" inside."
    },
    {
      "title": "Tap the blue Jailbreak button.",
      "content": "Tap the blue Jailbreak button. When the jailbreak is complete, you'll see a message that says \"Jailbreak Completed.\""
    },
    {
      "title": "Tap OK on the confirmation message.",
      "content": "Tap OK on the confirmation message. This reboots your iPhone."
    },
    {
      "title": "Run the Jailbreak tool in Unc0ver a second time.",
      "content": "Run the Jailbreak tool in Unc0ver a second time. When your iPhone comes up, re-open Unc0ver and tap Jailbreak again. [6] X Research source When the jailbreak is complete this time, tap OK again, and wait for your iPhone to reboot again. This time, when the iPhone comes back up, it'll be jailbroken."
    },
    {
      "title": "Install iCloud..",
      "content": "Install iCloud.. You need to download and install iCloud from the Apple website (not the Microsoft Store). If you've already installed it from the Microsoft Store, right click it in the Windows Start menu and click Uninstall . Then use the following steps to install iCloud from the Apple Store: Go to https://support.apple.com/en-us/HT204283 Click download iCloud for Windows on Apple's website below the Microsoft Store link. Open the iCloudSetup.exe file in your Downloads folder Follow the instructions to install iCloud and sign in with your Apple ID."
    },
    {
      "title": "Install AltStore on your PC.",
      "content": "Install AltStore on your PC. Now you'll need to install a tool that makes it possible to jailbreak your iPhone. To install AltStore: Go to https://altstore.io . Click Windows (beta) to download the ZIP file. Right-click altinstaller.zip in your default downloads folder, select Extract all , and then Extract . Double-click Setup.exe in the newly extracted folder to run the installer. Click Next Click Browse to select an install location or select Next to continue. Click Next again. Click Yes to allow the installation to continue. Click Close ."
    },
    {
      "title": "Connect your iPhone to your PC.",
      "content": "Connect your iPhone to your PC. Use the lightning cable that came with your iPhone or one that's compatible to connect your iPhone to a free USB port on your computer. unc0ver is a semi-untethered jailbreak. This means that it will only work until your iPhone is rebooted. Once it is rebooted, you will need to use the unc0ver app on your Mac or Linux computer to re-activate the jailbreak."
    },
    {
      "title": "Tap Trust on your iPhone when prompted.",
      "content": "Tap Trust on your iPhone when prompted. This will pop up after the iPhone is connected to the computer."
    },
    {
      "title": "Install the AltStore on your iPhone.",
      "content": "Install the AltStore on your iPhone. Use the following steps to install AltStore on your iPhone: Click the AltStore icon in the system tray (near the clock) on your PC. It looks like a hollow diamond, and you may have to click the up-arrow to the left of the clock to see it. Click Install AltStore . Select your iPhone. Enter your Apple ID and password Click Install ."
    },
    {
      "title": "Set up your iPhone to trust AltStore.",
      "content": "Set up your iPhone to trust AltStore. This is necessary for installing Unc0ver. Perform the following steps on your iPhone to do this: Open your Settings app. Select General . Tap Device Management . Tap your Apple ID. Tap Trust twice."
    },
    {
      "title": "Download unc0ver.",
      "content": "Download unc0ver. Now that you've allowed AltStore through your iPhone's security, you can install the jailbreak tool. Use the following steps to download UnC0ver: Open a web browser on your iPhone. Go to https://unc0ver.dev . Tap Download v5.3.1 . Tap Download to confirm. This starts the installation."
    },
    {
      "title": "Install unc0ver.",
      "content": "Install unc0ver. Use the following install the unc0ver jailbreak: Open AltStore on your iPhone. Tap My Apps at the bottom of the screen. Tap Refresh All Enter your Apple ID and password again and tap Sign in . Tap + in the upper-right corner. Tap the \"unc0ver_5.3.13.ipa\" file Tap the green 7 Days button next to unc0ver to complete the installation."
    },
    {
      "title": "Open UnC0ver.",
      "content": "Open UnC0ver. It's the white icon on your home screen with a black \"UO\" inside."
    },
    {
      "title": "Tap the blue Jailbreak button.",
      "content": "Tap the blue Jailbreak button. When the jailbreak is complete, you'll see a message that says \"Jailbreak Completed.\""
    },
    {
      "title": "Tap OK on the confirmation message.",
      "content": "Tap OK on the confirmation message. This reboots your iPhone."
    },
    {
      "title": "Run the Jailbreak tool in Unc0ver a second time.",
      "content": "Run the Jailbreak tool in Unc0ver a second time. When your iPhone comes up, re-open Unc0ver and tap Jailbreak again. [7] X Research source When the jailbreak is complete this time, tap OK again, and wait for your iPhone to reboot again. This time, when the iPhone comes back up, it'll be jailbroken."
    }
  ]
}