{
  "url": "https://www.wikihow.com/Give-Cats-Liquid-Medicine",
  "title": "How to Give Cats Liquid Medicine",
  "steps": [
    {
      "title": "Position your cat.",
      "content": "Position your cat. Gently carry your cat to your dosing area (i.e. the towel) and make sure your voice is soothing, happy, and relaxed. Place the cat in the middle of the towel, facing you."
    },
    {
      "title": "Immobilize the cat.",
      "content": "Immobilize the cat. At this point, you will need to ensure that the cat cannot wiggle or escape during the dosing. If your cat is very placid, it may be sufficient to hold it. If you have an assistant, he or she should place a hand on each of the cat's shoulders and gently grips the cat's upper forelegs. This keeps the cat still and stops it from lifting a front paw to scratch. [1] X Research source BSAVA Textbook of Veterinary Nursing. Cooper and Mullineux. BSAVA Publications You or the assistant can also cuddle the cat to your chest or stomach, to stop the cat backing away or wriggling sideways. [2] X Research source BSAVA Textbook of Veterinary Nursing. Cooper and Mullineux. BSAVA Publications If your cat is wiggly or likely to scratch you, you'll need to wrap the cat in the towel. Wrap your feline snugly, with just its head protruding. A snug fit around the neck ensures the claws are safely contained inside and cannot scratch you. [3] X Research source BSAVA Textbook of Veterinary Nursing. Cooper and Mullineux. BSAVA Publications To do this, fold one half of the towel over the cat's back and repeat with the opposite half so that the cat is contained within the towel. Take up any slack in the towel around its neck, so that its front legs are pinned against its body and contained within the towel. If you have an assistant, have him or her put their hands on the outside of the towel, over the cat's shoulders, to steady the animal."
    },
    {
      "title": "Open the cat's mouth.",
      "content": "Open the cat's mouth. Form an inverted \"C\" shape with the forefinger and thumb of your left hand. Place this upside-down C over the cat's head. Your fingertip and thumb should be resting on either side of the corner of its mouth, with your palm resting on the cat's forehead. Gently press inwards with the fingertip and thumb, pressing the cat's upper lips over its upper cheek teeth (the molars). [4] X Research source Jones' Animal Nursing. Jones. Publisher: Pergamon Press. 5th edition If you are left-handed, use your right hand to open the cat's mouth so your left hand is free to administer the medication. This approach forces the cat to open its mouth slightly in order to avoid biting its own lip, while also minimizing the likelihood that you will be bitten."
    },
    {
      "title": "Raise the cat's head.",
      "content": "Raise the cat's head. Once the cat has opened its mouth a little, angle its head upwards towards the ceiling. [5] X Research source Jones' Animal Nursing. Jones. Publisher: Pergamon Press. 5th edition This can be done without shifting your left-hand grip, simply by rotating your wrist. Tipping its head upwards helps the lower jaw to drop down a little, opening the mouth wider."
    },
    {
      "title": "Place the syringe in the cat's mouth.",
      "content": "Place the syringe in the cat's mouth. Pick up the syringe in your free hand and rest the hub of the syringe (the open end) just behind the cat's lower fangs (the long teeth at the front of the lower jaw), angled over the tongue. [6] X Research source BSAVA Textbook of Veterinary Nursing. Cooper and Mullineux. BSAVA Publications Ideally, the end of the syringe should be able to touch the cat's molars. [7] X Expert Source Natalie Punt, DVM Veterinarian Expert Interview. 14 September 2021."
    },
    {
      "title": "Begin administering the medicine.",
      "content": "Begin administering the medicine. Gently and slowly press the syringe's plunger so that about half a milliliter of fluid is dribbled into the cat's mouth. [8] X Research source BSAVA Textbook of Veterinary Nursing. Cooper and Mullineux. BSAVA Publications [9] X Expert Source Natalie Punt, DVM Veterinarian Expert Interview. 14 September 2021. Once you have put medicine in the cat's mouth, it will move its tongue and try to swallow. Some cats like to lower their head to swallow, so you may need to relax your wrist so that her head can drop down to a more natural position for swallowing. [10] X Research source BSAVA Textbook of Veterinary Nursing. Cooper and Mullineux. BSAVA Publications"
    },
    {
      "title": "Finish dosing the medicine.",
      "content": "Finish dosing the medicine. After the cat has had a chance to swallow, give it another half milliliter of medicine. Repeat this process until you have administered the full prescribed dose."
    },
    {
      "title": "Reward the cat.",
      "content": "Reward the cat. Talk soothingly to the cat as you slowly unwrap the towel. Most likely, the cat will run off as soon is it can, but if it doesn't give it some affection and maybe a tasty treat. Rewarding the cat after giving it medicine will make it less resentful and make the task easier next time."
    }
  ]
}