{
  "url": "https://www.wikihow.com/Live-the-Life-You-Want",
  "title": "Yes! You Deserve to Live the Life You Want - And Here's How",
  "steps": [
    {
      "title": "Ask yourself if you like the way you spend your free time.",
      "content": "Ask yourself if you like the way you spend your free time. Do you tend to spend your time doing whatever your family and friends want to do? What are your hobbies and do you pursue them every chance you get? Can you name the things that most fascinate you in this world? Be brutally honest with yourself. [1] X Research source For example, if you have a free afternoon, do you find yourself automatically streaming whatever is on Netflix to pass the time? Do you have any hobbies that you've neglected lately? Is there anything new you'd like to learn about? For instance, if you used to draw every day but you haven't picked up your sketchpad in months, consider doing that instead of watching Netflix. If you used to be an avid cyclist but your bike has been collecting dust in the garage, go for a ride. If you're planning to spend Saturday gardening and a friend invites you to go shopping, do you drop your plans and go with your friend every time? It’s okay to say “no” sometimes and spend your time the way you want to."
    },
    {
      "title": "Challenge the beliefs you grew up with to see how they hold up.",
      "content": "Challenge the beliefs you grew up with to see how they hold up. Everyone is introduced to beliefs and values as children. As you get older and become your own person, it's important to ask yourself if those beliefs and values truly resonate with you. If they don’t, you don’t have to live your life according to those values. [2] X Research source For example, if you grew up in a strict Catholic home but Catholicism doesn’t feel right to you, that's okay. Spend time looking into other faiths and exploring your spirituality. Maybe you grew up being told there are only two genders, but you've never felt connected to the sex you were assigned at birth. There’s nothing wrong with you! Many people feel that way and even science acknowledges that gender isn’t binary. Explore and figure out what feels right to you. [3] X Research source"
    },
    {
      "title": "Try new things to figure out your true interests and talents.",
      "content": "Try new things to figure out your true interests and talents. Life doesn’t always provide opportunities to discover what you love to do and what you’re truly good at. Sometimes you have to go searching for those things. The best way to do that is by exploring your interests, trying new things, and being open to new opportunities. [4] X Expert Source Sandra Possing Life Coach Expert Interview. 15 July 2020. The more things you try, the more you’ll learn about yourself. [5] X Research source For example, if you’re interested in dance but you can’t afford dance classes, don’t let that stop you. Look up video tutorials online and give them a try. Watch dance performances on YouTube. Immerse yourself in your interests. If you’ve always secretly wanted to be a writer, read books about writing, take writing classes, and start writing your own stuff. If this process feels right to you, you're on the right path. If you've always wanted to learn computer coding, get a few books or explore online and take a crack at it. There may be free courses you can take, as well. Maybe you've always loved to swim but rarely do it. Make it a point to head to the community pool more often."
    },
    {
      "title": "Identify what a happy, successful life looks like to you.",
      "content": "Identify what a happy, successful life looks like to you. It’s easy to adopt others’ opinions about success and make them your own. Spend some time thinking about what success means to you. What lifestyle will be fulfilling for you? What really matters to you in the long run? What kind of work do you really want to do? [6] X Research source It helps to write your thoughts down on paper. Let the ideas flow and don't stop to think about how a certain idea is impossible or unattainable for you. For example, maybe success to you means traveling and being able to work from anywhere in the world. Or maybe it's your dream to have a big, comfortable house and be part of a close-knit family. [7] X Research source It's normal to have different ideas about what success is. Write them all down. You might also have separate lists for success in your personal life and career success."
    },
    {
      "title": "Seek out relationships with people who accept your authentic self.",
      "content": "Seek out relationships with people who accept your authentic self. If you're afraid to show your real self to someone, you may want to ask yourself why and reconsider their place in your life. Try to surround yourself with people who encourage and support you no matter what. You deserve to feel comfortable expressing your values and principles without fear of being judged. Hold your closest friends and significant others to these standards. [8] X Research source You don't have to cut people out of your life if their opinions don't line up with yours. Just like you, they need to be true to their inner selves! They must respect your views and be able to agree to disagree on certain matters, though. For example, maybe you and your best friend don't see eye to eye on political matters. That doesn't mean you can't be best friends anymore! If you can respect each other's opinions without trying or needing to \"convert\" the other person, that's a good sign. Some fundamental differences can't be compromised. For example, if you come out as transgender to a friend and they refuse to call you by your preferred pronouns, they don't respect your identity. [9] X Research source That's not a supportive friend."
    },
    {
      "title": "Pursue a fulfilling career that reflects who you really are.",
      "content": "Pursue a fulfilling career that reflects who you really are. It's easy to end up on a career path that doesn't fulfill you, especially if your dream career isn't lucrative or respected by the people who are important to you. Don't get society's idea of a successful career mixed up with what you really want to do, though! The work you do every day needs to be meaningful to you and other opinions don't really matter. [10] X Research source For example, maybe your parents want you to be a doctor, but your dream is to be a librarian who manages special collections. If your parents refuse to pay for school if you pursue library science, don't give up hope. Explain to them how much this means to you and why. If they still refuse, apply for scholarships and consider taking online classes to save money. Maybe you want to start your own animal shelter for Persian cats but every time you mention it your friends or family members, they give you a strange look or shake their heads. Don't let their reactions discourage you!"
    },
    {
      "title": "Make a list of your major goals in life.",
      "content": "Make a list of your major goals in life. Now that you're getting to know yourself on a deeper level, you can start making changes. Write down a short list of your main goals in life. [11] X Expert Source Sandra Possing Life Coach Expert Interview. 15 July 2020. Ask yourself what major accomplishments matter to you and what you dream about achieving. Be as specific as you can, but don’t worry if the goals seem far away or impossible from where you’re sitting now. Just get them down on paper. [12] X Research source For example, you might write down goals like getting a college degree, having children, writing a novel, and traveling the world."
    },
    {
      "title": "Break each goal down into smaller, more attainable goals.",
      "content": "Break each goal down into smaller, more attainable goals. Achieving smaller goals along the way makes your progress feel real and boosts your motivation. Think about what specific actions you need to take to get closer to each goal. Start small and write down everything so you can easily keep track of your progress. [13] X Research source For example, if you want to write a novel, write down goals like taking a creative writing class, creating a plot, working out your outline, and finishing the first chapter. If you want to start your own business, write down goals like writing a business plan, researching your customer base, and creating a business logo."
    },
    {
      "title": "Create goals that are measurable to track and celebrate your wins.",
      "content": "Create goals that are measurable to track and celebrate your wins. Revise your goals so that each one can be tracked and measured easily. It helps to assign time frames to your goals, too. That way, you can break goals down into weekly or monthly tasks. [14] X Research source For example, if your goal is to write a novel, assign a realistic time frame for that, like a year. Then, break it down further: aim to complete your research in 2 months, write a chapter a month, and finish at least 5 pages per week. Celebrate each goal that you achieve, big or small, to motivate you along the way. [15] X Research source"
    },
    {
      "title": "Reevaluate your goals regularly and adjust them when you need to.",
      "content": "Reevaluate your goals regularly and adjust them when you need to. Goals shift and evolve over time. You’ll also define new goals to add to your list as you go along. Evaluate your list and make changes at regular intervals that feel right to you—weekly, monthly, or even annually. Put your new intentions down in words to stay on track. For example, maybe you enroll in culinary school without any particular specialty in mind. As you get deeper into your coursework, you discover that you have a particular knack for pastry-making. Update your goals to include pastry classes next semester. Another example: you start writing a novel and discover that you're much better at writing dialogue than prose. You might update your goals to include a class on screenplay writing or set aside time to experiment with that."
    },
    {
      "title": "Learn to tune out your inner critic and sidestep negative thoughts.",
      "content": "Learn to tune out your inner critic and sidestep negative thoughts. Everyone has an inner critic that causes them to doubt themselves. You might find yourself having negative thoughts like, “I’ll never succeed,” “I can’t do this,” or “There’s no point in even trying.” Try following a zero-tolerance policy for negative thoughts. As soon as your mind starts going down that path, put a stop to the thought immediately and refocus. It takes practice but you can do it! To achieve your goals, you have to learn to ignore that nagging little voice because it doesn't have your best interests at heart. [16] X Research source If you recently experienced a setback, your inner critic can get even louder. You might think things like, “Are you sure you really want this?” “You don’t have the skills for this,” or \"This is hopeless.” Those thoughts aren't true. Don't let your inner critic dictate your beliefs or actions."
    },
    {
      "title": "Challenge yourself to get out of your comfort zone.",
      "content": "Challenge yourself to get out of your comfort zone. People tend to be most comfortable with thoughts, activities, and lifestyles that are familiar to them. However, living an authentic life may require you do new and unfamiliar things. This can be hard and even a little scary! Whenever something triggers fear or discomfort in you, make yourself examine what’s causing those feelings. Once you know what’s fueling them, you'll understand yourself better and be able to overcome the feelings more easily. [17] X Expert Source Sandra Possing Life Coach Expert Interview. 15 July 2020. [18] X Research source For example, you might want to pursue a career as an actor, but you’re prone to stage fright. Take an acting class or sign up for community theater so you can work on overcoming that fear."
    },
    {
      "title": "Learn to be comfortable with being different.",
      "content": "Learn to be comfortable with being different. Everyone wants to feel accepted and part of a crowd or tribe of their own. It’s human nature. Living the way you want may lead to decisions or actions that other people don’t understand or can't relate to. Being authentic requires you to overcome the desire to fit in and be okay with standing out from the crowd. [19] X Research source For example, you may have to speak up when you don’t agree with something your friends are doing or saying."
    },
    {
      "title": "Don't expect everyone to fully embrace what you’re doing.",
      "content": "Don't expect everyone to fully embrace what you’re doing. When you make big changes in your life, you can’t convince everyone you’re on the right path or expect every person in your life to be supportive. They may try to talk you out of something or tell you why you’re “wrong.” Don’t allow anyone to bully or pressure you to conform to their views if you don’t share them. [20] X Research source Ask yourself if you really need the go-ahead from your parents, friends, or peers to make changes in your life that make you happy. At the same time, try to keep in open mind when other people have view points that are different from yours. Work to understand both sides. Spend most of your time around people who don't try to stifle who you are. If they can't handle the real you, you may need to leave them behind."
    },
    {
      "title": "Be patient with yourself.",
      "content": "Be patient with yourself. Change doesn’t happen overnight and living the way you want to live is a life-long process. It takes time to explore your thoughts, emotions, and values, and those may shift or evolve over time. Don’t rush big changes in your life! Give yourself time to adjust to one change at a time before charging headlong into another. [21] X Research source"
    }
  ]
}