{
  "url": "https://www.wikihow.com/Make-Writing-One-of-Your-Favorite-Hobbies",
  "title": "How to Make Writing One of Your Favorite Hobbies",
  "steps": [
    {
      "title": "Find suitable ways to record your writing.",
      "content": "Find suitable ways to record your writing. Some people prefer writing with pen and paper, such as in a notebook. Some prefer typing into a word processor such as a computer, iPad or laptop. Many people like to combine both approaches, as this allows for different modes of thinking, working, sitting, relaxing, and so forth. Try each and then combine them to find your favorite approach. [1] X Research source You could even try typing on an old typewriter if you'd like. Old typewriters can be found through online trade and auction sites. However, keep in mind if you choose this method that you'll also need a supply of typing ribbon and/or ink."
    },
    {
      "title": "Decorate your notebooks.",
      "content": "Decorate your notebooks. If you're using notebooks, decorating them can help to keep you inspired. This can be as simple as sticking a favorite logo or sticker on the front or as elaborate as adding scrapbook cut-outs, fabric collage or decoupage. The decorations are completely up to you, as long as the notebook has an interesting look to it that'll inspire you to pick it up and write in it."
    },
    {
      "title": "Jot down ideas.",
      "content": "Jot down ideas. This is the first good habit to get into. Write down things you think you'd like to write about as you come across them. While many of these ideas may amount to nothing, some may turn into your next poem, news article, great American novel, or other writing piece. If you don't note down these ideas as they occur to you, you'll be likely to forget them. [2] X Research source Consider carrying a small notebook and pen or having a note-taking app on your smartphone. Having at least one of these with you wherever you go will help you record those ideas as they come to you."
    },
    {
      "title": "Use photographs as inspiration.",
      "content": "Use photographs as inspiration. These may be ones you've taken or that you've found. Photographs can be another source of inspiration for inspiring your writing. For example, perhaps you have seen an amazing photo of a place taken by a friend and uploaded to social media. The photo captivates you and carries you away to another time and land, and words about this experience begin to form in your mind. That's a great form of inspiration! Consider keeping a Pinterest or similar account filled with your favorite images as you find them. Keep the board secret if you don't want to share your writing inspiration."
    },
    {
      "title": "Listen to other people.",
      "content": "Listen to other people. Take note of what inspires other people, what they like to read and learn about and what's current both now and in the past. All of these tidbits can feed into inspiring your writing."
    },
    {
      "title": "Write lists, paragraphs and poems.",
      "content": "Write lists, paragraphs and poems. These are all practice prompts. Once you have chosen the best ideas from these, you will probably feel ready to start the writing process for a more elaborate piece. [3] X Research source"
    },
    {
      "title": "Decide what sort of writing you're keen to do.",
      "content": "Decide what sort of writing you're keen to do. There are a vast array of writing activities possible, including book summaries, book critiques, blog posts, short stories, poems, novels, non-fiction, journal entries, commentaries, essays, website reviews, and so on. You might like to try a few different ones to find which niche you're most comfortable in. Also, since writing novels or non-fiction can take a long time, mixing in some other styles of writing can help to keep you interested in writing as a hobby. [4] X Research source"
    },
    {
      "title": "Make time to write.",
      "content": "Make time to write. Just as with any hobby, you'll need to set aside time to indulge in it. Write regularly so that you stay in the swing of it. The longer your breaks are, the less likely it is that you'll feel like returning to a piece of writing. Small breaks are good, but don't stretch them out for too long. Set aside time-slots during your week just for writing. Keep these times as much as possible, seeing them as important for your hobby."
    },
    {
      "title": "Write somewhere you feel comfortable.",
      "content": "Write somewhere you feel comfortable. Though some may not want others around them, it's entirely up to you whether you are okay with people around you when you're writing. If you wish to hole yourself up in the attic or gazebo, that's fine, as is sitting in a café and penning your piece amid the hubbub of others chatting away. Choose whatever works best for you, noting that this may change over time or even back and forth over days and weeks. [5] X Research source"
    }
  ]
}