{
  "url": "https://www.wikihow.com/Knit-a-Teddy-Bear",
  "title": "How to Knit a Stuffed Bear",
  "steps": [
    {
      "title": "Choose your yarn and needles.",
      "content": "Choose your yarn and needles. Choose your yarn based on the color bear you would like to make. You want the knitting to be dense enough that the stuffing does not show through the material so use needles 2-3 sizes smaller than you would normally use for the yarn you have chosen. [1] X Research source"
    },
    {
      "title": "Cast on 40 stitches.",
      "content": "Cast on 40 stitches. Casting on is the process of starting the first stitches on the knitting needle before beginning to knit. There are many different methods for casting on depending on your experience level and the look you want to try. Easy beginner methods include the backwards loop cast on and the long tail cast on."
    },
    {
      "title": "Knit in garter stitch for 32 rows.",
      "content": "Knit in garter stitch for 32 rows. Garter stitch is great for this project because it forms a sturdy and flexible piece of knitting. It is also a good stitch for beginners to learn and you can remember it with the poem “back, around, over and under.”"
    },
    {
      "title": "Place a colored thread on the last row.",
      "content": "Place a colored thread on the last row. When you reach row 32 place a colored thread in the middle of the row to mark the location of the neck."
    },
    {
      "title": "Continue to knit an additional 34 rows.",
      "content": "Continue to knit an additional 34 rows. Keep knitting in garter stitch for an additional 34 rows so that you end up with 66 total rows. At each end of this final row, place a colored thread. These colored threads mark where the body stops and the legs begin."
    },
    {
      "title": "Knit 20 stitches and continue for 39 rows.",
      "content": "Knit 20 stitches and continue for 39 rows. Knit 20 stitches, which is half the width of the pattern, and then continue for an additional 39 rows. Cast off at the end of these 40 total rows. This is your first leg."
    },
    {
      "title": "Turn the pattern around and stitch the other leg.",
      "content": "Turn the pattern around and stitch the other leg. Turn the pattern around and rejoin the yarn to the other 20 stitches on the body of the pattern. Knit 40 rows on this side of the pattern, completing the other leg. Once finished, cast off these stitches."
    },
    {
      "title": "Knit the first arm.",
      "content": "Knit the first arm. Starting on a new section, cast on 20 stitches and then knit 40 rows. Cast off. This forms one of the arms of your teddy bear and will be attached later."
    },
    {
      "title": "Repeat this for the other arm.",
      "content": "Repeat this for the other arm. Again, cast on 20 stitches and then knit 40 rows to create the piece for the second arm of your teddy."
    },
    {
      "title": "Fold the body in half to create the head and body.",
      "content": "Fold the body in half to create the head and body. Bring the left edge of your pattern to the right edge and sew down the edges to connect them. Sew them together from the top edge of the pattern where you cast on to the row with the marker at the top of the legs. Rotate the shape so that this seam is on the back of the teddy bear. Use a blunt tipped needle to sew the pieces together to make it easier. If you are a beginner, then you can use the backstitch to sew the pieces together. Starting from one side simply push the needle down through both layers and bring around the edge and push down through the same location to begin. Then move over one-quarter inch and bring the needle back up through both layers. Continue stitching until you reach the end of the seam."
    },
    {
      "title": "Sew the inside leg and foot seams.",
      "content": "Sew the inside leg and foot seams. Now that the seam is on the back of the teddy bear there will be two pieces at the bottom that will form the legs. Sew from the top of the legs all the way down the inside seam to the bottom foot seam to close the legs. Do this on both legs. You can again use the backstitch to sew the seams."
    },
    {
      "title": "Stuff your teddy.",
      "content": "Stuff your teddy. Use cotton or any type of stuffing to fill the teddy bear. Do not overstuff but fill the teddy completely, including the legs and feet."
    },
    {
      "title": "Sew the head closed.",
      "content": "Sew the head closed. Sew the top seam of your pattern shut to close the head. Try to round the corners slightly if possible. Again you can use the backstitch to connect the seams."
    },
    {
      "title": "Fold the arm pieces in half and sew along the edge.",
      "content": "Fold the arm pieces in half and sew along the edge. Fold the arm pieces in half lengthwise and sew along the long end and the bottom edge to make the arms and hands. You can again use the backstitch to sew these seams together if you would like."
    },
    {
      "title": "Stuff the arms and sew them closed.",
      "content": "Stuff the arms and sew them closed. Stuff the arms with the same material you used for the body of the teddy bear. Then close the tops of the arms."
    },
    {
      "title": "Attach the arms.",
      "content": "Attach the arms. Attach the arms of the teddy bear to the body using a simple backstitch or other stitch that you prefer. The arms should be attached just below the neck on each side."
    },
    {
      "title": "Sew across the corners to make the ears.",
      "content": "Sew across the corners to make the ears. Sew a rounded edge across the corners to connect the two layers and make the edges stick out like ears. To make them stick out a bit close your fingers at the base of the ears and pull them lightly before and after stitching. You can also do a gather stitch at the base of the ears to help them to stick out more. To knit a gather stitch you would knit a decrease across the length of the ear with a smaller needle size than you have been using."
    },
    {
      "title": "Gather around the neck.",
      "content": "Gather around the neck. Do a gather stitch around the neck where you placed the marker for the neck. Again, you would knit a decrease at this location to bring the neck in and differentiate the head and body."
    },
    {
      "title": "Decorate your bear.",
      "content": "Decorate your bear. Embroider the ears and face of use buttons for the eyes. You can also tie a ribbon around the neck of the teddy bear. You should also remove the markers you used earlier."
    },
    {
      "title": "Hug your new teddy bear!",
      "content": "Hug your new teddy bear! Enjoy your stuffed teddy bear or give it to a friend."
    }
  ]
}