{
  "url": "https://www.wikihow.com/Kill-Dandelions-Naturally",
  "title": "How to Kill Dandelions Naturally",
  "steps": [
    {
      "title": "Hand-pulling dandelions is the best way to get rid of them for good.",
      "content": "Hand-pulling dandelions is the best way to get rid of them for good. Moisten the soil with water, grip the dandelions tightly by their bases, and pull them out of the soil. Try to remove as much of the taproot as possible—at least several inches of it. Most dandelion taproots will be around 6 to 12 inches (15 to 30 cm) long, and removing as much of it as possible is the key to ensuring that your dandelion won’t grow back. If you don’t destroy or remove the roots of a dandelion, it will likely grow back. If you’re having trouble pulling out the roots, try using a dandelion digger . Insert the digger into the soil at a 45 degree angle, and pry the dandelion out of the soil. After pulling out the dandelions, you can put mulch or horticultural vinegar over the area where you removed the dandelions to keep any missed roots from regrowing."
    },
    {
      "title": "Boiling water quickly kills the head of the dandelion.",
      "content": "Boiling water quickly kills the head of the dandelion. Boil a pot of water and carefully pour it over the dandelion. The heat will kill the dandelion, and once the flower has shriveled up, it will naturally fall off on its own. [1] X Research source Be careful not to pour the water on any surrounding plants—you might end up hurting them. This method is a quick solution to getting rid of any pesky dandelions temporarily. Since the root system of the dandelion grows deep, for a permanent fix, you’ll need to pull it out from the ground. [2] X Research source"
    },
    {
      "title": "Rubbing alcohol can be used to make a simple weed killer.",
      "content": "Rubbing alcohol can be used to make a simple weed killer. Mix 2 tablespoons (30 mL) of rubbing alcohol with 1 quart (950 mL) of water, then pour the mixture into a spray bottle. Spray the dandelions with this solution to sap away their moisture. The heads of the dandelions will wilt and die off soon. [3] X Research source"
    },
    {
      "title": "Use horticultural vinegar as a heavy-duty dandelion killer.",
      "content": "Use horticultural vinegar as a heavy-duty dandelion killer. Horticultural vinegar is 4 times as strong as household vinegar, which makes it very effective at killing weeds. Pour or spray a small amount of horticultural vinegar onto the dandelions to kill the plants. Although horticultural vinegar is a natural product, it is a strong acid, and needs to be handled carefully. Wear long sleeves, gloves, pants, and a mask when using this product. Horticultural vinegar can damage surrounding plants, so be sure to use it in small amounts and only in the area with the dandelions."
    },
    {
      "title": "A flame weeder kills tall dandelions in seconds.",
      "content": "A flame weeder kills tall dandelions in seconds. Water the area to make sure you don’t damage your lawn, then pass the flame wand about 3-6 inches over the dandelion. It only takes about 1/10th of a second to kill the dandelion—don’t try to set them on fire. [4] X Research source Although they won’t touch the root system of the dandelion (meaning that the dandelion will grow back eventually), a flame weeder can quickly get rid of flowers and stems from dandelions, keeping them from spreading."
    },
    {
      "title": "Mulch over areas prone to dandelions to prevent growth.",
      "content": "Mulch over areas prone to dandelions to prevent growth. A 3-inch (7.5 cm) layer of mulch in your lawn or garden keeps weeds away. Dandelions will find it much harder to grow through mulch than in standard soil, which makes it an effective tool for keeping your lawn dandelion free. Any part of your garden or lawn that has open soil is susceptible to weeds. Mulch over all of these areas to prevent them from springing up. Any kind of mulch will do, including newspaper, tree bark, or woodchips."
    },
    {
      "title": "Mowing",
      "content": "Mowing is a key tool for keeping weeds in check. While mowing your lawn won’t touch the dandelions’ root systems, by destroying the flowers before they start producing seeds, you can prevent the spread of more dandelions. When mowing your lawn, leave the grass clippings on the lawn’s surface. They can help stop dandelion seeds from germinating. On the other hand, if you let your grass grow to a height of 4 inches (10 cm), you can create enough shade in your garden to keep dandelions from growing. [5] X Research source"
    },
    {
      "title": "By using compost to improve the soil, you keep dandelions away.",
      "content": "By using compost to improve the soil, you keep dandelions away. Although dandelions are hardy plants that can grow in a variety of conditions, they generally prefer acidic soil. Adding compost to your soil can change its pH balance, discouraging the growth of dandelions. [6] X Research source"
    },
    {
      "title": "Place cardboard or compost on top of dandelions to smother them.",
      "content": "Place cardboard or compost on top of dandelions to smother them. If you’re building a garden, you can work directly on top of the dandelions, rather than try to fight for space with them. Place sheets of cardboard or a pile of compost on top of the dandelions, and plant something new on top of them. The dandelions will be smothered, and you’ll have a beautiful set of plants in their place."
    }
  ]
}