{
  "url": "https://www.wikihow.com/Make-a-Mini-Golf-Course",
  "title": "How to Make a Mini Golf Course",
  "steps": [
    {
      "title": "Let your kids know what mini golf is.",
      "content": "Let your kids know what mini golf is. Mini golf is a game where players try to get a ball in a hole in the least number of shots. Mini golf is fun because you can create fun obstacles for your holes. While traditional golf is played with 18 holes, mini golf is played with nine but you can vary how many holes depending on the location."
    },
    {
      "title": "Planning your course.",
      "content": "Planning your course. Plan your course based on time and resources. If you have very young children, you can keep the course as simple as possible and use large colourful balls or tennis balls to keep the game easy. You can even just have one hole instead of nine if your kids are toddlers. Let your family help you plan the course to unleash their creativity. Some kids may work on the course for weeks. Older kids enjoy creating complex obstacles to challenge each other."
    },
    {
      "title": "Design your course.",
      "content": "Design your course. Begin by brainstorming your ideas for each hole. Draw them out on paper or a whiteboard. If you have played mini golf before it's helpful to give examples of holes that you have enjoyed before. Figure out what you can use around the house to simulate similar obstacles. For example, use containers that your ball can pass through, books to build tunnels, or stuffed animals that the ball needs to move passed. You may use around nine red plastic cups for your holes if you do not have enough containers."
    },
    {
      "title": "Choose your type of course.",
      "content": "Choose your type of course. You may create a putt-putt zoo if you have many stuffed animals. Use your stuffed animals as obstacles for every hole. If you want to play outdoors, use the driveway for faster play. Play throughout your house if you have adequate space and time. The putt-putt Zoo is basically a jungle themed course. Use painter's tape to secure your holes down and set them around the room. Place the stuffed animals as both decorations and obstacles for each course. For example, if you have a particularly large stuffed bear you can get players to putt through the bear's legs to get to the hole. You may also have each player make the noise of the animal at the obstacle. This is a great course for very young children. The driveway mini-golf course is great for accuracy as the difficulty increases as you place the holes further and further away. Tape down your cups as each hole and place them at varying distances from the edge of the driveway. Use the edge of the driveway as your starting point. Playing throughout your house is the most creative and ambitious course to make as you have many resources at your disposal. You can allow each player to design their own hole or sets of holes. You may also give each room a theme."
    },
    {
      "title": "Create your holes.",
      "content": "Create your holes. Use red plastic cups that you can purchase online or the dollar store and painter's tape to secure them as your holes. Search through the house for obstacles and decoration for your holes. Here are nine example holes: Hole 1: Create a ramp with a book leaning against musical chimes or a toy xylophone. If hit properly, the ball moves up the ramp and over the chimes to create a fun sound before it makes it to the hole. Hole 2: Use canned food or cereal boxes as obstacles and use your kitchen to create a fun food theme. Hole 3: Use a footrest as a tunnel for the ball to go through before it reaches the hole. Hole 4: Decorate holes with toys like toy soldiers and tanks for a war theme. Hole 5: Create a tunnel with an empty soda carton. Simply cut both sides with scissors to create a hole large enough for the ball to pass through and tape it to solid ground with painter's tape. Hole 6: Create a soft sloping ramp by covering a footstool with a yoga mat and placing a dish towel underneath to slow down the ball as it passes over the matt. Hole 7: Take a toy racetrack and create an incline onto a chair. Place the hole at the seat of the chair and tape it down with painter's tape so that the ball has to travel up the incline and onto the chair. Hole 8: Tie a piece of string onto a toy tambourine. Swing the tambourine back and forth slowly as player tries to putt into the hole to create a moving obstacle. This may be fun if you allow other players to control the tambourine. Hole 9: Try to get as creative as you can for the final hole. For example, create a wall with toys, cups, and books leaving only a small opening big enough for the ball to pass through and make it into the cup."
    },
    {
      "title": "Get the gear.",
      "content": "Get the gear. Whether you use real putters or purchase large plastic clubs for toddlers, make sure that the gear is safe and appropriate for the age of the players. You may also purchase fun and colourful golf balls online or at your local toy store."
    },
    {
      "title": "Keep score.",
      "content": "Keep score. You may print out a fun scorecard online or simply keep the score using a pen and paper. Mark down the number of attempts each player takes to finish each hole. The player with the lowest score wins."
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Use medium-density fiberboard (MDF), 54x72-inch piece of green felt, bottom of two five gallon buckets, deck baluster, composite wood balusters, 2 inch PVC elbow pipe, 3 inch PVC pipe fitting, plastic drop cloth, green welcome mat or artificial turf, spray adhesive, wood glue, and cyanoacrylate glue that you can purchase at your local hardware store. MDF is smooth and easy to work with as it is a perfect flat surface for a golf ball to roll on. You may need added material if you want to create elaborate obstacles such as water hazards. This design has rough and a loop-de-loop."
    },
    {
      "title": "Lay out and cut baluster supports.",
      "content": "Lay out and cut baluster supports. Take your sheet of MDF and line up your deck balusters so they fit flush around the edges. Use a miter box and backsaw to cut the balusters to fit exactly, corner to corner."
    },
    {
      "title": "Glue the baluster supports in place.",
      "content": "Glue the baluster supports in place. Use wood glue on each baluster as you line them up against the edges of your MDF. There should be a few inches of space between the lines of wood glue so that you may dab fast-setting cyanoacrylate. The cyanoacrylate acts to clamp the balusters as the wood glue dries so make sure the balusters are lined up correctly as the cyanoacrylate sets."
    },
    {
      "title": "Cut your hole.",
      "content": "Cut your hole. Close to one end of your MDF panel, mark of your hole slightly off-center. Make a hole at this mark with a drill fitted with 4-inch hole saw. Flip the panel over once the drill has poked through and continue cutting the hole from the other side to prevent the MDF from splintering."
    },
    {
      "title": "Apply adhesive to the MDF.",
      "content": "Apply adhesive to the MDF. Clamp your piece of felt on a worktable so that it slightly stretches. Away from the felt, lay your MDF on plastic drop cloth and spray it with adhesive. Use long, even strokes to spread the adhesive throughout the entire hoard. Use adhesive on the felt as well."
    },
    {
      "title": "Place the felt on the MDF panel.",
      "content": "Place the felt on the MDF panel. Make sure the felt is smooth and place the MDF at the center of the felt. Be sure to turn the MDF over without letting it touch the felt until you are sure that it is in the correct position before pressing it down. The balusters on the bottom of the panel and the hole will need a spray of adhesive. Allow everything to dry."
    },
    {
      "title": "Cut the corners of the felt.",
      "content": "Cut the corners of the felt. Cut excess felt with a utility knife and a framing square. Cut 1 ½ inches from each direction as you hold the square corner to the panel corner. Cut the felt diagonally."
    },
    {
      "title": "Wrap the felt around the sides.",
      "content": "Wrap the felt around the sides. You will need help to pull along all the sides in order to lift the felt evenly and wrap it over your balusters."
    },
    {
      "title": "Wrap the felt around the hole.",
      "content": "Wrap the felt around the hole. Section off the felt in the hole by using scissors to cut as if you were cutting a pizza. Cover the sides of the hole by pulling up each wedge and wrapping it tightly. Cut off any excess felt once the felt is folded over and inside of the hole is covered."
    },
    {
      "title": "Cut PVC pipe and finish the hole.",
      "content": "Cut PVC pipe and finish the hole. Create a two inch PVC pipe fitting using a hacksaw on the PVC pipe fitting. Once cut, drop the two inch tall fitting into the hole."
    },
    {
      "title": "Line the course.",
      "content": "Line the course. Use the lengths of composite baluster to line your course. The balusters will stay in place for balls to bounce off them. You may also customize your hole by adjusting them. You may create corner bumpers by adding short angled pieces."
    },
    {
      "title": "Create rough.",
      "content": "Create rough. Form some rough by cutting green welcome mat or artificial turf. Create obstacles by placing pieces around the course. You may glue them down or leave them separate so you can adjust with each play."
    },
    {
      "title": "Create a loop-de-loop.",
      "content": "Create a loop-de-loop. Cut off the lower three inches from each of your two five gallon buckets. Cut out the buckets' bottoms, leaving a 1-inch band. Then cut an opening through each circular piece. Marry the pieces with duct tape to form a channel. Line up the open ends, and spread them apart to create a loop. Once the loop is adjusted, screw the sides to a block made of two short, angled pieces of composite baluster."
    }
  ]
}