{
  "url": "https://www.wikihow.com/Grow-Alstroemeria",
  "title": "How to Grow Alstroemeria",
  "steps": [
    {
      "title": "Plant when temperatures do not exceed 68° F (20° C) daily.",
      "content": "Plant when temperatures do not exceed 68° F (20° C) daily. You can plant alstroemeria bulbs in the spring, early summer, or fall, depending on your climate. Alstroemeria grows best when temperatures do not exceed 68° F (20° C) daily and range from 40 and 50° F (4 to 10° C) at night. [1] X Research source If you plant alstroemeria indoors, you can do so any time of the year as long as you place the plant in a temperate location."
    },
    {
      "title": "Choose soil with good drainage.",
      "content": "Choose soil with good drainage. Alstroemeria plants need soil with good drainage so the roots don’t rot. You may want to mix your soil with peat moss, compost, ground bark, or decomposed manure to help it drain. [2] X Research source Alternatively, you could use a mix of 1:1 perlite and vermiculite or 1:1 organic and inorganic material if you plan to grow your alstroemeria in a container. [3] X Research source"
    },
    {
      "title": "Pick a site with part shade to full sun.",
      "content": "Pick a site with part shade to full sun. Alstroemeria grows best in locations with full morning sun and some shade in the afternoons. If you’re growing alstroemeria indoors, pick a sunny window ledge or a spot with lightly filtered sunshine. [4] X Research source"
    },
    {
      "title": "Soak your bulbs.",
      "content": "Soak your bulbs. Fill a bucket with water, and then place the alstroemeria bulbs into the water overnight. Soaking the bulbs for 24 hours will jump-start their germination process. [5] X Research source"
    },
    {
      "title": "Dig holes in your soil or potting medium.",
      "content": "Dig holes in your soil or potting medium. Dig 6-8 inch (15-20 cm) holes in the potting medium. [6] X Research source If you’re planting outdoors, space the holes 24 inches (60 cm) apart to allow room for spreading. If you’re planting in containers, plant each bulb in a large container (1 gallon or 5 liters) with drainage holes. [7] X Research source"
    },
    {
      "title": "Add the bulbs.",
      "content": "Add the bulbs. Place 1 bulb into each hole, with the pointy side facing up. Cover the bulb gently with soil or potting medium. Lightly tamp down the soil or potting medium around the bulb. [8] X Research source"
    },
    {
      "title": "Water frequently so the soil is consistently moist.",
      "content": "Water frequently so the soil is consistently moist. Generously water your freshly planted bulbs. Monitor their moisture level daily until the plant pokes through the surface, keeping the soil consistently moist, but not sopping wet."
    },
    {
      "title": "Water the alstroemeria when dry.",
      "content": "Water the alstroemeria when dry. Once your alstroemeria is established, it won’t need as much water. Lightly water when the top 1 inch (2.5 cm) of soil is dry. Too much water will lead to root rot, so take care not to overwater your alstroemeria. [9] X Research source"
    },
    {
      "title": "Fertilize your alstroemeria when in bloom.",
      "content": "Fertilize your alstroemeria when in bloom. You can feed alstroemeria with a high potash fertilizer each week during the growing season when your flowers are blooming. Potash fertilizer contains potassium to help your plants thrive. You should be able to find this type of fertilizer at your local garden shop or hardware store."
    },
    {
      "title": "Mulch alstroemeria to protect it.",
      "content": "Mulch alstroemeria to protect it. Placing protective mulch around your alstroemeria can protect it from extreme temperatures. You can mulch with straw or bracken. Keep the mulch at least 2 inches (5 cm) from the alstroemeria stem to avoid rotting at the base of the plant. If you live in an extremely hot climate, you may want to place mulch around your alstroemeria in the summer. If you live in a cold climate, you should place mulch around your alstroemeria in the winter."
    },
    {
      "title": "Pick, rather than cut, the flowers.",
      "content": "Pick, rather than cut, the flowers. Whether you want to bring some alstroemerias inside to put in a vase, or you need to remove spent blooms, you’ll need to pick out each stem. Pull one or more entire stalks out of the soil or potting medium. Don’t cut the flowers, as the underground meristems will respond to the damage and die. Each flower has its own stalk, so you won’t harm the entire plant by pulling a few stalks. In order to encourage growth, regularly deadhead spent blossoms."
    },
    {
      "title": "Monitor for pests and diseases.",
      "content": "Monitor for pests and diseases. Look out for aphids, spider mites, and whiteflies on your alstroemerias. If you find these pests, remove them with a strong stream of water then apply an insecticidal soap. To avoid a disease called root rot, be sure to water only until moist, choose a well-draining soil, and leave room between your plants for air to reach your alstroemerias. [10] X Research source"
    },
    {
      "title": "Divide your alstroemeria by the rhizomes for propagation.",
      "content": "Divide your alstroemeria by the rhizomes for propagation. If you want to get new plants from the ones you already have, cut the plant so that it’s within 6 inches (15 cm) of the ground. [11] X Research source Two weeks later, dig all the way around the plant. Dig up the plant’s rhizomes, or horizontally-running root networks, as well as all of the roots that branch off from them. Divide the rhizomes of the plant with a sharp knife and then replant the rhizomes 6 inches (15 cm) deep and 12 inches (30 cm) apart. Expect the newly planted rhizomes to flourish within 10 weeks of planting. Thin and transplant the rhizomes every 2-3 years during the spring."
    }
  ]
}