{
  "url": "https://www.wikihow.com/Identify-Symptoms-of-Jaundice",
  "title": "How to Identify Symptoms of Jaundice",
  "steps": [
    {
      "title": "Look for yellow skin and eyes.",
      "content": "Look for yellow skin and eyes. If you have jaundice, you may notice yellow discoloration of the white part of your eyes and throughout your skin. The yellowness may begin on your face, then gradually move to the other parts of the body. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Bring your mirror into a well-lit room with plenty of natural light. Always use natural lighting when possible, as light bulbs and shades may tint the lighting. Gently apply pressure to your forehead or nose. Notice the color of your skin while releasing the pressure. If there is a tinge of yellowness to your skin as the pressure is released, you may have jaundice. To test your baby’s skin for jaundice, press gently on baby’s forehead or nose for a second, then release. Healthy skin will momentarily look lighter before returning to normal, whereas jaundiced skin will appear slightly yellowed. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also look inside your baby’s mouth at his gums, on the soles of his feet, and on the palms of his hands to check for jaundice. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source A baby’s jaundice progresses down the body from head to toe. [4] X Research source If you have dark skin or if you are uncertain if you are seeing a yellowish tinge, look at the whites of your eyes. If they have a yellowish tint, you may have jaundice."
    },
    {
      "title": "Be aware of increased itchiness.",
      "content": "Be aware of increased itchiness. Jaundice may cause your skin to become very itchy because of the increased level of toxins accumulating in your blood vessels during the break down of bile, to which bilirubin binds in the liver. [5] X Research source Itchiness may be related to underlying bile duct obstruction or cirrhosis of the liver. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The bile ducts carry bile away from the liver to the gallbladder and may get blocked by gallstones. [7] X Research source Cirrhosis of the liver is a condition in which the liver is damaged to the point that normal healthy liver tissue is replaced with non-functioning scar tissue and is caused by hepatitis, alcoholism, and other liver disorders. [8] X Research source"
    },
    {
      "title": "Look for spider-like blood vessels visible under the skin.",
      "content": "Look for spider-like blood vessels visible under the skin. Called spider angiomas, your skin may develop these small markings because the underlying process causing the jaundice is likely also causing increased blood flowing through your blood vessels. This makes the blood vessels very noticeable under your skin. [9] X Research source Spider angiomas are not a direct result of the jaundice itself but often occur simultaneously. These spider vessels blanch when you press on them and most frequently occur on the upper body including the trunk, arms, hands, neck, and face. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Check for bleeding under the skin.",
      "content": "Check for bleeding under the skin. Small, reddish and purple spots may appear on your skin, indicating that you might be bleeding under the skin. This occurs because of liver damage causing problems with blood clotting, as your liver normally makes substances that helps your blood clot. There is also increased efficiency in the breakdown of red blood cells and blood formation in the body that can cause you to bleed more easily. [11] X Research source"
    },
    {
      "title": "Watch out for increased bleeding and bruising.",
      "content": "Watch out for increased bleeding and bruising. If you have jaundice, you may notice that you have a tendency to bruise more easily than normal. You may also find that if you get a cut, the blood takes a longer time to clot. [12] X Research source This symptom is also related to a damaged liver not being able to make the substances that help with blood clotting."
    },
    {
      "title": "Keep track of the color of your stool.",
      "content": "Keep track of the color of your stool. Your stool may change color and become very pale if you have jaundice. This change occurs because when you have jaundice, there may be a duct blockage causing reduced bilirubin in your stool, leaving most of it to be excreted in your urine. [13] X Research source Most bilirubin is normally excreted in your stool. Your stool may even be grey if you have severe obstruction. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source your stool may have blood in it or be black if you are having bleeding complications from liver disease."
    },
    {
      "title": "Watch the frequency and color of your urine.",
      "content": "Watch the frequency and color of your urine. Bilirubin is also normally excreted in your urine, though less than is normally in your stool. When you have jaundice, however, your urine becomes darker because of the higher levels of bilirubin being excreted by this means. [15] X Research source You may also notice that you end up peeing less each time you go to the bathroom. Be sure to track how frequently you go, whether you pee a lot or a little each time, and what color your urine is so you can tell your doctor. Urine changes may occur before skin colouration changes so remember to tell your doctor when you first started noticing your urine getting darker. Newborn baby urine should be clear. If your baby has jaundice, you can expect his urine to be darker yellow. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Feel to see if your abdomen is swollen.",
      "content": "Feel to see if your abdomen is swollen. If you have jaundice, your liver and spleen may become enlarged, which in turn can cause your abdomen to become distended. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In addition, liver disease may cause fluid to build up in your abdomen. A swollen abdomen is usually a later sign of an illness that also causes jaundice, and is not caused by the jaundice itself. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You may also experience abdominal pain because the underlying illness could cause your liver to become infected or inflamed."
    },
    {
      "title": "Look for swollen ankles, feet and legs.",
      "content": "Look for swollen ankles, feet and legs. An illness that causes jaundice might also cause you to have swollen ankles, feet and legs. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The liver helps in the excretion of bilirubin in urine and, when its function is interfered with, or if there is excess pressure in the circulation associated with the liver, fluid accumulates in different parts of the body, causing swelling."
    },
    {
      "title": "Check your temperature for fever.",
      "content": "Check your temperature for fever. Jaundice can cause you to have a fever of 38C (100.4F) and higher. [20] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source The reason for the fever may be due to an underlying liver infection (such as hepatitis) or bile duct obstruction. [21] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Monitor your baby’s behavior.",
      "content": "Monitor your baby’s behavior. Your baby may have other symptoms such as a shrill, high-pitched cry, being inconsolable, refusing to feed, and being floppy or difficult to wake. If you are discharged from hospital with baby less than 72 hours after birth, you may want to book a follow-up appointment to see your doctor in the next two days to check for infant jaundice. Severe infant jaundice left untreated can cause permanent brain damage."
    },
    {
      "title": "Ask for a jaundice bilirubin test.",
      "content": "Ask for a jaundice bilirubin test. The most accurate way to tell if you or your baby has jaundice is to have your blood tested for elevated bilirubin levels. If the bilirubin is elevated, your doctor may perform other tests to determine the cause of the jaundice, look for any complications, and to look at how well the liver is functioning. Babies may also have a skin test called a transcutaneous bilirubin test. A special probe is placed up against baby’s skin and measures the reflection of a special light shining through or being absorbed. This allows the doctor to calculate the amount of bilirubin present."
    },
    {
      "title": "Notice other signs of severe liver disease.",
      "content": "Notice other signs of severe liver disease. Symptoms may include weight loss, nausea and vomiting, or vomiting blood."
    },
    {
      "title": "Look at your dog or cat’s skin.",
      "content": "Look at your dog or cat’s skin. Though it may be harder to see on some breeds, all dogs and cats can get jaundiced yellowish skin. [22] X Research source Check the gums, whites of the eyes, base of the ears, nostrils, abdomen, and genitals, as the jaundice may be more noticeable in these areas. [23] X Research source If you suspect your pet has jaundice, take him to a vet for immediate examination. If you pet has jaundice, he has an underlying illness, such as hepatitis or other liver problems, that will require veterinary treatment or it could become fatal."
    },
    {
      "title": "Monitor urine and stool output.",
      "content": "Monitor urine and stool output. As with humans, your pet’s urine may be darker due to increased bilirubin being excreted. Unlike humans, the pet’s stool may also be darker and orange colored. [24] X Research source Your pet may urinate more than usual."
    },
    {
      "title": "Watch your pet’s eating habits.",
      "content": "Watch your pet’s eating habits. Pets with jaundice may be excessively thirsty but lack an appetite, and suffer weight loss while having abdominal distension. These are all symptoms that coincide with jaundice to reflect an underlying illness. [25] X Research source"
    },
    {
      "title": "Observe your pet’s behavior.",
      "content": "Observe your pet’s behavior. As with humans, your pet may be lethargic and have difficulty breathing, also due to the underlying illness. [26] X Research source"
    }
  ]
}