{
  "url": "https://www.wikihow.com/Have-an-Islamic-Funeral",
  "title": "How to Have an Islamic Funeral",
  "steps": [
    {
      "title": "Begin with istinja.",
      "content": "Begin with istinja. This is washing the private parts. If urine or stool has been excreted, the body needs to be cleaned. The washer should use a cloth and clean both the front and back of the body with water, ensuring that there is no excrement or dirt. After this, the part between the navel and knees must be covered. This is also known as the awrah or satr of a man, i.e. the part of the body that is considered \"naked\"."
    },
    {
      "title": "Perform Wudu",
      "content": "Perform Wudu . The washer then needs to perform ablution on the deceased. An accepted method of doing so is: wiping the mouth and nose with water, washing the face and arms, wiping the head and ears, and washing the feet."
    },
    {
      "title": "Pour water containing lotus leaves over the head.",
      "content": "Pour water containing lotus leaves over the head. [1] X Research source Lotus leaves are normally used to cure black magic. The water should be poured over the right side of the body and then the left side. The final time the body is washed, camphor should be added to the water. This perfume strengthens the body and gives it a nice fragrance. It is preferable to wash the body an odd number of times, so three, five or seven times."
    },
    {
      "title": "Wrap the body in a simple cotton cloth, also known as kafan.",
      "content": "Wrap the body in a simple cotton cloth, also known as kafan. The material, style and colour of the cloth varies from region to region, but the shroud should ideally be simple and modest. The kafan must not be made from silk for men, as that is prohibited. [2] X Research source The kafan must come from the wealth of the deceased or its family, and must come from a halal source. The kafan does not need to be soaked in zam-zam water nor have any Qur'an verse written on it."
    },
    {
      "title": "Use only three pieces of cloth.",
      "content": "Use only three pieces of cloth. The three main sheets are known as: kamis, which covers from shoulder to below the knees and must have a hole big enough for the head to fit through; izar, which covers from head to toe; and lifafah, which covers from above the head to below the toes."
    },
    {
      "title": "Perfume the shroud with incense three times.",
      "content": "Perfume the shroud with incense three times. The Prophet (peace be upon him) said, \"When you burn incense by your dead, do it three times\". [3] X Research source"
    },
    {
      "title": "Arrange the janazah salah (funeral prayer) as soon as possible.",
      "content": "Arrange the janazah salah (funeral prayer) as soon as possible. The Prophet said to hasten at a funeral; the prayer must be arranged so that the body can be buried. During this time, only mahram women (wife, mother, sisters, grandmothers, etc) can see the face of the deceased male, and vice-versa."
    },
    {
      "title": "Inform others about the date and time of the funeral prayer.",
      "content": "Inform others about the date and time of the funeral prayer. It is the right of a Muslim that, when he passes away, other Muslims attend his funeral. [4] X Research source The funeral prayer is a fardh kifayah (communal obligation). It is the obligation of the community to attend the funeral; if nobody attends, the community is sinful, but if a few people representing the community attend, they are not. A child born dead, aborted after the fourth month, or who dies before reaching puberty does not have to have a funeral prayer because the Prophet did not do so for his own son. A child aborted before the fourth month, or a child stillborn before the fourth month, does not require a funeral prayer because it is not considered living in the human sense, and it does not have a soul that can be prayed for. [5] X Research source"
    },
    {
      "title": "Offer the funeral prayer as a congregation.",
      "content": "Offer the funeral prayer as a congregation. Do not, however, delay the prayer to allow more people to come. It is preferable that at least three rows behind the imam are filled up, according to a Hadith which states \"Any Muslim who dies and three rows of Muslims make salah for him, will be forgiven.\". [6] X Research source"
    },
    {
      "title": "Offer the funeral prayer outside.",
      "content": "Offer the funeral prayer outside. This was the usual practice of the Prophet, but he also occasionally prayed inside the mosque as well. [7] X Research source It is forbidden to pray the funeral prayer between the graves. [8] X Research source"
    },
    {
      "title": "Don't perform the prayer when the sun rises, when it passes the meridian, or when it sets.",
      "content": "Don't perform the prayer when the sun rises, when it passes the meridian, or when it sets. Otherwise, it can be done at any time."
    },
    {
      "title": "The imam should stand in level with the deceased male's head and shoulders.",
      "content": "The imam should stand in level with the deceased male's head and shoulders. For a deceased female, he must stand in level with her abdomen. If there are multiple deceased, one prayer can be made for all of them. If there are both male and female deceased, the female bodies must be placed in front of the imam, with the male bodies placed behind. [9] X Research source"
    },
    {
      "title": "The usual rules of prayer must be obeyed.",
      "content": "The usual rules of prayer must be obeyed. These include facing the Qibla (direction of Ka'bah) and having made Wudhu. However, there is no ruku (bowing down) or sujud (prostration). The prayer is done standing up."
    },
    {
      "title": "Make the intention of janazah salah before starting the prayer.",
      "content": "Make the intention of janazah salah before starting the prayer. This can be done in the heart. Uttering the intention (niyaah) aloud was not practised by the Prophet."
    },
    {
      "title": "Raise your hands while saying Allahu Akbar (God is the greatest).",
      "content": "Raise your hands while saying Allahu Akbar (God is the greatest). Then, fold your hands, right hand over the left. Before reciting Surah Fatiha, recite the du'a that you normally recite: \"Glory be to you, O Lord, and all Praises are due unto you, and blessed is your name and high is your majesty and your praises are elevated and none is worthy of worship but you\"."
    },
    {
      "title": "Raise your hands for the second time.",
      "content": "Raise your hands for the second time. Recite Durood Ibrahim, sending blessings on the Prophet Muhammad and praising Allah."
    },
    {
      "title": "Raise your hands for the third time.",
      "content": "Raise your hands for the third time. This time, recite the funeral du'a. This differs depending on the deceased. For an adult man or woman, recite the du'a, \"O God, forgive our living and our dead, those who are present among us and those who are absent, our young and our old, our males and our females. O God, whoever You keep alive, keep him alive in Islam, and whoever You cause to die, cause him to die with faith\". For a boy, recite the du'a, \"Oh! Allah, make him (this child) a source for our salvation and make him a source of reward and treasure for us and make him an intercessor for us and one whose intercession is accepted.\" For a girl, recite the du'a, \"Oh! Allah, make her (this child) a source for our salvation and make her a source of reward and treasure for us and make her an intercessor for us and one whose intercession is accepted.\""
    },
    {
      "title": "Raise your hands for the fourth time.",
      "content": "Raise your hands for the fourth time. After a short pause, make salaam. Turn your head to the right, saying \"Peace and blessings of God be unto you\", and similarly to the left."
    },
    {
      "title": "Dig a grave with a wider space that suits the correct measurement of the deceased.",
      "content": "Dig a grave with a wider space that suits the correct measurement of the deceased. This is done to avoid further problems, such as the deceased being unable to fit into the grave. This also prevents wild animals such as dogs and boars from being attracted by any odour. Having the correct measurements ensures that the location and position of marked graves don't change."
    },
    {
      "title": "Make sure that the body is perpendicular to the Qibla (direction of the Ka'bah).",
      "content": "Make sure that the body is perpendicular to the Qibla (direction of the Ka'bah). [10] X Research source The face should be turned right towards the Qibla. When placing the body in the grave, recite \"In the name of Allah and in the faith of the Messenger of Allah\"."
    },
    {
      "title": "Close the grave with pieces of timber.",
      "content": "Close the grave with pieces of timber. This makes sure that earth will not be put directly on the body when they fill the grave with earth."
    },
    {
      "title": "Cover the grave with sand.",
      "content": "Cover the grave with sand. While doing this, pour three handfuls of sand into the grave. Recite \"We created you from it\" after one throw, \"and return you into it\" after the second, and \"and from it we will raise you a second time\" after the third. A headstone is usually erected to recognise the grave. It is of the Sunnah of the Prophet (peace be upon him) to sprinkle water over the grave while reciting \"May Allah make his resting place cool and make Jannah his home\". [11] X Research source"
    },
    {
      "title": "Comfort the family of the deceased.",
      "content": "Comfort the family of the deceased. It is Mustahab (desirable) to give food for one day and one night to the mourning family. When comforting, say, \"May Almighty Allah bless you greatly, and may He bless you with something in change of your sorrow and may Allah forgive the deceased\"."
    },
    {
      "title": "Abstain from decorating and beautifying oneself.",
      "content": "Abstain from decorating and beautifying oneself. This is known as sawg . It is compulsory for women to be in sawg during the 'iddah period after the death of her husband. This 'iddah period is for four months and ten days (not to be confused with the 'iddah period of three months for a woman who divorces her husband). It is haraam to wear any sort of colourful make-up for adornment, oil the hair, use perfume, and wear gold. After the 'iddah period, women are free to marry again."
    },
    {
      "title": "Visit the grave.",
      "content": "Visit the grave. It is preferable to visit the grave on Fridays. You must be in a state of cleanliness when entering the graveyard. Stand at the leg-side, not the head-side, of the grave. [12] X Research source Recite, \"Peace be upon you, O dwellers of the grave, Group of believers and if Allah wins, then very soon we will unite with you. We pray to Almighty Allah for our and your harmony. O Allah do not deprive us from his reward and after him, do not test us and forgive all of us and all of them and with them, have Mercy on us\". Do not face the grave when reciting any du'a. Face the Qibla, the direction of the Ka'bah. It is absolutely prohibited to seek the intercession of the dead. This is a major act of shirk and makes one a disbeliever. You can only request things from the living and what is within their means (e.g. you cannot ask someone to grant you Paradise). [13] X Research source [14] X Research source [15] X Research source [16] X Research source [17] X Research source [18] X Research source"
    }
  ]
}