{
  "url": "https://www.wikihow.com/Identify-Asbestos-in-Plaster",
  "title": "Asbestos in Plaster Walls: Identification, Removal, & More",
  "steps": [
    {
      "title": "Determine when your home was built",
      "content": "Determine when your home was built . Most types of asbestos-containing plaster were manufactured between 1942 and 1974. [1] X Research source If your house was built or renovated during that time, it's a good idea to have it tested. That said, asbestos was used in stucco and drywall as early as 1910 and continued to be used at a slower rate until at least the early 1980s. Asbestos is even used in some building materials today, but the risk of your plaster containing asbestos is fairly low if your house was built in the 1990s or later. [2] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source These dates are most accurate in the United States. In some other industrialized countries, significant asbestos use continued until about 2000. Don't rely on a hard cutoff date since bans on manufacturing sometimes allowed companies to use up the remainder of their supply."
    },
    {
      "title": "Consider testing popcorn ceilings for asbestos.",
      "content": "Consider testing popcorn ceilings for asbestos. Popcorn ceilings or textured plaster ceiling coatings often used asbestos, especially (but not exclusively) between the 1950s and 1970s. It's worth testing these ceilings if they're crumbling or if you plan on doing nearby renovations that could disturb the area and release dust. [3] X Research source"
    },
    {
      "title": "Look for signs of damage, such as cracks or crumbling.",
      "content": "Look for signs of damage, such as cracks or crumbling. Plaster containing asbestos is not a health risk if it’s in good condition. Conversely, if you see crumbling, cracks, or water damage, or if the plaster has been sawed, scraped, or sanded, it may be releasing asbestos fibers. If the plaster is undamaged, it's usually best to leave it alone. Periodically check your walls and ceilings for cracking or crumbling, and take a sample only if signs of damage are present. [4] X Research source Asbestos is known for having a crumbly texture, and is often some shade of brown, blue, or white. [5] X Research source"
    },
    {
      "title": "Identify the brand of plaster used if the property has extensive records.",
      "content": "Identify the brand of plaster used if the property has extensive records. Visit your state or local government website to find any available records on your property, like documents pertaining to renovation or construction. [6] X Research source These might include information on the exact brand of plaster used, which can help you potentially help you identify asbestos contamination. Here are a few brands to be on the lookout for: Flintkote Corporation - Synkoloid Plastibond and Patch Rite patching plaster (1950-1976) Keene Corporation - Uni-Coustic acoustic plaster (1963-1971) U.S. Gypsum Georgia Pacific - acoustical plaster (150-1974), GP Patching Plaster (1956-1976), and GP-Lite acoustical plaster (1958-1964) [7] X Research source"
    },
    {
      "title": "Hire a professional inspector whenever possible.",
      "content": "Hire a professional inspector whenever possible. While testing kits allow anyone to collect damaged asbestos pieces, it's best to have a licensed professional take the sample rather than trying to do it on your own. Without professional training, it’s easy to make mistakes in respirator fitting or dust removal, which may risk the health of your household. Although rare, there are cases where short-term asbestos exposure has caused asbestos-related cancer decades in the future. [8] X Research source Additionally, country, state, and local laws may require hiring a professional, especially for shared buildings and workspaces. [9] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Before hiring an asbestos inspector, ask for official documents proving they've been trained and approved for asbestos work by government agencies. To learn more about legal requirements, contact your local or state department of health or environmental protection. [10] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source In older buildings, a thorough asbestos inspection should be professionally performed to ensure that asbestos particles have not been released into the environment. This could be done through Transmission Electron Microscopy (TEM) or Phase Contrast Microscopy (PCM) —though TEM is more precise and can detect a greater range of particle sizes."
    },
    {
      "title": "Seal off the area.",
      "content": "Seal off the area. Taking a sample can release dangerous asbestos fibers into the air. Whether you're doing this yourself or hiring an inspector, make sure the following safety precautions are taken before extracting your sample: [11] X Research source Turn off heating and cooling units. Close windows and doors. Tape a plastic sheet on the floor under the area you'll be sampling and over open doorways and other large openings. [12] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Prevent others from entering the room while you work."
    },
    {
      "title": "Put on a respirator.",
      "content": "Put on a respirator. Asbestos fibers are extremely fine and can be easily inhaled without noticing, leading to lung diseases later in life. To protect yourself, wear a well-fitting respirator rated at least N-100, P-100, or R-100, or one equipped with purple HEPA-filtered cartridges. A disposable dust mask will not protect you. [13] X Research source If you have facial hair that interferes with a tight respirator fit, you may need a powered, positive-pressure respirator ."
    },
    {
      "title": "Wear gloves, safety glasses, a respirator, and a coverall.",
      "content": "Wear gloves, safety glasses, a respirator, and a coverall. Asbestos is most dangerous when inhaled and can cause cuts or \"asbestos warts\" if it reaches your skin. Most importantly, fibers can cling to clothes and spread the danger of inhalation to other areas. Protect yourself before you get started by doing the following: Wear gloves you don't mind throwing away. Durable work gloves are ideal, but powder-free disposable gloves are another good option. [14] X Research source Wear safety glasses to protect against falling or floating debris. [15] X Research source Disposable coveralls with built-in footwear are ideal, especially if you sample a large area. Alternatively, wear old clothes and throw them away afterward."
    },
    {
      "title": "Decide where to take samples.",
      "content": "Decide where to take samples. The test will be more reliable if you take several samples from different areas. Ask an asbestos testing laboratory how many samples they prefer or follow these rules of thumb: [16] X Research source Up to 90 m 2 (~1,000 ft 2 ) of plaster: Collect 3 samples. 90 to 450 m 2 (~1,000 to 5,000 ft 2 ): Collect 5 samples. Over 450 m 2 (5,000 ft 2 ): Collect 7 samples."
    },
    {
      "title": "Dampen the plaster.",
      "content": "Dampen the plaster. Fill a hand sprayer with water and a few drops of detergent. Spray this over the area of plaster you're sampling from. Wet plaster will release fewer asbestos fibers and help protect you from potential lung damage. [17] X Research source"
    },
    {
      "title": "Remove a sample of the plaster.",
      "content": "Remove a sample of the plaster. Cut down through the entire depth of the plaster with a sharp knife or tool. Remove at least a 2.5 x 2.5 cm (1\" x 1\") square of the plaster. Try not to break the material into small pieces, as this will release more particles into the air. Contact the testing laboratory before cutting your plaster, as some prefer larger samples. For popcorn ceiling coats and other friable material (anything that crumbles apart when you cut it), scrape off about 5 mL (1 tsp). [18] X Research source"
    },
    {
      "title": "Double bag the sample.",
      "content": "Double bag the sample. Place the sample in a clean, high-quality zip lock bag or plastic container, then place that inside a second plastic bag. Label the container with the date and the place where you took the sample (e.g., \"hallway ceiling north end\")."
    },
    {
      "title": "Patch the hole with duct tape.",
      "content": "Patch the hole with duct tape. Use the smallest piece of tape possible to cover the hole left from where you took your sample. This minimizes the number of fibers released from the cut edge. [19] X Research source"
    },
    {
      "title": "Clean up the area.",
      "content": "Clean up the area. Carefully fold up the plastic drop sheet. Thoroughly clean the floor and the area around the sample with wet rags and sponges or a HEPA vacuum cleaner . Wipe the outside of the sample container with a wet rag. [20] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Never use a regular vacuum cleaner. Asbestos fibers can float in the air for hours, so be sure to minimize your use of that room for the rest of the day. [21] X Research source"
    },
    {
      "title": "Throw away contaminated materials.",
      "content": "Throw away contaminated materials. Before leaving the area, put your plastic sheet, cleaning rags, gloves, and outer layer of clothing, including footwear, into sealed heavy-duty plastic bags . [22] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If it turns out your plaster does contain asbestos, deliver these bags to a landfill that accepts asbestos-containing waste. Asbestos is banned from regular trash collection in many areas. [23] X Research source"
    },
    {
      "title": "Wash skin and non-disposable equipment.",
      "content": "Wash skin and non-disposable equipment. A simple cleansing with soap and water is sufficient to clean/wipe off any exposed skin or equipment. Do this before leaving the work area to minimize the chance of tracking asbestos with you. [24] X Research source"
    },
    {
      "title": "Locate an asbestos testing lab near you.",
      "content": "Locate an asbestos testing lab near you. There are several ways to find an asbestos testing laboratory to test your sample: The U.S. Department of Commerce has established a voluntary accreditation program for asbestos testing labs and provides a Directory listing of the labs that have become accredited. Labs are listed by state, and listings include links to the labs’ websites. Check out some well-known international labs, such as the International Asbestos Testing Laboratory or EMSL Analytical, Inc. Many labs offer testing for non-local residents through Federal Express (“FedEx”), United Parcel Service (“UPS”), or the United States Postal Service (“USPS”). Check the yellow pages for \"Laboratories — Analytical.\""
    },
    {
      "title": "Get quotes from multiple labs.",
      "content": "Get quotes from multiple labs. Asbestos testing should be relatively cheap as far as lab tests go. You can typically get 3 samples tested for under $100 USD. [25] X Research source"
    },
    {
      "title": "Follow the instructions on the lab’s website for sample submission.",
      "content": "Follow the instructions on the lab’s website for sample submission. Most companies have a submission form for you to complete and mail or bring in with your sample. Print and complete the form and send it with your sample and payment to the address listed for sample submission."
    },
    {
      "title": "Consider hiring an asbestos contractor if your plaster tests positive.",
      "content": "Consider hiring an asbestos contractor if your plaster tests positive. If the plaster contains asbestos and is in poor condition, hire an asbestos contractor to handle it. You may then choose to remove the plaster completely or seal it underneath a protective coating that traps the asbestos fibers. [26] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Make sure the contractor is government accredited. Your local or state health board may be able to provide a list of accredited organizations. Hiring an accredited asbestos contractor to deal with asbestos removal is typically a requirement depending on where you live, and a much safer option than doing it yourself. Make sure to comply with legal requirements in your area before attempting to remove asbestos without the help of a professional."
    },
    {
      "title": "Hire a professional to confirm the area is safe.",
      "content": "Hire a professional to confirm the area is safe. After the job is done, consider hiring an asbestos inspector or air testing contractor to confirm the asbestos was successfully handled without releasing asbestos into the air. This ensures that your home is asbestos free so you can rest easy knowing you have 1 less thing to worry about. [27] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    }
  ]
}