{
  "url": "https://www.wikihow.com/Make-a-Loose-Tooth-Fall-Out-Without-Pulling-It",
  "title": "8 Ways to Remove a Loose Tooth without Pulling It",
  "steps": [
    {
      "title": "Wiggle your tooth with your tongue.",
      "content": "Wiggle your tooth with your tongue. The great thing about using your tongue to loosen your tooth is that you can do it almost anywhere, no matter what. Try pushing your tooth back and forth; whatever you can do with your tongue that doesn't make your tooth hurt is fair game. You may feel an itchy feeling at the base of your tooth, near the root. This is a sign that the tooth is getting ready to come out."
    },
    {
      "title": "Use a finger to move the tooth a little more.",
      "content": "Use a finger to move the tooth a little more. Each day, using a clean finger, you can gently wiggle the loose tooth. This will help the tooth gradually come out naturally. Don’t try to force the tooth to move, however. Make sure to wash your hands well with soap and warm water before trying this method."
    },
    {
      "title": "Try biting into crunchy foods.",
      "content": "Try biting into crunchy foods. Another way to get your loose tooth out is simply by enjoying a normal, healthy snack! Apples or pears make excellent choices because of their tough skins and crisp texture. If your tooth is very loose, it might be difficult to bite into food with it. However, biting with other teeth and then chewing can still help to loosen it. If the tooth is not very loose and you bite hard into something, there might be some pain. Be careful until you can tell how it feels to bite with the tooth."
    },
    {
      "title": "Brush your teeth.",
      "content": "Brush your teeth. When a tooth is really loose, even pushing on it just a little bit can make it fall out. Sometimes, even brushing your teeth is enough to make the tooth fall out (or make it looser). Brush your teeth as normal (at least twice a day), being sure to go lightly on the loose tooth. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Always brush your teeth for at least 2 minutes and be sure to clean each tooth. [2] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 20 May 2020."
    },
    {
      "title": "Grasp the tooth with gauze.",
      "content": "Grasp the tooth with gauze. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [4] X Research source You can tug at the tooth to help loosen it, even if it isn’t ready to come out on its own, or if you don’t want to pull it. Using some sterile gauze and your fingers, grasp the tooth and gently tug or wiggle it. If you do want to pull the tooth, you can use this same method, by giving the tooth a quick twist as you tug at it. The gauze can also help soak up any blood. You can also apply a small amount of oral anesthetic to the tooth and gum area before tugging at it if you are worried about it hurting."
    },
    {
      "title": "Try waiting.",
      "content": "Try waiting. If your tooth just won't seem to come out, it may not quite be ready to fall out, so be patient. [5] X Research source If your loose tooth isn't hurting you, distracting you, or getting in the way of your other teeth, you have no reason to worry about waiting. Usually, your baby teeth fall out in the order that they came in, starting around age six or seven. However, teeth can fall out in a different order and at different times. Your dentist will examine your teeth and answer any questions you might have about losing your teeth."
    },
    {
      "title": "Don't force a tooth that won't come out.",
      "content": "Don't force a tooth that won't come out. Generally, it's a bad idea to try to remove a tooth that's slightly loose but not ready to fall out. Forcing a tooth to come out can hurt and often leads to lots of bleeding, and possibly infection. If a tooth is forced out before the adult tooth is ready to emerge behind it, there can be problems in the future, such as crooked teeth or a lack of space for new teeth to emerge. Tricks to force a tooth out, such as by tying one end of a string around the tooth and the other end around a doorknob, then slamming the door, are not a good idea. These can break the tooth off or cause other injuries. If you do accidentally knock one of your teeth out before it's ready to fall out naturally, contact your dentist, who can help ensure that the problem is taken care of."
    },
    {
      "title": "When all else fails, see a dentist.",
      "content": "When all else fails, see a dentist. If your baby tooth is causing you pain and it won't come out no matter what you seem to do, don't be afraid to get help. Schedule an appointment with your dentist; he or she will be able to tell what is keeping your tooth from falling out normally and may even be able to painlessly take it out for you."
    },
    {
      "title": "Gargle after your tooth falls out.",
      "content": "Gargle after your tooth falls out. You can expect a small amount of bleeding when you lose a tooth. After your tooth has come out, you should try to gargle water or keep on spitting out water a number of times until it's not bloody and it's clear. Don’t necessarily be alarmed if it looks like there is a lot of blood. As the tooth area bleeds, the blood mixes with saliva, which can make it look like there is more than there actually is. You can make a saltwater gargle with 1/4 teaspoon of salt and 1/2 cup of warm water. Stir to mix it and gargle. The salt helps fight infection."
    },
    {
      "title": "Use gauze to treat bleeding.",
      "content": "Use gauze to treat bleeding. Even if your tooth has been so loose that it seemed to be barely hanging on, it may bleed a little when it falls out. Don't worry; this is perfectly normal. If this happens to you, put a small ball of clean gauze in the hole where the tooth used to be to soak up the blood. [6] X Research source Bite on the gauze to hold it in place for about 15 minutes. Most of the time, the bleeding should take less time than this to stop. If the bleeding won't stop, call your dentist."
    },
    {
      "title": "Take a small amount of over-the-counter pain medicine.",
      "content": "Take a small amount of over-the-counter pain medicine. If your mouth is a little sore after your tooth comes out, you don't simply have to wait for the pain to go away. Over-the-counter pain medicine such as acetaminophen or ibuprofen can make a sore mouth feel much better; just be sure to take the right dosage for your age and size according to the directions on the bottle. Ask an adult to help you take the right dose of medicine. Children should not take aspirin unless a doctor says otherwise."
    },
    {
      "title": "Use a cold compress to beat swelling.",
      "content": "Use a cold compress to beat swelling. Cooling the area can also help with any pain you may have after losing a tooth. Place a few pieces of ice in a plastic bag (or use a bag of frozen vegetables) and wrap the bag in a light cloth. Hold this against your cheek in the spot where your mouth hurts for about 15-20 minutes. Over time, the pain, swelling, and inflammation should gradually decrease. [7] X Research source You can also buy pre-made cold compresses from most pharmacies. These work the same way as home-made compresses."
    },
    {
      "title": "See a dentist if the pain doesn't go away.",
      "content": "See a dentist if the pain doesn't go away. Most teeth that fall out naturally should cause no long-term pain. However, sometimes when a tooth becomes loose or falls out because of an injury or dental disease, there can be pain or damage. [8] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 20 May 2020. Sometimes, even more, serious problems like abscesses (fluid-filled \"bubbles\" caused by infections) can occur. If left untreated, these problems can make you sick, so be sure to see a dentist if the pain from losing a tooth doesn't go away on its own. Sometimes bits of a tooth may be left behind after one falls out. Usually, these will fall out in time as well. However, if there is redness, swelling, or pain caused by a piece of tooth that remains behind, contact a dentist for help. They'll be able to remove it for you. [9] X Research source"
    }
  ]
}