{
  "url": "https://www.wikihow.com/Make-a-Group-on-Snapchat",
  "title": "How to Make a Group on Snapchat: Easy Beginner's Guide",
  "steps": [
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. This looks like a white ghost with a yellow background. Group chats can have up to 200 friends. [1] X Research source"
    },
    {
      "title": "Tap the \"Chat\" tab.",
      "content": "Tap the \"Chat\" tab. This is the second tab on the bottom, between Maps and Camera ."
    },
    {
      "title": "Tap the \"New Chat\" icon.",
      "content": "Tap the \"New Chat\" icon. This is the blue icon in the bottom-left corner with a message bubble and pencil."
    },
    {
      "title": "Select the friends you want to add.",
      "content": "Select the friends you want to add. You can select up to 200 other friends to join the group chat."
    },
    {
      "title": "Enter a group name.",
      "content": "Enter a group name. Tap the field at the top and enter a group name, if desired. You can use emojis to differentiate group chats if you have multiple. You can also enter this name later."
    },
    {
      "title": "Tap Chat with Group.",
      "content": "Tap Chat with Group . This is the blue button at the bottom. The group chat will open. You can now send Videos , Snaps, messages , and more. You can also share your location , but only do so with people you trust."
    },
    {
      "title": "Navigate the group chat.",
      "content": "Navigate the group chat. Keep in mind that messages sent in a group chat won't affect Snap streaks with individual users. Press and hold on a message to see who's read or saved it. If group members open a Snap, their name will appear underneath it in the chat window. To mention a group member, type their display name or type @ followed by their username. To add a member, tap Add Members or Invite at the top and select a user. To remove a member, tap on the group chat's icon to open the Group Profile. Press and hold on a member, and tap Remove from Group . To leave a group chat, go to the Chat tab. Press and hold on the group, and then tap Leave Group ."
    }
  ]
}