{
  "url": "https://www.wikihow.com/Identify-Lung-Cancer-Symptoms",
  "title": "How to Identify Lung Cancer Symptoms",
  "steps": [
    {
      "title": "See a doctor if you have a persistent cough.",
      "content": "See a doctor if you have a persistent cough. One of the most common symptoms of lung cancer is a cough that does not go away. See a doctor if your cough lasts more than 2 weeks, if it increases in intensity over time, or if you cough up blood (this is called hemoptysis) or a lot of phlegm. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Ironically, smokers, who have the highest risk of lung cancer, tend to cough a lot and, consequently, do not seek treatment for this most common symptom. If you smoke, be aware of any changes in your cough, and meet with your doctor regularly. Consider getting checked for lung cancer every couple of months. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You'll also want to note any changes in the character of the cough. You should be worried if, for example, a dry cough suddenly starts producing a lot of sputum. Likewise, you should be worried if the color of your sputum changes. In particular, keep an eye out for chocolatey brown, black, or greenish sputum. [5] X Research source"
    },
    {
      "title": "Watch for any problems with your breathing.",
      "content": "Watch for any problems with your breathing. Shortness of breath (dyspnea) is a common symptom of lung cancer, but it is often attributed to obesity, old age, heart disease, or weather changes. See a physician if you are having trouble breathing, especially if your shortness of breath occurs outside of any strenuous activity. [6] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source In some cases, a lung cancer patient will feel back pain that worsens the deeper that they breathe in. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Do not dismiss aches and pains.",
      "content": "Do not dismiss aches and pains. Dull and persistent aching in your chest, ribcage, shoulders, or arms could be an early symptom of lung cancer. This discomfort might progress to include tingling, numbness, and even paralysis. [8] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source"
    },
    {
      "title": "Investigate recurrent airway infections.",
      "content": "Investigate recurrent airway infections. If you have multiple episodes of bronchitis or pneumonia, talk to your doctor about the possibility of cancer. Tumors can obstruct your airways and make you prone to these kinds of infections. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Look for a loss of appetite.",
      "content": "Look for a loss of appetite. Lung cancer, like other cancers, can cause a loss of appetite. If you notice your appetite has diminished, make an appointment with your doctor. [10] X Research source"
    },
    {
      "title": "Pay attention to your weight.",
      "content": "Pay attention to your weight. Cancer cells use an inordinate amount of your body's energy and can affect your metabolism, leading to weight loss. This is sometimes exacerbated by the loss of appetite some patients experience. If you lose 10 pounds (4.5 kg) suddenly or without dieting, consult a doctor. [11] X Research source"
    },
    {
      "title": "Be aware of fatigue.",
      "content": "Be aware of fatigue. All cancers can produce fatigue, but the symptom is so vague that it does not always prompt people to seek treatment. If you have risk factors for lung cancer, such as smoking or a history of exposure to irritants like coal or asbestos, or if your fatigue is pronounced, see your doctor immediately. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Look for changes in your voice.",
      "content": "Look for changes in your voice. When lung cancer advances, tumors can hurt the vocal cords and obstruct the air passages, sometimes leading to hoarseness and wheezing. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Watch for any difficulty swallowing.",
      "content": "Watch for any difficulty swallowing. When a tumor advances into the esophagus, it can cause difficulty swallowing (dysphagia). [14] X Research source"
    },
    {
      "title": "Investigate muscle atrophy and weakness.",
      "content": "Investigate muscle atrophy and weakness. Tumors can interrupt nerve supplies and make you feel weak. This may lead to tingling sensations, numbness, or even paralysis. [15] X Research source"
    },
    {
      "title": "Get treatment for any excess fluid in the lungs.",
      "content": "Get treatment for any excess fluid in the lungs. Fluid accumulation in the lungs (pleural effusion) can be a consequence of lung cancer. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Look for jaundice.",
      "content": "Look for jaundice. If you notice that your skin or eyes are looking yellow, you may have jaundice. When lung cancer spreads, it can affect the digestive system and, specifically, the liver, producing this condition because of the chemical bilirubin that is supposed to make your stool brown. When cancer affects the liver, it won't work properly and red blood cells that are supposed to be filtered out build up too much, causing jaundice. [17] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source"
    },
    {
      "title": "Watch for swelling.",
      "content": "Watch for swelling. Pressure from a tumor on the chest vein can lead to swelling in the neck, arms, and face. [18] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source In addition to this swelling, this pressure can also cause drooping eyelids, with one pupil becoming smaller than the other. [19] X Research source"
    },
    {
      "title": "Be aware of any problems with your bones or joints.",
      "content": "Be aware of any problems with your bones or joints. In advanced cases of lung cancer, cancer may spread to the bones, leading to pain and possible fractures. Unexplained pain or fractures definitely require a full medical workup. [20] X Research source"
    },
    {
      "title": "See your doctor if you notice neurological problems.",
      "content": "See your doctor if you notice neurological problems. When lung cancer spreads to the brain or compresses the superior vena cava (a large vein that supplies blood to the heart), it can cause a headache, blurred vision, paralysis, and seizures. These are serious medical problems that require a doctor's intervention immediately. [21] X Research source"
    },
    {
      "title": "Understand that lung cancer can produce hormonal symptoms.",
      "content": "Understand that lung cancer can produce hormonal symptoms. Lung tumors secrete hormones and can produce symptoms that seem unrelated to the lungs. These include: [22] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source Palpitations and tremors Puffiness in the face A bloated appearance Enlargement of the breasts in males (gynecomastia)"
    },
    {
      "title": "Factor in any other strange symptoms.",
      "content": "Factor in any other strange symptoms. Lung cancer can also produce a high fever [23] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source and a change in the shape of your fingernails. [24] X Research source If you notice these or any other unexplained symptoms, especially if you have other symptoms or carry a high risk, see a doctor."
    },
    {
      "title": "Monitor your tobacco use.",
      "content": "Monitor your tobacco use. People who have smoked for a long time or who smoke more than 2 packs of cigarettes per day have a much higher risk of developing lung cancer. Chewing tobacco and snuff also increase your risk. [25] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source"
    },
    {
      "title": "Be aware of second-hand smoke.",
      "content": "Be aware of second-hand smoke. Even if you do not smoke yourself, frequent contact with second-hand (like being exposed to chemicals and smoke) increases your risk considerably, especially if you live with a smoker. [26] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Understand the effects of medical radiation.",
      "content": "Understand the effects of medical radiation. If you have had radiation to treat past cancers, or any other disease, your risk of developing lung cancer goes up. In general, though, under these circumstances, the benefits of treatment outweigh the risks. [27] X Trustworthy Source National Cancer Institute An agency in the National Institutes of Health focused on cancer research and patient support Go to source"
    },
    {
      "title": "Note any exposure to cancer-causing chemicals.",
      "content": "Note any exposure to cancer-causing chemicals. Gasoline fumes, diesel fumes, mustard gas, vinyl chloride, and coal products may increase your risk of developing lung cancer. This factor explains why people in certain jobs have higher incidences of the disease. [28] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source Exposure to other chemicals, including arsenic, coal, silica, chromium, and asbestos, may also make you more susceptible to lung cancer. These chemicals are mostly impossible to sense, however, and so are difficult to avoid. Quarry miners that work with ore or coal have an increased risk of lung cancer. [29] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Know your family medical history.",
      "content": "Know your family medical history. If you have a relative who has been diagnosed with lung cancer, you may also have a higher risk. [30] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Factor in your age and gender.",
      "content": "Factor in your age and gender. Lung cancer rates increase with age, with people over 60 carrying the highest risk. [31] X Trustworthy Source National Cancer Institute An agency in the National Institutes of Health focused on cancer research and patient support Go to source Men develop lung cancer more frequently than women do. [32] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source"
    }
  ]
}