{
  "url": "https://www.wikihow.com/Get-on-and-off-a-Ski-Lift",
  "title": "How to Get on and off a Ski Lift",
  "steps": [
    {
      "title": "Pick a suitable mountain for your ski level, and a suitable lift on that mountain.",
      "content": "Pick a suitable mountain for your ski level, and a suitable lift on that mountain. Most lifts have signs indicating what levels (green/blue/black/red) of trails that lift services."
    },
    {
      "title": "Put your skis on.",
      "content": "Put your skis on. Grab your poles, but don't put your hands into the straps."
    },
    {
      "title": "Get in line for the lift; the higher up the mountain the lift goes, the faster the chair lift may move.",
      "content": "Get in line for the lift; the higher up the mountain the lift goes, the faster the chair lift may move. Beginner or easy slopes may have chairlifts that move very slowly so it may take a long time to reach the top on those lifts."
    },
    {
      "title": "Glide your way to the lifting area and keep your poles close to you.",
      "content": "Glide your way to the lifting area and keep your poles close to you."
    },
    {
      "title": "Stop on the marked line.",
      "content": "Stop on the marked line. This is where the chair will come and you will sit down."
    },
    {
      "title": "If you'll be sitting on the left, put both poles in your right hand, and look over your left shoulder.",
      "content": "If you'll be sitting on the left, put both poles in your right hand, and look over your left shoulder. If you'll be sitting on the right, do the opposite. If you'll be sitting in the middle, do it either way."
    },
    {
      "title": "Bend your knees slightly because the chair (lift) will hit them, but this is normal.",
      "content": "Bend your knees slightly because the chair (lift) will hit them, but this is normal."
    },
    {
      "title": "As the chair approaches, you may want to reach for it with your free hand.",
      "content": "As the chair approaches, you may want to reach for it with your free hand."
    },
    {
      "title": "Sit down when the lift touches the backs of your knees.",
      "content": "Sit down when the lift touches the backs of your knees."
    },
    {
      "title": "Pull the metal bar down over you as a seat belt and you are on your way to the trail.",
      "content": "Pull the metal bar down over you as a seat belt and you are on your way to the trail."
    },
    {
      "title": "Sit back in your chair and do not rock the chair.",
      "content": "Sit back in your chair and do not rock the chair."
    },
    {
      "title": "Watch the big towers for signs because they may give you information when you are close to the top.",
      "content": "Watch the big towers for signs because they may give you information when you are close to the top."
    },
    {
      "title": "Lift the metal bar off of you when the unloading area sign on the towers says to.",
      "content": "Lift the metal bar off of you when the unloading area sign on the towers says to."
    },
    {
      "title": "Double check to make sure you have all your belongings and nothing is caught on the chair.",
      "content": "Double check to make sure you have all your belongings and nothing is caught on the chair."
    },
    {
      "title": "Make sure your scarf is not loose.",
      "content": "Make sure your scarf is not loose."
    },
    {
      "title": "Slide forward in the chair and point the tips of your skis upward.",
      "content": "Slide forward in the chair and point the tips of your skis upward."
    },
    {
      "title": "When you reach the unload area and your skis are touching the ground completely , lean forward slightly over your skis and stand up once you have balance on both skis, the lift will give you a little push.",
      "content": "When you reach the unload area and your skis are touching the ground completely , lean forward slightly over your skis and stand up once you have balance on both skis, the lift will give you a little push."
    },
    {
      "title": "Glide your way off the unloading area quickly.",
      "content": "Glide your way off the unloading area quickly. Do not attempt to stop with a snow plough in the unload area - your skis will cross the person's next to you and you will probably both fall. Ski away from the other people, then stop if you want to. Try to prevent staying in the unload area for very long because it can become crowded making it difficult for others to get off the ski lift."
    },
    {
      "title": "Choose the right trail because sometimes there are many to choose from, with different skill levels (colors).",
      "content": "Choose the right trail because sometimes there are many to choose from, with different skill levels (colors)."
    }
  ]
}