{
  "url": "https://www.wikihow.com/Indigo-Children",
  "title": "12 Signs That You’re an Indigo Child",
  "steps": [
    {
      "title": "Indigo Children are kids with indigo-colored auras who possess high intelligence, intuition, and empathy and can have special traits or abilities.",
      "content": "Indigo Children are kids with indigo-colored auras who possess high intelligence, intuition, and empathy and can have special traits or abilities. Indigo Children are believed to be reincarnated souls destined to challenge societal institutions like medicine and education and spiritually awaken humanity. [1] X Research source Indigo Children are also sometimes believed to be Starseeds, or extraterrestrial souls from another part of the universe that have been reincarnated here on Earth. Some people believe that Indigo Children are more evolved blueprints of humanity. Indigo is also the color of the third-eye chakra, which is associated with intuition, psychic knowledge, and other abilities beyond the ordinary. Crystal children, Rainbow Children, and Star Children are all different variations of Indigos."
    },
    {
      "title": "You were born in 1978 or later.",
      "content": "You were born in 1978 or later. Infants with indigo auras first began appearing in the late 1970s. If you were born in 1978 or later, it may mean that you’re destined to challenge society and make a positive impact on the world around you. [2] X Research source Adults who were born before 1978 and relate to these characteristics might be forerunners or “lightworkers” who set the groundwork for Indigos to come in and change the world. [3] X Research source"
    },
    {
      "title": "You feel like you’re destined to be on Earth.",
      "content": "You feel like you’re destined to be on Earth. You’re confident, independent, and proud of who you are. You feel empowered by a force you can’t describe and know that you were put on this planet for a reason—to enact positive change . [4] X Research source"
    },
    {
      "title": "You’ve always been told that you’re an “old soul.”",
      "content": "You’ve always been told that you’re an “old soul.” You have always felt like you have lived many lifetimes before. As a child, you may have acted older than you were, and as an adult, you’re deeply philosophical and have often been told that you’re wise. [5] X Research source"
    },
    {
      "title": "You have high expectations of yourself and the people around you.",
      "content": "You have high expectations of yourself and the people around you. You constantly strive to be the best, and expect others to reach the same level. You can be incredibly self-critical, but that’s only because you believe that you can reach anything you put your mind to. As an adult, you might’ve struggled with depression because you haven’t felt like you could enact positive change in the world. If you feel this way, find an indigo support group to help you through difficult times and find other indigos who may also be struggling."
    },
    {
      "title": "You question authority and push against the rigid systems of society.",
      "content": "You question authority and push against the rigid systems of society. You may have been a “difficult” child who found it hard to obey authority figures, especially when their methods seem corrupt, illogical, or outdated. As a strong-willed nonconformist, you've always felt that you knew the right way to do things and performed better when you’re in charge or working alone. [6] X Research source"
    },
    {
      "title": "You feel out of place or misunderstood among family and friends.",
      "content": "You feel out of place or misunderstood among family and friends. You’ve always been incredibly intelligent and recognized that you’re different from most people, but your excellence may have come with a price. Even though your life purpose is to help humankind, you might have felt mislabeled or misunderstood throughout your life. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Growing up, you might have wavered between having low self-esteem and high self-esteem."
    },
    {
      "title": "You have psychic abilities, like having visions or seeing dead people.",
      "content": "You have psychic abilities, like having visions or seeing dead people. Without needing to develop them , your psychic abilities are strong and give you an advantage in life. You might be clairvoyant, practice telepathy, or see angels or people who have passed away. [8] X Research source Some also believe that indigo children often have intense blue or green-colored eyes. [9] X Research source"
    },
    {
      "title": "You seek change and get frustrated when others don’t follow your vision.",
      "content": "You seek change and get frustrated when others don’t follow your vision. You have a vision for the perfect world and constantly push societal boundaries to achieve it. You also have a fiery temper, and quickly become restless or annoyed when others don’t see your vision—or worse, push back against it. As a child, you might have been called “bossy” by the people around you. [10] X Research source"
    },
    {
      "title": "You’re an intuitive, headstrong truth seeker.",
      "content": "You’re an intuitive, headstrong truth seeker. You see and understand things about humanity and life that other people seem to miss. Your keen perception skills allow you to immediately sort out lies and deception from the truth, and when you’re around others, it’s like you can immediately tell when someone is lying or hiding something. [11] X Research source You might always have a deep feeling that you’re “right” about something, but when people ask you for evidence, you can’t seem to come up with anything to explain it."
    },
    {
      "title": "You’re extremely empathetic and compassionate.",
      "content": "You’re extremely empathetic and compassionate. You care so much about the people around you and the planet you’re on and you’ve always been able to easily bond with plants and animals. Every time you witness violence or cruelty, you feel incredibly angry and sad, which motivates you to change the world around you for the better. [12] X Research source Your high level of empathy and compassion might also mean that you have struggled with anxiety, depression, or suicidal thoughts off and on throughout your life. Because of your deep connection to the world around you, you might also be more sensitive to chemicals, fluorescent lights, environmental pollution, and artificial ingredients."
    },
    {
      "title": "You’re creative, with a flair for music, poetry, or art.",
      "content": "You’re creative, with a flair for music, poetry, or art. Your ability to notice the world around you at a much deeper level can manifest itself through your art or other creative forms of expression. You often excel and find solace in music, dancing, painting , drawing, building, writing, or crafting. You might also find that you get bored easily and constantly drift from one creative activity to another. [13] X Research source"
    },
    {
      "title": "You’re a loner who enjoys solitude.",
      "content": "You’re a loner who enjoys solitude. You’re a free spirit that doesn’t like to be tied down by anyone or anything. You’ve always been disinterested in or overwhelmed by being around too many different people at once and often like to spend time by yourself. You might call yourself an introvert or find yourself constantly pushing others away. [14] X Research source"
    },
    {
      "title": "Nancy Ann Tappe first discussed Indigo Children in the 1960s.",
      "content": "Nancy Ann Tappe first discussed Indigo Children in the 1960s. Parapsychologist, synesthete, and psychic Nancy Ann Tappe developed the idea of “life colors.” “Life colors” are auras that stay the same from birth to death and define a person’s personality and life path. In the 1960s and 1970s, Tappe saw a new life color in infants she called indigo. Today, most people under 30 years old are believed to have the indigo life color."
    },
    {
      "title": "Lee Carroll, Jan Tober, and Doreen Virtue popularized Indigo children.",
      "content": "Lee Carroll, Jan Tober, and Doreen Virtue popularized Indigo children. Lee Carroll and Jan Tober interviewed Tappe and further developed the idea of indigo children in their 1999 book, The Indigo Children . Psychic Doreen Virtue’s 2001 book, The Care and Feeding of Indigo Children further pushed the idea of indigo children into mainstream popularity. In her book, Doreen Virtue outlined 17 characteristics of indigos. If you identified with 14 of them, then you are believed to be an indigo. [15] X Research source As a born-again Christian, Doreen Virtue has since denounced her New Age work and asks people not to sell or buy her old work. [16] X Research source The first conference on indigo children was held in Hawai’i in 2002, and there have been several other conferences in other states. There have also been several films and comics made about indigo children."
    },
    {
      "title": "Some scholars argue that “indigo” can be an alternative diagnosis for ADHD.",
      "content": "Some scholars argue that “indigo” can be an alternative diagnosis for ADHD. Some critics have suggested that parents choose to believe this concept rather than accept that their child needs a psychiatric diagnosis or shows signs of learning disabilities. [17] X Research source This idea is said to come from concerns that children are over-medicalized. [18] X Research source The traits of indigo children also align with the symptoms of children with ADHD. For example, both Indigo Children and children with ADHD may seem to reject authority by not listening when they’re spoken to or avoiding tasks like homework or schoolwork. Some mental health experts are concerned that labeling a child with ADHD as indigo can delay proper diagnoses and treatment that would help them. The idea of crystal children, the other life aura defined by Nancy Ann Tappe, has been linked by researchers to the autism spectrum. [19] X Research source"
    },
    {
      "title": "There’s no scientific evidence that Indigo Children exist.",
      "content": "There’s no scientific evidence that Indigo Children exist. No scientific studies have proved the existence of indigo children or their psychic abilities. There has also been no conclusive scientific evidence that auras (or human biofields) exist. However, there have been some studies that have tried to find the purpose of auras from a scientific perspective. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Some people might be able to see auras as a result of migraines. [21] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Epilepsy is also known to cause visual auras. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Other people might be able to see auras because they have a certain form of synesthesia, a neuropsychological condition that allows synesthetes to taste a sound or associate people or letters with a certain color. [23] X Research source The traits of the Indigo Children concept are often considered to show the Forer Effect, where a personality description is vague enough to allow anyone to relate to it."
    }
  ]
}