{
  "url": "https://www.wikihow.com/Make-Starbucks-Coffee",
  "title": "How to Make Starbucks Coffee",
  "steps": [
    {
      "title": "Use the right proportion of coffee to water.",
      "content": "Use the right proportion of coffee to water. At Starbucks, they use two tablespoons, or 10 grams (0.35 oz), of ground coffee for each six ounces of water. A member of Starbucks' Coffee Education Team says that \"Too few coffee grounds result in over-extracted or bitter coffee. Too many grounds result in under-extracted coffee that does not achieve the full flavor of the blend.\""
    },
    {
      "title": "Choose a good grind method.",
      "content": "Choose a good grind method. This step implies that you are, in fact, grinding your coffee. If you want to make your brew taste just like Starbucks, don't buy pre-ground coffee. Grind it yourself just before brewing for optimum freshness. [1] X Research source Depending on your brew method (see part 2) you will need a different level of coarseness for your brew. Pour-over brewing requires a fine grind (like granulated sugar), traditional drip coffee is best with a medium grind (like sea salt) and coffee presses require a coarse grind. [2] X Research source Over-extracted coffee tends to taste considerably worse than coarser, under-extracted coffee, so when in doubt go for an under-extracted (coarse) grind. To make it taste like Starbucks coffee, you might want to use the blends available for purchase at Starbucks franchises."
    },
    {
      "title": "Use quality water.",
      "content": "Use quality water. This may seem like a silly point. Water is just water, right? Wrong. To make Starbucks-quality coffee, always use fresh water, filtered of impurities. Additionally, be sure to heat the water to \"just off boil,\" i.e. between 195 and 205 degrees Fahrenheit (90 to 96 degrees celsius)."
    },
    {
      "title": "Use fresh coffee.",
      "content": "Use fresh coffee. As alluded to in Step 3, it's important to use fresh coffee. This means grinding it yourself immediately prior to brewing, but also keeping your beans in an airtight container. Be sure not to keep your coffee in refrigerator or freezer, even in airtight containers. Another Starbucks' coffee educator says these two appliances are \"“not the friend, but rather the enemy of good coffee.\" This is because while being stored in refrigerators and freezers, moisture develops which damages the flavor."
    },
    {
      "title": "Select the brewing method that works for you.",
      "content": "Select the brewing method that works for you. Now that you're following Starbucks' Four Fundamentals of brewing, it's time to select a brewing method. There are three general methods Starbucks uses (technically four, but two of them are just versions of the same thing). These are: coffee press, traditional drip coffee, and pour over (which can be either hot or iced). [3] X Research source"
    },
    {
      "title": "Use a coffee press.",
      "content": "Use a coffee press. Coffee press is the method of brewing most strongly advocated by coffee connoisseurs, as it is believed to be the most effective at staying true to the flavor profile of the beans. A coffee press requires a coarse grind, so be sure your grounds resemble the size of sea salt. Fill the press with your grounds, then pour hot water (just off the boil) over the grounds, making sure to completely saturate them. Place the plunger back on the press but wait four minutes before pressing it down, giving the coffee time to brew. After you've pressed the plunger down, enjoy your coffee! [4] X Research source"
    },
    {
      "title": "Use a traditional drip coffeemaker.",
      "content": "Use a traditional drip coffeemaker. Drip brewing is perhaps the most convenient method of brewing. You can make multiple cups of coffee in a single brew, and you can do it fast. With the right grind, quality of beans, and pure, fresh water, you can make a brew that rivals that of a coffee press. For flat-bottom filters be sure to use a medium-sized grind, like the sea salt grind used for a coffee press. Meanwhile, cone-shaped filters are best with a finer grind, like granulated sugar. After you've got your grind right, just measure out your coffee (2 tablespoons for every six ounces of water) and press \"Brew\" on the machine! While the convenience is tempting, if you want Starbucks-quality coffee every time, only make however much coffee you need for one sitting. Don't reheat coffee or you will dull the flavor. [5] X Research source"
    },
    {
      "title": "Use a pour-over method.",
      "content": "Use a pour-over method. Another, perhaps lesser-known but equally satisfying, method Starbucks uses is the pour-over, which can be either hot or iced. With the pour-over, you can only make a single cup of coffee, but it will be wonderful. Boil your water, remembering the 2:6 ratio from above, but adding a little extra. Use this extra hot water to moisten your filter. Once you've boiled your water and pre-moistened your filter, grind your coffee using a fine grind, like that used in cone-shaped filters. It should resemble granulated sugar. Once you've got your coffee measured out and sitting in your filter, pour your hot water over the grounds, but pause when you've filled it halfway. This allows the coffee to be fully and even saturated, developing flavor. After your pause, pour over the rest, going in small circles to distribute the water evenly. It should take about three minutes for your cup to finish brewing. To make iced coffee, just pour your brew over fresh ice, let it chill, and serve! [6] X Research source"
    },
    {
      "title": "Pour the brewed coffee.",
      "content": "Pour the brewed coffee. Now that you've brewed your coffee according to Starbucks' Four Fundamentals and used one of their brewing methods, pour your cup! You can pour it into a mug or, for a true Starbucks experience, get some of their paper cups and sleeves and misspell your name on the cup."
    },
    {
      "title": "Flavor your cup.",
      "content": "Flavor your cup. Depending on your tastes, add a shot of flavored syrup and/or artificial or natural sweetener to the coffee and stir. If you really want to re-create the Starbucks experience, snag a few packets of your favorite sweetening products the next time you're at a Starbucks and use it in your cup at home! Or perhaps you're a hardy soul and take your coffee black? If so, you're done!"
    },
    {
      "title": "Add a bit of milk or other creamer and stir some more.",
      "content": "Add a bit of milk or other creamer and stir some more. You can gauge how much creamer you are adding by looking at how light the coffee gets. There really is no \"right\" way to do this, since this part of making a Starbucks coffee is always up to you, whether it was brewed by a barista or your own hands."
    },
    {
      "title": "Wait for it to cool a little and enjoy!",
      "content": "Wait for it to cool a little and enjoy!"
    }
  ]
}