{
  "url": "https://www.wikihow.com/Insert-a-Line-in-HTML",
  "title": "How to Create a Horizontal Line in HTML",
  "steps": [
    {
      "title": "Open or create a new HTML document.",
      "content": "Open or create a new HTML document. HTML documents can be edited using a text editor such as Notepad. You can also use a code editor, such as Adobe Dreamweaver or Visual Studio Code . Use the following steps to open an HTML document in the program of your choice: Open Notepad, or a text editor/code editor of your choice. Click the File menu. Click Open . Select an HTML file. Click Open ."
    },
    {
      "title": "Add a head to your HTML document.",
      "content": "Add a head to your HTML document. If your HTML document doesn't already have a head, use the following steps to add a head. The head goes after the \"<html>\" tag, and before the \"<body>\" tag. Type <head> at the top of the document. Press the Enter key twice to add two new lines. Type </head> to close the head section."
    },
    {
      "title": "Type <style> in the head section.",
      "content": "Type <style> in the head section. The style tag goes in between the opening and closing head tags. This creates a section where you can input CSS code to style your HTML. Alternatively, you can use an external CSS file to style your HTML."
    },
    {
      "title": "Type hr {.",
      "content": "Type hr { . This is the CSS tag for styling your horizontal line. Add this after the style tag in your head, or in your external CSS file. Alternatively, you can define a class style to create different styles for your horizontal lines."
    },
    {
      "title": "Add CSS styles for your \"<hr>\" tag.",
      "content": "Add CSS styles for your \"<hr>\" tag. These go after the \"hr {\" tag. There are many ways you can style a horizontal line. The following are a few examples. Width: Type width: ##px; to set the line width. Replace \"##\" with the number of pixels wide the line is. You can also use a percentage (%) instead of pixels (px). Height: Type height: ##px; to set the line thickness. Replace \"##\" with the number of pixels thick the line is. Color: Type background-color: ##; to set the color of the line. Replace \"##\" with the name of a color or add a pound (#) followed by a hexadecimal color code . Right Margin: Type margin-right: ##px; to set the number of pixels from the right edge. Replace \"##\" with the number of pixels or \"auto\". Using \"auto\" will center the line within its specified width. The remaining space will be split evenly between the left and right margins. Left Margin: Type margin-left: ##px; to set the number of pixels from the left edge. Replace \"##\" with the number of pixels or \"auto\". Using \"auto\" will center the line within its specified width. The remaining space will be split evenly between the left and right margins. [2] X Research source Top Margin: Type margin-top: ##px; to set a top margin for the line. Replace \"##\" with the number of pixels thick the margin is. Bottom Margin: Type margin-bottom: ##px; to set a bottom margin for the line. Replace \"##\" with the number of pixels thick the margin is. Border: Type border-width: ##px; to create a border around the line (optional). Replace \"##\" with the number of pixels thick the border is. Border Color: Type border-color: ##; to set the border color (optional). Replace \"##\" with the name of a color, or add a pound sign (#) followed by a hexadecimal color code."
    },
    {
      "title": "Type } after the style settings.",
      "content": "Type } after the style settings. This closes your style settings for your <hr> tag."
    },
    {
      "title": "Press ↵ Enter and type </style>.",
      "content": "Press ↵ Enter and type </style> . This creates a new line and then adds the tag to close the style section of your HTML. The \"</style>\" goes after you have added all the style elements for your HTML document."
    },
    {
      "title": "Type <hr> anywhere in the body of your HTML document.",
      "content": "Type <hr> anywhere in the body of your HTML document. The body of your HTML tag is the area in between the \"<body>\" and \"</body>\" tags. This adds a horizontal line to your HTML document. Your CSS style settings will apply anytime you use the \"<hr>\" tag in your HTML. If you have defined a style class for your horizontal line, type {{kbd|<div class=\"[class_name]\"></div>} instead. Replace \"[class_name]\" with the name of the class that you defined. </li"
    },
    {
      "title": "Save your HTML file.",
      "content": "Save your HTML file. To save a text file as an HTML document, you need to replace the file extension (.txt, .docx) with \".html.\" Use the following steps to save your HTML document: Click the File menu. Click Save As if starting a new HTML file. Click Save to save an existing HTML file. Type a name for the file next to \"File name\". Delete the file extension at the end (\".txt,\" \".docx,\" etc) Replace the file extension with \".html.\" Click Save ."
    },
    {
      "title": "Test your HTML.",
      "content": "Test your HTML. To test your HTML file, right-click on the file and select Open with . Then select a web browser. A solid line should appear where you place the \"<hr>\" tag. Your HTML code should look something like this: <!DOCTYPE html> < html > < head > < style > hr { width : 50 % ; height : 20 px ; background-color : red ; margin-right : auto ; margin-left : auto ; margin-top : 5 px ; margin-bottom : 5 px ; border-width : 2 px ; border-color : green ; } </ style > </ head > < body > < h1 > This is a heading </ h1 > < hr > < p1 > This is a paragraph text separated by a horizontal line </ p1 > </ body > </ html >"
    },
    {
      "title": "Open or create a new HTML document.",
      "content": "Open or create a new HTML document. HTML documents can be edited using a text editor such as Notepad. You can also use a code editor, such as Adobe Dreamweaver or Visual Studio Code . Use the following steps to open an HTML document in the program of your choice: Open Notepad, or a text editor/code editor of your choice. Click the File menu. Click Open . Select an HTML file. Click Open ."
    },
    {
      "title": "Select the point at which you want to insert the line.",
      "content": "Select the point at which you want to insert the line. You can insert a horizontal line in the \"<body>\" section of an HTML document. Scroll down until you find the space above which you want to insert the line, then click the far-left side of the line to place the cursor directly before the line start."
    },
    {
      "title": "Press ↵ Enter twice to create a blank space.",
      "content": "Press ↵ Enter twice to create a blank space. This moves down the text above which you want to enter the line."
    },
    {
      "title": "Move the cursor back to where you want to add a line.",
      "content": "Move the cursor back to where you want to add a line. Simply click, or use the arrow keys on the keyboard to move the cursor back to where you want the line to go."
    },
    {
      "title": "Type <hr> into the space before the line begins.",
      "content": "Type <hr> into the space before the line begins. The \"<hr>\" tag is responsible for creating a horizontal line across the entire page. Using this tag by itself will create a basic horizontal line."
    },
    {
      "title": "Press ↵ Enter to place the \"<hr>\" on it's own line.",
      "content": "Press ↵ Enter to place the \"<hr>\" on it's own line. At this point, the <hr> tag should be on its own line with no other code to the left or right of it."
    },
    {
      "title": "Type style= in the \"<hr>\" tag (optional).",
      "content": "Type style= in the \"<hr>\" tag (optional). If you want to style your horizontal line, you can do so using in-line HTML. To style your horizontal line, type \"style=\" after \"hr\" inside the \"<hr>\" tag (i.e. <hr style=>."
    },
    {
      "title": "Add your style attributes (optional).",
      "content": "Add your style attributes (optional). If you want to add style attributes, add them after \"style=\" in quotation marks within the \"<hr>\" tag. The style attributes are the same as CSS style attributes. You can include as many attributes as want. Separate each attribute with a semi-colon (;) except the last attribute. The following are some style attributes you can add: Width: Type width: ##px to set the line width. Replace \"##\" with the number of pixels wide the line is. You can also use a percentage (%) instead of pixels (px). Height: Type height: ##px to set the line thickness. Replace \"##\" with the number of pixels thick the line is. Color: Type background-color: ## to set the color of the line. Replace \"##\" with the name of a color or a pound (#) followed by a hexadecimal color code . Alignment: Type text-align:## to set an alignment for your horizontal rule. Replace \"##\" with \"left,\" \"right,\" or \"center.\" Right Margin: Type margin-right: ##px to set the number of pixels from the right edge. Replace \"##\" with the number of pixels or \"auto\". Using \"auto\" will center the line within its specified width. The remaining space will be split evenly between the left and right margins. Left Margin: Type margin-left: ##px to set the number of pixels from the left edge. Replace \"##\" with the number of pixels or \"auto\". Using \"auto\" will center the line within its specified width. The remaining space will be split evenly between the left and right margins. [3] X Research source Top Margin: Type margin-top: ##px to set a top margin for the line. Replace \"##\" with the number of pixels thick the margin is. Bottom Margin: Type margin-bottom: ##px; to set a bottom margin for the line. Replace \"##\" with the number pixels thick the margin is. Type border-width: ##px to create a border around the line. Replace \"##\" with the number of pixels thick the border is. Type border-color: ## to set the border color. Replace \"##\" with the name of a color, or a pound sign (#) followed by a hexadecimal color code."
    },
    {
      "title": "Save your HTML file.",
      "content": "Save your HTML file. To save a text file as an HTML document , you need to replace the file extension (\".txt,\" \".docx,\" etc) with \".html\". Use the following steps to save your HTML document: Click the File menu. Click Save As if starting a new HTML file. Click Save to save an existing HTML file. Type a name for the file next to \"File name.\" Delete the file extension (\".txt,\" \".docx,\" etct) Replace the file extension with \".html.\" Click Save ."
    },
    {
      "title": "Test your HTML.",
      "content": "Test your HTML. To test your HTML file, right-click on the file and select Open with . Then select a web browser. A solid line should appear where you place the \"hr\" tag. Your HTML code should look something like the following: [4] X Research source <!DOCTYPE html> < html > < body > < h1 > This is a Heading </ h1 > < hr style = \"width:\" 50 %; text-align:left ; background-color:green \" > < p1 > This is paragraph text that has been separated from the heading by a line. </ p1 > </ body > </ html >"
    }
  ]
}