{
  "url": "https://www.wikihow.com/Hunt-for-Shiny-Pokemon-in-Ultra-Sun-and-Ultra-Moon",
  "title": "How to Hunt for Shiny Pokemon in Ultra Sun and Ultra Moon",
  "steps": [
    {
      "title": "Know about SOS Battles.",
      "content": "Know about SOS Battles. SOS Battles are a type of battle in Pokémon Sun and Moon and Pokémon Ultra Sun and Ultra Moon. SOS Battles mean 'save our ship' battles, where an injured wild Pokémon that is low on Health will call for ally Pokémon. The ally Pokémon have a high chance of being Shiny. To start, you will want to stock up on Adrenaline Orbs. Adrenaline Orbs are items that you can buy from every Poké Mart and that make Pokémon more likely to call for allies."
    },
    {
      "title": "Teach your Pokémon an HP reducing move that will not kill the wild Pokémon.",
      "content": "Teach your Pokémon an HP reducing move that will not kill the wild Pokémon. Once you have an Adrenaline Orb, you will want to teach one of your Pokémon the move False Swipe, which lowers the enemy's health to the very minimum, so that it will be most likely to call for help. False Swipe can be found on Route 8."
    },
    {
      "title": "Bring your Adrenaline Orb and your False Swipe Pokémon to a Pokémon battle, and then use False Swipe to lower the enemy's health to 1 HP.",
      "content": "Bring your Adrenaline Orb and your False Swipe Pokémon to a Pokémon battle, and then use False Swipe to lower the enemy's health to 1 HP."
    },
    {
      "title": "Use your Adrenaline Orb to 'make the opponent nervous'.",
      "content": "Use your Adrenaline Orb to 'make the opponent nervous'. Now the opponent will eventually start calling for help. This article will call this Pokémon the 'Summoner', because it summons allies."
    },
    {
      "title": "Whenever an ally appears, kill it (if it is not Shiny) and do not kill the Summoner.",
      "content": "Whenever an ally appears, kill it (if it is not Shiny) and do not kill the Summoner."
    },
    {
      "title": "Continue step 5 until you find a Shiny Pokemon, then kill the Summoner and catch the Shiny Pokémon.",
      "content": "Continue step 5 until you find a Shiny Pokemon , then kill the Summoner and catch the Shiny Pokémon. You need to defeat every Pokémon except the one that you want to catch beforehand, so prepare! Put your best team on it."
    },
    {
      "title": "To use the Ultra Wormhole method, you will need to have unlocked the Altar of the Moone if you play Moon or Ultra Moon, or the Altar of the Sunne if you're playing Sun or Ultra Sun.",
      "content": "To use the Ultra Wormhole method, you will need to have unlocked the Altar of the Moone if you play Moon or Ultra Moon, or the Altar of the Sunne if you're playing Sun or Ultra Sun. Fly to the Altar of the Moone/Sunne using the Charizard mount."
    },
    {
      "title": "Enter the wormhole (the white rift in space-time) by pressing 'A' and selecting 'Enter the Ultra Wormhole'.",
      "content": "Enter the wormhole (the white rift in space-time) by pressing 'A' and selecting 'Enter the Ultra Wormhole'."
    },
    {
      "title": "Play the minigame 'Ultra Warp Ride'.",
      "content": "Play the minigame 'Ultra Warp Ride'. The purpose of this minigame is to hit the golden circles and dodge the blue circles and portals as far as you can. If you go really far in Ultra Warp Ride, it can be really easy to get a Shiny two within an hour of each other!"
    },
    {
      "title": "Once you end the minigame and enter a portal, you will appear in a mysterious place called the 'Ultra Space Wilds'.",
      "content": "Once you end the minigame and enter a portal, you will appear in a mysterious place called the 'Ultra Space Wilds'. Here, you will find the spot where the Pokémon will appear."
    },
    {
      "title": "Once a Pokémon appears, if it isn't Shiny, then end the battle, go back to the Altar of The Moone/Sunne and repeat steps 2–5.",
      "content": "Once a Pokémon appears, if it isn't Shiny, then end the battle, go back to the Altar of The Moone/Sunne and repeat steps 2–5. Repeat this until you get a Shiny."
    },
    {
      "title": "If you find a Shiny, then catch it.",
      "content": "If you find a Shiny, then catch it. Congratulations and enjoy your new Shiny Pokémon!"
    }
  ]
}