{
  "url": "https://www.wikihow.com/Make-Any-Girl-Go-Crazy-over-You",
  "title": "How to Make Any Girl Go Crazy over You",
  "steps": [
    {
      "title": "Be likable, but don't be a doormat.",
      "content": "Be likable, but don't be a doormat. It's fine—awesome—to be nice and sensitive. But don't push it so far that you become like her brother. That's the kiss of death to any hopes you might have, so let your conversation go into areas brothers never go. For example, saying something like, \"You look nice, Julia,\" may be true, and she'll probably like to hear it, but c'mon—it's something her brother could say! Instead, try something like, \"Damn, Julia, you look sexy today. Those jeans are smokin' on you!\" Think her brother might say that? Let's hope not. Don't be her brother and don't give her reason to think of you as one."
    },
    {
      "title": "Appreciate the whole person.",
      "content": "Appreciate the whole person. People tend to give what they get, and get what they give. If she thinks you appreciate her just for her mind, then it's likely that she'll also appreciate you for your mind, too. But not your body, bro. [2] X Research source"
    },
    {
      "title": "",
      "content": "Appreciate all of her—her mind, her spirit, and her body. Let her know you think she's pretty, or sexy, or both. Reader Poll: We asked 1029 wikiHow readers to tell us the best conversation topics to bring up with a girl, and 62% of them said hobbies and fun things they’ve done recently . [Take Poll] So as your getting to know her as a whole person, you can’t go wrong by asking her about what she does for fun!"
    },
    {
      "title": "Pay attention to girls who aren’t used to it.",
      "content": "Pay attention to girls who aren’t used to it. Plenty of perfectly nice, pretty girls get left on the sidelines because they’re quiet, shy, or not part of a fashionable social group. [3] X Research source The next time you sit next to one of these girls in class, strike up a conversation with her; the next time you see a girl standing around at a party or club, invite her to dance. Even if it’s clear that there's no romantic interest, she won’t forget it—and she will never look at you the same way again. Learning how to interact with girls on a social level, without wanting anything other than their company, is a good lesson to learn. The more comfortable you are around girls in general, the more comfortable you will be when you meet somebody you really like."
    },
    {
      "title": "Learn how to flirt.",
      "content": "Learn how to flirt. Flirting takes practice, confidence, and the ability to forget about your own nervousness; after all, how can you pick up on anyone else’s cues if you are too busy wiping the sweat off your palms or staring at your own feet? Prepare yourself by reading How to Flirt . To step up your game, learn the following: [4] X Research source How to Have a Great Conversation How to Have a Witty Conversation How to Read Body Language How to Touch a Girl —excellent if you’re desperate for ways to break the touch barrier If you don't have a lot of flirting experience, practice having simple conversations with random people. Once you get comfortable talking to strangers, it'll be a lot easier to approach women."
    },
    {
      "title": "Change your profile picture.",
      "content": "Change your profile picture. If your current photo shows you flashing your best smile into the camera, delete it immediately; studies show that, though guys are most attracted to photos of smiling girls, girls are the least attracted to photos of smiling men. Instead, they prefer photos of guys who either look proud or downcast. Studies also show that the left side of the face tends to be considered the most attractive. Take a new photo of yourself looking off and to the right with either a brooding, downward-glancing, Edward-Cullen-ey look or a cocky, up-ward looking, Jacob-Black-ey look—and watch the “likes” and “favorites” pour in."
    },
    {
      "title": "Don’t try too hard.",
      "content": "Don’t try too hard. If your photo comes off as mopey or attention-seeking, you will be laughed at. Take many photos if necessary and choose one where you still look natural and yourself. Have a girl friend take the pictures, if you can. She'll know what girls like to see, and may be able to get the right shot."
    },
    {
      "title": "Be casual.",
      "content": "Be casual. Send the message that you are at ease in any situation, even if you secretly want to run screaming. It's called confidence. [5] X Research source You're never going to be able to act confident unless you also feel confident. Doing something as simple as getting some new clothes, looking a bit more stylish, or getting the right haircut can help you feel more attractive and confident. If you approach girls like a desperate beggar who is terrified of rejection, they will know it instinctively, and will proceed to prove you right. Don't act like you’re too cool to care. Just be enthusiastic and calm, and if something goes wrong, laugh it off and move forward without a scratch."
    },
    {
      "title": "Ask her out.",
      "content": "Ask her out. If you’ve found someone you’re seriously interested in, don’t be afraid to make the first move. Most girls really appreciate it when you take the initiative to ask them out (even if they don’t say yes). On top of that, you will feel proud of yourself for having been so bold (again, even if they don’t say yes). Read How to Ask a Girl Out to give yourself every advantage. [6] X Research source Many are the tales of the gorgeous girl who never got asked out because everybody was so sure that she was either already busy or too beautiful for them, that they never asked. Be persistent. If a girl you’re really interested in doesn’t say yes the first time, try again later. This doesn’t mean being clingy or acting like a stalker; it means smiling, saying, “Alright—I’ll try again next week,” and going about your own business for a while. If you normally talk to her during the week, don't stop. Just don't pressure the date request. Give her some time to think about how cool and confident you were and the next time you ask, you might be surprised by how differently she responds."
    },
    {
      "title": "Live up to the expectations you’ve set.",
      "content": "Live up to the expectations you’ve set. Okay, so you finally snagged the girl you were dreaming of. Now what do you do with her? If you’re at the kissing stage, make sure you are ready—clean, fresh breath, all of that. If you’re at the relationship stage, make sure you know how to be a good boyfriend . If things get serious, make sure you know how to have a healthy relationship . Going through the trouble of making a girl crazy about you only to let her down when things get interesting is enough to make a girl plain crazy!"
    }
  ]
}