{
  "url": "https://www.wikihow.com/Make-a-Stress-Ball",
  "title": "How to Make a Stress Ball in 2 Simple Ways",
  "steps": [
    {
      "title": "Gather an uninflated balloon.",
      "content": "Gather an uninflated balloon. Don't use water balloons, which are too thin and weak for this purpose, and will easily burst. [1] X Research source"
    },
    {
      "title": "Choose a filling.",
      "content": "Choose a filling. For a typical palm-sized stress ball, you'll need approximately 160 to 240 grams (5.6 to 8.5 oz) of filling. Any of these will do: For a firm stress ball, use flour, baking soda, [2] X Research source or cornstarch (a white powder called cornflour in the Commonwealth). For a looser stress ball, use dry rice lentils, small beans, or split peas, or fine play sand from a hardware store. Mix a small amount of dried rice into flour for something in between. This is also more durable than flour alone."
    },
    {
      "title": "Blow up the balloon slightly (optional).",
      "content": "Blow up the balloon slightly (optional). This isn't always necessary but can be useful if the balloon isn't elastic enough to fit the filling. Blow it up to about 3 to 5 inches (7.6 to 12.7 cm) across, then pinch the neck shut without tying it. This is easiest to do with a clip or assistant to hold it closed. This can make the filling process messier if the air escapes while you're filling it."
    },
    {
      "title": "Stick a funnel into the neck.",
      "content": "Stick a funnel into the neck. If you do not have a funnel, spoon the filling into a plastic bottle instead, and fit the balloon over the neck. A plastic cup pinched to form a spout will work too, but tends to make a mess. [3] X Research source"
    },
    {
      "title": "Fill the balloon slowly.",
      "content": "Fill the balloon slowly. For a typical palm-sized ball, you'll want to fill the balloon approximately 2 to 3 inches (5.1 to 7.6 cm) deep. Pour slowly to avoid clogging the neck of the balloon. If it clogs, use a pencil or spoon handle to clear the opening."
    },
    {
      "title": "Pinch out excess air and tie closed.",
      "content": "Pinch out excess air and tie closed. Remove the balloon from the funnel and let out as much air as you can. Tie the neck of the balloon closed tightly. To release the air, pinch near the neck and separate your finger and thumb slightly. Too wide an opening can blow flour everywhere. [4] X Research source"
    },
    {
      "title": "Snip off the excess rubber.",
      "content": "Snip off the excess rubber. Use a sharp pair of scissors to cut off the dangling end of the balloon. Don't try to cut too close to the knot, or it could come undone."
    },
    {
      "title": "Wrap a small rubber ball in memory foam.",
      "content": "Wrap a small rubber ball in memory foam. You can find the rubber ball from children's toy stores, and memory foam at some fabric stores or specialized online stores. [5] X Research source You'll want a piece of memory foam roughly 3.5 x 5 inches (9 x 12.5 cm) in size, and anywhere from 1 to 3 inches (2.5–7.5 cm) thick. A thicker piece of memory foam will make a softer, more squeezable stress ball."
    },
    {
      "title": "Sew the foam around the rubber ball.",
      "content": "Sew the foam around the rubber ball. Wrap the foam around the rubber ball and sew the memory foam together with needle and thread to enclose the ball completely. Snip off excess memory foam if necessary to make a rough spherical shape."
    },
    {
      "title": "Finish by sewing a sock or piece of thick fabric around the memory foam.",
      "content": "Finish by sewing a sock or piece of thick fabric around the memory foam. An old sock will provide a durable outer covering, but you can use a thick piece of fabric instead. Snip the sock or fabric to make it a tight sphere around the memory foam. Your squeeze ball is now complete."
    }
  ]
}