{
  "url": "https://www.wikihow.com/Make-Low%E2%80%90Calorie-Vodka-Drinks",
  "title": "How to Make Low‐Calorie Vodka Drinks",
  "steps": [
    {
      "title": "Drink straight vodka.",
      "content": "Drink straight vodka. This is the simplest choice and cuts out the calories found in many mixers. Because this option requires absolutely no other ingredients, you won’t need to worry about having a stocked refrigerator or pantry—just pour and enjoy! There are a couple of common ways to enjoy vodka straight. You can drink it very quickly, as a shot. Or, you can put it over ice and sip it (this is called \"on the rocks\"). For even fewer calories, consider brands that market a lower calorie vodka. Skinny Girl Cocktails makes a few different reduced-calorie vodkas. [1] X Research source A 1 1 ⁄ 2 fl oz (44 mL) serving has 75.6 calories, compared to typical vodkas which have 96 calories per 1 1 ⁄ 2 fl oz (44 mL) serving on average. [2] X Research source This can definitely add up! Do note that most reduced-calorie liquors achieve lower calories by reducing the proof. So, you would need to drink more to achieve the same effects as regular liquors. But, depending on the reason for your alcohol consumption, this may not matter to you."
    },
    {
      "title": "Try flavor-infused vodkas.",
      "content": "Try flavor-infused vodkas. Flavor-infused vodkas are flavored vodkas without any extra calories. Many brands of vodka sell infused varieties, including Absolut, Belvedere, Burnett's, and Gray Goose, and it’s been a trend for years in the vodka world to come out with different flavors of infused vodkas. Infused vodkas can make for a more flavorful and interesting experience when drinking vodka straight and can also eliminate the need for various traditional higher-calorie mixers like juice. Many of the infused vodkas sold in stores are infused with things you might expect, like lemon or berries or cucumber. But there are also exotic infusions like horseradish, bacon, and smoked salmon. It’s also very easy to make your own infused vodka! You can use most types of fresh fruits and vegetables. Some people even infuse their vodka with coffee beans or candy, like toffee. Simply place your flavor in a canning jar and pour vodka inside. Wait a few days and then strain the liquid out and voila: flavored vodka! [3] X Research source You can make your own delicious watermelon-infused vodka. Fresh watermelon or watermelon-flavored candy will do the trick."
    },
    {
      "title": "Combine vodka with low-calorie mixers.",
      "content": "Combine vodka with low-calorie mixers. Diet Coke and other diet sodas are popular mixers that add zero calories to vodka. Other common options are plain water, soda water, light cranberry juice, diet iced tea, diet lemonade, and lime juice. [4] X Research source Because the calories in vodka tend to be pretty standard across the board (unless you opt for reduced-calorie vodka) the only way to have a cocktail without a lot of calories is to be mindful of what you mix in with your alcohol. Sugar is the main culprit for calories in mixed drinks. This is why so many of the options for low-calorie mixers are low in sugar or have switched out the sugar with a sugar substitute like Stevia or Sweet'n Low. There’s even sugar-free Triple Sec. If you’re using mixers that do have a fair bit of calories, simply use less. It may end up tasting different that you’re used to, but it can still be delicious. However, using a small amount of a caloric mixture doesn’t have to affect the taste. In fact, a traditional vodka martini uses dry vermouth but uses so little that it doesn’t make the drink very high in calories."
    },
    {
      "title": "Mix vodka with club soda and Mio.",
      "content": "Mix vodka with club soda and Mio. Add 1 shot to vodka to an 8 fl oz (240 mL) glass with ice; then fill with fresh club soda. Top with 2 squeezes of your favorite flavor of Mio, stir, and garnish with a lemon. The fresher the club soda, the more bubbles you will get! Alternatively, skip the Mio and squeeze in a lime wedge to try a cocktail known as a \"Skinny Bitch\" or \"Sportsman.\""
    },
    {
      "title": "Try vodka with Crystal Light and lime.",
      "content": "Try vodka with Crystal Light and lime. Make Crystal Light in your preferred flavor beforehand and put it in the fridge for a few hours. Place ice into an 8 fl oz (240 mL) glass, add 1 shot of vodka, then fill with Crystal Light. Squeeze a lime wedge in and stir. Crystal Light only has 5 calories per serving and comes in a variety of flavors (lemonade, strawberry, orange, etc.), so you can tweak this drink depending on your mood or your individual taste buds."
    },
    {
      "title": "Blend a raspberry cocktail.",
      "content": "Blend a raspberry cocktail. In a blender combine ice cubes, 8 fl oz (240 mL) of Minute Maid Light Raspberry Passion, and 1 1 ⁄ 2 fl oz (44 mL) of vodka. Garnish with fresh raspberries. [5] X Research source This drink only has 115 total calories, so you can splurge on two!"
    },
    {
      "title": "Make a strawberry citrus vodka cocktail.",
      "content": "Make a strawberry citrus vodka cocktail. Gather 2 strawberries, 1 sprig of mint, 3 ⁄ 4 fl oz (22 mL) of light agave nectar, 1 3 ⁄ 4 fl oz (52 mL) of citrus vodka, and 3 ⁄ 4 fl oz (22 mL) of lemon juice. Muddle together the strawberries and mint in a shaker. Then add remaining ingredients and shake vigorously for 20 seconds with ice. [6] X Research source"
    }
  ]
}