{
  "url": "https://www.wikihow.com/Make-Momos",
  "title": "How to Make Momos",
  "steps": [
    {
      "title": "Take out the amount of flour you’ll need to make your momos.",
      "content": "Take out the amount of flour you’ll need to make your momos. A white wheat flour, instead of whole wheat flour, is typically used to make momos. The amount of flour you’ll need will depend on how many guests you’ll be serving. If you want to make enough dough for four people, then you’ll need two cups of flour and about ¾ to 1 cup of water. [1] X Research source You can half this flour to water ratio, or double, triple, or even quadruple it depending on your needs."
    },
    {
      "title": "Mix the flour, salt, and oil.",
      "content": "Mix the flour, salt, and oil. To create the dough for your momos, start by pouring your flour into a large bowl, and then adding salt and oil."
    },
    {
      "title": "Add the water bit by bit to the flour mixture.",
      "content": "Add the water bit by bit to the flour mixture. Don’t add the water all at once because you may not need it all to form your dough. Add a little water at a time while mixing with your free hand, until the flour mixture moistens and begins to stick together."
    },
    {
      "title": "Form the dough by hand.",
      "content": "Form the dough by hand. Knead the dough by hand, adding more water if the dough seems dry, crumbly, or unwilling to stay together. Knead until the dough becomes firm, smooth, and flexible. It shouldn’t stick to your hands."
    },
    {
      "title": "Let the dough sit for 30 minutes.",
      "content": "Let the dough sit for 30 minutes. When your dough is formed, place it in a clean bowl or container and cover with a damp cloth or lid. This is an important step that will keep your dough moist and allow the flour time to absorb the water. [2] X Research source"
    },
    {
      "title": "Decide on the ingredients for your filling.",
      "content": "Decide on the ingredients for your filling. While your dough rests, you can prepare the filling for your momos. You can make momos with either a meat, vegetable, or cheese filling. Tofu can also be used. Typical seasonings include garlic, onion, ginger, bouillon, soy sauce, cilantro, and Szechuan pepper. Use ground meat for a meat filling. In Tibet, Yak meat is most commonly used. Other types of meat used to make momos vary by Tibetan region or community. In some areas, pork or beef is common, while in others mutton is used. Chicken is not a common option, but it is used by those who don’t eat beef. For veggie fillings, you can use a potato filling or an assortment of finely chopped vegetables. Cheese fillings usually consist of either a dry cheese blended with sugar, which is mainly made in Tibet; it can also be a soft cheese mixed with a vegetable, like cheese and spinach or cheese and mushroom."
    },
    {
      "title": "Assemble your ingredients.",
      "content": "Assemble your ingredients. If making a vegetable filling, wash and peel your vegetables. They will need to be finely chopped or grated. You can either do this by hand or by using a food processor. Keep the garlic, onions, and scallions separate from the rest of the vegetables, unless including meat in your filling. A blender may work in place of a food processor; instead of blending the mixture into a smooth puree, pulse it. This means allowing the mixture to blend a couple seconds at a time until fully chopped. If you’d like a meat filling, simply replace the mushrooms and tofu for your choice of ground or chopped meat."
    },
    {
      "title": "Season your mixture.",
      "content": "Season your mixture. Place your chopped vegetables and/or ground meat in a large bowl and mix together well using your hands, if needed. Season with two tablespoons of soy sauce and one teaspoon of bouillon. To ensure your meat mixture is perfectly seasoned, cook a small piece, and taste it. Add more soy sauce and bouillon, if desired."
    },
    {
      "title": "Cook your vegetable filling.",
      "content": "Cook your vegetable filling. Unlike the meat filling, the vegetable filling must be cooked before it's tucked inside each momo. [3] X Research source Heat a tablespoon of oil in a large pan over medium heat. Add your chopped garlic to the pan and sauté for 2-3 seconds. Then add the chopped onions and sauté for 10-15 seconds. Add the remaining chopped vegetables to the pan and turn the heat up to high. Stir fry the vegetables until they’re cooked all the way through, which should take about 8-9 minutes. Add about 2 tablespoons of the scallions and cook for a minute more. Taste the filling to see if it’s seasoned to your liking. If not, add more soy sauce, salt or pepper to taste."
    },
    {
      "title": "Set the filling aside until you’re ready to use it.",
      "content": "Set the filling aside until you’re ready to use it. Refrigerate your filling until you’re ready to place it inside the dough. It’s best if you allow it to rest for at least an hour. This will give the flavors time to become fully absorbed by the ingredients."
    },
    {
      "title": "Prep your ingredients.",
      "content": "Prep your ingredients. Momos are usually served with a spicy tomato sauce. If you’d like to enjoy your momos the traditional way, wash and/or peel your fresh ingredients."
    },
    {
      "title": "Roast the tomatoes, bell pepper and chilies.",
      "content": "Roast the tomatoes, bell pepper and chilies. This can be done by either putting them over an open flame or by cutting them in half and putting them under a broiler until the skin blackens and splits. If using your broiler, make sure the top rack of your oven is about three to four inches away from the heat source. Set your oven to broil and on the highest setting. Place the vegetables on a non-stick surface, in either a flat baking dish or on a cookie sheet. Once in the oven, watch them closely as they broil. If you don’t cut them half, you’ll have to turn them as the skin blackens. Once the skin blackens and splits on all sides, they’re done. Take them out of the oven carefully. Let them cool a bit, and then peel away the blackened skin."
    },
    {
      "title": "Place all the sauce ingredients in a blender until they are smooth.",
      "content": "Place all the sauce ingredients in a blender until they are smooth. It should turn into the consistency of a paste. If the sauce is too thick, add water to thin it out to your desired consistency."
    },
    {
      "title": "Refrigerate the sauce until your momos are ready to be served.",
      "content": "Refrigerate the sauce until your momos are ready to be served. Pour the finished sauce into a bowl or container, and let sit in the refrigerator until you're ready to serve your momos."
    },
    {
      "title": "Prepare to roll pieces of dough into flat circles.",
      "content": "Prepare to roll pieces of dough into flat circles. The technique used by most Tibetans to shape momos requires a bit of technical skill to make sure it’s done correctly. If you’re not as skilled in the kitchen, or if this is your first time making momos and you’d like to ensure it’s done correctly, there is an alternate method you can use to shape your momos. [4] X Research source Before getting started, lightly dust a board or clean area of your counter with flour."
    },
    {
      "title": "Mold the dough into flat circles using the technique commonly used by Tibetans.",
      "content": "Mold the dough into flat circles using the technique commonly used by Tibetans. First, divide your dough into four equal sections. The number of sections you divide your dough into will depend on how much flour you used to create the dough. These instructions are based on the use of two cups of flour to create the dough. If only one cup of flour is used, then divide the dough into two equally sized sections. If four cups of dough are used, then slice the dough into eight equal sections. Roll each section into a 6-7 inch log, and then cut the log into equally sized slices. Roll the slices into balls and cover them with a damp napkin or cloth until you’re ready to use them. Using a rolling pin, roll each ball into a thin circle. Its diameter should be about 2-3 inches. Make sure the center of the circle is thick, and its edges thin. You may have to press along the edges of the circles a bit to make them thinner than the center."
    },
    {
      "title": "Create flattened circles of dough using a simpler and quicker method.",
      "content": "Create flattened circles of dough using a simpler and quicker method. Place your dough onto a surface lightly dusted with flour. Use a rolling pin to roll it out very thinly. Don’t roll it so thin that you can see through it or that it tears apart very easily. Then use a clean glass that’s about the width of your palm to cut circles out of the dough."
    },
    {
      "title": "Place the filling in the center of each circle and then fold and shape the dough.",
      "content": "Place the filling in the center of each circle and then fold and shape the dough. It’s best to shape each momo as you fill it with the mixture, that way you can place it in a moist environment with a non-stick surface in order to keep it from drying out before cooking. You can make momos into many different shapes, but the most common are the round and half-moon shapes. Take your filling out of the fridge. If you rolled your dough by hand, then you’ll need to place 1-2 teaspoons of filling inside each circle. If you created your circles using the glass method, then use 1 tablespoon of filling."
    },
    {
      "title": "Make a round momo.",
      "content": "Make a round momo. Start by putting one of the flattened circles of dough in your less-dominant hand. This means that if you’re right-handed, the dough will go in your left hand; and if you’re left-handed, then hold the piece of dough in your right hand. Add the filling to the center of the dough, and then use your thumb and forefinger to pinch together a small piece of the dough’s edge into a fold. Without moving your thumb, gather another piece of the dough’s edge with your forefinger, fold it, and then pull it into your first fold. Work your way around the entire circle of dough, gathering and pinching the folds together until you’re back where you started. Pinch together the folds to close the hole at the top of the momo. Repeat the same steps to make round momo with the rest of the circles of dough. When you finish shaping each momo, place on a non-stick surface, like a lightly greased steamer or container, and cover with a lid or a damp cloth."
    },
    {
      "title": "Make a half-moon momo.",
      "content": "Make a half-moon momo. Start off by putting your filling in the center of the dough. Then fold the circle in half, covering the filling. Press the edges of the circle together to close the dough. If you want to add a design to your momos, you can pinch and fold the edges of the dough, just like the round momo. Repeat the same steps to create half-moon momos out of the remaining circles of dough. As you go along, place each shaped momo in a lightly greased steamer or container and then cover with a lid or damp cloth."
    },
    {
      "title": "Decide how you’d like to cook your momos.",
      "content": "Decide how you’d like to cook your momos. While steaming is the most common method used to cook momos, there are other ways to cook them. You can pan fry or deep fry them, or boil and serve them in a soup called mothuk."
    },
    {
      "title": "Steam your momos.",
      "content": "Steam your momos. Fill your steamer pot with enough water to boil for several minutes. Set it over high heat. There is too much water in the pot if your steamer basket becomes submerged under the water once you set it in the pot. If you’ve used your steamer basket to keep your momos moist while shaping them, then you should be ready to go. If not, make sure to lightly grease your steamer basket with vegetable oil before setting your momos inside. This will keep them from sticking. Set the steamer basket over the boiling water and cover. Allow the momos to steam until they are done. The time it takes for them to cook will vary depending on the size of your momos. If you rolled your dough into balls by hand, your momos will likely be smaller than if you created your flat circles using a glass cup. For the smaller momos, let them steam for 5-6 minutes. For the larger momos, let them steam for closer to 10 minutes. Check the larger momos around 6 minutes to ensure they still need to cook for longer. Momos that are fully cooked will look transparent and will not feel sticky. Remove them from the steamer pan and sprinkle with the remaining scallions."
    },
    {
      "title": "Pan fry your momos.",
      "content": "Pan fry your momos. Heat a frying pan over medium-high heat. Lightly coat the bottom of the pan with vegetable oil. Carefully place each momo in the pan so that they do not touch each other or the sides of the pan. Fry each until golden brown on both sides."
    },
    {
      "title": "Deep fry your momos.",
      "content": "Deep fry your momos. You can use a deep pan to fry your momos, but they cook best in a deep fryer. [5] X Research source Fill your pan or deep fryer with a generous amount of oil, and allow it to get hot. Check to see if the oil is hot enough by dropping a piece of dough into the oil. If it bubbles, you can now add your momos to the oil to cook. Allow the momos to fry for a few minutes on each side. Take them out of the oil when they’re done and set them on a paper towel to let the excess oil drain off."
    },
    {
      "title": "Serve your momos while they’re still hot.",
      "content": "Serve your momos while they’re still hot. Momos are best served immediately and with a spicy sauce. The sauce can either be poured over the momo or served on the side for dunking."
    }
  ]
}