{
  "url": "https://www.wikihow.com/Keep-Bees-Away-from-Your-House",
  "title": "How to Keep Bees Away from Your House",
  "steps": [
    {
      "title": "Use metal screening to block off small and large holes in your home’s exterior.",
      "content": "Use metal screening to block off small and large holes in your home’s exterior. Take a lap around your house, focusing specifically on the siding and foundation. Check to see if there are any obvious holes or chips in the structure. If you see any openings larger than the size of a coin, cover them with metal screening. If you secure all possible entrance points for bees, they won’t be able to enter your home. [1] X Research source If a nest has already formed, don’t screen away the area. Instead, contact your local beekeeper to see if there’s a way to safely relocate the insects."
    },
    {
      "title": "Caulk",
      "content": "Caulk any gaps around the foundation and siding. Don’t give bees the opportunity to slip through cracks around your home. Instead, fill in any loose or open areas where a bee could burrow and create a nest. Unlike screening, you can use caulk in a more versatile way, and fill in any kind of hole in the wall. [3] X Research source You can purchase caulk at your local hardware or home improvement store."
    },
    {
      "title": "Toss out any abandoned appliances and items from your yard.",
      "content": "Toss out any abandoned appliances and items from your yard. Take any old appliances or other large pieces of junk directly to the dumpster. While it’s a little less convenient, you’ll be denying bees of their prime real estate. As soon as you plan on getting rid of a large, roomy item with space for a potential bee nest or hive, take the item to a junkyard. [4] X Research source Any large item with empty space can fit a bee’s nest, like a piece of furniture. See if there are ways for you to safely recycle your old appliances instead of throwing them out. If needed, contact the manufacturer for extra assistance."
    },
    {
      "title": "Get rid of any piles of brush or leaves lying in your yard.",
      "content": "Get rid of any piles of brush or leaves lying in your yard. Take a lap around your yard, scouring the area for excessive amounts of leaves, twigs, or other brush. If you see these items piling up, use a rake and several trash bags to remove the extra junk from your yard. Instead, compost any old leaves and take the other pieces of natural rubbish to a junkyard. [5] X Research source If there’s a forest near your home, consider moving the dead leaves and branches in there."
    },
    {
      "title": "Don’t plant large flower gardens right next to your home.",
      "content": "Don’t plant large flower gardens right next to your home. Keep bees away from your home by keeping your flower or vegetable garden several yards or meters away from your home. While gardening is a fun hobby, try to conduct it a safe distance away from your house. If you have any potted plants, move them so they’re not directly next to your door or any other point of entry. [6] X Research source Let your garden be the main focus of your yard. If they’re distracted and away from your house, then they might not be as tempted to nest there."
    },
    {
      "title": "Call a beekeeper if you notice any swarms or nests.",
      "content": "Call a beekeeper if you notice any swarms or nests. Check for any suspicious holes or foreign structures developing along the sides of your home. If you have a deck a patio, examine above and beneath these structures to see if a colony of bees has burrowed anywhere. If you notice an obvious nest, don’t try to approach it; instead, just take note of where it is and call your local beekeeper to help relocate the bees. [7] X Research source Try counting the number of bees you see in a single area. This way, you can decide if you’re dealing with a large or small swarm. [8] X Research source"
    },
    {
      "title": "Don’t use floral patterned furniture on your deck or patio.",
      "content": "Don’t use floral patterned furniture on your deck or patio. Choose neutral, light colors when you select cushioned outdoor seating for your home. While you don’t need to let the bees determine your decor, you can save yourself some unwanted facetime with these insects by opting for boring, uninteresting colors. If you select a more neutral palette for your furniture, bees won’t be as interested in swarming around you and your home whenever you spend some time outside. [9] X Research source If bees see you in a bright color, they might assume that you’re a flower."
    },
    {
      "title": "Place peppermint plants around your home.",
      "content": "Place peppermint plants around your home. Force bees out of certain areas by filling the air with a scent they dislike. Purchase individual peppermint plants at a nursery or gardening store, then set each plant around the border of your home, or other areas where birds like to frequent. [10] X Research source If you don’t have peppermint plants on hand, try spritzing peppermint oil around your home to give off a potent scent. If you don’t have any peppermint plants or essential oils, cinnamon can also work as a deterrent."
    },
    {
      "title": "Set bowls of crushed garlic near points of entry around your home.",
      "content": "Set bowls of crushed garlic near points of entry around your home. Keep both bees at bay by coarsely chopping or crushing up some garlic cloves. Set these cloves in a small bowl, then place the bowls in strategic spots around your home. Try not to place these in your garden, as you want bees to pollinate your flowers and plants. [11] X Research source Your deck and patio doors are great places to put this deterrent. Keep an eye on the garlic over several days to see if it’s keeping the bees away."
    },
    {
      "title": "Spread all-natural baby powder around your deck and patio.",
      "content": "Spread all-natural baby powder around your deck and patio. Sprinkle an organic version of this powder over railings and near your potted flowers and plants. Don’t overdo it—instead, focus on areas where you see bees a lot, like your deck or patio entrance. Start adding a little powder to your outdoor surfaces, and see if the bees seem to be bothered at all. [12] X Research source Organic baby powder will be specially labeled at the store."
    },
    {
      "title": "Leave prepared food inside of your home.",
      "content": "Leave prepared food inside of your home. Whether you’re hosting a big party or a small get-together, try not to leave your appetizers and main dishes out on the deck or patio table for long periods at a time. Aside from keeping the food fresh, you can lower the temptation of local bees by moving the food to your kitchen or dining room, and away from the outdoors. [13] X Research source If your guests don’t mind, try decorating the outdoor eating area crushed garlic and/or peppermint plants."
    },
    {
      "title": "Set cucumber peels on your window sills to ward off bees.",
      "content": "Set cucumber peels on your window sills to ward off bees. Take a cucumber and peel away the skin. Set these peels along your window ledge, focusing on the windows that you open up most often around your home. Over the following days, keep an eye on these areas to see if you notice a difference in bee activity. [14] X Research source You can also place cucumber peels in localized areas, like sections of your garden. Replace the peels after a couple of days so they don’t get moldy."
    }
  ]
}