{
  "url": "https://www.wikihow.com/Make-a-Greeting-Card-Envelope",
  "title": "How to Make a Greeting Card Envelope",
  "steps": [
    {
      "title": "Lay your card",
      "content": "Lay your card on a piece of 8 1/2 x 11 paper. Center it horizontally on the paper but a little low. [1] X Research source If you don't have a card already, just mark the paper where you want your card to be."
    },
    {
      "title": "Fold the sides of the paper",
      "content": "Fold the sides of the paper inwards. Leave a little room so the envelope will be a little larger than the card. [2] X Research source Press firmly on the edge of each fold so it lays down flat. [3] X Research source"
    },
    {
      "title": "Do the same with the top",
      "content": "Do the same with the top and the bottom (remembering to leave a little wiggle room)."
    },
    {
      "title": "Now flatten out the paper and remove the card.",
      "content": "Now flatten out the paper and remove the card."
    },
    {
      "title": "Snip off the corners.",
      "content": "Snip off the corners. Make a cut slightly larger than 90 degrees. [4] X Research source One corner snipped off."
    },
    {
      "title": "Do this for all four corners.",
      "content": "Do this for all four corners."
    },
    {
      "title": "Check that the card will fit inside just nicely (always best to check this before you glue).",
      "content": "Check that the card will fit inside just nicely (always best to check this before you glue)."
    },
    {
      "title": "Put just a little dab of glue",
      "content": "Put just a little dab of glue at the bottom of each side piece. Then fold the bottom up and press down (this glues the bottom piece on to the sides)."
    },
    {
      "title": "Measure and cut a new piece of paper",
      "content": "Measure and cut a new piece of paper slightly smaller than your envelope. This will be the back piece."
    },
    {
      "title": "Glue carefully along the sides and bottom of the envelope,",
      "content": "Glue carefully along the sides and bottom of the envelope, then place the back piece on and press down gently."
    },
    {
      "title": "There you have it",
      "content": "There you have it - the finished envelope! Put the card inside, then glue the top of the envelope closed."
    }
  ]
}