{
  "url": "https://www.wikihow.com/Make-a-Temporary-Tattoo-Last-Longer",
  "title": "How to Make a Temporary Tattoo Last Longer",
  "steps": [
    {
      "title": "Cleanse the spot you plan to tattoo.",
      "content": "Cleanse the spot you plan to tattoo. Lotions, makeup, and the natural oils of your skin can all shorten the life of your tattoo. They can create a barrier between the ink and your skin, so the tattoo won't actually stick or be absorbed, and it will come off when the lotion comes off. Oils break down the inks in decal tattoos (baby oil is often used to wipe the tattoo off your skin), so if oil is already present, it will begin dissolving your tattoo right away. Make sure you dry your skin before applying the tattoo."
    },
    {
      "title": "Exfoliate the area before the temporary tattoo is applied.",
      "content": "Exfoliate the area before the temporary tattoo is applied. Usually the very top layer of your skin is actually dead skin cells that we shed or scrub off. If you apply the tattoo directly onto this layer of skin, it's more likely to flake off as you shed the dead cells. Exfoliation removes this layer, giving you smooth, live skin to work with. Exfoliate using a loofah or pumice stone and avoid techniques that will leave your skin oily, like salt or sugar rubs."
    },
    {
      "title": "Choose an area where the skin won't constantly be moving or flexing or coming into contact with oils and other substances.",
      "content": "Choose an area where the skin won't constantly be moving or flexing or coming into contact with oils and other substances. The skin on your hands and feet are constantly stretching and moving, which can cause your tattoo to crack or fade quickly. Your hands also come in contact with lots of different substances throughout the day, from oily foods to art supplies to plain old soap and water. This constant contact may cause your tattoo to fade prematurely. The exception is with a henna tattoo, which actually works best on your hands and feet, because the skin is thicker. The more layers of skin, the more layers the ink can stain. Avoid areas that quickly become sweaty or oily naturally, like your temples, or your feet when you wear socks and shoes. Avoid areas that will rub against your clothes."
    },
    {
      "title": "Shave the area before the temporary tattoo is applied.",
      "content": "Shave the area before the temporary tattoo is applied. Hair might get in the way of the ink, so if there's a lot of hair in the area where you plan to put your tattoo, shave first. If you are applying to an area you shave regularly, like your legs or neck, the act of shaving may remove your tattoo faster. Shaving before application may allow you to go longer without shaving once the tattoo is applied. Make sure you use a new, sharp razor if you are going to shave over your tattoo. A dull or nicked razor can cause your tattoo to flake."
    },
    {
      "title": "Wash the areas around the tattoo, not the tattoo itself.",
      "content": "Wash the areas around the tattoo, not the tattoo itself. Many temporary tattoos are advertised as being waterproof, but the addition of soap may affect your tattoo. [1] X Research source Plus, if you are scrubbing your skin clean, the friction will start to tear the ink from your skin. It's ok to swim or shower with a waterproof temporary tattoo, just try not to soak it in a bath or allow it to come into contact with soap, body wash, or oils."
    },
    {
      "title": "Cover your tattoo with petroleum jelly, which can act as a sealant.",
      "content": "Cover your tattoo with petroleum jelly, which can act as a sealant. Though most people consider petroleum jelly a moisturizer, it actually works by sealing the moisture into your skin, almost like a piece of plastic. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Clear nail polish will have the same sealing effect as the petroleum jelly, but it won't be as messy, since it will dry on your skin. There is a downside to clear nail polish as it will start to flake and the tattoo will come with it."
    },
    {
      "title": "Use baby powder, corn starch, or talcum powder on the tattoo.",
      "content": "Use baby powder, corn starch, or talcum powder on the tattoo. These substances are all highly absorbent, and can soak up the natural oils on your skin that would start to break down the ink in your tattoo. Be careful not to inhale these powders, as they can be harmful to your lungs."
    },
    {
      "title": "Go over your tattoo with a permanent marker when it begins to fade.",
      "content": "Go over your tattoo with a permanent marker when it begins to fade. If the tattoo is simple and a single color, a thin or sharp-tipped permanent marker can be used to give the tattoo new life. Trace over the tattoo design with a marker of the same color and fill in with ink. It won't last longer than a day or two at most."
    },
    {
      "title": "Take a break from working out.",
      "content": "Take a break from working out. The excessive sweat and movement of your skin can cause the tattoo to fade faster, especially if it is rubbing against your work-out clothes."
    },
    {
      "title": "Keep the henna paste wet as long as possible.",
      "content": "Keep the henna paste wet as long as possible. Spritzing the paste with a solution of lemon juice and sugar (which you can make at home or may be provided by a henna artist) will seal the paste on your skin and also keep it wet. As long as the paste is moist, it will continue to dye your skin and you can get a rich, dark color that will last longer. [3] X Research source The henna will continue to work up to 12 hours after application if you keep it wet. [4] X Research source Don't oversaturate the paste with spray--you don't want it so wet that the paste begins to slide or spread on your skin, blurring your design. Make your own spray by dissolving 1 1/2 tsp sugar in 3 tsp lemon juice. Gently heat the mixture in a sauce pan if the sugar doesn't dissolve after about a minute of stirring."
    },
    {
      "title": "Warm your skin while the henna paste is drying.",
      "content": "Warm your skin while the henna paste is drying. Holding your hand or feet over a heater, stove, or fire will heat your skin and keep the henna paste moist. You can even use a heating pad--just be sure you don't accidentally rub off the design. Keep the area warm, but not hot--sweating too much might cause the paste to smudge."
    },
    {
      "title": "Never use \"black henna,\" though it may promise to make your tattoo last longer.",
      "content": "Never use \"black henna,\" though it may promise to make your tattoo last longer. Black henna is not henna, which is derived from plants. Black or blue henna is actually a chemical called PPD, which is only approved for use in hair dye and can be harmful to your skin. It is even banned in some countries, because it is unsafe and can cause rashes, allergic reactions, swelling, and other complications. Some black hennas may not have any actual henna in them at all and consist only of the harsh PPD."
    },
    {
      "title": "Avoid water for 24 hours after removing henna.",
      "content": "Avoid water for 24 hours after removing henna. Applying a coat of petroleum jelly can help create a seal over the tattoo and repel water. Water can cause the skin to dry out, which will increase the shedding of dead and dry skin. When you remove the henna, scrape if off the skin without using water. Apply oil on the skin after the henna is scraped off."
    }
  ]
}