{
  "url": "https://www.wikihow.com/Kill-Ryegrass",
  "title": "How to Kill Ryegrass",
  "steps": [
    {
      "title": "Spray your ryegrass between April 15 and May 1.",
      "content": "Spray your ryegrass between April 15 and May 1. Generally, you'll have ideal temperatures and soil conditions for herbicide application during this time. But ultimately, it hinges on your region. [1] X Research source In locations like Indiana, it can be difficult to get into fields in early May because of soil saturation. In this case, conduct the application in February or March. Daylight temperatures should by a minimum of 55 °F (13 °C), ideally 60 °F (16 °C). Night temperatures should be above 40 °F (4 °C) the 3 days prior to application. Soil temperatures should always be above 45 °F (7 °C). Herbicides work well for perennial ryegrass."
    },
    {
      "title": "Apply herbicides before ryegrass grows to 8 inches (20 cm) in height.",
      "content": "Apply herbicides before ryegrass grows to 8 inches (20 cm) in height. Spraying them after this time during seedhead emergence will decrease effectiveness. If you want to kill ryegrass that is over 8 inches (20 cm) in height, you'll have to use other methods like mowing and digging. However, you shouldn't mow the lawn for 2 to 3 days prior to spraying—it will decrease the amount of spray your ryegrass absorbs. There are no herbicides that are effective for ryegrass after seedhead emergence. [2] X Research source"
    },
    {
      "title": "Use an herbicide that includes glyphosate if you want a prepared mix.",
      "content": "Use an herbicide that includes glyphosate if you want a prepared mix. Research suggests that you should use at least 1.25 pounds (20.0 oz) ae per acre of glyphosate for killing annual ryegrass. If you're applying herbicides outside of the ideal application window, use 2.25 pounds (36.0 oz) ae per acre of glyphosate. [3] X Research source Please note: The WHO considers glyphosate to be a probable human carcinogen. Its use is prohibited in some states and countries. Please check with your local laws and use caution if handling this chemical. Labels on herbicide containers often use \"a.i.\" or \"a.e\" as units of measurement for the herbicide's \"active ingredient\" or \"acid equivalent, respectively. [4] X Research source A mixture of 1 ounce (0.063 lb) per acre of herbicide with 700 g/kg saflufenacil with 1.25 pounds (20.0 oz) per acre of glyphosate is the most consistently effective way of controlling ryegrass across any application window. Adding 2,4-D and dicamba to your mix does not improve efficacy of glyphosate alone. The addition of a PS-II inhibiting herbicide (atrazine and metribuzin) can interfere with glyphosate and stop your herbicide mix from working. Effective lyphosate-free herbicide mixes should use paraquat in addition to metribuzin and either 2,4-D or dicamba. However, this combination is only suggested for ryegrass less than 6 inches (15 cm) tall. [5] X Research source Make sure the herbicide mix is compatible with your herbicide sprayer. If you're purchasing a branded mix, check that it is listed on your sprayer's label or supported by the manufacturer. [6] X Research source"
    },
    {
      "title": "Purchase herbicide mix components if you're making your own.",
      "content": "Purchase herbicide mix components if you're making your own. These include wettable powders and water dispersible granules, liquid flowables and suspensions, emulsifiable concentrate (ECs) formulations, and surfactants/solutions. Wettable powders are solid pesticide formulations dispersed in water. Water dispersible granules are applied after disintegration and dispersal in water and have a longer dispersal time than wettable powders. Emulsifiable concentrates are pesticide solutions containing emulsifying agents mixed with a water insoluble organic solvent. Surfactants are compounds that decrease tension between two liquids, a gas and a liquid, or a liquid and a solid. In order to ensure that you add your products in the right order, follow the WALES acronym, which stands for Wettable powders and water dispersible granules; Agitate; Liquid flowables and suspensions; Emulsifiable concentrate (ECs) formulations; and Surfactants/solutions. [7] X Research source Glyphosate should be added after the emulsifiable concentrate formulations and before surfactants/solutions."
    },
    {
      "title": "Fill the sprayer tank half-full with water, then add the mix.",
      "content": "Fill the sprayer tank half-full with water, then add the mix. If you have a pre-purchased mix, fill the sprayer the rest of the way with the mix. If you're creating your own mix, any water conditioners, buffering agents, or defoamers you may need. Water conditioners increase the efficacy of glyphosate and glufosinate in herbicide spray systems. [8] X Research source Buffering agents facilitate herbicide activity, or facilitate or modify characteristics of herbicide formulation. [9] X Research source Defoamers prevent excessive foaming activity in the spray tank."
    },
    {
      "title": "Spray your herbicide mix on your ryegrass using your sprayer.",
      "content": "Spray your herbicide mix on your ryegrass using your sprayer. Apply your herbicide using an application volume of 10 gallons (38 L) per acre. Avoid spraying in temperatures above 80 °F (27 °C). [10] X Research source Use a medium spray droplet size and moderate spray pressure. Use standard or XR flat fan nozzles. Avoid flood jet or air induction nozzles. Spray volumes lower than 7 gpa and above 15 gpa can reduce the effectiveness of glyphosate."
    },
    {
      "title": "Conduct a second application in the following fall.",
      "content": "Conduct a second application in the following fall. This can be done if the first application did not kill all of the grass. This is especially important for plants that were sprayed when over 6 inches (15 cm) tall. [11] X Research source Air temperatures should be 45 °F (7 °C) or more for at least 3 to 5 days. [12] X Research source"
    },
    {
      "title": "Find the patches of ryegrass that you want to kill.",
      "content": "Find the patches of ryegrass that you want to kill. The surface of ryegrass reflects light better than other types of grass, giving it a distinctive shine that sets it apart from other grasses. Mowing is most effective for annual ryegrass. It also has reddish-colored seedheads. [13] X Research source Annual ryegrass looks similar to perennial, but it is typically used for interseeding dormant lawns during warm seasons. They may not last well into winter."
    },
    {
      "title": "Sprinkle white chalk powder on your ryegrass locations.",
      "content": "Sprinkle white chalk powder on your ryegrass locations. Marking ryegrass with chalk will help you easily find dead patches. This is especially important for bigger lawns. You can also use it to mark regions that you've cleared so you can check back on them to catch new growth."
    },
    {
      "title": "Use your mower to cut your grass to 1.5 to 2 inches (3.8 to 5.1 cm).",
      "content": "Use your mower to cut your grass to 1.5 to 2 inches (3.8 to 5.1 cm). While it's hard to completely kill ryegrass using a mower, cutting it to his length sets the stage for the next steps. In fact, just mowing the ryegrass won't kill it, although it can help manage the growth. Mow the lawn as soon as seed heads appear. If you keep doing this, the grass will die off before sprouting new grass."
    },
    {
      "title": "Stop watering your ryegrass for the 2 weeks after mowing.",
      "content": "Stop watering your ryegrass for the 2 weeks after mowing. Ryegrass relies heavily on water to survive. Refrain from watering them to promote cell death. This is especially effective during the hot summer months."
    },
    {
      "title": "Cover the mowed regions with a plastic sheet.",
      "content": "Cover the mowed regions with a plastic sheet. This will prevent accelerate ryegrass death by reducing chemical absorptions. Plastic sheets decrease plant absorption of atmospheric carbon dioxide, oxygen, and nitrogen, which are necessary for photosynthesis, respiration, and growth, respectively."
    },
    {
      "title": "Use a thatch rake to remove dead grass from your lawn.",
      "content": "Use a thatch rake to remove dead grass from your lawn. Over the the course of 2 weeks, regularly remove the plastic cover and drag the rake across your lawn to remove remnants of dead grass. If you notice ryegrass growing back after 2 weeks, you might need to treat your land with herbicides."
    },
    {
      "title": "Locate the ryegrass you want to remove.",
      "content": "Locate the ryegrass you want to remove. Ryegrass is characterized by glossy leaves and clumpy flowers. And given the reflective ability of its surface, it has a distinctive shine that separates it from other types of grass. They also possess reddish-colored seedheads."
    },
    {
      "title": "Sprinkle white chalk powder on ryegrass to identify it.",
      "content": "Sprinkle white chalk powder on ryegrass to identify it. Using chalk as a marker makes it easier to keep track of all the rye glass that needs removing. It can also be used to track new growth. You can also use your chalk to mark regions of removed ryegrass to track any new growth."
    },
    {
      "title": "Use your spade to dig 2 inches (5.1 cm) around the marked area.",
      "content": "Use your spade to dig 2 inches (5.1 cm) around the marked area. Although ryegrass roots can reach up to 20 inches (51 cm) deep, digging at this depth should sufficiently disrupt the root system. [14] X Research source If you're having trouble digging, pour water onto the soil to soften it."
    },
    {
      "title": "Cover your ryegrass regions with a landscaping fabric.",
      "content": "Cover your ryegrass regions with a landscaping fabric. This will prevent it from getting sunlight and prevent growth of ryegrass seeds in the soil. You can also use herbicide-infused fabric. Place heavy rocks or bricks onto the edges of the fabric to ensure that it is held down The best time to place herbicide-infused fabric is the summer."
    },
    {
      "title": "Remove the fabric after 14 days and dig up the dead grass.",
      "content": "Remove the fabric after 14 days and dig up the dead grass. After removing your fabric, drag a thatch rake over the area to aerate it prior to planting any seeds. Use the same motion as you would with a standard rake, allowing the spokes to dig into the thatch. Pull it upwards to loosen and lift the thatch from your lawn. Keep an eye out for remaining seeds. Ryegrass seeds can germinate in 3 days. [15] X Research source Remove all seeds that you find from the area."
    }
  ]
}