{
  "url": "https://www.wikihow.com/Learn",
  "title": "How to Learn",
  "steps": [
    {
      "title": "Figure out which study method works best for you.",
      "content": "Figure out which study method works best for you. This varies from person to person, and you can take a quiz to find out if you wish. It's important to know, as how you study, learn, and take notes will all vary on this. There are four main learning styles. You don't have to choose one; you can mix it up. [2] X Research source Visual: For this style, you learn mainly by looking at pictures, such as graphs, diagrams, and charts. Auditory: Learners who learn with this style learn the best when they hear the information and say it. Writing/Reading: Learners who use this method learn best when material is presented to them in a slides and handouts format. Kinesthetic: This is a more hands-on method. For example, for science, learners who use this method may want to try some science related experiments."
    },
    {
      "title": "Break down what you’re learning into manageable chunks.",
      "content": "Break down what you’re learning into manageable chunks. If you try to absorb everything there is to know about a topic all at once, you’ll soon find yourself overwhelmed. Whether you’re reading a chapter in a history textbook or trying to learn how to play the piano, focus on one piece of information at a time before moving on to the next. Once you’ve mastered each piece, you can work on putting them together into a coherent whole. [3] X Research source For example, if you’re reading a chapter in a textbook, you might start by doing a quick skim of the whole chapter or even just scanning the chapter headings to get a sense of the content. Then, do a close reading of each paragraph and try to identify the key concepts."
    },
    {
      "title": "Take notes",
      "content": "Take notes while you learn. Taking notes can help you engage more fully with the material you are learning, making it easier for your brain to understand and absorb it. If you are listening to a lecture or an explanation of a topic, jot down the key points as you listen. If you’re reading, write down key words, summarize important concepts, and make note of any questions you have about the material. [4] X Research source Studies show that taking handwritten notes is more effective for most people than typing your notes on a computer. When you write your notes by hand, you’re more likely to focus on the important points rather than trying to write down everything you hear or see. If you like to doodle when you take notes, go for it! It may actually help you focus on what you’re hearing."
    },
    {
      "title": "Summarize information you have just learned.",
      "content": "Summarize information you have just learned. Summarizing is a good way to test your knowledge and help clarify your understanding of a subject. After learning something new, whether you heard it in a lecture or read about it in a book, take a moment to write a brief paragraph or a few bullet points summing up the key points. You can also try summarizing the information verbally. If you’re working with a teacher, they can give you direct feedback based on your summary to help you determine whether you understand the concept correctly. For example, you could say, “So, to find the area of a rectangle, I multiply the length by the width. Is that correct?”"
    },
    {
      "title": "Keep your learning sessions brief and frequent.",
      "content": "Keep your learning sessions brief and frequent. Instead of spending hours of your time studying a single subject each day, spread it out into multiple sessions of 30-60 minutes each day over the course of a few days or weeks. This can help prevent you from getting burnt out, and will also ultimately help you retain the information better. [5] X Research source Spacing out your study sessions can also help you overcome procrastination . If you devote a little time to a particular task or subject each day, it will feel less overwhelming in the long run, so you’ll be less tempted to put it off."
    },
    {
      "title": "Use multiple learning modes.",
      "content": "Use multiple learning modes. [6] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Most people learn best if they combine different techniques, or modes of learning. If you can, combine different learning approaches that tap into all your senses. For example: If you’re taking a lecture course, try taking notes by hand and also recording the lecture so you can play it back while you study. Reinforce your knowledge by doing the appropriate readings and using any available visual aids (such as graphs or illustrations). If possible, try to actively apply the knowledge you’ve learned, as well. For example, if you’re learning to read ancient Greek, try translating a short passage on your own."
    },
    {
      "title": "Discuss what you are learning with other people.",
      "content": "Discuss what you are learning with other people. Talking about what you’re learning can help you gain new perspectives or make connections that might not be obvious just from reading or studying on your own. In addition to asking your teacher or fellow students questions, share your own perspective and understanding of what you’ve learned. [7] X Research source Teaching other people is a great way to solidify your understanding of a subject. It can also help you identify areas where you can improve your knowledge. Try explaining something you’ve learned to a friend, relative, or classmate."
    },
    {
      "title": "Take frequent breaks while you study.",
      "content": "Take frequent breaks while you study. If you find your focus wandering, try breaking your study time up into 25-minute sessions with 5-minute breaks in between. This is called the Pomodoro Technique. Using the Pomodoro method will keep your brain sharp and help you focus more deeply. [8] X Research source During your breaks, don’t focus on what you’re studying. Try meditating or visualizing a relaxing scene instead. Try using an app like Pomodoro Time to help you time your breaks and focus periods."
    },
    {
      "title": "Get 7-9 hours of high-quality sleep each night.",
      "content": "Get 7-9 hours of high-quality sleep each night . Being well-rested can help you stay focused and energized while you study. However, sleep also plays a key role in learning and remembering information. [9] X Research source Go to bed early enough that you can sleep for 7-9 hours (or 8-10 if you’re a teen). You can also get better sleep by: Turning off bright screens at least half an hour before bed. Establishing a relaxing bedtime routine. For example, you might read a chapter of a book, listen to some peaceful music, or take a warm shower. Making sure your bedroom is quiet, dark, and comfortable at night. Avoiding caffeine and other stimulants up to 6 hours before bedtime."
    },
    {
      "title": "Eat brain-boosting foods.",
      "content": "Eat brain-boosting foods. Eating nutritious, energizing foods can help you stay alert and absorb information more effectively. Start the day with a nutritious breakfast, like a boiled egg, a bowl of oatmeal, and some fresh fruit. While you’re studying, snack on brain-friendly foods like blueberries, bananas, or a little omega-3 rich salmon. [10] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Make sure to stay hydrated , too—getting enough water can help you fight fatigue and stay focused."
    },
    {
      "title": "Find a quiet and comfortable study environment.",
      "content": "Find a quiet and comfortable study environment. Studying in a noisy, uncomfortable, or poorly lit area can make it harder to concentrate and absorb what you’re learning. [11] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Different people learn best in different environments, so experiment with studying in a variety of places and see what works for you. [12] X Research source For example, if noise tends to distract you, try working in a quiet study room at the library instead of at a table in a crowded coffee shop. Look for a study area where you can sit and spread out comfortably, but don’t get so comfortable that you fall asleep. You may want to avoid studying on a couch or in bed, for example."
    },
    {
      "title": "Put away your phone and other distractions.",
      "content": "Put away your phone and other distractions. [13] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. It’s easy to get sucked into social media apps and games or to keep checking your email when you should be studying. If your phone or another device is distracting you, try switching it off or putting it somewhere out of reach (like inside your bag or a desk drawer). You can also use productivity apps, like BreakFree or Flipd, that limit your ability to use your device during work or study hours. [14] X Research source Avoid studying where there’s a TV that might distract you. If you find yourself tempted by time-wasting websites on your computer, try installing a browser extension like StayFocusd to help keep you on task."
    },
    {
      "title": "Evaluate what you do and do not know.",
      "content": "Evaluate what you do and do not know. Metacognition, or the ability to recognize what you do and do not know, is an important part of learning. Reflect on the subject or skill you are trying to learn about and ask yourself, “What do I know about this topic? What do I not know or fully understand yet?” Once you’ve identified areas where you still need to improve your knowledge or understanding, you can focus your attention on those areas. [15] X Research source One good way to evaluate your knowledge is to quiz yourself on the material. If you are using a textbook or taking a course that includes self-administered quizzes or knowledge checks, take advantage of them. You could also try writing a brief explanation of the subject. This exercise will highlight the knowledge you already have, but may also help you identify weak areas in your knowledge."
    },
    {
      "title": "Take the VARK inventory to understand your learning style.",
      "content": "Take the VARK inventory to understand your learning style . While most people use a combination of approaches when learning, you may find that you work best as a Visual, Auditory, Reading and writing, or Kinetic learner. Once you understand the learning modes that work best for you, you can adjust your study style accordingly. To identify your primary learning style, try taking the VARK questionnaire, here: https://vark-learn.com/the-vark-questionnaire/?p=questionnaire . Visual learners absorb information best from visual sources, such as maps, graphs, diagrams, and images. If you’re an auditory learner, you may benefit the most from listening to lectures or verbal explanations. Talking out loud about what you’re learning can also be helpful. Reading and writing learners do best when they read information and write about what they are learning. Focus on taking notes and reading about the topic you’re interested in. Kinesthetic learners absorb knowledge most effectively when they actively put what they’re learning into practice. For example, you may learn a language better by speaking it than by reading about it."
    },
    {
      "title": "Identify your learning strengths.",
      "content": "Identify your learning strengths. Learning strengths are similar to learning styles, but they focus more on your specific skills and areas of intelligence. Try taking a test like this Strength Assessment to figure out what your key intelligence strengths are: https://www.literacynet.org/mi/assessment/findyourstrengths.html . You can then adapt your learning methods to your areas of strength. For example, if you score high in body movement intelligence, you may find that you retain and understand information better if you take a walk with a friend and talk to them about what you’re studying. [16] X Research source According to the theory of multiple intelligences, the 8 key areas of intelligence are Linguistic, Logical-mathematical, Spatial, Bodily-Kinesthetic, Musical, Interpersonal, Intrapersonal, and Naturalist. [17] X Research source"
    },
    {
      "title": "Ask questions about what you are learning.",
      "content": "Ask questions about what you are learning. To really engage with what you’re learning, it’s important to do more than just absorb and remember information. As you’re learning, stop and ask yourself questions. Exploring these questions and looking for answers will help you gain a deeper understanding of the material. [18] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. For example, if you’re reading about a historical event, you might ask questions like “Why did this happen? How do we know what happened—what kinds of sources do we have? How might things be different today if this event hadn’t taken place?” If you’re studying a discipline that is new to you (such as biology or law), try writing a list of 25 key questions that your discipline seeks to answer. This can serve as a good foundation for your exploration of the topic. [19] X Research source"
    },
    {
      "title": "Look for connections between concepts.",
      "content": "Look for connections between concepts. When you’re learning about a topic, try not to view it as a series of unconnected pieces of information. Instead, look for ways that ideas and information relate to each other and to your own knowledge and experiences. This will help you put the things you learn in context. [20] X Research source For example, maybe you’re studying how physical anthropologists use skeletal material to understand how people lived in an ancient society. Think about how your own activities might affect what a future anthropologist or archaeologist would see if they discovered you—e.g., would they notice wear and tear on your elbow joints because of your tennis hobby?"
    },
    {
      "title": "Examine sources of information critically.",
      "content": "Examine sources of information critically. Don’t accept everything you hear, see, or read at face value. When you’re learning, consider where the information comes from, how reliable it is, and whether it is current or outdated. For example, you might ask yourself: [21] X Research source “What evidence does this author provide to back up their major arguments?” “Is this information up-to-date?” “What are the sources for this information?” “What are the qualifications of the person presenting this information? Do they have any agendas or biases?” “Are there alternative interpretations of this issue that might also be valid?”"
    },
    {
      "title": "Try to identify key concepts in the material you are studying.",
      "content": "Try to identify key concepts in the material you are studying. Whether you’re looking at a full course in a particular topic or just focusing on an individual lesson, try to pull out a few key themes and concepts. Doing this can help you organize your thoughts and define your focus as you learn and study. [22] X Research source For example, if you’re taking a class on American history, you might find that themes of American identity and diversity come up again and again. Consider how the information you are learning in the class relates to these themes."
    }
  ]
}