{
  "url": "https://www.wikihow.com/Heal-a-Torn-Dog-ACL-Without-Surgery",
  "title": "How to Heal a Torn Dog ACL Without Surgery",
  "steps": [
    {
      "title": "Understand when it is safe to forego surgery.",
      "content": "Understand when it is safe to forego surgery. Both surgical and non-surgical (conservative) methods can be used to manage an ACL tear. A combination of both methods is usually helpful for the dog. However, the type of therapy recommended varies based on body size, body condition, and severity of lameness of your dog. A dog under 20 kilograms may not be a good candidate for surgical procedures."
    },
    {
      "title": "Heal your dog's torn ACL ligament by reducing its body weight.",
      "content": "Heal your dog's torn ACL ligament by reducing its body weight. The ACL is meant to stabilize the leg and provide support during weight bearing activities. High body weight is a risk factor and a leading cause of ACL injury, because of the extra stress placed on the ligament by an overweight body. You can easily accelerate your dog's healing process by reducing the body weight of your dog. Try lowering your dog's body weight with a combination of diet and exercise. To reduce the body weight of your dog, decrease its calorie intake at least 60%. Don't reduce the calorie intake suddenly, but rather feed your dog smaller portions more throughout the whole day. To minimize any digestive upset, try to ease your dog into the new diet gradually. Make sure to monitor the outcome of your weight reducing program regularly. Prevent giving them processed food that may cause infection to the dog's joint, instead feed them with superfoods such as oysters, fish oil, and bone broth. Be sure include regular, but non-vigorous, exercise for your dog. The exercise may include walking or running. In the case of a severe ACL injury with inflammation, exercise should be postponed until after you give your dog some NSAIDs to reduce pain. If your dog has a severely torn ACL, specialized hydrotherapy (walking/swimming in water) is recommended. Please consult with your vet to get an appropriate exercise list based on the clinical condition of your dog. Due to lowered pressure on knee joint, your dog will be able to heal its ligament faster."
    },
    {
      "title": "Attempt to restrict your dog's activity.",
      "content": "Attempt to restrict your dog's activity. Full rest and limited activity will give your dog's body the chance to heal. Lower inflammation due to rest will allow the body to heal itself naturally. Some veterinarians advise you totally restrict the activity of your dog, while others advise some limited exercise. You should not allow your dog to jump up to catch a ball or Frisbee or to jump out of a truck or off a porch. You can practice a short-leash walk with your dog only."
    },
    {
      "title": "Try using a towel sling.",
      "content": "Try using a towel sling. Sometimes, using a towel as a sling under the hip of your dog to support its weight can be helpful to speed up healing. The towel sling is commercially available, or you can make one easily by using a bath towel or recycled children's jacket in your home. For using a bath towel, you should cut a large bath towel in half and apply it under the lower abdomen of your dog. By applying upward pressure, while holding both ends of the towel, you can help your dog walk. Commercially available athletic bandage can also be used for this purpose. If you use a recycled jacket, you should cut the sleeves so that the jacket fits on your dog’s abdomen."
    },
    {
      "title": "Utilize therapeutics.",
      "content": "Utilize therapeutics. Non-steroidal anti-inflammatory medications (NSAIDs) are sometimes helpful to heal the torn ligament. The anti-inflammatory drug will relieve your dog's pain during the observation period. [1] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 19 August 2021. Different groups of NSAIDs are used in ACL treatment. The doses vary depending on pain levels, and your dog's body weight and body condition. Commonly used NSAIDs are oxicam derivatives (Meloxicam). They are used for different types of muscle and skeletal pain. The commonly used doses are: Meloxicam (Trade: Melovet ®-5mg) @ 1ml/25 kg, Firocoxib (Previcox®) @ 2.27mg/lb/day (5mg/kg), Carprofen (Rymadil®) @ 2 mg/lb/day. However, drug availability and legislation may vary in different countries. In general, low doses and short term usage is very safe while higher doses used long term use can cause some side effects. If your dog is suffering from side effects like vomiting, lethargy, depression or diarrhea, stop the drug treatment and consult with a veterinarian."
    },
    {
      "title": "Try rehabilitation therapy.",
      "content": "Try rehabilitation therapy. Rehabilitation therapy by a trained practitioner may speed the healing of the ACL. This option includes a range of motion and mobilization exercises, aquatic walking, cavaletti walking, and controlled slow leash walking. If the condition is improved, you can gradually introduce stair climbing and sit-to-stand exercises. Aquatic walking or swimming will increase the muscle strength of your dog. You may find some veterinary hospitals that have these facilities, including special tanks and whirlpools for hydrotherapy. Some other practices of physiotherapy can be helpful, including cryotherapy, laser therapy and neuromuscular electrical stimulation. [2] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 19 August 2021."
    },
    {
      "title": "Get your dog orthotics.",
      "content": "Get your dog orthotics. An external orthotics or knee brace can be used to support the joint, but there is a limited amount of research done on the effects of this treatment. The purpose of using an orthopedic brace is to support the joint and ligaments by allowing the relaxation of the injured legs. Braces are often made with hard elastic materials and set up in between the femur and tibia to prevent unwanted movement of knee joint. Dogs that are advanced in age or too young for surgery are often the ideal candidates for an orthopedic brace. Braces can provide an alternative when the surgical treatment is not affordable for the owner."
    },
    {
      "title": "Utilize some physical therapy exercises.",
      "content": "Utilize some physical therapy exercises. Once your dog has regained some amount of mobility and strength, you can try a few light exercises to attempt to rehab the ligaments. These exercises should only be tried once they are approved by a veterinarian, or they could hurt your dog further. Evidence suggests that physical therapy by a trained rehabilitation practitioner can advance your dog's recovery from surgery. However, this evidence does not suggest that physical therapy is a reliable alternative to surgery for most dogs. Sit to stand. On a floor with good footing, ask your dog to sit and tuck the knee as close as possible to the body. Then ask your dog to stand as slowly as possible thus causing it to put weight on the affected leg. Do 5 repetitions 3 times daily. Weight shifting. On a floor with good footing, with your dog in a standing position, rock the pelvis so that weight is forced on the affected leg. Start lightly first and increase force as your dog becomes more comfortable. You can actually apply enough force so that your dog takes small sideways steps to each side. Do 10 repetitions 3 times daily. Unilateral weight bearing. Lift the unaffected limb off the ground. Hold for 10 to 15 seconds. Move the foot around and put your dog off balance if he/she tries to lean on your hand. Another way to do it is to tape an object (like a pen) under the uninvolved foot to force full weight on involved side – only do with supervision. Circles and figure eights. While on a leash, get your dog on your left side and then walk in tight circles and figure of 8’s. This encourages weight bearing on both legs and increases strength and balance."
    },
    {
      "title": "Try prolotherapy to regenerate the ligaments.",
      "content": "Try prolotherapy to regenerate the ligaments. Prolotherapy, also known as nonsurgical ligament reconstruction, is a medical treatment for chronic pain. “Prolo” is short for proliferation, because the treatment causes the proliferation (growth, formation) of new tissue in areas where it has become weak. A proliferant (substance that promotes tissue rebuilding) is injected into the affected ligaments or tendons causing a localized inflammation which “turns on” the healing process and directly stimulates the growth of new collagen, strengthening damaged and weak ligaments and tendon tissue. Prolotherapy is primarily used to treat joint pain, and has been shown to increase joint ligament strength by 30-40% in humans. Clinical results using prolotherapy in dogs and cats appear to indicate the same response. As the tendons and ligaments grow stronger, and more capable of supporting and maintaining normal joint stability, the pain is alleviated. Prolotherapy is a possibility to consider when dealing with a partial tear, particularly if your dog is older or could not undergo anesthesia."
    },
    {
      "title": "Look into stem cell regenerative therapy.",
      "content": "Look into stem cell regenerative therapy. Stem cell regenerative therapy is a relatively new treatment. It has been successfully used to treat arthritis and other degenerative conditions in dogs, with very exciting results. However, this therapy does require a minor surgery to harvest the stem cells and anesthesia for both the harvesting and the injection of the stem cells."
    },
    {
      "title": "Know when surgery is necessary.",
      "content": "Know when surgery is necessary. Once a dog is undergoing treatment, most veterinarians recommend a period of 4-5 weeks for observation. After that period, your dog should walk well on its knee, or with a mild limp. If the condition still remains the same, you need to go for a surgical procedure. In most cases, the lightweight dog can recover without surgery, while oftentimes heavy weight dogs can’t. It is important to know that even if the symptoms resolve, there might be a chance of developing secondary complications like arthritis. Arthritis is a non-reversible change in the joint, and delayed or partially healed ACL injury can increase its severity. Moreover, your dog will favor another leg to bear the body weight instead of affected leg. It may (in more than 50% of cases) cause the gradual rupture of another ACL."
    }
  ]
}