{
  "url": "https://www.wikihow.com/Make-a-Scroll",
  "title": "How to Make a Scroll",
  "steps": [
    {
      "title": "Select the paper.",
      "content": "Select the paper. The paper should be longer than a regular sheet of paper.It needs to wrap around enough to look like a scroll. Your paper needs to be thinner than the dowels you use, so you may have to cut some off of the edges. There are many different types of paper that can be used to make a good scroll. [1] X Research source Two sheets of regular white paper taped together end to end Brown paper grocery bag Parchment Paper Rice paper Papyrus paper"
    },
    {
      "title": "Choose the dowels.",
      "content": "Choose the dowels. Dowels are round rods made of wood, metal, or plastic. Scrolls are typically made using wooden dowels. Dowels come in different lengths, so you might have to cut them to the right size for your paper. You want the dowels to be about 1 to 2 inches longer than the paper. The thinner the dowel, the tighter you can wind up your scroll. You can choose the thickness of the dowel you would like to use. ⅜ inch ¼ inch ½ inch 1 inch"
    },
    {
      "title": "Create the artwork.",
      "content": "Create the artwork. Decide what you want the scroll to say or display on the inside. If you don't know what you want it to look like, some ideas are hieroglyphs, chinese characters, or a still life picture. Choose a method to apply your script or artwork to the scroll. Painting Printing Coloring Calligraphy Handwritten or drawn"
    },
    {
      "title": "Assemble the scroll.",
      "content": "Assemble the scroll. You can assemble a scroll using one dowel at the top of the paper or two dowels on the top and bottom of the paper. Use a strong glue to secure the dowels to the edges of the paper. Press firmly and hold for a few seconds to ensure the dowel is adequately attached to the paper. Make sure the glue extends the entire length of the edge of the paper. You can also wrap the paper around the dowel and glue it to itself. If you decide to do this method, make sure you get the paper wrapped extremely tight around the dowel so it doesn't have room to slide around."
    },
    {
      "title": "Embellish the scroll.",
      "content": "Embellish the scroll. Embellishments can make the scroll look authentic and give it that extra flair. There are many ways to embellish your scroll and make it unique. Attach a ribbon to the top for hanging. Add an ornament to the ends of each dowel, like a wooden wheel. This would be easier to do before attaching the paper onto the dowels. Use ribbon, string, or twine to tie the scroll together after rolling."
    },
    {
      "title": "Roll the scroll.",
      "content": "Roll the scroll. There are two different ways of rolling your scroll. If you have a one dowel scroll, roll the paper around the dowel until the entire paper is rolled. Secure the paper with a ribbon, string, or twine by tying it around the scroll. With a two dowel scroll, roll both sides of the paper around the dowels until they meet in the middle. You can also secure this type of scroll with ribbon, string, or twine."
    },
    {
      "title": "Pick the type of fabric to use.",
      "content": "Pick the type of fabric to use. Fabric scrolls are more durable than paper so they are a great option if you want your scroll to last a long time. Different fabrics convey different looks, like antique or modern, so choose one that matches your intent. Light colored fabrics with no prints or patterns work best for scrolls with artwork or script on them. Many fabrics are nice options for scroll making: Muslin Burlap Lightweight canvas Cotton Silk"
    },
    {
      "title": "Get the dowels.",
      "content": "Get the dowels. Choose thickness of the dowels you would like to use. Heavier fabrics should use a thicker dowel, and lighter fabrics can use a thinner one. You may have to cut the dowels to the width you would like your scroll, making sure they are 1 to 2 inches longer than you want the actual fabric of the scroll to be."
    },
    {
      "title": "Cut the fabric to size.",
      "content": "Cut the fabric to size. Determine how wide and long you want your scroll to be. Make sure the fabric is 1 to 2 inches less wide than the dowel size. Use sharp, fabric scissors to get the best cut when cutting your fabric."
    },
    {
      "title": "Attach the dowels to the fabric.",
      "content": "Attach the dowels to the fabric. The best way to attach the dowels to the fabric is by sewing a tight pocket in the fabric for the dowel to slip into. Place your fabric face down. Wrap the top edge of the fabric around one dowel, making sure the fabric extends at least ½ inch beyond the dowel. Use a pencil to draw a light line marking where the edge of the fabric is. Remove the dowel, and sew the edge of the fabric so that it is folded back creating a pocket. Make sure the edge is lined up with the pencil line. Hand sew the fabric for the best results Repeat the steps with the bottom edge of the fabric Slide the dowels into the pockets."
    },
    {
      "title": "Put your design on the fabric.",
      "content": "Put your design on the fabric. The best way to get your design on the fabric is to paint it on with fabric or craft paint. Another option is to silk screen your design onto the fabric. You can also draw the design with permanent markers or even print the design with a printer. [2] X Research source If you decide to print the design on the fabric, make sure you check to see if your printer is able to print on fabric."
    },
    {
      "title": "Make your scroll hangable.",
      "content": "Make your scroll hangable. Attach ribbon, string or twine to the top of your scroll so it can hang on your wall for all to admire. You can attach it by tying the two ends around the part of the top dowel that hangs beyond the fabric. This is an excellent way to attach the ribbon because it also prevents the fabric from slipping off of the dowel. Another way to attach the string is to glue it to the top of the fabric."
    },
    {
      "title": "Decide on making a paper or fabric scroll.",
      "content": "Decide on making a paper or fabric scroll. You can make both a paper and a fabric scroll look old and ancient. The choice depends on what you are doing with the scroll. For example, party invitations would be best as paper scrolls, but hanging art and gifts might be better as fabric scrolls. The process of making the scroll look old should be done prior to assembling the scroll."
    },
    {
      "title": "Put your artwork on the scroll.",
      "content": "Put your artwork on the scroll. Paint, draw, or print your artwork on the scroll. When you make the paper or fabric look old, some colors of your artwork may change. The best artwork color to use is black if you want an authentic antique look."
    },
    {
      "title": "Discolor with coffee or tea.",
      "content": "Discolor with coffee or tea. Use a foam paintbrush to paint brewed black coffee or tea onto the fabric or paper. Coffee will be much darker than tea. [3] X Research source Dip the paintbrush in the coffee or tea and gently squeeze some excess out. Paint the coffee or tea all over. Use different stroke angles and different levels of saturation. Try not to make it uniform. Having some areas darker than others is good for achieving an antiquated look."
    },
    {
      "title": "Finish the look.",
      "content": "Finish the look. A few steps can finish the antique look on your paper or fabric. For paper, after putting the coffee on, you can put the paper in the oven at the lowest setting for about 5 minutes, or until it is dry. You can also carefully burn the edges of the paper by holding a candle up to the edge of the paper and then blowing it out before it burns too far in. Repeat this process around the perimeter of the paper. [4] X Research source For fabric, after the fabric has dried, cut the edges to fray them. This will only work with some types of fabric, like burlap. If you have a fabric that won't fray, try painting extra coffee or tea around parts of the edges to make them darker."
    },
    {
      "title": "Assemble the scroll.",
      "content": "Assemble the scroll. When the fabric or paper is completely dry, you can begin to assemble the scroll. Attach the dowels with glue or by sewing. Add embellishments like a hanging ribbon or wooden ornament on the dowels. Roll the scroll or hang it on the wall."
    }
  ]
}