{
  "url": "https://www.wikihow.com/Make-a-Homemade-Colon-Cleanser",
  "title": "How to Make a Homemade Colon Cleanser",
  "steps": [
    {
      "title": "Pick the right kind.",
      "content": "Pick the right kind. Colon cleansing can take a few forms. You can perform a colonic, also known as colon hydrotherapy. This is done using a small tube inserted into the rectum, through which warm water is gently pumped. You can also take an oral solution to increase excrement output, which are essentially homemade laxatives. [3] X Research source Richards, D. G., McMillin, D. L., Mein, E. A., &amp; Nelson, C. D. (2006). Colonic Irrigations: A Review of the Historical Controversy and the Potential for Adverse Effects. Journal Of Alternative &amp; Complementary Medicine, 12(4), 389-393 [4] X Research source Kelvinson, R. (1995). Colonic hydrotherapy: a review of the available literature. Complementary Therapies In Medicine, 3(2), 88-92 Doing water or salt water enemas at home without a professional assistance is not recommended unless instructed to do so by a doctor. [5] X Research source Alami, N. F., Lim, J. H., Goh, K. S., Png, G. K., &amp; Zhang, D. (2015). Effect of Sodium Phosphate Enemas on Serum Calcium and Phosphate Concentrations in Older Adult Inpatients. Journal Of The American Geriatrics Society, 63(8), 1704-1705 [6] X Research source Cohen, M. R. (2012). Fleet enemas: Don't underestimate the risk. Nursing, 42(12), 12-12 [7] X Research source Biebl, A., Grillenberger, A., &amp; Schmitt, K. (2009). Enema-induced severe hyperphosphatemia in children. European Journal Of Pediatrics. Supplement, 168111-112 Most mainstream physicians do not recommend regular colonics for healthy individuals, though some natural doctors and other healthcare professionals recommend colon cleansing once or twice a year to help release toxins. [8] X Research source Richards, D. G., McMillin, D. L., Mein, E. A., &amp; Nelson, C. D. (2006). Colonic Irrigations: A Review of the Historical 11Controversy and the Potential for Adverse Effects. Journal Of Alternative &amp; Complementary Medicine, 12(4), 389-393 [9] X Research source Kelvinson, R. (1995). Colonic hydrotherapy: a review of the available literature. Complementary Therapies In Medicine, 3(2), 88-92"
    },
    {
      "title": "Avoid dependency.",
      "content": "Avoid dependency. Colon cleanses can be very helpful, but can also become harmful over time. Even natural, homemade colon cleansers can be hurtful to you. Just because something is natural doesn’t mean it is harmless and a serious problem can occur if you begins to depend on colon cleansers rather than your healthy, natural colon function. This dependence is called laxative abuse and can be an addiction much like any other. Laxative abuse can result in damage to the kidneys and the cardiovascular system and can be life-threatening. [10] X Research source Roerig, J., Steffen, K., Mitchell, J., &amp; Zunker, C. (2010). Laxative abuse. Drugs, 70(12), 1487-1503 [11] X Research source Baker, E. G. (1996). COMPLICATIONS OF LAXATIVE ABUSE. Annual Review Of Medicine, 47(1), 127. Never use a cleanse more than every six months unless under the care of a health professional."
    },
    {
      "title": "Prepare to restock your system.",
      "content": "Prepare to restock your system. Once you do a colon cleanse, you need to put back in certain nutrients, called prebiotics and probiotics, into your body. Be prepared to restock and support your colon bacteria by eating foods that contain good bacteria for at least one to two months after you cleanse. These foods include: Bananas Garlic Leeks Wheat bran Asparagus Sauerkraut Kefir Yogurt Kimchee Aged cheeses [12] X Research source"
    },
    {
      "title": "Talk to your doctor.",
      "content": "Talk to your doctor. Talk to your doctor before you try any colon cleanse. Discuss the type of cleanse you plan on doing to be certain it isn't going to hurt you. Certain herbs, fruits, and vegetables can interact with prescription medications, so be aware of the side effects of your medications. As a general rule, anyone with a condition that affects the digestive tract, the kidneys, the liver, or the cardiovascular system should be very cautious about using a colon cleanse and should always talk to their doctor before using a cleanse. If you have more than three to four bowel movements in a day, discontinue all cleanses and call your doctor for advice."
    },
    {
      "title": "Pick the right ingredients.",
      "content": "Pick the right ingredients. For natural, food based cleanses, you need to pick the right foods. Vegetables contain fiber that is essential for healthy and frequent bowel movements. Pick the freshest fruit you can, and try to buy organic is possible. You want to be ingesting as many nutrients as possible with no additives. Make sure all vegetables and fruits are raw when you use them in the cleanse. Good produce to include is: [13] X Research source Spinach Asparagus Brussels sprouts Cabbage Celery Collard greens Leeks Peas Swiss chard Mustard greens Dark green lettuces Wheatgrass Kale Bok choy Parsley Cilantro Cucumber Beets and beet greens"
    },
    {
      "title": "Prepare the ingredients.",
      "content": "Prepare the ingredients. The best ways to use fresh produce for a colon cleanse is to use a juicer or to make them as smoothies in a blender. The juices will kick start your colon and also give you added energy, and the edible skins give you added fiber. You can also add organic apple juice as needed to the juice to make it thin enough to drink easily. Apple juice contains pectin, a kind of fiber which is very helpful in achieving complete bowel movement. You can mix and match vegetables to your own taste, but you should add enough to have three eight ounce glasses every day for five to seven days. Add some fruit to improve the taste. Use bananas, oranges, cherries, berries, plums, or apples. If you leave the edible skins on the fruit, it will give you an added boost of fiber."
    },
    {
      "title": "Try a green cleanse.",
      "content": "Try a green cleanse. If you aren't sure what kind of recipe to start with, try a green cleanse recipe. Chop two apples, four stalks of celery without the leaves, one cucumber, six kale leaves and add it to a blender or juicer. Add one tablespoon of finely chopped fresh ginger root and lemon juice. Blend or juice and enjoy. If this mixture is too bitter, try adding one teaspoon of honey to sweeten it."
    },
    {
      "title": "Mix a leafy fruit cleanse.",
      "content": "Mix a leafy fruit cleanse. If you don't like straight greens, try a recipe with more fruit. Mix two peeled oranges, one quartered and cored apple, two tablespoons of lemon juice, 1 cup of spinach, and one kale leaf in a juicer or blender. Once smooth or juiced, drink and enjoy. You can add a little apple juice if this mixture isn't thin enough for you. You can also add some baby carrots for some extra color, fiber, and sweetness."
    },
    {
      "title": "Make an aloe vera juice cleanse.",
      "content": "Make an aloe vera juice cleanse. For a more nutrient packed cleanse, try an aloe vera juice based cleanse. Add together one cup aloe vera juice, ½ cup of rolled oats, one cup spinach, two kale leaves, five Swiss chard leaves, one peeled banana, ½ a medium cucumber, ½ cup of blueberries, and one teaspoon of cinnamon. You can either put it through a juicer or mix it in a blender. Once smooth or juiced, drink and enjoy. You can add some honey if it isn't sweet enough."
    },
    {
      "title": "Learn about bentonite clay.",
      "content": "Learn about bentonite clay. One popular cleanse for colon health is a psyllium and bentonite clay cleanse. Bentonite clay is a mixture of mineral salts, which includes calcium bentonite and sodium bentonite. This clay absorbs many times its weight in water as well as minerals, toxins, and organic substances. This ability makes bentonite clay useful in cleanses. It is commonly used by natural health professionals and has found a place in mainstream medicine to safely treat various types of poisonings and overdoses. [14] X Research source Wang, J., Luo, H., Billam, M., Wang, Z., Guan, H., Tang, L., &amp; ... Phillips, T. (2005). Short-term safety evaluation of processed calcium montmorillonite clay (NovaSil) in humans. Food Additives And Contaminants, 22(3), 270-279 Bentonite clay and psyllium husks, a naturally derived fiber-heavy powder, can be purchased online or at your local health food store."
    },
    {
      "title": "Know the risks.",
      "content": "Know the risks. Be careful how much of the bentonite clay you use. An overabundance of this product can cause electrolyte, or mineral, imbalances. This can cause some serious health issues, which is counterproductive to the goal of a cleanse. Make sure to talk to your doctor before your try this cleanse. It is not recommended for everyone, so always follow your doctor's advice. He or she knows your situation and how this product can effect you better than anyone. Also, always follow the directions on the products you buy. [15] X Research source Wang, J., Luo, H., Billam, M., Wang, Z., Guan, H., Tang, L., &amp; ... Phillips, T. (2005). Short-term safety evaluation of processed calcium montmorillonite clay (NovaSil) in humans. Food Additives And Contaminants, 22(3), 270-279"
    },
    {
      "title": "Make the cleanse.",
      "content": "Make the cleanse. To make this cleanse, add one rounded teaspoon psyllium husk, which can be dark yellow or brown husks, to one teaspoon of bentonite clay powder to an empty glass. Add eight ounces water or pure, organic apple juice to the glass, stirring briskly to dissolve the powder. Drink it quickly before it has time to thicken. This should immediately be followed by another eight ounces of water or apple juice. You can also get bentonite clay in liquid form."
    },
    {
      "title": "Learn about the master cleanse.",
      "content": "Learn about the master cleanse. The Master Cleanse is great for cleansing, but it has also been used as a weight loss method. It has been in use since 1940, but it does have some known adverse effects, such as vitamin deficiencies, blood sugar changes, muscle breakdown, and frequent bowel movements. Always consult a physician before doing the Master Cleanse. You should not do a Master Cleanse for longer than four to five days. If you are pregnant, nursing, under 16 or over 50, or have chronic heart, kidney, liver or digestive conditions, you should not use the Master Cleanse. [16] X Research source Burroughs, Stanley. The Master Cleanser. Snowball Publishing, 2013"
    },
    {
      "title": "Make the Master Cleanse.",
      "content": "Make the Master Cleanse. The traditional Master Cleanse has a set recipe. Start by freshly squeezing the juice of one lemon into a cup, which should be about two tablespoons. Next, add two tablespoons of pure, organic maple syrup. To this, add a pinch of cayenne pepper, which is about 1/10 of a teaspoon. [17] X Research source Pour 10 ounces of purified water on top and stir vigorously. Once it settles, drink the whole glass. Drink a minimum of six to 12 glasses throughout the day whenever you are hungry or feel you need a colon cleanse. [18] X Research source Burroughs, Stanley. The Master Cleanser. Snowball Publishing, 2013"
    },
    {
      "title": "Try laxative tea cleanses.",
      "content": "Try laxative tea cleanses. In addition to these other cleanses, you can try tea cleanses before bed. Try teas with laxative-like qualities, such as herbal detox teas or senna tea. Herbal detox teas contain ingredients that will help cleanse your system and energize your as well. Senna has been used as medicine in Arabic and European countries since 800 BCE, mainly as a laxative. You can buy these at your local health food stores. To make herbal detox tea, boil a tablespoon of the loose leaf tea, or the tea bag, in eight ounces of water for 15 minutes. Let cool, strain, and drink. To make senna tea, take one teaspoon of dried senna or three tablespoons of fresh senna leaves. Add the leaves to eight ounces of boiled water. Steep for five to 10 minutes, strain, and drink. [19] X Research source"
    }
  ]
}