{
  "url": "https://www.wikihow.com/Human-Design-Types",
  "title": "The 5 Human Design Types and Their Characteristics",
  "steps": [
    {
      "title": "Manifestors are initiators.",
      "content": "Manifestors are initiators. If you’re a manifestor, you’re the one who gets the ball rolling. Manifestors are natural leaders and visionaries. You’re willing to carve your own path and often encourage others to follow you. [1] X Research source Manifestors make up approximately 9% of the population."
    },
    {
      "title": "You inspire others.",
      "content": "You inspire others. You’re passionate about your ideas and love sharing them with others. When the other Human Design types see your excitement, it often inspires them to work on their own goals and passions. [2] X Research source"
    },
    {
      "title": "Manifestors work best alone.",
      "content": "Manifestors work best alone. Manifestors enjoy playing by their own rules and may struggle with a traditional work schedule. When an idea strikes you, you want to devote all your attention to it and may become frustrated if someone interrupts you. You may also want to do everything yourself and struggle with delegating tasks to others. [3] X Research source"
    },
    {
      "title": "Generators are meant to create.",
      "content": "Generators are meant to create. If you’re a Generator, your role is to make dreams into reality and bring ideas to life. You’re full of energy and always ready to work on projects you’re passionate about. [4] X Research source Generators make up 35% of the population."
    },
    {
      "title": "You perfect your craft.",
      "content": "You perfect your craft. Generators are highly skilled at the things they enjoy. You understand how important it is to learn about your work and take pride in following through until the job is finished. [5] X Research source"
    },
    {
      "title": "Generators are responders.",
      "content": "Generators are responders. You don’t initiate things, but you respond to ideas that spark your interest. Prioritizing excitement in your work can help you feel more aligned with your aura and attract positive people and opportunities. [6] X Research source"
    },
    {
      "title": "You may become frustrated easily.",
      "content": "You may become frustrated easily. Generators need to use all of their energy in a productive way. If you don’t, you may feel stuck and like you aren’t living up to your potential. Avoid this by making time to do the things that bring you the most joy. [7] X Research source"
    },
    {
      "title": "Manifesting Generators are a hybrid between Manifestors and Generators.",
      "content": "Manifesting Generators are a hybrid between Manifestors and Generators. Manifesting Generators are busy bees who thrive on multitasking and staying busy. Whereas Generators might have one specific passion, Manifesting Generators love moving between different projects. [8] X Research source Manifesting Generators make up 35% of the population."
    },
    {
      "title": "Manifesting Generators are charismatic.",
      "content": "Manifesting Generators are charismatic. As a Manifesting Generator, you may find that others are drawn to you for your passion. You uplift others and always find the quickest way to make things happen. [9] X Research source"
    },
    {
      "title": "You may give up easily.",
      "content": "You may give up easily. Manifesting Generators love to hop from project to project, but this sometimes means abandoning things before they’re finished. You may grow frustrated at something you can’t figure out and move on to something new rather than work to solve the problem. [10] X Research source"
    },
    {
      "title": "Projectors are advisors and guides.",
      "content": "Projectors are advisors and guides. Projectors’ goal is to understand, recognize, and guide others. As a projector, you offer a new way of doing things and show others new ways to succeed. You ask the right questions and make others feel known and understood. [11] X Research source Projectors make up about 20% of the population."
    },
    {
      "title": "You’re good at reading energies.",
      "content": "You’re good at reading energies. Because of your openness as a Projector, you’re naturally good at reading and understanding others. This allows you to succeed at things like networking, organizing groups, and recognizing talent in others. [12] X Research source"
    },
    {
      "title": "You’re prone to burn out.",
      "content": "You’re prone to burn out. Projectors cannot create their own energy like some other Human Design types. Since you must draw your energy from others, it’s easy for you to burn out. When this happens, you might seek recognition from others and attempt to do everything yourself. For you to succeed, you must wait to be invited. [13] X Research source"
    },
    {
      "title": "Reflectors see and reflect others.",
      "content": "Reflectors see and reflect others. Reflectors get their name from their ability to reflect other auras. As a reflector, you have the natural ability to read and understand others. You may often blend in with your environment as a way of protecting yourself from feeling overwhelmed by others’ energies. [14] X Research source Reflectors make up 1% of the population, making them the rarest Human Design type."
    },
    {
      "title": "Reflectors notice things others don’t.",
      "content": "Reflectors notice things others don’t. Reflectors are deeply attuned to the world around them, and they often pick up on things others miss. If you’re a reflector, you see the potential for what the world could be. [15] X Research source"
    },
    {
      "title": "You might feel disappointed in the world around you.",
      "content": "You might feel disappointed in the world around you. Because Reflectors see all of humanity’s potential, they can feel frustrated by reality. You see the gap between what currently is and what could be and feel disappointed with the current state of things. You experience life very differently from the other types, so you may struggle with feeling lonely and misunderstood. [16] X Research source"
    },
    {
      "title": "Human Design reveals how we can best use our energies.",
      "content": "Human Design reveals how we can best use our energies. Your Human Design type is determined by the time and place of your birth and can help you understand your role in the world. By knowing your Human Design type, you can learn the best way to use your energy in your daily life. [17] X Research source"
    },
    {
      "title": "Human Design combines ancient practices with modern science.",
      "content": "Human Design combines ancient practices with modern science. Founded by Ra Uru Hu in the 80s, Human Design uses practices like astrology, chakras, the I Ching, and the Kabbalah as well as quantum physics and genetics. [18] X Research source"
    },
    {
      "title": "There are 5 Human Design Types.",
      "content": "There are 5 Human Design Types. The way you create and use your energy determines your Human Design Type. The 5 types are Projectors, Generators, Manifestors, Manifesting Generators, and Reflectors. [19] X Research source"
    },
    {
      "title": "Generate your Body Graph.",
      "content": "Generate your Body Graph. A Body Graph, or Human Design chart, shows you all the information you need to know to understand your Human Design type. You can generate your chart for free on many websites, and you’ll just need to know the date, time, and place of your birth. [20] X Research source"
    },
    {
      "title": "Read your chart.",
      "content": "Read your chart. By learning how to read a Human Design chart , you’ll learn details regarding your Human Design type that are specific to you and your energy."
    }
  ]
}