{
  "url": "https://www.wikihow.com/Keep-Lettuce-Fresh",
  "title": "How to Keep Lettuce Fresh",
  "steps": [
    {
      "title": "Remove the core from crisp lettuce heads.",
      "content": "Remove the core from crisp lettuce heads. Iceberg, romaine, and other lettuce with a stiff core last longer when this core is removed. [1] X Research source Cut out the core with a knife, or pound the stem against a cutting board firmly, then twist the stem to remove the core by hand. [2] X Research source Do not remove the stem from butter lettuce, or any lettuce with loose, tender leaves."
    },
    {
      "title": "Wrap the lettuce in paper towels.",
      "content": "Wrap the lettuce in paper towels. Sandwich the head of lettuce — or loose leaves in single layers — between two soft, absorbent paper towels. These will absorb excess water but keep the lettuce in the moist conditions it prefers. [3] X Trustworthy Source Michigan State University Extension Extension program of Michigan State University focused on community outreach, education, and engagement Go to source If the lettuce feels dry, dampen the paper towels. [4] X Research source If the lettuce is wet enough to soak the towels, squeeze them out and wrap the lettuce again in the same, moist paper towels. If the lettuce is a bag of loose leaves, spin them dry in a salad spinner."
    },
    {
      "title": "Store in a plastic container.",
      "content": "Store in a plastic container. This can be a zip-locked bag, hard plastic container, or even a salad spinner. If using a bag, press out some of the air before sealing, without bruising the leaves. If using a hard container, fill it at least halfway with leaves. [5] X Research source The more air in the container, the faster you'll get brown edges. [6] X Research source If you press out all the air and seal the container completely, the lettuce may develop off flavors due to poor respiration. [7] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source Leaving a little air or cracking the container slightly may be a better idea, especially with leaf lettuce or a fridge that's on the warm side."
    },
    {
      "title": "Place in the crisper drawer.",
      "content": "Place in the crisper drawer. This is the coldest part of your fridge, which is ideal for leafy greens. Most grocery store lettuce should last 3-7 days here, depending on freshness, while iceberg may last up to two weeks. [8] X Research source Fresh lettuce from your garden or a farm stand may last longer. Do not squeeze the leaves into tight spaces with other foods, which may cause bruising. Do not store in the same drawer as apples, pears, or tomatoes, which release high amounts of ethylene gas that can cause spoilage."
    },
    {
      "title": "Watch the container.",
      "content": "Watch the container. If water is running down the sides of the container, lower your fridge's humidity settings or open the crisper drawer's air vents wider. (You may also want to drain out the excess water.) If you see ice in the crisper drawer or on the leaves, raise your fridge's temperature. If the lettuce starts to wilt or you see colorful liquid building up in the container, your lettuce has gone bad."
    },
    {
      "title": "Exhale into your own personal cut lettuce supply.",
      "content": "Exhale into your own personal cut lettuce supply. Carbon dioxide can reduce browning and increase shelf life in cut lettuce. One easy way to add CO 2 is to exhale a small amount into the bag of lettuce, then seal it. [9] X Research source For sanitary reasons, do this only with lettuce you plan to eat personally. Carbon dioxide is not beneficial for intact lettuce heads."
    },
    {
      "title": "Add a stronger carbon dioxide source.",
      "content": "Add a stronger carbon dioxide source. This clever way to add carbon dioxide can increase your lettuce's lifespan by five extra days, in the best case scenario. Here's how to set it up: [10] X Research source Freeze 1 tsp (5mL) white vinegar in a spice jar or other small container. Pour 1 tsp (5mL) baking soda onto the frozen vinegar. Leave the lid off the jar, and cover with several layers of paper towel. Fasten with a rubber band. Keep this jar upright in a sealed container of lettuce. The vinegar will slowly melt and react with the baking soda to create CO 2 ."
    },
    {
      "title": "Vacuum seal crisp lettuce in a glass jar.",
      "content": "Vacuum seal crisp lettuce in a glass jar. If you have a vacuum-packing machine, you can use it on a jar of iceberg lettuce to keep it fresh for up to two weeks. [11] X Research source Romaine lettuce typically lasts a week when vacuum sealed. This does not work well with butter lettuce and other tender leaves. [12] X Research source You can imitate a vacuum packing machine with a much cheaper (but less effective) hand pump. Punch a hole through the jar lid with a thumbtack, cover it with electrical tape, and pump air out through the tape. [13] X Research source This will not work with a plastic bag of lettuce, as the leaves will be crushed in the vacuum. [14] X Research source"
    }
  ]
}