{
  "url": "https://www.wikihow.com/Make-a-T-Shirt-a-Tank-Top",
  "title": "How to Cut a T-Shirt into a Tank Top: 3 Easy Styles",
  "steps": [
    {
      "title": "Iron a tank top and a t-shirt, then flip the t-shirt inside out.",
      "content": "Iron a tank top and a t-shirt, then flip the t-shirt inside out. Find a tank top to use as a cutting template. Since you'll be using it as a model, make sure that the fit is just right and looks good on you. If the t-shirt is a brand new shirt, wash and dry it first. Fabric tends to shrink after you wash it the first time, and you want the shirt to be the right size before you start working on it. Make sure both shirts are ironed and wrinkle-free before moving on. [1] X Research source No model tank top? No problem! You can still follow the steps below—just make an estimate about where to cut the sleeves off, erring on the side of caution (you can always take off more fabric later). Or, read our article on how to sew a tank top from scratch."
    },
    {
      "title": "Layer the t-shirt and tank top to align the shoulders, then pin together.",
      "content": "Layer the t-shirt and tank top to align the shoulders, then pin together. Lay the t-shirt flat on a table, then lay the tank top over it. Make sure that the shoulders of the tank top are aligned with the shoulders of the t-shirt. Also, make sure that the fronts of both shirts are facing upwards. Then, place straight pins all along the edges of the tank top. Take care to pin all the way through all layers of both shirts to keep the shirts from moving and to even out your cuts."
    },
    {
      "title": "Cut the t-shirt, using the tank top's armholes and neckline as a guide.",
      "content": "Cut the t-shirt, using the tank top's armholes and neckline as a guide. If you'd like a finished hem around the armholes and neckline, leave a ½-inch (1.27 centimeters) seam allowance. A finished hem is not a requirement for t-shirt tank tops, as the fabric does not fray. A finished hem will look nicer, however. If you don't have a tank top to use as a guide, cut the sleeves and collar off your t-shirt . Consider folding the shirt in half before cutting it, so that both sides will be even. [2] X Research source After cutting the t-shirt, take the pins out and put the tank top away. Make sure that the t-shirt is still inside out at this point. You won't be turning it right side out until the very end."
    },
    {
      "title": "Cut the front neckline and armholes wider, if desired.",
      "content": "Cut the front neckline and armholes wider, if desired. Some tank tops have a lower neckline and armhole opening in the front than in the back. If you want to replicate this, apparel manufacturing specialist Alessio Iadicicco recommends not to trim too much off if you plan on having finished hems. Remember to leave a ½-inch (1.27 centimeters) seam allowance."
    },
    {
      "title": "Fold the cut edges down, pin them in place, and iron them flat.",
      "content": "Fold the cut edges down, pin them in place, and iron them flat. Fold the edges down by ½-inch (1.27 centimeters). Secure the folds with straight pins, and press them flat with an iron. When folding, make sure that you are folding towards the outside, not the inside. If you'd like the edges to be raw and un-hemmed, you can skip this step. T-shirts are made from jersey material, which does not fray."
    },
    {
      "title": "Stitch the folded edges down using a ¼-inch (0.64 centimeters) seam allowance.",
      "content": "Stitch the folded edges down using a ¼-inch (0.64 centimeters) seam allowance. You can sew by hand or use a sewing machine for more professional, durable stitches. If you are using a sewing machine, use a stitch intended for knit fabrics. It looks like a straight stitch, except that it is broken up by a V every few stitches. When you are done sewing, remember to tie the ends of the threads off into tight knots, and to snip the excess tail ends off."
    },
    {
      "title": "Remove the pins, turn the tank right side out, and try it on.",
      "content": "Remove the pins, turn the tank right side out, and try it on. Once you’ve finished your tank top, try it on to see how it fits. The tank top will be a little loose, unless you used a fitted t-shirt or trimmed the sides down."
    },
    {
      "title": "Cut the sleeves off of a t-shirt you won't mind cutting up.",
      "content": "Cut the sleeves off of a t-shirt you won't mind cutting up. If this is a brand-new shirt, throw it into the washer and dry it afterward. Then, cut the sleeves off by starting from just under the armpits and cutting straight up towards the shoulders. [3] X Research source Brand new shirts may shrink a little bit after you wash them the first time. You want the t-shirt to fit you properly before you begin cutting it and turning it into a racerback. A racerback tank top has wider armholes in the back, leaving a skinny band of fabric between the shoulder blades."
    },
    {
      "title": "Cut the hem off your shirt, then snip it to make a long strand.",
      "content": "Cut the hem off your shirt, then snip it to make a long strand. Cut right along the bottom hem of your t-shirt, using the stitching as a guide. When you are done, you will end up with a large, fabric ring. Cut this ring apart, close to one of the side seams, so that you end up with a long, fabric strand. You will use this to decorate the back of your tank top."
    },
    {
      "title": "Trim the back of the armholes into a racerback shape.",
      "content": "Trim the back of the armholes into a racerback shape. Turn the shirt over so that the back is facing you. Trim the back of the armholes further until there are only a few inches of fabric between them. Be careful not to cut the armholes on the front of the shirt. Make sure that you cut the same amount from each side of the shirt. Cut the armholes deep. They should be a few inches apart when you are done."
    },
    {
      "title": "Cut a deep V-shape into the back of your shirt.",
      "content": "Cut a deep V-shape into the back of your shirt. Find the back center of the neckline, then cut a deep V-shape. Keep the point of the V-shape between the armholes. This will help keep the fabric from bunching up when you tie it up. [4] X Research source Do not cut the front of the shirt; you are only cutting the back. Racerbacks have a plain collar in the front. If you prefer a plain racerback, you can skip this step, and wear your racerback. The next few steps will teach you how to make a fancier racerback."
    },
    {
      "title": "Tie one end of the fabric strand around the bottom of the V-shape.",
      "content": "Tie one end of the fabric strand around the bottom of the V-shape. Find the bottom of the V-shape and measure up a few inches/centimeters. Take the fabric strand you cut from the hem of the shirt earlier, and tie it around that point. The fabric strand should gather the fabric between the two armholes on the back of your shirt. [5] X Research source"
    },
    {
      "title": "Wrap the strand around the fabric moving downward, then back towards the top.",
      "content": "Wrap the strand around the fabric moving downward, then back towards the top. Try to wrap as tightly as you can, so that the fabric between the armholes turns into a \"rope.\" Stop when you reach the bottom of the armholes. Then, wrap the strand back towards the top of the shirt and secure the end. You can do this simply by tucking the end under the wound fabric. For extra security, tie the two ends of the strand together into a tight knot first."
    },
    {
      "title": "Consider trimming the bottom of your tank top to give it a high-low look.",
      "content": "Consider trimming the bottom of your tank top to give it a high-low look. Spread the shirt down sideways, so that you see only the side seam, the armhole, and half of the front and back. Find the folded front side of the shirt. Measure up a few inches, then start cutting downwards towards the back of the shirt. When you are done, your shirt will be shorter in the front, and longer in the back. [6] X Research source You do not need to worry about hemming, because t-shirt fabric does not fray. Racerback shirts are perfect for layering over bandeau tops and for working out ."
    },
    {
      "title": "Mark where you want to cut the sleeves off, then cut them.",
      "content": "Mark where you want to cut the sleeves off, then cut them. Before you prepare to turn your t-shirt into a tank top, use a marker to draw dotted lines along one shoulder. After marking where you want to remove the sleeve, follow the dotted line and cut one of the sleeves off. Then, fold your shirt exactly in half to match and use the cut sleeve as a guide to cut off the second sleeve. [7] X Research source"
    },
    {
      "title": "Turn the shirt over and cut the back panel in half horizontally.",
      "content": "Turn the shirt over and cut the back panel in half horizontally. Turn your shirt around and find the bottom point of the arm holes. Cut a straight line from the bottom of one arm hole to the other, cutting only through the back layer of fabric (do not cut through the front of the shirt). [8] X Research source Once you’ve cut the back, flip the shirt open. The top portion of the back should only be connected by the collar now."
    },
    {
      "title": "Trim the excess flare from the upper portion of the back panel.",
      "content": "Trim the excess flare from the upper portion of the back panel. Flip the back side of the shirt open so that the collar makes a perfect circle. The portion of the back panel still attached to the collar resembles a trapezoid shape. Starting at the long edge and moving toward the collar, cut off the flared corners of he trapezoid to form a rectangle shape. [9] X Research source"
    },
    {
      "title": "Cut two straps connecting to the collar.",
      "content": "Cut two straps connecting to the collar. From the top left corner of the rectangle you just made, move 1 in (2.54 cm) inward and cut down towards the neckline to create a strap. Then, repeat this step from the top right corner. Remove the excess fabric from the middle and scrap or discard it. [10] X Research source You'll tie these 2 straps behind your neck to hold the shirt up, similar to a halter top."
    },
    {
      "title": "Cut a half circle into the bottom of the back panel, then snip it in half.",
      "content": "Cut a half circle into the bottom of the back panel, then snip it in half. Bring your scissors to the bottom of the shirt (back layer only) and cut a half circle out on the backside. Move your scissors towards the middle of the half circle and cut a straight line through the remaining fabric to disconnect the fabric and create your two back straps. [11] X Research source"
    },
    {
      "title": "Put your shirt on and tie the straps together.",
      "content": "Put your shirt on and tie the straps together. Now that the shirt is cut into a tank top, put it on and tie the straps together behind your neck and back. Now, you have an open-back tank top! [12] X Research source"
    }
  ]
}