{
  "url": "https://www.wikihow.com/Get-a-Restraining-Order-in-Missouri",
  "title": "How to Get a Restraining Order in Missouri",
  "steps": [
    {
      "title": "Make sure you are safe.",
      "content": "Make sure you are safe. Do what you can to protect yourself and your loved ones before you start the process of getting a restraining order. If you need help or assistance, you can find resources in your area by using the Missouri Coalition Against Domestic & Sexual Violence's service locator map, located online at https://www.mocadsv.org/How-to-Get-Help/ ."
    },
    {
      "title": "Download the forms.",
      "content": "Download the forms. The Missouri courts make the forms necessary to get a restraining order available online, and looking at the forms can help you determine what documents and information you will need to prove your case and get your order. You are eligible to request a domestic violence order of protection if you are related in some way or had a romantic relationship with the person you want the court to restrain. If you don't have a familial or romantic relationship to the person you want restrained, you may qualify for a stalking order of protection. [1] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source You also can get paper copies of the forms at any circuit court clerk's office. Many domestic violence agencies or shelters, as well as legal aid offices or family law clinics, may have paper copies available."
    },
    {
      "title": "Gather documents or other evidence.",
      "content": "Gather documents or other evidence. Once you look at the forms you have to fill out, you'll have a better idea of what information you must have to get your restraining order. If you are seeking a stalking order of protection, you must show a pattern of unwanted behavior that serves no legitimate purpose and causes a reasonable fear of imminent physical harm. Evidence of this could include following you, repeated communication, or threats. Typically you also must show that you told the person to stop or to leave you alone. [2] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source In cases of domestic violence, you must prove your relationship to the person you want the court to restrain as well as acts of abuse or violence against you. [3] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source If the person injured you, take photos of any visible marks or bruises to use as evidence. Medical and police reports also can be used. You also want to gather any information you have about the person you want the court to restrain, such as address, past or pending criminal charges, and whether he or she owns a gun. [4] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source If you know of anyone who witnessed any abusive or threatening acts by the person you want the court to restrain, you may want to talk to them and find out if they are willing to testify on your behalf. [5] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Consider consulting an attorney.",
      "content": "Consider consulting an attorney. If you find the forms confusing or are unsure about your ability to represent yourself, you might want to have an attorney to assist you. Keep in mind that while the court clerk can help you fill out the forms, he or she cannot give you legal advice. Legal aid offices and family law clinics typically offer free or reduced-cost legal representation for domestic violence or stalking victims who cannot afford to pay for a private attorney. [6] X Research source You may be able to get assistance from a local domestic violence agency. Victims advocates also are available in most counties and will assist you free of charge. [7] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source [8] X Research source Keep in mind that the person you want the court to restrain will have the right to be represented by an attorney at the hearing, and can have an appointed attorney if he or she cannot afford attorney fees. [9] X Research source If you are granted a full order of protection, it may include an award of any attorney's fees you incurred while seeking the order. [10] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Go to the circuit court nearest you.",
      "content": "Go to the circuit court nearest you. Restraining order petitions are processed through the circuit courts in Missouri. There is a circuit court in every county in Missouri. You can find the address and other information about the court nearest you by using the map provided online by the Missouri courts at https://www.courts.mo.gov/page.jsp?id=321 . Generally you can file your petition in the county where you live, where the person you want the court to restrain lives, or where the incidents of abuse, stalking, or domestic violence occurred – whichever is most convenient for you."
    },
    {
      "title": "Fill out your petition.",
      "content": "Fill out your petition. You can fill out the forms before you go to the courthouse, or fill them out in the clerk's office where you have a clerk available to assist you. Use descriptive language when filling out your petition, and be as specific as possible. Include as many dates, times, and locations as you can. [11] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source If you fill out your petition before you go to the courthouse, don't sign it yet. The clerk must witness your signature. [12] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source In addition to your petition, you also must fill out a confidential case filing information sheet. This form asks you for certain information such as your address and full Social Security number, but this information will be kept confidential and will not be disclosed to the person you want the court to restrain. [13] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "File your petition.",
      "content": "File your petition. Once you've completed your application, you must give it to the clerk to initiate the process of getting a restraining order. Missouri courts do not assess any filing fees or court costs for seeking an order of protection. Tell the clerk if you want an ex parte order, and he or she will arrange for you to see a judge. [14] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source If you don't want the person you're asking the court to restrain to know your address, you can ask the clerk to keep it confidential. You also can use a different address, such as that of a friend, on your petition. [15] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source However, if you're using someone else's address, make sure they know about it ahead of time and give you permission to do so."
    },
    {
      "title": "Talk to a judge.",
      "content": "Talk to a judge. You will be called to explain why you want a restraining order as soon as possible after you've filed your petition. [16] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source You must show the judge good cause to grant you an ex parte order. The term \"ex parte\" means that the judge is only hearing your side of the story. [17] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source Ex parte orders are by their nature temporary, since the person you want the court to restrain has due process rights under the Constitution. The courts cannot do anything to restrict his or her freedom of movement without giving him or her a chance to face you in court and tell the other side of the story. [18] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Get your ex parte order.",
      "content": "Get your ex parte order. If the judge determines the person you want restrained represents a clear and present danger to you or your loved ones, you will receive an ex parte order of protection immediately. [19] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source In Missouri, the ex parte order goes into effect immediately after the judge issues it. [20] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source A hearing for a full order of protection will be scheduled, typically within 15 days of the date you filed your petition. [21] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source An ex parte order generally prohibits the person from coming near you or your home, school, or place of work. It also typically forbids the person from communicating with you in any way. [22] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source Keep in mind that even if the judge does not grant you an ex parte order, you still may be granted a full order of protection. The judge will give you a notice of hearing, which states when you can come back to court for your hearing on a full order of protection. [23] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source Within 24 hours of the date it is issued, your ex parte order will be entered into the Missouri Uniform Law Enforcement System, so all law enforcement will know about it. [24] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Have the ex parte order served.",
      "content": "Have the ex parte order served. Although the order is in effect from the moment it is issued, it cannot be made permanent unless the person you want restrained has proper legal notice. The court will arrange for a sheriff's deputy to serve the other person, who will be referred to on your court documents as the \"respondent.\" He or she must be served at least three days prior to the date the hearing is scheduled. [25] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source The ex parte order typically is set to expire on the date of your hearing for a full order of protection. If you can't attend that hearing, you must let the court know as soon as possible so the judge can reschedule your hearing and extend the ex parte order if necessary. [26] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source You have the right to receive notice when the person you want restrained is properly served, but you must tell the clerk you want to receive notice. Missouri courts won't send you notice automatically. [27] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Prepare for your hearing.",
      "content": "Prepare for your hearing. Since your hearing typically is scheduled within a couple of weeks of the date you filed your petition, you don't have much time to prepare your case. If you're calling witnesses, make sure they know the date of the hearing and where they need to be. Try to meet up with them prior to the hearing so you can go over the questions you plan to ask and discuss possible questions they may be asked on cross-examination. You may want to arrange to meet with your witnesses at your home or another location on the date of the trial so you can all travel to the courthouse together. In addition to witnesses, make sure you have all the documents and other evidence together that you used to file your petition. Make copies of everything you plan to introduce as evidence so that there's at least one copy for the judge and one copy for the respondent, but you also should bring the originals. [28] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Appear on your hearing date.",
      "content": "Appear on your hearing date. If you don't appear on the date of your hearing, the judge will dismiss your petition and your temporary order will not be made permanent. [29] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source If you received an ex parte order and do not show up for your hearing, your ex parte order will expire and you will have to start the entire process over from the beginning if you want a full order of protection. [30] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source You should try to arrive at the courthouse at least 30 minutes before your hearing is scheduled, so you have time to get through courthouse security and find the correct courtroom. The judge may be hearing other cases besides yours on the same day, so take a seat in the gallery and wait until your name is called before you move to the front of the courtroom. Keep in mind that the person you want the court to restrain also may be present in the courtroom for the hearing. Even if you don't have witnesses, you may want to bring a companion with you for support. If the person you want the court to restrain does not show up for the hearing, the judge may grant your request for a full order, or he or she may schedule another hearing at a later date and extend your ex parte hearing if appropriate. [31] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Present your case.",
      "content": "Present your case. Since you filed the initial petition, you will have the opportunity to tell the judge your story first. Speak only to the judge, rather than the respondent. Try to keep your eyes on the judge and avoid even looking at the respondent, since he or she may make faces or otherwise attempt to distract you or derail your presentation. If the judge asks you any questions, you should stop talking immediately and listen to the judge's question. Answer his or her question completely before continuing with your presentation. Keep in mind that this is a formal court hearing, so the rules of civil procedure and evidence will apply just as they would in any other lawsuit. As the petitioner, you have the burden of proof in your case. You must prove to the judge that the person you want restrained has committed the acts you alleged in your petition, and that you need protection from this person as a result of his or her behavior. [32] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source If the respondent appears, he or she will have the opportunity to ask questions of you as well as any witnesses you call to testify on your behalf. Be prepared to be asked questions that you find offensive or that make you uncomfortable. The judge will maintain order in his courtroom and may instruct you not to answer any questions he or she decides are irrelevant to the case."
    },
    {
      "title": "Listen to the other side.",
      "content": "Listen to the other side. If the person you want restrained has appeared at the hearing, he or she will have an opportunity to speak to the judge as well. Avoid interrupting him or her, or shouting out in the courtroom. Keep in mind that the person you want the court to restrain may very well lie or attempt to make light of the situation. You will have the opportunity to question the respondent as well as any witnesses he or she calls, so it's important to pay attention while they are presenting the other side. Make note of anything you disagree with so you can ask questions about it when it is your turn. When you ask questions, stick to the facts and avoid arguing with the respondent or saying anything to antagonize him or her."
    },
    {
      "title": "Receive your permanent order.",
      "content": "Receive your permanent order. If the judge decides it is warranted based on everything presented, he or she will make your ex parte order permanent. In addition to extending the period of protection provided by the ex parte order, your full order also can include an award of child custody, child support, possession of property, or spousal support, if any of those are applicable to your situation. [33] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source Under a full order, the judge also may require the person to pay your court costs or attorney's fees associated with seeking the order, as well as any medical bills you incurred treating injuries caused by the person the court has restrained. [34] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source Once you have a full order of protection, the restrained person will be unable to buy or sell any firearm or ammunition that was transported across state lines. Additionally, if he or she has a concealed carry permit or endorsement it will be suspended for the duration of your order. A full order of protection will last anywhere from 180 days to a year, depending on the facts of your case. [35] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source Your full order also can include a provision that allows it to automatically renew unless the person you've restrained files an objection to the automatic renewal and requests a hearing within 30 days before it is set to expire. [36] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source If your full order doesn't have an automatic renewal provision, you must file a motion with the court to have it renewed, and the judge will hold a hearing to determine whether good cause to renew the motion exists. [37] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    }
  ]
}