{
  "url": "https://www.wikihow.com/Lg-Washing-Machine-Tub-Clean",
  "title": "How to Clean LG Front and Top Loading Washers with the Tub Clean Cycle",
  "steps": [
    {
      "title": "Remove any clothing or objects inside your washing machine.",
      "content": "Remove any clothing or objects inside your washing machine. The Tub Clean cycle uses very hot water to sanitize the drum and remove soap scum and other debris. So, it’s important to run the cycle while the machine is completely empty to get it sparkling clean and prevent damage to your clothes. [1] X Research source Note : The instructions for using the Tub Clean cycle are the same for front and top-loading machines."
    },
    {
      "title": "Pour drum cleaner or vinegar into the detergent compartment.",
      "content": "Pour drum cleaner or vinegar into the detergent compartment. LG recommends adding a washing machine drum cleaner to the Tub Clean cycle to get your washer as clean as possible. Simply add a liquid or powder cleaner to the main detergent compartment, or add a cleaning tablet directly to the drum. Just follow the directions on the packaging to add the recommended amount of cleaner. [2] X Research source As an alternative to using a drum cleaner : Pour 2 cups (473 ml) of white vinegar into the main detergent compartment or directly into the drum. Optionally, add 2 cups (1 kg) of baking soda directly to the drum, too. [3] X Research source Or, fill the bleach compartment with liquid chlorine bleach . Just make sure not to fill the compartment past the max fill line. Or, add 1 cup (204 g) of borax and 1 cup (598 g) of washing soda to the drum. [4] X Research source Warning : Do not combine bleach with any other cleaning agent or product, as it can produce toxic fumes. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Turn on your washer, select “Tub Clean,” and press “Start.”",
      "content": "Turn on your washer, select “Tub Clean,” and press “Start.” Press the power button on your washer to turn it on. Then, find “Tub Clean” on your machine—it may be an option on the knob dial or a button on the touch screen that you press and hold for 3 to 5 seconds. Once the display screen reads “tcl”, press “Start” to run your machine. [6] X Research source On some models , the “Turbo Clean” button might be the same button as the “Rinse” button. Or, you may need to press the “Turbo Wash” button for 3 seconds before selecting Turbo Clean. If your washer is connected to LG’s ThinQ app , use it to start a Tub Clean cycle. Simply press the 3 dots in the top right corner and select “Tub Clean Coach.” Then, follow the instructions in the app to start it. [7] X Research source Consult your washing machine’s owner’s manual if you are having difficulty finding the “Tub Clean” button. Some older models might not have this feature."
    },
    {
      "title": "Open the door once the cycle is complete to dry out the drum.",
      "content": "Open the door once the cycle is complete to dry out the drum. The Tub Clean cycle typically takes 1 to 2 hours to complete. Then, open the washer door to allow air to circulate through the drum and evaporate the moisture inside. This helps prevent mold, mildew, and odors from forming. [8] X Research source If you used a cleaner other than a commercial drum cleaner , run a quick rinse cycle to remove any cleaner residue before washing a normal load of laundry."
    },
    {
      "title": "Use the Tub Clean cycle monthly to keep your washer clean.",
      "content": "Use the Tub Clean cycle monthly to keep your washer clean. LG advises you to run the Tub Clean cycle at least once per month. This helps to remove mold and mildew, get rid of residue buildup, and prevent unpleasant odors from forming. [9] X Research source Professional cleaner Ashley Matuska agrees with cleaning your washer monthly if you use it often. However, if you don’t use your washer very often, she says “you can get away with [cleaning it] every six months or every two months.”"
    },
    {
      "title": "Pour 2 cups (473 ml) of white vinegar into your machine.",
      "content": "Pour 2 cups (473 ml) of white vinegar into your machine. White vinegar is an excellent washing machine cleaner that kills mold, dissolves grime, and removes unpleasant odors. [10] X Research source Simply pour 2 cups (473 ml) of vinegar into the main detergent compartment or directly into the drum. [11] X Research source As an alternative , house cleaning professional James Sears recommends using bleach. He says you can “use this same drawer to put bleach in the washing machine to clean it” by “fill[ing] the drawer with bleach.” Feel free to use a washing machine tub cleaner instead of a DIY solution."
    },
    {
      "title": "Run your machine’s hottest and longest cycle.",
      "content": "Run your machine’s hottest and longest cycle. Turn on your washing machine and select the hottest cycle and longest run time—this helps ensure that the drum is completely cleaned and sanitized. Then, start your washer. [12] X Research source If your LG washing machine has a Sanitize or Maintenance cycle, choose it instead. These cycles are similar to the Tub Clean cycle. Note : Ensure your washing machine is completely empty of clothes and other objects before running the cycle."
    },
    {
      "title": "Keep the door open once the cycle is finished.",
      "content": "Keep the door open once the cycle is finished. To completely dry out the drum and prevent mold and odors from forming, open the washing machine door all the way. Once the drum is dry, feel free to crack the door, instead."
    },
    {
      "title": "It’s time to clean your washer if it smells bad or clothes come out unclean.",
      "content": "It’s time to clean your washer if it smells bad or clothes come out unclean. One of the biggest signs that your washing machine needs cleaning is when it starts to smell musty or rotten, which usually means mold and mildew are growing inside. You might also notice that your clothes smell musty, look dirty, and feel rough even after going through the washer. [13] X Research source Noticeable mold, mildew, and detergent buildup inside the drum and detergent drawer are other major signs your washing machine needs to be cleaned."
    },
    {
      "title": "Rinse out the dispenser compartments and drawer with warm water.",
      "content": "Rinse out the dispenser compartments and drawer with warm water. To remove the detergent dispenser, pull it out while pressing the tab on the bleach compartment. Then, take out the compartments. Simply rinse the compartments and dispenser with warm water and a soft brush to remove detergent residue and debris. [14] X Research source Use a damp cloth to wipe out the detergent dispenser opening, too. Clean out the detergent dispenser about once per month, or whenever you clean the drum."
    },
    {
      "title": "Wipe the rubber door gasket with white vinegar.",
      "content": "Wipe the rubber door gasket with white vinegar. Most front-loading machines have a rubber seal, called a gasket, between the door and drum that can harbor mold, detergent residue, and bad odors. Simply spray the gasket with white vinegar and use a towel to wipe the surface of the seal and inside the crevice. [15] X Research source Wipe down the gasket about once per month. Alternatively, use a diluted bleach solution to clean the gasket. Just mix ¾ cup (180 ml) of bleach with 1 gallon (3.8 L) of warm water. Tip : Dry the gasket with a towel after every laundry load. This helps prevent mold and odors from forming in the first place."
    },
    {
      "title": "Soak the inlet filter in white vinegar.",
      "content": "Soak the inlet filter in white vinegar. Turn off your machine and unplug it from the wall. Then, turn off the water supply to your washer. Find the hot and cold water inlet hoses on the back of your machine and unscrew them. Then, use a pair of needle nose pliers to take out the inlet filter. Just let the filter soak in white vinegar for several minutes before rinsing it thoroughly with water. [16] X Research source Flush out the water inlet hoses before reattaching them to your machine. Simply position them over a bucket or your sink and pour several gallons of water through them. Clean the inlet filter about once per month."
    },
    {
      "title": "Clean the drain pump filter with warm water.",
      "content": "Clean the drain pump filter with warm water. Turn off and unplug your washer. Then, appliance repair expert Gevorg Grigorian says to look for an “access point” for the filter “in the front of the washer” on “the left or right side.” Open the filter compartment and place “a flat container” under it. Then, unhook the black hose and “empty out every ounce of water in there.” Finally, “turn [the filter] counterclockwise” to remove it and “clean out the debris” with warm water and a soft brush. To put the filter back in, insert it inside the compartment and twist it clockwise. Then, reattach the black hose. Place towels around the washer to absorb any water that spills, too. Grigorian recommends cleaning the drain pump filter every 1 to 3 months. On some top-loading machines, the filter is located under the agitator."
    },
    {
      "title": "Wipe the exterior of the machine with an antibacterial cleaner.",
      "content": "Wipe the exterior of the machine with an antibacterial cleaner . Spray the front, top, and sides of your washing machine with an all-purpose antibacterial cleaner. Then, use a soft cloth to wipe away bacteria, dust, dirt, and detergent residue. [17] X Research source As an alternative, spray the outside of your machine with white vinegar."
    },
    {
      "title": "Remove clean clothes from the washer as soon as the cycle is done.",
      "content": "Remove clean clothes from the washer as soon as the cycle is done. Keeping wet clothes in your washer can trap moisture in the drum, which encourages mold, mildew, and smells to form. As soon as the washer’s cycle finishes, transfer your clothes to the dryer. [18] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Keep the washing machine door open after each cycle.",
      "content": "Keep the washing machine door open after each cycle. House cleaning professional Chris Willatt advises to “leave the door open” once your washer’s cycle finishes to “let it air out.” This prevents moisture from lingering inside the drum which can lead to mold and bacteria growth."
    }
  ]
}