{
  "url": "https://www.wikihow.com/Hide-a-Nipple-Piercing",
  "title": "How to Hide a Nipple Piercing",
  "steps": [
    {
      "title": "Wear padded bras to obscure your piercing.",
      "content": "Wear padded bras to obscure your piercing. With some extra cushion, you'll have a wall of protection between your clothes and your jewelry. [1] X Research source If you don’t own a padded bra, or if wearing one would cause discomfort, try a lightly lined one. It'll minimize bulk under your shirt while covering the jewelry. Place breast or nursing pads in an unlined bra for extra coverage. [2] X Research source If they stick to your nipple, saturate the pad and gently peel."
    },
    {
      "title": "Use pasties to hide the piercing.",
      "content": "Use pasties to hide the piercing. Pasties are great for keeping your nipples from poking through your clothes. To use, apply the pasties to your breast so they cover the piercing. Opt for larger pasties that cover the areola and the nipple. Your chest will appear smoother in your outfit. Be careful when removing the pasties, which can stick and pull on the piercing. Wet disposable nipple covers to remove them. To remove silicone covers, try applying jojoba oil or petroleum jelly around and under the edges of the cover."
    },
    {
      "title": "Wear clothes with patterns to distract curious gazes.",
      "content": "Wear clothes with patterns to distract curious gazes. If you’re wearing flashy clothes, people probably won't notice that your nipple ring is sticking out. Now's the time to commit to bold prints and showy designs. If there’s something fun and wild in your closet that you’ve been dying to wear, weave it into your everyday wardrobe. [3] X Research source This also works if you wear something thin, like a bathing suit top. It won’t hide the shape of the jewelry, but the patterns won’t draw attention to the jewelry's outline."
    },
    {
      "title": "Throw on a jacket or robe to cover up the piercing.",
      "content": "Throw on a jacket or robe to cover up the piercing. Layered clothes offer another barrier of protection. This is especially helpful if you’re in a thin top. Wear something that matches your outfit. Nobody will know why you’re really wearing it! You can opt for clothes that are looser at the chest, like oversized shirts or flowy peasant tops."
    },
    {
      "title": "Choose an outfit that creatively covers your chest.",
      "content": "Choose an outfit that creatively covers your chest. You can sport a stylish look and discreetly hide your piercings at the same time! Search your wardrobe for T-shirts with thick logos on the front. The dense fabric plus the logo will distract whoever’s looking. Try on clothes with built-in chest coverage, like overalls."
    },
    {
      "title": "Choose jewelry that’s small and easy to hide.",
      "content": "Choose jewelry that’s small and easy to hide. In general, barbells are the easiest to conceal. The low profile makes it less noticeable than a ring, and if you’re wearing tight clothes, the bar should nearly disappear. Try a barbell with small balls on the ends. [4] X Research source This might not work if your piercing is fresh. New nipple piercings cause erect nipples, which can highlight the jewelry itself, no matter how small. Curved barbells might be less visible due to their shape. If you’re fond of rings, stick to delicate, thin designs. Some minimalist styles are as beautiful as they are subtle."
    },
    {
      "title": "Use piercing retainers for a lowkey profile.",
      "content": "Use piercing retainers for a lowkey profile. Retainers are clear devices shaped like straight or curved barbells. Replacing your normal jewelry with a retainer won’t totally hide your piercing, but it will make your piercing more discreet. You cannot use retainers while the piercings are healing. Nipple piercings can take approximately 6 months to 1 year to fully heal. [5] X Research source"
    },
    {
      "title": "Remove your nipple piercing jewelry temporarily.",
      "content": "Remove your nipple piercing jewelry temporarily. Sometimes, the only solution is to remove the jewelry entirely. If you need to, take the bar or ring out and set it aside until a later date. While dressed, you won’t have to worry about finding strategic ways of hiding your piercing. Remember to reinsert the jewelry so the hole doesn’t close. Reinsert the jewelry within 2-3 days to keep the hole open. Every body heals at different speeds, so replace your jewelry sooner rather than later."
    }
  ]
}