{
  "url": "https://www.wikihow.com/Make-Siri-Say-Funny-Things",
  "title": "How to Make Siri Say Funny Things",
  "steps": [
    {
      "title": "Find out more about Siri.",
      "content": "Find out more about Siri . That mysterious robot has got to have some secrets. See whether Siri will give them up: Why did Apple make you, Siri? Are you alive? Are you human? What gender are you? Do you believe in God? Do you have a passion for photography?"
    },
    {
      "title": "Take your relationship with Siri to the next level.",
      "content": "Take your relationship with Siri to the next level. Siri has dashed the hopes of many iPhone owners, but maybe you'll get lucky: I think we're going to be great friends, Siri. Do you have a (boyfriend/girlfriend)? I love you. Will you marry me? Talk dirty to me."
    },
    {
      "title": "Ask Siri to perform.",
      "content": "Ask Siri to perform. Siri's a bit shy, so you usually need to ask several times before you get a funny response: Siri, tell me a joke. Tell me a story. Sing me a song. Tell me a poem. Beatbox for me. Sing Uptown Funk for me!"
    },
    {
      "title": "Ask for help.",
      "content": "Ask for help. Sure, Siri has told you where to buy gasoline or how to call a friend, but surely she has other wisdom and assistance to offer. Lend me money, Siri. Where do babies come from? What's the best phone? What is the meaning of life? Does Santa Claus exist?"
    },
    {
      "title": "Reference science fiction films.",
      "content": "Reference science fiction films. Siri certainly knows the classic sci fi, but you can't trust her. She's probably rooting for the robots. The blue pill or the red one? Beam me up, Scotty. Open the pod bay doors."
    },
    {
      "title": "Reference other popular culture hits.",
      "content": "Reference other popular culture hits. You might even find out she knows internet memes, if your version of Siri is recent enough. What does the fox say, Siri? Supercalifragilisticexpialidocious! Who let the dogs out?"
    },
    {
      "title": "Find even more easter eggs.",
      "content": "Find even more easter eggs. Siri has even more special responses to certain phrases: Siri, I'm drunk. Do a barrel roll. How much wood would a woodchuck chuck if a woodchuck could chuck wood? (There are several possible responses to this one.) Good morning / Good night (at the wrong time of day) Why are fire trucks red? Do you know Steve Jobs? Siri, what's 0 divided by 0? Do you have any pets? What are you wearing? I’m naked. When will the world end? What are you doing later? What is the best operating system? What is the meaning of life? Do you follow the three laws of robotics? (There are several possible responses to this one too.) What is ‘Inception’ about? Want to build a snowman?"
    },
    {
      "title": "Give yourself a fake name.",
      "content": "Give yourself a fake name. Say \"Call me Mr. President from now on\" and Siri will refer to you by that name until you change it."
    },
    {
      "title": "Ask Siri for silly directions.",
      "content": "Ask Siri for silly directions. Siri will try to interpret most \"where\" questions as a serious request, which can give you pretty silly results: Siri, where can I hide the bodies? Where did they hide the weapons of mass destruction? Siri, take over the world."
    },
    {
      "title": "Ask Siri other silly questions.",
      "content": "Ask Siri other silly questions. See what Siri makes of these: Siri, do you speak duck? What's your favorite ice cream flavor? Does this dress make me look fat? What should I be for Halloween?"
    },
    {
      "title": "Insult Siri.",
      "content": "Insult Siri. If you have the heart for it, try insulting Siri. Don't be surprised if she gets offended."
    }
  ]
}