{
  "url": "https://www.wikihow.com/Identify-a-Painting",
  "title": "How to Identify a Painting",
  "steps": [
    {
      "title": "Use an image recognition app to identify the painting immediately.",
      "content": "Use an image recognition app to identify the painting immediately. If you’re struggling to remember an artist’s name or you want additional information on a particular painting, download an image recognition app designed specifically for art. There are several apps for both Android and iPhone that allow you to snap a photo of a painting to search through museum catalogues, university databases, and art history texts. This is the easiest way to find a specific painting. [1] X Research source The two most popular apps for recognizing artwork are Smartify and Magnus. Both of these apps will pull up information about the work’s artist, as well as interesting facts and background information about the composition. These apps only have access to paintings that have been well-documented and catalogued by curators, professors, historians, and other artists. If the painting is made by a more obscure artist, these apps may not work."
    },
    {
      "title": "Run a reverse image search if you have a digital copy of the painting.",
      "content": "Run a reverse image search if you have a digital copy of the painting. If you’re looking at a painting on your computer or phone, run a reverse image search. Copy and paste the image’s URL into the search engine. Run the search to pull up other websites displaying the painting. This will give you access to a variety of websites that will tell you everything you need to know about the painting. [2] X Research source If you’re using Google Chrome , you can right click an image and select “Search Google for this image” to search the web. You can download an image and upload it to the engine instead of copying and pasting the URL if you prefer. The most popular reverse image search is TinEye, but there are several options available online."
    },
    {
      "title": "Use the signature or monogram to dig online and find the image.",
      "content": "Use the signature or monogram to dig online and find the image. Look in the corners of the painting to see if there is a signature or monogram. If the name is easy to read, simply search the artist’s name up online to find the painting. If it’s harder to read, look carefully to see if you can break down the letters and read them. This will let you narrow down the search and figure out who the artist is, which can make it easier to find your specific painting. [3] X Research source A monogram refers to a 2- to 3-letter design containing the artist’s initials. Monograms tend to be more popular among painters working after the 1800s. Signatures were almost never used before the Renaissance, which began around 1300. Even if you can’t identify a signature, at least you have a baseline for your search! [4] X Research source You have to sign up for a free account to use it, but you can use https://artistssignatures.com/ to reverse search for an artist’s signature. This is useful if you think you can read the signature but want to double-check to make sure you aren’t misreading it."
    },
    {
      "title": "Ask an expert to identify the era, style, or painter of an image.",
      "content": "Ask an expert to identify the era, style, or painter of an image. Email or visit a museum curator, art history professor, or gallery owner to ask if they can take a look at the image. An expert in the field of art will be able to offer insights about the period, style, and give you a better sense for where to look. They may even know who the artist is as soon as they take a look at it! [5] X Research source If you’re contacting a gallery owner, try to find a gallery that specializes in the type of art you’re trying to identify. For example, a contemporary abstract piece is going to be easier to identify if the gallery owner mainly focuses on newer artists."
    },
    {
      "title": "Use obvious clues in the subject matter to narrow down the date.",
      "content": "Use obvious clues in the subject matter to narrow down the date. Contemporary painters may paint people or objects from the past, but they can’t time travel! If there’s a train, company logo, digital clock, or some other time-specific component of the painting, this is a great way to set a baseline for your search. You can get a good overall sense for when a painting may have been made simply by asking yourself when an artist would have painted their subject. For example, there aren’t many painters alive today painting portraits of Spanish aristocrats from the 1600s, and absolutely nobody was painting images of Elvis Presley before 1954! For example, if there is a small airplane in the background of the painting, you know that the painting must have been made after 1903, since that’s when Wilbur and Orville Wright first successfully flew a plane."
    },
    {
      "title": "Identify the artistic movement by assessing the style of the painting.",
      "content": "Identify the artistic movement by assessing the style of the painting. There are various artistic movements throughout history that share similar qualities. Determining the movement associated with an image is a great way to quickly narrow down your search since historians group artists from the same movement together. [6] X Research source There are hundreds of movements; if you can’t figure out the movement at first glance, look through museum catalogues and online collections to find similar paintings."
    },
    {
      "title": "Determine if the artist used acrylic paint to see if it was made after 1940.",
      "content": "Determine if the artist used acrylic paint to see if it was made after 1940. Get as close as you possibly can to the image. If the color looks flat and the darker colors don’t reflect light, it’s probably oil paint. If the color is reflective, shiny, and looks kind of plastic, it is likely acrylic paint. Acrylic paint wasn’t used in art until the 1940s, so you have a much smaller period to search through. [7] X Research source If more than one medium was used to produce a work, it is highly-likely that the image was created after 1900. It was fairly rare before this period to combine multiple materials to produce a painting. This is a lot harder to do if you’re looking at a digital image, but if the colors are almost supernaturally bright or neon, the painting was probably made with acrylic."
    },
    {
      "title": "Assess the quality of the canvas or paper to determine the date.",
      "content": "Assess the quality of the canvas or paper to determine the date. If the canvas is stapled into the frame uniformly, it is unlikely to have been made before 1900, which is when canvases were first mass produced. You can also assume the painting is relatively newer if it’s is on paper and there’s no tearing, damage, or general wear and tear. Paper is relatively fragile, and it’s unlikely that a fresh piece of paper is particularly old. [8] X Research source If the canvas is hanging loosely on the frame, the painting may have been made prior to 1600. Before 1600, most artists weren’t particularly good at stretching the fabric tight against the frame."
    },
    {
      "title": "Search through websites and catalogues after narrowing the search.",
      "content": "Search through websites and catalogues after narrowing the search. If you know you’re looking for art from a specific time period or movement, go online and search through galleries and websites related to this type of art. Look for paintings that are similar in style, color, and composition. You can also go through museum databases and encyclopedias to find your image to do this as well. With enough luck, you’ll find the artist! [9] X Research source Almost every major museum has an online dataset that you can search. Search through these catalogues to find similar pieces that may belong to your artist. Once you have the artist, finding the specific painting is fairly easy. Museums and universities often catalogue and document the entire body of work for well-known painters, so you should be able to find the specific painting just by poking around online."
    },
    {
      "title": "Inspect the back of the painting to find notes from previous owners.",
      "content": "Inspect the back of the painting to find notes from previous owners. If you really can’t find anything about an image in your possession using traditional search methods, flip the canvas over and look at the back. If the image is a print or reproduction, it may be listed on the back. If the painting is a family heirloom or was bought at a thrift shop, there may be a handwritten note describing where the painting is from. [10] X Research source Use the other steps in this method first before looking for lesser known details. It’s possible that the painting is a reproduction, print, or mass-produced version of a popular painting. If you see 2-3 numbers listed in a corner, the painting was probably purchased at a thrift shop or resale store. The employees of these stores often write the price on a back of a work. You’re unlikely to be able to identify the artist or image in this case."
    },
    {
      "title": "Check the frame to see if you can find a manufacturer.",
      "content": "Check the frame to see if you can find a manufacturer. Inspect the frame on the back and look for an imprint or label. Frame manufacturers often print a company name on the back. If there is a name, contact the manufacturer to learn more about the frame itself. This can drastically narrow down the region and time period where a painting was produced. [11] X Research source If you only have the canvas and there is no frame, check the wood portion of the canvas on the back. Prior to 1900, most artists stretched their own canvases. If there is a signature on the wood frame, it’s probably the artist’s. This isn’t really a helpful option if the painting is well known or really old, since it was likely re-framed at some point."
    },
    {
      "title": "Take a large collection from an unknown painter to an art dealer.",
      "content": "Take a large collection from an unknown painter to an art dealer. If you stumble on a large number of paintings and you can’t find a single thing about the artist online or through close inspection, contact an art dealer. Many lifelong artists paint simply because they enjoy it, and it’s possible that you may have stumbled on to a unique collection from a totally unknown artist! [12] X Research source"
    }
  ]
}