{
  "url": "https://www.wikihow.com/Make-Jello",
  "title": "How to Make Jello",
  "steps": [
    {
      "title": "Sprinkle the gelatin over ¼ cup (60 milliliters) of cold water and stir.",
      "content": "Sprinkle the gelatin over ¼ cup (60 milliliters) of cold water and stir. Pour the cold water into measuring cup, then sprinkle the gelatin over it. Stir it briskly until the gelatin thickens. If you are vegan/vegetarian and would like a more firm jello, use 2 teaspoons of Agar powder. You can also use 2 ounces of carrageenan instead. [2] X Research source"
    },
    {
      "title": "Stir in ¼ cup (60 milliliters) of hot water.",
      "content": "Stir in ¼ cup (60 milliliters) of hot water. The water should be very hot, but not yet boiling. This will soften the gelatin and make it more liquidy. Don't worry, the jello will thicken back up again."
    },
    {
      "title": "Add 1½ cup (350 milliliters) of fruit juice.",
      "content": "Add 1½ cup (350 milliliters) of fruit juice. You can use just one type of fruit juice, or you could use two different types of fruit juice for a more unique flavor. Apple, grape, orange, or pineapple juice are all great options. [3] X Research source Take caution when using pineapple juice. Some people find that the enzymes in it prevent the jello from setting properly. Give the jello a taste. If it is not sweet enough for you, add some sweetener, such as agave, sugar, or stevia."
    },
    {
      "title": "Pour the mixture into your desired mold and add some fruit, if desired.",
      "content": "Pour the mixture into your desired mold and add some fruit, if desired. Just about any type of fruit goes well in jello, including blueberries, orange slices, pineapple, and strawberries. [4] X Research source After you add the fruit, give it a quick stir. If you want to cut the jello into cubes or fun shapes, pour the jello into a 9 by 12 inch (22.86 by 30.48 centimeters) or 8 by 8 inch (20.32 by 20.32 centimeters) baking pan. If you'd like to add fruit to a fancy mold, fill the mold with ½ inch (1.27 centimeters) of the jello mixture first, then add the fruit. Fill the mold the rest of the way with the rest of the jello mixture; don't stir. This will help create a nicer design."
    },
    {
      "title": "Cover the jello, then refrigerate it for at least 2 to 3 hours.",
      "content": "Cover the jello, then refrigerate it for at least 2 to 3 hours. You can also leave it there overnight. You can test whether or not the jello is ready by pressing your finger gently against it. If the jello sticks to your finger, it's not ready and needs to be refrigerated longer. If your finger comes out clean, the jello is ready."
    },
    {
      "title": "De-mold the jello and serve.",
      "content": "De-mold the jello and serve. You can serve the jello as it is, or with a dollop of whipped cream. [5] X Research source You can also garnish it with extra fruit as well. If you chilled the jello in a baking pan, cut it into cubes or use a cookie cutter to make some fun shapes. If you chilled the jello in a bowl, consider using a melon scoop to make little jello-balls. If you chilled the jello in a fancy mold, dip the mold in warm water all the way up to the rim. Wait 10 seconds, then flip the jello out onto a dish. If it doesn't slide out easily, repeat."
    },
    {
      "title": "Whisk together 1 cup (240 milliliters) of hot water with 1 packet of jello in a large bowl.",
      "content": "Whisk together 1 cup (240 milliliters) of hot water with 1 packet of jello in a large bowl. Keep whisking until no powdery granules remain, about 2 to 3 minutes. If you are using a larger, 6-ounce (170 grams) packet of jello, use 2 cups (475 milliliters) of hot water instead. This recipe uses the sweetened, flavored jello packets. If you are working with regular gelatin, click here to learn how to make jello from scratch."
    },
    {
      "title": "Add 1 cup (240 milliliters) of cold water into the mixture.",
      "content": "Add 1 cup (240 milliliters) of cold water into the mixture. If you'd like to make the jello set faster, use enough ice cubes to fill 1 cup (240 milliliters). Keep in mind that the jello will start to set up rapidly, so you will need to work quickly. If you are using a larger, 6-ounce (170 grams) packet of jello, use 2 cups (475 milliliters) of cold water."
    },
    {
      "title": "Pour the mixture into your desired mold and add some fruit, if desired.",
      "content": "Pour the mixture into your desired mold and add some fruit, if desired. Once you add the fruit, give the jello a quick stir to disperse the fruit. You can use a baking pan, a bowl, or even a fancy jello mold. You can also use any type of fruit you'd like. Grapes, berries, and orange pieces are great choices! If you are using a baking pan, choose one that is 9 by 12 inches (22.86 by 30.48 centimeters) or 8 by 8 inches (20.32 by 20.32 centimeters). This is great if you plan to cut the jello into fun shapes using cookie cutters. If you are using a fancy jello mold and would like to add some fruit, fill the mold with ½ inch (1.27 centimeters) of jello first, then add your desired fruit. Fill the mold the rest of the way with more jello; don't stir the fruit. This will give you a pretty design at the top of the mold."
    },
    {
      "title": "Place into the refrigerator and wait until it sets, at least 2 to 3 hours.",
      "content": "Place into the refrigerator and wait until it sets, at least 2 to 3 hours. Depending on how cold your fridge is and how much jello you made, this can take overnight. You can test if the jello is ready by pressing your finger against it. If the jello sticks to your finger, it's not ready. If it doesn't stick to your finger, it's ready."
    },
    {
      "title": "De-mold the jello and transfer it to a serving plate.",
      "content": "De-mold the jello and transfer it to a serving plate. Dip the mold all the way up to its rim in warm water. Wait 10 seconds, then flip the jello out of its mold and onto a plate. If it doesn't come out easily, dip the mold into warm water for another 10 seconds. If you poured the jello into individual bowls, you don't have to de-mold it. If you poured the jello into a baking pan, you can cut it into cubes, or use cookie cutters to make fun shapes. If you are having trouble getting the shapes out, dip the bottom of the pan into warm water for 10 seconds. If you poured the jello into a large bowl, you can scoop it out using a melon scoop to make little jello balls. Serve the jello balls in a separate bowl."
    },
    {
      "title": "Serve the jello.",
      "content": "Serve the jello. You can serve it as is, or garnish it with some whipped cream or pieces of fruit."
    }
  ]
}