{
  "url": "https://www.wikihow.com/Get-over-a-Crush-on-Your-Boss",
  "title": "Crush on Your Boss? Here's How to Handle It Professionally",
  "steps": [
    {
      "title": "Acknowledge your feelings.",
      "content": "Acknowledge your feelings. The first step is to admit to yourself how you feel about your boss. Keep in mind that this is completely different from telling your boss how you feel. The point is to admit to yourself that you're attracted so you can figure out your next steps. [1] X Research source For instance, you might think, \"I'm starting to develop feelings for Nadia. She's so funny and charismatic.\""
    },
    {
      "title": "Keep things professional.",
      "content": "Keep things professional. It's usually best to not act on your feelings for your boss. [2] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 27 October 2021. It's completely understandable to crush on your boss—you might have common interests, you spend a lot of time together, etc. However, dating your boss is not always a good idea. You might lose your job or the respect of your colleagues, so take this time to focus on yourself. [3] X Research source For instance, you might realize you're attracted to certain qualities in a person. If you focus on meeting new people and developing relationships, you may meet people who have similar qualities."
    },
    {
      "title": "Confide in a friend.",
      "content": "Confide in a friend. Talking it out with someone you trust can help you get those bottled up feelings out. [4] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 27 October 2021. Choose a good friend who has your best interests at heart and tell them how you feel about your boss. It can be good to talk about how you feel with someone outside of your workplace, and your friend can give you honest feedback. [5] X Research source"
    },
    {
      "title": "Avoid talking about your boss with your co-workers.",
      "content": "Avoid talking about your boss with your co-workers. Stick to talking about business or your own life. It's easy to casually ask about your boss, especially their personal life, but try not to do this. If you're trying to get over your feelings, don't tell your co-workers how much you're interested in your boss or they may keep bringing it up with you. It's fine to let your co-workers know that you're interested in starting a relationship—just don't tell them you like the boss."
    },
    {
      "title": "Minimize contact with your boss.",
      "content": "Minimize contact with your boss. Because dating your boss generally isn't a good idea, give yourself space while at work. This can be hard if you work with a small staff and you see your boss frequently during the day, but try to stay away from them. Don't drop by their office to chat or hang out in the breakroom if they're in there. If it's not possible to do this, keep your interactions really brief. [6] X Research source For example, if a group of you are going out after work and you know your boss will be there, make up an excuse not to go."
    },
    {
      "title": "Ignore your boss on social media.",
      "content": "Ignore your boss on social media. Looking at your boss's socials may only end up leading to further temptation. Unfollow them and stop checking their posts. Sure, it's fun to check and see what your boss does in their free time, but this can lead to obsessing over them or fantasizing about involving yourself in their life. To make it easier on yourself, don't follow them online, send them messages, or like their content. It's really easy to send flirty messages on social media so remove this temptation and don't interact virtually."
    },
    {
      "title": "Remind yourself of the consequences.",
      "content": "Remind yourself of the consequences. Think of all the problems that a relationship could cause. [7] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 27 October 2021. Dating your boss might be something you're fantasizing about, but being realistic can throw cold water on your passion. To separate fantasy from reality, run through the consequences of dating your boss. You could lose your job or the respect of your co-workers. Colleagues might treat you differently or resent you. Plus, if the relationship doesn't work out, they'll probably still be your boss. [8] X Research source If you're currently in a relationship, ask yourself if you're feeling neglected or unhappy. Sometimes, developing a crush means that you need to focus more on improving your current relationship. If you or your boss is married or currently dating someone else, consider if a relationship is worth a breakup, especially if either of you has kids. Be aware that this would make you the other man or woman in a new relationship."
    },
    {
      "title": "Distract yourself.",
      "content": "Distract yourself. Focus on your work or pick up a new skill. If you can't stop thinking about your boss, do something that's mentally challenging. This might mean throwing yourself into a big work project that your boss isn't directly involved in, taking a class, or volunteering. It's also a great chance to catch up on tasks you've been putting off. Distractions can be fun! Sign up for a class that you've always wanted to take or join a fitness group. Make plans to travel or read books you've put off. Reader Poll: We asked 897 wikiHow readers what’s the longest a crush has lasted for them, and 60% of them said over a year. [Take Poll] It can be hard to get over someone you’ve liked a long time, especially when you see them every day. Try to focus on more productive thoughts so you’re not constantly thinking about your crush."
    },
    {
      "title": "Meet new people.",
      "content": "Meet new people. Ask to go on double-dates or hang out at social places. Your friends or colleagues might be able to introduce you to people. Sometimes, just mixing with new people can put a damper on your crush. For instance, you might really hit it off with someone you meet at a concert or bar. [9] X Research source You can hang out with old friends, too! The point is to get social and spend time not thinking about your boss."
    },
    {
      "title": "Talk with a counselor or therapist.",
      "content": "Talk with a counselor or therapist. Reach out to a mental health professional if you're obsessing. [10] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 27 October 2021. If you've tried to get over your feelings but they're getting stronger and affecting your life, talk to a professional. They may be able to help you see why you're fixating on your boss. It might be that you're attracted to specific qualities they have and, if you realize this, you can look for those traits in another person. Although it's drastic, you might consider looking for a new job if you really don't think you can comfortably work around your boss anymore."
    },
    {
      "title": "Having a romantic interest in a supervisor is common.",
      "content": "Having a romantic interest in a supervisor is common. If you think about it, most of us spend more time awake at our jobs than we spend in our own homes; therefore, it's only natural to develop feelings for someone you're around constantly. However, it's crucial to carefully consider the potential complications before pursuing a workplace relationship. While office romances may work when built on mutual respect, authenticity, and emotional maturity, it's important to approach such situations with caution."
    },
    {
      "title": "Keep company policies in mind.",
      "content": "Keep company policies in mind. Companies typically have policies addressing employee relationships with supervisors. These guidelines are commonly outlined in employee handbooks, contracts, or broader compliance regulations. If you need to learn more, company policies on \"workplace relationships\" or \"conflicts of interest\" are the best reference sources. [11] X Research source"
    },
    {
      "title": "Your boss may like you, too.",
      "content": "Your boss may like you, too. If there has been workplace flirting between you and your supervisor, it could be a sign that they like you , too. However, this isn't necessarily a good thing. Workplace romances can be complicated, as organizations often prohibit relationships between supervisors and subordinates. If a workplace crush is reciprocated, the involved parties may have to resign or transfer, which can disrupt high-performing teams, undermine morale, and derail the careers of one or both of you. Signs your boss likes you include: Giving you preferential treatment. Seeking your opinion before other coworkers'. Protecting you from negative consequences. Scheduling frequent one-on-one meetings with you. Inviting you to do things outside of work. Flirting, getting close to you physically, touching or brushing up against you, or making excuses to talk to you."
    },
    {
      "title": "A work crush may impact your professional image.",
      "content": "A work crush may impact your professional image. Developing a romantic crush on your boss can jeopardize professional relationships in the workplace. Colleagues may perceive such a crush as inappropriate, immature, and a distraction from the team's objectives. Consequently, it could impair your productivity and ability to communicate with your boss in a professional manner. Workplace crushes can spark unfounded rumors or exaggerate the facts. Even if your boss is unaware of your feelings, they may be perceived as inappropriate, making them the subject of office gossip as well."
    },
    {
      "title": "Rejection is possible.",
      "content": "Rejection is possible. Confessing a crush on your boss is extremely risky. While every situation is unique, the potential consequences can be severe. If your advances are rejected, your boss may file a harassment complaint--even if harassment was unintentional. Such complaints, if found valid, can lead to job loss and damage your career, no matter your intentions. Therefore, great caution is advised before revealing romantic feelings towards a supervisor. [12] X Research source"
    },
    {
      "title": "Leaving your job may need to happen if feelings aren't resolved.",
      "content": "Leaving your job may need to happen if feelings aren't resolved. A crush on a boss often leads to one person leaving their job. This may happen if the working relationship becomes unsustainable, the work environment and office gossip become overly distracting, or the crush develops into an actual romantic relationship between the two of you."
    }
  ]
}