{
  "url": "https://www.wikihow.com/Kickflip-on-a-Tech-Deck",
  "title": "How to Kickflip on a Tech Deck",
  "steps": [
    {
      "title": "Begin by placing your fingers on the board in the starting position.",
      "content": "Begin by placing your fingers on the board in the starting position. Many tricks begin with the index finger placed right behind the front wheels and the middle finger slightly behind the back wheels. Become comfortable with your fingers in this position as it will be the standard finger position for most tricks, such as the Ollie, Kickflip, Heelflip and Impossible."
    },
    {
      "title": "Start by rolling the board to your left.",
      "content": "Start by rolling the board to your left. This will be the direction that you will go to do the kickflip. Roll the board back and forth at different speeds. Go slowly at first so that you can get comfortable with the board's movement. Ideally, you want some speed in order to get your board into the air but first you need to make sure your fingers have a good control of the board when it's in motion."
    },
    {
      "title": "Pop the tail of the board down onto the table.",
      "content": "Pop the tail of the board down onto the table. As you roll the board, press down with your middle finger on the tail to hit it against the table. This brings the nose of the board into the air. Continue to roll the board back and forth but now practice adding the pop. Keep practicing these basic movements at a slower speed and gradually get faster. You want these first steps to be fluid so that you can concentrate next on flipping the board."
    },
    {
      "title": "Roll the board to your left and pop the nose down to get your board into the air.",
      "content": "Roll the board to your left and pop the nose down to get your board into the air. The board should be a few inches off of the table so that there is room for the board to rotate. These inches of air will give you time and space to complete the flip. With each practice run, bring your hand a little higher each time to pull the board up higher into the air. [1] X Research source"
    },
    {
      "title": "Slide your index finger toward the nose of the board when it's in the air.",
      "content": "Slide your index finger toward the nose of the board when it's in the air. As your board moves through the air to the left your index finger will also move to the left. You want to transition smoothly with your index finger because a harsh flick can cause you to lose control of the board. Also, aim your finger toward the pocket of the nose. The \"pockets\" of the nose and tail are the indentations on the board where it begins to bend upwards. Aiming for this spot every time you practice a kickflip will help you become more consistent and accurate."
    },
    {
      "title": "Put pressure on the side of the board closest to you while sliding toward the nose.",
      "content": "Put pressure on the side of the board closest to you while sliding toward the nose. This slight pressure with your index finger on the edge of the board will cause it to twist toward you while in the air. This is the key step to completing the kickflip. The slight pressure from your index finger is what controls the rotation of the board. If you flick too hard the board will spin out of control and if you're touch is too light then the board will not flip at all. [2] X Research source"
    },
    {
      "title": "Catch the board in the air after completing the flip.",
      "content": "Catch the board in the air after completing the flip. After the board rotates, place both fingers on the board to stop its rotation mid-air. Focus on the board itself so that you can land your fingers on the top of the deck. You can either let the board rotate once and then catch it or you can master flipping the board several times within the kickflip for a more impressive trick. [3] X Research source"
    },
    {
      "title": "Guide the board back to the table with your fingers.",
      "content": "Guide the board back to the table with your fingers. You don't have to let gravity bring the board back to the table. In fact, you want to use your fingers to direct the board back down rather than letting it drop. This requires more practice but will keep you in control of the board from start to finish."
    },
    {
      "title": "Finish the landing by continuing to roll the board forward after landing.",
      "content": "Finish the landing by continuing to roll the board forward after landing. You'll want to get into the habit of following through with your tricks. Don't just stop short after completing the trick but keep the board moving afterwards. This will train you to be able to link tricks one after another so that you have an impressive repertoire of fingerboard moves."
    },
    {
      "title": "Start out going slow.",
      "content": "Start out going slow. Trying to blow through the steps at the beginning might cause you to lose control of the board. Take the time to pace yourself. Going slowly at first will help you develop good technique with the board."
    },
    {
      "title": "Repeat each step multiple times before continuing on to the next.",
      "content": "Repeat each step multiple times before continuing on to the next. The best way to become good at something is to build muscle memory. This will require you to spend time doing the same thing over and over. However, practicing the same thing over and over is athletes and skilled musicians become professionals, and you can apply this technique to your fingerboarding skills. Practicing over and over will also help you develop good habits for this trick rather than sloppy habits. [4] X Research source"
    },
    {
      "title": "Add speed.",
      "content": "Add speed. Now that you are comfortable going slowly, you can gradually go faster and faster with the kickflip. It's best to practice going a little faster each time you try the trick rather than going fast right away. Your fingers will become used to going faster this way and you will be more accurate doing a kickflip at any speed."
    }
  ]
}