{
  "url": "https://www.wikihow.com/Improve-Under-Eye-Skin",
  "title": "How to Improve Under Eye Skin",
  "steps": [
    {
      "title": "Work with a doctor to determine the reason for your dark circles.",
      "content": "Work with a doctor to determine the reason for your dark circles. The most effective treatment for under-eye discoloration will depend on what’s causing the issue. Your primary care doctor or dermatologist can help you determine the treatment that’s right for you. Common causes include: [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Allergies Dermatitis Fatigue Irritation around the eyes due to rubbing or scratching Sun damage Water retention Thinning of the skin due to aging A hereditary predisposition to under-eye hyperpigmentation (especially common in people of color)"
    },
    {
      "title": "Avoid rubbing your eyes to prevent irritation and discoloration.",
      "content": "Avoid rubbing your eyes to prevent irritation and discoloration. Rubbing or scratching your eyes a lot can cause irritation and rupture tiny blood vessels under your eyes, leading to dark circles or blotches. If you’re a chronic eye-rubber, you could eventually develop a condition called lichen simplex chronicus (LSC), which causes the skin to become thickened and dark. [2] X Research source Avoiding the temptation to touch your eyes can help improve their health and appearance. If you can’t stop rubbing your eyes, talk to your doctor or dermatologist about how to break the habit. Your doctor might also be able to help identify and treat any underlying conditions that are causing you to rub or scratch your eyes a lot, such as eczema or chronic dry eye."
    },
    {
      "title": "Use cold compresses to shrink dilated blood vessels.",
      "content": "Use cold compresses to shrink dilated blood vessels. In some cases, dark circles may be caused by dilated blood vessels under your eyes. Because the skin under the eyes is so thin, these vessels under the surface of the skin show through, causing a bluish tint. Chill a metal spoon in the fridge or wrap a bag of frozen peas in a soft washcloth and hold it against your under-eye skin for about 10 minutes to constrict the vessels. You can also use cooled green tea bags. [3] X Research source"
    },
    {
      "title": "Take antihistamines or nasal steroids to fight dark circles caused by allergies.",
      "content": "Take antihistamines or nasal steroids to fight dark circles caused by allergies. Seasonal or environmental allergies can cause puffiness and dark circles under the eyes. If your under-eye circles are being caused by an allergy, try an over-the-counter allergy medication or talk to your doctor about getting a prescription medication to combat your symptoms."
    },
    {
      "title": "Take a shower before you go to bed at night.",
      "content": "Take a shower before you go to bed at night. Showering before bed can help clear your nasal passages, which can reduce allergies and under-eye puffiness. While you're in the shower, rinse your face off to clear any debris around your eyes that could irritate them."
    },
    {
      "title": "Get plenty of sleep to make dark circles stand out less.",
      "content": "Get plenty of sleep to make dark circles stand out less. When you don’t get enough sleep, your skin may appear pale or washed-out. This can enhance the appearance of dark circles under your eyes. Reduce under-eye circles by making sure you get 7-9 hours of sleep every night. [4] X Research source"
    },
    {
      "title": "Apply retinoid creams to boost collagen and reduce pigmentation.",
      "content": "Apply retinoid creams to boost collagen and reduce pigmentation. Retinoids can combat dark circles in a couple of different ways. Retinoids cause discolored or hyper-pigmented skin to slough off, and encourage the growth of new skin. They can also boost collagen production and make blood vessels under your skin less visible. [5] X Research source Talk to your doctor about using retinoids or retinoic acid creams to reduce the appearance of dark circles under your eyes. Since retinoids can cause irritation, take care not to over-use these products on the delicate skin around your eyes. Your doctor may suggest gradually increasing the amount you use over several weeks, so that your skin can build up a tolerance for it."
    },
    {
      "title": "Try a skin-lightening cream to reduce excessive pigmentation.",
      "content": "Try a skin-lightening cream to reduce excessive pigmentation. If your dark circles are caused by hyperpigmentation, a skin-lightening agent such as hydroquinone or Kojic acid may be effective. Ask your dermatologist to prescribe or recommend a lightening cream. Follow the package directions or your dermatologist’s instructions for use. Some skin-lightening agents, such as Tri-Luma cream, also contain retinoids and steroids to help reduce inflammation and boost collagen production."
    },
    {
      "title": "Get a chemical peel to strip away discolored skin.",
      "content": "Get a chemical peel to strip away discolored skin. Like retinoids, chemical peels work by sloughing off hyper-pigmented skin. Your dermatologist may recommend a glycolic acid peel, or a peel supplemented with retinoids or lightening agents. Since the skin under and around your eyes is very delicate, do not try using an at-home chemical peel for this purpose. Have your doctor, dermatologist, or a cosmetic skin care professional do the peel."
    },
    {
      "title": "Treat under-eye discoloration with laser treatments.",
      "content": "Treat under-eye discoloration with laser treatments. IPL (intense pulsed light) laser treatments are an effective treatment for many forms of stubborn under-eye discoloration, including spider veins and pigmentation caused by sun damage. IPL treatments can also reduce sagging and stimulate collagen production. Laser treatments may cause temporary irritation and swelling, and in some cases may cause the skin under your eyes to become temporarily darker. In rare cases, infection or scarring may occur. Talk to your doctor about whether you are a good candidate for IPL treatments."
    },
    {
      "title": "Ask your doctor about fillers if you have under-eye depressions.",
      "content": "Ask your doctor about fillers if you have under-eye depressions. Some dark circles are caused by deep troughs or hollows under the eyes, which can create shadows and allow veins under the skin to show through. These under-eye depressions may be caused by genetics, weight loss, or aging. Talk to your doctor or dermatologist about treating under-eye depressions with a hyaluronic acid filler. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If used incorrectly, hyaluronic acid fillers may cause damage to the area around the eye or create a puffy appearance. Talk to your doctor about the risks and benefits of this treatment."
    },
    {
      "title": "Protect your eyes from sun damage to prevent wrinkles.",
      "content": "Protect your eyes from sun damage to prevent wrinkles. Sun damage is one of the leading causes of early skin aging. Protect the delicate skin under your eyes by wearing sunglasses and wide-brimmed hats. [7] X Research source Gently apply sunscreen to the skin under your eyes before you go outside. Look for sunscreens that are designed to be used on the sensitive skin around your eyes. [8] X Research source"
    },
    {
      "title": "Moisturize your under-eye skin to reduce the appearance of wrinkles.",
      "content": "Moisturize your under-eye skin to reduce the appearance of wrinkles. Moisturizers mask the appearance of lines and wrinkles by plumping up your skin cells and making your skin more elastic and supple. [9] X Research source Choose moisturizing creams specifically formulated for eyes to avoid irritating the sensitive skin under and around your eyes."
    },
    {
      "title": "Avoid smoking to keep your skin healthy.",
      "content": "Avoid smoking to keep your skin healthy. Nicotine impairs blood flow to the skin, causing premature wrinkles. If you smoke, you can improve the appearance of your skin and prevent new wrinkles from developing by cutting back or quitting altogether. [10] X Trustworthy Source DermNet NZ Online clinical resource website written and run by dermatologists providing evidence-based information about dermatology and skin health Go to source Work with your doctor to develop a plan to help you quit ."
    },
    {
      "title": "Eat a diet rich in antioxidants and drink lots of water to keep your skin youthful.",
      "content": "Eat a diet rich in antioxidants and drink lots of water to keep your skin youthful. The relationship between diet and wrinkles is still unclear, but eating foods high in antioxidants may help slow skin aging and prevent the development of wrinkles. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To keep under-eye wrinkles at bay, eat a balanced diet rich in fresh fruits and vegetables. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Ask your dermatologist to recommend anti-wrinkle creams.",
      "content": "Ask your dermatologist to recommend anti-wrinkle creams. Anti-wrinkle creams, such as retinol creams or creams containing coenzyme Q10 (CoQ10), may be effective for reducing and preventing under-eye wrinkles. [13] X Research source Ask your doctor or dermatologist to recommend a cream that is safe and effective for under-eye use. When applying under-eye creams, gently dab the cream on instead of rubbing it in. Rubbing can irritate the skin and create new wrinkles."
    },
    {
      "title": "Determine the cause of your under-eye bags.",
      "content": "Determine the cause of your under-eye bags. The skin under your eyes can become saggy or puffy for a variety of reasons. The most effective treatment will depend on the cause of the issue. Talk to your doctor or dermatologist to determine the most likely cause and develop a treatment plan. Common causes include: [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Natural loss of elasticity due to aging. As you age, the skin under your eyes becomes less elastic, and fat deposits around the eye may migrate to the area under the lower eyelid. Fluid retention (edema) due to hormonal changes, heat and humidity, poor sleeping habits, or too much sodium in your diet. Allergies or dermatitis. Hereditary factors."
    },
    {
      "title": "Apply a cool compress to calm inflammation.",
      "content": "Apply a cool compress to calm inflammation. Cooling the skin around your eyes can help reduce inflammation. Wet a clean, soft washcloth with cold water, and place it on the skin under your eyes for about 5 minutes, using gentle pressure. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Establish good sleeping habits to prevent under-eye fluid buildup.",
      "content": "Establish good sleeping habits to prevent under-eye fluid buildup. Lack of sleep can contribute to under-eye puffiness. Get 7-9 hours of sleep every night to reduce under-eye bags. Keeping your head elevated while you sleep can prevent fluid from pooling under your eyes, so use a thick pillow or a mattress with an elevated head end. [16] X Research source"
    },
    {
      "title": "Exercise every day to help reduce under-eye bags.",
      "content": "Exercise every day to help reduce under-eye bags. Exercising will increase the circulation in your body and combat water retention, both things that will decrease the appearance of under-eye bags and puffiness. Try to get in 30 minutes of exercise each day."
    },
    {
      "title": "Treat allergies that may be causing under-eye puffiness.",
      "content": "Treat allergies that may be causing under-eye puffiness. Allergies can cause puffiness or bags by inflaming the tissues under your eyes. Try using over-the-counter allergy medications, or ask your doctor to prescribe an allergy treatment. Reduce your exposure to the allergen as much as possible. [17] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Get surgery to correct severe under-eye bags.",
      "content": "Get surgery to correct severe under-eye bags. If your under-eye bags are unresponsive to other treatments and are causing you a lot of stress or discomfort, talk to your doctor about surgical options. They may recommend blepharoplasty, a surgical procedure in which the skin under the eye is lifted and tightened. [18] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Risks of blepharoplasty include eye infections, dry eyes, vision problems, and dislocation of the tear ducts or eyelids. Less invasive options include laser resurfacing and chemical peels, which may help tighten the skin under the eyes to reduce the appearance of bags."
    },
    {
      "title": "Apply an under-eye cream to lock in moisture.",
      "content": "Apply an under-eye cream to lock in moisture. Moisturizers help treat and prevent dryness by sealing moisture into your skin. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If your skin gets dried out easily, incorporate an under-eye moisturizer into your daily routine. Look for a gentle moisturizer without dyes or perfumes that is safe to use on the delicate skin around your eyes."
    },
    {
      "title": "Limit exposure to hot water to keep your skin from drying out.",
      "content": "Limit exposure to hot water to keep your skin from drying out. Washing your face with hot water can contribute to dryness. If you have problems with dry skin under your eyes, try washing your face with cool or lukewarm water. Avoid hot showers, and limit your time in the shower to 10 minutes or less when you can. [20] X Research source"
    },
    {
      "title": "Use gentle facial cleansers to prevent dryness and irritation.",
      "content": "Use gentle facial cleansers to prevent dryness and irritation. Harsh soaps and detergents may dry out and irritate the skin under your eyes. [21] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Ask your dermatologist to recommend a cleanser that will not dry out your under-eye skin."
    },
    {
      "title": "Talk to your doctor about treating skin conditions that cause dry eyelids.",
      "content": "Talk to your doctor about treating skin conditions that cause dry eyelids. If your under-eye skin and eyelids are very dry, flaky, red, or itchy, there may be an underlying condition causing these symptoms. Make an appointment with your doctor to determine what might be causing your dry eyelids and develop an appropriate treatment plan. Common causes include: [22] X Research source Allergies, often caused by beauty products Eczema or atopic dermatitis Blepharitis (usually caused by a buildup of bacteria along the eyelashes) [23] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source"
    }
  ]
}