{
  "url": "https://www.wikihow.com/Live-with-Both-IBS-and-GERD",
  "title": "How to Live with Both IBS and GERD",
  "steps": [
    {
      "title": "Know and avoid your trigger foods.",
      "content": "Know and avoid your trigger foods. Although completely separate conditions, both IBS and GERD come with a set of trigger foods. These may vary from person to person, but it's essential that you're aware of your trigger foods and you avoid them. If you're not fully sure what foods set off your symptoms, start a food/symptom journal. Write down everything you eat, the symptoms that follow and the severity of the symptoms. Review your journal and see if you can make any connections. For example, after your morning coffee you have heartburn, cramping and diarrhea . Or after eating spicy foods, you have abdominal cramps and heartburn. Make a list of your trigger foods and keep this with you. That way, when you're grocery shopping or going out to eat, you have a list of what you should be avoiding. Common trigger foods include: alcohol, caffeine, carbonated beverages, spicy foods, fatty foods, chocolate, garlic, onions, tomato-based foods (like pizza sauce) and acidic foods (like citrus fruits)."
    },
    {
      "title": "Eat regular and consistent meals.",
      "content": "Eat regular and consistent meals. With both GERD and IBS it's important to be as consistent with your meals and eating times as possible. The more consistent you are, the more predictable your symptoms will be. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Do not skip meals or leave long periods of time in between meals. Try to eat every three to five hours during the day. You may need to pack meals or snacks so that you have something with you at all times. Keep meal sizes the same, too. Eating larger meals may overwhelm your GI system and cause reflux, bloating, abdominal cramping, diarrhea or constipation. Also consider eating smaller meals in general. This helps prevent reflux from occurring."
    },
    {
      "title": "Aim for a well-balanced diet.",
      "content": "Aim for a well-balanced diet. A well-balanced diet is essential to the management of both IBS and GERD. Work to include a variety of foods into your diet to help keep your body health and reduce symptoms. Even though some healthy and nutritious foods may cause symptoms (like citrus fruits or tomatoes), it's still essential that you focus on eating a variety of foods. This type of diet helps ensure that you're getting a wide variety of nutrients and will help prevent any nutrient deficiencies. A well-balanced diet is one that features foods from every food group each day, in addition to a wide variety of foods within each group throughout the week. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Choose foods from each food group: protein, fruits, vegetables and whole grains. If some foods cause symptoms, make note on your list of triggers and avoid these items. Focus on other foods from that food group. For example, if citrus fruits cause acid reflux, avoid oranges, lemons or grapefruits. Try other fruits like bananas, berries or grapes instead."
    },
    {
      "title": "Limit gas-producing foods.",
      "content": "Limit gas-producing foods. Some foods are known to cause more gas and bloating compared to others. Although GERD symptoms aren't always triggered by these foods, IBS symptoms are. [3] X Research source Some foods have certain types of nutrients that are difficult for your body, especially your colon, to break down. They cause an increased production of gas in your intestines which can cause bloating, cramping or flatulence. Foods to limit or eat in very small portions include: beans, broccoli, Brussels sprouts, cabbage, cauliflower, sugar alcohols, onions, carbonated beverages and dairy products. If these foods do not cause any problems or symptoms, you can include them in your diet; however, it's best to limit them or only have very small portions of them if they do produce any adverse side effects."
    },
    {
      "title": "Drink adequate fluids.",
      "content": "Drink adequate fluids. In addition to eating the right types of foods or avoiding trigger foods, you need to drink an adequate amount of fluids. This can help issues related to both IBS and GERD. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Water is the best type of fluid you can drink. It can help dilute stomach acid and replace fluids lost through diarrhea. Drink at least 6 – 8 oz (177 – 237 mL) before meals. Avoid drinking water with meals to reduce stomach volume. In addition to water, you can try: decaf coffee and tea or flavored water. You may try sparkling water if carbonation doesn't irritate your system. Aim for 64 oz (1.9 L) at a minimum; however, many people need 80 oz (2.4 L) or more. This is especially true if you're experiencing diarrhea. Stop drink water two to three hours before bed to reduce symptoms of nighttime GERD."
    },
    {
      "title": "Consider taking vitamin and mineral supplements.",
      "content": "Consider taking vitamin and mineral supplements. Supplements can be helpful if you suffer from IBS and GERD. Many of the side effects, especially if not well managed or if they occur frequently, can increase your risk for nutrient deficiencies. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Diarrhea, which occurs frequently with IBS, can cause your GI system to malabsorb many vitamins and minerals. In addition, some of the medications used to treat GERD prevent some vitamin and minerals from being absorbed as well. Many people who suffer from both IBS and GERD may have a limited diet due to a large variety of trigger foods or fear from eating a larger variety of foods. This behavior limits how many nutrients you can get from your diet. To prevent any deficiencies, consider taking a multivitamin. This can help prevent nutrient deficiencies by providing a \"back-up\" set of vitamins and minerals. Always talk to you doctor before starting any type of supplementation. And remember, the best place to get your nutrients is from foods."
    },
    {
      "title": "Manage stress",
      "content": "Manage stress . One of the biggest and most common triggers for both IBS and GERD is stress. Even small or mild stressors can set off a whole host of symptoms from both of these conditions. [6] X Research source If you have a stressful lifestyle or have even low grade, but chronic stress, this can be a serious contributor to the flare up of your symptoms. To help reduce your stress, consider: talking to a friend, going for a walk, taking a hot bath or reading a good book. If you're having difficulty managing your stress and it continues to cause symptoms, consider seeking additional help from a behavioral therapist."
    },
    {
      "title": "Stop smoking",
      "content": "Stop smoking . Another irritant that can cause continued symptoms from both IBS and GERD is smoking. Quit smoking immediately to help reduce some of the symptoms associated with these conditions. In terms of GERD, smoking decreases the function of a ring of muscle (a sphincter) between your esophagus and stomach, allowing acid to be pushed upwards into the back of your throat. With IBS, cigarette smoking can cause diarrhea and other intestinal distress. [7] X Research source To reduce symptoms, consider quitting. Either give up cigarettes cold turkey or talk to your physician about joining a smoking cessation program or using medications to help you quit."
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Another way to decrease the occurrence symptoms of IBS and GERD is by exercising on a regular basis. Be consistent with exercise and meet the weekly guidelines to help you cope with these conditions. It has been shown that exercise helps those with IBS by stimulating bowel contractions and keeping you regular. Exercise is also known as a great way to reduce and relieve stress. Since both IBS and GERD symptoms can be exacerbated by stress, including regular exercise is a smart idea. Aim for 150 minutes of moderate intensity cardio each week plus two to three days of strength training. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Avoid tight-fitting clothing when exercising or relaxing at home. Tight clothing will put pressure on the abdomen and the esophageal sphincter."
    },
    {
      "title": "Don't lie down after you eat.",
      "content": "Don't lie down after you eat. In terms of GERD, there are specific suggestions to help prevent symptoms. Making sure you don't lie down or sleep for a certain time after you eat will be helpful in managing your symptoms. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source GERD revolves around how much acid is being pushed up the back of your throat. Gravity, especially when you're standing or sitting with your back straight, aids your body in keeping the acid down and in your stomach; however, if you lie down, the acid can trickle up your esophagus and throat. Wait at least two hours before going to sleep after you've finished dinner or your last meal. You may also want to try elevating the head of your bed or resting on multiple pillows to help keep acid down."
    },
    {
      "title": "Talk to your doctor and registered dietitian.",
      "content": "Talk to your doctor and registered dietitian. To help you manage your IBS and GERD, you need to see your doctor regularly. In addition, it may be helpful to also enlist the help of a registered dietitian. Stay in touch with your primary care physician or your gastroenterologist. They should be managing these conditions and staying in touch regularly. If you take medications for these conditions, inform your doctor if they stop working or you're still having symptoms. Look for a dietitian that specializes in GI conditions. Since many foods can trigger symptoms, it is important to make sure you learn how to avoid them while still following a fairly well-balanced diet. Ask your dietitian for specific meal plans, recipes and supplement suggestions to help you stay healthy."
    },
    {
      "title": "Take your medications regularly.",
      "content": "Take your medications regularly. If you have severe IBS or GERD, you may be prescribed prescription medications. These should be taken regularly to help you live with these chronic conditions. Many times, both GERD and IBS can cause severe enough symptoms that they need to be managed with medications. Take your medication as directed by your doctor. Never take more or less of the medication. Also stay consistent. Don't skip days of taking your medications, otherwise they'll be less effective overall. Try setting an alarm to remind you to take your medications. Timing your medication to take it directly after something that is already an ingrained habit (such as right after you brush your teeth) can help you remember to take it. Try storing your pills near your toothbrush or something that will trigger a reminder to take your medication."
    },
    {
      "title": "Consider taking probiotics.",
      "content": "Consider taking probiotics. An additional supplement you may want to consider adding to your daily routine is a probiotic. This can help manage symptoms of IBS. Some studies suggest that if you have IBS, that you might have an overgrowth of \"bad\" or \"unhealthy\" bacteria in your gut causing many of your symptoms. Probiotics are considered \"good or healthy\" bacteria. Adding a probiotic supplement to your diet may help repopulate your gut with the good bacteria and weed out the bad bacteria. Probiotics can be taken in supplement form — in tablets, liquids or capsules. In addition, many foods have probiotics naturally or added. Try: yogurt, kefir, fermented vegetables, kimchi, sauerkraut or tempeh."
    },
    {
      "title": "Carefully experiment with fiber.",
      "content": "Carefully experiment with fiber. Like probiotics, you might also want to consider adding some fiber to your diet; however, be careful with fiber supplements. A little too much and you could cause irritating symptoms. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Fiber is great at relieving constipation — especially if you have IBS. Fiber also has been shown to reduce the symptoms associated with GERD. If possible, integrate more fiber-rich foods into your diet such as fruits, vegetables, and whole grains. Be careful to avoid trigger foods and keep track of symptoms in a journal. Try: lentils, raspberries, blueberries, pears, apples, or artichokes. You can add fiber in a supplement form - like a tablet, capsule or gummy chew. Regardless of the choice of fiber, you always need to start adding it very slowly to your diet. Add in just 3 – 5 grams per day and assess how that affects you."
    }
  ]
}