{
  "url": "https://www.wikihow.com/Keep-Meat-Moist-in-the-Oven",
  "title": "How to Keep Meat Moist in the Oven",
  "steps": [
    {
      "title": "Choose dark, fatty meat for the juiciest results.",
      "content": "Choose dark, fatty meat for the juiciest results. When choosing which cut of meat to cook, the ones that have the most fat will be the most tender and moist. For chicken and turkey, focus on the thighs and legs. With red meat, look for marbled steaks, or consider mixing in other forms of fat if you’re making something like meatballs. For roasts, pick the tenderloin from beef or pork. [1] X Research source For example, pancetta, milk, eggs, and cheese are great to incorporate to things like meatballs or meatloaf, as they’ll add moisture to the meal. If you’re making chicken meatballs from ground chicken, add in small pieces of dark meat to help keep them moist as they cook."
    },
    {
      "title": "Take meat out of the fridge 15-30 minutes before it needs to go in the oven.",
      "content": "Take meat out of the fridge 15-30 minutes before it needs to go in the oven. Putting meat straight from the fridge into the oven could result in food that is done on the outside but unevenly cooked on the inside. Make it a habit to put it on the counter while you’re prepping the rest of your meal. [2] X Research source Of course, you don’t want to leave raw meat on the counter for too long. If you aren’t going to cook soon, pop it back into the fridge within 2 hours. If you live in a warmer climate, it’ll need to go into the fridge sooner. [3] X Research source"
    },
    {
      "title": "Pound chicken breasts or pork chops to a thin layer so they cook evenly.",
      "content": "Pound chicken breasts or pork chops to a thin layer so they cook evenly. Place the breast between 2 pieces of plastic wrap or into a resealable plastic bag. Use the flat side of a meat tenderizer to gently pound on them until they’re an even width all the way across. This method helps the breast to cook fully without drying out anywhere. [4] X Research source This method doesn’t work for bone-in chicken breasts. If you don’t have a meat tenderizer, you could use a bottle of wine, rolling pin, or even the flat side of a skillet. This works for turkey breasts, too."
    },
    {
      "title": "Stuff the skin of a chicken or turkey with butter to get a tender interior.",
      "content": "Stuff the skin of a chicken or turkey with butter to get a tender interior. This works especially well when you’re roasting an entire bird, but you can do it to any piece of poultry as long as it still has its skin on. Mix softened butter, seasonings, and herbs in a small bowl. Use your fingers to carefully push the mixture underneath the skin and spread it around before cooking. [5] X Research source This method results in crispy skin and juicy meat."
    },
    {
      "title": "Brine raw lean meat to help it retain its juices while it cooks in the oven.",
      "content": "Brine raw lean meat to help it retain its juices while it cooks in the oven. For a quick brine while you prepare the rest of dinner, combine 1/4 cup (75 grams) of kosher salt with 4 cups (950 mL) of warm water and stir until the salt has dissolved. Submerge the meat in the brine and let it sit for about 1-2 hours. Remove it from the brine and pat it dry before cooking it. [6] X Research source Use enough water to cover the piece of meat entirely. For each quart (4 cups) of water, remember to use 1/4 cup (75 grams) of salt. 3-4 sprigs of each fresh herb or 1 tablespoon of each dried herb can be added for each quart (4 cups) of water, too. Your brine can be as simple as salt and water, or you could add either fresh or dried herbs and seasonings, like thyme, rosemary, parsley, sage, garlic, and black pepper. You could also brine meat in milk or yogurt to give it a slightly tangy flavor. You can brine chicken , shrimp, fish, pork chops, and other lean cuts of meat. For red meats, like steak, try dry-brining. Instead of mixing salt and water, you just rub seasonings on the meat directly and let it sit for several hours before cooking it."
    },
    {
      "title": "Baste meat every 30 minutes while it cooks to keep it moist.",
      "content": "Baste meat every 30 minutes while it cooks to keep it moist. When meat gets hot in the oven, it starts to leak juices, fat, and oil—things that would normally keep it very moist. Use a large spoon or a bulb baster to carefully pour those juices back over the meat. This should help keep it from drying out and make it more flavorful. [7] X Research source This is especially helpful for larger selections of meat, like roasts, but you can also use it on steak, pork chops, or even a simple chicken breast."
    },
    {
      "title": "Cook tough cuts of meat at a low temperature over a longer period of time.",
      "content": "Cook tough cuts of meat at a low temperature over a longer period of time. With the tougher cuts, like beef chuck, pork shoulder, and brisket, consider using them in a slow-roasted or braised dish. Basically, the longer it gets to cook, the more tender the meat will get. [8] X Research source These types of meat generally need a minimum of an hour to cook."
    },
    {
      "title": "Sear tender cuts of meat and cook them at a higher temperature.",
      "content": "Sear tender cuts of meat and cook them at a higher temperature. Pieces like chicken breasts, pork chops, and tenderloin tend to dry out quickly if they’re cooked for too long. Sear each side of the meat on a super hot pan, and then pop it into a preheated oven for a few minutes or finish it on the stovetop. [9] X Research source Searing doesn’t actually “lock in moisture,” but it does help create more dynamic flavor! Since these cuts of meat don’t take long to cook and have less time to develop a deep flavor profile, the searing helps add caramelization and complexity to the dish. Make sure the meat is completely dry before you try to sear it."
    },
    {
      "title": "Reverse-sear",
      "content": "Reverse-sear a steak for better control over the interior temperature. Start by cooking the steak in the oven at about 225 °F (107 °C) until it is almost done. Remove it from the oven and finish it by searing all sides on a really hot skillet. The heat from the skillet will finish cooking your steak, so take it out of the oven at the following temperatures depending on what level of doneness you prefer: [10] X Research source If you prefer rare steak, cook the meat until it’s right around 110 °F (43 °C). For a medium steak, cook it to about 130 °F (54 °C). To cook your steak well-done, bring it to about 150 °F (66 °C)."
    },
    {
      "title": "Cook a roast chicken or turkey breast-side down to keep the meat juicy.",
      "content": "Cook a roast chicken or turkey breast-side down to keep the meat juicy. Simply place the meat upside down on a roasting rack and put it into the oven to cook. The juices and fat from the dark meat will drip down and saturate the white meat. [11] X Research source In general, each pound of poultry will take about 13 minutes to roast. So a 10-pound turkey would take about 2 hours and 10 minutes."
    },
    {
      "title": "Keep your brisket covered while it cooks to help it retain moisture.",
      "content": "Keep your brisket covered while it cooks to help it retain moisture. A lot of recipes recommend leaving the cover partially off while the brisket cooks, but that can cause this cut of meat to dry out by the time it’s ready to be served. Instead, leave the lid to the pot on, or cover the dish with aluminum foil while it roasts. [12] X Research source Cook the brisket on a low temperature, around 300 °F (149 °C) to help it stay as moist as possible. You can also slice the brisket into super thin pieces and put it back into the braising liquid for about 30 minutes before serving. This should help it absorb more moisture and flavor."
    },
    {
      "title": "Monitor doneness with an instant-read thermometer.",
      "content": "Monitor doneness with an instant-read thermometer. To use a meat thermometer, insert it into the thickest part of the meat and hold it in place until the temperature stops rising. It’s super important to make sure the meat is cooked enough so that it’s safe to eat, but it’s also important to not overcook it so it doesn’t get dry and tough. [13] X Research source If the cut has the bone in it, avoid letting the thermometer hit the bone. Chicken needs to be cooked to 165 °F (74 °C), steak and pork need to be 145 °F (63 °C), and ground meat, like hamburger, needs to reach 160 °F (71 °C)."
    },
    {
      "title": "Let the meat rest when it comes out of the oven for 5-20 minutes.",
      "content": "Let the meat rest when it comes out of the oven for 5-20 minutes. If you cut the meat too soon after it comes out of the oven, all those great juices are just going to flow out and turn the meat dry. Letting the meat rest allows those juices to get reabsorbed into the meat, helping it stay juicy and moist. Cover the meat with tented foil to keep it warm while it rests. [14] X Research source A large roast should rest for about 20 minutes. Chicken needs to rest for 10-20 minutes. Steak and pork chops should rest for about 5 minutes. Hamburger needs to rest for 4-6 minutes."
    },
    {
      "title": "Keep meat warm while it rests by tenting it in aluminum foil.",
      "content": "Keep meat warm while it rests by tenting it in aluminum foil. Take a large piece of foil and fold it in half, then open it back up. Gently set it on top of the dish you made so that most of it is covered by the foil. The aluminum should help it retain its heat so it doesn’t get cold. [15] X Research source Avoid actually wrapping the dish in foil. This could trap condensation as the dish cools and water down your dish."
    }
  ]
}