{
  "url": "https://www.wikihow.com/Increase-Seeds-on-Utorrent",
  "title": "How to Increase Seeds on Utorrent",
  "steps": [
    {
      "title": "Close background programs and streaming services.",
      "content": "Close background programs and streaming services. While doing this won't affect your download's seeds at all, it will increase the amount of bandwidth (allocated Internet) that you can use to download. Things to close include the following: Streaming services (Netflix, Hulu, etc.) Active downloads elsewhere (updates for your phone/tablet/console, etc.) Non-essential programs on your computer (background apps like Skype or Slack, extra browsers, etc.)"
    },
    {
      "title": "Look for downloads with a high number of seeds.",
      "content": "Look for downloads with a high number of seeds. If you prioritize your file downloads based on the number of seeds rather than the quality, location, or size, you may be able to download a similar version of the same file with many more seeds than the original that you were considering. [1] X Research source For example, you might find a 720p (HD) version of a video that has significantly more seeds than the 1080p (full HD) version of the video. Ideally, you'll find files with a higher number of seeders (uploaders) than leeches (downloaders)."
    },
    {
      "title": "Disable files that you don't need to download.",
      "content": "Disable files that you don't need to download. When you begin downloading a torrent's files in uTorrent, you are normally presented with a window that has a list of all of the available files in the torrent. You can uncheck the boxes next to files that you don't want to download to speed up the process. You'll often find that less-popular files (e.g., tutorials or uninstallers) included in torrents have far fewer individual seeds. Low numbers of seeds can cause a file to get stuck while downloading, so unchecking these files will speed up your download."
    },
    {
      "title": "Limit yourself to one download at a time.",
      "content": "Limit yourself to one download at a time. Instead of downloading several items at once (e.g., several movies or programs), download one at a time to ensure that you're taking full advantage of your Internet connection. [2] X Research source"
    },
    {
      "title": "Avoid high-profile downloads.",
      "content": "Avoid high-profile downloads. Unfortunately, you may find yourself having to wait to download a popular file until several days after it has been released on the torrenting site of your choice. This is because so many people will be downloading it that you'll most likely have a hard time getting the file initially; once those people have finished downloading, however, you can downloading using them as seeds."
    },
    {
      "title": "Search for a list of current trackers.",
      "content": "Search for a list of current trackers. Type utorrent trackers [month] [year] into a search engine of your choice and press ↵ Enter . Make sure that you replace \"[month]\" with the current month and \"[year]\" with the current year (e.g., utorrent trackers October 2017 )."
    },
    {
      "title": "Open a tracker site.",
      "content": "Open a tracker site. Once you find a site that has trackers from your current month and year listed, click its link to open it. Make sure the tracker site is safe before you open it. Specifically, the site should use HTTPS encryption (e.g., it should have \"https://\" before the \"www\" section of its address). You can usually find trackers on the site from which you downloaded the torrent itself. Look for a Trackers tab or section on the site's home page."
    },
    {
      "title": "Copy the list of trackers.",
      "content": "Copy the list of trackers. Click and drag your mouse across and down the list of trackers to select them, then press Ctrl + C (Windows) or ⌘ Command + C (Mac) to copy them. Trackers resemble web addresses."
    },
    {
      "title": "Open uTorrent.",
      "content": "Open uTorrent. It's the green and white uTorrent logo."
    },
    {
      "title": "Open a torrent's Properties.",
      "content": "Open a torrent's Properties. Double-click the torrent to which you want to add seeds. [3] X Research source"
    },
    {
      "title": "Click the General tab.",
      "content": "Click the General tab. It's in the top-left corner of the Properties window."
    },
    {
      "title": "Click the \"Trackers\" window.",
      "content": "Click the \"Trackers\" window. You'll see this in the middle of the Properties window. Doing so will place your cursor in the window."
    },
    {
      "title": "Paste in your tracker list.",
      "content": "Paste in your tracker list. Move your cursor down to the bottom of the list of current trackers, press ↵ Enter to create a space between your cursor and the last tracker, and press either Ctrl + V (Windows) or ⌘ Command + V (Mac). [4] X Research source Make sure that there is a blank line between each tracker line."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the window. This will increase the number of trackers for your torrent which, in turn, will draw more seeds within a few minutes of adding them. [5] X Research source"
    },
    {
      "title": "Open uTorrent.",
      "content": "Open uTorrent. It's the green and white uTorrent logo."
    },
    {
      "title": "Click Options (Windows) or uTorrent (Mac).",
      "content": "Click Options (Windows) or uTorrent (Mac). It's in the upper-left corner of the uTorrent window (Windows) or your Mac's screen (Mac). A drop-down menu will appear.[ [6] X Research source [Image:Increase Seeds on Utorrent Step 16.jpg|center]]"
    },
    {
      "title": "Click Preferences.",
      "content": "Click Preferences . You'll find this near the top of the drop-down menu. Clicking it opens the uTorrent Preferences window. [7] X Research source"
    },
    {
      "title": "Click the Bandwidth tab.",
      "content": "Click the Bandwidth tab. This is either on the left side of the window (Windows) or at the top of the window (Mac)."
    },
    {
      "title": "Type 14 into the \"Maximum upload rate\" text field.",
      "content": "Type 14 into the \"Maximum upload rate\" text field. This text field is at the top of the page."
    },
    {
      "title": "Type 2329 into the \"Global maximum number of connections\" box.",
      "content": "Type 2329 into the \"Global maximum number of connections\" box. You'll find this near the bottom of the window."
    },
    {
      "title": "Type 257 into the \"Maximum number of connected peers per torrent\" box.",
      "content": "Type 257 into the \"Maximum number of connected peers per torrent\" box. It's below the \"Global maximum number of connections\" box."
    },
    {
      "title": "Type 14 into the \"Number of upload slots per torrent\" box.",
      "content": "Type 14 into the \"Number of upload slots per torrent\" box. This is at the bottom of the page."
    },
    {
      "title": "Click Apply.",
      "content": "Click Apply . It's in the bottom-right corner of the window. Doing so applies your changes to uTorrent."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This will save your changes and close the Preferences window."
    }
  ]
}