{
  "url": "https://www.wikihow.com/Kiss-Your-Girlfriend-in-Public",
  "title": "How to Kiss Your Girlfriend in Public",
  "steps": [
    {
      "title": "Ensure your girlfriend is comfortable with kissing in public.",
      "content": "Ensure your girlfriend is comfortable with kissing in public. Just like any sexual encounter, kissing in public requires both of you to consent to the act. [1] X Research source In particular, many people have different views on whether or not you should show affection in public. If your girlfriend doesn't like to put that on display, you need to respect that. Have a conversation with your girlfriend about public displays of affection (PDA), preferably before you are out in public. You could start off with something like, \"I really like showing affection towards you in public. How do you feel about me kissing you when we're out and about?\" If she's not okay with it, don't try to coerce her to kiss you while in public."
    },
    {
      "title": "Don't make it a first kiss.",
      "content": "Don't make it a first kiss. At least, don't make it a first kiss without talking about it first. It could be awkward if she isn't as into you as you think, plus you could make her feel uncomfortable in public. [2] X Research source While you might think it's a grand romantic gesture, it could have the effect of turning her away from you if she's uncomfortable."
    },
    {
      "title": "Skip kissing in professional situations.",
      "content": "Skip kissing in professional situations. In professional situations, you want to keep the PDA to a minimum, as many people do not consider it to be appropriate. If you're picking your girlfriend up from work, for instance, you probably don't want to French kiss her in the middle of the office. [3] X Research source You can probably get away with a peck on the cheek or forehead. It's especially important to skip PDA at the office if you work with your girlfriend. Most workplaces frown on inter-office romances."
    },
    {
      "title": "Skip places where people are trapped with you.",
      "content": "Skip places where people are trapped with you. That is, don't pick a place like a bus where people have no choice but to stay in the vicinity and watch you kiss. It will make them uncomfortable, and it may make your girlfriend uncomfortable. [4] X Research source Other places to skip include the elevator (if there are other people there), a cab, or the subway. [5] X Research source Also skip places where you're near a person who has to stay where they are, such as a security guard. [6] X Research source"
    },
    {
      "title": "Consider safety.",
      "content": "Consider safety. While many people are becoming more accepting of same sex relationships, you should consider where you are when kissing if you are in one of these relationships. The same can be said of mixed-race and other relationships. Of course, you shouldn't hide who you are, but if you are in an especially conservative community or business, kissing could actually be a safety risk. [7] X Research source Think about where you are and if it is a safe place to be kissing. For instance, is the area too isolated, meaning you couldn't get help if you need it? Think about the atmosphere of the city or business you're in. Is it a deeply conservative one, where you might have trouble exhibiting PDA with a person who is the same sex or of another race? On a positive note, with the passage of laws across the U.S., hate crimes have decreased over time. [8] X Research source"
    },
    {
      "title": "Don't push it too far.",
      "content": "Don't push it too far. When kissing someone in public, keep it fairly chaste. That is, don't have a full-on making out session. Keep it to a few seconds, and mostly skip the tongue and petting. One person put it this way: Pretend your grandmother is standing right next to you. If you wouldn't do it in front of her, don't do it in public. [9] X Research source In addition, keeping it light helps you not cross any legal boundaries. The laws on how much is too much varies by city and state, but if you keep it to light kissing, holding hands, and hugging, you should be fine. [10] X Research source"
    },
    {
      "title": "Communicate with your eyes.",
      "content": "Communicate with your eyes. You can let your partner know that the idea of kissing is on your mind with some non-verbal communication. Gently touching her as you talk, such as touching her arm, can be an indication. [11] X Expert Source Laura Bilotta Dating Coach & Matchmaker Expert Interview. 4 March 2020. Another way to flirt is to let your eyes drift to her lips on occasion to indicate where your mind is. Notice her eyes, too. For instance, is she making eye contact with you? That could be a sign she's interested in you and wanting to kiss. Also, watch to see if she's looking at your lips as much as you're looking at hers, a sign she may want to kiss."
    },
    {
      "title": "Notice how close she gets to you.",
      "content": "Notice how close she gets to you. Most people maintain a distance of about four feet. That's the \"bubble\" you keep around you that's considered personal space. If she comes in closer, particularly if she comes in closer than a foot and half, she's entering your intimate space, a sign she's interested in you. You can also enter her intimate space by getting closer to her. However, if she steps back to create distance, that's a sign you need to respect her distance and that she may not want to be kissed."
    },
    {
      "title": "Watch for signs she doesn't want to be kissed.",
      "content": "Watch for signs she doesn't want to be kissed. While you may be able to tell if she's overtly flirting with you, you may be less aware when her body language is telling you to slow down. For instance, very tense body posture is a sign she's not comfortable with how the interaction is going. Look for tense shoulders and crossed arms, for instance. Another sign she may not be interested is she's pointing her body away from you rather than towards you. However, a good sign in posture is if she starts mirroring your stance or body language, something we do unconsciously with people we like."
    },
    {
      "title": "Ask her first.",
      "content": "Ask her first. You may think it's more romantic to just kiss her, but it's important to get consent first. All you have to do is ask her if it's okay and get an enthusiastic \"yes!\" [12] X Research source For instance, you could say, \"I'd really like to kiss you right now. Is that okay?\" You could also say, \"How would you feel if I gave you a big ol' smooch right now?\" Respect her decision if she says \"no.\" Don't try to pressure her into it. Reader Poll: We asked 2435 wikiHow readers who've gone in for the kiss, and only 9% of them agreed that the best way to know if she wants to kiss you is when she touches you. [Take Poll] While physical touch can often be a good sign, asking is probably the best way to know for sure."
    },
    {
      "title": "Understand silence is not a \"yes.\"",
      "content": "Understand silence is not a \"yes.\" When asking your girlfriend for consent, you need to get an answer. If she doesn't give one at all, that is not consent. [13] X Research source However, nonverbal cues can be consent. Nodding or her kissing you would be a sign of consent. [14] X Research source Nonetheless, if her nonverbal cues aren't showing an enthusiastic \"yes,\" wait until you get one. [15] X Research source The fact that she doesn't resist isn't consent, either. [16] X Research source"
    },
    {
      "title": "Make sure you're fresh.",
      "content": "Make sure you're fresh. No one likes to kiss an ash tray or a mouth full of onion and garlic flavor. Pop a breath mint in before you go in to kiss her. [17] X Research source It also wouldn't hurt to do a quick check-up in a mirror first, if possible, to make sure you don't have anything in your teeth. If no mirror is available, run your tongue around your teeth to make sure they're clean."
    },
    {
      "title": "Take care of your lips.",
      "content": "Take care of your lips. Rough lips are a turn off. If your lips are all cracked and gross, she's probably not going to want to kiss you. Try using lip balm regularly, and don't be afraid to put a bit on leading up to the kiss. [18] X Research source You can discreetly put some lip gloss on by going to the bathroom or by looking away for a moment. Don't put too much on, as you don't want to create an oil slick for kissing."
    },
    {
      "title": "Pick a good place.",
      "content": "Pick a good place. Try to pick a romantic spot. For instance, in a park by a river is nice, much better than, say, the back alley behind a restaurant. Also, try to choose a place where there aren't too many people around. [19] X Research source If people are milling around, it can kill the romance. Try to pick a place she feels comfortable. If she's not comfortable, the kiss won't be enjoyable for her."
    },
    {
      "title": "Cradle or touch her face.",
      "content": "Cradle or touch her face. If you haven't quite got up the nerve, even though you've asked, you can stall a bit by touching her face. You can also gentle tilt her head towards you so you can kiss her more easily. Always be looking for signs of nonverbal communication. For instance, if you reach out to touch her and she pulls away, you should stop. [20] X Expert Source Laura Bilotta Dating Coach & Matchmaker Expert Interview. 4 March 2020. Sitting close to you, giggling, and making eye contact are all signs that she's okay with being touched. [21] X Expert Source Laura Bilotta Dating Coach & Matchmaker Expert Interview. 4 March 2020."
    },
    {
      "title": "Lean in for the kiss.",
      "content": "Lean in for the kiss. Once you've stopped and picked the perfect spot plus got her consent, it's time to go in for the kiss. Lean in closer, puckering lips a bit as you go. You want to make sure they have some definition to them for kissing, so your girlfriend has something to kiss. [22] X Research source If she pulls away, let her. When you're ready, pull back again."
    },
    {
      "title": "Relax into the kiss.",
      "content": "Relax into the kiss. If this relationship is still new, you may be a little nervous. If you are, don't worry, the hard part is over. Just relax and enjoy the kiss. [23] X Research source Focus on enjoying the moment. Try not to think about whether you're doing it right or what's going to happen in a few minutes."
    },
    {
      "title": "Keep your tongue under control.",
      "content": "Keep your tongue under control. This tip is to help you out, not because of who's standing around. That is, a little tongue is okay, but no one likes to be attacked by a tongue like a dog. Keep it tasteful. [24] X Research source For instance, you can try lightly licking across her lips, but try not to lap her whole face."
    }
  ]
}