{
  "url": "https://www.wikihow.com/Look-Pretty-with-No-Makeup-As-a-Preteen",
  "title": "How to Look Pretty with No Makeup As a Preteen",
  "steps": [
    {
      "title": "Be clean and hygienic",
      "content": "Be clean and hygienic . Being clean is all about being fresh and looking your best . If you're clean, you'll look great and feel even better. Wash every day, preferably have a shower as baths are apparently not as hygienic. If possible, wash in the morning. The shower/bath will wake you up, and there's a chance your body could sweat in the night. If you have brothers or sisters who take showers in the morning, and there is only one shower, take a shower before you go to bed. If it's hot out, don't sleep with the covers, and sleep with the sheets instead! Wash your hair every other day or as often as it needs to look good. Washing it too often may strip natural oils, cause frizziness and make it more greasy. You can also try using dry shampoo if you think that it will help you look pretty as a pre teen with no make-up. Find shampoos and conditioners that suit your hair's texture. If you have a dry scalp, you may consider using a dandruff shampoo. Don't use too much of any product. Too much gel or mousse can result in a really bad hair day. Reader Poll: We asked 160 wikiHow readers if they use conditioner every time they wash their hair, and 63% of them said yes. [Take Poll] Everyone’s hair is different though, so find a wash routine that works best for your needs."
    },
    {
      "title": "Moisturize your skin",
      "content": "Moisturize your skin . Drink a lot of water and find a moisturizing product that suits your skin. There are different types for different skin types. If your face is oily, always use moisturizer. It may seem ironic but it's still important. Use one that's meant for someone who has acne or that's designed for oily skin. If your skin is dry, use a thicker cream based moisturizer. It will help your skin stay moisturized longer."
    },
    {
      "title": "Wash your face twice daily, once in the morning and once at night.",
      "content": "Wash your face twice daily, once in the morning and once at night. Washing your face will help wash away dirt and layers of skin cells that build up over the day. Try to find a face wash that is appropriate for your skin. You probably want a \"non-comedogenic\" wash, which simply means that it won't clog your pores. If you're beginning to get pimples, use over the counter acne products. If it's getting worse and you're worried about it, visit your dermatologist who can prescribe something to help."
    },
    {
      "title": "Have a nice hair style.",
      "content": "Have a nice hair style. Find a length that compliments the shape of your face and that you're happy with. Your hair makes a big impact on your image. Ask your hairstylist what would be suitable for you. Choose a hairstyle that is easy to maintain."
    },
    {
      "title": "Smell pretty.",
      "content": "Smell pretty. Instead of using perfume, use a nice smelling lotion or, go without, how you smell doesn't make you look pretty, but, it might make you feel good to smell nice. Nice smelling soap can give off a perfume scent, as can deodorant."
    },
    {
      "title": "If you have braces, it's not bad.",
      "content": "If you have braces , it's not bad. Almost everybody has them at some point. Try to stay clear of getting more than two colors. Even two colors may look a little too harsh for your face. Choose pastel or neutral colors--they look very pretty on braces. Stay away from yellow, white and neon blue. They will make your teeth look yellow, and not white. Darker colors like navy blue and purple whiten teeth, while lighter colors like light pink and sky blue will brighten your teeth."
    },
    {
      "title": "Wear nice clothes.",
      "content": "Wear nice clothes. Wear clothes that properly fit and that you feel good in. If your clothes fit right and feel good on you, they’ll make you look your best! Dress for the weather. If it's summer, wear something that's light and cool. If it's winter, wear something that will keep you warm."
    },
    {
      "title": "Wear colors that suit you.",
      "content": "Wear colors that suit you. Certain colors look better on certain skin tones and with certain hair colors. Try to choose colors that flatter your skin tone and work well with your hair color. This is one of the best ways to create the impression that you could be wearing makeup! Wear blues, greens, and browns to bring out your eyes, and pinks to bring out the pink in your cheeks. Redheads look beautiful in green; however, avoid lime or neon greens. Try to find dark forest greens that make your hair stand out. If your skin has yellow tones, be careful wearing oranges and yellows."
    },
    {
      "title": "Have at least one cute pair of shoes.",
      "content": "Have at least one cute pair of shoes. Wear them sometimes, particularly if they make you look pretty without makeup. Go for different shoes in different seasons. If you live in a place that gets cold, you obviously wouldn't wear flip-flops in winter."
    },
    {
      "title": "Smile",
      "content": "Smile a lot. A smile is a great accessory! Brush your teeth twice or more every day to get a beautiful white smile . If you can't brush your teeth after every meal, chew on a piece of sugar-free gum. It'll make your breath smell nice and keep your teeth clean."
    },
    {
      "title": "Build self-confidence.",
      "content": "Build self- confidence . Confidence is attractive, so be proud of who you are. Throw your shoulders back and your chin up high. Keep your hair out of your face and smile."
    },
    {
      "title": "Be proud of yourself",
      "content": "Be proud of yourself , and never criticize your looks. Everyone is unique. Your \"flaws\" aren't something to be ashamed of—they're what make you distinctly YOU. Don't try to be someone you're not. Remind yourself everyday of the people who love you! Your family, your best friends, your pets, your teachers... it will boost your confidence!"
    }
  ]
}