{
  "url": "https://www.wikihow.com/Handle-a-Bomb-Threat-over-the-Telephone",
  "title": "How to Handle a Bomb Threat over the Telephone",
  "steps": [
    {
      "title": "Take a deep breath.",
      "content": "Take a deep breath. Try to remain calm.The calmer you are, the better you will be able to think on your feet. Deep breaths should come from your diaphragm. Place a hand on your stomach and feel it expand when you breathe in and contract when you breathe out. If taking a deep breath doesn’t help, count to five. You might also clench muscle groups for several seconds and then relax. Begin with your shoulders and then work down to your feet."
    },
    {
      "title": "Avoid making threats.",
      "content": "Avoid making threats. You might be angry, but don’t start threatening the caller or yelling at them. [2] X Research source That’s counter-productive and you won’t get helpful information. Instead say, “You’re calling in a bomb threat? I’m listening.”"
    },
    {
      "title": "Grab a notepad.",
      "content": "Grab a notepad. You need to take down as much information as possible from the caller. Reach for nearby notepad or sheet of paper. Grab a pencil or pen."
    },
    {
      "title": "Copy down the number.",
      "content": "Copy down the number. If your phone has a display, then write down the number that shows up. The police might be able to trace this number."
    },
    {
      "title": "Write down the day and time.",
      "content": "Write down the day and time. For example, “Monday, March 27, 2017 at 11:44 am.” Do this as soon as possible so that you don’t forget."
    },
    {
      "title": "Give a coworker a handwritten note.",
      "content": "Give a coworker a handwritten note. Stay on the line. Hand your colleague a short note asking them to call the police. Write “Bomb threat. Call police now.” Keep it short."
    },
    {
      "title": "Listen to the caller.",
      "content": "Listen to the caller. Avoid talking all over the caller. Let them speak, because they have important information to share. If you have trouble hearing, hand the phone to a coworker so that they can listen to the caller. Sometimes, when we’re nervous, the blood starts pumping in our ears. It’s okay. Just hand the phone to someone who can calmly listen to the caller."
    },
    {
      "title": "Ask where the bomb is placed.",
      "content": "Ask where the bomb is placed. The police need to find the bomb, so get its location. Obtain as much detail as possible: building floor room location in room"
    },
    {
      "title": "Ask when the bomb will go off.",
      "content": "Ask when the bomb will go off. Say, “Can you tell me when it will go off?” The police will need this information also. Write down whatever the caller tells you."
    },
    {
      "title": "Ask what kind of bomb it is.",
      "content": "Ask what kind of bomb it is. Get some details about the bomb, which the police will find useful. Ask the following questions: “What does the bomb look like?” “What’s the bomb made out of?”"
    },
    {
      "title": "Check why the bomb was placed.",
      "content": "Check why the bomb was placed. Ask the caller, “Why did you place the bomb here?” If they say they didn’t place it, then you can note that information as well. Many bomb threats are called into religious institutions, such as places of worship or community centers. Be prepared for the caller to use derogatory language. Nevertheless, write down exactly what the caller says."
    },
    {
      "title": "Ask their name.",
      "content": "Ask their name. “Can you tell me your name?” The caller might give this information, or they might not. It can’t hurt to ask. Write down whatever they tell you. They might give you a made-up name, like “Avenger of the Night.”"
    },
    {
      "title": "Be persistent.",
      "content": "Be persistent. The caller might withhold helpful information, or they may talk all over you and not let you ask a question. Continue to ask questions anyway. A good technique is to mirror what the caller has just said and then follow up quickly with a question. For example, you can say, “I definitely hear that you’ve put a bomb in the school. Can you tell me why?” If the caller refuses to answer, ask again."
    },
    {
      "title": "Note any background noises.",
      "content": "Note any background noises. It might be hard to hear background noises while listening to what the caller says at the same time. One good technique: ask a repetitive question. For example, if the caller told you what the bomb was made of, ask “I’m sorry, I couldn’t hear you. Can you repeat that?” As they answer, listen carefully to background noises. Note any of the following: music motor running animal noises, such as barking people talking in the background machinery street noises no background noise, clear"
    },
    {
      "title": "Write down details about the caller.",
      "content": "Write down details about the caller. Note any of the following details: accent coughing deep breathing lisp nasal voice angry disguised voice"
    },
    {
      "title": "Pay attention to tone.",
      "content": "Pay attention to tone. Some people can give away important information based on their word choice and tone of voice. Note the following: reading from a message tape-recorded voice well-spoken incoherent, mumbling profane familiar voice"
    },
    {
      "title": "Keep the caller talking.",
      "content": "Keep the caller talking. Ideally, the caller will be on the phone when the police arrive. Try to keep the caller on the phone for as long as you can. Pretend you can’t hear. Say, “I’m sorry, I have a weak connection. Can you speak up and tell me that again?”This will drag out the conversation. Play dumb. “I don’t think we have a Room 205. Gina, is there a Room 205 in that building? My cube mate doesn’t think there’s a Room 205. Do you think you put the bomb in a different room?”"
    },
    {
      "title": "Don’t hang up.",
      "content": "Don’t hang up. Even if the caller hangs up, you should keep the phone line open. It may still be possible to trace the phone call. [3] X Research source Don’t hang up until the police arrive. If the caller hangs up, note the time."
    },
    {
      "title": "Review your notes.",
      "content": "Review your notes. If you left something out, it’s best to supplement your notes now while your memory is fresh. You might have noted a background noise that you didn’t write down. Complete your notes soon after the call ends."
    },
    {
      "title": "Call the police.",
      "content": "Call the police. If a coworker didn't call, you should call as soon as the caller hangs up on you. Go to a different phone and call emergency services . Say, “I just received a bomb threat. I’m at the Outer Borough Memorial Hospital. What would you like me to do?” Answer any questions the police have. You may need to read your notes to them."
    },
    {
      "title": "Evacuate the area.",
      "content": "Evacuate the area. If people are located where the bomb has been placed, then you should evacuate the area according to your organization’s policies. Make sure the evacuation route does not take people past the location of the bomb. [4] X Research source Alert your supervisor, if necessary, so that they can trigger the evacuation. Don’t go looking for the bomb yourself. Now is not the time for heroics, and you don’t know how to defuse a bomb anyhow."
    }
  ]
}