{
  "url": "https://www.wikihow.com/Identify-and-Treat-Strawberry-Diseases",
  "title": "How to Identify and Treat Strawberry Diseases",
  "steps": [
    {
      "title": "Look for stunted leaves and loss of luster.",
      "content": "Look for stunted leaves and loss of luster. If your strawberry plants have leaves with slow, stunted growth and metallic, blue-green dull coloration, they are probably suffering from red stele root rot. To be sure, check the roots for rusty-red or brown discoloration in spring, before the plant is due to fruit. [1] X Research source"
    },
    {
      "title": "Check for wilted plans, browning leaves, and black roots.",
      "content": "Check for wilted plans, browning leaves, and black roots. If you notice these symptoms, your strawberry plants are suffering from black root rot, which can be caused by a number of pathogens or poor environmental conditions. [2] X Research source"
    },
    {
      "title": "Catch spotting early.",
      "content": "Catch spotting early. If you notice purple, tan, gray, rusty-brown, or white spots on your strawberry leaves, your plants are likely suffering from leaf spot. Spot color varies depending on local environmental conditions. The disease is caused by a fungus that favors humidity. [3] X Research source"
    },
    {
      "title": "Inspect berries and blossoms for black or gray moldy areas.",
      "content": "Inspect berries and blossoms for black or gray moldy areas. Black or gray mold on your berries indicates fruit rot or blossom blight. The mold is caused by a fungus that the berries and blossoms pick up because they are touching the ground or come in contact with decaying material. [4] X Research source"
    },
    {
      "title": "Be aware of fine white powdery spots on strawberry leaves and fruit.",
      "content": "Be aware of fine white powdery spots on strawberry leaves and fruit. Powdery mildew is a disease caused by a fungus that can also cause strawberry leaves to roll in late summer. [5] X Research source"
    },
    {
      "title": "Be on the lookout for purple splotches.",
      "content": "Be on the lookout for purple splotches. Extremely wet environmental conditions harbor a fungus that causes a purple splotching disease known as leaf scorch. [6] X Research source"
    },
    {
      "title": "Watch for drying plants and wilting leaves.",
      "content": "Watch for drying plants and wilting leaves. Verticillium wilt is caused by a fungus that can be particularly aggressive during a strawberry plant’s first year of growth, which causes the older, outer leaves of the plant to wilt, dry, and turn a reddish yellow to dark brown. The inner, younger leaves remain green. [7] X Research source"
    },
    {
      "title": "Treat red stele root rot by increasing drainage.",
      "content": "Treat red stele root rot by increasing drainage. Discolored roots confirm the presence of the red stele root rot pathogen. The pathogen likes to live in wet soil, which suggests your strawberries don't have enough drainage. Add well-draining soil such as compost or peat moss to your garden. [8] X Research source To treat the pathogen in home gardens, use organic fungicide like Aliette WDG and follow application instructions. For commercial operations, you’ll need to use commercial grade pesticides in accordance to regional rules. [9] X Research source If you have to plant your strawberries in consistently wet soil, you can plant Red Stele resistant plants like Allstar, Sparkle, Sunrise, and Surecrop. [10] X Research source"
    },
    {
      "title": "Treat black root rot by improving the soil.",
      "content": "Treat black root rot by improving the soil. You can fix environmental conditions that contribute to black root rot by improving the soil with organic matter, making sure the soil is well drained, and following proper watering and fertilization practices, based on the specifications of the strawberry variety you are growing. [11] X Research source Pesticides that fight black root rot are extremely regulated, so if your plant is suffering because of pathogens, it’s better to remove and discard the plants. Be sure to burn all the infected foliage to keep the rot from spreading."
    },
    {
      "title": "Treat leaf spot by stimulating new growth or applying fungicide.",
      "content": "Treat leaf spot by stimulating new growth or applying fungicide. Severely infected plants will likely die, but you can save newly infected plants by mowing the strawberry bed after fruiting has finished, which will eliminate diseased growth and stimulate new healthy, growth. [12] X Research source You can also try to treat the fungus with organic fungicides like Captan 50 WP and Copper compounds. Be sure to follow the application instructions. [13] X Research source"
    },
    {
      "title": "Treat fruit rot or blossom blight with chemicals.",
      "content": "Treat fruit rot or blossom blight with chemicals. Apply a chemical treatment to your damaged plants to reverse deterioration caused by fruit rot or blossom blight. Try chemical treatments like fence amid and potassium bicarbonate. Prevention is the best means of control for this fungus, so be sure to keep plants properly spaced, fertilize at correct times (this will depend on what type of strawberries you are growing), remove dead undergrowth after fruiting, and spread straw mulch under the plants to avoid fruit contact with the soil. [14] X Research source Leather rot is a similar disease that causes areas of the fruit to become gray or purple in color and leathery in texture. You can use Captan 50 WP to treat the fungus."
    },
    {
      "title": "Treat powdery mildew by applying fungicide.",
      "content": "Treat powdery mildew by applying fungicide. Remove infected tissue by mowing strawberry beds. Then, treat with fungicides like JMS Stylet oil, Nova 40W, and Rally 40 W, once flowering begins. [15] X Research source The best defense against powdery mildew is to plant resistant varieties of strawberries."
    },
    {
      "title": "Treat leaf scorch by letting your plants dry out.",
      "content": "Treat leaf scorch by letting your plants dry out. The best way to treat this disease is to alter watering practices and allow for dryer conditions. If that isn’t possible, you can treat your strawberries with organic fungicides like Captan 50 WP and Copper compounds. [16] X Research source"
    },
    {
      "title": "Treat Verticillium wilt by rotating crops.",
      "content": "Treat Verticillium wilt by rotating crops. Pathogens harbored in the soil from previous crops can be the disease culprit, so the best means of control are proper crop rotation methods. Unfortunately, there are no easy soil or chemical treatments recommended for Verticillium treatment. [17] X Research source Strawberries exposed to lower levels of nitrogen seem to withstand the disease better than plants exposed to high levels of nitrogen, so one way to fight the disease is to use fertilizer with lower levels of nitrogen."
    },
    {
      "title": "Rotate your crop.",
      "content": "Rotate your crop. Many pathogens are transmitted by infected soil, surrounding fields, birds, and wind. To reduce exposure to pathogens and to keep soil healthy, rotate your strawberry crops every few years. Strawberries should never follow tomatoes, potatoes, eggplant, peppers, or stone fruits for 5 years, because these plants can harbor diseases like Verticillium and red stele root rot in the soil."
    },
    {
      "title": "Plant strawberry varieties that are adapted to your area.",
      "content": "Plant strawberry varieties that are adapted to your area. Certain varieties of strawberries are better adapted to certain types of regions and their climates. Visit a local fruit stand or greenhouse to talk to an expert on the strawberries best suited to your region. Growing the best variety for your region will help eliminate diseases caused by environmental stressors. [18] X Research source"
    },
    {
      "title": "Select strawberry varieties that are disease-resistant.",
      "content": "Select strawberry varieties that are disease-resistant. The best way to prevent strawberry diseases is to plant disease-resistant strains. Conduct an online search for the most prevalent strawberry diseases in your region and then pick a strawberry variety that is resistant to all or most of those diseases. [19] X Research source"
    },
    {
      "title": "Plant strawberries that are disease-free.",
      "content": "Plant strawberries that are disease-free. Never plant strawberries with visible signs of disease. Not only will you contaminate the soil for years, but you may also contaminate neighboring fields. Only plant healthy strawberry plants."
    },
    {
      "title": "Avoid shade.",
      "content": "Avoid shade. Strawberry plants require 6-10 hours of direct sunlight per day. Not only will sunlight help them grow, but it also helps fight disease by allowing strawberries to dry quickly after heavy rains or thick dew."
    },
    {
      "title": "Use mulch.",
      "content": "Use mulch. Mulching around your strawberries will fight disease by providing protection from frost, dehydration, and soil temperature fluctuations. [20] X Research source"
    },
    {
      "title": "Avoid stressing your strawberries.",
      "content": "Avoid stressing your strawberries. Strawberry plants are most likely to acquire disease when they are stressed. Stress can be caused by planting strawberries in clay or soil with high salt content, too much or too little water, incorrect planting depth, and too much shade. [21] X Research source Follow your strawberry variety’s specific planting instructions as closely as possible."
    },
    {
      "title": "Spread your strawberry plants out.",
      "content": "Spread your strawberry plants out. Strawberries don’t like to be crowded and dense areas of planting can cause extra humidity and poor drainage, which allows fungus to grow. Space plants based on the variety’s specifications. [22] X Research source"
    },
    {
      "title": "Remove dead or decaying material.",
      "content": "Remove dead or decaying material. When blossoms or berries touch dead or decaying matter, they will start to rot. Keep dead leaves and fallen berries clear from the plants. Decaying material also includes organic matter in the soil. Spread a straw mulch underneath the plants if contact with the soil cannot be prevented. Keep plants watered and fertilized in accordance to the variety’s directions in order to produce higher-growing fruit."
    }
  ]
}