{
  "url": "https://www.wikihow.com/Identify-Male-and-Female-Guppies",
  "title": "How to Tell If a Guppy Is Male or Female",
  "steps": [
    {
      "title": "Male guppies have long, slender bodies while females are more round.",
      "content": "Male guppies have long, slender bodies while females are more round. The body shapes of male and female guppies are very different and distinct. Male guppies usually have thin, narrow bodies while female guppies typically have a rounder body shape. [1] X Research source If your female guppy is pregnant , her body may look boxy, stuffed, or lumpy. She may grow even rounder as she gets closer to birthing her young. [2] X Trustworthy Source PLOS ONE Online peer-reviewed, open access scientific research journal Go to source Use a magnifying glass to get a better look at your guppy’s shape, size, and coloring as it swims around in its tank."
    },
    {
      "title": "Male guppies are smaller than female guppies.",
      "content": "Male guppies are smaller than female guppies. Get an approximate measurement of your guppies to help determine their sex. Female guppies can grow up to 7 cm (2.8 inches). They are often 2 times as long as male guppies, which can grow up to 4 cm (1.6 inches). [3] X Research source"
    },
    {
      "title": "Male guppies are more brightly colored and patterned than females.",
      "content": "Male guppies are more brightly colored and patterned than females. Male guppies are typically more colorful than their female counterparts. Males often have bodies and tails covered in orange, blue, violet, green, black, and white spots and stripes. Female guppies are usually duller in color and have less patterning; many females are just a silvery gray. [4] X Research source Keep in mind that bright colors and patterns don’t automatically mean your guppy is a male. Some types of female guppies are quite colorful, so check out other physical markers on your fish to determine its sex. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Look at different breeds of guppies online to determine what breed your guppy is, as well as the different coloring and patterns on your breed's tail. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Male guppies use their bright coloring to help attract female mates."
    },
    {
      "title": "Males have long and thin anal fins while females have triangular fins.",
      "content": "Males have long and thin anal fins while females have triangular fins. Look at the size and shape of the guppy’s anal fin, which is the fin located under the fish and before the tail fin. A male guppy has a long and narrow anal fin with a slightly pointed end. In contrast, a female guppy has a shorter anal fin that is triangular. [7] X Research source A male guppy’s anal fin is called a gonopodium. It contains his reproductive organs, so he uses his fin to deliver sperm to the female."
    },
    {
      "title": "Only female guppies have a dark-colored gravid spot.",
      "content": "Only female guppies have a dark-colored gravid spot. Check the underside of your guppy’s body, near the end of their belly and above the anal fin, for a dark spot. This is called a gravid spot, which indicates that a guppy is female. Male guppies do not have a gravid spot. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The gravid spot rests above a female guppy’s “womb,” or where her fertilized eggs develop into baby fish. If your female guppy is pregnant, her gravid spot will likely get darker and bigger as she gets closer to delivering her young. As her due date approaches, you may even see the babies inside her, close to her gravid spot. Once she has her babies, her gravid spot will get lighter again."
    },
    {
      "title": "Male guppies have longer dorsal fins while females have shorter fins.",
      "content": "Male guppies have longer dorsal fins while females have shorter fins. Look at the shape of your guppy’s dorsal fin, which is located on top of the fish. Male guppies have long dorsal fins that flow in the water as they swim around. Female guppies usually have shorter dorsal fins that do not trail in the water as they swim. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Male guppies have long, wide, and colorful tail fins, unlike females.",
      "content": "Male guppies have long, wide, and colorful tail fins, unlike females. Check out your guppy’s tail fin (also called the caudal fin), which is located at the end of their body. Male guppies have long and broad caudal fins that are often brightly colored with elaborate patterns. Female guppies typically have shorter caudal fins that are not as wide and long as males’. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}