{
  "url": "https://www.wikihow.com/Handle-Parents-Playing-Favorites-As-an-Adult",
  "title": "How to Handle Parents Playing Favorites As an Adult",
  "steps": [
    {
      "title": "Look out for signs that this is genuine favoritism.",
      "content": "Look out for signs that this is genuine favoritism. If your parents are playing favorites, it means they’re showing special favor towards one sibling over you. This can be hurtful and harmful, so make sure that they’re actually playing favorites instead of simply being rude, testy, or distant. The reality is that the fact that you feel like they’re playing favorites is already a meaningful sign, but it still helps to examine this further. [1] X Research source Signs they’re playing favorites include: Not celebrating your successes while celebrating your siblings. Frequently agreeing with your siblings while disagreeing with you. Not inviting you to things where your siblings are invited. Paying special attention to your sibling over you."
    },
    {
      "title": "If you haven’t addressed the problem directly, try that first.",
      "content": "If you haven’t addressed the problem directly, try that first. Wait for a time when your parents seem like they’re in a good mood and ask if you can talk to them . Let them know that you’re hurt by their behavior and lay out your case. It’s likely they aren’t trying to do this on purpose, and if you’re calm and explain the way you feel, they may stop playing favorites. [2] X Research source You might say: “I’m sure you guys don’t do this on purpose, but it feels like you’re prouder of Mike and his job than you are of me, and it’s really been bothering me lately.” “I don’t want to make a big deal out of it, but it feels like you never ask me to come over while you invite Sarah and Dan over every week. I don’t feel included.”"
    },
    {
      "title": "If you’re on good terms with your siblings, reach out to them.",
      "content": "If you’re on good terms with your siblings, reach out to them. Contact your siblings and ask them if they’ve noticed the favoritism you’re upset by. If they haven’t, ask them to look out for it in the future. If they have, ask them to help you call them out on it the next time they cross a line. If you aren’t comfortable doing that, you could ask your siblings to talk to your parents separately to ask them to stop. [3] X Research source If you’ve got a bit of a competitive rivalry with your siblings due to years of favoritism, feel free to skip this one. It’s common for children of parents who play favorites to grow up fighting with one another for attention. Reach out to your sibling and say, “Hey, Mom has been kind of making me feel bad lately with all the shade she’s been throwing me. I’m not crazy right? Any way you could help me out next time?”"
    },
    {
      "title": "Tell your parents you won’t put up with certain behaviors.",
      "content": "Tell your parents you won’t put up with certain behaviors. Instead of addressing the favoritism as a whole, you can simply address the problematic behaviors that bother you the most. By setting boundaries , you’ll make it clear that there is a concrete line that you will not allow them to cross. You’re an adult now, so they should treat you like one. [4] X Research source Here’s how to set a boundary: Explain the boundary. “You always talk down to me in front of others. Stop telling me what I should be spending my time doing.” Provide the consequence. “If you don’t stop criticizing the way I spend my time, I’m not going to come over anymore.” Do not negotiate. “It’s not up for discussion. I’m an adult now, and I’m in charge of what I do in my spare time.” Enforce the boundary. If your parents cross the line again, actually enforce the boundary. If you don’t, it will be extremely difficult to set boundaries in the future."
    },
    {
      "title": "If your parents seriously cross a line, don’t let it slide.",
      "content": "If your parents seriously cross a line, don’t let it slide. It can be hard to be direct and call a parent out, even as an adult. Still, it’s a key part of maintaining a reasonable relationship with your parents. If they say or do something seriously inappropriate or thoughtless, tell them. Don’t yell or shout, just tell them why whatever they just did was unfair. [5] X Research source You might say: “Hey, that’s really not kind.” “It doesn’t make me feel good when you speak down to me like that.” “I’m hurt that you would say something that cruel.”"
    },
    {
      "title": "Family therapy can create a space for all of you to heal.",
      "content": "Family therapy can create a space for all of you to heal. If you and your family members are having a hard time solving your problems, family therapy might be a helpful option. Talking out your problems in a neutral environment may help you keep your discussion productive and civil, and a trained therapist may be able to help you get to the bottom of old hurts and move forward. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Having a neutral third party can also make it easier to settle any underlying conflict that’s driving your parent’s behaviors."
    },
    {
      "title": "You cannot control your parents at the end of the day.",
      "content": "You cannot control your parents at the end of the day. As difficult and painful as it can be to deal with feeling like your parents aren’t treating you right, there’s a limit to what you can do. It’s unfortunate, but rest assured knowing that you’ve done nothing wrong here. Your feelings are valid, and you don’t have to put up with anything you don’t deserve. Try to accept that you’re never going to have perfect parents and respect what you do have. [7] X Research source If it’s too painful to spend time around your parents when your siblings are around, don’t. There are no rules that say you’re obligated to show up anywhere as an adult."
    },
    {
      "title": "This won’t fix the problem, but you’ll at least feel better.",
      "content": "This won’t fix the problem, but you’ll at least feel better. A lot of the pain you experience as a result of your parent’s favoritism comes from the feeling like you aren’t living up to your siblings. You want to assign a reason to their cruelty. In reality, you and your siblings are entirely different people, and comparing your journeys is pointless. Don’t let your parents trick you into thinking you have something to live up to. [8] X Research source It’s common for kids who grow up with parents who play favorites to become really competitive with their siblings as adults. Try to not view your siblings as opponents and cultivate your relationships with them."
    },
    {
      "title": "If your parents let you down, enjoy milestones with your friends.",
      "content": "If your parents let you down, enjoy milestones with your friends. Favoritism often hurts a lot when it comes to not being recognized for your accomplishments. If you get a new job, a promotion, or you finally finish a big personal project, go tell your friends or partner first. Celebrate with them, get that validation and love, and then move on and tell your parents if you want to. [9] X Research source If you go to your parents first to celebrate good news, they’re likely to let you down. That can ruin your entire mood and feeling of self-worth going forward."
    },
    {
      "title": "In times of struggle, rely on your friends and other relatives.",
      "content": "In times of struggle, rely on your friends and other relatives. Parents who play favorites are often not the best resource when times are tight. You may also feel like you’re giving your parents more ammunition by going to them when things aren’t going great. Reach out to friends, other relatives, or your partner when you need advice or a shoulder to cry on. [10] X Research source There’s no shame in getting professional support. If you want to find a qualified therapist or counselor, go to BetterHelp and search for help near you."
    },
    {
      "title": "If your parents can’t treat you fairly, withhold your energy and time.",
      "content": "If your parents can’t treat you fairly, withhold your energy and time. Limit the time you spend around toxic family members. If, despite your best efforts to get along, your parents or siblings act competitive or cruel towards you, it may be best to simply spend less time around them. Know your own limits, and set boundaries for which negative behaviors you won’t tolerate. [11] X Research source For instance, you might be able to tolerate a sibling’s petty behavior, but draw the line at verbal abuse. [12] X Research source You may also elect to take the lead on planning situations in which you will see these family members so that you can better control your comfort level by accounting for things like location, time, who will be there, length of the visit, etc."
    }
  ]
}