{
  "url": "https://www.wikihow.com/Lgbtiqcapgngfnba",
  "title": "The Complete Guide to the LGBTIQCAPGNGFNBA Acronym",
  "steps": [
    {
      "title": "Lesbian",
      "content": "Lesbian Typically, this refers to someone who identifies as a woman who is sexually and/or romantically attracted towards people of the same gender. [1] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source Non-Binary and other genderqueer people may also identify as a lesbian, and that’s completely fine! You don’t need to fit a box to use a label. The “L” for lesbian is the first one in the acronym and the first word in the list of identities to come into existence—it all started with Sappho, an Ancient Greek woman from the island of Lesbos who wrote poems about loving other women. [2] X Trustworthy Source National Geographic Website of the National Geographic Society Go to source"
    },
    {
      "title": "Gay",
      "content": "Gay Traditionally, this term refers to someone who identifies as a man and has romantic and/or sexual attraction towards other men. However, women and non-binary people might use this as a generic “umbrella term” to describe their sexuality, or more specifically to describe their attraction to exclusively the same gender. [3] X Research source An “umbrella term” is a word or phrase that covers a broad category of other terms. For example, someone might say they’re “gay” because the term includes their identity as a “biromantic asexual” person. The term “gay” started out as a slur, but was reclaimed by activists in the 1960s and by the 1980s was used to refer to men who love men and anyone who expressed same-gender sexuality. [4] X Trustworthy Source National Geographic Website of the National Geographic Society Go to source"
    },
    {
      "title": "Bisexual",
      "content": "Bisexual Bisexual, or “Bi,” is an umbrella term that can be used to describe a person’s romantic/sexual attraction towards more than one gender. Some people might use “pansexual” and “bisexual” interchangeably, while others might prefer one over the other. [5] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source"
    },
    {
      "title": "Transgender",
      "content": "Transgender An umbrella term to describe people whose gender identity or expression is different than the sex they were assigned at birth. People who are transgender might use other terms, like gender-nonconforming or gender-fluid, to describe their gender more specifically. [6] X Research source Even though transgender people have always existed the term wasn’t coined until the 1960s, and eventually it replaced other terminology that tended to mock trans people. [7] X Trustworthy Source National Geographic Website of the National Geographic Society Go to source Being transgender doesn’t imply a sexual orientation, so if you’re a trans person, you may identify as straight, gay, lesbian, bisexual, asexual, or another sexual orientation."
    },
    {
      "title": "Intersex",
      "content": "Intersex A term used to describe people who were born with physical characteristics or reproductive anatomy that don’t fit neatly into the conventional definitions of male or female. They might have ambiguous genitalia or unique variations in their hormones, chromosomes, or sex traits. Intersex people might identify as male, female, non-binary, or another gender identity. [8] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source Intersex people are relatively common and have existed throughout history, but in general society has denied their existence, and some intersex people were concealed or physically altered to fit into the binary of male or female."
    },
    {
      "title": "Queer/Questioning",
      "content": "Queer/Questioning “Queer” can be used as an umbrella term to include many identities and orientations, including those who don’t identify as exclusively straight and people who have an expansive or changing gender identity. It’s also used by people who want to express a spectrum of identities and orientations and reject more specific labels. [9] X Research source The term “questioning” acknowledges people who are exploring their gender or sexual identity. [10] X Trustworthy Source National Geographic Website of the National Geographic Society Go to source Although some people view “queer” as a slur, it was reclaimed in the 1980s LGBTQ+ movement and has been used by community members since. [11] X Research source"
    },
    {
      "title": "Curious",
      "content": "Curious Also called “bi-curious,” “curious” refers to people who are open to exploring or experimenting with bisexuality. They may identify as gay, lesbian, straight, or another sexual orientation but are curious about having a sexual or romantic experience with a gay homosexual relationship or a straight heterosexual relationship. [12] X Research source Curious typically takes “questioning” to the next level—while those who are questioning might try on labels, people who are bi-curious might actively explore relationships with others."
    },
    {
      "title": "Asexual",
      "content": "Asexual Often called “ace” for short, “asexual” is an umbrella term that refers to someone who might have a partially or completely experience no sexual attraction or not have an interest in sexual activity with other people. However, they can experience other forms of attraction like romantic attraction and/or emotional attraction. [13] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source Asexuality is different from celibacy, which is the choice to deny sex even if you have sexual desire."
    },
    {
      "title": "Pansexual",
      "content": "Pansexual This term refers to someone whose romantic and/or sexual attraction isn’t limited by sex or gender. [14] X Research source Sexual orientation varies from one person to another, but for many, “pansexuality” means they base their attraction on the other person’s personality or character rather than their gender. Some people might align more with the definition of “pansexuality” than “bisexuality” because of their different approaches to gender."
    },
    {
      "title": "Gender-Nonconforming",
      "content": "Gender-Nonconforming An umbrella term for people who don’t follow traditional stereotypes of the gender they were assigned at birth or who expand the ideas of gender expression/identity. [15] X Research source People who are gender-nonconforming (GNC) may or may not identify as transgender and may or may not undergo medical gender affirmation treatments. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For example, someone who presents themselves physically as a feminine boy or a masculine girl might also identify as gender-nonconforming. While some people might use the term “gender expansive,” “gender-nonconforming” tends to be the preferred term by the LGBTQ+ community. [17] X Research source"
    },
    {
      "title": "Gender-Fluid",
      "content": "Gender-Fluid A term that describes a person whose gender identity or expression shifts or is fluid in motion between two or more genders. [18] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source This term can also be spelled “genderfluid” with both words together, or “gender fluid” without the dash."
    },
    {
      "title": "Non-Binary",
      "content": "Non-Binary This umbrella term describes people whose gender identity doesn’t fit into the gender binary of “man” or “woman.” There are many non-binary identities, so this umbrella includes people who identify with some aspects of binary identities (such as presenting more feminine or masculine) and people who reject both sides of the binary entirely. [19] X Research source"
    },
    {
      "title": "Androgynous",
      "content": "Androgynous Also called “androgyne,” this term describes people who have a gender that is both masculine and feminine or is directly in the middle of masculine and feminine. [20] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source The term “androgynous” might also be used to describe someone’s gender expression as directly in the middle of or both masculine and feminine."
    },
    {
      "title": "Two-Spirit",
      "content": "Two-Spirit In most Native American nations, this term referred to people who were considered neither men or women, but instead had a third distinct gender status. In other cases, two-spirit men were a third gender and two-spirit women were a fourth. Two-spirit individuals often had roles that were different than male or female roles or took on both roles. Two-spirit traditions, beliefs, and roles varied from nation to nation, but this definition generally summarizes some of the common traits. Each nation might also have specific terms in their own languages for gender-varient people in their communities. Two-spirit is not an \"indigenous version of\" anything, but rather an identity in its own right. Non-indigenous people cannot describe themselves as two-spirit."
    },
    {
      "title": "Aromantic",
      "content": "Aromantic This term describes someone who doesn’t experience romantic attraction. Some might experience sexual attraction, while others might not. Like asexuality, people might use aromantic in conjunction with other identities. For example, a person might identify as “biromantic” if they feel romantic attraction towards two genders."
    },
    {
      "title": "Demisexual",
      "content": "Demisexual This term refers to a sexual orientation on the asexual spectrum where someone feels sexual attraction only to someone they share an emotional bond with. Some demisexual people might feel sexual attraction rarely and others might have little to no interest in engaging in sexual activity. [21] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source"
    },
    {
      "title": "Acefluxsexual",
      "content": "Acefluxsexual Someone who identifies as “acefluxsexual,” “abrosexual,” or “aceflux” might fluctuate between periods of sexual attraction and periods of asexuality. The strength of their attraction can also shift back and forth from weak to intense. [22] X Research source This term is along the asexual spectrum."
    },
    {
      "title": "Akiosexual/lithosexual",
      "content": "Akiosexual/lithosexual This term is along the asexual spectrum, and can refer to people who feel sexual attraction to people but don’t want to have those feelings reciprocated. “Lithosexual” can also describe someone who doesn’t like to receive sexual contact but might be happy to give it to others. [23] X Research source"
    },
    {
      "title": "Autosexual",
      "content": "Autosexual This term typically refers to someone who has a sexual desire for themselves or prefers being intimate with themselves over being intimate with a partner. Some might be turned on by themselves and their appearance, but the label seems to be flexible and can also be used by people who enjoy masturbation more than sexual activities with others. [24] X Research source"
    },
    {
      "title": "Gynosexual",
      "content": "Gynosexual A term that describes people of any gender who feel sexual attraction towards women or people who present more feminine."
    },
    {
      "title": "Reciprosexual",
      "content": "Reciprosexual An asexual-spectrum term that describes people who only develop sexual attraction after they know that the other person is attracted to them. [25] X Research source"
    },
    {
      "title": "Omnisexual",
      "content": "Omnisexual A term that’s often defined as being attracted to people of all different genders. Some might choose this label over “pansexual” or “bisexual,” while others might use all three interchangeably. [26] X Research source"
    },
    {
      "title": "Skoliosexual",
      "content": "Skoliosexual A term that refers to people who are sexually attracted to people with gender identities under the non-binary umbrella. [27] X Research source"
    },
    {
      "title": "Pomosexual",
      "content": "Pomosexual “Pomosexual” or “poMosexual” is a term that can describe people who don’t have a fixed sexuality or gender. Those who choose this label often do so as a protest against labels themselves. [28] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The authors who coined this term didn’t mean for it to be a new label. Instead, they meant it as more of a tool or concept to describe sexuality and gender without borders or binaries."
    },
    {
      "title": "Agender",
      "content": "Agender A word that refers to a person who doesn’t identify with or experience gender. This term is often used differently than “non-binary” because many non-binary people may experience or express gender. [29] X Research source"
    },
    {
      "title": "Bigender",
      "content": "Bigender A term used to identify someone whose gender identity combines two or more genders or who is constantly moving between genders. [30] X Research source Someone who is bigender might also identify as “gender-fluid” or identifies as one over the other."
    },
    {
      "title": "Familiarize yourself with the language of the LGBTQ+ community.",
      "content": "Familiarize yourself with the language of the LGBTQ+ community. Just reading this glossary of sexuality and gender identities can be a great start! You can also seek out books, films, and other resources about the history and current problems affecting the community and educate yourself on what terms are appropriate to use when discussing LGBTQ+ issues. For example, instead of saying someone was “born” a boy or a girl, try saying they were “assigned male at birth” or “assigned female at birth.” You can also ask yourself whether it’s necessary to even mention what sex a person was assigned at birth. [31] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source"
    },
    {
      "title": "Respect someone’s identities and pronouns.",
      "content": "Respect someone’s identities and pronouns. If you’re not sure how someone identifies or what pronouns a person uses, you can always ask! If you make a mistake, it’s completely fine—just correct yourself, and politely correct others if they also use the wrong pronoun. [32] X Trustworthy Source LGBTQIA Resource Center The LGBTQIA Resource Center of the University of California, Davis. Go to source Here are some examples of gender-inclusive language you can use: Try using the pronouns “they/them” when you’re not sure what pronouns someone goes by. Try to avoid using he/she or he or she when writing—not everyone identifies as a man or woman, and some people may use neopronouns like xie/xem or other pronouns, such as she/they. [33] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source To refer to a non-binary or gender-nonconforming person , try using nicknames like “bestie” or “partner,” or ask them what nicknames they’d like to be called."
    },
    {
      "title": "Listen and intervene when necessary.",
      "content": "Listen and intervene when necessary. Being an ally is all about creating a safe non-judgemental environment for marginalized communities—listen to what they say about the issues that affect them, and speak up when a friend, co-worker, or family member says something hateful or dismissive."
    },
    {
      "title": "Show up and advocate for equal rights.",
      "content": "Show up and advocate for equal rights. Defend LGBTQ+ rights by supporting policies and initiatives at work, school, or political spheres that help protect LGBTQ+ people from discrimination. Even if issues seem small, they can have a big impact on LGBTQ+ lives, and you can have the power to change it."
    },
    {
      "title": "Be open about being an ally.",
      "content": "Be open about being an ally. It’s important to be proud to support the LGBTQ+ community. When possible, attend events, marches, and rallies, or just show your support online or in person to your friends. You can also try to educate your co-workers and friends about LBGTQ+ issues ."
    }
  ]
}