{
  "url": "https://www.wikihow.com/Get-a-Dark-Tan-in-the-Sun",
  "title": "How to Get a Dark Tan in the Sun",
  "steps": [
    {
      "title": "Exfoliate your skin the night before.",
      "content": "Exfoliate your skin the night before. Gently scrub the skin with a loofa, bath sponge, or natural scrub product in order to remove dead skin and achieve an even and dark tan. Don’t rub so hard as to make your skin raw or irritated. For a natural exfoliating scrub, try coarse sea salt, granulated sugar mixed with honey, or coffee grounds mixed with olive oil."
    },
    {
      "title": "Moisturize with lotion.",
      "content": "Moisturize with lotion. Choose a rich lotion and apply it all over your skin, focusing on spots that tend to get dry easier. Also drink plenty of water to keep your skin and entire body hydrated. This will allow your skin to get darker over time because each layer of darkened skin will not get dry and flake off as easily. [1] X Expert Source Diana Yerkes Skincare Specialist Expert Interview. 16 April 2019."
    },
    {
      "title": "Wear sunscreen.",
      "content": "Wear sunscreen. Choose a broad-spectrum sunscreen that is 15 SPF or higher, and rub it into your skin evenly and all over your body. Have a friend apply it to your back or other areas that you can’t reach easily yourself. You should apply sunscreen 30 minutes before you go outside. [2] X Research source Water-resistant sunscreen is great for many outdoor activities for which you’ll be getting wet or sweaty. You still need to reapply it regularly. Don’t listen to the common myth that you will tan better or faster without wearing sunscreen! Getting a sunburn from lack of sunscreen actually kills the skin cells that you are trying to darken, prohibiting you from getting a dark tan and increasing your risk of skin cancer. [3] X Research source"
    },
    {
      "title": "Try a tanning accelerator.",
      "content": "Try a tanning accelerator. Buy a tanning accelerator lotion or pill to increase your tan. Use sparingly before going out in the sun, and test it for a small amount of time to make sure there are no adverse side effects. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Go out when the sun is highest.",
      "content": "Go out when the sun is highest. Spend a brief time outside around 12:00 noon for the most exposure to the sun and greatest chance to tan. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Remember that you can still get burned or tanned throughout the daylight hours, and even in cloud cover or shade. [6] X Research source"
    },
    {
      "title": "Read a book or play a sport.",
      "content": "Read a book or play a sport. Pass the time in the sun by laying out with a good book or music, playing a sport, or simply getting outdoor chores like mowing the lawn done."
    },
    {
      "title": "Reapply sunscreen and drink water while you’re out.",
      "content": "Reapply sunscreen and drink water while you’re out. Ideally you should be out in the sun for only an hour or two at a time, but if you are out longer, reapply sunscreen every two hours and after every time you get wet (from swimming, showering, or sweating a lot). Drink plenty of water to keep hydrating the skin so you don’t lose your tan."
    },
    {
      "title": "Change positions to tan evenly.",
      "content": "Change positions to tan evenly. If you’re lying down or in a chair, change positions between your front, back, and sides every 15 to 30 minutes so you get darker all over. When lying on your back, place your arms above your head and your head tilted slightly back to expose your inner arms and neck. When on your front, put your arms out so the top of your shoulders and forearms get sun. Remember that if you’re playing a sport or doing anything else standing up, your nose, shoulders, arms, and back of the neck will likely get more tan than anything else, as they are facing the sun more directly."
    },
    {
      "title": "Shower off.",
      "content": "Shower off. Hop in the shower after you spend time in the sun to remove excess sunscreen, sweat, or sand and dirt."
    },
    {
      "title": "Hydrate the skin.",
      "content": "Hydrate the skin. Keep drinking plenty of water and apply lotion topically to fully hydrate your skin for the best tan. Use aloe vera gel for a good way to soothe the skin. Continue to apply lotion regularly, both right after sun exposure and before bed. [7] X Expert Source Diana Yerkes Skincare Specialist Expert Interview. 16 April 2019."
    },
    {
      "title": "Continue your sun exposure.",
      "content": "Continue your sun exposure. Spend just an hour or two in the sun per day, but do this every day. Build up your tan more gradually for a safer, longer-lasting, and more consistent dark tan. [8] X Expert Source Diana Yerkes Skincare Specialist Expert Interview. 16 April 2019."
    }
  ]
}