{
  "url": "https://www.wikihow.com/Make-a-DMG-File-on-a-Mac",
  "title": "How to Make a DMG File on a Mac",
  "steps": [
    {
      "title": "Create a New Folder for your files.",
      "content": "Create a New Folder for your files. Place the files you would like in your disk image into this new folder for easy access later in the process."
    },
    {
      "title": "Right-click (or CTRL-Click) the folder and select \"Get Info.\"",
      "content": "Right-click (or CTRL-Click) the folder and select \"Get Info.\" Note the size of its contents so you can know how large you will need to make your DMG File."
    },
    {
      "title": "Open \"Disk Utility.\"",
      "content": "Open \"Disk Utility.\" Go to \"Applications\" and then \"Utilities.\" \"Disk Utility\" will show up in the dropdown menu."
    },
    {
      "title": "Click the \"New Image\" icon to create a new disk image.",
      "content": "Click the \"New Image\" icon to create a new disk image. You can also accomplish this by selecting \"File,\" \"New,\" and then Blank Disk Image.\" Enter a name for the Image and identify the size you would like for the DMG File. It only needs to be large enough to fit the files you are trying to store. Here you will have the option to encrypt the folder. If you do not wish to encrypt the folder, select \"None.\""
    },
    {
      "title": "Select \"Create.\"",
      "content": "Select \"Create.\" This will create the DMG File. You should be able to immediately see it appear on your desktop or in the left-hand column of your finder window. Once you have done so, exit out of Disk Utilities."
    },
    {
      "title": "Fill your newly created disk.",
      "content": "Fill your newly created disk. You can do this by simply selected the files you want and dragging them to the DMG file."
    },
    {
      "title": "Identify the application that's right for you.",
      "content": "Identify the application that's right for you. Manually creating DMG Files is extremely simple, but if you still feel that you would like to explore the option of downloading a DMG application, research the different apps out there and compare their ratings and customer reviews. There are a few options out there that have helped to make the process of creating a DMG File much simpler. If you choose to download a DMG Application, some popular options are iDMG and DropDMG. In this tutorial, DropDMG will be highlighted but the other apps will work similarly."
    },
    {
      "title": "Download and launch the app.",
      "content": "Download and launch the app. Drag the application into your \"Applications\" folder and then double-click it. Once it has launched, press the eject icon next to the app. [1] X Research source"
    },
    {
      "title": "Restart your machine.",
      "content": "Restart your machine. This will cause the changes to take effect."
    },
    {
      "title": "Reopen the app.",
      "content": "Reopen the app. Once you have restarted your computer, you should be able to access the DMG application."
    },
    {
      "title": "Create your DMG File.",
      "content": "Create your DMG File. DropDMG automatically converts files into disk images. All you have to do it drag and drop your files into the app and DropDMG will do the rest. [2] X Research source"
    }
  ]
}