{
  "url": "https://www.wikihow.com/Make-a-Mask-out-of-Tin-Foil-and-Tape",
  "title": "How to Make a Mask out of Tin Foil and Tape",
  "steps": [
    {
      "title": "Overlap three sheets of aluminum foil in a stack.",
      "content": "Overlap three sheets of aluminum foil in a stack."
    },
    {
      "title": "Push the stack of sheets onto your face.",
      "content": "Push the stack of sheets onto your face. Push down as hard as you are comfortable pushing. Do it carefully, so the foil does not become punctured. (It might be useful to have a helper do this part.)"
    },
    {
      "title": "Check you have the general outline of your face imprinted:",
      "content": "Check you have the general outline of your face imprinted: nose, lips, corners of your eyes and cheekbones. Use a marker and trace around your eyes (it might be good to follow the bones around your eye socket) for where you want to place the eye holes in your mask. Also, trace around anything else you want cut out. (Breathing holes are useful for breathing!)you might also want to cut a hole for talking too."
    },
    {
      "title": "Carefully remove the foil from your face.",
      "content": "Carefully remove the foil from your face. Cut with sharp scissors around the edges of the mask. And note––once you cut it, you can't really go back easily, so leave extra."
    },
    {
      "title": "Carefully cut out the eyes.",
      "content": "Carefully cut out the eyes. Do this either by puncturing the foil with a toothpick and tearing the foil out, or snipping in the center of the area with the tip of scissors and folding the foil back."
    },
    {
      "title": "Cut holes or slots in the side of your mask.",
      "content": "Cut holes or slots in the side of your mask. These are for the ribbons/cord/shoelaces to attach the mask to your face."
    },
    {
      "title": "Cut small sections of tape.",
      "content": "Cut small sections of tape. While pressing the mask to your face to keep the features strong, gently place the tape onto your mask. When you feel the mask's features are firm enough, place all the sections of tape, overlapping, across all visible places of foil, including the back (foil is itchy next to the skin)."
    },
    {
      "title": "Tie the cord to the holes in the side of your mask.",
      "content": "Tie the cord to the holes in the side of your mask. Leave enough length to both wrap around your head, and to tie in a nice knot or bow."
    },
    {
      "title": "Optional:",
      "content": "Optional: Use plaster or papier mache to smooth the surface of the mask."
    },
    {
      "title": "Decorate using acrylic paints.",
      "content": "Decorate using acrylic paints . Paint whatever you want, making sure to leave it to dry out of the way of children or pets. You can even sprinkle glitter on the paint while it's wet if you like. Adding sequins, feathers, beads, etc. can enhance the mask."
    }
  ]
}