{
  "url": "https://www.wikihow.com/Make-a-Guy-Ask-You-for-Your-Phone-Number",
  "title": "How to Make a Guy Ask You for Your Phone Number",
  "steps": [
    {
      "title": "Act playful.",
      "content": "Act playful. Being playful is a form of begin flirtatious. Sometimes, a guy will be too afraid to ask for your phone number because he won't think you're into him. It's up to you to let him know that you're interested and would love to see him again and to give him your number. To be playful, just tease him a bit, lightly pat him on the arm, and just show that you don't take yourself too seriously. [1] X Research source If you're out, you can even dance with him without getting all serious and making intense eye contact. Keep things light and fun."
    },
    {
      "title": "Flirt with him.",
      "content": "Flirt with him. Don't be afraid to flirt a little bit without coming on too strong. To flirt with the guy, you can twist your hair a bit, touch his arm, and laugh a little bit more than you normally would. Just don't overdo it or he may feel overwhelmed or like you like him a little bit too much. Here are some other ways to flirt with the guy: [2] X Research source Give him a subtle compliment. Tell him you like his shoes or that he has a great smile. Keep it subtle. Obviously saying \"OMG you're the hottest guy I've ever seen!!!\" will turn him off. Lower your voice. Speaking more softly will make you sound more mysterious, and will have the bonus effect of having the guy lean closer to talk to you. Keep it light. Flirt with him, and then pull back a bit. You don't want it to get too serious too fast."
    },
    {
      "title": "Use your body language to your advantage.",
      "content": "Use your body language to your advantage. Another way to let the guy know that you're interested is to give him subtle clues with your body. The way you carry yourself and the way you look at him can give him the indication that you're really into him. This will make him much more likely to ask for your number. Here's what you can do: [3] X Research source [v161898_b01]. 19 August 2021. Make eye contact. [4] X Research source [v161898_b01]. 19 August 2021. Look him in the eyes when you talk to him so he knows that he has your full attention. If it gets too intense, look away for a little while. Lick your lips occasionally. This will help him see what's on your mind. Lean toward him. Position your body, shoulders, and legs toward him, so he sees that you really like him. If you're turned away, then he'll think you're looking for something better to do. Touch him occasionally. This will also clue him in to the fact that you'd like to see him again. Just a playful touch on his knee or forearm will do the trick. Make gestures when you talk. [5] X Research source [v161898_b01]. 19 August 2021."
    },
    {
      "title": "Ask him a few questions.",
      "content": "Ask him a few questions. Show that you care about his life and what's on his mind. [6] X Research source [v161898_b01]. 19 August 2021. Obviously, if you're out at a club, it's not the time to ask if he believes in life after death or what his deepest fears are. But wherever you are, there are ways that you can show you like him just by being interested in who he is and how he thinks. Here are some things you can ask him about: [7] X Research source His hobbies and interests His favorite bands or movies His favorite sports teams What he does for fun on the weekends His opinion about something that matters to you."
    },
    {
      "title": "Mention your shared interests.",
      "content": "Mention your shared interests. If you want the guy to ask you out, then one thing you can do is to bring up some things you both like. [8] X Research source [v161898_b01]. 19 August 2021. That way, he has more of an opportunity to ask you for your number because he can think of an excuse to do it. [9] X Research source Here are some ways you can mention the things you like in order to get the guy to feel more comfortable about asking for your number: Mention a movie that's playing in theaters. If you think it's something you both may like, he might ask you to go with him. Bring up a band you both like. If you're both talking about music, you can use it as an opportunity to mention a band that's playing in town. Saying, \"Have you heard of Animal Collective? They're actually coming to town at the end of the month\" can plant a seed in the guy's mind. Talk sports. If you're the kind of girl who likes sports, then you can say something like, \"I've been watching the As for a few years now, but I still haven't gone to a game.\" This can make it easier for the guy to ask you to come along. Bring up your favorite foods. Maybe you both love Mexican food or Ethiopian food. If a new restaurant opened in town, or if you've been dying to try the food at a certain place, bring it up and see if he bites. Reader Poll: We asked 600 wikiHow readers who've initiated a conversation with their crush, and 53% of them agreed that the best conversation starter is complimenting or commenting on a shared interest. [Take Poll]"
    },
    {
      "title": "Talk about your plans.",
      "content": "Talk about your plans. Bringing up something you're doing in the near future can make the guy more likely to ask for your number because he'd like to come along. Find a way to casually bring up something you're doing in the middle of the conversation and see if he expresses an interest in joining. If he does, then he'll have almost no choice but to ask for your phone number. Here are some things you can say: Mention a party you're going to that weekend. He may want to come along. Talk about an awesome class you're taking, whether it's a kickboxing or rock climbing class. He may want to try it. If you and a bunch of your mutual friends are going on a weekend trip, talk about it casually and see if he wants to come along."
    },
    {
      "title": "Casually let him know you like hanging out with him.",
      "content": "Casually let him know you like hanging out with him. You don't have to say, \"Please please ask for my phone number!\" for him to get the picture. If you're spending a bit of time together, whether you're just hanging out after school or taking a long lunch together during work, you can make some subtle comments that could lead him to want to spend even more time with you. [10] X Research source Here are some things you can say: \"I always have so much fun talking to you.\" \"This has been such a crazy conversation. I can't remember the last time I laughed so hard.\" \"It's always really easy to talk to you.\" You can also find a way to make it pretty clear that you don't have a boyfriend. He may be afraid to ask for your number because he may think you're dating someone else."
    },
    {
      "title": "Pull out your phone.",
      "content": "Pull out your phone. Though you shouldn't be rude and text your friends or answer the phone while you're talking, at some point in the conversation, if you want to hint that you want him to ask for your number, you should take out your phone for a second or two. Maybe you'll do it to see who is texting you. Maybe you'll take out your phone to show him a picture of your cat or something else you were talking about. [11] X Research source Just pulling out your phone for a second will make him realize that hey, you're a cute girl with a phone, and that he should probably get your number. Make sure you don't flash your phone for long, though. He may think you're not that interested in him if you do this."
    },
    {
      "title": "Leave when the conversation is getting good.",
      "content": "Leave when the conversation is getting good. If you want the guy to ask for your number, then you can't linger around until you both have nothing to say, or he won't want to hang out again. Instead, wait until the conversation is really going somewhere, and before there's a lull, excuse yourself, saying that you really have to go but that you loved talking to him. If it works, then he'll say something like, \"I'd love to pick up this conversation soon\" or \"I'd like to spend more time with you.\" [12] X Research source If the guy gets the message, he will ask for your digits. And if he doesn't, have patience -- it sometimes takes time for a guy to work up the courage to ask for your number. And hey, if you're pretty sure that the guy likes you but he's proven too shy to ask for your number, what's stopping you from taking the initiative and asking for his digits?"
    }
  ]
}