{
  "url": "https://www.wikihow.com/Make-a-Person-Happy",
  "title": "How to Make Someone Happy No Matter Who They Are",
  "steps": [
    {
      "title": "Offer them encouragement.",
      "content": "Offer them encouragement. If someone you know is going through a difficult time, chances are they need a little cheering up. Let them know that you believe in them and that they're capable. Try saying something like: “You are strong.” “You can get through this.” “You gave it your best shot!” “This is a temporary setback. You can and will do it!”"
    },
    {
      "title": "Assure them that you’re there to listen.",
      "content": "Assure them that you’re there to listen. Sometimes, the best thing you can do to make someone happy is to be a shoulder to cry on. [1] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Let your loved one know that you’ll always be there to support and listen to them . Tell them, “I’m here if you want to talk,” or ask them directly, “What can I do to help?” To be a good listener, you must be an active listener . [2] X Research source Help your loved one process their thoughts and feelings by asking follow-up questions like, “If I’m hearing you right, you’re saying…” and “So, you’re feeling…” Avoid pressuring them into talking. They’ll come to you when they’re ready."
    },
    {
      "title": "Give them a sincere compliment",
      "content": "Give them a sincere compliment . One of the best ways to make someone smile is by telling them just how amazing you think they are. Boost their confidence by noting something you like about their outfit, hair, or their personality. [3] X Research source In order to make a compliment stand out and be more unique, highlight something you’ve recently learned about their skill set or psychology or something you’ve read recently and apply that to the compliment. [4] X Expert Source Kim Chronister, PsyD Clinical Psychologist Expert Interview. 28 July 2021. You could say: “I love your shirt! Where did you get it?” “Your smile can light up a whole room.” “You’re working so hard on this project, and it’s really paying off.” “You’re such a thoughtful person.” “I enjoy talking to you.”"
    },
    {
      "title": "Thank them for everything they do.",
      "content": "Thank them for everything they do. Whether you’re chatting with a loved one or a stranger, everyone deserves to be thanked! Expressing gratitude is a great way to brighten someone’s day. By showing your appreciation, you’ll remind them to appreciate themselves. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Simply tell them you are grateful for their presence or energy or their words, as people are rarely reinforced and crave to be seen in many cases. [6] X Expert Source Kim Chronister, PsyD Clinical Psychologist Expert Interview. 28 July 2021. Try saying something along the lines of: “I can’t thank you enough for all you do for me!” “I really appreciate you helping me with this. You’re the real MVP!” “I’m so grateful to have you in my life.” [7] X Expert Source Kim Chronister, PsyD Clinical Psychologist Expert Interview. 28 July 2021. “You did all this yourself? Thank you!”"
    },
    {
      "title": "Tell them a silly joke",
      "content": "Tell them a silly joke . Sometimes, all you need is a corny joke to break through the sadness. Believe it or not, humor has many psychological benefits, including helping people cope with stress and grief. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Share something funny with them to make them smile despite their woes. After all, it’s for their health. Here are some jokes to get you started: What do you call a nosy pepper? Jalapeno business. What do you do with a sick boat? You take it to the doc. What cheese can never be yours? Nacho cheese. What do you call a can opener that doesn’t work? A can’t opener."
    },
    {
      "title": "Call to check in on them.",
      "content": "Call to check in on them. Even the smallest gesture can make the biggest difference. If you know a loved one is having a rough time, pick up the phone and give them a quick call to say hi. Hearing your voice and knowing that you’re thinking about them could be enough to make them smile. If they don’t pick up, no worries! Leave an uplifting message they can listen to later."
    },
    {
      "title": "Take a loved one someplace special.",
      "content": "Take a loved one someplace special. Distracting a friend, family member, or partner from their pain or grief can be as simple as bringing them to their favorite store. Give them something to look forward to that’ll help keep their mind off their woes. Bring them to the movies, on a coffee date, or to the park. Pick something they enjoy and go from there. If your loved one declines your offer to go out, that’s okay. Take baby steps and let them know the offer will still stand when they’re ready."
    },
    {
      "title": "Leave them a heartfelt note.",
      "content": "Leave them a heartfelt note. If you know someone isn’t feeling the best, try leaving a note with a positive message where they can find it. Maybe you put it in their lunchbox, on the bathroom mirror, or next to their computer. Whether you know them really well or not, this is an easy way to brighten their day. The note could say: “You’re awesome!” “Smile. It looks great on you :)” “The universe has your back—keep doing you!” “I believe in you. You got this!” “You are strong and capable.”"
    },
    {
      "title": "Send them something special.",
      "content": "Send them something special. Be spontaneous and do something unexpected for a friend, family member, or colleague. If you know they’re having a rough day, have their favorite food delivered, give them flowers, or text them a funny video. Give them a little something that you know will make their day that much better. [9] X Research source If you see something at the store that reminds you of them, pick it up and gift it to them out of the blue. This is an excellent way to remind them that they’re meaningful."
    },
    {
      "title": "Make them a care package",
      "content": "Make them a care package . Stuff a box with cheerful goodies to give a friend, teacher, partner, or colleague when they’re feeling low. Not only is this sure to put a smile on their face, but it assures them that there are people who care about and appreciate them. Here are some things you can put in your care package: [10] X Research source Their favorite snacks and candy Fuzzy socks Movie tickets A book Candles Lotion A mug A coloring book"
    },
    {
      "title": "Practice small acts of kindness",
      "content": "Practice small acts of kindness . Sometimes, even the simplest things can turn someone’s day around. Offer to hold the door open for a stranger, carry someone’s groceries, run an errand, or clean up the living room. Your gesture doesn’t have to be grand but simply kind. [11] X Research source You can also share a favorite book or recipe, give up your seat on the subway, ask someone about their day, or leave a generous tip at a restaurant. Ask yourself what you could do to make someone’s day easier. Follow this daily, and you’ll make every person you meet a little happier. Try doing five random acts of kindness each day, as they’ll not only benefit others but improve your self-esteem as well. [12] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Reader Poll: We asked 1019 wikiHow readers how they prefer to help someone, and only 6% of them agreed that the best way to do so is by making their favorite food. [Take Poll] While this can be a great gesture, try to find out if there’s anything you can do to take some stress off of them."
    },
    {
      "title": "Volunteer to help",
      "content": "Volunteer to help someone in need. A simple and free way you can brighten someone’s day is to donate your time. By helping others, you’re not only lifting other people's spirits but your own as well! Ask your neighbors or local organizations if there’s any way you can lend a helping hand. [13] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Libraries, hospitals, nursing homes, food pantries, and homeless shelters are generally very open to taking on volunteers. Volunteering is also a great way to connect with new people."
    },
    {
      "title": "Do your best to be happy.",
      "content": "Do your best to be happy . Have you ever heard the expression that you can’t fill someone else’s cup if yours is empty? Well, the same applies to happiness. Happiness is contagious, and by surrounding yourself and others with positive, happy people, you’re sure to lift yourself and others’ spirits. Do things throughout your day that make you genuinely happy, like watching a favorite show, going for a walk, or catching up with friends. It’s okay if you’re not happy all the time—you’re not a positivity robot! Let yourself feel every feeling (even if it’s uncomfortable), and know that your emotions are temporary. Staying happy during tough situations can be difficult, even if you're a somewhat happy person. If you're struggling to find happiness, the best way to do this is to find a therapist or read books about positive psychology, as they can help you determine the ingredients for contentment and de-stressing for you as an individual. [14] X Expert Source Kim Chronister, PsyD Clinical Psychologist Expert Interview. 28 July 2021."
    },
    {
      "title": "Smile when you’re happy.",
      "content": "Smile when you’re happy. Believe it or not, smiles are contagious. When you feel happy, don’t be afraid to show it! Who knows? You may just brighten someone else’s day. [15] X Research source Did you know that smiling can boost your mood even when you’re sad? When you smile, your brain releases endorphins that can help fight off stress."
    },
    {
      "title": "Be there for others when they need you most.",
      "content": "Be there for others when they need you most. The very best thing you can do for an unhappy friend is be there for them unconditionally. Rather than leaving when things get tough, stick by their side in a way that’s healthy for you and them. Support is one of the most powerful things you can give a person, so continue being a shining light in their life. [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    }
  ]
}