{
  "url": "https://www.wikihow.com/Keep-a-Journal",
  "title": "Your Guide to Keeping a Neat, Organized Journal",
  "steps": [
    {
      "title": "Choose a notebook if you want to write by hand.",
      "content": "Choose a notebook if you want to write by hand. When you think about journaling, you probably think of a notebook and pen. Use any notebook you like and feel comfortable with. Pick a plain notebook if you want to decorate it, or select a nice journal if you want something more stylish. [1] X Research source For a budget friendly option, look for a spiral notebook or composition book in the school supplies section. If you want a fancy journal, visit a bookstore or the office supplies section of your local department store."
    },
    {
      "title": "Pick a word processor if you prefer to journal on the computer.",
      "content": "Pick a word processor if you prefer to journal on the computer. You might find it more convenient to type your journal entries. Use your preferred word processor to keep your journal. Create a new document at set intervals, such as each month or year. Then, save all of your journal entries into the same folder. For instance, you might create a new journal document each month. Your folder might include saved files titled “January 2020,” “February 2020,” “March 2020,” etc. Any word processor will work. For instance, use Word, Pages, or Notepad. If you choose Google Drive, you can access your journal from all of your devices. This means you can write entries on your computer, tablet, or phone. If you don’t mind making your ideas public, try keeping a blog ."
    },
    {
      "title": "Decide what kind of journal you'd like to keep.",
      "content": "Decide what kind of journal you'd like to keep. Use your journal in a way that helps you by setting a purpose for your journal. Consider why you want to keep a journal and how you hope it will help you. Then, pick a type of journal to keep. Here are some common options: A personal journal to write about your daily life, your thoughts, and your feelings about what you’re going through. A gratitude journal to record the things you’re grateful for each day. [2] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source A therapy journal to help you work through an issue or to support your recovery. [3] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source A travel journal to document the places you go, what you do on your trips, and your impressions of the places you visit. [4] X Research source An art journal includes images, sometimes along with text. Draw, paint, and/or collage inside your journal."
    },
    {
      "title": "Choose a topic to write about.",
      "content": "Choose a topic to write about. It’s so frustrating staring at a blank page with no ideas! Fortunately, it’s easy to find a source of inspiration for a journal entry. Write about the first thing that comes to your mind. If your mind is totally blank, use one of these ideas to get started: [5] X Research source Describe what’s going on in your life. For instance, you might write about a party you went to or a conversation you had. Reflect on a memory. As an example, write about a great day you had with your grandparent or the time you lost a friend that you still miss. Explore your emotions or feelings. If you're going through a hard time, write about how sad you feel and what you hope will change. [6] X Expert Source Catherine Boswell, PhD Licensed Psychologist Expert Interview. 29 December 2020. Record your dreams. For instance, let's say you had a dream that you were flying. You might write about the experience, how it felt, and what it might mean. List what you’re grateful for. As an example, you might list off your cat, your family, your singing voice, and your group of friends. Explore something that scares you. For instance, you could write about your fear of closed in spaces. Use a writing prompt, which you can find online. Try prompts like, \"Explain what your favorite movie means to you,\" \"Describe your response to seeing a ghost,\" \"Write about dream vacation.\""
    },
    {
      "title": "Write the date and location at the top of your page.",
      "content": "Write the date and location at the top of your page. You’ll likely go back and re-read some of your old journal entries in the future, and having the date and location will help you understand them. Put the month, day, and year at the top corner of the page. Then, write your location under it. [7] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source For instance, “March 10, 2020, Sitting in a coffee house.”"
    },
    {
      "title": "Begin with an opening like “Dear Diary” or “Dear Self” if you like.",
      "content": "Begin with an opening like “Dear Diary” or “Dear Self” if you like. You don’t need to use an opening for your journal entries. However, you might find that it helps you get into the flow of writing. If you use an opening, write it in the left top corner on the first line of your entry. You might write, “Dear Journal.”"
    },
    {
      "title": "Use the first-person pronoun “I” throughout your journal.",
      "content": "Use the first-person pronoun “I” throughout your journal. You’ve probably gotten into the habit of avoiding the pronoun “I” in your writing because it’s frowned upon in academic writing. However, you can do anything you want in your journal, and your entries are about you. Use “I” to talk about yourself in your journal. [8] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source For example, you’d write something like, “I finally tried that new coffee shop today.”"
    },
    {
      "title": "Write freely without self-editing your journal entries.",
      "content": "Write freely without self-editing your journal entries. When you’re journaling, jot down your thoughts as they come to you. Don’t worry about making sense, using proper sentences, or making errors. Focus on what you need to say and avoid re-reading what you’ve already written. Keep writing until you feel like you’ve reached the ending. [9] X Research source For instance, don’t pause and read over what you’ve already written. It doesn’t matter if you’ve made mistakes or gotten lost in what you were trying to say. Your journal entry doesn’t need to make sense to anyone but you."
    },
    {
      "title": "Get creative with your formatting if you like.",
      "content": "Get creative with your formatting if you like. Journaling is a great opportunity to express your creativity. Experiment with your journal entries to try out different ways of expressing yourself. Here are some ideas for how to get creative: [10] X Research source Write a poem. Draw pictures to go along with your writing. List your thoughts instead of writing them out. Turn a memory into a story. Write down song lyrics that are meaningful right now. Paste in mementos from your day, like a movie ticket, a bus ticket, a flyer, or receipt."
    },
    {
      "title": "Ignore grammar or spelling rules when journaling.",
      "content": "Ignore grammar or spelling rules when journaling. You don’t need to worry about making grammar or punctuation errors in your journal. In fact, it’s okay if you want to ignore punctuation altogether! Similarly, don’t stop to check your spelling. Allow yourself to freewrite without worrying about writing rules. [11] X Research source For instance, you might decide to write stream of consciousness. This means writing all of your thoughts as they come to you without worrying if they’re complete sentences are not."
    },
    {
      "title": "Incorporate interesting sensory details to make your entries more vivid.",
      "content": "Incorporate interesting sensory details to make your entries more vivid. Sensory details evoke your 5 senses of sight, sound, scent, touch, and taste. Including these details makes your entries more interesting and helps you remember the event more clearly. Look for opportunities to include these details when you’re describing events or memories from your life. [12] X Research source As an example, let’s say you went to the beach. You might include details like, “The breeze felt cool when it struck my face,” “I tasted salt on my tongue,” “I could smell the seaweed that had washed onto the shore,” “A grey mist hovered over the ocean, but I could still see a boat in the distance,” and “The lapping waves lulled me into an afternoon nap.”"
    },
    {
      "title": "Don’t worry about the length of your journal entries.",
      "content": "Don’t worry about the length of your journal entries. It’s okay to set a goal for how long you want your journal entries to be. However, give yourself permission to write as much or as little as possible. A few sentences every day is better than a full page every once in a while. Write down what comes to you, but allow yourself to stop when you feel like the entry is over. [13] X Research source For instance, you might have some days where you just jot down a quick list. On other days, you might write several pages. Let yourself be flexible."
    },
    {
      "title": "Set a goal",
      "content": "Set a goal to write a journal entry every day, even if it’s very short. The best way to form a habit is to do it everyday. This can be really challenging at first, so you’ll probably have some days that you forget to write. Challenge yourself to write every single day, whether it’s a short list or a long entry. Over time, this will become a habit. [14] X Research source If you have a day that you’re super busy, just try to write down 3 things that happened that day. You might write, “1) I did a lot of work today, 2) I tried the new Italian restaurant - it was yummy, 3) I took a nice walk after dinner.” It’s okay if your entries don’t look the same everyday."
    },
    {
      "title": "Pick a convenient time to write to make it part of your routine.",
      "content": "Pick a convenient time to write to make it part of your routine. You’re probably already busy, and finding time to write might be hard. To help you stick to your habit, choose a time in your day where journaling would naturally fit. [15] X Expert Source Catherine Boswell, PhD Licensed Psychologist Expert Interview. 29 December 2020. Then, try journaling during those moments. Here are some ideas: [16] X Research source Write in your journal while you drink your morning coffee. Journal during your commute if you’re not driving. Write journal entries during lunch. Journal while dinner is cooking. Write while you’re watching evening TV. Journal right before you go to bed."
    },
    {
      "title": "Carry your journal with you if you can.",
      "content": "Carry your journal with you if you can. You might find it easier to stick to your habit if your journal is always with you. This way, you can pull out your journal and write whenever you have a few spare moments. Carry a hardcopy journal in your bag or use a word processor that allows you to journal on your phone or tablet. [17] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source For example, you might journal while you’re waiting at the doctor’s office or while you’re waiting for someone who is running late. If you keep a digital journal, one option is to type your entries into your email on your phone and send it to yourself. Then, copy and paste the entry into your made journal later."
    },
    {
      "title": "Reflect on past entries when the timing feels right.",
      "content": "Reflect on past entries when the timing feels right. One of the great things about journaling is that it’s therapeutic. However, it works best if you read over old journal entries and reflect on them. Pick a time when you’re feeling open to dealing with your past issues and how they’re still affecting you. [18] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For instance, let's say you had trouble coping after you lost your job. After you've gotten a new job, you might look back over your old entries to help you remember that your worries never came to pass. This might help you stay more positive and resilient when you face rejection again. This can help you delve deeper into your thoughts and feelings. Additionally, it’ll help you see your progress in overcoming an issue."
    },
    {
      "title": "Keep your journal in convenient spot if you don’t need to hide it.",
      "content": "Keep your journal in convenient spot if you don’t need to hide it. Depending on your situation, you may not worry about people spying on your journal. If this is the case, place it somewhere you can easily use it. This will help you keep up with your habit. For instance, you might keep it on your bedside table to remind you to journal every morning when you wake up or every evening before bed. Similarly, you might keep it in the kitchen near your coffee pot so you can retrieve it every morning."
    },
    {
      "title": "Hide your journal in a secure spot if you’re worried someone will spy.",
      "content": "Hide your journal in a secure spot if you’re worried someone will spy. You might be worried that someone is going to read your deepest secrets. If you live with potential spies, choose a hiding place for your journal or password protect it. This will keep your secrets safe. [19] X Research source For example, you might hide your journal under your clothes in your dresser. Alternatively, you might slide it between your mattresses. Switch up your hiding place or password every once in a while so that people don’t figure it out."
    }
  ]
}