{
  "url": "https://www.wikihow.com/Make-Graham-Balls",
  "title": "How to Make Graham Balls",
  "steps": [
    {
      "title": "Pour your crushed graham crackers into a medium-sized bowl.",
      "content": "Pour your crushed graham crackers into a medium-sized bowl. You can buy crushed graham crackers or crush them yourself. [1] X Research source You can make as many graham balls as you have ingredients for, but 2 cups of crushed graham crackers is a good place to start and will make about 6 graham balls. Crushing graham crackers takes a little bit of time and energy. If you prefer to crush the crackers yourself, try using a mortar and pestle ."
    },
    {
      "title": "Add 1/3 cup of sweetened condensed milk.",
      "content": "Add 1/3 cup of sweetened condensed milk. Pour the condensed milk over the crushed graham crackers and mix it all together with a plastic spatula until combined. Aim for a slightly clumpy sandy mixture. It shouldn't be too wet or too dry and should stick together slightly. [2] X Research source"
    },
    {
      "title": "Roll your graham balls.",
      "content": "Roll your graham balls. Scoop out a heaping tablespoon into the palm of your hand and roll it between your palms until it becomes rounded. [3] X Research source Make sure you have washed your hands first!"
    },
    {
      "title": "Press your graham ball into a flat disk.",
      "content": "Press your graham ball into a flat disk. Holding the ball in the palm of your hand, gently press down on it with your other hand. Apply pressure gently to create an even and flat surface. Don't press too hard or your dough might crumble. Don't worry about the edges cracking slightly, you will be rolling it back up into a ball again later anyway."
    },
    {
      "title": "Add your favorite filling.",
      "content": "Add your favorite filling. Press a few mini marshmallows or even chocolate chips into the center of the flat graham ball. Read on for some creative filling suggestions in the next section. Make sure not to overfill your ball! Keep your marshmallow in the center and in a small pile. If you try to put too much filling inside your graham ball, it won't be able to close properly. [4] X Research source"
    },
    {
      "title": "Fold your graham ball back into a ball shape.",
      "content": "Fold your graham ball back into a ball shape. Once you have a few marshmallows in the center of your disk, carefully fold the edges up and together as you gently press down on the center. Bring the edges together on the top of your ball. The goal is to fold the dough over completely, covering the filling inside."
    },
    {
      "title": "Smooth the edges.",
      "content": "Smooth the edges. After folding the sides over, hold your graham ball between your palms and gently roll it back into a ball, applying a slight pressure. Repeat the steps to create more graham balls."
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! You can munch on your graham balls right away or chill them in the refrigerator for about 5–10 minutes beforehand. [5] X Research source Dust them with powdered sugar or coconut flakes and enjoy them with a glass of milk. You can even wrap your graham balls up and give them out as gifts or party favors. You can store your graham balls for 2 weeks in an airtight container in the refrigerator, otherwise, plan to eat them within a couple of days."
    },
    {
      "title": "Experiment with the filling.",
      "content": "Experiment with the filling. Try breaking up your favorite candy bar and putting a few pieces inside. You can also mix different candy bars or use half marshmallow and half candy. Try melting your filling in the microwave and scooping it into your graham ball. If you are looking for an alternative to marshmallows and candy, try filling your graham ball with raspberry jam and dried fruit or nuts! You can even fill your graham balls with peanut butter."
    },
    {
      "title": "Have some fun with the decorating.",
      "content": "Have some fun with the decorating. You can roll your graham ball in a bowl of powdered sugar or coconut flakes, but there are a lot of other things you can try as well. Roll your graham balls in a bowl of sprinkles or dip them into melted chocolate. You can also drizzle chocolate syrup over your graham balls. [6] X Research source Try sprinkling some chopped nut on top or all over the surface of your graham balls."
    },
    {
      "title": "Frost them.",
      "content": "Frost them. Cover your graham balls with chocolate, vanilla, or any frosting you prefer to make delicious cake pop graham balls!"
    },
    {
      "title": "Get creative with the shapes.",
      "content": "Get creative with the shapes. Your graham balls don't have to be round. You can use cookie cutters to make all kinds of shapes. Create heart-shaped graham balls or use holiday themed cookie cutters for a great holiday snack. These will be more like cookies. Don't try to put a lot of filling into a graham ball that you plan to make into a cookie cutter shape. Instead, cover it with creative toppings! Using cookie cutters might make your graham balls thin in some areas, which could cause them to crumble. Chill them in the refrigerator for a few minutes so they can get firm."
    },
    {
      "title": "Create the ultimate graham ball.",
      "content": "Create the ultimate graham ball. Gather a bunch of fun ingredients and invite some friends over to experiment with the endless possibilities of graham balls. Create a bunch of different kinds and try them all!"
    }
  ]
}