{
  "url": "https://www.wikihow.com/Grow-Oysters",
  "title": "How to Grow Oysters",
  "steps": [
    {
      "title": "Choose oysters with desirable traits like strong shells or plentiful meat.",
      "content": "Choose oysters with desirable traits like strong shells or plentiful meat. As with any other animal or organism, you want to choose only the best of the best when looking for the oysters that will produce your oyster spawn. Select a few oysters to farm that will act as the parents for your upcoming crop of shellfish. [1] X Research source Factors like the depth of the shell, the speed at which they grow, and the amount of meat they contain are all significant factors when choosing a good quality parent oyster. As oysters are sequential hermaphrodites, they switch back and forth between being male and female over the course of their lives. As long as you have a good number of oysters to parent your new crop, you will likely have an assortment of males and females."
    },
    {
      "title": "Let the oysters ripen and produce gametes in a breeding tank.",
      "content": "Let the oysters ripen and produce gametes in a breeding tank. Once you've selected a good range of oysters, you need to prepare them for breeding. Set up a large breeding tank, around 120,000 litres (32,000 US gal), and fill it with ocean water that has been warmed. Put the oysters into the tank and leave them for 2 months to begin putting on a gonad, which will produce the gametes needed to breed your oysters. Gametes are the cells, either sperm or eggs, that the oysters will produce and release in order to create new oyster spawn that you can feed and grow. Bigger oysters will produce more gametes than smaller oysters, so having larger oysters in your tank will result in a larger crop of oysters. The oysters will still need to be continually fed as they grow a gonad, which is why warmed ocean water has to be used. This will contain the phytoplankton that the oysters will feed off of. You'll need a constant supply of warm ocean water for 2 months to keep the oysters alive while they prepare to spawn. The breeding tank will usually be a massive plastic tank capable of holding the 120,000 litres (32,000 US gal) of water, which can continually cycle new water in. This is a piece of specialty equipment needed to breed oysters, so it would have to be custom-ordered."
    },
    {
      "title": "Transfer the oysters to spawning trays to release the gametes.",
      "content": "Transfer the oysters to spawning trays to release the gametes. After 2 months of warm water, the oysters will be ready to breed. Shift the oysters into a spawning tray, or a shallow trough, filled with water that is around room temperature. Within a day or so, you should see oysters releasing gametes into the water, where the sperm will fertilize the eggs. [2] X Research source The spawning tanks will need water that is between 20 to 30 °C (68 to 86 °F) and with a salinity of 10ppt to trigger the oysters to release gametes. Much like the breeding tank, the spawning tank will need to be continually provided with food from the ocean to keep the oysters alive. Spawning tanks are normally long and shallow troughs with pipes that allow new water to be heated and cycled in as needed."
    },
    {
      "title": "Feed and protect the fertilized eggs to help them grow.",
      "content": "Feed and protect the fertilized eggs to help them grow. It will take roughly 2 weeks for the larvae to grow to the point where they will begin developing a shell. Pour the water from the spawning tanks into much larger tanks so they have room to grow, and begin feeding them with filtered seawater. They will slowly develop from being near invisible fertilized eggs into larvae the size of a piece of dust. [3] X Research source This is the equivalent of the gestation period in other animals. The oyster larvae must be taken care of, fed well, and kept away from predators during this time. The oysters feed on phytoplankton naturally found in ocean water, so you will need to be constantly cycling ocean water into the tanks as the oysters grow. These tanks will need to be the same size as the breeding tanks, around 120,000 litres (32,000 US gal)."
    },
    {
      "title": "Place the grown larvae into a setting tank.",
      "content": "Place the grown larvae into a setting tank. Oyster larvae will reach a point where they need a tiny amount of calcium carbonate to begin forming their shells. Transfer the larvae from the large tanks into wider setting tanks and a source of calcium carbonate. Over the course of 4 to 5 weeks, each oyster will attach to some calcium carbonate and continue growing. [4] X Research source The most common source of calcium carbonate is old oyster shells which have been finely ground into a sand. In the wild, oyster larvae will attach to old oyster shells and grow from there, leading to large clumps of oysters growing in the same place. The setting tanks are a much wider, longer, and deeper version of the spawning tanks. They'll need to be provided with food from ocean water that the oysters need to grow their shells. As the oysters are still tiny at this point, the ocean water will need to be filtered so that only phytoplankton can get in, and anything that may harm the oysters will be kept out. Over this period, the oysters will go from looking like a grain of dust to being around the size of a flake of ground pepper."
    },
    {
      "title": "Grow the oysters in an upweller for around 2 to 3 days.",
      "content": "Grow the oysters in an upweller for around 2 to 3 days. An upweller is another tank designed for growing oysters that will constantly pump nutrients and water through to the oysters. Once the oysters have grown their shell, move them into an upweller to keep growing. Over the course of a day or so, they will double in size. When they grow to be around 0.64 centimetres (0.25 in) in size, they’re ready to be cultured. Oysters that are ready to be grown and cultivated will be around the size of a fingernail on your pinky finger. All oysters will grow at different rates, so you should remove them to be cultured when they are the right size, rather than after a set period of time."
    },
    {
      "title": "Bottom-culture your oysters for stronger shells and a free-range look.",
      "content": "Bottom-culture your oysters for stronger shells and a free-range look. Bottom-culturing your oysters is a process wherein the oysters are left to grow on the seafloor by themselves. This will result in a stronger shell, but also gives you less control over the oysters. It is most similar to the way oysters would grow in the wild. [5] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source Bottom-culturing doesn’t require a lot of special equipment to grow oysters, but also means that you don’t have anything to protect the oysters. As such, you’re likely to lose a lot of oysters to the elements, the ocean, or predators."
    },
    {
      "title": "Let your oysters grow in a mesh bag in the ocean for around 4 months.",
      "content": "Let your oysters grow in a mesh bag in the ocean for around 4 months. Before they can be scattered over the ocean floor to grow by themselves, the oysters will need to be a little bigger. Put them in a mesh bag or cage that will stop predators from getting to them. Submerge the oysters in the ocean for 4 months or so, or until they are between 3.8–5.1 centimetres (1.5–2.0 in) long. [6] X Research source The goal with this portion of culturing your oysters is to get them as big as possible before putting them into the ocean. This will stop them from being eaten as easily and make them more likely to last through winter."
    },
    {
      "title": "Scatter your oyster seeds over the bottom of a muddy bay to continue growing.",
      "content": "Scatter your oyster seeds over the bottom of a muddy bay to continue growing. Collect all of your oysters from the mesh bags or cages and bring them to a muddy bay or beach where they can grow. Begin scattering the oysters across the seafloor, trying to spread them evenly within an area that you can easily keep track of. [7] X Research source Both sandy and rocky beaches will work, but mud will work best for culturing oysters. The oysters won’t stick to it the way they may to rocks, and it will be heavy enough that it won’t cover the oysters the way that sand will."
    },
    {
      "title": "Wait 1 1/2 to 3 years for your oysters to grow to their full size.",
      "content": "Wait 1 1/2 to 3 years for your oysters to grow to their full size. On average, oysters will grow roughly 2.5 centimetres (0.98 in) every year. In order to get the oysters between 6.4–7.6 centimetres (2.5–3.0 in) that you may be familiar with, you’ll need to leave your oysters for around 2 years to let them grow. [8] X Research source Some states and countries will have limitations on how long you need to leave oysters to grow before you are able to harvest them. Make sure you check your local laws to see if there are any restrictions you need to abide by. The upside of bottom-culturing is that there is very little that you need to do over this growing period. You should be able to leave the oysters mostly unattended while waiting for them to grow."
    },
    {
      "title": "Pick oysters off the seafloor to harvest them.",
      "content": "Pick oysters off the seafloor to harvest them. After your oysters have had plenty of time to grow, you can easily harvest them by simply picking them up off the seafloor. Use a basket with holes in it to pick up the oysters, keeping them submerged until you are able to put them on ice to store them. [9] X Research source Professional oyster growers will use long metal rakes designed specifically for lifting oysters from the seafloor to collect them. This will make harvesting easier but isn’t necessary. When sorting through your oysters, if you find any that aren’t big enough, you can return them to the ocean to let them continue growing. For best results, put them in a mesh bag and put them back in the ocean, checking on them every month or so. [10] X Research source"
    },
    {
      "title": "Use off-bottom culturing to have more control over your oysters.",
      "content": "Use off-bottom culturing to have more control over your oysters. Off-bottom culturing is a method of growing oysters where they are kept off of the seabed as they grow. There are many types of off-bottom culturing, including cage culturing, rack-and-bag culturing and floating culturing, but all revolve around growing oysters in bags or cages floating in the water. [11] X Research source Here are a few advantages and disadvantages to off-bottom culturing: Off-bottom culturing requires more equipment than bottom culturing, as you will need cages, bags, racks, and buoys to grow the oysters. This makes the start-up cost of off-bottom culturing much more expensive than bottom-culturing. Off-bottom culturing requires the oysters to be “tumbled” as they grow. Tumbling is a process wherein the cages or bags are shaken around regularly to strengthen the shell, mimicking the natural tumbling that happens to bottom-cultured oysters. This makes off-bottom culturing more care intensive, but also results in better-looking oysters. As the oysters are kept off of the seafloor and protected by cages, it’s far less likely that any will be lost as they grow."
    },
    {
      "title": "Transfer your oyster seeds to a mesh oyster grow-out bag.",
      "content": "Transfer your oyster seeds to a mesh oyster grow-out bag. This is a large bag made of a robust mesh where the oysters will be given a chance to grow naturally. Each bag should be able to hold around 1,500 oysters. Attach the bag to something that will keep it in place on top of the water, or place it in a cage where it can float in the ocean to let the oysters grow. [12] X Research source The first bag you use will need to have very small holes in the mesh to prevent the smaller oysters from falling out. Start with a 4 mm (0.16 in) mesh bag for oysters just coming out of the hatchery. One way to keep the bags in place and floating in the ocean is by attaching them to a long wire strung between poles in the ocean. The wire should sit at around sea-level so that the oysters still get the effects of the waves when clipped onto it. This is rack-and-bag culturing. You can also put the bags in larger cages that will sit on stilts in the ocean, keeping the oysters around sea-level as they grow."
    },
    {
      "title": "Tumble your oysters every 5 to 10 days to strengthen their shells.",
      "content": "Tumble your oysters every 5 to 10 days to strengthen their shells. In order to keep the shells of your oysters thick and round as they grow, you should tumble them every few days, especially when they are still young. With the grow-out bag still sealed, shake the oysters around vigorously for a few seconds before returning them to the water to grow. [13] X Research source This isn’t an essential part of off-bottom culturing but it will result in much better oysters once they are fully grown."
    },
    {
      "title": "Move the oysters to bags with a larger mesh as they grow.",
      "content": "Move the oysters to bags with a larger mesh as they grow. Around 3 to 6 months after the oysters are taken from the hatchery and put into their first grow-out bag, some of them will need to be moved into a bigger bag. Check each grow-out bag you have every 3 to 6 months, and move the bigger oysters into a different bag with a larger mesh. This will give them more room to grow and help keep track of oyster sizes over time. [14] X Research source The mesh sizes of different bags will change between different manufacturers, but a should shift from bags that are roughly 4 mm (0.16 in), to 9 mm (0.35 in), to 18 mm (0.71 in), to a 23 mm (0.91 in) bag over the course of around 2 years. While you’ll be able to fit around 1,500 oysters straight from a hatchery in one bag, less and less will fit in each bag as they grow. By the time you reach a 23 mm (0.91 in) bag, you may only be able to keep 100 to 200 in each."
    },
    {
      "title": "Give the oysters between 1 1/2 to 3 years to grow.",
      "content": "Give the oysters between 1 1/2 to 3 years to grow. Full-sized oysters that are ready to be harvested are usually around 6.4–7.6 centimetres (2.5–3.0 in) in length. Depending on the conditions in which you are growing your oysters, it can take between 1 1/2 to 3 years for the oysters to reach their optimum size. Have patience and check on your oysters frequently to watch them grow."
    },
    {
      "title": "Pull in the grow-out bags to begin harvesting your oysters.",
      "content": "Pull in the grow-out bags to begin harvesting your oysters. After 2 to 3 years, you can simply pull in the bags to begin harvesting your oysters. Empty one bag at a time out onto a large surface where you can begin sorting through them. Any oysters that are big enough can be kept on ice to be eaten, with any smaller oysters tossed back into the bag to keep growing. [15] X Research source Off-bottom cultured oysters are much easier to harvest than bottom cultured oysters, as you don’t need to search the seabed to find oysters of the right size. It takes more work but is also more organized."
    }
  ]
}