{
  "url": "https://www.wikihow.com/Let-Someone-Go",
  "title": "How to Let Someone Go",
  "steps": [
    {
      "title": "Let yourself feel.",
      "content": "Let yourself feel. First things first, grief is good. Emotion is good. Crying is good. Anger is good. Whatever it is, it's probably normal and needs to be let out. Once the hiding-under-the-covers phase is over, the process can start. But there's a definite linear process to letting go, and the hiding-under-the-covers phase (also known as the crying-over-a-tub-of-ice-cream phase or the less work-friendly dying-your-hair-a-strange-color phase) has to come first. Let it. The first thing you'll probably feel is denial, followed by anger. It won't sink in as real and then when it does, the words that were exchanged and the exchanges that were had will evoke frustration and pain. Instead of tormenting yourself not only for the break up but for how you're handling the break up, know that this is how it works. These emotions you're feeling are a part of you. You're not crazy and you're not worthless. You're just human."
    },
    {
      "title": "Don't glorify the past.",
      "content": "Don't glorify the past. You may find yourself reliving all the great moments you had together. In bed, you'll be scanning them like a broken record. But if you had the person back, 10 minutes later you'd be thinking, \"That's right. That's why it wasn't working.\" It's just hard to remember all the crap when you're caught up in such intense emotion. Know that if you do find yourself pining over great memories, you're not seeing it realistically. If you need some science to back it up, know that emotion is proved to affect memory. So when you're searching desperately for the good, your mind may even formulate new twists to meet your current expectations. Basically, your memory is putting on rose-colored glasses to meet your current thought process."
    },
    {
      "title": "Distance yourself as much as possible.",
      "content": "Distance yourself as much as possible. \"Letting go\" is basically a euphemism for forgetting. For not giving a care, anymore. This sounds a little harsh, so that's why it's given the friendlier term. That being said, distancing yourself from the person is the only way you can get on the fast-track to forgetting. You know that shirt you found in the back of your closet that made you say, \"Oh my god, I loved this shirt! How in the world did I not realize it was missing?\" Yep. Out of sight, out of mind. This is much, much, much easier said than done for a lot of people, sure. But you can take efforts to limit how much time you have to spend in this person's general vicinity. Use it as an excuse to dive into a new passion, find a new hotspot to hang out in, or a new group of people to occasionally go out with. Do not revamp your life to accommodate this person, but do keep your best interests in mind. Reader Poll: We asked 1129 wikiHow readers who've broken up with their partner, and only 4% of them agreed that you should suggest staying friends. [Take Poll] Trying to stay friends with your former partner can lead to more confusion and pain, so it might be best to cut off all contact until you heal."
    },
    {
      "title": "Don't put you second.",
      "content": "Don't put you second. After you're angry and sad and making bets with the devil that you'll never be this dumb again, you'll probably spend a few days/weeks/what will seem like an eternity wondering where it all went wrong, feeling like you're wandering through a fog. It'll be tempting to stop functioning, but you can't. You mustn't. For you. For the betterment of your world, you have to keep going. This is where you do whatever you need to do. \"You\" comes first right now. Whatever will make you happy, do it (as long as it's not harmful, of course). So go paint the town red. If you can't talk your friend through the fact that someone stole her ham sandwich at work, so be it. You get some time to be selfish. Your mantra should be \"me, me, me.\" Why? Because you rock."
    },
    {
      "title": "Don't blame all of (wo)mankind.",
      "content": "Don't blame all of (wo)mankind. You're going to come out of this shortly (at which point the \"me, me, me\" phase should be replaced by \"me, you, me, you\"), and the last thing you want is to hold a global grudge. Being jaded and cynical does not equate to \"learning from an experience\" -- it's more akin to giving up. Try hard to see the best in people. It's out there. It's just hiding sometimes. Not all men are scum and not all women are conniving. Maybe you have a penchant for the conniving scum, but that's an issue in and of itself. Take a thorough look at the types of people out there -- how much diversity can you find? Bet there's a ton. That's why they call it diversity."
    },
    {
      "title": "Keep the negative thoughts at bay.",
      "content": "Keep the negative thoughts at bay. The beauty of your mind is that it's a part of you and that it can be controlled. If the negative thoughts start, you have the power to stop them. The train of thought you get on is one you can hop right off. Sometimes it takes a few tricks, but it's doable. Put your negative thoughts into a cartoon character voice. Donald Duck is a good one. Try saying, \"I hate myself for being such an idiot\" in his voice. A little hard to take seriously, huh? Consciously hold your head up. Keeping it up cues your body that you're present and prideful. Keeping it down resonates in your shame centers and can actually make you feel worse. This little movement can determine so much."
    },
    {
      "title": "Lean on your friends.",
      "content": "Lean on your friends. Your absolute best resource right now will be your support network. They'll keep your mind off things and just keep you going. Don't be afraid to ask them for their help -- they've probably all been there too! Ask them to help you not dwell. You need to talk about your feelings, definitely, but a time limit on. Ask them if you can have 15 minutes of their time to talk but after that, you're not interested in pointless analysis and regret. They'll keep you from drowning in your woes."
    },
    {
      "title": "Find who you were and love it.",
      "content": "Find who you were and love it. Fact of the matter is you're probably awesome and this is just a minor setback. Chances are you've felt this way before and overcame it, so why won't you this time? If you've bounced back once, you can bounce back twice. You're resilient, you've just forgotten that you're resilient. Keep on living, and the letting go will come. It's when you stop living that you can't let go. When you live (seeking opportunities, enjoying life, surrounding yourself with the things and people you love), the letting go happens on its own and you'll barely even notice. Think back to who you were prior to this. What did you love? What made you you? How fantastic were you?"
    },
    {
      "title": "Assess your standards.",
      "content": "Assess your standards. This person clearly never appreciated you in all your glory in the first place -- so they're not worth your time. Not \"Are they worth your time?\" or \"Maybe they're not worth your time,\" but they are 100% no-ifs-ands-or-buts-about-it not worth your time. You deserve someone who sees you, sees your value, and wants to be an active part of your life. Those that don't can hit the road. Take a moment to concentrate on self-awareness. Look at yourself as objectively as possible. Was there something about the relationship that was safe because it was unreal? Does the guarantee that you'll never get hurt because there's zero commitment reassure you? If this even touches on the truth, this has all to do with you and nothing to do with this other person. They're just a symbol you've placed meaning onto."
    },
    {
      "title": "Assess your happiness.",
      "content": "Assess your happiness. Whether you're the other (wo)man or this is just an intense crush, were you as happy as you could be with this person? Odds are you probably weren't and were longing for the relationship like the one you have in your head. How much was reality and how much of it was wishing, hoping, and projecting? Clearly this relationship didn't meet your needs, or you wouldn't feel the need to let them go. Know that. Let it sink in. This didn't meet your needs, but another one will. The only thing is that in order to find that other one, you need to let go of this one. Well, that's what you're here for! Step one? Check."
    },
    {
      "title": "Don't wait around.",
      "content": "Don't wait around. Life is too short not to start living now . This other person has been out living, so why don't you take a leaf out of their book and do the same? It's only fair. This doesn't mean jumping into a new relationship -- but it does mean staying social and trying your hardest to enjoy yourself. Don't wait around in hopes things will change. You'll be waiting for an awfully, awfully long time. Generally speaking, the best way to predict future behavior is to look at past behavior. Since past behavior has led to heartbreak, why would future behavior be any different? That's right; it wouldn't. Chances are there's a part of you that knows all these things. That knows this relationship wasn't the best for you and that sees the logic in moving on (it's why you're here, after all.) Regardless of how small that part is, give it the reigns for at least a few hours a day. Let it protect the hurting you. It knows what you need to feel better -- whether it's a wine night with the girls, a nice, long daily jog, or that vacation you've meaning to take. Whatever it is, put it in the books."
    },
    {
      "title": "Keep your physical distance.",
      "content": "Keep your physical distance. Now that you've decided to keep your mental distance, it's imperative that you stay away in body, too. The only way the inner torment will stop is if the person isn't around. If this is controllable (they aren't a coworker, for example), do it. The process will go much, much faster. This does not give you an excuse to stay at home instead of going to class/the gym/out with friends. However, it does give you an excuse to alter your routine. Always go to the same cafe? Find a new one. A certain gym? Go at a different time. Hell, pick up an entirely new hobby!"
    },
    {
      "title": "Be clear.",
      "content": "Be clear. If the person is in your life, they're going to ask questions. There's no use in making up some lame excuse as to why you're avoiding them -- it'll all come out in the wash eventually. Your best bet is an incredibly diplomatic version of the truth. No one can script your situation but you. However, something to the effect of, \"I need some time to myself to reevaluate what's best for me,\" is a line no one can refute. If they don't like it, all the more reason to walk (or run) away."
    },
    {
      "title": "Don't beat yourself up.",
      "content": "Don't beat yourself up. This is not a failure on your part. This is life. It happens to everyone and you know what? You'll learn from it. You learned from the last heartache and got over it and this one will be no different. You didn't do anything wrong. At the time, whatever you did you believed was right. That's all you can do. Wishing you did something differently, acted differently, said something differently is fruitless. You are who you are and if things didn't work out -- well, then something else was meant to. Changing yourself is an exhausting process that only results in resentment and fatigue. Beating yourself up for being you is just silly! Who else are you supposed to be?!"
    },
    {
      "title": "Focus on you.",
      "content": "Focus on you. It's high time for \"me\" time. Not only is this for your sake, but it's for the sake of all your future relationships. Without some closure and some figuring out who you are, nothing and no one will succeed. This isn't you being selfish; this is you being logical. What do you enjoy? Come up with at least 5 things and do them in the next two weeks. Eventually, there will come a time when you've let go, but you won't notice. You'll be far too busy thinking about the life you're leading to take note. When you realize it months down the line though, it'll feel really, really good."
    },
    {
      "title": "Practice releasing regrets.",
      "content": "Practice releasing regrets. When a loved one passes, all of a sudden we're bombarded with the things we should've done or should've said or did do and did say but wish we didn't. Regrets can't be wished away, however, and dwelling just leads to more suffering. Wouldn't this person want you to be happy? Regrets often involve forgiving ourselves. There's no manual for self-forgiveness unfortunately, and the only thing you can do remember that you're human. You're human and you loved to the best of your ability. Now it's time to concentrate on the present."
    },
    {
      "title": "Grieve.",
      "content": "Grieve. The five stages of grief are denial, anger, bargaining, depression, and acceptance. In that order. However, know that no two people grieve the same . However you need to do it, whether it's balled up in the corner with a teddy bear or running until the backs of shins hurt, do it. You'll be better in the long run. Anyone else's preconceptions as to what grieving is can be shoved you know where. How you feel compelled to handle it is how you should handle it. As long as you're treating yourself and others with care (read: not turning to drugs, alcohol, and the like), it's okay."
    },
    {
      "title": "Don't grieve alone.",
      "content": "Don't grieve alone. Right now, you and the loved ones around you need to join together. Sometimes, when you grieve with others, it feels a lot less like grieving. The combined efforts of everyone can make the time pass a lot quicker. If you feel like you're the only one going through this and no one else is grieving, just the company of others can help. Having someone hold your hand can let you know that you're not alone. That things will be okay. Seek support in those around you, whoever they are."
    },
    {
      "title": "Reconnect with you.",
      "content": "Reconnect with you. At one point or another, there was a you that existed outside, independently of this relationship. And it still does. It's just a matter of finding your old you once more. With a little brushing off, they'll be good as new. Reconnect with people and things from your past. What used to fill you with zest? What made you come alive? What is something that you always wish you had the time or energy to take part in? And the last, most important question: What better time than now?"
    },
    {
      "title": "Look to the future.",
      "content": "Look to the future. The only reason it isn't bright is because you're wearing shades. The future holds just as many promises as it did six weeks, six months, or six years ago. It's just a matter of what you make from it. Instead of dwelling on the past, think of tomorrow. What might it bring? When you hold onto the past, you have no room to hold onto the future. You could be missing out on an entire world out there. Would your loved one want that? In order to find love, you have to give and receive it. You can't do anything if your hands are full holding onto what used to be."
    },
    {
      "title": "Write a positive letter of goodbye for closure.",
      "content": "Write a positive letter of goodbye for closure. Everything you never said, put down in this letter. Keep it positive, concentrating on their life and how much joy they brought to you. It's up to you to choose what to do with it. You can either keep it in a place close to your heart, send it away on a wave of ocean water, or light it on fire and watch the smoke rise to the skies."
    },
    {
      "title": "Know that \"letting go\" will happen.",
      "content": "Know that \"letting go\" will happen. Will. Not might, should, can, or could. Will. The only modal verb that applies to this situation is \"will.\" For some it will take longer than others, but it will happen. Until then...relax. Let time run its course. It heals all wounds. When it starts to happen, you may not even notice. You'll be changing and growing so much that your eyes don't dart back to who you used to be. Maybe that time is now. Maybe you've started on the process and you're just too close to the painting to be able to tell. Could that be? Stupid question. Yes. Yes, it could."
    },
    {
      "title": "Make it as positive as possible.",
      "content": "Make it as positive as possible. \"Nothing is either good or bad, but thinking makes it so.\" This friendship that you're about to lose doesn't have to be a bad thing. It's a symbol of growth and maturity. It shows the world that you've found your path and it's not one to be shared. That's all. It's not you abandoning another soul or being uncompromising -- it's you doing what you're supposed to do. Every experience and every relationship has value. However, some people are supposed to be part of our memories, not part of our destiny. And that's fine! It takes all kinds. Be thankful for the experiences you had because they let you grow. They made you the awesome person you are today."
    },
    {
      "title": "Surround yourself with others.",
      "content": "Surround yourself with others. This friendship was turning you into a person you don't want to become (and yes, friendships have the power to do that). These toxic friendships can be draining and seep into other domains of your life. The only way to get around this is to slowly immerse yourself into a different group. A different group that makes you feel good. If you don't have a Plan B, you will. You may have to find one. It'll be scary, but if it's too easy, it's not worth it. Join a club, take a class, pick up a new hobby. Allow yourself to become part of a bigger world. The bigger your world gets, the less influence this person has over you."
    },
    {
      "title": "Be kind.",
      "content": "Be kind. When you're friends with a sponge, normally the sponge doesn't know they're being sponge-y. The last thing you want to do is lash out in a fit of anger -- after all, you were friends at a point for a reason. Some part of you cares for this person. When they ask you what's going on, be truthful, but kind. If you're at a loss as to what to say, just tell them what you've been telling yourself. \"We're on different paths and that's fine. I still value you as a person, but our friendship is based on the person I was, not the person I am. Your behavior brings me down and I don't want to be at the receiving end of it anymore.\" They'll have questions, and might get angry, but at the end of the day, you're better off regardless of their reaction."
    },
    {
      "title": "Distance yourself.",
      "content": "Distance yourself. Sometimes when people get something taken away from them, they want it even more. This friend may start calling even more than they did before. Even if they've sworn they've seen the error of their ways, don't buy it just yet. You need some time to analyze you, to step back and see the situation as it actually is. And so do they. If they want to talk to about it, tell them that. You both need some time apart from each other to see what it's like without the other. You need to step a bit back from the painting to see what the picture really is. If a few weeks pass and you find yourself wanting to see them and they feel similarly, take it slow. Once in a while, people do learn things."
    },
    {
      "title": "Know what you're looking for in future friends.",
      "content": "Know what you're looking for in future friends. It'd be terrible to abandon one friend just to replace them with their doppelganger. So when you go about finding this new group of amazing counterparts, what do you want them to be like? What do you value in others? This may take a bit of self-analysis, too. What was it you liked about your other friend that put you two together? What do you need from them that they couldn't provide you? What are three things any friend of yours needs to be?"
    },
    {
      "title": "Focus only on what can be changed.",
      "content": "Focus only on what can be changed. This friend you had is a person all their own. You can't change them, try as you might. And that's fine. They are who they are and you are who you are. No crimes there. But since it can't be changed, no use spending energy on it. Focus on what can change to make you happier. Your environment, for one, can change. Your outlook can change. Your needs can change. Focus on just one of these aspects as you start growing. Getting more in tune with you will make the right path a lot clearer."
    }
  ]
}