{
  "url": "https://www.wikihow.com/Increase-Your-Income",
  "title": "How to Increase Your Income",
  "steps": [
    {
      "title": "Talk to your employer about a raise",
      "content": "Talk to your employer about a raise . One of the most direct ways to increase your income is to talk to your boss about a pay raise. Though it can be a tricky conversation to have, if you feel you are doing a good job at work and have been putting in long hours, it may be time to ask for a pay bump. Consider how valuable your position at the company or business is, your relationship with your boss, and the skill set you provide for the company. If you have been working at the same company for over a year, have been doing a great job, and have received a good score on your performance reviews, you may have a good case for a raise. [1] X Research source Before you ask for a raise, you should do some research on your company's pay policies and make sure you have enough leverage to justify a raise. You should also make a list of your accomplishments, abilities, and outline your work history. This will give you objective information you can use during your conversation with your boss about a raise."
    },
    {
      "title": "Do freelance work or part time work.",
      "content": "Do freelance work or part time work. If your pay check isn't quite cutting it, consider increasing your income by doing freelance work outside of your day job. Take odd jobs for family or friends that will add funds to your bank account. Remember that every penny you earn is one more dollar towards your overall income. [2] X Research source For example, you may have good driving skills and a clean driving record. You may want to consider taking up a part time driver position to supplement your income, working on weekends to drive new cars to dealerships or the drive clients around through a driver company. [3] X Research source"
    },
    {
      "title": "Start a side business",
      "content": "Start a side business . Think about skills or abilities that you can channel into a viable side business. This could be a gardening or landscaping side business, or a freelance writing business. Try to maximize your skills and turn them into a unique business. Keep in mind running your own business will require a significant time and money investment, in addition to your current job. [4] X Research source Starting your own business can be stressful and difficult to sustain, so you may want to retain your current job while you get your side business off the ground. Want more ways to make extra money? Check out what wikiHow users are saying on our Best way to make some extra money? forum ."
    },
    {
      "title": "Create sources of passive income.",
      "content": "Create sources of passive income. Passive sources income are investments that create income with little involvement and time from you. This could be royalties from publishing a book, a song, or a piece of art, profits from a business partnership where you are a silent investor, or income from rental properties. [5] X Research source Consider investing in a rental property, preferably several multifamily units rather than one single family home. Though a rental property can be a large upfront investment, the potential income generated from this investment could be substantial. Ask a friend or business partner to invest with you in a rental property and create passive income to supplement your existing income."
    },
    {
      "title": "Purchase stocks and bonds.",
      "content": "Purchase stocks and bonds. A stock represents a stake in a company. When you own a share of a stock, you are a part owner in the company and have a claim on every asset and every penny in the company's earnings. [6] X Research source A bond is a financial IOU from a company or the government. Companies and governments issue bonds to fund their day-to-day operations or to finance specific projects. When you buy a bond, you are loaning your money to the issuer, whether it's a company or a government body, for a certain period of time. In return, you get interest on the loan, and you get the entire loan amount paid back either on a specific date (the bond's maturity date) or a future date of the issuer's choice. For example, if a bond is valued at $1,000, and pays 7% a year, it has an interest value of $70. You can invest in stocks and bonds by buying them individually or by buying them via a mutual fund. A mutual fund is a collection of stocks, bonds, or cash equivalents, or a mix of all three. [7] X Research source Talk to a financial advisor about the right mix of stocks and bonds for your financial portfolio. When you are young and just starting to invest, you should put money in stocks. The long term potential growth of stocks will outweigh the risks. Over time, as you get older, you should scale back on your investment in stocks. Bonds are less volatile and they are good long term investments. Over time, as you get older, increase your investment in bonds. [8] X Research source Be wary of investing in hard assets like real estate or gold. These are unstable and unpredictable assets that can be difficult to manage. [9] X Research source"
    },
    {
      "title": "Consider investing in penny stocks.",
      "content": "Consider investing in penny stocks . Penny stocks are publicly-traded stocks that have a very low price per share, usually under five dollars and sometimes less than a dollar. They are often issued by small, less established companies and can be purchased very cheaply. However, penny stocks can be risky investments because they are not traded on the major exchanges (NASDAQ or the NYSE) and it may be difficult to trade them once you purchase them. Penny stocks are good for short term gains and not as long term investments. Before you invest in a company, you should investigate them online to determine if they are worth the stock purchase. You can then open an account with an online brokerage service and start purchasing and trading penny stock. To make a profit with penny stocks, you will need to keep constant tabs on your stocks to make quick trades at the highest price. Be wary of “pump and dump” stocks, which are fraudulent stocks that are pumped up to a high stock price, enticing you to invest, only to take your money and leave you with a stock that has no real value. [10] X Research source"
    },
    {
      "title": "Reduce your rent.",
      "content": "Reduce your rent. If you are renting an affordable apartment or living space, focus on cutting down on other expenses like your internet costs, your cellphone, and your food costs. Reducing your expenses by $10-$20 a month can add up to more funds in your checking account and a higher income. [11] X Research source Focus on stacking savings on top of one another to add up to a large amount of money saved. This means embracing a frugal lifestyle and not spending money when you do not need to."
    },
    {
      "title": "Bike or walk to work, rather than drive.",
      "content": "Bike or walk to work, rather than drive. One of the biggest expenses is likely your car. From the car itself to car maintenance and insurance, it can be a big money suck. When possible, bike to work or to run errands rather than pay to fill up your gas tank and using your car. [12] X Research source Investing in a good bike means a small payment of $500-$1,000 that will provide you with free transportation for a long period of time, possibly for life. That gas money can then go towards increasing your overall income."
    },
    {
      "title": "Avoid eating out.",
      "content": "Avoid eating out. On average, most U.S. households spend 12.9% of their income on food a year. [13] X Research source Reduce the amount of money you spend on food by cooking your own meals and only eating out once or twice a year. There are several budget friendly food blogs and books with recipes that take a short amount of time and won't break your budget. [14] X Research source Make grocery shopping part of your weekly routine. Take a list of grocery items to the store to avoid expensive spontaneous purchases or buying unnecessary items."
    },
    {
      "title": "Do free leisure activities.",
      "content": "Do free leisure activities. Minimize your recreational spending by looking for free activities in your area or city. Go for hikes or walks, attend free street fairs or local events, and take advantage of entertainment that doesn't involve spending money. [15] X Research source"
    },
    {
      "title": "Get into a do-it-yourself lifestyle.",
      "content": "Get into a do-it-yourself lifestyle. Do home repairs yourself, and maintain your car to avoid costly repairs at an auto body shop. Look for how to videos online on bike repair and fix it yourself. Being your own handyman means you will have the skills to complete tasks yourself and avoid paying someone for these services. [16] X Research source"
    }
  ]
}