{
  "url": "https://www.wikihow.com/Make-Chalk-Paint",
  "title": "How to Make Chalk Paint",
  "steps": [
    {
      "title": "Choose your chalk.",
      "content": "Choose your chalk. Thick sidewalk chalk works the best for this. You can also use regular chalk, like the kind teachers use on chalkboards. If you want something more vibrant, you could try soft chalk pastels ( not the oil kind). This method creates a washable sidewalk chalk. It will not work on furniture or DIY chalkboards."
    },
    {
      "title": "Grind chalk into a powder.",
      "content": "Grind chalk into a powder. The easiest way to do this would be with a food grater. [1] X Research source If you don't have any graters on hand, place the chalk into a plastic bag, then smash it with a hammer until it is fine and powdery. If you are using a food grater, make sure it's not one that you actually cook with. Use a separate one."
    },
    {
      "title": "Mix the chalk with some water.",
      "content": "Mix the chalk with some water. Pour the powdered chalk into a plastic container. Stir in up to ½ cup (120 milliliters) of water. [2] X Research source If you used regular chalk or a chalk pastel, try 1/4 to 1/3 cup (60 to cc milliliters) instead. Plastic food containers and clean, empty yogurt containers work great for this. If the paint is too thin, add some more chalk. If the paint is too thick, add in a little bit more water."
    },
    {
      "title": "Use the paint.",
      "content": "Use the paint. Dip a paintbrush into the paint, then draw designs on the sidewalk or driveway. Let the paint dry, then marvel in your artwork. To clean up the sidewalk or driveway, simply wash it down with water."
    },
    {
      "title": "Place 6 tablespoons (45 grams) of cornstarch into a bowl.",
      "content": "Place 6 tablespoons (45 grams) of cornstarch into a bowl. This recipe is great for making washable sidewalk paint. [3] X Research source It is not recommended for furniture or DIY chalkboards. If you can't find cornstarch, look for cornflour instead (but not cornmeal)."
    },
    {
      "title": "Slowly stir in some cold water into the cornstarch.",
      "content": "Slowly stir in some cold water into the cornstarch. You will need a little less than ¼ cup (60 milliliters) of water. Stir the two together with a whisk until the cornstarch dissolves. Do not over-mix, however, or the cornstarch will start to turn solid. If you can drizzle the cornstarch water from your whisk, you're ready for the next step. [4] X Research source"
    },
    {
      "title": "Stir in some food coloring.",
      "content": "Stir in some food coloring. You can use either the liquid kind or the gel kind. You can also use liquid watercolor instead. How much you add is completely up to you. The more you add, the darker, deeper the color will be. Start with a few drops, and see how you like it. [5] X Research source"
    },
    {
      "title": "Use the paint.",
      "content": "Use the paint. Dip a paintbrush into the paint, then paint designs onto your sidewalk or driveway. Let it dry and admire your work. When you are done, simply wash it away with water. Although this paint is washable, it can stain light surfaces. Be careful!"
    },
    {
      "title": "Have your surface ready to paint.",
      "content": "Have your surface ready to paint. This recipe dries quickly; you won't be able to store the paint for later use. Have your work surface covered and your brushes laid out. If the surface you are going to paint needs to be sanded or cleaned, do this now. [6] X Research source This recipe is perfect for making DIY chalkboards. You can use this recipe to paint furniture as well."
    },
    {
      "title": "Mix some grout with water.",
      "content": "Mix some grout with water. Place 2 tablespoons (30 grams) of non-sanded grout into a mixing container. Stir in 1 tablespoon (15 milliliters) of cool water. You want the consistency to be smooth. The container needs to be large enough to hold at least 1 cup (240 milliliters)."
    },
    {
      "title": "Stir some paint into the grout mixture.",
      "content": "Stir some paint into the grout mixture. Pour 1 cup (240 milliliters) of latex or acrylic paint into the grout mixture. Stir it in well until the consistency is smooth. You will need to stir for a good 5 minutes or so. [7] X Research source"
    },
    {
      "title": "Apply two coats of paint.",
      "content": "Apply two coats of paint. Use a paintbrush or a foam brush to apply your first coat of paint. Let it dry for a few hours, then apply a second one. [8] X Research source You can use acrylic or latex paint. [9] X Research source If you are painting a DIY chalkboard, consider using dark green or black paint."
    },
    {
      "title": "Allow the paint to cure for 3 days.",
      "content": "Allow the paint to cure for 3 days. This is very important. If you use your surface too soon, the paint may come off or turn gummy. [10] X Research source"
    },
    {
      "title": "Condition the surface if you are using it as a chalkboard.",
      "content": "Condition the surface if you are using it as a chalkboard. If you plan on using your surface as an actual chalkboard, you should prime it. To prime the chalkboard, simply coat the entire surface with a piece of chalk, then wipe it off with a dry cloth. [11] X Research source Skip this step if you painted a piece of furniture that you don't plan writing on."
    },
    {
      "title": "Make a basic recipe with Plaster of Paris.",
      "content": "Make a basic recipe with Plaster of Paris. Mix together 2½ tablespoons (31 grams) of Plaster of Paris and 1½ tablespoons (22.5 milliliters) of cool water. Stir in 1 cup (240 milliliters) of latex paint."
    },
    {
      "title": "Make distress-able paint with calcium carbonate.",
      "content": "Make distress-able paint with calcium carbonate. Combine 2 tablespoons (25 grams) of calcium carbonate with 1 tablespoon (15 milliliters) of water. Stir this into 1 cup (240 milliliters) of latex paint. [12] X Research source This paint works well in paint sprayers. This paint is great for painting furniture and then distressing it with sandpaper. You can find calcium carbonate powder in health food stores and online. [13] X Research source"
    },
    {
      "title": "Make durable paint with both calcium carbonate and Plaster of Paris.",
      "content": "Make durable paint with both calcium carbonate and Plaster of Paris. Mix together 2 tablespoons (25 grams) of calcium carbonate powder, 2 tablespoons (25 grams) of Plaster of Paris, and 2 tablespoons (30 milliliters) of cool water. Add 2 cups (475 milliliters) of latex paint and stir well. [14] X Research source This paint durable. It does not scratch or distress easily."
    },
    {
      "title": "Use baking soda with care.",
      "content": "Use baking soda with care. Baking soda is more readily available than calcium carbonate and Plaster of Paris. The resulting finish is very grainy, however. If the texture doesn't bother you, you can prepare baking soda chalk paint by stirring ⅓ cup (60 grams) of baking soda into ⅔ cups (160 milliliters) of paint. If the paint is too thick, try dissolving ½ cup (90 grams) of baking soda in 3 tablespoons (45 milliliters) of water, then adding it to 1 cup (240 milliliters) of latex paint."
    }
  ]
}