{
  "url": "https://www.wikihow.com/Make-Orbeez",
  "title": "How to Make Orbeez: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Grab a package of Orbeez in-store or online.",
      "content": "Grab a package of Orbeez in-store or online. Visit a craft or toy store to find Orbeez, and choose a package in your favorite color or one with a mix of colors. Packets come in a variety of sizes that can contain as little as 100 or as many as 10,000 Orbeez. [1] X Research source"
    },
    {
      "title": "Pour the Orbeez into a container.",
      "content": "Pour the Orbeez into a container. Use a pair of scissors to open the packet, making sure not to spill any tiny beads on the ground. Carefully dump the contents of the package into a large bowl. If you do spill the Orbeez, no worries! Simply use a vacuum to clean them up."
    },
    {
      "title": "Add 1 cup (240 mL) of warm water for every 100 Orbeez.",
      "content": "Add 1 cup (240 mL) of warm water for every 100 Orbeez. Pour the water into a bowl on top of your water beads. Make sure you use enough water, as this helps each bead grow to the correct size. Use clean, distilled water to help your Orbeez grow to their maximum diameter of 14 millimetres (1.4 cm). [2] X Research source Warm water helps the water beads grow faster compared to using cold or room temperature water. [3] X Research source If you want to make the Orbeez last longer, add a pinch of salt to the water. The Orbeez won’t be as large, but they won’t dry out as fast. Always follow the instructions on your Orbeez packet regarding how much water you should add."
    },
    {
      "title": "Soak the Orbeez in the water for at least 2 hours.",
      "content": "Soak the Orbeez in the water for at least 2 hours. The Orbeez will slowly grow to about 100 times their original size. Check on them every hour to make sure they’re still covered in water. If they’re not, add an additional 1 cup (240 mL) of water to the bowl. [4] X Research source If the Orbeez aren’t perfectly round, they haven’t soaked up enough water. Leave them in the water until they’re symmetrical spheres."
    },
    {
      "title": "Strain the Orbeez to remove excess water.",
      "content": "Strain the Orbeez to remove excess water. Extra water may be at the bottom of the bowl you soaked your Orbeez in. Pour the entire bowl into a strainer to remove the leftover water, and then transfer the Orbeez back into the bowl."
    },
    {
      "title": "Play with your Orbeez.",
      "content": "Play with your Orbeez. Now all that’s left to do is have some fun! Run the water beads through your fingers, bounce them on the ground, make a stress ball , or invent a game with them. Check out these fun and unique games you can play with your Orbeez: Mini bocce ball Marbles Mini croquet Mini golf Chinese checkers Bingo"
    },
    {
      "title": "Store Orbeez in a resealable bag or container for a week.",
      "content": "Store Orbeez in a resealable bag or container for a week. When you’re finished playing with your water beads, put them into an airtight container or a plastic bag. This way, they won’t dry out super quickly, and you can play with them again later. [5] X Research source If your Orbeez do dry out, no worries! Re-soak them in warm water to make them grow."
    },
    {
      "title": "Dispose of Orbeez in the trash or reuse them in a garden.",
      "content": "Dispose of Orbeez in the trash or reuse them in a garden. Never, under any circumstances, pour Orbeez down the drain, as they could clog your pipes. Instead, when you’re done playing with them, or they’ve grown moldy, toss them in the trash. You can also recycle them by adding them to a potted plant’s soil, as they can help retain moisture so you don’t have to water as often. [6] X Research source"
    },
    {
      "title": "Pick up a bag of tapioca pearls or boba balls online or at the store.",
      "content": "Pick up a bag of tapioca pearls or boba balls online or at the store. Tapioca pearls or boba balls are available at most grocery stores, Asian markets, and online retailers. They’re small white balls that typically come in a bag. [7] X Research source These pearls or balls are food-safe and commonly used to make boba drinks, so they’re perfect for making water beads for younger children who may put them in their mouths. Tapioca pearls and boba balls are the same thing, except tapioca pearls are usually translucent, making them perfect for DIY water beads."
    },
    {
      "title": "Boil 4 cups (950 mL) of water.",
      "content": "Boil 4 cups (950 mL) of water. Pour the water into a large pot, and place the pot over high heat on the stovetop. Cover the pot with a lid and wait 10 to 15 minutes for it to reach a boil. Open the bag of tapioca pearls while you wait. [8] X Research source Depending on the size of your pot, it may take slightly more or less time to boil the water, so keep an eye on it."
    },
    {
      "title": "Pour the bag of tapioca pearls into the boiling water.",
      "content": "Pour the bag of tapioca pearls into the boiling water. Make sure all of the pearls are submerged in the water. Use a wooden spoon to stir them around for about 10 seconds to keep them from sticking together. Keep the heat at a high temperature for 1 to 2 minutes to begin cooking the pearls. [9] X Research source If the pearls aren’t submerged, add 0.5 cups (120 ml) of water at a time until they are."
    },
    {
      "title": "Simmer the pearls in the water for 20 minutes.",
      "content": "Simmer the pearls in the water for 20 minutes. Lower the heat to medium-high, and let the pearls cook and expand. Stir them occasionally but don’t try to break them apart, as this could ruin their round shape. The pearls will separate on their own as they cook. [10] X Research source The pearly are fully cooked when they look like little bubbles with a milky white center."
    },
    {
      "title": "Strain and rinse the pearls in a colander.",
      "content": "Strain and rinse the pearls in a colander. Pour the contents of the pot into a strainer, and run cool water over the pearls. Rinse the pearls until they’re cool to the touch. [11] X Research source If any pearls break during this process, simply remove them from the strainer."
    },
    {
      "title": "Play with your tapioca pearl water beads.",
      "content": "Play with your tapioca pearl water beads. Once the pearls have cooled down, they’re ready to be played with. These water beads are great sensory stimulation for children and adults alike. Put the finished water beads in a container and run them between your fingers. [12] X Research source Try using your DIY water beads to make temporary sensory bottles or marble art. Keep in mind that the starch of the tapioca pearls could leave a residue on your fingers or playing surface, unlike store-bought Orbeez."
    },
    {
      "title": "Store your water marbles for a week in a container in the fridge.",
      "content": "Store your water marbles for a week in a container in the fridge. Like most foods, tapioca pearls or boba balls will spoil if left uncovered in a warm place. Put your homemade water beads in an airtight container or bag, and place them on a shelf in the refrigerator. [13] X Research source Avoid using the pearls for making food or drinks after you’ve played with them to avoid spreading germs and bacteria. Dispose of the water beads after a week or when they start to smell or grow moldy."
    }
  ]
}