{
  "url": "https://www.wikihow.com/Maintain-Car-Batteries",
  "title": "How to Maintain Car Batteries",
  "steps": [
    {
      "title": "Clean the battery terminals",
      "content": "Clean the battery terminals with water and baking soda. First, identify the positive side of the battery by finding the red cap. Always disconnect the negative side first. Turn the bolt connecting the wires to the negative terminal counterclockwise and lift the wire up. Do the same for the positive side, making sure you don't touch the 2 wires to any metal parts of the car. Then make a 1:1 mixture of baking soda and water. Dip a hard-bristle brush into the solution and scrub both battery terminals. Wipe the terminals down with a wet rag when you're done. Remember to reconnect the battery properly when you’re finished. Always reconnect the positive terminal first. Rust and corrosion on the battery terminals inhibits its performance and lifespan."
    },
    {
      "title": "Coat the battery terminals in terminal spray to prevent corrosion.",
      "content": "Coat the battery terminals in terminal spray to prevent corrosion. After you’ve cleaned the battery terminals, protect them from further corrosion with terminal spray. Hold the can 4 inches (10 cm) from the terminal and spray until the connection is coated. Then spray the other terminal. [2] X Research source Spray after the battery is reconnected to protect the terminal and connection point from corrosion. Terminal spray is available from auto parts stores. Only use products that are designed for use on battery terminals."
    },
    {
      "title": "Tighten the hold-down to prevent the battery from rattling around.",
      "content": "Tighten the hold-down to prevent the battery from rattling around. Excessive vibration can damage the battery over time. The hold-down bar keeps the battery stable and prevents vibration damage. Test your battery hold-down by opening the hood and shaking the battery. If the battery moves, the hold-down is too loose. Locate the bolts connecting the hold-down to the battery. They're usually along the top of the battery, where the hold-down bar stretches across. Use a socket wrench and turn the bolts clockwise to tighten them. [3] X Research source There are different types of hold-downs on different cars. The most common type is a bar stretching across the top of the battery. This is easy to locate. Some cars use a hold-down pad instead. These are along the base of the battery. Look here if you don't see a bar across the top of the battery. [4] X Research source If the hold-down is damaged in any way, replace it right away. New parts are available at auto parts stores."
    },
    {
      "title": "Wrap the battery in a battery heater to prevent damage from the cold.",
      "content": "Wrap the battery in a battery heater to prevent damage from the cold. If you live in a cold climate or winter is on its way, a battery heater can prevent your battery from dying in the cold. These are basically jackets that fit over the battery and keep it warm. Get a battery warmer from your auto parts store and follow the installation instructions for the product. [5] X Research source There are 2 main types of battery warmers. The first is insulated fabric that wraps around the battery. These are cheaper but less effective. The second is a rubber wrapping that inflates when you plug it in. This provides more insulation for the battery. For some warmers, you have to remove the battery completely to cover it. On others, the warmer wraps around the battery while it’s still installed. Follow the instructions on whichever product you use."
    },
    {
      "title": "Check the battery fluid level and add distilled water if it’s low.",
      "content": "Check the battery fluid level and add distilled water if it’s low. Unscrew the vent caps on top of the battery and look inside each cell with a flashlight. The fluid should cover the battery plates. If it doesn’t, the level is too low. Pour in distilled water until the water covers the battery plates and reaches the bottom of the cell refill holes. Wipe off any excess fluid with a rag before replacing the vent caps. Wipe away from the cells to prevent getting dirt inside your battery. You may have to use a flathead screwdriver to pop the vent caps off. Remember to put them back on securely. Only use distilled water, not tap water. Tap water has dissolved minerals that will affect the battery’s performance. Check the battery fluid levels every time you do an oil change, or roughly every 6 months."
    },
    {
      "title": "Buy a battery that’s less than a month old when you replace yours.",
      "content": "Buy a battery that’s less than a month old when you replace yours. When it does come time to change the battery , always get a new one. Look on the side of the battery for the manufacture date. Find one that was manufactured within the last month for the best battery performance. [6] X Research source Getting a new battery is important because they deteriorate over time. A battery more than 1 month old will probably last a shorter time than a brand new one. Avoid buying a used, discount battery. These will almost certainly not last very long."
    },
    {
      "title": "Unplug any appliances when the car isn't running.",
      "content": "Unplug any appliances when the car isn't running. When the car isn't running, appliances pull power directly from the battery. Unplug all cell phones, GPS navigators, or any other appliances plugged into the charging port once you turn the car off. Don’t plug anything back in until you start the car again. [7] X Research source Don’t leave anything plugged in while the car is off. This could drain the power and result in a dead battery."
    },
    {
      "title": "Turn off the headlights and interior lights when the engine is off.",
      "content": "Turn off the headlights and interior lights when the engine is off. Just like appliances, these lights pull power directly from the battery when the car isn’t running. Once you turn the car off, turn off all the lights that are on. Don’t start them up again until you start the engine. [8] X Research source Double check to make sure your headlights are off before walking away from the car."
    },
    {
      "title": "Drive the car regularly to keep the battery charged.",
      "content": "Drive the car regularly to keep the battery charged. Car batteries recharge when you drive, so don’t leave the car sitting for weeks at a time. Take drives of at least 20 minutes once a week to give your battery enough time to recharge. [9] X Research source If you can’t drive the car for any reason, let it run for 20 minutes without moving. It’s not an ideal solution, but it will help the battery stay charged."
    },
    {
      "title": "Keep your battery charged to 12.6 volts.",
      "content": "Keep your battery charged to 12.6 volts. This is the ideal voltage for a battery charge. If the battery falls below this level, its performance and lifespan will decrease. Get a voltmeter and connect the positive lead (red) to the battery's positive terminal and the negative lead (black) to the negative terminal. Hold them there for a few seconds and wait for the meter to produce a reading. [10] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If the charge is below 12.6 volts, connect a battery charger by attaching the negative lead to the negative lead first, then connect the positive lead to the positive terminal. Recharge the battery to 12.6 volts. Always wear rubber gloves when testing and charging the battery. Test your battery every 6 months. Do it at least once when the weather has been cold because low temperatures can decrease the battery charge."
    },
    {
      "title": "Attach a trickle charger to the battery if you don’t use it for long periods.",
      "content": "Attach a trickle charger to the battery if you don’t use it for long periods. A trickle charger hooks into a power outlet and provides a steady charge to the battery. This keeps the battery at the correct charge even when you don’t drive the car. It’s a useful appliance for cars that aren’t driven often. Connect the trickle charger the same way you could connect a normal charger. Hook the negative lead to the negative terminal first, then connect the positive lead. Then plug the charger in. Leave it attached until you drive the car again. [11] X Research source Trickle chargers are popular among owners of rare or collectible cars that they don’t drive often. It’s best to use the trickle charger when the car is in a garage. This prevents debris from getting under the hood."
    }
  ]
}