{
  "url": "https://www.wikihow.com/Hypnotize-Someone",
  "title": "How to Hypnotize Someone",
  "steps": [
    {
      "title": "Find someone who wants to be hypnotized.",
      "content": "Find someone who wants to be hypnotized. It is not very easy to hypnotize someone who doesn't want it. If you are a beginner hypnotist then great it is what everyone wants. Find a willing partner who wants to be hypnotized and is willing to be patient and relaxed for the best results. Do not hypnotize someone with a history of mental or psychotic disorders, as this can lead to unintended and dangerous consequences or even worse. [2] X Research source"
    },
    {
      "title": "Choose a quiet, comfortable room.",
      "content": "Choose a quiet, comfortable room. You want your participant to feel safe and free from distraction . There should only be dim lights and the room needs to be clean. Have them sit in a comfy chair and remove any potential distractions, like TVs or other people. [3] X Expert Source Julia Lyubchenko, MS, MA Adult Counselor & Certified Hypnotherapist Expert Interview. 29 April 2020. Turn off all cell phones and music or any devices that could cause noise. Close the windows if there is noise outside. Let other people you live with know that they shouldn't bother you until you both come out."
    },
    {
      "title": "Let them know what to expect from hypnosis.",
      "content": "Let them know what to expect from hypnosis. Most people have wildly inaccurate ideas of hypnosis from movies and TV. In reality, it is mostly a relaxation technique that helps people gain clarity on problems or issues in their subconscious. We actually enter states hypnosis all the time -- in daydreams , when absorbed in music or movies, or when \"spacing out.\" With real hypnosis: You are not asleep or unconscious, ever. You are not under a spell or someone's control. You will not do anything you don't want to do. [4] X Research source"
    },
    {
      "title": "Ask their goals for being hypnotized.",
      "content": "Ask their goals for being hypnotized. Hypnosis has been shown to decrease anxious thoughts and even raise your immune system strength. It is a great tool for increasing focus, especially before a test or big event, and can be used for deep relaxation in times of stress. Knowing your subjects goals with hypnosis will help you ease them into a trance state."
    },
    {
      "title": "Ask your partner if they have been hypnotized before and what it was like.",
      "content": "Ask your partner if they have been hypnotized before and what it was like. If they have, ask them what they were told to do and how they responded. This will give you an idea of how responsive the partner will be to your own suggestions, and perhaps what things in you should avoid. People who have been hypnotized before usually have an easier time being hypnotized again."
    },
    {
      "title": "Speak in a low, slow, soothing, voice.",
      "content": "Speak in a low, slow, soothing, voice. Take your time when talking, keeping your voice calm and collected. Draw out your sentences a little longer than usual. Imagine you are trying to calm down a frightened or worrying person, letting your voice be an example. Keep this tone of voice throughout the entire interaction. Some good words to start with include: \"Let my words wash over you, and take the suggestions as you desire them.\" \"Everything here is safe, calm, and peaceful. Let yourself sink into the couch/chair as your relax deeply.\" \"Your eyes may feel heavy and want to close. Let your body sink naturally down as your muscles relax. Listen to your body and my voice as you begin to feel calm.\" \"You are in complete control of this time. You will only accept those suggestions which are for your benefit and that you are willing to accept.\""
    },
    {
      "title": "Ask them to focus on regular, deep breaths.",
      "content": "Ask them to focus on regular, deep breaths. [5] X Expert Source Julia Lyubchenko, MS, MA Adult Counselor & Certified Hypnotherapist Expert Interview. 29 April 2020. Try and get them to take organized, deep breaths in and out. Help them develop regular breathing by lining it up with yours. You should be specific: \"Breathe in deeply now, filling your chest and lungs,\" as you breath in as well, followed by an exhalation and the words \"slowly let the air out of your chest, completely emptying your lungs. Focused breathing gets oxygen to the brain and gives the person something to think about other than hypnosis, stress, or their environment."
    },
    {
      "title": "Have them focus their gaze on a fixed point.",
      "content": "Have them focus their gaze on a fixed point. It can be your forehead if you're right in front of them or a dimly lit object in the room. Tell them to choose an object, any object, and rest their eyes on it. This is where the stereotype of the dangling watch comes from, as this small object is actually not a terrible thing for someone to look it. If they feel relaxed enough to close their eyes, let them. Pay attention to their eyes from time to time. If they seem like they are darting around, give them some guidance. \"I want you to pay attention to that poster on the wall,\" or \"try and focus on the space right between my eyebrows.\" Tell them to \"Let their eyes and eyelids relax, growing heavy.\" If you want them to focus on you, you need to stay relatively still."
    },
    {
      "title": "Get them to relax their body part by part.",
      "content": "Get them to relax their body part by part. [6] X Expert Source Julia Lyubchenko, MS, MA Adult Counselor & Certified Hypnotherapist Expert Interview. 29 April 2020. Once you have them relatively calm, breathing regularly, and in-tune with your voice, ask them to relax their toes and feet. Have them focus on just letting go of these muscles, then move up to the calves. Ask them to relax their lower leg, then their upper leg, and so on up to the face muscles. From there you can circle back around to their back, shoulders, arms, and fingers. Take your time and keep your voice slow and calm. If they seem twitchy or tense, slow down and re-do the process in reverse. \"Relax your feet and ankles. Feel the muscles lighten and loosen in your feet, as if they require no effort to maintain.\""
    },
    {
      "title": "Encourage them to feel more relaxed.",
      "content": "Encourage them to feel more relaxed. Direct the attention with suggestions. Let them know they are feeling calm and relaxed. While you have a lot of things you can say, the goal is to encourage them to sink even deeper into themselves, focusing on relaxation with each inhalation and exhalation. [7] X Expert Source Julia Lyubchenko, MS, MA Adult Counselor & Certified Hypnotherapist Expert Interview. 29 April 2020. \"You can feel your eyelids getting heavy. Let them drift and fall.\" \"You are letting yourself slip deeper and deeper into a calm, peaceful trance. \"You can feel yourself relaxing now. You can feel a heavy, relaxed feeling coming over you. And as I continue to talk, that heavy relaxed feeling will get stronger and stronger, until it carries you into a deep, peaceful state of relaxation.\""
    },
    {
      "title": "Use your partner's breathing and body language as a guide to their mental state.",
      "content": "Use your partner's breathing and body language as a guide to their mental state. Repeat the suggestions a few times, much as you might repeat the verses and choruses of a song, until your partner appears to be totally relaxed. Look for signs of tension in their eyes (are they darting?), their fingers and toes (are they tapping or wiggling) and their breathing (is it shallow and irregular) and keep working on your relaxation techniques until they seem calm and relaxed. \"Every word that I utter is putting you faster and deeper, and faster and deeper, into a calm, peaceful state of relaxation.\" \"Sinking down, and shutting down. Sinking down, and shutting down. Sinking down, and shutting down, shutting down completely.\" \"And the deeper you go, the deeper you are able to go. And the deeper you go, the deeper you want to go, and the more enjoyable the experience becomes.\""
    },
    {
      "title": "Walk them down the \"hypnotic staircase.",
      "content": "Walk them down the \"hypnotic staircase. \" This technique is shared by hypnotherapists and self-hypnotists alike to bring about a state of deep trance. Ask your subject to imagine themselves at the top of a long staircase in a warm, quiet room. As they step down, they feel themselves sinking deeper into relaxation. Each step brings them deeper into their own mind. As they walk, let them know there are ten steps, and guide them down each one. \"Take the first step down and feel yourself sinking deeper into relaxation. Each step is a step further into your subconscious. You step down the second step and feel yourself getting calmer and calmer. When you reach the third step, your body feels as if it is floating blissfully away... etc.\" It can help to envision a door at the bottom as well, leading them to a state of pure relaxation."
    },
    {
      "title": "Know that telling someone what to do under hypnosis often doesn't work, and is a violation of trust.",
      "content": "Know that telling someone what to do under hypnosis often doesn't work, and is a violation of trust. In addition, most people will remember what they did under hypnosis, so even if you can get them to pretend they are a chicken, they won't be happy. Hypnosis, however, has many therapeutic benefits outside of a cheesy Las Vegas show. Help your subject relax and let go of their problems or worries instead of trying to play a practical joke. Even well-intentioned suggestions can have bad results if you don't know what you are doing. This is why licensed hypnotherapists usually help the patient determine the right course of action instead of trying to give it to them as a suggestion."
    },
    {
      "title": "Use basic hypnosis lower anxiety levels.",
      "content": "Use basic hypnosis lower anxiety levels. Hypnosis reduces anxiety , no matter what your suggestions are, so don't feel like you need to \"fix\" anyone. Simply putting someone in a trance state is a fantastic way to lower stress levels and anxiety. The act of deep relaxation, without trying to \"solve\" anything, is so rare in daily life that it can put problems and worries in perspective all by itself. [8] X Research source"
    },
    {
      "title": "Ask them to envision solutions to possible problems.",
      "content": "Ask them to envision solutions to possible problems. Instead of telling someone how to fix an issue, have them imagine themselves already succeeding. What does success look and feel like to them? How did they get there? What is their preferred future? What has changed to get them there?"
    },
    {
      "title": "Know that hypnosis can be used for a variety of mental afflictions.",
      "content": "Know that hypnosis can be used for a variety of mental afflictions. While you should seek out the advice of a trained mental health professional, hypnotherapy has been used for addiction , pain relief, phobias, self-esteem issues, and more. While you should never try and \"fix\" someone, hypnosis can be an excellent tool to help someone heal themselves. Help them envision the world beyond their problems -- imagine them going through a day without smoking, or visualize a moment they are proud of to raise self-esteem. Healing through hypnosis is always easier if they person wants to work on the issue before they enter the trance state."
    },
    {
      "title": "Know that hypnosis is only a small part of any mental health solution.",
      "content": "Know that hypnosis is only a small part of any mental health solution. The key benefits of hypnosis are relaxation and time to muse safely on an issue. It is both deep relaxation and focused attention on an issue at the same time. However, hypnosis is not a miracle cure or quick fix, it is simply a way to help people dive deeper into their own mind. This sort of self-reflection is critical to strong mental health, but serious or chronic issues should always be treated by a trained and certified professional. [9] X Research source"
    },
    {
      "title": "Slowly take them out of their trance state.",
      "content": "Slowly take them out of their trance state. You don't want to jerk them out of their relaxation. Let them know that they are becoming more aware of their surroundings. Tell them that they will come back to full awareness, alert and awake, after you count to five. If you feel like they are deeply in a trance, have them walk back up the \"staircase\" with you, gaining awareness with each step. [10] X Research source Begin by saying, \"I'm going to count from one to five, and at the count of five you will be feeling wide awake, fully alert, and completely refreshed.\""
    },
    {
      "title": "Discuss the hypnosis with the partner to see help you improve in the future.",
      "content": "Discuss the hypnosis with the partner to see help you improve in the future. Ask them what felt right to them, what threatened to take them out of hypnosis, and what they felt. This will help you get people under more effectively next time, and help them learn what they enjoyed about the process. Don't pressure anyone to talk immediately. Simply open a conversation, and wait to talk until later if they seem relaxed and want some time to stay quiet."
    },
    {
      "title": "Prepare for commonly asked questions in the future.",
      "content": "Prepare for commonly asked questions in the future. It's good to have a general idea about how to answer questions like these ahead of time, because confidence and trust are so important in determining how a person is going to respond to your induction. Common questions you might get at any point in the process include: [11] X Research source Gibbons, D. E. (2001). <i>Experience as an art form: Hypnosis, hyperempiria, and the Best Me Technique.</i> New York, NY: Authors Choice Press. What are you going to do? I will ask you to visualize some pleasant scenes, while I talk about how to use your own mental abilities more effectively. You can always refuse to do anything that you don't want to do, and you can always come out of the experience yourself if an emergency should come up. What does it feel like to be in hypnosis? Most of us experience changes in our conscious awareness several times a day without realizing it. Any time you let your imagination go and just flow along with a piece of music or a verse of poetry, or get so involved in watching a movie or a television drama that you feel like you're part of the action instead of a part of the audience, you are experiencing a form of trance. Hypnosis is just a way of helping you to focus and define these changes in consciousness, in order to use your mental abilities more effectively. Is it safe? Hypnosis is not an altered state of consciousness (as sleep is, for example), but an altered experience of consciousness. You will never do something you don't want to do or be forced into thoughts against your will. If it's all just your imagination, then, what good is it? Don’t be confused by the tendency in English and many other languages to use the word \"imaginary\" as opposite in meaning to the word \"real\" -- and neither should it be confused with the term \"image.\" The imagination is a very real group of mental abilities, whose potential we are just now beginning to explore, and which extends far beyond our ability to form mental images! Can you make me do anything I don't want to do? When you're using hypnosis, you still have your own personality, and you're still you -- so you won't say or do anything that you wouldn't do in the very same situation without hypnosis, and you can easily refuse any suggestion that you don't want to accept. (That's why we call them \"suggestions.\") What can I do in order to respond better? Hypnosis is very similar to letting yourself become absorbed in watching a sunset or the embers of a campfire, letting yourself flow with a piece of music or poetry , or feeling like you are part of the action instead of part of the audience when you are watching a movie. It all depends on your ability and willingness to go along with the instructions and suggestions that are provided. What if I enjoy it so much that I don't want to come back? Hypnotic suggestions are basically an exercise for the mind and the imagination, just like a movie script is. But you still come back to everyday life when the session is over, just like you come back at the end of a movie. However, the hypnotist might need to try a couple times to pull you out. It is enjoyable being completely relaxed, but you can't do much when hypnotized. What if it doesn't work? Did you ever become so absorbed in your play as a child that you didn’t hear your mother’s voice calling you in for dinner? Or are you one of the many people who are able to wake up at a certain time each morning, just by deciding the night before that you are going to do so? We all have the ability to use our minds in ways we are not usually aware of, and some of us have developed these abilities more than others. If you just allow your thoughts to respond freely and naturally to the words and images as your guide, you'll be able to go wherever your mind can take you"
    }
  ]
}