{
  "url": "https://www.wikihow.com/Include-a-Rest-Day-in-Your-Exercise-Routine",
  "title": "How to Include a Rest Day in Your Exercise Routine",
  "steps": [
    {
      "title": "Write out an exercise schedule.",
      "content": "Write out an exercise schedule. An exercise schedule is a great tool to use when you're trying to schedule in different days of exercise and rest. [1] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. It can help you plan out exactly when and where you're going to stick in a rest day. An exercise schedule can be done weekly or monthly. However, weekly schedules are a little easier to tackle and can get a little more detailed. Start your schedule by writing in all the different workouts you're going to do during the week. Write it in on the actual day, and also note the time. Mark what days are all aerobic exercises and what days you'll be doing strength training. In addition, note what muscle groups are used during each strength training routine you complete. You may want to consider writing in other obligations you have during the week. Whether it's work, school, or other activities, having an idea of what might pop up during the week is good to know ahead of time. This will help you stay more flexible during the week."
    },
    {
      "title": "Pencil in your rest day.",
      "content": "Pencil in your rest day. After you've completed your exercise schedule, you can look at what day or two is the best for rest. Make sure to pencil this in - it may change as your week progresses. Try to be flexible with your rest day, as you may feel differently than expected during your week. You may have something pop up to push back workouts or feel more tired or sore than expected. For example, if you got more sore than expected during a day of strength training, you may want to include 2 days of rest. Or if you're feeling overly fatigued a day before a \"scheduled rest day\", consider moving up your rest day."
    },
    {
      "title": "Choose restorative activities that emphasize a different system or muscle group.",
      "content": "Choose restorative activities that emphasize a different system or muscle group. One important thing to consider when making up your exercise schedule is what you're doing on what days during the week. You need to plan rest days and what activities you do based on your desired schedule. [2] X Research source The sequence in which you plan light days of exercise, heavy days of exercise, and rest days is important. With proper planning, you may not need as many rest days after all. In general, you want to alternate days of more work or intense exercise with days of rest or lighter intensity exercise. For example, if you do a 4-mile run on Monday, 45 minutes of strength training on Tuesday, scheduling a rest day for Wednesday is appropriate and will help your body recover. Also, do not work the same muscle groups two days in a row. Rest can come in the form of alternating different muscle groups. For example, don't do 45 minutes of lower body strength training exercises two days in a row. Do one day of lower body followed by a day of upper body strength training activities."
    },
    {
      "title": "Plan to get an adequate night's rest.",
      "content": "Plan to get an adequate night's rest. When you're trying to fit in a rest day, it's also important to think about your overall rest. Sleeping is a part of your rest and recovery routine and should be focused on as well. Most health professionals recommend getting at least 7-9 hours of sleep each night. This is also recommended as part of your rest day routine. A good, solid night's sleep will help you get into R.E.M cycles. This will help increase certain growth hormones in your body, which are responsible for improving strength and mass in your muscles. Adequate sleep also helps physically relax your body, but also helps your mind relax and unwind from regular exercise."
    },
    {
      "title": "Monitor your diet and hydration status.",
      "content": "Monitor your diet and hydration status. In addition to taking it a little easier and getting adequate sleep, proper nutrition and hydration play a key role in allowing your body to recover. [3] X Research source Stay hydrated by drinking a minimum of 64 oz or 8 glasses of water daily. However, you may need up to 80 oz of fluid to replace the fluids lost during exercise. Even on days when you're not exercising or resting, it's essential that you maintain proper hydration. As with hydration, your rest days are maximized by consuming the right foods. It's important to consume a combination of lean protein, complex carbs, and some fat. Don't skim on carbs or protein, as these are essential to the repair and refueling of your muscles. They'll help your body during rest and prepare it for another day of work and exercise."
    },
    {
      "title": "Go for a walk.",
      "content": "Go for a walk. One of the key recommendations of a rest day is that the activities you participate in are light and are at an easy intensity. Walking is one of the best exercises you can do if you want to stay active on your rest day. [4] X Research source Walking is a great activity to do on a rest day. It's light intensity and low impact. It allows you to keep moving without continuing to stress your muscles, joints, or nervous system. Include a 30-45 minute walk on your rest day. You can also aim to get 10,000 steps if you want to split up your activity. The key is to still not overdo it. Walking several miles will still end up making your body and muscles work too much for too long."
    },
    {
      "title": "Do a day of restorative yoga.",
      "content": "Do a day of restorative yoga. Yoga is another great exercise that can keep you moving on a rest day. Restorative yoga, in particular, is a great relaxing practice to include weekly. Restorative yoga focuses on poses that can help stretch your muscles and keep you limber. The goal is not to improve strength as much as it is to relax and calm you. Yoga is also good to do on a rest day to help your body, mind, and nervous system calm down and relax from a few days of more intense training. Include a 45-minute restorative yoga session on your rest day. You don't need to do longer bouts of this exercise."
    },
    {
      "title": "Try tai chi.",
      "content": "Try tai chi. This relaxing and low-intensity exercise is great to perform on a rest day. Similar to yoga, tai chi can help relax your body and mind while still staying lightly active. Tai chi is very light in intensity and impact. However, it's a very fluid exercise that keeps your body and joints moving at all times. Tai chi is great to stretch, relax, and maintain your range of motion on a rest day. In particular, tai chi is a great mental recovery after exercise. So many days of pushing yourself, counting reps, or timing your runs, tai chi can give your brain a much-needed break."
    },
    {
      "title": "Do higher levels of lifestyle activity.",
      "content": "Do higher levels of lifestyle activity. If you do not want to do a more structured form of light exercise on your rest day, you can choose to completely skip your workout and just stay active overall during the day. Lifestyle or baseline activities are the exercises and movements you perform during your typical, normal daily routine. These exercises can range from household chores, walking to get the mail, gardening, or taking the stairs. Some studies have shown that increased levels of these baseline activities have very similar benefits to more structured aerobic exercise. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source On your days off, feel free to skip the gym. Just increase how much you move or how many steps you take. Park farther away, take the stairs more often, get in some household chores, or spend some time gardening."
    },
    {
      "title": "Keep an exercise journal.",
      "content": "Keep an exercise journal. Adding a rest day to your exercise is important and will help enhance your performance overall. An exercise journal can also help you plan your rest days appropriately and make sure you stick to a balanced routine. Your exercise journal can be something you keep in a little notebook, or you could consider downloading a fitness app that allows you to track your progress and make notes. Something to keep in your journal would be your exercise schedule. Then you can make notes about your performance on those days. Track how your body feels during and after exercise in your journal. Making notes about when you're fatigued can help you plan your rest days more accurately."
    },
    {
      "title": "Split up aerobic exercise appropriately.",
      "content": "Split up aerobic exercise appropriately. One main form of exercise is aerobic exercise or cardiovascular exercise. These heart-pumping activities are great for burning calories, but should be split up during the week. Health professionals recommend that you include at least 150 minutes of aerobic exercise each week. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source However, this amount shouldn't be completed all in one day. Split up your activity throughout the week so you don't overdo it on any one day. For example, you can do 30 minutes 5 days a week or do 45 mins 3-4 days a week."
    },
    {
      "title": "Alternate muscle groups when strength training.",
      "content": "Alternate muscle groups when strength training. In addition to properly sequencing aerobic workouts, also pay attention to how many days you do strength training. It's important to alternate days and muscle groups. Health professionals typically recommend including at least 1 or 2 days of strength training every week. You need to make sure you're exercising for at least 20 minutes per session. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Be mindful to alternate what muscle groups you're working. For example, do not do a lower-body workout two days in a row. Or do not do two full-body workouts in a row. Try to alternate your muscle groups to allow your body to recover and repair. Do a lower body routine one day, followed by an upper body routine another day. Or do a full-body workout every other day."
    },
    {
      "title": "Always include a warm-up and cool-down.",
      "content": "Always include a warm-up and cool-down. [8] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. To reduce the need for longer recovery times, include a warm-up and cool-down every time you exercise. These are little mini rest periods that are equally important to recovery. [9] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source A warm-up should be done for 5-10 minutes before your exercise routine. It should be an activity that's low intensity. Many times, it is suggested to do a slower-paced version of whatever aerobic activity you're planning on doing. The goal of a warm-up is to slowly raise your heart rate and blood pressure instead of spiking it high immediately. A cool-down is almost identical to your warm-up. It should be done for at least 5-10 minutes as well. It should also be a slower, lower-intensity exercise."
    },
    {
      "title": "Monitor for signs of overtraining.",
      "content": "Monitor for signs of overtraining. Adequate rest and recovery will help you minimize the risk for overtraining and injuring yourself. [10] X Research source Pay attention and look out for signs of overtraining like: Continued muscle soreness, achiness, and overall fatigue. You may also notice decreased performance. Increased heart rate. Difficulty sleeping. Moodiness and irritability. Increased thirst. Increased injuries or an injury that does not heal."
    }
  ]
}