{
  "url": "https://www.wikihow.com/Know-if-You-Have-an-Enlarged-Liver",
  "title": "How to Know if You Have an Enlarged Liver",
  "steps": [
    {
      "title": "Be aware of jaundice symptoms.",
      "content": "Be aware of jaundice symptoms. Jaundice is a yellow pigmentation of the skin, mucus, and whites of the eyes caused by excess bilirubin in your blood stream. Bilirubin is a yellowish-orange pigment found in liver bile. [1] X Research source Because a healthy liver usually eliminates excess bilirubin, its presence indicates a liver problem. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In addition to yellowish pigmentation to the skin and whites of the eyes, symptoms of jaundice may include fatigue, abdominal pain, weight loss, vomiting, fever, pale stools, and dark urine. Jaundice symptoms are usually present when the liver is seriously impaired, and it is best to seek medical attention immediately if you are experiencing them."
    },
    {
      "title": "Look for abdominal swelling (distention) or pain.",
      "content": "Look for abdominal swelling (distention) or pain. Abdominal swelling, if you are not pregnant, usually indicates an accumulation of fat, fluid, or feces, or the presence of a tumor, cyst, fibroids, or other enlargement of an organ such as the liver or spleen. [3] X Research source In some severe cases, you could actually look eight months pregnant even if you're not. Many causes of abdominal swelling indicate an underlying medical condition that your doctor should examine. [4] X Research source If it is a fluid accumulation, then it is referred to as ascites and is a common symptom of an enlarged liver. This abdominal swelling will often lead to a decrease in appetite as you are too “full” to eat. This symptom is termed “early satiety.” You may also not have an appetite at all due to the swelling. [5] X Research source You may also experience swelling in the legs. [6] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Abdominal pain, especially in the right upper side of your abdomen, may also be a sign of an enlarged liver, especially if you have other symptoms as well. [7] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Recognize general symptoms that could indicate an enlarged liver.",
      "content": "Recognize general symptoms that could indicate an enlarged liver. Fever, loss of appetite, nausea, vomiting, pain in the upper right side of your abdomen, and weight loss are symptoms that are not specific to liver enlargement, but can be a sign of liver disease and enlargement if they are severe, prolonged, or unexpected. [8] X Research source A lack of appetite or unwillingness to eat can accompany abdominal distention, as mentioned above. It can also be a symptom of gallbladder disease as sufferers may be unwilling to eat, since eating is a trigger for pain. Lack of appetite may also accompany cancer and hepatitis. Doctors typically define significant weight loss as more than 10% of your body weight. If you're not attempting to lose weight, and you notice weight loss, you should get in touch with your doctor. Fever is a marker of inflammation in the body. Because liver enlargement could be due to an infection such as hepatitis, it’s important to recognize and address fever when it occurs. Unusually pale, light grey, or even white stools may be a sign of liver problems. [9] X Research source"
    },
    {
      "title": "Look for fatigue.",
      "content": "Look for fatigue. When you experience fatigue, you feel tired after exerting only a little effort. This can occur when the liver’s reserve of nutrients is damaged, and the body depletes its muscles of their nutrients as an alternative energy source. [10] X Research source Fatigue can indicate the presence of a liver problem, and swelling can be an accompanying symptom. Viral hepatitis and cancer can both cause fatigue."
    },
    {
      "title": "Notice increased itching.",
      "content": "Notice increased itching. When the liver is impaired, you may experience pruritus (itchy skin) that may be either localized or generalized. This condition happens when the liver biliary ducts are obstructed. As a result, bile salts that have been excreted into your bloodstream deposit themselves in your skin and causing an itching sensation. [11] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source You may be tempted to treat the itching, but if you suspect a liver problem, you must see your doctor first."
    },
    {
      "title": "Recognize spider angiomas.",
      "content": "Recognize spider angiomas. Spider angiomas, also called spider telangiectasia or spider nevi, are dilated blood vessels that spread out from a central red dot and look like spider webs. These veins often form on the face, neck, hands, and upper half of the chest and are a classic sign of liver disease and hepatitis. [12] X Research source A single spider nevus is not typically a cause for concern on its own. However, if you exhibit other health conditions or symptoms, such as lethargy, fatigue, bloating or signs of jaundice, you should see your doctor as this may be a sign of liver problems. In addition, if you have multiple clusters of spider nevi, you should also see your doctor as this suggests something is wrong with your liver. [13] X Research source Spider angiomas can range in size up to 5 millimeters in diameter. If you apply moderate pressure with your fingers, their red color will disappear for a couple of seconds and they'll turn white (blanching) because the blood will drain out."
    },
    {
      "title": "Make an appointment with your primary health care provider.",
      "content": "Make an appointment with your primary health care provider. At the beginning of the appointment, your doctor will want to do a complete medical history with you. It's important to be forthcoming and honest with your provider so they can create the best treatment plan for you. [14] X Research source Be aware that some of the questions your doctor will ask are quite personal and concern substance use, alcohol consumption, and sexual partners. However, your answers are critical to your diagnosis. Be clear and tell the truth. Tell your doctor about any medications or supplements you're taking, including vitamins and herbal remedies."
    },
    {
      "title": "Get a physical examination.",
      "content": "Get a physical examination. A clinical physical examination is the first step to diagnosing an enlarged liver. Your physician will begin by examining your skin for jaundice and spider angiomas if you have not already reported these as symptoms. He may then examine your liver by feeling your stomach with his hand. [15] X Research source An enlarged liver may feel irregular, soft or firm, with or without lumps depending on the underlying cause. This kind of test can determine the liver’s size and texture in order to assess the degree of liver enlargement. Your doctor will use two methods of physical examination: a percussion test and a palpation test."
    },
    {
      "title": "Use percussion to assess the state of your liver.",
      "content": "Use percussion to assess the state of your liver. Percussion is a method to assess the size of the liver and to make sure that the liver does not exceed the boundaries of the right costal margin (the rib cage), which is the liver's protective barrier. It explores your inner organs by analyzing the sounds they produce. Your doctor conducts this exam by tapping on your body’s surface and listening to the resulting sound. [16] X Research source If they hears a dull sound that stretches more than 1 inch (2.5 cm) below the bottom of your rib cage, then your liver may be enlarged. Note that if you are experiencing abdominal distention, this test will not be accurate and you will likely need to have an abdominal ultrasound. [17] X Research source Your doctor, if right-handed, will place their left hand on your chest and press their middle finger firmly against the chest wall. Using the middle finger of their right hand, they will strike the midpoint of their left middle finger. The striking movement should come from the wrist (much like playing the piano). Starting from below your breast, the percussion should result in a tympanic drum sound. That is because your lung is located there, and is filled with air. Your doctor will move slowly down in a straight line overlying the liver, listening for when the tympanic drum sound changes to a “thud.” This signifies that your doctor is now over the liver. They will continue to percuss and pay close attention as they near the end of your rib cage to see if they continue to hear a \"thud\" noise and how far. Your doctor will stop when the \"thud\" changes to a mix of intestinal noises (gas and gurgling). The doctor will count how many centimeters below, if any, the liver, went beyond the rib cage. This is usually a sign of disease, as our rib cage is intended to protect our important internal organs like the liver and spleen. (If you have hyperinflated lungs but are otherwise healthy, your doctor may be able to feel the liver edge.)"
    },
    {
      "title": "Try palpation to determine liver shape and consistency.",
      "content": "Try palpation to determine liver shape and consistency. Your doctor will also use palpation to determine whether your liver is enlarged. Palpation, like percussion, uses the touch and pressure provided by the hands. [18] X Research source This is performed, if your doctor is right-handed, by placing their left hand under your right side. You will have to take a big breath in and exhale slowly out as your doctor tries to “capture” the liver between their hands. They will use their fingertips to feel the liver between its edge and the bottom of the ribcage, looking for important details such as shape, consistency, surface texture, tenderness, and border sharpness. Your doctor will be feeling for a surface texture that is rough, irregular or nodular and also whether the liver has a hard or firm consistency. They will also ask you if you feel any tenderness as they press."
    },
    {
      "title": "Get blood tests.",
      "content": "Get blood tests. Your doctor will likely want to have a sample of your blood drawn in order to assess your liver’s function and health. Blood tests are usually used to identify the possible presence of a viral infection such as hepatitis. [19] X Research source The blood sample will indicate what your liver enzyme levels are and thereby provide important information about the health and functioning of your liver. Other blood tests may also be appropriate, including a complete blood cell count, hepatitis virus screen, elastography, and blood clotting tests. These latter tests are especially useful to assess liver function because the liver is responsible for creating the proteins involved in clotting blood. [20] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source"
    },
    {
      "title": "Get imaging testing.",
      "content": "Get imaging testing. Imaging tests such as ultrasound, computed tomography (CT) and magnetic resonance imaging (MRI) scans are often recommended to confirm the diagnosis and assess the anatomy of the liver and its surrounding tissues. These tests can provide specific information to your doctor who can then make an informed assessment of your liver's condition. [21] X Research source Abdominal Ultrasound — In this test, you will lie down as a handheld probe is moved over the abdomen. The probe emits high frequency sound waves that bounce off the organs in the body and are received by a computer, which translates these sound waves into an image of your internal abdominal organs. Your healthcare provider will tell you how to prepare for the test, but in most cases, you are not supposed to eat or drink before the test. [22] X Research source Abdominal CT scan — In a CT scan, x-rays are taken to create cross-sectional images over your abdominal region. You have to lie on a narrow table that slides into the CT machine and stay still as the x-rays are taken and rotate around you. These are translated into images on a computer. Your doctor will tell you how to prepare for this exam. Because the test sometimes involves a special dye called contrast being put into your body (either through IV or orally), you may not be able to eat or drink beforehand. [23] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source MRI abdominal scan — This test uses magnets and radio waves to create images of the internal abdominal region, rather than radiation (x-rays). You have to lie on a narrow table that slides into a large tunnel-like scanner. To make your organs more clear on the scans, the test may require dye, something that your doctor will discuss with you beforehand. As with the other tests, you may be asked not to eat or drink before the test. [24] X Research source"
    },
    {
      "title": "Undergo an endoscopic retrograde cholangiopancreatography (ERCP).",
      "content": "Undergo an endoscopic retrograde cholangiopancreatography (ERCP). This is a scope that looks for problems in the bile ducts, the tubes that carry bile from the liver to your gallbladder and small intestine. [25] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source In this test, an IV line is placed in your arm and you will be given something to relax you. Then, your doctor will insert an endoscope through your mouth and down the esophagus and stomach until it reaches the small intestine (the part closest to the stomach). They will pass a catheter through the endoscope and insert it into the bile ducts that connect with the pancreas and gallbladder. Then, they will inject dye into the ducts, which helps the doctor see any problem areas more clearly. X-rays are then taken. [26] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source This test usually follows imaging tests, including ultrasound, CT scan or MRI scan. As with many of the other tests mentioned, your doctor will outline the procedure and tell you what to expect. You will need to provide your consent for the ERCP and not eat or drink for four hours prior to the test. An ERCP can be a good option because your physician can also use it to facilitate treatment. For example, if there are stones or other obstructions in the bile ducts, the physician can remove those while the ERCP is being conducted. [27] X Research source"
    },
    {
      "title": "Look into getting a liver biopsy.",
      "content": "Look into getting a liver biopsy. As a general rule, an enlarged liver and any liver diseases or conditions can be diagnosed successfully through a medical history, physical examination, blood tests, and, finally, imaging tests. A biopsy, however, can be recommended in certain situations, particularly if the diagnosis is unclear or if cancer is suspected. [28] X Research source The procedure involves the insertion of a long, thin needle into your liver to collect the liver tissue sample and will usually be conducted by a liver specialist (either a gastroenterologist or hepatologist). Because it is an invasive test, you will be placed under local or general anesthesia. The sample is then sent to a laboratory for further investigation, particularly to examine whether there are any cancerous cells present."
    },
    {
      "title": "Get a magnetic resonance elastography (MRE).",
      "content": "Get a magnetic resonance elastography (MRE). A relatively new imaging technique, magnetic resonance elastography combines MRI imaging with sound waves to construct a visual map (elastograph) to assess the stiffness of body tissues, in this case of the liver. A hardening of the liver is a symptom of chronic liver disease, and something that the MRE can detect. This test is noninvasive and can be an alternative to a liver biopsy. [29] X Research source Magnetic resonance elastography is a new but rapidly developing technology. It is currently offered only at a few medical centers but is on the rise. Check with your doctor to see whether this is an option for you. [30] X Research source"
    },
    {
      "title": "Determine the risk posed by hepatitis.",
      "content": "Determine the risk posed by hepatitis. Hepatitis A, B, and C cause liver inflammation, and can lead to enlargement accompanied by a smooth, tender liver edge. If you have any form of hepatitis, you are at higher risk for having an enlarged liver. [31] X Research source The damage to the liver is due to blood and immune cells that flood the liver in an attempt to fight against the hepatitis infection."
    },
    {
      "title": "Consider whether you have right-sided heart failure.",
      "content": "Consider whether you have right-sided heart failure. Blood can accumulate in your liver as a result of inefficient pumping of the heart, so heart failure can produce an enlargement of the liver, with a smooth, tender liver edge. Essentially, because the heart isn't doing its job, blood backs up into the liver. [32] X Research source Talk to your doctor if you think you may have heart problems."
    },
    {
      "title": "Recognize the risk cirrhosis poses.",
      "content": "Recognize the risk cirrhosis poses. Cirrhosis is a chronic disease that leads to an increased density of the liver, as a result of fibrosis (excessive scar tissue production). Cirrhosis is usually the result of lifestyle choices that have an adverse effect on the liver. Alcohol abuse, in particular, can directly cause cirrhosis. [33] X Research source Cirrhosis may produce either enlargement or shrinking, but is most often associated with enlargement."
    },
    {
      "title": "Consider any genetic or metabolic conditions you have.",
      "content": "Consider any genetic or metabolic conditions you have. People with certain genetic or metabolic conditions, such as Wilson's disease [34] X Research source and Gaucher's disease, may also be at a higher risk of developing an enlarged liver. [35] X Research source"
    },
    {
      "title": "Understand the risk cancer poses.",
      "content": "Understand the risk cancer poses. People with cancer may develop liver enlargement due to the spread of cancer (metastasis) into the liver. [36] X Research source If you have been diagnosed with cancer, especially cancer of an organ near the liver, you are at a higher risk of an enlarged liver."
    },
    {
      "title": "Be cautious of excessive alcohol use.",
      "content": "Be cautious of excessive alcohol use. Chronic or excessive alcohol consumption beyond a few drinks a week can cause damage to the liver and impair liver regeneration. These can both induce irreversible functional and structural damage to the liver. [37] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source As the liver loses its functionality due to alcohol use, it can become enlarged and swollen due to decreased drainage capacity. You may also develop fatty deposits in your liver if you consume alcohol in excess. The National Institute on Alcohol Abuse and Alcoholism defines \"moderate\" drinking as no more than one drink per day for women and no more than two drinks per day for men. [38] X Research source"
    },
    {
      "title": "Consider your drug consumption.",
      "content": "Consider your drug consumption. Many over-the-counter medications can damage your liver if used for extended periods of time or if used beyond the recommended dosage. The most liver-toxic drugs include oral contraceptives, anabolic steroids, diclofenac, amiodarone, and statins, among others. [39] X Research source If you are on long-term medication, you should get regular check-ups and closely follow your physician’s advice. Acetaminophen (Tylenol), especially when overdosed, is a common cause of liver failure and can cause liver enlargement. The risk is higher if acetaminophen is mixed with alcohol. [40] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Be aware that some herbal supplements, such as black cohosh, ma huang, and mistletoe, can also increase the likelihood of liver damage."
    },
    {
      "title": "Monitor your intake of fatty foods.",
      "content": "Monitor your intake of fatty foods. Regular consumption of fatty foods, including french fries, hamburgers, or any other junk food, can lead to fat accumulation in the liver, called fatty liver. Pools of fat can develop that will eventually destroy liver cells. [41] X Research source Your damaged liver will be impaired and may swell due to a decreased ability to process blood and toxins and the accumulation of fat. Be aware as well that being overweight or obese increases your risk of liver disease. Whether someone is overweight or obese is determined by using the body mass index (BMI), an indicator of body fatness. BMI is a person's weight in kilograms (kg) divided by the square of the person's height in meters (m). A BMI of 25-29.9 is considered overweight, while a BMI greater than 30 is considered obese. [42] X Research source"
    }
  ]
}