{
  "url": "https://www.wikihow.com/Keep-Your-Fish-from-Dying",
  "title": "How to Keep Your Fish from Dying",
  "steps": [
    {
      "title": "Filter or treat the tank water.",
      "content": "Filter or treat the tank water. To keep your fish healthy in his environment, you need to keep the tank water clean and toxin free. Fish can release more waste than plants or bacteria can process, and this waste can lead to toxic or harmful chemical build up in the tank if it is not filtered or removed. If your fish lives in a bowl, you will need to treat the tap water you use in the bowl so it is safe for your fish to live in. Treat tap water with water conditioner and a pinch of aquarium salt before you put it in the fishbowl. The salt will help to kill bacteria in the water and keep the water clean for your fish. Do not use iodized salt, as this can harm your fish. If your fish lives in an aquarium, you will need to install a filtration system in the aquarium to maintain clean water for your fish. Before you get any fish for your aquarium, you should dechlorinate the tank water and install a filtration system. You will need to allow the tank time to cycle through the water several times, and only introduce a few fish at a time in the environment so the filtration system is not overloaded with waste to process. This will help you avoid “new tank syndrome”, which can kill your fish."
    },
    {
      "title": "Maintain the water correct temperature for your fish.",
      "content": "Maintain the water correct temperature for your fish. If your fish is kept in water that is too warm or too cold, this could lead to high levels of stress in your fish and repress his immune system. This could then leave your fish susceptible to infection and disease. The required water temperature will depend on the fish type. If you have a tropical fish, your water temperature should be around 75 °F (24 °C). Tropical fish are able to tolerate water temperature fluctuations, to an extent. A goldfish, on the other hand, can tolerate water temperatures between 68 and 72 degrees Fahrenheit. The key is to avoid rapid dramatic changes in water temperature and to maintain a water temperature that is comfortable for your fish. Different species of tropical fish can require different temperatures so always check to make sure you are providing the correct environment. When you buy your fish, the retailer should recommend a reliable aquarium heater to keep the water temperature constant. You can also get a thermometer to confirm the temperature of the tank or bowl water. You should wait a few days after setting up your aquarium to introduce any fish into the tank to allow the water temperature to stabilize. Check with the retailer to make sure the tank or bowl you buy for your fish is big enough as a living environment that is too small for your fish can be dangerous for your fish. If your fish is finding the water temperature too hot, he may display certain symptoms, like darting around frantically or acting hyperactive when it is not feeding time. If your fish appears to move very slowly, seems to shiver, or loses interest in food, the water may be too cold for him. You may need to adjust the water temperature so it is closer to the ideal temperature for your fish type."
    },
    {
      "title": "Make the bowl or aquarium fish-friendly.",
      "content": "Make the bowl or aquarium fish-friendly. Adding decorations to your fish’s bowl or tank can help to reduce his stress levels and give him a happy environment to swim around in. Add a plant, live or plastic, to your fish’s bowl. This will give your fish a hiding place, which he will appreciate. If you add a live plant, watch for rotting leaves. You will need to remove or cut these leaves so they do not pollute the water. You can also add rocks and broken clay pots to give your fish more hiding places and make him feel more secure."
    },
    {
      "title": "Do a 10-15% water change once a week.",
      "content": "Do a 10-15% water change once a week. This will help to remove any waste buildup and any decaying organic matter from excess food and plant or fish waste. Doing a small partial water change weekly will also clean any toxins from the water and keep the water clean. Do not remove any of the aquarium plants or decorations from the tank or bowl if you don't need to. Removing or cleaning these items can kill the beneficial bacteria that has been filtering through your tank and reduce the quality of your filtration system. As well, you do not need to remove your fish from the tank or bowl when you do a partial water change. This can stress out your fish and could expose him to harmful bacteria. To do a partial water change, remove 10-15% of the water and replace it with fresh, dechlorinated tap water. You can use a siphon to suck up any gunk in the gravel and decorations. Clean 25-33% of the gravel and decorations with the siphon. You should also use an algae scraper to remove algae on the surface of the tank or the tank ornaments before you remove any of the water. If your fish tank is under ten gallons, you will need to perform a 50-100% water change at least twice a week, or every other day. If your fishbowl does not have a filter, you should do a 100% water change at least once a day to remove any waste or toxins from the water. Getting a top cover for the bowl or a filter can reduce the water changes you will need to do on a daily basis and protect your fish from getting an infection or a disease. Check the water once a day to ensure it is not cloudy, foamy, or has an unusual odor. These could all be signs of a bacterial infestation and may require a full water change."
    },
    {
      "title": "Give your fish small, frequent meals.",
      "content": "Give your fish small, frequent meals. Your fish is used to eating small, frequent meals in nature. Mimic this by giving him small meals throughout the day rather than one big feeding session. Small feedings are also easier on your tank’s filtration system. Most manufactured fish foods are formulated to provide your fish with all his nutritional requirements. Ask a service person at your local pet store for recommended fish foods for your fish, based on his breed."
    },
    {
      "title": "Treat your fish to a salt bath.",
      "content": "Treat your fish to a salt bath. A salt bath can be great for your fish’s overall health. However, if your fish is already on other medications, you should only do a salt bath before giving him other medications. [1] X Research source Sea salt, kosher salt, aquarium salt and pure Morton’s rock salt are all recommended for use. If possible, use natural sea salt with no additives, as it is high in minerals. Use a container that is clean and free of any contaminants. Add tank water to the container, as long as the tank water is safe to use, or add fresh water that has been de-chlorinated. Ensure the water temperature in the container is the same as the temperature of the water in the tank, or within three degrees of the same temperature. Add one teaspoon of salt per gallon of water. Mix the salt into the water to ensure all the granules have dissolved and then place your fish in the container of salt water. Keep your fish in the salt water for one to three minutes, and observe your fish during the salt bath. If your fish displays any signs of stress, like rapid swimming or jerky movements, move your fish back into his main tank."
    },
    {
      "title": "Add chlorophyll to the tank.",
      "content": "Add chlorophyll to the tank. Chlorophyll is considered medicine for goldfish and can help boost your fish’s immune system and health. Look for pure liquid chlorophyll at your local pet store. It usually comes in drops. [2] X Research source Give your goldfish a chlorophyll bath in his tank, following the instructions on the bottle. You can also give your goldfish chlorophyll by adding it to his gel food."
    },
    {
      "title": "Note if there are any whitish-green threads on your fish’s skin.",
      "content": "Note if there are any whitish-green threads on your fish’s skin. This is a symptom of anchor worms, which are small crustaceans that burrow into your fish’s skin and enter his muscles. They then release eggs in your fish before they die, leaving behind damage in your fish that can become infected. [3] X Research source Your fish may also scratch against objects to try to remove the anchor worms, and the points where the anchor worms are attached to your fish may be swollen. To treat anchor worms, you will need to remove the parasite from your fish and clean the wound with an antiseptic, such as iodine. A seawater bath five minutes a day can also force the parasite to fall off."
    },
    {
      "title": "Look for a layer of mucus covering your fish’s gills and body, or chewed on gills or fins.",
      "content": "Look for a layer of mucus covering your fish’s gills and body, or chewed on gills or fins. These could be symptoms of body flukes, which are 1mm long flatworms. Flukes develop due to undesirable environmental conditions, such as poor water quality, overcrowding, or stress. These flatworms are often present in aquariums but remain harmless unless stressful conditions cause an outbreak to occur. [4] X Research source Your fish may also scratch against objects to try to remove the flukes, have reddened skin, or drooping fins. His gills may also move rapidly and he may have a hollow belly. You can treat flukes with a professional parasite guard. Always follow the directions on the package. You can also treat any secondary infections due to flukes with antibiotics or an anti fungus solution."
    },
    {
      "title": "Check if your fish has any protruding scales or looks bloated.",
      "content": "Check if your fish has any protruding scales or looks bloated. These are symptoms of dropsy, which is a bacterial infection in your fish’s kidneys. It can cause renal failure and fluid accumulation, or bloating. It often occurs in fish that are weakened due to poor water conditions. [5] X Research source To treat dropsy, you may need to use antibiotics or medicated feed from a veterinarian. You should also practice preventative care by doing regular water changes, maintaining ideal aquarium temperatures and adding aquarium salt to the water."
    },
    {
      "title": "Note if your fish is covered in white specks or spots that look like salt or sand.",
      "content": "Note if your fish is covered in white specks or spots that look like salt or sand. This is a sign of fish ick or ich. The spots may be slightly raised and your fish will likely scratch against objects in the tank due to irritated and itchy skin. Your fish may also have respiratory issues and appear to gasp at the surface of the tank water. Ick attacks fish that are stressed due to irregular water temperature and pH fluctuations in the water. [6] X Research source To treat or cure ich in goldfish , you can use medicated ick guard, which can be found at your local pet store. You can also prevent the develop of ick by maintaining a consistent water temperature, cleaning the tank weekly, and adding aquarium salt to the tank."
    },
    {
      "title": "Check if your fish’s tail or fins are fraying or appear faded.",
      "content": "Check if your fish’s tail or fins are fraying or appear faded. These are all signs of a bacterial infection that causes your fish’s fins, tail and mouth to rot. Rot typically occurs in fish who are bullied by other fish in the tank or who are injured by a fin nipping tank mate. A poor tank environment can also contribute to the development of rot. [7] X Research source Treat rot by testing the water quality in the aquarium and completing a partial water change. You can apply a multipurpose treatment to help any clamped or damaged fins heal. Adding one tablespoon of aquarium salt per a gallon to the tank can also prevent rot in your fish."
    }
  ]
}