{
  "url": "https://www.wikihow.com/Install-Vertical-Blinds",
  "title": "How to Install Vertical Blinds",
  "steps": [
    {
      "title": "Screw holes into the valance.",
      "content": "Screw holes into the valance. The valance is L-shaped so the top surface can be mounted inside the upper frame and the front of the valance will hide the headrail. Place the valance on a flat surface with the front of the valance in an upright position. Measure 3 inches (7.6 cm) from each end and position each bracket so the top edge is against the upright valance. Use a pencil to mark the 2 screw holes in each bracket. Predrill the four holes, with a smaller bit than the actual screws you will use for the screws (if possible)."
    },
    {
      "title": "Mark the bracket location on the frame.",
      "content": "Mark the bracket location on the frame. Mark holes for the brackets on the inside of the upper frame of the door or window. [1] X Research source Measure 3 inches (7.6 cm) from the side of the frame and 1 inch (2.5 cm) out from the glass. Hold the first bracket in place, place a screw in the first hole and tap with a hammer to make a mark. Make another mark in the second hold. Repeat on the other side for the second bracket."
    },
    {
      "title": "Attach the components.",
      "content": "Attach the components. Attach the valance and brackets to the inside frame. [2] X Research source Position the valance in the window so the marks you made in the upper frame are visible through the holes you drilled in the valance. Have a helper hold the valance while you attach the screws through the bracket and valance. Repeat. Repeat on the other side for the second bracket."
    },
    {
      "title": "Snap in the headrail.",
      "content": "Snap in the headrail. Snap the blinds head rail into the brackets by hooking the front end into the clip and then lifting the back end until it clicks into place."
    },
    {
      "title": "Attach the vanes.",
      "content": "Attach the vanes. If you don't know how, see the section on attaching the vanes later in the article."
    },
    {
      "title": "Locate the headrail.",
      "content": "Locate the headrail. Determine the placement of the blinds' headrail over the window. Pick a point under the window, but near the center, where you want the bottom of the blinds to reach. From that point, measure the height of the blinds up to the top of the window and make a pencil mark."
    },
    {
      "title": "Mark the positioning of the brackets.",
      "content": "Mark the positioning of the brackets. You'll need a helper for this step. [3] X Research source Have a helper place the headrail directly on the pencil mark, while you check that's it's straight with a level. Measure 4 inches (10 cm) from the end of the headrail and make a pencil mark directly over the headrail. Repeat on the other end for the second bracket. If installing vertical blinds wider than 62 inches (1.5 m), mark the positioning of the additional support brackets provided."
    },
    {
      "title": "Attach the brackets to the wall with the provided screws.",
      "content": "Attach the brackets to the wall with the provided screws. If the brackets are being attached to drywall rather than a wood frame around the window, drill a hole and insert wall anchors first. [4] X Research source"
    },
    {
      "title": "Snap in the headrail.",
      "content": "Snap in the headrail. Hook the headrail onto the brackets."
    },
    {
      "title": "Attach the vanes.",
      "content": "Attach the vanes. If you don't know how, follow the instruction in the section on attaching the vanes later in the article."
    },
    {
      "title": "Install the valance.",
      "content": "Install the valance. Add a valance, if you want one and one was included. Push the corners onto either end of the front piece of the valance, and then attach the side pieces. Snap the provided clips along the headrail. Slide the valance into the clips."
    },
    {
      "title": "Space the vanes.",
      "content": "Space the vanes. Pull the cord on the blinds to evenly space the stems that will hold the individual vanes (or louvers)."
    },
    {
      "title": "Rotate the stems.",
      "content": "Rotate the stems. Rotate the stems so you can see the slits."
    },
    {
      "title": "Attach the vane.",
      "content": "Attach the vane. Take the first vane and push the end with a hole up into the slit until the hook catches in the hole. [5] X Research source"
    },
    {
      "title": "Attach the rest of the vanes to their stems.",
      "content": "Attach the rest of the vanes to their stems. Using the same technique, attach the remaining vanes, making sure they all face the same direction (if they're curved). Test the stems when you're done."
    }
  ]
}