{
  "url": "https://www.wikihow.com/Make-Roles-in-Discord",
  "title": "How to Create and Manage Roles on Discord + Troubleshooting",
  "steps": [
    {
      "title": "Navigate to a server.",
      "content": "Navigate to a server. You can find your list of servers on the left side of the Discord app. To create a role, you must be the admin of the server or have admin permissions. [1] X Research source"
    },
    {
      "title": "Tap the server name.",
      "content": "Tap the server name. This is at the top. If the server opens to a channel, tap the back arrow to show the sidebar."
    },
    {
      "title": "Tap the cog icon.",
      "content": "Tap the cog icon. The server settings will open."
    },
    {
      "title": "Scroll down and tap Roles.",
      "content": "Scroll down and tap Roles . You can find this underneath the User Management header."
    },
    {
      "title": "Tap Create Role.",
      "content": "Tap Create Role . This is the blue button. If you have at least one existing role, tap the + icon in the top-right corner instead."
    },
    {
      "title": "Set a name and color.",
      "content": "Set a name and color. Use a name that accurately describes the role or tag you want. For example, if your server was created to share art, you may want to set a role as Digital or Traditional . To change the role color, tap the current color and choose from the selection. If you want more options, tap the eyedropper icon. Tap Select or Save when you're finished."
    },
    {
      "title": "Tap Create.",
      "content": "Tap Create . This will create a new role."
    },
    {
      "title": "Select a permission.",
      "content": "Select a permission. Discord will give you four starter tiers to choose from: Cosmetic, Member, Moderator, or Manager. Cosmetic : The role will show up on the user's profile and change their username color. Member : Previous permissions and users will be able to talk in channels, invite friends, and change their server nickname. Moderator : Previous permissions and will be able to delete any message, mute people in voice chat, kick/ban members, and timeout members. Manager : Previous permissions and will be able to create and delete channels, create and delete roles, add emoji and apps, and most admin actions. If you want more customization options or want to pick and choose select permissions, tap Skip this step to edit it later. To edit role permissions later, return to the Roles page. Tap the role > Permissions > toggle on any permissions you want to add. Tap Save . Warning : Do not toggle on Administrator permissions unless you're positive you want to give user(s) all permissions you have. This includes server deletion."
    },
    {
      "title": "Assign members.",
      "content": "Assign members. You'll see a list of all current members of the server. Tap their username and select Finish to assign them the new role. If you don't want to assign anyone yet, tap Skip this step . To assign a role later, return to the Roles page. Tap the role > Members > Add members > select the member > Add ."
    },
    {
      "title": "Delete roles (optional).",
      "content": "Delete roles (optional). If you decide you don't want a role anymore, you can easily delete it. Do the following: Open Server Settings . Tap Roles . Tap the role. Scroll down and tap Delete Role . Tap Remove ."
    },
    {
      "title": "Navigate to a server.",
      "content": "Navigate to a server. You can find your list of servers on the left side of the app. To create a role, you must be the admin of the server or have admin permissions."
    },
    {
      "title": "Click the server name.",
      "content": "Click the server name. This is at the top. A drop-down menu will open."
    },
    {
      "title": "Click Server Settings.",
      "content": "Click Server Settings . This is the third option."
    },
    {
      "title": "Click Roles.",
      "content": "Click Roles . You can find this in the left panel, underneath Overview ."
    },
    {
      "title": "Click Create Role.",
      "content": "Click Create Role . This is the blue button."
    },
    {
      "title": "Set a name and color.",
      "content": "Set a name and color. Use a name that accurately describes the role or tag you want. For example, if your server was created to share art, you may want to set a role as Digital or Traditional . To change the role color, click a new color from the selection. If you want more options, click the tile with a pencil and select a custom color. Optional : Toggle on Display role members separately from online members and/or Allow anyone to @mention this role ."
    },
    {
      "title": "Click Permissions.",
      "content": "Click Permissions . This is the tab at the top."
    },
    {
      "title": "Toggle on server permissions.",
      "content": "Toggle on server permissions. By default, all permissions will be set to the off position. To allow this role a permission, click the toggle to switch it to the on (green) position. Be sure to read each permission carefully; you don't want to give more permission than needed. Warning : Do not toggle on Administrator permissions unless you're positive you want to give user(s) all permissions you have. This includes server deletion. To edit role permissions later, return to the Roles page. Click the role > Permissions > toggle on any permissions you want to add."
    },
    {
      "title": "Click Manage Members.",
      "content": "Click Manage Members . This is the tab at the top."
    },
    {
      "title": "Click Add Members and assign members.",
      "content": "Click Add Members and assign members. You'll see a list of all current members of the server. Click all users you want to assign, and then click Add ."
    },
    {
      "title": "Delete roles (optional).",
      "content": "Delete roles (optional). If you decide you don't want a role anymore, you can easily delete it. Do the following: Open Server Settings . Click Roles . Click ••• next to the role. Click Delete twice."
    },
    {
      "title": "Create a role-exclusive text channel.",
      "content": "Create a role-exclusive text channel. You can create a channel that can only be accessed by users with a specific role or roles. Do the following: Navigate to a server. Select the server name. Select Create Channel . Select Text or Voice . Enter a channel name. Toggle on Private Channel . Select Next . Select the role(s). Select Create Channel ."
    },
    {
      "title": "Use a bot to auto-assign roles.",
      "content": "Use a bot to auto-assign roles. This is helpful for larger servers that may have a variety of topics/conversations sectioned out. Roles help users get access to the channels they need without overwhelming the sidebar. A popular bot is the AutoRole bot, which you can add using the Discord website ."
    },
    {
      "title": "Make a rules announcement.",
      "content": "Make a rules announcement. When managing large servers, you can use auto-assign bots to welcome new users into the server. For example, new users may only have access to the \"rules\" post, which must be read in full before they're given access to the rest of the server. Once read, users are directed to react with a specific emoji, and this tells the bot to assign them the new roles that allow full access."
    },
    {
      "title": "Use roles as a self-serve cosmetic feature.",
      "content": "Use roles as a self-serve cosmetic feature. Since you can apply colors to roles, users can use it to customize how their username appears in the server. This can be done automatically using bots or manually by the server admin."
    },
    {
      "title": "Tag role members in announcements.",
      "content": "Tag role members in announcements. If you have a large server and need to make an announcement to only a small group, you can use the @role command. Similar to tagging individual users, this will send a highlighted message to all users that have the tagged role."
    },
    {
      "title": "Try a different platform.",
      "content": "Try a different platform. If you're having trouble creating roles on the mobile app, try using a computer instead. Likewise, if you're having trouble creating roles on a computer, try the mobile app or Discord website instead."
    },
    {
      "title": "Make sure you have permission.",
      "content": "Make sure you have permission. If you aren't the creator or admin of the server, you must have permission to create new roles. This can be given to you by the admin. If you have a role that gives you admin permission, make sure it's at the top of the list in the Roles page. This ensures the admin role overrides any additional roles."
    }
  ]
}