{
  "url": "https://www.wikihow.com/Maintain-a-Good-Relationship-with-Your-In-Laws",
  "title": "How to Maintain a Good Relationship with Your In Laws",
  "steps": [
    {
      "title": "Accept the fact that they are your beloved partner's family.",
      "content": "Accept the fact that they are your beloved partner's family. It means that your partner grew up in the family and loves the family more than anything. Keep that in mind and they become much easier to bear and everything will flow freely. [1] X Research source Consider them as family and not opponents: Many people end up spoiling their relationships with in-laws because they frame them as opponents, who always impose demands on them. The biggest culprit behind this kind of assumption is the information that we are getting access to. Try to see any given conflict from their perspective, too; treat them like family and give them the benefit of the doubt, as you enter into a disagreement. If you view things from their angle, you may understand where they're coming from."
    },
    {
      "title": "Suppress your ego:",
      "content": "Suppress your ego: Most relations spoil due to this ever damaging ego factor. Stay humble and try to avoid any sort of conflict. The rule is simple and you just need to fill in empty spaces with love and abstain ego from getting in at any point of time. Avoid comparing your family to your in-laws. Each family dynamic is different, and your expectations of each other will always be different from those in your family of origin. Accept this, rather than fighting it, and your relationship will benefit."
    },
    {
      "title": "Make an effort to get to know them.",
      "content": "Make an effort to get to know them. After formal introductions, put some effort to know them. Make a special effort with the older people at home, then the siblings of your partner, their partners and their kids, if there are any. We tend to dislike or ignore people only when we don't really know who they are. Ask your partner to help you draw out a family tree and memorize it if you find it hard to remember all the names and various relationships in the family. Smile . A smile is a starter to many great things, including good relationships. Whenever you bump into your in-laws remember to give them a genuine smile. [2] X Research source Start a conversation. [3] X Research source Take steps to start the conversation since you are the newcomer. They might expect you to make the move first. Be ready to accept any kind of replies or response. Don't be surprised if you get snappy replies. Remember you are there for the best person of your life."
    },
    {
      "title": "Approach kids.",
      "content": "Approach kids. Kids are always easy to be tackled compared to the adults. Try to play with or tell stories to the kids. Buy them chocolates or candies and let the elders realize that you are a friendly and jovial person. Respect the beliefs and practises of the families. If they don't allow sweets, avoid them like the plague. If they are deeply religious, praise their beliefs and join in as much as you possibly can, particularly in front of the children."
    },
    {
      "title": "Respect the elders.",
      "content": "Respect the elders. Show respect when you talk, eat or even when you are just sitting idle in front of them. Playing with smartphones should be banned completely. Show attention to the conversation or the food you are eating. Attentiveness would reflect your well being to them. Don't feel afraid of asking about the family history. Show an interest in your partner's heritage and background. If they romanticize the past, grin and bear it."
    },
    {
      "title": "Volunteer for jobs.",
      "content": "Volunteer for jobs. Volunteer to help in the kitchen or with the laundry, or find opportunities to buy stuff or to fix a broken item at home. This would bring a special kind of affection towards the family besides showing your hidden talents."
    },
    {
      "title": "Be yourself",
      "content": "Be yourself . Just be yourself and you don't have to act to get a place their hearts. Show that you are sincere in every single thing you do and you really mean what you say in every conversation. Originality always attracts. No harm to share with them your drawbacks or weaknesses. Show your talents and abilities rather than tell. [4] X Research source"
    },
    {
      "title": "Never compare.",
      "content": "Never compare. People are different. Your parents and the in-laws will never be the same. When you compare them, things will get worse. So accept them as they are and show love and affection to them. [5] X Research source Never brag about your maiden family. You may tell things about your parents or birth family but never ever brag or talk big about what you had in your home. This might irritate your in-laws or cause negative remarks."
    },
    {
      "title": "Stay in touch.",
      "content": "Stay in touch. If you are not staying under the same roof with your in-laws, find time to text or call them once in a while. They would be definitely touched and it would help a lot in the bonding of your new relationship. Make them feel that you acknowledge them. [6] X Research source Remember birthdays and anniversaries. Use an organizer to keep track of them. If you have children, keep them updated on the newest milestones reached and make every effort to meet up as often as you can if they're interested."
    },
    {
      "title": "Support your spouse.",
      "content": "Support your spouse. This is their family, and always will be. If you put them in the middle of fights a lot, you'll only breed more tension. Just try not to sweat the small stuff, and support your spouse's position in relation to his next of kin. [7] X Research source Praise your partner. Whilst families are well aware of your spouse's faults and failings, they don't want you to remind them. Speak highly of your partner and mention their great qualities. Demonstrate the admiration, respect, love and fondness you have for your partner. S/he is a darling son, daughter, nephew, niece, uncle, aunt, grandson or granddaughter too. If you and your partner end up having conflict over your in-laws, try to empathetically communicate with your partner. If you really can’t see eye-to-eye, bring in a therapist or mediator, but try to talk to your partner directly first. Reader Poll: We asked 462 wikiHow readers about how they handle conflicts with their partner and only 6% of them said that they seek the help of a therapist or mediator . [Take Poll]"
    }
  ]
}