{
  "url": "https://www.wikihow.com/Make-a-Locket",
  "title": "How to Make a Locket",
  "steps": [
    {
      "title": "Cut out 4 sterling silver discs with a disc cutter.",
      "content": "Cut out 4 sterling silver discs with a disc cutter. Measure out two 1-inch (2.5-cm) diameter discs from 20-gauge (0.8 mm) sterling silver sheet, then cut them out. Cut two more 1-inch (2.5-cm) diameter discs from 26-gauge (0.4 mm) sterling silver sheet. [1] X Research source Use a divider tool to mark the shape of all four discs into the sheet metal before cutting out the discs. If you don’t have a disc cutter, you can use a jeweler’s saw. You don’t need to trim or file the discs down right now since you’ll be working on them later."
    },
    {
      "title": "Punch the 2 thicker discs into a dome using a sapping block.",
      "content": "Punch the 2 thicker discs into a dome using a sapping block. Place the disc in the center of one of the shallow hollows on the block. Position a wooden dapping punch with a low dome on the front end over the disc. Gently tap the back end of the punch with a mallet to bend the metal. Start around the edges of the disc, then gradually move inward toward the center, working in a spiral motion. [2] X Research source Sapping blocks are small wooden boxes with a hole in the middle used to make metal into dome shapes. Make sure that both domes match each other in height before continuing."
    },
    {
      "title": "File down the edges of both of the domes.",
      "content": "File down the edges of both of the domes. File the edges of both domes using a large, flat file or 220-grit sandpaper. Work in figure-eight motions, applying even pressure the entire time, until the edges are flat and smooth. Make sure that both domes have a flat edge, and that both edges line up evenly with one another."
    },
    {
      "title": "Remove the centers from the remaining discs.",
      "content": "Remove the centers from the remaining discs. Use your divider tool to mark out a border measuring 1/8 inch (3 mm) from the edge of each of the smaller, flat discs. Use a disc cutter or jeweler's saw to cut the center out of each one, creating 2 bearing plate rings. You won’t need the centers that you cut out anymore, so you can set them aside for another project or throw them away."
    },
    {
      "title": "File the edges of the bearing plates.",
      "content": "File the edges of the bearing plates. Use a large, flat file on the outer edges until they’re completely smooth. Wrap a piece of 220-grit sandpaper around a sanding cone, then use that on the inner edges until they’re smooth as well. Make sure that both holes are identical, smooth, and evenly round when finished."
    },
    {
      "title": "Solder together the dome and bearing plate.",
      "content": "Solder together the dome and bearing plate. Place the bearing plate solder-side up on a tripod soldering stand fitted with a mesh screen. Center the dome over the bearing plate solder-side (indented-side) down. Set a handheld soldering torch to a large, soft flame. Work the flame around all sides of the metal, making sure that both the top and bottom receive even heating. [3] X Research source Always wear gloves, a mask, and safety goggles when you solder. Check the solder once the metal cools. The bearing plate and dome should be thoroughly fixed together. The two soldered pieces will form the two sides of the locket shell."
    },
    {
      "title": "Cut 3 hinge knuckles from 0.04 inch (1 mm) tubing.",
      "content": "Cut 3 hinge knuckles from 0.04 inch (1 mm) tubing. Grab a jeweler’s cutting jig and place a tube of sterling silver inside of it. Then, cut off a 1/8 inch (3 mm) section using a jeweler's saw. Make sure each knuckle is 1/8 inch (3 mm) long. Check the edges of all 3 hinges before continuing to make sure they lie flush against one another when lined up end-to-end, or else the hinge will not work correctly."
    },
    {
      "title": "Create a groove in the case of the locket.",
      "content": "Create a groove in the case of the locket. Tape the 2 halves of the locket together with masking tape with the bearing plates facing inwards. Press a needle file into the case of the locket and press down to make a 5/16 to 23/64 inch (8 to 9 mm) long groove where the two pieces meet. Then, even it out using a 0.06 inch (1.5 mm) round needle file or diamond core drill. Make sure that the hinge groove is just barely wide enough and long enough for your three hinge knuckles, then remove the masking tape."
    },
    {
      "title": "Coat the locket case in correction fluid.",
      "content": "Coat the locket case in correction fluid. Dip a paint brush into correction fluid and paint a thin layer onto the locket. Try to only coat the sides that you won’t be soldering later on, like the interior and exterior. Let the locket sit and dry for about 30 minutes. Correction fluid will protect the silver from the flame of the soldering iron, and it will also prevent the area underneath it from melting. You can find correction fluid at most tech supply stores."
    },
    {
      "title": "Clamp all of the locket pieces together with binding wire.",
      "content": "Clamp all of the locket pieces together with binding wire. Close the locket shell securely and then tie a length of binding wire around it. Make sure the knot is tight so that all the pieces stay in place while you solder. You can find binding wire at most hardware stores."
    },
    {
      "title": "Apply solder flux to all of the metal pieces.",
      "content": "Apply solder flux to all of the metal pieces. Grab another small paint brush and dip it into a pot of solder flux. Brush it onto the entire locket shell and all 3 hinge knuckles to clean the metal off and get it ready for bonding. You can find solder flux at most tech supply stores."
    },
    {
      "title": "Position the hinge knuckles on top of the hinge groove.",
      "content": "Position the hinge knuckles on top of the hinge groove. Hold the locket shell over a solid soldering pad with the hinge groove facing up. Line up the hinge knuckles along the hinge groove, keeping them straight and level. Finally, thread all three knuckles with a piece of iron binding wire to keep them straight. You will probably need someone else's help during this step. Ask your helper to hold the locket shell steady using soldering tongs. The wire will also block some of the heat, preventing the inside of the hinge from melding together during the soldering process."
    },
    {
      "title": "Solder the hinge in place.",
      "content": "Solder the hinge in place. Brush the entire locket with a soft flame until the flux dries, creating a white crust. Position medium solder pallions, or metal chips, in between the locket case and knuckles. Then, heat the entire structure again using another large, soft flame from a soldering torch. When the flux dries to a clear state, focus the heat of the flame directly over the top and bottom knuckles from the back of the locket, holding it there until the pieces solder together. Immediately redirect the flame to the front of the locket and the middle knuckle, holding it there until they solder together as well. [4] X Research source"
    },
    {
      "title": "Submerge the locket in a bucket of water.",
      "content": "Submerge the locket in a bucket of water. Fill a small bucket full of lukewarm water and plunge the locket into it. Hold the locket underwater for about 10 seconds to cool the metal and stop it from melding together any further. Remove the binding wire to free the locket up. The locket may hiss a little bit, but it’s fine."
    },
    {
      "title": "Solder a jump ring to the back piece.",
      "content": "Solder a jump ring to the back piece. Separate the locket and set aside the front piece. Mark the top center and file a small groove into it. Place the back piece flat-side down over a solid soldering pad and position a jump ring directly into the groove you just created. Use a low flame from your soldering torch to meld a 1/8 inch (3 mm) jump ring in place, then quench the locket by submerging it in water. [5] X Research source You’ll work on the front piece in just a moment, so don’t put it too far out of reach. Jump rings are small metal circles that you can find in most jewelry supply stores."
    },
    {
      "title": "Drill a hole for the friction-clasp pin.",
      "content": "Drill a hole for the friction-clasp pin. Turn the back piece of the locket over to look at the inner bearing plate. Make a mark in the bearing plate directly opposite the hinge, then use a hand drill to carefully make a hole with a diameter of 0.04 inch (1 mm) through the bearing plate only. The hole should be in the middle of the bearing plate."
    },
    {
      "title": "Create and insert the friction-clasp pin.",
      "content": "Create and insert the friction-clasp pin. Cut a short length of 18-gauge (1-mm) sterling silver wire and fit it into the friction-clasp hole. Carefully trim the wire down to a length of 3/16 inch (5 mm) with flat-nose pliers. Keep the pin straight as you carefully solder it in place with a soft flame, then quench the piece in water and check the strength of the join with your fingernail. The bottom of the wire must touch the inside of the dome, or else the locket will be uneven."
    },
    {
      "title": "Slide a hinge pin through the knuckles.",
      "content": "Slide a hinge pin through the knuckles. Hammer one end of the wire so that it flares out slightly, then insert the straight end into the knuckles. Hold both sides of the locket together as you slide the wire to keep them in place. If you need to, pull the wire through the knuckles using pliers. Choose wire made from brass, nickel, or 14k white gold. These metals are more durable than silver."
    },
    {
      "title": "Set the hinge pin with a hammer.",
      "content": "Set the hinge pin with a hammer. Cut off any excess wire with wire cutters, then hold the flared end of the pin against a bench anvil. Flare the straight end of the hinge pin by gently tapping it with a cross-peen hammer. Both ends of the pin should be matching once you’re done."
    },
    {
      "title": "Drill a hole for the friction clasp pin.",
      "content": "Drill a hole for the friction clasp pin. Close the locket and mark the point at which the friction clasp pin hits the front bearing plate. Use a 0.04 inch (1 mm) ball bur to indent the marked point. Test the positioning by closing the locket and verifying that the pin fits into the indentation. Finally, use a hand drill to carefully make a 0.035 inch (0.9 mm) hole into the front bearing plate. Only drill through the bearing plate, not through the dome. [6] X Research source You need to test where the pin closes in the locket before you drill to make sure that it will line up."
    },
    {
      "title": "Trim the fraction-clasp pin with a file.",
      "content": "Trim the fraction-clasp pin with a file. Use wire cutters or a file to trim the pin as needed, then use a needle file to round off the top. As you round the top of the pin, file a notch to one side. This notch will allow the pin to fit into the hole with a snap. The trip should lock into the newly created pin hole. [7] X Research source"
    },
    {
      "title": "Polish the locket with a buffing compound and a rag.",
      "content": "Polish the locket with a buffing compound and a rag. Dip a rag into a Tripoli buffing compound, then apply it to the outside of the locket in small circles. Polish the surface with silver polish using a different rag to make the locket gleam. You can find buffing and polishing compounds at most hardware stores."
    }
  ]
}