{
  "url": "https://www.wikihow.com/Make-Out",
  "title": "How to Make Out",
  "steps": [
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. [1] X Expert Source Cher Gopman Relationship Coach Expert Interview. 17 May 2019. Meet your kissing partner's eyes and give them a little smile to show that you're ready for some action. You can also gently lean your forehead against your kissing partner's, put your hand on their face, touch their leg, or even give them a quick peck on the lips before you start kissing. This helps start a connection and gets your partner more ready to kiss you ; if you swoop in without any warning, the kissing session may be unexpected -- and not in a good way. [2] X Research source Your eye contact doesn't have to be super intense, especially if you're just starting with this person. Just a few seconds of eye contact should get the message across."
    },
    {
      "title": "Move slowly and gently.",
      "content": "Move slowly and gently. This is very important. The best way to prevent head-butting, elbowing, and clanking teeth is to do everything slowly, especially in the beginning and when you're changing positions. As time progresses, you can introduce more passionate kissing techniques , but they can only be sustained for so long. Always return to a slow, comfortable pace. Start with a kiss on the lips, then, if you want to French kiss , slowly move your tongue into your partner's mouth as they do the same. [3] X Research source Once your tongues are in each other's mouths, you can move them slowly in a circular motion, move them on top of each other, or do whatever feels good without moving too fast or getting sloppy. Remember that if you're making out for the first time , you have to be extra cautious before you begin. The first time is about figuring out the person's comfort level, boundaries, and favourite maneuvers. If your partner doesn't seem to be comfortable with your actions, ask for their consent before trying to go further. [4] X Expert Source Cher Gopman Relationship Coach Expert Interview. 17 May 2019. If you're on a first date , keep in mind there's no right or wrong about whether you should kiss. It's up to how comfortable the two of you feel with each other. [5] X Research source [v160969_b01]. 11 April 2019. However, most people are open to a kiss on the first date—just make sure to still get consent first. Reader Poll: We asked 540 wikiHow readers if they like to kiss on the first date, and 46% of them responded yes . [Take Poll]"
    },
    {
      "title": "Keep your hands busy.",
      "content": "Keep your hands busy. This doesn't mean that you should frantically paw your kissing partner every chance you get. However, you'll be more comfortable kissing if you don't keep your hands neatly planted on your lap. Once you're comfortable, and especially if you're sitting down, try to explore your kissing partner's body -- as long as you're both okay with it. Just keep your hands moving from time to time, so you don't get stuck in the same old boring position. Try cupping their face, touching their waist, or holding hands. [6] X Research source"
    },
    {
      "title": "Tease your kissing partner.",
      "content": "Tease your kissing partner. You can still play hard to get in the middle of a make-out session. When it's going great, just pull back for a second and look into your kissing partner's eyes. Locking eyes will be sexy and will make your kissing partner want to kiss you even more badly. Though you shouldn't try this move all the time, once or twice per make-out session will do the trick. This is also a great move if you need a little break from so much kissing."
    },
    {
      "title": "Remember to come up for air.",
      "content": "Remember to come up for air. Taking a little break from kissing is perfectly fine and can even help get you back into the kissing mindset. If you're tired but don't want to stop yet, just come up for air, slow down your kissing pace, or don't be afraid to take a quick bathroom break or ask for a glass of water. If you're not feeling comfortable with so much kissing, then you won't be able to enjoy yourself or give your best effort. It's okay. Taking a break from time to time will make you a better kisser."
    },
    {
      "title": "Talk a little.",
      "content": "Talk a little. A little verbal communication will keep things interesting. It's not a good time to start a deep conversation, though. Just a small phrase in a soft voice, especially when accompanied by eye contact and a smile will communicate closeness during the make-out without saying a whole lot. You don't have to be silent to be sexy, and if you want to say something, as long as it won't ruin the mood, go for it. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Obviously, you shouldn't switch the subject from anything romantic completely. Now's not the time to ask about the math homework. Show your partner that you are really engaged, and give them your undivided attention. [8] X Expert Source Cher Gopman Relationship Coach Expert Interview. 17 May 2019."
    },
    {
      "title": "Keep things lighthearted.",
      "content": "Keep things lighthearted. This isn't a movie, where it's all perfect and planned out! You're both human and there will be awkward moments here and there, no matter how many instructions you read. If anything awkward does happen, be quick to mend it with some light laughter or a gentle push. Making out is just as much about having fun as it is about being turned on. [9] X Research source [10] X Expert Source Cher Gopman Relationship Coach Expert Interview. 17 May 2019. If you're fumbling awkwardly, really, it's better to make a joke about it than to pretend you're Mr. or Ms. Smooth."
    },
    {
      "title": "Kiss your special someone's face and neck.",
      "content": "Kiss your special someone's face and neck . Vary the kissing routine by moving away from their lips occasionally. Again, move slowly. If you move too quickly, they might not know what you're doing and the next thing you know, your lips are crashing into their nose. Kiss the corner of their mouth gently, making your way along their jawline. You can move up to your partner's temple and forehead, or down to their neck. Try giving your kissing partner a slightly wet kiss on the neck and then blow on it so they feel a shiver."
    },
    {
      "title": "Stroke your kissing partner's hair.",
      "content": "Stroke your kissing partner's hair. If your partner has short hair, run your fingers through their hair along the scalp from front to back, all the way down to their neck. If your partner has long hair, you can run your fingers down their hair, letting the strands run through your fingers. The head is one of the most sensitive parts of the human body. Don't underestimate the hair as an important place to touch during a make-out session. [11] X Research source Keep in mind, however, that some hairstyles are not conducive to this. If they have their hair tied up or it's quite curly, your fingers might get trapped. Instead, run the tips of your fingers slowly along the top and around their ear, as if you're tucking a stray strand behind their ear."
    },
    {
      "title": "Give a few gentle bites.",
      "content": "Give a few gentle bites. Biting your partner's neck, ears, or even bottom lip can do wonders for your make-out session. Don't be afraid to try it once you're comfortable enough with your partner to experiment. Take a very gentle bite of their bottom lip, and then work your way over to nibble on their earlobe or neck and see how your love responds. If administered correctly, the tiny bite can make your partner go crazy with pleasure. Be forewarned: the gentle -- or not so gentle -- bite is not for all tastes, but if your special someone likes it, they will really like it. If you're nervous about this move, practice on your hand first."
    },
    {
      "title": "Whisper",
      "content": "Whisper in your kissing partner's ear. Whispering in your partner's ear is a great way to keep the passion going when you take a break from kissing. Just take a break, lean into your special someone's ear, and whisper something short and sweet that lets them know how much you like kissing. Just say, \"You're so sexy,\" or, \"I've been wanting to kiss you all day,\" and your boyfriend or girlfriend will love it. [12] X Research source As you're talking, you can breathe on your partner's neck to make them shiver."
    },
    {
      "title": "Keep mixing things up.",
      "content": "Keep mixing things up. The most important thing to keep in mind as you make out is to keep things interesting by trying something new every once in a while. Just sitting there with your hands in the same position, kissing in the same way, will get old fast. So, mix things up between pecks on the lips, gentle love bites, passionate French kissing, and doing whatever else you need to do to keep things interesting. You don't have to try 10,000 new moves in the middle of a make-out session. But trying at least two or three different things can help spice things up."
    },
    {
      "title": "Let your kissing partner know when you need a break.",
      "content": "Let your kissing partner know when you need a break. There are two post-make-out options: either you move on to something more and get even more hot and heavy, or you realize that you want to take a break. Assuming you want to take a break or stop kissing, slowly move away from your partner, giving them one last, passionate kiss. You don't have to end things abruptly. When you feel like you're getting tired, or know that you have to leave soon, then you should slowly start removing yourself from the situation, limb by limb. Don't apologize about it. Everyone needs a break from time to time."
    },
    {
      "title": "Let your kissing partner know how much you liked it.",
      "content": "Let your kissing partner know how much you liked it. Give your significant other some validation by giving him a big hug, one last kiss, or a big smile -- or even by saying, \"That was amazing,\" or \"I love kissing you.\" Even \"I can't get enough of you\" will do the trick if you mean it. Your special someone should feel confident and good about what just happened so it can happen again. Don't be shy. You don't have to blurt out \"I love you!\" but hey, if you had a hot time, let it be known."
    },
    {
      "title": "Leave your kissing partner wanting more.",
      "content": "Leave your kissing partner wanting more. As you finish up the make-out session, you should make sure that there's a repeat on the horizon. When you're done kissing, you should still stay sexy, be affectionate, and leave your kissing partner wanting more. You can say you can't wait to hang out again when you say goodbye, or even send a cute text saying what a great time you had earlier. Though it may be hard to stay in the mood forever, try to keep things sexy for as long as you can after the make-out session. That will make your kissing partner even more eager to see you again."
    }
  ]
}