{
  "url": "https://www.wikihow.com/Identify-a-Bed-Bug-Infestation",
  "title": "How to Find Bed Bugs and Confirm an Infestation",
  "steps": [
    {
      "title": "Check your mattress for bed bugs.",
      "content": "Check your mattress for bed bugs. Peel off the sheets and look at the mattress (both the top and underneath it). Bed bugs tend to live and migrate towards mattresses, box springs, bed frames, and headboards. Look around the edges of your mattress, the creases of your sheets, and pillowcases. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Look for a mass of small black bugs ranging from eggs (1mm) to adults (5mm, size of an appleseed). While most bed bugs are black, some are pearl white and the size of a pinhead. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Look for blood spots on your sheets or mattress.",
      "content": "Look for blood spots on your sheets or mattress. Bed bugs feed for approximately 3-10 minutes a day before they retreat. Their bites can cause a small amount of blood to trickle out. They’ll also leave blood on your sheets if you roll over on one in your sleep or when the bed bug passes stool. Regardless, you may have tons of little blood dots on your sheet. You may not be able to check for blood spots if you’ve got dark sheets. They should be very noticeable on lighter sheets, though."
    },
    {
      "title": "Check the baseboards and floor for eggshells and case skins.",
      "content": "Check the baseboards and floor for eggshells and case skins. Bed bugs, like all other bugs, mate, reproduce, and shed their skin. When bed bugs mate they can produce hundreds of offspring, which can then lead to the production of a ton of exoskeleton waste products. Look on the floor, baseboards, and under your bed for these sesame seed-sized shells. They’re tiny and off-white, but in a cluster they’ll look kind of like a thin pile of sand. [3] X Research source Look near the edges of your mattress, creases in the bedspread, and the cracks in your headboard. See if there are small, white larvae (1mm, the size of a pinpoint) bunched together."
    },
    {
      "title": "Investigate the clutter around your bed.",
      "content": "Investigate the clutter around your bed. Bed bugs love to hide out in small crevices wherever they can reproduce. If they’re near your bed, inspect any books, nightstands, telephones, radios, and even lampshades. Check all of these areas for signs of bedbugs [4] X Research source Unscrew the faceplate on any nearby outlets and shine a flashlight inside to look for bedbugs."
    },
    {
      "title": "Scan the edges of your carpet.",
      "content": "Scan the edges of your carpet. Different types of flooring like carpeting (tight or loose) or linoleum are great places for bed bugs to hide out. These are also perfect for seclusion which bed bugs need to reproduce. If you can do so, without damaging your carpet/linoleum, peel up the edge. Use a magnifying glass and a flashlight to detect any bed bugs, shells, or defecation. Do the same around the floorboards where the wood paneling meets the floor. [5] X Research source If you notice tiny bugs in your carpet but you haven’t been bitten at all, you probably have carpet beetles. Carpet beetles don’t bite people. [6] X Trustworthy Source State of New York Official website for the State of New York Go to source See what other wikiHow readers have to say about finding bed bugs at the wikiHow forum post, \"How to check for potential bed bug infestation in my house?\""
    },
    {
      "title": "Call an exterminator when in doubt.",
      "content": "Call an exterminator when in doubt. Bed bugs can be hard to find, so if you’re still not sure if you’ve got bed bugs or not, contact a professional. They’ll be able to inspect your home to determine whether or not you actually have bed bugs. [7] X Research source You may need to pay for an exterminator to come out, but it’s worth it if you aren’t sure if you have an issue or not."
    },
    {
      "title": "Bed bugs are flat, brown or reddish-brown, and oval in shape.",
      "content": "Bed bugs are flat, brown or reddish-brown, and oval in shape. At their biggest, they’re about the size of a sunflower seed. They’re usually 3-7 mm in size, and they’re relatively hard to spot unless you’re within 1–2 feet (0.30–0.61 m). Most bed bugs are some shade of brown, but they can also be black or off-white if you find eggs or larvae. [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Bed bugs are flat when they haven’t fed, but they’ll look kind of puffy and round if they’ve just consumed blood. Bed bugs have a kind of musty, sweet smell. A lot of people liken it to the smell of old berries. [9] X Research source Bed bugs don’t fly, although they do have wing pads, which can make it look like they’ve got wings. Bed bugs are most active at night, so if you catch a glimpse of a bug during the day, the odds are high that it wasn’t a bed bug."
    },
    {
      "title": "Look for small mosquito bites in a line or small cluster.",
      "content": "Look for small mosquito bites in a line or small cluster. Bed bugs live on blood and generally feed at night. These bite marks are often mistaken for mosquito bites, but they’re smaller and usually cause your skin to become a little red. Bed bugs bites infamously appear in short lines or clusters, too. [10] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Bed bugs are most likely to bite your ankles, waistline, armpits, or wrists since these are areas where you tend to sweat and/or the blood vessels are close to the skin. Bed bug bites are usually painless. However, if you notice that they begin to itch before 24 hours pass then they’re probably bed bug bites. The itchiness and swelling can last up to nine days. It’s not uncommon for bed bugs to only feast on one person if there are two people sleeping in the same bed. Kevin Carrillo, a professional pest specialist, notes that “Bedbugs are specialized animals and human blood is their preference. They have, in rare occasions, fed on other pets, but humans are pretty much the only thing they're eating.”"
    },
    {
      "title": "Toss your bedding, linens, and clothes in the washer and dryer.",
      "content": "Toss your bedding, linens, and clothes in the washer and dryer. This is the quickest and easiest way to get rid of bed bugs. The insects do not last long in extreme heat, so putting your sheets, pillowcases, and comforter will kill the bugs. Keep your clean gear separate while you treat the rest of your home. [11] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source For items that cannot be washed, stick them in the dryer on high heat for thirty minutes. Warning: Treating a bed bug infestation can take weeks or even months. If you can afford it, it’s much easier to hire a professional. However, you can 100% tackle the problem yourself per Kevin Carrillo, a pest control specialist: “if bedbugs are detected early on and it's a low level isolated infestation, it's completely treatable on your own.”"
    },
    {
      "title": "Encase your bed with a protective cover to suffocate the bugs.",
      "content": "Encase your bed with a protective cover to suffocate the bugs. Wrap your mattress and box spring with tightly woven fabric, such as a mattress cover. This will prevent the bed bugs from becoming embedded in the mattress and box spring cracks and crevices. It will also suffocate any eggs that hatch. [12] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Use plastic cups around the feet of your bed.",
      "content": "Use plastic cups around the feet of your bed. Buy four plastic cups and place them upright as if you were about to drink out of them. Sit each of your bed's legs in one of the four cups. This can prevent the bed bugs from crawling out of your closet, or from your carpet, and onto your bed. [13] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Get rid of the clutter around your bed.",
      "content": "Get rid of the clutter around your bed. Because clutter is a great place for bed bugs to hide out, clean up the area around your bed. This will get rid of hiding places, and make your bedroom more sanitary in the process. [14] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Stack up books and place them far away from your bed (like on a bookshelf). Clothes should also be clean, neatly folded, and placed far away from your bed. Hang them up in a closet, or keep them in a dresser drawer. Make sure that your nightstand and/or desk are neat and properly maintained. Pick up any garbage, cups, plates, utensils, napkins, tissues, etc. Wipe the surface down with a damp cloth, or use a healthy cleaning spray."
    },
    {
      "title": "Vacuum the area around your bed daily.",
      "content": "Vacuum the area around your bed daily. Bed bugs can embed themselves in the fabric of the carpet and use the carpet as a means to move around. Make sure that your vacuum is powerful enough to lift the nap on your carpet—if it isn’t, you won’t vacuum up the bugs. [15] X Research source Vacuums with cyclone technology or 4-chamber suction are great for this job."
    },
    {
      "title": "Repair cracks in your furniture or baseboards.",
      "content": "Repair cracks in your furniture or baseboards. Bed bugs love to breed and live within the cracks of furniture, bed posts, and headboards. Use putty, plaster, or safe wood glue to fill in the cracks which might have the potential to house the bugs."
    },
    {
      "title": "Get rid of any items that can’t be salvaged.",
      "content": "Get rid of any items that can’t be salvaged. This is oftentimes a last resort, but if the bed bugs have overwhelmed the situation, it is best to start over. Bag your furniture and mattress and just replace them. [16] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Dispose of your mattress a great distance from your house. Either leave the mattress near the place where the trash men pick the garbage up, or take the mattress directly to the garbage dump. Do the same with any furniture infested with bed bugs. Remember, secondhand furniture and mattresses are especially vulnerable to having bed bugs in them. If your furniture or mattresses are secondhand, it is even more of a necessity to rid yourself of these furnishings. They have likely already had bed bugs in them before, and are a breeding ground for more to come."
    },
    {
      "title": "Use safe chemical treatments on and around your bed.",
      "content": "Use safe chemical treatments on and around your bed. There are tons of reputable bed bug removal chemical agents . Find one that is safe to use, and that comes in a spray bottle form. Follow the instructions on the container to treat the bugs. [17] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Spray the chemical agent onto the surface you wish to rid of bed bugs. Let it sit there for a few minutes. You can also buy some chemicals which you can leave sit in a particular room which will kill bed bugs, much like the chemicals an exterminator uses."
    },
    {
      "title": "Call an exterminator if you still can’t get rid of the bugs.",
      "content": "Call an exterminator if you still can’t get rid of the bugs. If you’re still struggling to handle the problem—which is extremely common for DIY bed bug removal—call a professional exterminator. They’ll be able to completely treat the issue and you’re your home pest-free. [18] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    }
  ]
}