{
  "url": "https://www.wikihow.com/Groom-a-Long%E2%80%90Haired-Cat",
  "title": "How to Groom a Long‐Haired Cat",
  "steps": [
    {
      "title": "Comb the cat once a day.",
      "content": "Comb the cat once a day. Long-haired cats need more maintenance than short-haired cats. They need to be brushed daily to prevent mats. You may need to brush the cat in short bursts throughout the day, picking times when the cat seems content, to get the cat all the way brushed. [1] X Research source You may get away with brushing every few days if your cat isn't prone to mats. [2] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Ready your cat.",
      "content": "Ready your cat. Your cat should be somewhere solid. A table or the floor is fine, but an elevated surface works better. [3] X Research source You can also use a couch or the bed. Also, be sure your cat is calm. You can help the process along by petting the cat and speaking calmly to it. Scratch the cat in the good places it likes to make sure it's content before you begin."
    },
    {
      "title": "Find the right tools.",
      "content": "Find the right tools. For a long-haired cat, the best tools are a wire brush, undercoat combs, and a flea comb. [4] X Research source You can also use wide-tooth combs, if that's all you have, which can help especially when your cat is losing hair due to seasonal shedding. [5] X Research source Undercoat combs have both long and short teeth. They are best for loosening hair in the undercoat. You'll need to start with a less fine undercoat comb and move to a finer one before using a flea comb."
    },
    {
      "title": "Start with the brush and work your way down.",
      "content": "Start with the brush and work your way down. If the cat's fur is particularly bad, you'll need to start with the brush or wide-tooth comb first to get the major tangles out of the way first. Once you've worked through that, you can move down to an undercoat comb. Next, you can move to a finer undercoat comb, and then to the flea comb. [6] X Research source You want to start with wider-toothed combs and brushes first because you won't be able to get a fine flea comb through the coat the first time. If your cat's fur isn't too tangled, you may be able to start with a less fine undercoat comb. Use the finer combs on the cat's head and legs."
    },
    {
      "title": "Start with the cat on its stomach with the cat's back end facing you.",
      "content": "Start with the cat on its stomach with the cat's back end facing you. You probably won't have to hold the cat down in this position. Groom the back of the cat thoroughly, starting at the head and working down to the tail."
    },
    {
      "title": "Turn the cat onto its back and hold it down.",
      "content": "Turn the cat onto its back and hold it down. After you've groomed the cat's back, turn it over so that it is laying on its back with its belly exposed. Lay it slightly on one side, with one front leg closer to the table and one more in the air. Make a \"V\" with your thumb and other fingers. Press down on the underside of the cat with the \"V\" somewhat towards the shoulder and head, pinning the cat's top half down. This helps keep the cat in place, as well as keeping it from biting you. As you move to the underside back end, use your arm and elbow to hold the cat down, while you lift one leg with that same hand and brush between the legs. [7] X Research source"
    },
    {
      "title": "Try line brushing.",
      "content": "Try line brushing. Brushing in varying directions, make sure you're getting down to the skin. If you're getting to the skin, you'll see the fur creating a \"line\" of skin where you're brushing the fur. You don't want to dig into the skin, but make sure you are getting the undercoat. [8] X Research source With this type of brushing, start with the cat's back, then move on to the sides, and finally do the undersides. You'll start at the neck and work your way down to the tail. Brush in even strokes, concentrating on areas with tangles. Try to work out any loose fur you see."
    },
    {
      "title": "Try brushing against the grain.",
      "content": "Try brushing against the grain. Another option is brushing against the grain. You'll be brushing towards the cat's head. When you reach the head, gently comb it out. Make sure to get the chest and stomach, too. Also, separate the fur out on the tail by moving it to either side. That makes it easier to brush it out. [9] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Make sure to hit problem areas. For instance, long-hair cats may get mats under their arms or across their bellies. [10] X Research source Also, be sure your getting down to the skin and focusing on tangled areas."
    },
    {
      "title": "Try powder on knots and mats.",
      "content": "Try powder on knots and mats. A little bit of talcum powder can help you comb out knots. Sprinkle a tiny bit on top of the knot. After that, use your fingers first to pull the knot apart. Make sure you don't yank on it, as that hurts the cat. Once you've teased it apart, use a comb on it. [11] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Comb out mats.",
      "content": "Comb out mats. Another way to get rid of mats is to hold the mat near the root. That prevents it from pulling on the cat's skin. Then use your comb or brush to tease it out a little a time. You should be able to comb through some mats this way. [12] X Research source"
    },
    {
      "title": "Try a mat splitter.",
      "content": "Try a mat splitter. Another option is a mat splitter. You can find these at pet stores. Basically, the mat splitter cuts the mat up. When the mat is in pieces, it's easier to comb the mat out and pull out the tangles without hurting the cat. [13] X Research source You can substitute a plastic letter opener in some cases, that kind that has an opening the letter goes into. A seam ripper may also work."
    },
    {
      "title": "Cut out the worst mats.",
      "content": "Cut out the worst mats. If a tangle is particularly bad, you may need to cut it out. However, you need to be very, very careful with this method, as it is easy to nick the skin. Pull the tangle gently away from the skin. Make sure you can see where the skin is before you cut, and then gently cut as far away from the skin as you can get. [14] X Research source You can also use a mat comb/razor comb for this process. It's a comb designed to cut mats as you brush the fur. [15] X Research source If mats are truly bad, you'll need professional help. The cat may need to be shaved."
    },
    {
      "title": "Bathe your cat every month to month and a half.",
      "content": "Bathe your cat every month to month and a half. Long-haired cats will get tangles and mats without regular bathing. Grease and loose hair both contribute. Plus, bathing and blow drying the cat helps prevent the hair from tangling. Therefore, bathing your long-haired cat regularly is a good idea. [16] X Research source If you don't feel like you can bathe your cat yourself, take it to a groomer's that accepts cats. Also, always brush your cat before you bathe it to make sure you remove any loose fur ahead of time. [17] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Trim the cat's nails first.",
      "content": "Trim the cat's nails first. When you bathe a cat, you can be severely scratched. Many cats will fight back when being bathed. Therefore, it's best to trim the cat's nails before bath time, saving you from pain and blood. Plus, when your cat scratches you, its likely to get away, and you'll need to wrangle it in again. [18] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source To trim claws, you can use a human nail clipper, but clippers made for cats may work a little better. Try to hold the cat under your arm while lifting up each paw one at a time. You can also ask someone to hold the cat down for you. You may be able to work on the claws while a cat is standing on a table. Hold the paw in your hand. Gently press on the back and front of the paw at each pad, causing the claw to extend. Clip off the end of the nail, making sure you don't get the quick, which is the pink vein running down the nail. Trim as much as you can, starting with the front claws. You may need to go back for the rest later. [19] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Play with your cat ahead of time.",
      "content": "Play with your cat ahead of time. Playing with your cat can wear it down, which can make bathing easier. Pick the cat's favorite toy, and keep it playing for a while until it looks tired. Once you've worn it out a bit, you can move on to bathing. That way, it will be more relaxed during the bath. [20] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Get the tub and your cat ready.",
      "content": "Get the tub and your cat ready. The tub needs to have a rubber mat in it, to keep your cat from sliding around. You can use a sink instead, but you still need a rubber mat. It also needs 4 inches (10.2 cm) or so of warm water. In addition, place cotton balls (gently) in your cat's ears, which will keep them from getting wet. [21] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Get your cat wet.",
      "content": "Get your cat wet. Using lukewarm water, pour water over your cat with a pitcher or cup. You can also use a spray nozzle. Make sure you aren't pouring it directly on your cat's head, as you don't want to go in the cat's eyes, nose, or ears. That will only upset the cat. [22] X Research source"
    },
    {
      "title": "Shampoo the cat.",
      "content": "Shampoo the cat. Make sure to use a cat shampoo, as your shampoo may be drying to the cat's skin. Mix about 5 parts of water with 1 part shampoo, and rub it into your cat's fur. It's best to start at the top and move toward the tail. Once again, try not to get the soap in the cat's face. [23] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Rinse the cat thoroughly.",
      "content": "Rinse the cat thoroughly. Once you've massaged the soap in, it's time to rinse it out. Use a cup or a spray hose to pour water over the cat. You need to make sure you get all the soap out because it will be itchy for the cat if you don't. Keep rinsing until the water runs clear. [24] X Research source For the cat's face, simply get a washcloth wet, and gently wipe it clean. [25] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Comb out the fur.",
      "content": "Comb out the fur. If you leave the fur damp without combing it, the fur can develop very tangled mats that may need to be shaved out, much like wool does. Make sure to comb out the cat's fur while it's still damp, and then again once the fur has completely dried. That way, you prevent mats from forming after the bath. [26] X Research source"
    },
    {
      "title": "Dry your cat off.",
      "content": "Dry your cat off. Start with a big towel, rubbing as much of the moisture off as possible. Try to work somewhere where there's not a draft, so your cat doesn't get cold. You can also use a blow dryer on the warm setting (the lowest setting before cool). The blow dryer can help prevent tangles, as it blows out the hair in every direction. However, your cat may not like the sound. If it doesn't, just get it as dry as possible with the towel. [27] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Tell your cat it's a good cat.",
      "content": "Tell your cat it's a good cat. After such a terrible ordeal (for you and the cat!), your cat needs to be rewarded (and you may need to be, too). Give your cat lots of attention. A nice treat can help, too. Use anything the cat likes to tell it what a good job it did. [28] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    }
  ]
}