{
  "url": "https://www.wikihow.com/Make-Cheetos",
  "title": "How to Make Cheetos",
  "steps": [
    {
      "title": "Preheat the oil.",
      "content": "Preheat the oil. Pour the oil into a large saucepan and turn the heat to medium to preheat the oil. Attach a candy thermometer to the side of the pan and insert the bulb into the oil. The oil should be 350 F (177 C) before you fry the dough to make the Cheetos. [1] X Research source"
    },
    {
      "title": "Fill a bag with the cheese powder.",
      "content": "Fill a bag with the cheese powder. Pour the cheese powder into a seal-able plastic bag. When the Cheetos have been fried and cool, you'll toss them around in the cheese to coat them."
    },
    {
      "title": "Combine the dry ingredients.",
      "content": "Combine the dry ingredients. In a medium mixing bowl, combine the flour, corn meal, and salt. Whisk the dry ingredients together to combine everything and remove any lumps that may be in the flour or corn meal. For this recipe, you can use regular corn meal, fine grind corn meal, or corn flour. Corn meal will produce a slightly grittier texture, whereas corn flour will produce smoother Cheetos."
    },
    {
      "title": "Add the water to make a dough.",
      "content": "Add the water to make a dough. Fill a kettle to the minimum fill line. Bring the water to a boil and let it cool for a few minutes. Pour ½ cup (118 ml) of the very hot water into a measuring cup. Pour the hot water into the dry ingredients slowly, whisking the mixture as you pour. [2] X Research source Continue whisking until all the water has been incorporated and you have a smooth dough."
    },
    {
      "title": "Transfer the dough to a piping bag.",
      "content": "Transfer the dough to a piping bag. Fit a piping bag with a large, plain round tip. Spoon the dough mixture into the piping bag. When the bag is full or when all the dough has been added, twist the top of the bag to keep the dough inside. Use a clean freezer bag if you don’t have a piping bag. Cut a half-inch (1.3-cm) hole in the bottom corner of the bag, and press the dough toward the hole to pipe it out."
    },
    {
      "title": "Pipe logs of dough into the hot oil.",
      "content": "Pipe logs of dough into the hot oil. When the oil is at temperature and the dough is ready to go, squeeze 2-inch-long (5-cm) logs of dough into the oil. When you squeeze out a length of dough, use scissors or shears to cut it away from the piping bag. [3] X Research source Repeat until you’ve filled the pan with as many logs as you can fit, but don’t crowd the Cheetos in the pan. You may have to fry them in multiple batches."
    },
    {
      "title": "Fry the dough for four minutes.",
      "content": "Fry the dough for four minutes. You want the logs to be a golden color when they come out of the oil. If the Cheetos aren't fully submerged in the oil, use a fork or chop sticks to flip them halfway through the cooking time. For healthier Cheetos, bake them in a 350 F (177 C) oven for 15 to 18 minutes, turning once halfway through the cooking time."
    },
    {
      "title": "Drain the excess oil.",
      "content": "Drain the excess oil. Scoop the cooked Cheetos out of the hot oil using a metal slotted spoon. Transfer them to a plate covered with several layers of paper towel. Let the Cheetos drain and cool for one to two minutes. [4] X Research source Once the first batch is out of the pan, allow the oil to come back up to temperature before adding your next batch of dough."
    },
    {
      "title": "Coat the logs with cheese powder.",
      "content": "Coat the logs with cheese powder. When the Cheetos have had time to cool and drain, transfer them to the bag filled with the cheese powder. [5] X Research source Keep as much air in the bag as possible and seal the bag shut. Shake the bag to toss the Cheetos in the cheese powder and fully coat them. Add more cheese to the bag if necessary, especially after each batch."
    },
    {
      "title": "Separate the Cheetos and cheese powder.",
      "content": "Separate the Cheetos and cheese powder. Place a colander in a larger mixing bowl. Pour the Cheetos and cheese powder into the colander. This way, the Cheetos will stay in the colander and the cheese powder will sift into the bowl below. Transfer the Cheetos to a serving platter or airtight container for storage, and pour the cheese that collected in the bowl back into the freezer bag."
    },
    {
      "title": "Dig in!",
      "content": "Dig in! Once all your Cheetos have been fried, cooled, and coated with cheese powder, you can sit back and enjoy your homemade Cheetos. Store leftovers in an airtight container for up to a few days."
    },
    {
      "title": "Cream together the butter and spices.",
      "content": "Cream together the butter and spices. In the bowl of a stand mixer, combine the butter, garlic powder, and ½ teaspoon (3 g) of the salt. Use the paddle attachment to beat the ingredients together at medium-low speed for about two minutes, until the mixture is light and fluffy. [6] X Research source Combine the ingredients in a mixing bowl and use a wooden spoon or rubber spatula to cream the butter if you don’t have a stand mixer."
    },
    {
      "title": "Make the dough.",
      "content": "Make the dough. Add the flour, cornmeal, and shredded cheese to the creamed butter. Switch the mixer to low speed and continue beating the ingredients for another two minutes. Stop mixing when the mixture comes together as a firm dough. Ideal cheese for this recipe is a strong cheese like Monterey Jack or white cheddar."
    },
    {
      "title": "Chill the dough.",
      "content": "Chill the dough. Turn the dough out onto a flat surface, like a countertop. Knead the dough into a ball, and then wrap it tightly in plastic wrap. Transfer the wrapped dough to a sealable plastic bag, press out all the air, and seal the bag. Move the dough to the refrigerator and chill it for at least an hour. [7] X Research source Chilling the dough will give the flour time to rest, and make the dough easier to handle when you form the cheese curls."
    },
    {
      "title": "Preheat the oven.",
      "content": "Preheat the oven. When the dough is 15 minutes away from being chilled, set the oven to 350 F (177 C) and let it preheat. While you wait, line two baking sheets with parchment paper or silicone mats."
    },
    {
      "title": "Roll the dough into curls.",
      "content": "Roll the dough into curls. Remove the dough from the refrigerator, take it out of the bag, and unwrap it from the plastic. Tear off balls of dough that are 2 inches (5 cm) in diameter, and roll each one into a log that’s 2 inches (5 cm) long and half an inch (1.3 cm) thick. [8] X Research source Shape the logs into crescents and transfer them to the prepared baking sheets. The curls can be positioned close to each other, but make sure they're not touching."
    },
    {
      "title": "Bake the curls.",
      "content": "Bake the curls. When the curls are ready and the oven is at temperature, transfer the baking sheets to the oven. Bake the curls for 12 to 15 minutes, until they're golden brown at the edges and no longer shiny."
    },
    {
      "title": "Cool the curls.",
      "content": "Cool the curls. When the curls are baked, transfer them to a wire cooling rack to cool for about 30 minutes to an hour. You want them to be room temperature before you coat them with cheese. [9] X Research source"
    },
    {
      "title": "Make the cheese coating.",
      "content": "Make the cheese coating. In a small mixing bowl, combine the cheese powder, buttermilk powder, cornstarch, and remaining ½ teaspoon (3 g) of salt. Whisk the ingredients together to fully combine them and form a smooth powder. Transfer the cheese powder to a sealable plastic bag. You can also mix the powder in a food processor by pulsing the ingredients together for 15 seconds."
    },
    {
      "title": "Coat the cooled curls with cheese.",
      "content": "Coat the cooled curls with cheese. Drop half of the cooled cheese curls into the bag with the cheese powder. Seal the bag and shake it to fully coat the curls with the powder. Use a slotted spoon to remove the coated curls from the cheese powder. Repeat with the other half of the curls until all the curls are coated."
    },
    {
      "title": "Serve your curls and store leftovers.",
      "content": "Serve your curls and store leftovers. Once the curls are coated with the cheese powder, they're ready to be enjoyed. Serve immediately for best results, and store leftovers in an airtight container for up to a week. [10] X Research source"
    },
    {
      "title": "Make the Cheetos vegan.",
      "content": "Make the Cheetos vegan. People who adhere to a vegan diet don’t eat dairy, but you can make homemade Cheetos vegan by substituting nutritional yeast for the cheese powder. These Cheetos are also suitable for people who are lactose intolerant. To make the vegan cheese powder, pulse together in a food processor: [11] X Research source 1 cup (125 g) of cashews ¾ cup (45 g) of nutritional yeast ¼ cup (23 g) of oat flour ¼ cup (31 g) of tapioca flour 1 tablespoon (5 g) of paprika 1 tablespoon (14 g) of sugar 2 teaspoons (4 g) of powdered mustard 2 teaspoons (12 g) of sea salt 2 teaspoons (6 g) of onion powder"
    },
    {
      "title": "Opt for a gluten-free version.",
      "content": "Opt for a gluten-free version. For people who have celiac disease, avoiding gluten is key to staying healthy. Making gluten-free Cheetos at home is possible, and all you have to do is change the type of flour you use. To make your snacks gluten-free, replace the wheat flour with equal parts: [12] X Research source Superfine brown rice flour Sorghum flour Potato starch"
    },
    {
      "title": "Customize your Cheetos.",
      "content": "Customize your Cheetos. Cheetos come in a variety of flavors, and you can replicate those flavors and create your own by adding different spices to the cheese powder. Add 1 to 2 teaspoons of any herb or spice you want to make different versions. Here are some ideas of spices you can add: Jalapeño powder to make cheddar jalapeño Cheetos Chili powder to make chili cheese Cheetos Tomato powder and oregano to make pizza Cheetos Chipotle and ranch powders to make chipotle ranch Cheetos"
    }
  ]
}