{
  "url": "https://www.wikihow.com/Identify-a-Pedophile",
  "title": "How to Identify a Pedophile",
  "steps": [
    {
      "title": "Understand that any adult could be a child molester.",
      "content": "Understand that any adult could be a child molester. There is no one physical characteristic, appearance, profession, or personality type that all child molesters share. Child molesters can be any gender or race, and their religious affiliations, occupations and hobbies are as diverse as anyone else's. A child molester may appear to be charming, loving, and completely good-natured while harboring predatory thoughts that they are adept at hiding. That means you should never dismiss the idea that someone could be a child molester out of hand. [2] X Research source"
    },
    {
      "title": "Know that most child molesters are known to the children they abuse.",
      "content": "Know that most child molesters are known to the children they abuse. Thirty percent of children who have been sexually abused were abused by a family member, and 60 percent were abused by an adult they knew who was not a family member. That means only 10 percent of children who are sexually abused were targeted by a total stranger. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source In most cases, the child molester turns out to be someone known to the child through school or another activity, such as a neighbor, teacher, coach, member of the clergy, music instructor, or babysitter. Family members like mothers, fathers, grandmothers, grandfathers, aunts, uncles, cousins, stepparents, and so on may also be sexual predators."
    },
    {
      "title": "Know the common characteristics of a child molester.",
      "content": "Know the common characteristics of a child molester. While anyone can turn out to be a child molester, the majority of child molesters are men, regardless of whether their victims are men or women. [4] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Many sexual predators have a history of abuse in their own past, either physical or sexual. Some also have mental illness, such as a mood or personality disorder. Heterosexual and homosexual men are equally likely to be child molesters. The idea that homosexual men are more likely to be child molesters is a complete myth. [5] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Women who are child molesters are more likely to abuse boys than girls."
    },
    {
      "title": "Be aware of common behaviors demonstrated by child molesters.",
      "content": "Be aware of common behaviors demonstrated by child molesters. A child molester often doesn't display as much interest in adults as they do in children. They may have jobs that allow them to be around children of a certain age group, or contrive other ways to spend time with children by acting as a coach, babysitter or neighbor trying to help. [6] X Research source Child molesters tend to talk about or treat children as though they are adults. They might refer to a child as they would refer to an adult friend or lover. Child molesters often say they love all children or feel as though they are still children."
    },
    {
      "title": "Look for signs of grooming",
      "content": "Look for signs of grooming . The term \"grooming\" refers to the process the child molester undertakes to gain a child's trust, and sometimes the parents' trust as well. Over the course of months or even years, a child molester will increasingly become a trusted friend of the family, offering to babysit, take the child shopping or on trips, or spend time with the child in other ways. Many child molesters won't actually begin abusing a child until trust has been gained. Some may use others opinions around them to back up their trustworthiness in order to take children shopping. [7] X Research source Child molesters look for children who are vulnerable to their tactics because they lack emotional support or aren't getting enough attention at home or will try to convince the parents their children are safe with them and that they are not going far. The child molester will attempt to step in as the \"parent\" figure for the child. Some child molesters prey on the children of single parents who aren't available to provide as much supervision or convince parents that they are nice enough people to supervise without them. A child molester will often use a range of games, tricks, activities and language to gain trust and/or deceive a child. These include: keeping of secrets (secrets are valuable to most kids, being seen as something \"adult\" and a source of power), sexually explicit games, fondling, kissing, touching, sexually suggestive behavior, exposing a child to pornographic material, coercion, bribery, flattery, and—worst of all—affection and love. Be aware that these tactics are ultimately used to isolate and confuse your child."
    },
    {
      "title": "Find out whether sex offenders live in your neighborhood",
      "content": "Find out whether sex offenders live in your neighborhood . You can use the US Department of Justice National Sex Offender Database (located at https://www.nsopw.gov/ ) to determine whether any registered sex offenders live in your area. All you have to do is enter your zip code and do a search, and you'll be able to see where child molesters might live. You can also do a search for individual names to see if a specific person is a sex offender. It's good to be aware of potential predators, but realize that it is illegal to take any kind of action against registered sex offenders."
    },
    {
      "title": "Supervise your child's extracurricular activities.",
      "content": "Supervise your child's extracurricular activities. Being as involved as possible in your child's life is the best way to guard against child molesters. They will look for a child who is vulnerable and who isn't getting a lot of attention from their parents or will convince parents they are of no danger to their child. Show up at games, practices and rehearsals, chaperone field trips and trips out, and spend time getting to know the adults in your child's life. Make it clear that you're an involved, present parent. [8] X Research source If you can't be there for a trip or outing, make sure at least two adults you know well will be chaperoning a trip. Don't leave your child alone with adults you don't know well. Even relatives can pose a threat. The key is to be as present as possible."
    },
    {
      "title": "Set up a nanny cam if you hire a babysitter.",
      "content": "Set up a nanny cam if you hire a babysitter. There are times when you won't be able to be present, so use other tools to make sure your child is safe. Set up a hidden camera in your home so that inappropriate activity will be detected. No matter how well you think you know someone, you need to take precautions for your child's safety."
    },
    {
      "title": "Teach your child about staying safe online.",
      "content": "Teach your child about staying safe online. Make sure your child knows that predators often pose as children or teenagers in order to lure children in online. Monitor your child's use of the internet, keeping rules in place to limit his or her \"chat\" time. Have regular discussions with your child about whom he or she is communicating with online. [9] X Research source Be sure your child knows never to send pictures to a person they met online, or meet someone they are communicating with online. Know that children are often secretive about online behavior, especially when encouraged by others to keep secrets, so you'll need to be vigilant about staying involved in your child's online activity."
    },
    {
      "title": "Make sure your child is feeling emotionally supported.",
      "content": "Make sure your child is feeling emotionally supported. Since children who don't get a lot of attention are especially vulnerable to predators, make sure you are spending a lot of time with your child and that he or she feels supported. Take the time to talk to your child every day and work toward building an open, trusting relationship. Child molesters will ask the children to keep it secret from their parents. Ensure your children understands that if someone has asked them to keep a secret from you that it isn't because the child will get into trouble but the person who has asked them to keep the secret knows what they are doing to them is wrong. Express interest in all of your child's activities, including schoolwork, extracurriculars, hobbies, and other interests. Let your child know that they can tell you anything, and that you're always willing to talk. Reassure them that they won't get in trouble if they talk to you about something that made them uncomfortable or something they found unusual."
    },
    {
      "title": "Teach your child to recognize inappropriate touching.",
      "content": "Teach your child to recognize inappropriate touching. Many parents use the \"good touch, bad touch, secret touch\" method. It involves teaching your child that there are some appropriate touches, like pats on the back or high fives; there are some unwelcome or \"bad' touches, like hits or kicks; and there are also secret touches, which are touches that the child is told to keep a secret. Use this method or another one to teach your child that some touches aren't good, and when these happen, they should tell you immediately. [10] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Teach your child that no one is allowed to touch them in private areas. Many parents define private areas as those that would be covered by a bathing suit. Children also need to know an adult should not ask a child to touch anyone else's private areas or their own. Tell your child to say \"no\" and walk away if someone tries to touch them in a private area. Tell your child to come to you immediately if someone touches them the wrong way, even if that person told them to keep it a secret. Teach your child that not only their private parts, but their entire body should be respected at all times. Teach them that it is okay to say \"no\" to things they are uncomfortable with and to immediately get away from anyone who won't respect their boundaries."
    },
    {
      "title": "Recognize when something is out of sync with your child.",
      "content": "Recognize when something is out of sync with your child. If you notice your child is acting differently, pursue the issue to find out what is wrong. Regularly asking your child questions about their day, including asking whether any \"good,\" \"bad,\" or \"secret\" touches happened that day, will help open the lines of communication. Never dismiss it if your child tells you they were touched inappropriately or don't trust an adult. Trust your child first. [11] X Research source Never dismiss a child's claims because the adult in question is a valued member of society or appears incapable of such things. That's exactly what a child molester wants. Remember that the most important thing you can do to protect your child is to pay attention to them. Assess their needs and desires, talk to them, and in essence, just be the best parent you possibly can. Bottom line to remember: If you don't pay attention to your child, someone else will. Remember that kids around 12 should already have gone through sex education by their parents and told what everything means/is called. This will prevent a teacher/friend who is a child molester from taking the lead and teaching whole other aspects. Make sure your child already knows everything it needs to know, before it gets taught very different meanings of words or gets told that kissing/licking the teachers cheek is totally fine. If the child is very young or younger than 14, they might not recognize that there's a difference between a grumpy teacher giving extra homework, or a strange acting teacher that wants them to kiss their cheek before leaving the room. Both to them are 'annoying.' So make sure whenever your child tells you vague stories about the teacher making sex-jokes or touching them, or being 'annoying' and asking all kinds of 'private stuff' that there might be something going on. As soon as the child mentions the teacher is acting strange or is asking private info/pictures/things about siblings, you have to tell your child how to react to this. Be realistic in the approach! Telling your kids to scream loudly when the teacher touches their shoulder, or hit their hand and yell whenever they'd touch their back, won't help. They won't hit a teacher, especially not when they're being groomed and told they're only trying to help. Make sure they will tell them clearly that they have told their parents about what happened and they weren't happy with it. Or give the child an envelope, containing a letter that says; 'Stop touching my child' and your signature. Make sure they give it to them when they are touching a bad part of their body and didn't stop when they said stop."
    }
  ]
}