{
  "url": "https://www.wikihow.com/Make-a-Chakra-Bracelet",
  "title": "How to Make a 7 Chakra Bracelet for Healing",
  "steps": [
    {
      "title": "Select 7 crystal beads for the chakras.",
      "content": "Select 7 crystal beads for the chakras. You have seven chakras from your head to your pelvis. Together they form a line or channel of energy that keeps you moving and grooving. Each of these chakras is associated with a color, so picking beads or gemstones that match these colors is especially important. Here are some colors and gemstones you can choose from for each chakra: [2] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 11 March 2022. Root Chakra: (Red) coral, garnet, bloodstone, ruby, or smoky quartz Sacral Chakra: (Orange) carnelian or fire opal Solar Plexus Chakra: (Yellow) citrine, amber, tiger’s eye, ametrine, golden rutilated quartz, or honey opal Heart Chakra: (Green) malachite, green tourmaline, emerald, jade, chrysoprase, or peridot Throat Chakra: (Blue) blue topaz, blue kyanite, or turquoise Third-Eye Chakra: (Indigo) amethyst, fluorite, quartz, or lapis lazuli Crown Chakra: (Purple) selenite, clear quartz, or amethyst"
    },
    {
      "title": "Measure 12 inches (30 cm) of stretch cord.",
      "content": "Measure 12 inches (30 cm) of stretch cord. Stretch bracelets are generally 7 to 10 inches (18 to 25 cm) inches long depending on wrist size, but starting with a longer piece of cord will leave plenty of wiggle room to tie it off when you’ve finished beading. [3] X Research source Stretch out the cord before you cut it. A few gentle tugs will help the cord keep its elasticity. If you don’t know your wrist size, wrap a piece of cord around your wrist, find a comfortable size, and measure the length."
    },
    {
      "title": "Lay out the pattern of your beads.",
      "content": "Lay out the pattern of your beads. This can help you get an idea of what the finished bracelet will look like. Start with your filler beads. These will be the beads that make up the majority of your bracelet. [4] X Research source What you choose for your filler bead is totally up to you! We suggest matte black or clear glass beads, but you can pick whatever speaks to you. A beadboard can help you measure and plan out your design. You can pick these up at your local craft store or online."
    },
    {
      "title": "Line up the gemstones in chakra order from left to right.",
      "content": "Line up the gemstones in chakra order from left to right. The order should be red, orange, yellow, green, blue, indigo, and purple. This represents the order of the chakras from your pelvis to your head. Add some extra flair to your design with spacers. Put these tiny oval beads before your red gemstone and after your purple gemstone."
    },
    {
      "title": "Add more filler beads to your pattern.",
      "content": "Add more filler beads to your pattern. The lined-up beads should be about the same length you want your bracelet to be. Measure how much space you have left, and fill in the rest with filler beads. Make any final adjustments to your pattern and get ready to bead!"
    },
    {
      "title": "Clamp the end of your cord with a bead stopper.",
      "content": "Clamp the end of your cord with a bead stopper. This will help make sure your beads don’t glide off the end of your cord while you bead. If you don’t have a bead stopper, try using a binder clip."
    },
    {
      "title": "Add beads to the cord one at a time until your design is complete.",
      "content": "Add beads to the cord one at a time until your design is complete. Moving from left to right of your pattern, and keep adding until all the beads are on your cord. If your beads have a small hole, you can use a beading or eye needle to help push the cord through."
    },
    {
      "title": "Secure the ends of your bracelet together with a hidden knot.",
      "content": "Secure the ends of your bracelet together with a hidden knot. Remove the stopper, and hold the two ends of the bracelet in your hand. Bring the two ends together to form a circle. Start with a regular overhand knot, as if you were tying your shoe. Before tightening the knot, loop the string through the knot a second time to make a surgical knot . Do one more overhand knot, and your bracelet is secure. [5] X Research source Add a dab of jewelry glue on top of the knot for some extra security."
    },
    {
      "title": "Tuck the leftover cord into the beads to hide it.",
      "content": "Tuck the leftover cord into the beads to hide it. Weaving some of the cord back through the bracelet can help your knot stay in place. After tucking the cord through a couple of beads, cut off the remaining cord and voila! Your bracelet is ready to wear. [6] X Research source"
    },
    {
      "title": "Cleanse and charge your bracelet (if you'd like).",
      "content": "Cleanse and charge your bracelet (if you'd like). [7] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 11 March 2022. Your chakra bracelet stores and releases energy. Before you wear it, make sure you set some good intentions. A cleanse can help purify your gemstones of any bad mojo, and a quick charge can refill your bracelet with good vibes. [8] X Research source Cleanse your bracelet after being around negative energy by running it under water, patting it dry, and holding it in your hand while whispering positive affirmations. Charge your bracelet when you need an extra pick-me-up by leaving it out in the sun or under a full moon. Do this from dusk until dawn or overnight. [9] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 11 March 2022."
    }
  ]
}