{
  "url": "https://www.wikihow.com/Help-a-Cat-That-Is-Dragging-Its-Rear-Legs",
  "title": "How to Help a Cat That Is Dragging Its Rear Legs",
  "steps": [
    {
      "title": "Give a medical history.",
      "content": "Give a medical history. When you bring your cat in, you'll need to give information about the cat's symptoms, particularly when the cat started exhibiting the problem. You also should note if you saw anything that could have caused the problem, such as an injury. If your cat has been exposed to ticks, you should note that as well. [1] X Research source"
    },
    {
      "title": "Prepare for a physical exam.",
      "content": "Prepare for a physical exam. The vet will begin with a physical exam, where they will check your cat from nose to tail, focusing on the problem area. Often the vet may need to gently restrain the cat to examine it."
    },
    {
      "title": "Expect diagnostic tests.",
      "content": "Expect diagnostic tests. The vet will need to perform these tests to help narrow down the problem. The vet may take blood and urine samples to be sent for testing. The vet may also take an x-ray to see if the problem is physical (in the spine). [2] X Research source The vet may also take CT scans or MRIs or perform a biopsy. If the cat has experienced trauma, then the vet will likely assume the condition is related, and diagnostic tests like x-rays will help the vet see the nature of the injury. Similarly, it could be a back problem, such as a slipped disc, which an x-ray will also help determine. For other problems, such as diabetic problems and tick poisoning, blood and urine tests will help narrow down the issue. If your vet suspects a or finds a tumor, they'll likely use a biopsy to tell if it is benign."
    },
    {
      "title": "Understand hospitalization may be necessary.",
      "content": "Understand hospitalization may be necessary. When a cat is first having problems in its back legs, a hospital visit is likely in order, especially if the cat is having trouble doing things like going to the bathroom. In the hospital, the vet can observe and diagnose the cat. [3] X Research source"
    },
    {
      "title": "Take the cat to physical therapy.",
      "content": "Take the cat to physical therapy. Some causes of paralysis, such as a slipped disc, may be partially treated by physical therapy. You'll likely need to take the cat to a physical therapist, which may just be someone at your vet's clinic. In addition, the specialist may give you exercises for the cat at home. [4] X Research source"
    },
    {
      "title": "Control your cat's diabetes.",
      "content": "Control your cat's diabetes. Uncontrolled diabetes can lead to weakness in the back legs. Evening out your cat's disease can help the cat regain strength. [5] X Research source The main ways to control your cat's diabetes are through insulin, medication, and a weight-loss diet. The type of diet your cat should be on depends on the cat. Some cats do best on a very high-protein diet, while other diabetic cats do best on a high-fiber, complex carbohydrate diet. Talk to your vet about the best one to start your cat on. Ask your vet about supplements. Some pet owners have had success with potassium, L-carnitine and/or methylcobalamin. Be extremely careful when giving your cat potassium, because it can be fatal in the wrong doses."
    },
    {
      "title": "Ask if surgery is necessary.",
      "content": "Ask if surgery is necessary. In some cases, surgery may be the only solution. Surgery can help with problems such as spine issues or tumors. If the cat had a traumatic injury, amputation of one or both of the back legs may be necessary. [6] X Research source After surgery, your cat may stay in the hospital a few days, or it may come home. You'll need to keep the cat calm by keeping it in a small, quiet area. Your vet may advise you keep the cat in a crate for a day or two. Give it small amounts of water and food throughout the day. Also, administer any medications prescribed by the vet. The cat may also need to wear a protective collar so it doesn't lick the stitches. [7] X Research source"
    },
    {
      "title": "Expect medications for saddle thrombus.",
      "content": "Expect medications for saddle thrombus. Saddle thrombus is a condition where your cat has a blood clot that travels from the heart. The arteries in your cat's back narrow just before they get to the back legs, so clots often stop there. In turn, your cat's back legs don't get enough blood flow. The main treatment for this condition is medication to dissolve the blood clot and pain medication to help keep the cat comfortable. However, some vets may not want to take this course of action. The disease is very painful for the cat and often indicates heart disease, as well, so some vets may recommend putting the cat to sleep. [8] X Research source Some cats don't recover the full use of their back legs. Also, the condition has a high chance of recurrence."
    },
    {
      "title": "Adapt the litter box to make it more accessible.",
      "content": "Adapt the litter box to make it more accessible. Cats with back leg paralysis will likely have trouble getting into a traditional litter box. You may need to add a ramp or get a very shallow litter box depending on your cat's needs. [9] X Research source"
    },
    {
      "title": "Take steps for incontinence.",
      "content": "Take steps for incontinence. If a cat is paralyzed in the back half of its body, it may need bathroom care. You will need to help it go to the bathroom by using your hands to empty its bladder and bowels. A vet will need to show exactly how to do this step. You'll also need to have the cat wear diapers. Bedding will need to be easy to clean."
    },
    {
      "title": "Provide mobility assistance in the form of wheelchair.",
      "content": "Provide mobility assistance in the form of wheelchair. Some cats get around just fine on their front legs, but a mobility assistance device can also do wonders. These devices provide a way to lift their back end and increase mobility through wheels, allowing the cat to be mobile."
    },
    {
      "title": "Invest in a drag bag.",
      "content": "Invest in a drag bag. While many cats will take to assistance devices, some cats don't. In addition, your cat cannot stay in an assistance device all day. For these purposes, your cat should have a drag bag. Basically, it covers the back end of the cat, so the cat doesn't get sores on its legs. Plus, it makes it easier for the cat to drag its back end because the bag is made of slick material. [10] X Research source You can find these bags online."
    },
    {
      "title": "Make your home accessible.",
      "content": "Make your home accessible. When a cat becomes disabled, you need to make changes around your home so it can get around more easily. You may need to install ramps over stairs, for instance, or move the food and litter box to the main floor. Consider adding a ramp to your cat's favorite couch so the cat can still get up on it. [11] X Research source Think about how your furniture is arranged, too. For instance, if your cat is in a wheelchair device, make sure the cat has enough room to get around."
    }
  ]
}