{
  "url": "https://www.wikihow.com/Make-a-Pi%C3%B1ata",
  "title": "How to Make a Piñata",
  "steps": [
    {
      "title": "Protect your work area.",
      "content": "Protect your work area. Making your piñata has the potential to get a little messy, so make sure you give yourself plenty of room to work. Cover your work area with layers of newspaper or a disposable plastic tablecloth. This will keep your tabletop clean, and make cleanup afterward a breeze. Keep yourself clean too by wearing an old shirt or apron as well as latex gloves."
    },
    {
      "title": "Make the papier-mâché paste.",
      "content": "Make the papier-mâché paste . In a bowl, mix 2 cups (473 g) of flour, 2 cups (473 ml) of water, and a tablespoon of salt. Stir the mixture until it starts to thicken like a batter. Don't worry about breaking down all the lumps; you want the batter to be relatively smooth but it will likely still have chunks of flour in it. [1] X Research source"
    },
    {
      "title": "Prepare your papier-mâché strips.",
      "content": "Prepare your papier-mâché strips. Tear some newspaper into strips that are about 1 to 2 inches (2.5 to 5.1 cm) wide and 6 to 8 inch (15.2 to 20.3 cm) long. This will make the newspaper lay nice and flat on the balloon. You will need to prepare many of these strips of paper so that you have enough to cover your balloon in several layers. [2] X Research source"
    },
    {
      "title": "Choose a shape for your piñata.",
      "content": "Choose a shape for your piñata. Make your piñata whatever you like! The easiest shape to make is an oblong sphere based on a balloon form, but you can create anything you want. [3] X Research source To create a more elaborate shape, tape or glue cardstock, and cardboard onto your balloon form. Traditional piñatas are made with a ceramic pot as the form, but these can be messy and dangerous. Stick with a pliable form made from paper products."
    },
    {
      "title": "Inflate your balloon",
      "content": "Inflate your balloon . This will form the body of your piñata, so make sure you make it nice and big. Round balloons are preferable because they will create a larger space for all of the candy. You may also use a box if you prefer a square shape for your piñata. Add any additional shapes to make legs, arms, tails, snouts, hats, etc., using cardboard, newspaper or construction paper. Tape these shapes on with masking tape or clear tape. [4] X Research source"
    },
    {
      "title": "Apply the papier-mâché paste to your paper strips.",
      "content": "Apply the papier-mâché paste to your paper strips. Dip the strips into your paste and remove any excess paste by running the strips through your pinched fingers or dragging them along the edge of the bowl. [5] X Research source"
    },
    {
      "title": "Apply the papier-mâché to the balloon.",
      "content": "Apply the papier-mâché to the balloon. Lay the strips down all over the balloon in a crisscross pattern until the entire balloon is covered. Leave the knot of the balloon uncovered to make removal of the balloon easier. Complete this step 3 to 4 times, allowing each layer to dry before adding another. [6] X Research source"
    },
    {
      "title": "Let the piñata dry.",
      "content": "Let the piñata dry. Once you have finished adding layers of papier-mâché, let the piñata sit until it is completely dry and has hardened. How long this will be will depend on many factors, including how thick the papier-mâché is, and the humidity and temperature of the air. In general, plan on several days. [7] X Research source"
    },
    {
      "title": "Paint",
      "content": "Paint the piñata. Use a single color to smooth out the paper and to create an even surface. It does not need to be especially well-painted, just enough to cover the paper. Choose a color that matches the decorations you'll be adding on or to match the animal or character that you're turning your piñata into, as it'll probably show through. [8] X Research source"
    },
    {
      "title": "Glue crêpe paper to the piñata.",
      "content": "Glue crêpe paper to the piñata. This will give your piñata a more traditional look. It is also a festive and inexpensive touch. Cut or tear strips of crêpe paper and glue it onto the piñata. Leave the paper in strips, or bunch it up into small tassel-like balls and glue on. [9] X Research source"
    },
    {
      "title": "Add finishing touches.",
      "content": "Add finishing touches. Once you've gotten the base of crêpe paper on, add other neat details to your piñata. Colorful cupcake liners and brightly colored tissue squares can be added as fringe. If you made an animal, add googly eyes for a fun look."
    },
    {
      "title": "Cut a hole for the candy.",
      "content": "Cut a hole for the candy. If the balloon has not yet popped, go ahead and pop it and remove it. Since you did not cover the knot of the balloon with your papier-mâché, you should have a small hole already. [10] X Research source"
    },
    {
      "title": "Make the hole bigger if needed.",
      "content": "Make the hole bigger if needed. If the candy doesn't fit, cut away at the edge of the hole until it is large enough to pass the candy through. [11] X Research source"
    },
    {
      "title": "Punch two small holes around the main hole.",
      "content": "Punch two small holes around the main hole. Tie a string or ribbon to the holes to create a loop. This will come in handy later when it comes time to hang the piñata."
    },
    {
      "title": "Put the goodies in the piñata",
      "content": "Put the goodies in the piñata . Start adding in candy, streamers, stickers, confetti, small toys or anything else you like. Avoid adding any candy that isn't wrapped. Toys that may break easily are also a poor choice."
    },
    {
      "title": "Cover the hole.",
      "content": "Cover the hole. Glue down some crêpe paper on top of the hole, or use masking tape. The goal is to prevent the filling of the piñata from falling out before you've actually hit it."
    },
    {
      "title": "Hang the piñata",
      "content": "Hang the piñata . Tie another piece of string, ribbon, or rope to the loop you've already made and use this to attach the piñata to whatever you'd like to hang it from."
    }
  ]
}