{
  "url": "https://www.wikihow.com/Make-ACH-Payments",
  "title": "Pay with ACH: Simple and Secure Automatic Payments",
  "steps": [
    {
      "title": "Sign up for online bill pay with your bank or credit union.",
      "content": "Sign up for online bill pay with your bank or credit union. With bill pay, you give your bank permission to pay money out of your account to a specific business. Since it goes through your bank, you don't have to worry about giving any of your banking information to the business you want to pay. [1] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source If you get anxious handing around your bank account number, you might feel better using bill pay than setting up direct payments with the business."
    },
    {
      "title": "Search for the name of the business you want to pay.",
      "content": "Search for the name of the business you want to pay. Bank bill pay pages typically have a drop-down menu of common businesses that are eligible for the bank's bill pay service. Find the business you want and select it, then provide information about your account so you can link it. [2] X Research source If you don't see the business listed, call your bank's customer service number or use the help chat function on your app to find out what you need to do to pay them through the bill pay service. It's a good idea to have a copy of your most recent bill from the business handy—all of the information you need to provide to your bank will likely be there. Typically, you'll need to provide the name and address of the business, the name your account is in (if it's different than the name on your bank account), and your account number with the business."
    },
    {
      "title": "Provide the date and payment amount.",
      "content": "Provide the date and payment amount. Generally, you can make your payment whenever you want—although it's usually best to use the due date the business provides (or maybe a day or two before). That way, if there are ever any problems with your bill, you can get that straightened out before your payment goes through. Just keep in mind that with online bill pay, your payment will always go through on the specific day you select—even if the business doesn't actually get the money for another day or two, that date will still be reflected as the date your payment posted. [3] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source Pay attention to whether the business accepts electronic payments. If they don't, you might want to set the \"send\" date a few days to a week in advance of the due date. Your bank will send a check on the date you select, but this will help you avoid any hiccups. You can set the frequency of payments as well. For example, you might want to make your mortgage payment on the first of each month. Typically, you can set payments up to a year in advance."
    },
    {
      "title": "Confirm the transaction details and payment method.",
      "content": "Confirm the transaction details and payment method. Typically, your bank will provide a summary of the scheduled transaction (or transactions) for you. Look over the details carefully and make sure everything's correct before you okay it. [4] X Research source Sometimes, your bank can't connect with the business to make an ACH payment and has to send a paper check instead. If your bank sends a paper check, the money is still pulled from your account on that day, but it can take up to 5 days for your payment to reach the business."
    },
    {
      "title": "Get your bank account and routing numbers.",
      "content": "Get your bank account and routing numbers. If you happen to have a blank check, the numbers you need will be on the bottom of the check. Otherwise, you can typically find the routing number on your bank's website or mobile app. You'll need both your full account number and your bank's routing number to set up an ACH debit payment. [5] X Research source The routing number isn't private information like your account number is, so it should be really easy to find. If you're having trouble finding your personal account number, you might need to call your bank or go into a branch in person."
    },
    {
      "title": "Fill out an authorization form with the business to set up payments.",
      "content": "Fill out an authorization form with the business to set up payments. This might be a paper form or it might be a form on the organization's website. Your signature is also typically required, although for an online form an electronic signature is usually fine. [6] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source In addition to your account number and your bank's routing number, provide your name as it is listed on your bank account."
    },
    {
      "title": "Confirm the date and payment amount for each transaction.",
      "content": "Confirm the date and payment amount for each transaction. For a recurring bill, you'll likely have the option of either making a one-time payment or setting automatic payments. For automatic payments, the money comes out of your account on the same date every month. [7] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source If your bill is a set amount every month, that'll be your payment amount. If you're setting an automatic payment for a bill that varies, such as a utility bill, you'll typically have options to set a maximum amount or pay whatever balance is due. The business will typically send you a notification a week or two before the payment date so you'll know the amount and can plan accordingly."
    },
    {
      "title": "Submit the form with your signature.",
      "content": "Submit the form with your signature. With your signature, you authorize the business to take money out of your account on the schedule you've provided. Read through the authorization statement before you sign and make sure you understand it—especially in terms of what will happen if the money isn't there. [8] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source Sometimes if an ACH payment is returned, the business will just keep resubmitting it, which means you could end up racking up a lot of fees if you don't correct the problem quickly."
    },
    {
      "title": "Watch your bank account for a test transaction.",
      "content": "Watch your bank account for a test transaction. Typically, the business will pull a few pennies from your bank account just to confirm that the information you provided was correct. As long as this transaction goes through, you don't have to do anything. [9] X Research source If the test transaction fails, the business will likely contact you to provide further information. It could be that you entered your account or routing number incorrectly."
    },
    {
      "title": "Pay lower transaction fees than with other electronic payment methods.",
      "content": "Pay lower transaction fees than with other electronic payment methods. Banks, credit unions, and businesses don't charge fees for ACH payments. If you use a debit or credit card, on the other hand, your transaction might be subject to a surcharge or fee. [10] X Trustworthy Source National Conference of State Legislatures Bipartisan, nongovernment organization serving the members of state legislatures and their constituents Go to source Many businesses bake the surcharges into their prices, so you might not notice a difference in cost. If you set up an ACH payment with a business that tacks on a surcharge or \"convenience fee\" for using a debit or credit card you'll save a few bucks each month—and that adds up! Some businesses also offer a discount if you sign up for autopay. Again, it's typically only a few bucks, but it adds up over time. [11] X Research source If you own a business and want to accept ACH payments, you'll need to sign up for a payment processing service, such as Square."
    },
    {
      "title": "Enjoy greater security than with a personal check or debit card.",
      "content": "Enjoy greater security than with a personal check or debit card. Since ACH payments are settled through the Federal Reserve, they're more secure than other methods of payment. Once the payment details are set up, they're handled within banks. [12] X Research source Even better, if you use bill pay through your bank to set up an ACH credit payment, you never even have to give your bank account information to the business. [13] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source"
    },
    {
      "title": "Process your transaction more quickly than other methods.",
      "content": "Process your transaction more quickly than other methods. Although the money might not be available to the business you paid immediately, it comes out of your account on the date you set for the transaction. That means you can rest easy knowing the bill has been paid and the money is already out of your account. [14] X Research source The ACH network doesn't settle transactions on weekends or holidays, but since standard industry practice is that a due date that falls on a weekend or holiday is moved to the next business day, this shouldn't really affect you."
    },
    {
      "title": "Use automatic payments to make bills don't slip through the cracks.",
      "content": "Use automatic payments to make bills don't slip through the cracks. When you set up an automatic ACH payment for a regular bill, you don't have to think about it every month—the money comes out of your account like clockwork. As long as you follow your budget , worrying about bills can become a thing of the past. [15] X Research source Be careful about your budget and make sure you check your account balance regularly—it can help you avoid costly overdrafts and fees if you don't have enough to cover an automatic payment. [16] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source"
    }
  ]
}