{
  "url": "https://www.wikihow.com/Kill-Vittoria-Vici-in-Skyrim",
  "title": "How to Kill Vittoria Vici in Skyrim",
  "steps": [
    {
      "title": "Start the “Bound Until Death” quest.",
      "content": "Start the “Bound Until Death” quest. After completing “The Silence has Been Broken” quest, you'll be required to go back to the Dark Brotherhood Sanctuary, west of Falkreath. Inside you'll be talking to Gabriella, one of the assassins of the brotherhood. She'll then tell you that you need to assassinate a woman named Vittoria Vici, who's getting married."
    },
    {
      "title": "Head to Solitude.",
      "content": "Head to Solitude. Vittoria Vici can be found in the Temple of the Divines in Solitude. Take the northeastern road from the Dark Brotherhood Sanctuary, and it will lead you north all the way to the city of Solitude."
    },
    {
      "title": "Find Vittoria Vici.",
      "content": "Find Vittoria Vici. Once you get inside Solitude, walk straight up to the other end of the city and turn right. Here you'll find the Temple of the Divine where Vittoria Vici is sitting together with her husband. You can approach and talk to her if you like, but it is not necessary."
    },
    {
      "title": "Go up the Temple of the Divine.",
      "content": "Go up the Temple of the Divine. From where Vittoria Vici is sitting, take the exit on the left that leads back to the main courtyard. On the right side from the exit you took, you'll notice a staircase that leads to a place up the building. Take this staircase to the upper area of the Temple of the Divine."
    },
    {
      "title": "Find the gargoyle statue.",
      "content": "Find the gargoyle statue. Up in this area you'll find a singular statue that looks like the head of a horse; it is sitting right outside the edge of the stony path you're on. If you approach it and look over the edge, you'll see that it sits right on top of where Vittoria and her groom are sitting."
    },
    {
      "title": "Wait for dusk to fall.",
      "content": "Wait for dusk to fall. After the celebration, which happens around past 5 o'clock in the afternoon, Vittoria and her groom will leave their seat and walk up to the balcony right below the gargoyle statue."
    },
    {
      "title": "Kill Vittoria Vici.",
      "content": "Kill Vittoria Vici. Once Vittoria and her husband are on the balcony, approach the statue and an “Interaction” button will appear on the screen. Press the Interaction button on your controller as instructed, and your character will push the gargoyle off the edge of the stone path on to the balcony, killing Vittoria Vici."
    },
    {
      "title": "Leave Solitude.",
      "content": "Leave Solitude. While everyone is in panic, climb down the staircase and leave the city of Solitude without being attacked by the guards. This strategy will also help you avoid getting a bounty on your head."
    }
  ]
}