{
  "url": "https://www.wikihow.com/Heal-Mosquito-Bites-Fast",
  "title": "How to Treat Mosquito Bites Quickly at Home",
  "steps": [
    {
      "title": "Clean the bite with soap and cool water.",
      "content": "Clean the bite with soap and cool water. As soon as you can, gently wash the bite and the area around it with soap and water. This can help soothe itching and prevent infection. Rinse away any soap and gently pat the area dry with a clean towel. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Opt for cool water rather than warm or hot. Cool water can help soothe reduce swelling and soothe itching. Don't rub the bite when you dry it off, since this can irritate the bite and make any itching worse."
    },
    {
      "title": "Try an over-the-counter hydrocortisone or antihistamine cream.",
      "content": "Try an over-the-counter hydrocortisone or antihistamine cream. Although medicated creams and gels may not be the least expensive way to heal mosquito bites, they may be the easiest. Simply dab a little onto the bitten area and rub it in gently so the medicine is absorbed by the skin. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Hydrocortisone creams can help reduce swelling and inflammation. Antihistamine creams, such as Benadryl, can relieve itching and minimize the urge to scratch the bite. Make sure the skin is clean before you rub in any cream or gel to ensure you don't irritate your skin."
    },
    {
      "title": "Dab the bite with toothpaste.",
      "content": "Dab the bite with toothpaste. A light dab of regular toothpaste directly on a mosquito bite may relieve itchiness and any pain associated with the bite. Toothpaste tends to work best as a remedy if you put it on the bite immediately. [4] X Research source Toothpastes with mint tend to work better than other flavors. The menthol in the mint also has a cooling effect, which helps to soothe inflammation and reduce swelling. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Smear on aloe vera lotion or gel.",
      "content": "Smear on aloe vera lotion or gel. If you've ever had a sunburn, you likely already understand the soothing effect of aloe vera . The same aloe vera lotion or gel can also ease itching and inflammation of mosquito bites. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you're using natural or organic aloe vera gel, putting it in the refrigerator for a few minutes before applying it to your skin adds a cooling effect that may further reduce inflammation."
    },
    {
      "title": "Rub honey on the bite to clean it and reduce swelling.",
      "content": "Rub honey on the bite to clean it and reduce swelling. Honey has antibacterial properties that work to clean the bitten skin and provide a protective barrier against bacteria. Since honey is also an anti-inflammatory, it may help to reduce inflammation and swelling around the bite. [7] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source Organic or local honey varieties may work better than commercial honey to provide relief because they don't have added sugars or other chemicals. Don't use honey if you're still outside, since it may attract other insects."
    },
    {
      "title": "Make a paste with 1 tsp (7 g) of baking soda and 1 cup (240 mL) of water.",
      "content": "Make a paste with 1 tsp (7 g) of baking soda and 1 cup (240 mL) of water. This paste may not do much to relieve inflammation or swelling, but it can help stop the itching. While this isn't necessarily something you can do to help the bite immediately, it can help once you've gone inside. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Clean the bitten skin with soap and water and pat it dry before applying a baking soda and water paste."
    },
    {
      "title": "Use ice to prevent swelling and inflammation.",
      "content": "Use ice to prevent swelling and inflammation. An ice pack or a cool, damp washcloth on the bitten area can calm the skin so the bite doesn't become quite as red and swollen. Leave ice on your skin for no longer than 15 minutes at a time. Avoid placing ice directly on your skin as this can lead to burns. [9] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source An ice pack or cold compress may also reduce the itching sensation. However, this effect only lasts as long as your skin is cooled. Once you remove the ice pack or cold compress and your skin's temperature returns to normal, the itching will also likely return. Menthol has a similar anti-inflammatory effect without lowering the surface temperature of your skin. Creams or ointments with menthol in them may help reduce inflammation. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take an oral antihistamine if you have a more severe reaction.",
      "content": "Take an oral antihistamine if you have a more severe reaction. Oral antihistamines such as diphenhydramine (Benadryl), cetirizine (Zyrtec), loratadine (Claritin), and fexofenadine (Allegra) can be more effective at easing the swelling, inflammation, and itching of mosquito bites than products you apply directly to your skin. Most of these medicines are available over the counter. [11] X Research source If you have a history of severe reactions to mosquito bites, take an oral antihistamine a few hours before you plan to be outside where mosquitos will likely be present. Most oral antihistamines provide 24-hour relief. Benadryl, however, must be taken once every 6 hours to retain its effectiveness. Carefully follow the dosage instructions on the package when using an over-the-counter oral antihistamine unless you've been directed otherwise by your doctor."
    },
    {
      "title": "Avoid scratching your mosquito bites.",
      "content": "Avoid scratching your mosquito bites. Bites become infected when you introduce bacteria into them by scratching them. Infections are most common with small children, who also may have dirtier hands and fingernails than adults – especially if they're playing outside. [12] X Research source Keep in mind that scratching a mosquito bite only provides temporary relief. At the same time, it can help spread the mosquito's saliva, which is responsible for the reaction."
    },
    {
      "title": "Clean blisters or broken skin with soap and water.",
      "content": "Clean blisters or broken skin with soap and water. Mild soap and warm water are sufficient to clean bacteria from the skin. If you scratch your mosquito bites to the point that they're bleeding, stop and wash the area immediately. [13] X Research source If your skin develops a blister where the mosquito bit you, take care not to pop the blister when you're cleaning your skin. This can increase your skin's sensitivity and also leaves a raw area exposed to bacteria."
    },
    {
      "title": "Cover broken skin with gauze or a bandage.",
      "content": "Cover broken skin with gauze or a bandage. If you have scratched a mosquito bite or popped a blister, cover it with a bandage or small piece of gauze so that it is no longer exposed to open air. This can reduce the risk of infection. [14] X Research source If the bite is surrounded by a larger area of redness or inflammation, make sure the gauze or bandage you use completely covers the inflamed skin. Don't apply any adhesive material directly to the inflamed skin."
    },
    {
      "title": "Reapply topical medication every 4 hours.",
      "content": "Reapply topical medication every 4 hours. If you're using a medicated cream or lotion, it will lose effect if not reapplied and you may start scratching again. Wash the bitten area with mild soap and warm water before applying the medication and pat it dry. [15] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source Rub the medicated cream into the skin around the bite so the medicine is well-absorbed. However, avoid rubbing directly on the bite, especially if a blister has formed. You could break the skin. To put the cream directly on the bite, simply dab it with the pad of a finger."
    },
    {
      "title": "Watch for warning signs of infection.",
      "content": "Watch for warning signs of infection. Skin that is broken or raw, typically from scratching, can become infected. Sometimes the signs of infection won't be apparent immediately. Be on the lookout for a bite surrounded by swelling and inflammation that spreads across a larger area. Other signs of infection include pus or drainage around the bite, chills, or a fever over 100 °F (38 °C). [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you notice any of these warning signs of infection, make an appointment to see your doctor as soon as possible. If the bite is infected, it will take a round of antibiotics to heal. While you're waiting to see the doctor, treat the infected bite with a topical antibiotic cream such as Bacitracin or Neosporin. Some antibiotic ointments also provide relief for itching and pain. [17] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source"
    },
    {
      "title": "Stay inside at dawn and dusk when mosquitoes are most active.",
      "content": "Stay inside at dawn and dusk when mosquitoes are most active. While mosquitoes in some areas may be active throughout the day and even into the night, they are most active in the hours around sunrise and sunset. During these times, you're far more likely to get bitten, even if you're taking other precautions. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you are outside, try to stay in screened-in areas where mosquitoes will have a harder time getting to you. For example, you might watch the sunset from a screened-in porch."
    },
    {
      "title": "Wear protective clothing when you are outside.",
      "content": "Wear protective clothing when you are outside. A long-sleeved shirt, long pants, and a hat are good protection against mosquitoes. Even if it's hot outside, you can wear lighter clothing that won't overheat you. Wearing white or light-colored clothing may actually keep you cooler than if you were wearing less clothing that exposed your skin. Loose-fitting clothing will also keep you from sweating as much."
    },
    {
      "title": "Use an insect repellent when outside for extended periods of time.",
      "content": "Use an insect repellent when outside for extended periods of time. Commercial insect repellents with DEET as the active ingredient work well to repel mosquitoes and keep them away from you. You can spray your skin as well as your clothing. [19] X Research source Follow the instructions on the label carefully. Wash your hands after applying insect repellent and before eating, as it can be harmful if ingested."
    },
    {
      "title": "Eliminate standing water around your home.",
      "content": "Eliminate standing water around your home. Mosquitos lay their eggs in and around stagnant pools of water. If water has puddled or pooled and is left standing, you may end up with an infestation of mosquitoes. Drain the water as best you can, providing drainage where possible so water doesn't pool up. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you have containers outside that collect water, empty them after any rainfall. Outdoor containers that are meant to hold water should be covered with a tight lid to prevent mosquitoes from accessing them. Empty and scrub clean containers such as vases, pet water bowls, and birdbaths once a week."
    }
  ]
}