{
  "url": "https://www.wikihow.com/Make-a-Bonfire-with-Lighter-Fluid",
  "title": "How to Make a Bonfire with Lighter Fluid",
  "steps": [
    {
      "title": "Locate where you want to have the bonfire.",
      "content": "Locate where you want to have the bonfire. Make sure the location is dry. Make sure the wood you want to burn is dry as well."
    },
    {
      "title": "Place a couple of wood in the pit, and align them at an angle so they balance against each other as shown below.",
      "content": "Place a couple of wood in the pit, and align them at an angle so they balance against each other as shown below. Align them so there is a gap near the bottom. [1] X Research source"
    },
    {
      "title": "Tear large pages of newspaper or gather a bunch of twigs and leaves.",
      "content": "Tear large pages of newspaper or gather a bunch of twigs and leaves. [2] X Research source"
    },
    {
      "title": "Set the newspaper on fire with the lighter and stick the first piece in the middle of the wood through the gap which you should have made before.",
      "content": "Set the newspaper on fire with the lighter and stick the first piece in the middle of the wood through the gap which you should have made before. You can choose to do this 2 ways: You can light the newspaper in your hand and then place it in the middle of the wood. You can place the newspaper in the middle first and then light it. If you are using twigs and leaves, place them in the middle of the wood FIRST before lighting them. They are smaller so it is unsafe to light them in your hand before placing in the center."
    },
    {
      "title": "Take more pieces of paper and place them at different angles in the center of the wood to spread the fire and burn the wood balancing against each other.",
      "content": "Take more pieces of paper and place them at different angles in the center of the wood to spread the fire and burn the wood balancing against each other. The newspaper will catch on fire, so place it in fast and quickly move your hand out of the fire pit."
    },
    {
      "title": "Take the lighter fluid and carefully pour it on top wood.",
      "content": "Take the lighter fluid and carefully pour it on top wood. Pour from as far as possible because flames will shoot straight up. Move your hand away fast so you don't burn yourself; the lighter fluid will catch on fire very quickly. Do not lean over pit when doing this. [3] X Research source"
    },
    {
      "title": "When you notice the fire starting to go down add additional wood onto the fire and use your stick/ metal rod and carefully move the wood around so it all is burning evenly.",
      "content": "When you notice the fire starting to go down add additional wood onto the fire and use your stick/ metal rod and carefully move the wood around so it all is burning evenly. At this point, the fire should be burning pretty well. Watch out for the heat when moving around pieces. Keep adding newspaper to the pit and/or very small amounts of lighter fluid to the wood."
    },
    {
      "title": "Repeat the process of using your stick or metal rod and carefully moving the food around, whenever you notice the fire to go down again[4] X Research source",
      "content": "Repeat the process of using your stick or metal rod and carefully moving the food around, whenever you notice the fire to go down again [4] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}