{
  "url": "https://www.wikihow.com/Make-a-Rainbow",
  "title": "How to Make a Rainbow",
  "steps": [
    {
      "title": "Get a prism.",
      "content": "Get a prism. There are different types of prisms that manipulate light in different ways. You will need to get a basic prism, also called a refractive prism. This type of prism will allow the light to bend in a way that splits it based on its wavelength. In other words, shorter wavelengths bend more, and longer wavelengths bend less. This creates a rainbow as the light exits the prism. [1] X Research source You can buy a prism at a science supply store, a hobby store, or online. Basic prisms are relatively inexpensive."
    },
    {
      "title": "Find a sunny place.",
      "content": "Find a sunny place. The prism operates by splitting a beam of white light into its component colors. To see this, you will need a high-intensity light source. Put the prism by a sunny window or outside on a sunny day. [2] X Research source"
    },
    {
      "title": "Allow light to pass through the prism.",
      "content": "Allow light to pass through the prism. Make sure that there is nothing blocking the light from reaching the prism. As the light passes through, it will bend and be split into a rainbow. It might be easier to see if you aim the prism at a white wall or a white piece of paper. [3] X Research source"
    },
    {
      "title": "Locate a water source.",
      "content": "Locate a water source. Usually, rainbows are seen in the rain. That is because there are many water droplets falling through the sky refracting the sun’s light. To mimic that, you should find a source of water that can be moved. A water hose or a spray bottle will work nicely. [4] X Research source"
    },
    {
      "title": "Create a mist.",
      "content": "Create a mist. A stream of water is not ideal for creating a visible rainbow. Instead, you want a mist of water that the sun has to pass through. You can create this mist by holding your thumb over the end of a water hose, or turning a nozzle to the “mist” position. [5] X Research source"
    },
    {
      "title": "Turn your mist so that it catches the light.",
      "content": "Turn your mist so that it catches the light. Once you have a steady mist, turn so that the sun’s light passes directly through the mist. This will allow the sunlight to be refracted by the small droplets of water. You will see the rainbow form in the mist. [6] X Research source"
    },
    {
      "title": "Fill a clear glass with water.",
      "content": "Fill a clear glass with water. Get a glass that has smooth, clear edges. Textured, colored, or patterned glass will impair the results. Fill the glass all the way to the top and try not to spill any of the water. [7] X Research source Alternatively, you can put the water in a tub or other container. If you do this, place a mirror in the container and submerge it halfway at a 45 degree angle. [8] X Research source"
    },
    {
      "title": "Let light shine through the glass.",
      "content": "Let light shine through the glass. The light should shine through the top of the glass and directly hit the surface of the water. The light should shine out the side of the glass, and a rainbow will be visible. The water causes the light to refract much in the same way that a prism does. [9] X Research source"
    },
    {
      "title": "Use a backdrop if you’re using a tub and mirror.",
      "content": "Use a backdrop if you’re using a tub and mirror. If you are struggling to see the rainbow, position the glass so that it shines onto a white wall or a white piece of paper. This backdrop will make it easier to see the rainbow. You can use other colors, but this might not be as effective. [10] X Research source If you are using a mirror in a tub, place the paper above the mirror to see the light when it refracts."
    }
  ]
}