{
  "url": "https://www.wikihow.com/Keep-Your-School-Clean",
  "title": "How to Keep Your School Clean",
  "steps": [
    {
      "title": "Wipe your feet on mats before you enter the school building.",
      "content": "Wipe your feet on mats before you enter the school building. Dirt, pollen, and leaves can all be tracked in by students’ feet, making the floors look dirty. Help keep this from happening by wiping your feet before you come in the door. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If your school doesn't have mats, lightly scuff your feet on the sidewalk before you walk inside. Ask your principal about getting mats if your school doesn't have any. Offer to start a fundraiser to pay for the mats if your school doesn't have room in the budget."
    },
    {
      "title": "Throw any trash you see into wastebaskets.",
      "content": "Throw any trash you see into wastebaskets. It might not seem like a big deal if a candy wrapper falls out of your pocket, but over time, trash and litter can build up to make your school seem messy. If you notice someone else drop something, pick it up and throw it away. If you see a used tissue or something gross on the ground, use a napkin to pick it up so you don't have to touch it with your hands. Encourage your friends to follow your example in picking up trash when they see it."
    },
    {
      "title": "Recycle",
      "content": "Recycle paper, glass, and plastic. Recycling helps reduce the amount of trash that goes into the landfill, so you’re helping the environment and keeping your school clean at the same time. If your school doesn’t participate in a recycling program, ask your teachers or your principal about starting one."
    },
    {
      "title": "Put things away after you use them.",
      "content": "Put things away after you use them. If you get a book out of a shelf in your classroom or you use a microscope in the science lab, make sure you put it back when you’re finished using it. Leaving things lying around leads to cluttered, messy classrooms."
    },
    {
      "title": "Make sure your lunch table is clean before you leave.",
      "content": "Make sure your lunch table is clean before you leave. Don’t leave milk cartons, balled-up napkins, or pieces of food on your table. Push in your chairs as you leave the table, and remember to check the floor to make sure you didn’t drop anything."
    },
    {
      "title": "Mop up any spills right away.",
      "content": "Mop up any spills right away. If you spill your drink, clean it up right away. Use paper towels or ask a teacher if there is a mop you can use to clean up your mess."
    },
    {
      "title": "Take care not to damage displays around school.",
      "content": "Take care not to damage displays around school. Sometimes teachers might put dioramas, artwork, or science projects around the school to show off their students’ hard work. If you see any of these displays, take care not to bump into them or knock them over, since this can lead to a big mess."
    },
    {
      "title": "Ask your school’s administration for permission to organize a cleaning event.",
      "content": "Ask your school’s administration for permission to organize a cleaning event. Have an event at your school where a group of students, teachers, and even parents can help deep clean your school’s campus. Your event can take place over a lunch period, after school, or on a weekend. [2] X Research source Visit the office and ask the secretary if you can set up an appointment to talk to the principal about organizing an event. Make notes beforehand about some of the specific things you’d like to accomplish during the event. For instance, you might say, “We’d like to have a group of students come in on a Saturday to pick up trash on the playground and wash windows in the classrooms.” Before your meeting, ask teachers and students to sign a petition showing their support for the event."
    },
    {
      "title": "Gather your cleaning supplies.",
      "content": "Gather your cleaning supplies. If your school already has supplies, you may be able to borrow them for your cleaning event. Otherwise, you may need to hold a fundraiser so you can purchase the cleaning supplies you'll need. Depending on what you decide to clean, you'll need: Rubber gloves A bleach cleaner Clothes Trash bags Feather dusters Toilet brushes Gardening supplies"
    },
    {
      "title": "Spread the word about the event.",
      "content": "Spread the word about the event. If you get permission to host your cleaning day, ask if you can put up flyers publicizing the event. You may also be able to advertise the event during an assembly or morning announcements. Don’t underestimate the power of word of mouth. Ask your friends to help you find other students who are interested in signing up. Try saying something like, \"Hey, a few of us are getting together on Saturday to clean up around the school. We might even meet up for pizza afterwards. You should come by and help!\""
    },
    {
      "title": "Organize students into groups on the day of the event.",
      "content": "Organize students into groups on the day of the event. Have each group be responsible for accomplishing a certain task. This will help ensure that you don’t have anyone wandering around aimlessly or cleaning something that someone else has already done. [3] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source For instance, you might want to have one group cleaning marker off of bathroom walls, while another group could pull weeds and rake around the outside of the school."
    },
    {
      "title": "Focus on cleaning areas that are often ignored.",
      "content": "Focus on cleaning areas that are often ignored. There’s no need to spend your cleaning event doing chores that the janitor already does on a regular basis. Make the most of the day by working on things that don't get done often, like cleaning the chairs in the auditorium or dusting the tops of lockers. If you like, you could ask for permission to plant some flowers around campus, like in a flower bed near the school’s entrance."
    },
    {
      "title": "Practice safe cleaning practices.",
      "content": "Practice safe cleaning practices. As you clean, make sure you carefully read and follow all of the labels on any cleanings supplies. Wear rubber gloves while you’re cleaning with chemical like bleach. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source To avoid getting sick, avoid touching used tissues when you empty waste baskets. Wear disposable gloves or wash your hands with soap and water after you’re finished."
    },
    {
      "title": "Start a club to make this a regular event.",
      "content": "Start a club to make this a regular event. If the event is a success, consider getting permission to start a club that cleans the school on a regular basis. You might want to meet once a week, every day at lunch, or only once a semester, depending on how much needs to be done and how often your principal will approve it."
    }
  ]
}