{
  "url": "https://www.wikihow.com/Make-a-Mathematical-Model",
  "title": "How to Make a Mathematical Model",
  "steps": [
    {
      "title": "Determine what you want to know.",
      "content": "Determine what you want to know. What is the objective of creating a model? Make a list of the data you want to find by using the model. It is crucial to ask this question before you create your model or you may end up creating a model that does not meet your objective. [2] X Research source Do you want to predict something? Find out how to regulate something? Or do something else? [3] X Research source For example, imagine you want to know how much room you have in a storage unit to see how many boxes you can put into it. You will be creating a model to predict the amount of space that is in your storage unit."
    },
    {
      "title": "Determine what you already know.",
      "content": "Determine what you already know. What data do you already have? Make a list of the data that has been given. As you list the data, decide what pieces are most relevant and which pieces are not relevant. [4] X Research source You should also list any information that can be assumed based on what you already know. Keep in mind that you may have to take measurements to find the data that you need. To find out how much room you have in your storage unit, you will need to measure the unit's height, width, and length."
    },
    {
      "title": "Determine the physical principles that govern the model you want to create.",
      "content": "Determine the physical principles that govern the model you want to create. Do you need to consider factors like gravity, volume, time, etc.? Make a note of any factors that will need to be considered when you create the model. [5] X Research source To determine the amount of space that you have in your storage unit, you will need to find the volume. You also need to keep in mind that there will be some wasted space, since some objects may be irregular and that will make it difficult to use every inch of the storage unit. [6] X Research source"
    },
    {
      "title": "Identify the equations that you will need to use to find your answer.",
      "content": "Identify the equations that you will need to use to find your answer. What equations and formulas will you need in order to find your answer? How will you apply these equations and formulas? Make sure that you have a clear understanding of how to plug the data that you have into the equation. To find the volume of the storage unit, you will need to use the equation V= h x w x l [7] X Research source"
    },
    {
      "title": "Look at what others have done.",
      "content": "Look at what others have done. There is no need to re-invent the wheel if somebody else has developed a model that may suit your purposes already. Check in your textbook or ask your teacher. Just remember to make sure that someone else’s model will work for your situation. [8] X Research source To get an idea of how to find the volume using the equation you have identified, check your textbook or ask your teacher."
    },
    {
      "title": "Create a diagram for your model.",
      "content": "Create a diagram for your model. A simple mathematical model may not require a diagram. However, if you are creating a complex model, a diagram may help you determine if your model will work. Draw a diagram to represent the actual model you plan to make. Make sure to incorporate your data into your diagram to help guide you when you create the actual model."
    },
    {
      "title": "Create your model.",
      "content": "Create your model. Once you have finished the planning phase, you should be able to create your model. Use your diagram, data, and other information to make your mathematical model. Make sure to check your notes often to ensure accuracy. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Make sure that your model represents the actual relationship among your data that you are trying to accomplish. For more advanced models, you may need to use a computer program."
    },
    {
      "title": "Test your model.",
      "content": "Test your model. It is important to verify the validity of your model’s results before you try to do anything else with your model. Apply your data and see if the model is valid. Are your results what you expected? Do they make sense? Are the results repeatable? [10] X Research source Solve the equation V = h x w x l to determine if your results make sense. Repeat the solution to determine if your results are repeatable."
    },
    {
      "title": "Determine how the model could be improved.",
      "content": "Determine how the model could be improved. In order to make your model useful for further applications, you need to consider how it could be improved. Are there any variables that you should have considered? Are there any restrictions that could be lifted? Try to find the best way to improve upon your model before you use it again. [11] X Research source For example, if you want to have 3 feet (0.91 m) of space to walk through your storage unit, you could adjust your equation to account for that space. Just deduct the space you will lose from the appropriate number in your equation. In this case, you could adjust your equation to read V = h x (w-3) x l [12] X Research source After you have identified ways to improve your model, make the changes and test it again."
    }
  ]
}