{
  "url": "https://www.wikihow.com/Lead-Into-a-Quote",
  "title": "How to Lead Into a Quote",
  "steps": [
    {
      "title": "Use the source in the introductory phrase.",
      "content": "Use the source in the introductory phrase. This is a useful option if you are quoting an academic source or a critic. In the introductory phrase, use the last name of the person who wrote the quote you are sourcing. Follow the introductory phrase by a comma and then the quote. [1] X Research source For example, if you are using a quote from a text by John Smith, you may write: According to Smith, “Life is beautiful.” In Smith's view, “Life is beautiful.” In Smith's words, “Life is beautiful.”"
    },
    {
      "title": "Introduce the quote with a descriptive verb.",
      "content": "Introduce the quote with a descriptive verb. Descriptive verbs are a good way to introduce a quote in the text in a brief and concise way. Use descriptive verbs like “states,” “remarks,” “notes,” “comments,” or “maintains.” Always use the last name of the author, followed by the descriptive verb. Then, use a comma and include the quote. [2] X Research source Do not use “says” as a descriptive verb to introduce a quote, unless you are quoting from an interview. For example, if you are using a quote from a text by Hannah Arendt, you may write: Arendt remarks, “Even in the darkest of times, we have the right to expect some illumination.” Arendt states, “Even in the darkest of times, we have the right to expect some illumination.”"
    },
    {
      "title": "Do not use a comma if the lead-in ends with “that” or “as.”",
      "content": "Do not use a comma if the lead-in ends with “that” or “as.” If you use “that” or “as” in your introductory phrase, you do not need to use a comma afterwards. Instead, simply put the quote after the phrase. [3] X Research source For example, you may write: Arendt points out that “totalitarianism is to be feared.” Arendt emphasizes that “totalitarianism is to be feared.” Arendt describes her book as “an exploration of power.”"
    },
    {
      "title": "Write a short assertion about the quote.",
      "content": "Write a short assertion about the quote. To create the assertion, try putting the quote in your own words. Relate it back to your thesis statement or to an overarching theme or idea in the paper. Write a short assertion that is no longer than one line or eight to ten words long. This will frame the quote for the reader. [4] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source For example, you may write an assertion like, “Arendt does not see totalitarianism as a positive result of war.” Or you may write an assertion like, “Hamlet argues against Rosencrantz's claim that he lacks ambition.”"
    },
    {
      "title": "Place the quote after the assertion with a colon.",
      "content": "Place the quote after the assertion with a colon. Once you have written the assertion, place it in front of the quote and then use a colon. After the colon, write down the quote. [5] X Research source For example, you may write: Arendt does not see totalitarianism as a positive result of war: “Totalitarianism is to be feared and loathed.” Hamlet argues against Rosencrantz's claim that he lacks ambition: \"I could be bounded in a nutshell and count myself a king of infinite space.”"
    },
    {
      "title": "Integrate the quote into your assertion.",
      "content": "Integrate the quote into your assertion. This is a good option if you want to only quote a key part of the text, or several parts of different lines in the same passage. Integrating the quote will allow you to use it as evidence for your own thoughts. [6] X Research source For example, you may write: For Arendt, state sanctioned propaganda was essential totalitarian regimes, where “one could make people believe the most fantastic statements,” thereby confirming the state's power over its citizens. Hamlet is doubtful of Rosencrantz's view, claiming he could be “bounded in a nutshell” and still feel powerful, “a king of infinite space.”"
    },
    {
      "title": "Review the flow and organization of the lead-in.",
      "content": "Review the flow and organization of the lead-in. Once you have introduced the quote in your paper properly, read it out loud to confirm it flows with the rest of the content. Check that the sentence fits within the rest of the paragraph. Make sure you include your own thoughts and ideas about the quote in the paragraph so it feels essential to what you are talking about. You can also look at your use of quotes throughout the paper to confirm they flow well. Make sure you are consistent with how you introduce quotes in the paper. Use one to two different ways to introduce quotes and stick to them so the reader can follow your train of thought."
    },
    {
      "title": "Check for the proper punctuation.",
      "content": "Check for the proper punctuation. Read over each lead-in to make sure you are using punctuation properly. Check that commas are placed in the lead-in. Make sure you do not use commas if the lead-in ends with “that” or “as.” [7] X Research source You should also check that you italicize any titles in the lead-in. Capitalize any author names or titles in the lead-in, as well."
    },
    {
      "title": "Make sure you cite quotes properly.",
      "content": "Make sure you cite quotes properly . Whenever you use quotes in a paper or essay, you need to cite them properly so you are not liable for plagiarism. Always follow the citation style assigned by your instructor. They may prefer APA style, MLA style, or Chicago Style citations. [8] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Place the citation at the end of the quote, if you are using in quote citations. For example, you may write: Arendt does not see totalitarianism as a positive result of war: “Totalitarianism is to be feared and loathed” ( On Totalitarianism , 54). Hamlet is doubtful of Rosencrantz's view, claiming he could be “bounded in a nutshell” and still feel powerful, “a king of infinite space” ( Hamlet , 2.2)."
    }
  ]
}