{
  "url": "https://www.wikihow.com/Grow-Cherry-Tomatoes",
  "title": "How to Grow Cherry Tomatoes",
  "steps": [
    {
      "title": "Obtain seedlings or seeds.",
      "content": "Obtain seedlings or seeds. It is possible to grow cherry tomatoes from seedlings or seeds. Growing from seedling will produce cherry tomatoes faster than growing from seeds. You can purchase seedlings or tomato plants from a farmer’s market or nursery. Seeds can be purchased from a nursery or seed catalogue, and there are several types of seeds to choose from. A few varieties of cherry tomatoes are: The Sungold plant. This type of cherry tomato grows large and is typically the first to produce fruit. It is a delicious choice. The Sun Sugar variety. The Sun Sugar variety is very much like the Sungold plant, but the skin does not crack as easily. The Chadwick and Fox are heirloom varieties that grow very fast and have a tangy flavor. The Sweet Treats variety has a deep red color, sweet taste, and it is resistant to many diseases."
    },
    {
      "title": "Purchase a tomato cage or wooden stakes.",
      "content": "Purchase a tomato cage or wooden stakes. The cherry tomato plant grows rapidly, so you will need to have something to support the vines once they begin to grow long. You can use either a tomato cage or wooden stakes. For a tomato cage, you should purchase a large tomato cage from a nursery or home improvement store. You should buy the largest metal cage you can find. Wooden stakes can also be found at nurseries or home improvement stores. [1] X Research source You will need to tie the vine around the stake as it grows. Cages do not require as much tying. [2] X Research source Do not use a plastic or vinyl cage. It is toxic to plants and can expose them to lead. Keeping the plants off of the ground promotes air circulation for cleaner and healthier fruit. [3] X Research source You can also use cages and stakes together. The stakes should be placed in the center of the cages. It is important to find a large metal cage because the vines grow quickly and may outgrow a smaller cage quickly."
    },
    {
      "title": "Grow from pots or in a garden.",
      "content": "Grow from pots or in a garden. You can grow cherry tomatoes in a garden or from containers. No method is better than the other and a lot depends on your location. If you choose to grow it in a pot or bucket, a pot or bucket that holds four to six gallons is ideal. [4] X Research source A foam, plastic, or fiber glass pot works well, but anything from a terra-cotta planter to a garbage can will do."
    },
    {
      "title": "Choose a sunny location.",
      "content": "Choose a sunny location. Cherry tomatoes require a lot of sun. Choose a location that will receive at least eight hours of direct sunlight every day. The plant should not be shaded by other plants. A plant that does not receive enough sun will wither and not produce good fruit. [5] X Research source"
    },
    {
      "title": "Buy mix or plant in fertile soil.",
      "content": "Buy mix or plant in fertile soil. If using containers to plant, you should not use dirt from the garden. Dirt from outside risks transferring pests or diseases to the plant. Instead, buy an organic potting mix. You should buy one 20-quart box to start out with. Fertile soil is usually darker and will crumble when held. A soil that is not fertile will clump. [6] X Research source Organic Mechanics is a well known and liked brand. [7] X Research source"
    },
    {
      "title": "Test the soil.",
      "content": "Test the soil. If you’re using a garden, do a soil test of the area where you want to plant your tomatoes. This will help you see if you’ll need to change the soil’s pH, nutrient level, and tilth. It’s best to make these changes at least two weeks before planting. [8] X Research source [9] X Research source Dig a 6- to 10- inch hole in the spot you’ll use for planting. To test tilth, separate a clod about the size of a soup can and break it apart with your fingers. The soil should be made of different sized crumbs. It shouldn’t be powdery or clumpy. Check for living organisms. Healthy soil will have living things like insects, worms, centipedes, spiders, and others. Watch for about 4 minutes and count – less than 10 organisms and your soil may not be ideal. You might also need a testing kit to check pH. You should be able to find one at your local home and garden store. Scoop some soil into a plastic or glass container and then follow the instructions."
    },
    {
      "title": "Begin planting in warm weather.",
      "content": "Begin planting in warm weather. Cherry tomatoes need warm weather to grow and they will die when exposed to frost. The last frost date should pass a week before you begin planting. The weather should be around 70 in Fahrenheit and around 21 in Celsius when planting seedlings. [10] X Research source If planting from seeds, you can start them indoors 8 to 10 weeks before the last average frost date. They’ll need two or three months of warm or hot weather to grow and harvest tomatoes."
    },
    {
      "title": "Make sure the pot has drainage.",
      "content": "Make sure the pot has drainage. If planting in a pot, it needs to have holes in the bottom for drainage. If it does not, drill ¼ to ½ holes every few inches around the bottom edge and a few holes in the center as well. Planting in a garden may need a little preparation before planting, given the results of your soil test. If you plan to keep the container inside or on a balcony, you will probably want to put a saucer underneath it so that the drainage doesn’t run everywhere. You can find a saucer at a nursery, home improvement store, and some supermarkets. If using a garden, be sure you choose a consistently sunny place. It also won’t hurt to add some compost to the soil before planting."
    },
    {
      "title": "Put the cage into the planter.",
      "content": "Put the cage into the planter. This step is only if you will be using a cage in a container. If using a stake or planting outside, you will not need to put them into position until you’ve planted. Do not put the potting mix into the bucket before inserting the cage. Instead, put the pointy end of the cage into the pot and then fill in the potting mix."
    },
    {
      "title": "Fill in the potting mix.",
      "content": "Fill in the potting mix. Pour the potting mix into the container. Water the mix until it is evenly moist. Then, fill in more mix until it comes ½ inch below the rim of the container. The surface of the soil should be even. You can use a cup or watering can to water the mix."
    },
    {
      "title": "Dig a small hole into the mix or soil.",
      "content": "Dig a small hole into the mix or soil. You should dig a small hole into the center of the soil if planting in a container. If planting multiple plants in a garden, you will need to dig holes two feet apart from each other. Put the plants into the small holes. Planting from seedling requires inserting it deep enough in the hole so that only four or five leaves are left showing once the hole is covered. The hole only needs to be a few inches deep."
    },
    {
      "title": "Cover the hole.",
      "content": "Cover the hole. Use the soil that you removed to fill in the hole. The seedling should only be showing about four leaves. Make sure the surface of the soil is even when you have finished covering."
    },
    {
      "title": "Place the cage in the garden.",
      "content": "Place the cage in the garden. Put the point end of the cage around the area where you planted. The seedlings should be in the middle of the cage. If using stakes, you can wait to put in the stakes until the seeds have sprouted into seedlings. Put the stakes three inches from the seedling. Use a hammer to secure the stake into the ground. [11] X Research source Waiting until the plant is larger to cage or stake may result in a damaged plant."
    },
    {
      "title": "Water the plant regularly.",
      "content": "Water the plant regularly. You should water the plants every two or three days. The soil should be moist at all times. If at any point it does feel dry, water the soil or mix until it is moist again. The soil should seem saturated, but not drowning in water. [12] X Research source"
    },
    {
      "title": "Fertilize once a week.",
      "content": "Fertilize once a week. The fertilizer gives the plants the nutrition to grow and thrive. Essentially, it acts as food. Use an organic fertilizer once a week. To use the fertilizer, work it into the first few inches of soil with your fingers or a plastic fork. Make sure the fertilizer stays a few inches away from the stem. A few well known brands of organic fertilizer for tomatoes are Gardener’s Supply, Tomato-tone, and Burpee Organic Tomato Fertilizer. Directions vary according to the product. Follow the directions on the label when applying fertilizer. Organic fertilizers release nutrients slower than chemical fertilizers. Using a chemical fertilizer risks burning the roots, though they are often cheaper. [13] X Research source"
    },
    {
      "title": "Prune when needed.",
      "content": "Prune when needed. Once the plant has grown larger, you will need to prune every so often. Prune when sprouts and branches start to grow off of the central stem, and when leaves look dry or dead. Use small pruners or scissors. [14] X Research source You should also push back any branches that poke out of the holes of the tomato cage. The plant will drop if you do not."
    },
    {
      "title": "Avoid pests and diseases.",
      "content": "Avoid pests and diseases. Cherry tomato plants do get pests, but fungus is often a larger problem. Symptoms of a fungus problems include yellowing leaves, moldy blotches, and dark spots. Stems may be affected as well. Pick the leaves off and spray your plant with fungicide immediately if you notice any of these symptoms. Potato beetles and stink bugs are common pests. Pick them off or use a natural insect spray to repel them. [15] X Research source Plant Doctor, Daconil, and Garden Safe are a few brands of fungicide. EcoSmart and Safer are a couple of brands of organic pesticide. Fungus that spreads throughout the entire plant can most likely not be saved. To avoid infections, try watering your plants in the morning directly into the soil. Watering leaves, especially later in the day, encourages fungal growth. Fungus can survive in soil for years. Remove the cherry tomato plants from the soil if fungus is a recurring problem. Plant a different type of plant or flower in that area."
    },
    {
      "title": "Harvest after about six to eight weeks.",
      "content": "Harvest after about six to eight weeks. A seedling will begin to flower in about a month. If you used seeds, you should add about two weeks to that amount of time. Flowers will turn into small, green fruits. Ripe and ready to pick cherry tomatoes will be ready a few weeks after that. The tomatoes should come off of the stems easily. Do not pull or twist the vine to pick a tomato. Pick individual fruits off of the vine every day. The plant should continue to produce tomatoes until the first frost. Freshly picked tomatoes should be stored at room temperature; they will rot if refrigerated. They can also be canned or dried. [16] X Research source"
    }
  ]
}