{
  "url": "https://www.wikihow.com/Make-a-Mosquito-Net",
  "title": "How to Make a Mosquito Net",
  "steps": [
    {
      "title": "Measure the length and width of your bed.",
      "content": "Measure the length and width of your bed. Grab a measuring tape and measure the length and width of your bed and frame. Jot down the length and width. The net you buy must hang at least 1 in (2.5 cm) past the edges of the frame for maximum protection, so add 1 in (2.5 cm) to each measurement to find the size of the netting you need. If parts of the net hang directly against the frame, bugs may bite you through the net if you roll against it in your sleep. The ring-style canopy nets you may have seen are not as effective as the rectangular nets that cover each side evenly. These ring canopies tend to hang unevenly and are fairly distracting when you’re trying to sleep."
    },
    {
      "title": "Buy a mosquito netting that extends a little past the sides of your bed.",
      "content": "Buy a mosquito netting that extends a little past the sides of your bed. Go online and find a mosquito net that’s at least 1 in (2.5 cm) bigger than your bed on each side. Make sure that the mosquito net has sleeves for mounting it on a frame. Most nets have sleeves, but just double-check to make sure you aren’t buying uncut fabric. [1] X Research source The height doesn’t matter unless you have a vaulted ceiling or a loft-style home. The netting always comes with plenty of height to work with. You cannot effectively sew a mosquito net on your own. The holes need to be incredibly small and the fabric has to be extremely breathable. Plus, premade mosquito netting is relatively inexpensive. You can still use uncut fabric by hanging it over the frame you’re going to assemble, but you’ll need to reposition the fabric by hand whenever it slides to one side or another. Mosquito netting is pretty cheap. Expect to spend $5-15 on the netting itself."
    },
    {
      "title": "Pick up some thin curtain rods and joints to make the frame.",
      "content": "Pick up some thin curtain rods and joints to make the frame. Buy 2 curtain rods that match the lengths of your bed and pick up 2 curtain rods that match the width of your bed. In addition, buy 4 elbow joints that match the width of your curtain rod, preferably from the same company that made your rods, to connect them together. [2] X Research source The thickness of the rods doesn’t matter so long as they fit in the sleeve openings on the net. Generally, rods that are 1 ⁄ 2 –1 in (1.3–2.5 cm) thick are perfect for this. The netting isn’t very heavy, so you don’t need a ton of support. If you can’t find curtain rods that match the dimensions you need, buy some longer curtain rods and cut them to size with a handsaw. Measure each length or width you need and mark the cuts off with a permanent marker. Gently cut each junction at the spots you mark. [3] X Research source"
    },
    {
      "title": "Find 4 studs on the ceiling above the corners of your bed.",
      "content": "Find 4 studs on the ceiling above the corners of your bed. To find a stud, turn a stud finder on and run it over your ceiling above each corner. When it beeps, mark the spot with a small pencil mark. Alternatively, you can knock on the drywall with your knuckle. Studs will sound firm and hard, while hollow drywall will echo a little bit. [4] X Research source You do not need to measure the distance between your hooks. You’re going to hang the frame from wires or cords and the frame doesn’t need to hang directly under the hooks for this to work. So long as they’re within 1 ft (0.30 m) of the corner, you’ll be fine."
    },
    {
      "title": "Drill 4 pilot holes in the studs and twist your screw hooks in.",
      "content": "Drill 4 pilot holes in the studs and twist your screw hooks in. Get 4 screw hooks and grab a pilot drill bit that’s slightly thinner than the width of your screw hooks. Insert the pilot drill bit into a drill and bore a hole for each hook in the ceiling, just outside the corners of your bed. Place each hole in a stud to keep the frame from ripping the drywall out. Then, twist the screw hooks into the holes you drilled. [6] X Research source"
    },
    {
      "title": "Hang some fishing line or cord around each hook to hang your frame.",
      "content": "Hang some fishing line or cord around each hook to hang your frame. You can hang your frame with heavy-duty fishing line, or any type of cord. Cut off a 48–72 in (120–180 cm) length of fishing line or cord and drape a section over each hook you’ve drilled into the ceiling. [7] X Research source The exact length of the cord or line doesn’t matter. You’re going to cut the excess off later, but the more cord or fishing line you have to work with, the better."
    },
    {
      "title": "Tie a loop off at the end of the line or cord and slide the other end through.",
      "content": "Tie a loop off at the end of the line or cord and slide the other end through. At one end of each length of line or cord, create a small loop and wrap the end of the working end through it. Tie a tight, large knot at the end you slid through the loop and pull the loop tight. The knot will catch on the opening and leave you with a small loop. Let the fishing line or cords hang from your hooks. [8] X Research source Just to clarify, you are not placing the loops you just made on the hooks. You just need these hoops to hang your frame and adjust the length before tying it up."
    },
    {
      "title": "Spread the netting out on the bed to line the corners up with the hooks.",
      "content": "Spread the netting out on the bed to line the corners up with the hooks. Take your mosquito net and spread it out on top of your sheets. Adjust the corners of the top of the net to line up with the corners of your bed frame. [9] X Research source"
    },
    {
      "title": "Slide a long rod through the first sleeve on the side of the net.",
      "content": "Slide a long rod through the first sleeve on the side of the net. Grab one of your longer rods and feed it through the sleeve on a long side of the net. Run the rod through all the way until it sticks out a little bit past the end of the net on each side. [10] X Research source The sleeve for the mosquito net may be sequence of loops and it may be located on the inside or outside of the net. If you find it hard to feed the rod through the sleeve, you can crumple the net up as you work the rod through to keep the net from catching on the end."
    },
    {
      "title": "Grab a shorter rod and slide it through the sleeve on the shorter side.",
      "content": "Grab a shorter rod and slide it through the sleeve on the shorter side. Grab one of your shorter curtain rods. Run it through the sleeve on the shorter side of the mosquito net. Feed each portion of the rod through the sleeve of the mosquito net until the ends stick out on either side. [11] X Research source"
    },
    {
      "title": "Connect the 2 rods using an elbow joint.",
      "content": "Connect the 2 rods using an elbow joint. Some elbow joints screw into the curtain rod, while others just slide into the hollow opening of the rod. Connect the first elbow joint to the end of the long rod where it meets the shorter rod. Then, connect the other end of the elbow joint to the shorter rod to connect the 2 pieces of the frame together. [12] X Research source"
    },
    {
      "title": "Repeat this process with the 2 remaining rods to finish the frame.",
      "content": "Repeat this process with the 2 remaining rods to finish the frame. Take your second longer curtain rod and feed it through the sleeve on the remaining length and connect the end to the shorter rod with a second elbow joint. Then, feed the last short rod through the remaining side. Use 2 elbow joints to connect the ends to the longer lengths on either side to finish assembling the frame. [13] X Research source"
    },
    {
      "title": "Slide the line or cord around the first joint you’re hanging.",
      "content": "Slide the line or cord around the first joint you’re hanging. Lift the first corner of the frame up a little and thread the cord or fishing line around the joint. If the sleeves are on the inside of the netting, there is a small corner where the fabric separates to hang the frame. Run the line or cord around the joint. [14] X Research source"
    },
    {
      "title": "Raise the corner until the base of the net rests gently on the ground.",
      "content": "Raise the corner until the base of the net rests gently on the ground. Slide the unknotted end of the fishing line or cord through the loop you made earlier. Then, pull the unknotted end to raise the corner up. Continue raising the frame until the bottom of the mosquito net rests gently against the ground. [15] X Research source"
    },
    {
      "title": "Tie the cord or line around the joint to secure it in place.",
      "content": "Tie the cord or line around the joint to secure it in place. Once the frame is raised to the height you prefer, wrap the unknotted string around itself and make a large knot at the base where it meets the loop you made. Clip the excess cord or fishing line off to finish hanging the first corner. [16] X Research source You can also tie the cord or fishing line to the loop you made. It doesn’t really matter how you secure the line or cord."
    },
    {
      "title": "Repeat this process with the remaining 3 joints to finish your net.",
      "content": "Repeat this process with the remaining 3 joints to finish your net. Continue wrapping the line or cord around the joints one at a time. Raise each corner up until the corner is on the same level as the previous corner. Tie the fishing line or cord off and cut the excess off. You now have a perfectly secure mosquito net over your bed! [17] X Research source Some mosquito nets have a hook-and-loop fastener strip to let you get inside the net. If your net doesn’t, just lift the base up and slide underneath it."
    }
  ]
}