{
  "url": "https://www.wikihow.com/Look-Like-an-Angel",
  "title": "How to Look Like an Angel",
  "steps": [
    {
      "title": "Mix a little highlighter into your tinted moisturiser to make your skin glow.",
      "content": "Mix a little highlighter into your tinted moisturiser to make your skin glow. Healthy, glistening skin is a trademark of an angel! To create this look, mix a drop of liquid highlighter into your tinted moisturiser and then rub it all over your face. Try to cover your entire face so that your skin has an even glow. [1] X Research source If you have a “glow” or “shimmer” moisturiser, use this to create a similar effect."
    },
    {
      "title": "Wear shimmery nude eyeshadow for a natural, radiant look.",
      "content": "Wear shimmery nude eyeshadow for a natural, radiant look. Adding a little extra glitter to your face is a great way to make you look angelic. Choose a nude eyeshadow to keep your makeup looking nice and natural. Close your eyes and rub the eyeshadow over your eyelids with an eyeshadow brush or with your little finger. [2] X Research source If you don't have any shimmery nude eye shadow, dust a little highlighter powder over your eyelids instead."
    },
    {
      "title": "Wear mascara to make your eyes stand out.",
      "content": "Wear mascara to make your eyes stand out. Apply 1 coat of mascara to your lower and upper lashes to lengthen them and increase their volume. If you want extra volume, apply a second coat. If you have very light coloured natural lashes, consider wearing brown mascara for a natural look; otherwise, opt for black mascara to make your lashes stand out. [3] X Research source If you’re going to be getting wet, use a waterproof mascara to stop it from running. If you want a natural look, consider clear mascara."
    },
    {
      "title": "Wear a natural lip colour to make your lips look full.",
      "content": "Wear a natural lip colour to make your lips look full. Choose a lipstick or lip stain that is as close to your natural colour as possible, as this makes you look healthy and radiant. Apply the colour to the lines of your natural lips for a beautiful, natural look. [4] X Research source If you prefer not to wear lipstick, wear a light coating of lip gloss or lip balm to accentuate your natural lip colour."
    },
    {
      "title": "Leave your hair down in waves to create a flowing, graceful look.",
      "content": "Leave your hair down in waves to create a flowing, graceful look. No matter how long your hair is, you can pull off an angelic look. Untie your locks, let them hang loose, and flick them gracefully when you turn your head. If your hair is straight, use a curling wand or iron to create beautiful waves . If your hair is getting in your eyes, simply pull it behind your ears to keep it out of the way. Lightly mist your hair with hairspray to keep your flyaways under control if you have frizzy hair. If you have short hair, consider wearing a sparkly headband or headscarf to mimic a halo. If you want to wear your hair up, try a halo or French braid instead."
    },
    {
      "title": "Wear all white to create an angelic look.",
      "content": "Wear all white to create an angelic look. Wearing white is an incredibly easy but effective way to resemble an angel. Wear a long white dress, a white jumpsuit, or white pants with a white shirt. To create a traditional angel look, wear loose clothing – alternatively, wear tighter clothes for a modern look. [5] X Research source If you want to stand out, wear a coloured belt or singlet to break up your white clothes."
    },
    {
      "title": "Accessorise with gold or silver jewellery to add elegance to your outfit.",
      "content": "Accessorise with gold or silver jewellery to add elegance to your outfit. Jewellery is the perfect addition to your angel outfit. Consider wearing silver or gold rings, bracelets, necklaces, earrings, or hairpieces to make your outfit sparkle. For an extra sparkly look, wear silver jewellery that has small crystals in it. The crystals will glitter in the light and look pretty."
    },
    {
      "title": "Wear white or silver shoes to create a sleek look.",
      "content": "Wear white or silver shoes to create a sleek look. Wearing white or silver shoes is a great way to make your outfit look cohesive. Wear shoes that you already have or go thrift shopping to find a new pair. Sandals, sneakers, heels, and boots are all good options. If you’re going to be doing a lot of walking, make sure to wear comfy shoes, as it’s hard to feel like an angel if you have sore feet!"
    },
    {
      "title": "Carry a white bag to store your personal items.",
      "content": "Carry a white bag to store your personal items. Bags are great accessories and are also handy for storing your phone, keys, wallet, and other personal items. Consider wearing a white backpack, carrying a handbag, or carrying a clutch to complete your outfit. Be careful where you put your white bag, as white has a habit of attracting dirt!"
    },
    {
      "title": "Wear angel wings and a halo if you are going to a dress-up party.",
      "content": "Wear angel wings and a halo if you are going to a dress-up party. Head to a dress up shop to find the perfect pair of angel wings and a halo. These will make any outfit look truly angelic! Wear white wings and a silver or gold halo for a traditional look, or opt for coloured ones if you want a bright and edgy look. [6] X Research source If you feel creative, try making your own angel wings ."
    }
  ]
}