{
  "url": "https://www.wikihow.com/Make-Playing-Cards",
  "title": "How to Make Playing Cards",
  "steps": [
    {
      "title": "Create your playing cards from scratch in a computer program.",
      "content": "Create your playing cards from scratch in a computer program. Use a program such as Adobe Photoshop or Illustrator to create your designs. Create regular playing cards by using shapes for the suits that are pre-drawn in the program, or draw your own designs for any other type of playing cards. [1] X Research source Using Adobe Photoshop or Illustrator is the easiest way to design and format your cards for printing all in one place. GIMP is a good free alternative to Adobe programs that has a lot of the same capabilities."
    },
    {
      "title": "Upload photos for your cards as an alternative to making your own designs.",
      "content": "Upload photos for your cards as an alternative to making your own designs. Upload any images you want to use to a design program. Consider using photography of your own, or download images off the web to customize your cards. [2] X Research source For example, you could use pictures of your friends and family for the face cards in different suits of a standard playing card deck to create a fun custom deck."
    },
    {
      "title": "Design the backs of the cards if you don't want to leave them blank.",
      "content": "Design the backs of the cards if you don't want to leave them blank. Scan the backs of an existing deck of cards you own if you want to use a generic pattern. Upload photos to a photo editing program to format them for the backs, or draw your own back designs in a design program to use. [3] X Research source You can search online for a variety of actual card back designs, or any other images you want to use, and load these into whatever editing program you are using to create the backs of the cards."
    },
    {
      "title": "Print photos and glue them to the backs of cards you own for an easy custom deck.",
      "content": "Print photos and glue them to the backs of cards you own for an easy custom deck. Print out some photographs on photo paper at the same size as a deck of playing cards you want to customize. Use scrapbook adhesive to glue the photos to the back of the playing cards. Trim around the corners with scissors to round them. [4] X Research source This is a good idea for a custom gift that you can give to friends or family. You should only use a max of 5 photos for a regular deck of playing cards. This way, people can't memorize which card has which photo while you are playing!"
    },
    {
      "title": "Get a sturdy cardstock, like 110# index cardstock, to print on.",
      "content": "Get a sturdy cardstock, like 110# index cardstock, to print on. This works best for printing black and white cards. Color printing will wear off faster after frequent use and shuffling. [5] X Research source You can get cardstock at an office supply or print shop. You can use this technique to create any kind of custom playing cards you want, from normal poker-style cards, to homemade card games."
    },
    {
      "title": "Format the cards on the computer to fit the size of the cardstock.",
      "content": "Format the cards on the computer to fit the size of the cardstock. Make the cards as big or small as you want. Use a computer program to create an image file the same dimensions as the cardstock and fit as many of the cards as you can on the sheet. [6] X Research source As a rule of thumb, you should be able to fit 9 cards on a piece of cardstock, but you can make the cards smaller or bigger if you like. Adobe Illustrator or Photoshop are examples of programs you can use to format the cards, or use GIMP as a free alternative. You could even use a business card template to format the playing cards in one of these programs."
    },
    {
      "title": "Print your cards on the cardstock with a laser printer.",
      "content": "Print your cards on the cardstock with a laser printer. Print the card design you want at home from your computer to a laser printer if you have one. Take your design file on a USB drive to a print shop if you don't have a laser printer at home. [7] X Research source Many print shops also offer graphic design services, and should be able to format the cards to print for you if you don't have the software or know how to do it at home."
    },
    {
      "title": "Print a design on the backs of the cards if you want to.",
      "content": "Print a design on the backs of the cards if you want to. Place the printed cardstock back in the printer with the blank back sides facing up. Repeat the printing process with your back design files. [8] X Research source Make sure to orient the cardstock so that the back design prints the way you want it to. You can run a regular piece of printing paper through the printer first to test how it prints."
    },
    {
      "title": "Use a ruler and pencil to draw lines between the cards to cut along.",
      "content": "Use a ruler and pencil to draw lines between the cards to cut along. Place the ruler horizontally between each row of cards and draw a line along it with a pencil. Do the same vertically between each column of cards. [9] X Research source Alternatively, you can put some light-colored lines in between the cards in the design file on your computer before you print them."
    },
    {
      "title": "Cut along the lines with a paper cutter to separate the cards.",
      "content": "Cut along the lines with a paper cutter to separate the cards. It's easiest to separate the cardstock into 4 quadrants by making 1 vertical cut and 1 horizontal cut first. Cut apart the individual cards in each quadrant first, and then trim off any excess cardstock from each card. [10] X Research source Make sure the height of the cards is as equal as possible, as this will help them shuffle better . The width is not as important. Use the guide on the paper cutter to help you make uniform cuts. If you don't have a paper cutter, you can use a ruler and a utility knife to cut along the lines. You can also use an exacto knife to cut paper."
    },
    {
      "title": "Round the corners with a corner rounding tool for a more professional look.",
      "content": "Round the corners with a corner rounding tool for a more professional look. Insert the corner of a card into the tool and press the button down to clip it. Repeat this for every corner. This will also help the cards shuffle better. [11] X Research source You can get a corner rounding tool from a scrapbooking store."
    }
  ]
}