{
  "url": "https://www.wikihow.com/Lose-Weight-As-a-Teenager",
  "title": "How to Lose Weight As a Teenager",
  "steps": [
    {
      "title": "Use a BMI scale to determine a healthy target weight for your height.",
      "content": "Use a BMI scale to determine a healthy target weight for your height. Look online for a Body Mass Index (BMI) chart. Find your current height and age in the list or enter them into a form. You’ll see 3 weight ranges labeled “normal” or “healthy,” “overweight,” and “obese.” If your current weight falls within either of the latter 2 categories, look towards the higher end of the “normal” weight category to determine what weight you’d like to reach. [1] X Research source If you’re already within the “normal” weight category, weight loss may not be healthy for you. Speak with a doctor before making any changes to your diet or lifestyle. [2] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020. Keep in mind that your natural body type will determine how your weight is distributed. Don’t expect to look like another person with the same height and weight; each body is different."
    },
    {
      "title": "Set small, manageable goals at the start of your weight loss program.",
      "content": "Set small, manageable goals at the start of your weight loss program. Instead of starting off with a highly ambitious or near-impossible weight loss goal like dropping 100 lb (45 kg) by the end of the season, begin with a small goal that you can realistically achieve. In general, most teens can aim to lose 1 to 2 lb (0.45 to 0.91 kg) per week, which will quickly add up over the weeks and months. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When you see smaller amounts of weight drop off, you’ll start to feel more motivated to set and achieve new goals as time goes on. Don't be disheartened if you don't lose any weight in the first week. Stay positive and stick to your plan and you’ll gradually start to see results."
    },
    {
      "title": "Keep a food and fitness diary to track your progress.",
      "content": "Keep a food and fitness diary to track your progress. By writing down each item you consume on a daily basis, you’ll instantly become more aware of how quickly the calories can add up. Write a log of everything you eat, every exercise you do, and any weights or body measurements you take. Add up your total calorie intake at the end of each day and note how many calories you burned through exercise. Make note of any diet or lifestyle changes and refer back to the log to observe your progress. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Try using a website or weight loss app to help record your diet and exercise. Many of these tools automatically estimate the amount of calories consumed or worked off for each line item. Analyze the contents of your food diary to see what’s working and what isn’t so you can adapt accordingly. For instance, if you notice that you always have a vending machine snack after swim practice, you can start bringing a piece of fruit along so you have something healthier to eat."
    },
    {
      "title": "Weigh yourself once per week in the morning.",
      "content": "Weigh yourself once per week in the morning. Step onto the scale on the same day each week, at the same time. To get the most consistent reading, weigh yourself in the morning before you eat breakfast and after you go to the bathroom. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Measure around your waist, hips, thighs, and upper arms, too, so you can see where you’ve lost fat. [6] X Research source Weighing yourself every single day can lead to weighing scale obsession, or an unhealthy fixation on daily results. Water retention in the body can add as much as five pounds per day, so the scale can also be somewhat misleading. Remember that weight loss is an ongoing process. Developing healthy habits and losing weight takes months and years; it won’t happen in a matter of days."
    },
    {
      "title": "Be kind to yourself along your weight loss journey.",
      "content": "Be kind to yourself along your weight loss journey. Emotions and stress can make weight loss feel like an uphill battle. But with a realistic set of small, manageable goals and a system for tracking your ongoing progress, focus on keeping a positive outlook. Celebrate each minor and major success and forgive yourself if you fall short of your goals or slip up from time to time. [7] X Research source If you spend a day vegging in front of the TV instead of hitting the gym, don't beat yourself down. If you indulge in a bunch of junk food after a stressful exam, don't worry too much. Just commit to getting back on track tomorrow! Clinical nutritionist Tara Coleman suggests starting slow when adding healthier eating habits to your life. “You wouldn’t go into a gym and lift the heaviest thing right away; you’d start with smaller weights and work your way up. The same thing goes for food: start with one small change and then build on that rather than trying to overhaul everything at once.” [8] X Expert Source Tara Coleman Clinical Nutritionist Expert Interview. 22 October 2020."
    },
    {
      "title": "Give your body the right number of calories every day.",
      "content": "Give your body the right number of calories every day. The amount of calories you’ll need to consume on a daily basis depends on your age, sex, height, and on how active your lifestyle is. Teen boys need around 2,800 calories per day while teen girls require 2,200 calories per day. [9] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Look online for charts listing caloric intake recommendations or speak with a doctor to determine a target number. Then, as you plan your meals and track your daily intake with your food diary, aim to eat no more than your target number of calories. A 14-year-old boy who’s heavily involved in sports might need up to 3,000 calories, whereas his classmate who doesn’t lead a very active lifestyle might need only 2,000. However, a 14-year-old girl with a moderately active lifestyle would need about 2,000 calories per day as well. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you do eat too many calories on Monday, don’t restrict your intake on Tuesday. This will only result in an unhealthy cycle of overeating and starving yourself."
    },
    {
      "title": "Cut sugary drinks out of your diet.",
      "content": "Cut sugary drinks out of your diet. Avoid drinking soda, sports and energy drinks, fruit juice, and sugary frozen drinks. Instead, stick with water or sugar-free beverages. Instead of drinking fruit juice from concentrate, try making your own fresh fruit juice at home with a juicer. Drink low-fat milk, too, to get some calcium into your diet. [11] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020."
    },
    {
      "title": "Follow your thirst cues each day to stay hydrated.",
      "content": "Follow your thirst cues each day to stay hydrated. Keep a water bottle with you all day long and refill it frequently so you consume plenty of water throughout the day. Make sure to listen to your body’s cues and drink more water if you need it. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you don’t like the taste of regular water, registered dietician and trained chef Jennifer Lease suggests “adding other flavors to your water, like fresh fruit, fresh herbs, and fresh citrus juice.” [13] X Expert Source Jennifer Lease, RD, CDN Registered Dietitian & Trained Chef Expert Interview. 15 September 2021. Nutritionist Adrienne Youdim notes that specific water intake recommendations “are arbitrary. I recommend responding to your thirst cues—you should be going to the bathroom or urinating every couple of hours.” [14] X Expert Source Adrienne Youdim, MD Board Certified Internist Expert Interview. 11 September 2020. Drinking enough water throughout the day will help you feel more full."
    },
    {
      "title": "Reduce your portion sizes at each meal.",
      "content": "Reduce your portion sizes at each meal. Ask for smaller portions at meal times or dish yourself about 30 to 50% less than you’d normally take. Limit the amount of food on your plate so you’re not tempted to clear your plate. [15] X Research source Try eating on a smaller plate, too. [16] X Research source Remember that you can always go back for more if you’re still hungry or if you haven’t eaten enough calories. Instead of taking a whole chicken breast at dinner, cut it in half and save the rest for tomorrow’s meal. Tell the lunch lady that you only want 1 scoop of casserole instead of the usual 2. Nutritionist Amy Chow suggests “practicing mindful eating when you eat your meals and snacks. Slow down, enjoy your food, and make sure that you’re only eating when you’re hungry (not because you’re bored).” [17] X Expert Source Amy Chow Registered Dietitian Expert Interview. 6 October 2022. Chewing slowly will make your meal last longer and will help you lose weight. Also, by chewing thoroughly, your body will more easily digest the food you’re eating. [18] X Research source"
    },
    {
      "title": "Fill your diet with whole foods, fresh fruits and veggies, and lean protein.",
      "content": "Fill your diet with whole foods, fresh fruits and veggies, and lean protein. Steer clear of processed snacks, sweet baked goods, and greasy junk foods. Aim to eat 5 servings of fruit and vegetables each day, and try to have them make up half of each meal. Opt for whole-grain bread, rice, and pasta as well as lean proteins like poultry and fish. End your meals with naturally sweet fruits instead of sugary desserts. [19] X Research source [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Pick baked, grilled, or steamed proteins over fried or breaded foods. Look for “light” or “low-calorie” options on restaurant menus when you go out to eat. This will ensure that you still have a great time and a delicious meal while sticking to your weight loss plan. It’s okay to enjoy sweet treats in moderation. You don’t need to cut your favorite pizza joint out of your life or refuse your friend’s birthday cake. Have a slice every once in a while, but stick to just the 1 slice. Skip the soda and swap potato chips for carrots to make your overall meal healthier. [21] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020."
    },
    {
      "title": "Avoid eating when you’re full or feeling down.",
      "content": "Avoid eating when you’re full or feeling down. During a meal, pay attention to how your stomach feels. As soon as you start to feel full, put down your utensils and clear your plate so you aren’t tempted to keep eating. If you’re bored, upset, or tired, don’t pick up a snack just to pass the time. [22] X Research source Avoid indulging in midnight snacks; drink water or herbal tea to quench your cravings instead. If your friends tend to snack on junk foods, offer to bring a healthier snack like hummus for everyone to share."
    },
    {
      "title": "Eat 3 meals a day plus 1 or 2 healthy snacks.",
      "content": "Eat 3 meals a day plus 1 or 2 healthy snacks . Refrain from skipping meals or starving yourself. Even if you have a busy lifestyle, focus on eating 3 complete but well-portioned meals throughout the day. [23] X Research source If necessary, wake up 15 minutes earlier so you can have a nourishing breakfast of eggs, Greek yogurt, or fortified cereal and fresh fruit. In between meals, consume 1 or 2 high-fiber or high-protein snacks to help you stay full. [24] X Research source Try munching on an apple, a packet of unsalted nuts, or a granola bar in between meals."
    },
    {
      "title": "Complete 1 hour of moderate physical activity each day.",
      "content": "Complete 1 hour of moderate physical activity each day. Before or after school, carve out some time for exercise. [25] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source It doesn't matter if you lift weights, walk around your neighborhood, swim, or jog on a treadmill; you have a good chance of losing weight if you burn more calories than you consume. [26] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Small spurts of exercise quickly add up. Try signing up for a 30-minute gym class at school, doing 10 minutes of basic stretches and aerobic exercises as soon as you get home, and going for a 20-minute run with your family dog in the evening. Rather than playing soccer video games with your friends after school, suggest that you all go out to the park and kick around a soccer ball."
    },
    {
      "title": "Join a sports team, gym, or fitness club to develop a fitness routine.",
      "content": "Join a sports team, gym, or fitness club to develop a fitness routine. Sports teams, group fitness classes, and clubs can make exercise more fun and will hold you accountable. Find an activity you enjoy and sign up for a group through your school or local community. [27] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Consider a competitive sporting team, an intramural sports team, or a group that just plays for fun. Don’t be discouraged if the first few sessions of your fitness class are really tough. You’ll build strength and stamina as the weeks go by."
    },
    {
      "title": "Walk, stand, and take the stairs when you can.",
      "content": "Walk, stand, and take the stairs when you can. Use a phone app or fitness tracker to calculate your daily step count. Start with a relatively low step goal, and each week increase it so you walk a little further. At home, work, and school, take the stairs rather than the elevator or escalator. When you’re watching TV or studying for an exam, do this standing up. Or turn on your favorite song and dance around your room for a few minutes. [28] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Walk at a brisk pace but slow down if you start getting out of breath. Instead of slouching, stand or sit up straight to engage your core muscles. Standing will burn more calories than sitting. [29] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Rather than taking the bus or catching a ride to school, try bicycling to and from school if you live nearby."
    }
  ]
}