{
  "url": "https://www.wikihow.com/Have-Great-Hair",
  "title": "How to Have Great Hair",
  "steps": [
    {
      "title": "Keep your hands out of your hair throughout the day.",
      "content": "Keep your hands out of your hair throughout the day. When you touch your hair, it transfers oils from your hands to your hair, which might make your luscious locks look greasy. Additionally, touching your hair increases frizz. Try not to touch your hair at all throughout the day. If your hair is out of place, it’s okay to go ahead and fix it. However, don’t keep fidgeting with your hair. If you have a problem with touching your hair, you might try putting it in a hair clip or braid for a while to help you get out of the habit of touching it."
    },
    {
      "title": "Sleep on a silk pillowcase to manage frizz.",
      "content": "Sleep on a silk pillowcase to manage frizz. When you’re asleep, the friction between your hair and pillowcase may damage your hair and could make it look frizzy. You might be able to prevent this by switching to a silk pillowcase, which reduces friction. Try a silk pillowcase to see if it improves the look of your hair. [1] X Research source As another option, cover your head in a silk wrap before you go to bed."
    },
    {
      "title": "Protect your hair from sun damage.",
      "content": "Protect your hair from sun damage. You probably know that the sun's rays can be harmful to your skin, but you might not know sun damage also happens to your hair. Luckily, using a leave-in conditioner after you wash your hair may help protect your hair. Additionally, when you’re spending time outdoors, cover your hair in a hat or use a heat protectant that contains an SPF. [2] X Research source For instance, you might spray on an SPF heat protectant before going to the beach. For added protection, wear a hat, as well."
    },
    {
      "title": "Eat a nutritious diet for shinier, thicker hair.",
      "content": "Eat a nutritious diet for shinier, thicker hair. Vitamins and nutrients in your diet help fortify your hair and may help it grow longer. [3] X Research source Eat lots of vegetables and fruits to help you meet your nutritional needs. [4] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. Additionally, eat lean protein and healthy fats to make sure you’re getting the nourishment your body needs to be healthy. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you want to change your diet, talk to your doctor to make sure the changes are right for you. You don’t need to eat a special diet for good hair health. Just focus on making healthy choices."
    },
    {
      "title": "Take vitamins to support healthy hair if your doctor says it’s okay.",
      "content": "Take vitamins to support healthy hair if your doctor says it’s okay. If you want a nutritional boost for healthy hair, a supplement might be a great option for you. Look for a supplement that’s formulated for healthy hair. [6] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. Then, take your supplement as directed on the label, which will likely be 1 dose per day. [7] X Research source You can find a hair care supplement at a drugstore, health food store, or online. Always check with your doctor before taking supplements. While they’re generally safe, they might not be right for everyone."
    },
    {
      "title": "Get your hair trimmed every 6 to 8 weeks to prevent split ends.",
      "content": "Get your hair trimmed every 6 to 8 weeks to prevent split ends. No matter how well you care for your hair, split ends are natural and happen to everyone. Unfortunately, split ends can make your hair look frizzy. Additionally, split ends can spread up the hair shaft, causing more damage. To keep your split ends in check, visit your stylist for a trim every 6 to 8 weeks. Even if you’re trying to grow out your hair, it’s still important to get trims. Otherwise, your hair will likely break off anyway because of split ends."
    },
    {
      "title": "Choose a sulfate-free shampoo and conditioner for your hair type.",
      "content": "Choose a sulfate-free shampoo and conditioner for your hair type . Using the right hair products for your luscious locks can make a huge difference in how your hair looks. Read product labels when you’re out shopping to make sure the shampoo and conditioner you get is made for your hair type. [8] X Research source Additionally, check that the product says sulfate-free, which means it’ll be less drying. [9] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. Curly and chemically treated hair usually need a moisturizing shampoo and conditioner. Try a detangling, moisturizing shampoo and conditioner if you have textured hair. If you have straight or fine hair, try a daily clarifying shampoo with a moisturizing conditioner. Use a volumizing shampoo and conditioner if you have flat, lifeless hair. If you have color-treated hair, opt for a formula that will protect your color."
    },
    {
      "title": "Shampoo your hair daily or every other day if it’s straight.",
      "content": "Shampoo your hair daily or every other day if it’s straight. Generally, you don’t need to wash your hair every day. [10] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. However, straight hair may get dirtier faster because oils can build up on your hair and may easily travel down your hair shaft. Wash your hair every other day if you can skip a wash, but it’s okay to shampoo daily if your hair feels too dirty. When you shampoo your hair, massage a coin-sized amount of product into your roots down to the mid-shaft. You don’t need to wash your ends. [11] X Research source If you exercise or live in a polluted city, your hair may get dirty especially fast."
    },
    {
      "title": "Wash your hair 3 times per week if it’s curly or textured.",
      "content": "Wash your hair 3 times per week if it’s curly or textured. Curly and textured hair usually needs more moisture, so shampooing it too often can leave your tresses dry and frizzy. Massage the shampoo into your roots, then go down to the middle of the hair shaft. Your ends are less likely to collect oil and product, so there’s no need to shampoo them. [12] X Research source You can condition your hair between washes if you want to reactivate your curls. Washing your hair too often will dry out your hair because it removes the natural oils that your scalp produces."
    },
    {
      "title": "Condition your hair every time you wash it for smoother hair.",
      "content": "Condition your hair every time you wash it for smoother hair. Conditioner moisturizes your hair and helps you detangle it, so it can help your final style look sleeker. Use your conditioner after you shampoo or on its own between washings. Apply about a coin-sized amount of conditioner to your ends and work it up your hair shaft. Don’t apply it to your roots, however, because it can make them look greasy. [13] X Research source Leave the conditioner on your hair for a few minutes, if you can. You might wash and condition your hair first, then continue bathing. Rinse the conditioner right before you get out of the tub or shower. If you have long or thick hair, you may need to apply additional conditioner."
    },
    {
      "title": "Rinse your hair in cool water for shinier hair.",
      "content": "Rinse your hair in cool water for shinier hair. Taking a hot shower can be super relaxing, but the hot water can also dry out your hair. Instead, use cool water to rinse your hair clean of the conditioner. This will close your hair shaft, which helps lock in moisture and boosts shine. [14] X Research source If you feel too cold after rinsing with cool water, move your hair aside or use a hair clip to secure it on your head. Then, turn on the hot water to warm up your body."
    },
    {
      "title": "Use a dry shampoo between washes if your hair is greasy.",
      "content": "Use a dry shampoo between washes if your hair is greasy. While washing your hair too often can dry out your locks, you might dread skipping a wash if your hair gets really greasy. Fortunately, dry shampoo is there to save the day. Choose a formula that’s labeled for your hair color. [15] X Research source Then, shake the bottle and follow the directions to spray the dry shampoo on your hair. [16] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. Typically, you’ll spray the dry shampoo on the greasy areas while holding the container about 4 to 6 in (10 to 15 cm) away from your head. Let it sit for a few minutes, then comb out any excess. [17] X Research source"
    },
    {
      "title": "Do a deep conditioning treatment once a week to nourish your hair.",
      "content": "Do a deep conditioning treatment once a week to nourish your hair. A deep conditioning treatment can restore moisture to help your hair look its best. You can use either a commercial or homemade treatment. For an easy option, apply the deep conditioner to your hair in the shower and let it sit for 3 to 5 minutes. If you have time for a longer treatment, slather the treatment on your hair, then cover your hair in a shower cap and a hot towel. Let it sit for 20 to 30 minutes before rinsing it out with cool water. You can find deep conditioning treatments in the shampoo and conditioner aisle or online. You can also use coconut oil, jojoba oil, or olive oil for a homemade hair treatment . If your hair starts to feel greasy, decrease how often you’re doing deep conditioning treatments. You might try it every other week instead of weekly."
    },
    {
      "title": "Squeeze water out of your hair after showering instead of rubbing it.",
      "content": "Squeeze water out of your hair after showering instead of rubbing it. You might accidentally damage your hair if you rub your head after a shower. Instead, gently press the towel over your hair to soak up excess water. Slowly work your way from your ends up to your roots. [18] X Research source Your hair is weaker when it’s wet, so handle it carefully."
    },
    {
      "title": "Apply a leave-in conditioner after your shower for added moisture.",
      "content": "Apply a leave-in conditioner after your shower for added moisture. Leave-in products are great for two reasons: they detangle your hair and they help you have smoother, shinier tresses. Choose a leave-in conditioner that’s made for your hair type. Then, spray it on your hair if it’s in a spray bottle. Otherwise, put a dot of leave-in conditioner in your palm, rub your hands together, and rub the product on your hair. [19] X Research source Every leave-in product is different, so check the instructions on the label to make sure you’re applying it correctly. A leave-in conditioner may help fight frizz if you have curly or textured hair because of the added moisture."
    },
    {
      "title": "Invest in high-quality, natural bristle brushes.",
      "content": "Invest in high-quality, natural bristle brushes. The type of bristles on your brush can affect the look of your hair. A good brush will distribute the natural oils on your scalp down your hair shaft and will smooth out your tresses. Pick a brush that’s labeled as natural-bristle. [20] X Research source If you’re having trouble picking a brush, ask your hairstylist for help. They can advise you on which brush is right for you."
    },
    {
      "title": "Brush your hair twice a day if it’s straight.",
      "content": "Brush your hair twice a day if it’s straight. Brushing your hair keeps it free of tangles and distributes your natural oils. However, brushing your hair too often can leave your hair greasy and might increase your risk of breakage. Create a habit of brushing your hair after you wash it and again either in the morning or at night. [21] X Research source Brush your hair in the morning if you shower at night or at night if you shower in the morning."
    },
    {
      "title": "Use a wide-tooth comb on curly or textured hair while conditioning it.",
      "content": "Use a wide-tooth comb on curly or textured hair while conditioning it. You’ve probably noticed that combing your curly or textured hair creates frizz. The best time to comb it is actually while you're in the shower. With the conditioner still on your hair, use a wide-tooth comb to work out any knots or mats. Start at your ends and work your way up to the roots. [22] X Research source Although wet hair is more delicate than dry hair, the conditioner makes it safe to comb your hair."
    },
    {
      "title": "Apply moisturizing oil or cream for thick, curly, or textured hair.",
      "content": "Apply moisturizing oil or cream for thick, curly, or textured hair. While people may covet your thick hair, curls, or textured hair, you might notice your tresses tend to be a bit dry. This dryness can cause unwanted frizz. Fortunately, this is a common problem that’s easy to solve with a moisturizing oil. Rub a drop or 2 of the oil between your palms, then apply it to your hair from the tips up to just below your roots. [23] X Research source Try argan oil, jojoba oil, or coconut oil. You can also use a commercial moisturizing leave-in oil that’s formulated using a blend of oils."
    },
    {
      "title": "Use volumizing spray if you have thin, fine hair.",
      "content": "Use volumizing spray if you have thin, fine hair. Fine hair can be beautiful, but you might wish it had more volume. Fortunately, it’s easy to add a little boost to your style with volumizing spray. Apply the product to your roots down to the mid-shaft. Then, continue to style your hair as desired. [24] X Research source Each volumizing spray is different, so check the label on your product to make sure you’re using it correctly."
    },
    {
      "title": "Air dry your hair as often as possible to prevent heat damage.",
      "content": "Air dry your hair as often as possible to prevent heat damage. Heat styling tools help you achieve any hairstyle you want, but they’re also damaging to your hair. Embrace your natural hair texture and allow your hair to air dry as often as possible. With less damage, your hair will stay looking its best. You could also try air drying your hair 80% and then finishing with heat styling tools."
    },
    {
      "title": "Apply a heat protectant before using heat styling tools.",
      "content": "Apply a heat protectant before using heat styling tools. Heat protectants reduce the risk of damage to your hair, though they won’t entirely prevent it. Spray the product on your hair before you dry wet hair or before styling dry hair. If the product is a cream, put a dab of the product on your palm, rub your hands together, and then apply the product to your tresses. [25] X Research source You only need to apply heat protectant once. If you apply it before blow drying wet hair, you don't need to put on more before using a flat iron or curling iron. Every product is different, so read the instructions on your heat protectant before using it. You may be able to use the heat protectant on either wet or dry hair, but check your product to be sure."
    },
    {
      "title": "Blow dry your hair upside down until it’s 80% dry if you’re doing a blow out.",
      "content": "Blow dry your hair upside down until it’s 80% dry if you’re doing a blow out. Using a blow dryer helps you achieve your desired style faster, but it’s also damaging to your hair. To minimize damage, flip your head upside down and dry your hair most of the way. Then, finish drying it right-side up. [26] X Research source The underneath of your hair is usually less damaged because it’s not exposed to the elements as much as the top part of your hair. Drying your head upside down helps you apply less heat to the top sections of your hair. This technique also helps your hair look more voluminous when you’re finished styling it."
    }
  ]
}