{
  "url": "https://www.wikihow.com/Increase-the-Speed-and-Accuracy-of-Your-Kicks-in-Tae-Kwon-Do",
  "title": "How to Increase the Speed and Accuracy of Your Kicks in Tae Kwon Do",
  "steps": [
    {
      "title": "Stretch, stretch, stretch!",
      "content": "Stretch, stretch, stretch! Make sure you are properly warmed up before you start practicing your kicks. Focus on stretching your legs . As a minimum, stretch your knees, then do half splits, splits, front splits, butterfly stretches. Also do kick warm ups. Don’t forget to go deeper every time in your stretch. This will increase your flexibility and you will be able to kick higher. [1] X Research source"
    },
    {
      "title": "Don’t forget to do cardio to build your endurance.",
      "content": "Don’t forget to do cardio to build your endurance. You can run, do burpees, do cardio kickboxing, swim, or do anything else that will work out your heart. Endurance is important in Taekwondo!"
    },
    {
      "title": "Exercise your legs.",
      "content": "Exercise your legs. Practice all types of kicks in general, kick targets, and do it often. Focus on your form and make sure your movements are accurate. [2] X Research source"
    },
    {
      "title": "Do foot drills to work on speeding up your foot movement!",
      "content": "Do foot drills to work on speeding up your foot movement! Similar to football or basketball, TKD also requires footwork! Make sure you know how to move forwards and backwards, side to side, how to slide, or cross your feet. This will speed up your movements for when you actually perform kicks in general."
    },
    {
      "title": "Get a target.",
      "content": "Get a target. You can use a kicking pad or a kicking target specifically for Taekwondo that you can buy. You can also use a stiff or folded piece of paper as your target or an X-ray paper. [3] X Research source If you don’t have a partner to work with and want a target, you can make one yourself using a nail, string, tennis ball and a small plastic sandwich bag. Place the ball in the bag, then use the string to tie the bag closed being sure to leave a few extra feet of string. Drive the nail into a ceiling or, if you can't kick over 5 1 ⁄ 2 feet (1.7 m), a door frame will work. Tie the string from the bag to the nail in the ceiling so that it hangs down about 6 inches (15.2 cm) lower than you can kick."
    },
    {
      "title": "First, practice just the motion of the kick.",
      "content": "First, practice just the motion of the kick. Do not try be fast or put too much power into the kick, just make sure your kick motion is perfect. Hit the target, but focus more on the motion and less on the power."
    },
    {
      "title": "Keep practicing your kicks slowly, making sure your movements are absolutely exact and accurate.",
      "content": "Keep practicing your kicks slowly, making sure your movements are absolutely exact and accurate."
    },
    {
      "title": "Once your kicks are perfect, slightly increase the speed with which you hit your target.",
      "content": "Once your kicks are perfect, slightly increase the speed with which you hit your target. When you kick movements are once again perfect at the new speed, increase the speed a little more. [4] X Research source"
    },
    {
      "title": "Add power to your kicks as you keep practicing.",
      "content": "Add power to your kicks as you keep practicing. But make sure your movements remain exact. When training to increase your speed or power, don’t forget about the accuracy. Accuracy is as important as the speed."
    },
    {
      "title": "To practice accuracy, speed, and control at the same time, use a smaller target.",
      "content": "To practice accuracy, speed, and control at the same time, use a smaller target. Ask a friend to hold up a his or her fist or just hold a smaller target, such as a piece of paper at different heights for you to kick. [5] X Research source"
    },
    {
      "title": "Practice the motion of bringing up your knee quickly.",
      "content": "Practice the motion of bringing up your knee quickly. Since you need to bring up your knee for some kicks, speeding up this motion will improve your speed as well. Practice pulling your knee faster to increase speed."
    },
    {
      "title": "Lead in to the kick is important.",
      "content": "Lead in to the kick is important. Practice sliding and stepping into the kick. If the lead in to the kick is faster, it will give you momentum to kick faster as well. Incorporation of fast footwork and the kick will increase your overall speed."
    },
    {
      "title": "Lead out of the kick is also important, so you can get ready for your next step.",
      "content": "Lead out of the kick is also important, so you can get ready for your next step. Practice quickly stepping away from the target after you kick."
    },
    {
      "title": "Staying light on your feet will help you increase the speed as well.",
      "content": "Staying light on your feet will help you increase the speed as well. If you keep your weight on the front of your feet, you’ll be able to move faster versus if you keep your weight on your heels."
    },
    {
      "title": "Buy ankle weights from a sporting goods store or department store.",
      "content": "Buy ankle weights from a sporting goods store or department store. Consult with someone who is an expert in Taekwondo to get the right weights for your height, weight, and experience."
    },
    {
      "title": "Put on a thick pair of socks.",
      "content": "Put on a thick pair of socks. Put on the ankle weights after you are dressed in the morning and wear them constantly throughout the day, even when driving, or working if you can. If they become uncomfortable to the point you can't bear it anymore, take them off for a few minutes then put them back on."
    },
    {
      "title": "Don't practice kicking with weights on; you'll risk serious knee injury if you do!",
      "content": "Don't practice kicking with weights on; you'll risk serious knee injury if you do!"
    },
    {
      "title": "While wearing the weights, practice different leg exercises, such as lateral leg raises, lunges, squats.",
      "content": "While wearing the weights, practice different leg exercises, such as lateral leg raises, lunges, squats. This will work out your leg muscles and make your legs stronger."
    },
    {
      "title": "Practice your kicks as per usual, but without weights!",
      "content": "Practice your kicks as per usual, but without weights! Make sure you focus on accuracy of your kick before proceeding to improving speed."
    },
    {
      "title": "Watch to see that after a few weeks you'll be so much faster at kicking when not wearing your weights that you'll be able to wait on someone to start to kick you, and you'll be able to kick them first.",
      "content": "Watch to see that after a few weeks you'll be so much faster at kicking when not wearing your weights that you'll be able to wait on someone to start to kick you, and you'll be able to kick them first. There is a higher level and number of aerial kicks in Taekwondo compared to other martial arts. Taekwondo is known for doing jump spin kicks, 360-degree kicks, and 540-degree kicks. The biggest difference between Taekwondo and karate is the aerial kicks and the amount of kicking as opposed to hand techniques."
    }
  ]
}