{
  "url": "https://www.wikihow.com/Heal-Tattoo-Scabs-Fast",
  "title": "How to Help Tattoo Scabs Heal Quickly",
  "steps": [
    {
      "title": "Give your tattoo at least 2 weeks to heal.",
      "content": "Give your tattoo at least 2 weeks to heal. Your tattoo is a wound that your body is continuously healing. During the first few days, it's normal to see a mixture of blood and clear fluid on the surface of the tattoo. Over the next several days, your tattoo will peel and become softer. If you keep your skin moisturized, you might not develop scabs. [1] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source Don't worry if your tattoo does scab since it's just your body healing itself. The scab will cover your tattoo as the new skin repairs itself and the scab should fall off within a week."
    },
    {
      "title": "Do not pick, scratch, or pull at the scab.",
      "content": "Do not pick, scratch, or pull at the scab. A scab is like your body's own bandage that protects the wound underneath as it heals. Since it prevents bacteria from reaching the wound, don't do anything to remove or damage the scab. Once your skin has healed, the scab will fall off on its own. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you damage the scab, it will actually take longer for your tattoo to heal and you might ruin the ink."
    },
    {
      "title": "Wear loose clothing to guard the scab against moisture and irritation.",
      "content": "Wear loose clothing to guard the scab against moisture and irritation. If you cover the scab with clothing, choose loose, breathable fabrics, such as cotton. This allows moisture to evaporate instead of cling to the scab. The soft fabric also feels better against the scab and doesn't scrape or scratch against it. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Limit heavy exercise to prevent bacteria from getting into the scab.",
      "content": "Limit heavy exercise to prevent bacteria from getting into the scab. Give your tattoo a chance to heal and don't do heavy exercise. [4] X Expert Source Burak Moreno Tattoo Artist Expert Interview. 11 October 2019. If you sweat a lot, you could introduce bacteria to the wound, which might cause an infection and delay healing. Plan on taking 1 week off from exercising to give your body a chance to heal. [5] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source If you do exercise and sweat, clean the scab with antibacterial soap and rinse it. Then, pat the scab dry and leave it alone."
    },
    {
      "title": "Avoid soaking the scab in water for a long period of time.",
      "content": "Avoid soaking the scab in water for a long period of time. If your scab absorbs a lot of water, it's more likely to become infected, so keep it dry. Don't take baths or go swimming until the scab has fallen off on its own. [6] X Expert Source Burak Moreno Tattoo Artist Expert Interview. 11 October 2019. It's fine to briefly rinse the scab when you shower, but gently pat it dry with a soft towel when you get out. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have a thick scab that hasn't fallen off after a few weeks, you can try soaking the scab to encourage the edges to peel."
    },
    {
      "title": "Give the scab up to a week to fall off on its own.",
      "content": "Give the scab up to a week to fall off on its own. If your tattoo does scab over after a few days, remember not to pick or scratch. The scab is simply protecting the new skin underneath and it may take a week to fall off. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You might pull ink out of the tattoo if you pull off the scab before your skin has healed."
    },
    {
      "title": "Massage soapy water into your scab if it doesn't fall off within 3 weeks.",
      "content": "Massage soapy water into your scab if it doesn't fall off within 3 weeks. Place a clean cloth on your scab and shower for a few minutes so the scab absorbs water. Remove the cloth and rub antibacterial soap and water between your palms. Then, hold the scab under warm running water while you gently rub the soap over the scab. Do this for a few seconds so the edges of the scab lift up. [9] X Research source Try this just once or twice a day for a few seconds since it can fade your tattoo."
    },
    {
      "title": "Clean your tattoo with soap and water after you remove the bandage.",
      "content": "Clean your tattoo with soap and water after you remove the bandage. Take off the bandage the day after you get your tattoo. Rinse your skin with cool water and rub a little antibacterial soap between your hands. Gently massage the soapy solution over the scab. Then, rinse it off and pat it completely dry with a soft cloth. [10] X Research source Avoid using hot water because it strips moisture from your skin."
    },
    {
      "title": "Apply a moisturizer to the tattoo 1 to 2 times a day for the first week.",
      "content": "Apply a moisturizer to the tattoo 1 to 2 times a day for the first week. Moisturizing the tattoo prevents it from drying out and becoming irritated. Gently rub a very thin layer of fragrance-free moisturizer over the tattoo several times throughout the day. [11] X Research source Ask your tattoo artist to recommend a moisturizer. Some may suggest a petroleum jelly-based product while others recommend a natural body butter, such as cocoa butter."
    },
    {
      "title": "Keep your tattoo out of direct sunlight as it heals.",
      "content": "Keep your tattoo out of direct sunlight as it heals. [12] X Expert Source Burak Moreno Tattoo Artist Expert Interview. 11 October 2019. Sunlight fades your tattoo's ink, so take extra steps to keep your new tattoo out of direct sunlight for the first few weeks. If you do need to be out in the sunlight, wear clothes that cover the tattoo. [13] X Research source After a few weeks, you can rub sunscreen onto your new tattoo if you'll be outdoors. Choose a broad-spectrum sunscreen that protects against UVA and UVB damage."
    },
    {
      "title": "Call your doctor if you notice redness, pain, and other signs of infection.",
      "content": "Call your doctor if you notice redness, pain, and other signs of infection. Scabs are usually a minor inconvenience, but if yours becomes painful when you touch it or it feels hot, it might be infected. Contact your doctor, not your tattoo artist, if you have: [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Oozing thick white, yellow or green fluid Fever Swelling"
    },
    {
      "title": "See your tattoo artist if you think you're allergic to the ink.",
      "content": "See your tattoo artist if you think you're allergic to the ink. Although an infection can affect a large area of skin around your tattoo, you might notice that just the skin of your tattoo is reacting to the ink. Parts of the tattoo, such as red or black designs, might be itchy, red, or swollen. Ask your tattoo artist to tell you what inks they used for your tattoo and take this information to your doctor since it can help them make a diagnosis. [15] X Research source For example, if you have a colorful tattoo, but notice that only the red areas are raised or itchy, you may be allergic to the pigment, dye, or metallic substances in the red ink. If your doctor suspects an allergic reaction, you'll get a prescription for antihistamines. This medication treats rash, redness, and itching."
    }
  ]
}