{
  "url": "https://www.wikihow.com/Improve-Your-Study-Routine-with-Exercise",
  "title": "How to Improve Your Study Routine with Exercise",
  "steps": [
    {
      "title": "Exercise just before you study.",
      "content": "Exercise just before you study. If possible, do physical activity before you study. Go for a jog before you sit down to study for a test or go over your class notes. Hit the gym on the way home to swim some laps so you are ready to study that evening. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Doing aerobic activity gets blood, oxygen, and nutrients to your brain, which helps your brain function better. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Try light exercise while you study.",
      "content": "Try light exercise while you study. A few studies have shown that performing light exercise while studying can help recall of information. If you are going to exercise while studying, just make sure to keep it gentle. [3] X Research source These studies found that vigorous exercise while studying may hurt recall because your brain is focused on the workout instead of the information. To try this, take your textbook or notes to the gym. Use the stationary bike while you study for at least half an hour, making sure to keep the intensity light and gentle. You can also use an elliptical, treadmill, or stairclimber. [4] X Research source"
    },
    {
      "title": "Go to the gym right after studying.",
      "content": "Go to the gym right after studying. Studies have shown that exercising before and while you study are not the only times that benefit your recall and mental processing. Working out after a study session can also help boost your mental function and improve your studying. [5] X Research source Go for a walk or even lift weights after you study to help your brain stay active so your studying can pay off."
    },
    {
      "title": "Take a walk around the library.",
      "content": "Take a walk around the library. If you are studying in the library, break up your study sessions with physical activity. Get up and take a fifteen-minute stroll around the building or around campus nearby. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You can also do this if you are studying in your dorm or a coffee shop. Taking a break helps refresh yourself and gets blood flowing to the brain, which can help you think and remember better."
    },
    {
      "title": "Exercise at your desk.",
      "content": "Exercise at your desk. You can get your blood pumping at your desk while you study. If you don't want to leave everything and go for a quick 15 minute stroll, try getting some physical activity in where you are. [7] X Research source Do some chair squats at your desk. Stand up from your chair, then squat down without sitting down. Hover just above the chair for about 10 seconds. Repeat this 20 times. Try wall sitting. Lean against the wall and slowly lower yourself into a squat position, using the wall to support your back. Hold for as long as you can, or do 20 sets while holding for 10 seconds each. You may also wish to lift one leg as you hold the squat for an extra challenge. Use resistance bands while you sit there and study. Put one in each hand and pull on them for an upper body workout. You can also try holding hand weights and doing bicep curls while studying."
    },
    {
      "title": "Determine an appropriate amount of exercise.",
      "content": "Determine an appropriate amount of exercise. Adding exercise to your schedule may take some planning, but it won't be impossible. To get the benefits of the physical activity, schedule 150 minutes of exercise into your week. [8] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source [9] X Research source Adults should aim for at least 150 minutes of moderate-intensity activity or 75 minutes of vigorous-intensity aerobic activity, or a combination of these. [10] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Adolescents should get at least 60 minutes of moderate or vigorous physical activity each day. [11] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Choose an aerobic exercise.",
      "content": "Choose an aerobic exercise. There are so many activities you can do for aerobic exercise. You can join intramural sports teams, go for walks with friends, or hit your college's gym. Make sure to think about whether you are doing moderate or vigorous intensity workouts. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Moderate physical activity includes brisk walking at three miles per hour or faster or bicycling slower than 10 miles per hour. You can also play doubles tennis, go ballroom dancing, or do general gardening. Vigorous intensity workouts include race walking, jogging, or running or cycling faster than 10 miles per hour. You can also swim laps, play singles tennis, do aerobic dancing, jump rope, or hike with a heavy backpack or uphill. [13] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source Many gym classes provide excellent opportunities for vigorous and moderate exercise. Any aerobic activity should be performed for at least 10 minutes at a time to gain brain-boosting benefits. You should also spread it out throughout the week to keep your brain focused and sharp."
    },
    {
      "title": "Make time for your workout.",
      "content": "Make time for your workout. Committing to an exercise program to help your studies may be difficult at first. Keep in mind the mental and cognitive benefits of the exercise and how it will help improve your school performance. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Sit down and list all your commitments, activities, and study hours. Don't forget to list sleep times, meal times, and time for other things, like showering. Look for places you can incorporate exercise. Don't forget to count daily exercise. If you walk 10 or more minutes to class or work, this counts as aerobic physical activity. If you can start walking to class, make that one of your changes. Choose something that you believe you will enjoy and that can easily be placed into your schedule. If you have trouble finding time to workout, consider going out for a 30 minute jog or dancing around your room for half an hour. Breaking up exercises into smaller increments, such as three 10-minute fast-paced walks, can offer brain-boosting benefits if you struggle fitting exercise into your day. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Focus on consistency.",
      "content": "Focus on consistency. Consistent daily workouts, or workouts that coincide with your studying and classes, are more effective than trying to get 150 minutes of physical activity in on the weekend. The consistent physical activity throughout the week will boost your brain during the week, closer to when you study, instead of isolating it on the weekend. [16] X Research source If you have class three times a week and study on those days, try to go for at least a 30 minute walk or jog before you go back to your room to study. If you go to school every day for eight hours, spend half an hour to an hour after school lets out doing something physical, then study after you get home. [17] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Make the exercise an enjoyable experience.",
      "content": "Make the exercise an enjoyable experience. Exercise is great for relieving stress and reducing anxiety. Therefore, try not to make the physical activity a stressful part of your day. Allow yourself the time to take care of yourself. Remember, though you are not studying or working when you exercise, you are helping to boost your overall studying effectiveness. Listen to music while exercising. Numerous studies have linked music to stress relief and the reduction of anxiety. While out for your walk, listen to music that either relaxes you or makes you happy. [18] X Research source Exercise with a friend. This can do two things at once: get physical activity into your day while letting you socialize, which can help boost your mood and reduce stress."
    },
    {
      "title": "Know that exercise boosts mental function.",
      "content": "Know that exercise boosts mental function. Studies have shown that physical activity can improve mental alertness and cognitive function. Your brain works better and you can think more clearly after exercising. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Physical activity also helps boost memory and recall, which is important when studying. Aerobic exercise helps pump blood to your brain, which helps give it oxygen and nutrients that it needs to work and process information."
    },
    {
      "title": "Exercise to reduce stress.",
      "content": "Exercise to reduce stress. Exercise has many benefits, but one important benefit for students is that exercise helps boost your mood. Regular exercise helps reduce anxiety, which you may feel because of your studies. [20] X Research source Regular aerobic exercise has been found to help reduce tension, stabilize your mood, and reduce stress. Just five minutes of cardio can help start to reduce anxiety. [21] X Research source"
    },
    {
      "title": "Incorporate exercise to improve energy.",
      "content": "Incorporate exercise to improve energy. Exercise provides multiple benefits that help improve your energy. This is important if you are a student trying to study for multiple exams or classes. Doing some aerobic exercise may be more effective than hitting the coffee shop. [22] X Research source Regular exercise boosts energy levels. Since exercise reduces stress, it helps reduce fatigue associated with elevated stress levels. Exercise boosts your ability to sleep. Adequate rest helps you feel more alert and allows your brain to function better as you study. [23] X Research source"
    }
  ]
}