{
  "url": "https://www.wikihow.com/Have-Good-Hygiene-(Boys)",
  "title": "How to Have Good Hygiene (Boys)",
  "steps": [
    {
      "title": "Take a shower every day.",
      "content": "Take a shower every day. Once you get old enough to start going through puberty, daily showering is essential to have good hygiene. Use soap and hot water when you shower and concentrate on your face, hands, feet, underarms, penis, and bottom. [1] X Research source Shower after you sweat a lot, like after sports or a physical activity. After washing your face, apply a light moisturizer with SPF to protect your skin and keep it smooth."
    },
    {
      "title": "Wash your hair regularly.",
      "content": "Wash your hair regularly. If you have coarse, dry, or very curly hair, you may not want to wash it every day because it could dry it out. However, if you have exceptionally greasy, oily, or fine hair, you should do it every day to prevent oils from building up. Test it out and see how often you have to wash your hair before it starts looking or feeling oily. [2] X Research source Conditioner moisturizes dry hair and keeps it smelling good."
    },
    {
      "title": "Brush and floss your teeth every day.",
      "content": "Brush and floss your teeth every day. Brush your teeth two to three times throughout the day to keep healthy gums and teeth. Each time you brush, make sure that you are scrubbing all of your teeth and take your time. Also, make sure that you floss at least once a day. This should keep your mouth clean and keep it smelling good. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You should brush your teeth for two minutes each session. You should replace your toothbrush every two to three months."
    },
    {
      "title": "Clip your nails.",
      "content": "Clip your nails. Cut your nails whenever they are getting long with a clipper or manicure scissors. You should also keep them clean by washing them when you wash your hands. Keeping shorter nails will help you maintain good nail hygiene. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Change your clothes daily.",
      "content": "Change your clothes daily. Wearing dirty clothes can cause microorganisms and bacteria to build up on your body. It's especially important to change clothes that are closest to your body, like undershirts or underwear. Doing this daily will prevent your clothes from smelling bad and will keep you clean. Ideally, try to keep at least five good shirts and three pairs of jeans that you could wear to school over the course of the school week. You should also change your clothes after you sweat a lot. If you need to wash your own clothes read Wash-Your-Clothes ."
    },
    {
      "title": "Apply underarm deodorant.",
      "content": "Apply underarm deodorant. If you sweat a lot, underarm antiperspirant will prevent you from sweating. If you still live with your parents, ask them to buy some deodorant for you at the store. Apply the deodorant every day when you wake up so that your underarms smell fresh throughout the day. [5] X Research source Underarm deodorant is not a replacement for showering."
    },
    {
      "title": "Keep your feet clean.",
      "content": "Keep your feet clean. Wearing dirty socks, or no socks at all, can cause your feet to smell bad. If you are wearing clean socks but still have a bad feet odor, concentrate on cleaning them when you shower or bathe and rotate which shoes you wear during the week. [6] X Research source Make sure that your feet are completely dry before putting on socks and shoes. Putting talcum powder on your feet after you shower might make your feet smell better."
    },
    {
      "title": "Apply colognes or scented oils.",
      "content": "Apply colognes or scented oils. If you are still struggling with body odor, you can try to cover the smell with a cologne or oil. Apply a spray of the cologne on your wrists and neck. When applying cologne, body spray, or oil, make sure you do so in moderation so that your scent isn't too strong."
    },
    {
      "title": "Stick to your daily hygiene routine.",
      "content": "Stick to your daily hygiene routine. The best way to maintain good hygiene over a period is to make it a routine that you do every day. Alter your schedule so you are leaving enough time to take care of your hygiene. [7] X Research source A simple morning routine would include waking up at 7 a.m. to brush your teeth, wash your face, and put on deodorant before going off to school. Once you get home you could take a shower at 6 p.m. and brush and floss your teeth right before bed."
    },
    {
      "title": "Pay attention to your skin and how much you sweat.",
      "content": "Pay attention to your skin and how much you sweat. Your body changes as you go through puberty and it means that different things are happening to you. As you go through puberty most people sweat more and their skin can get more oily. [8] X Research source If you notice that you're sweating more, start applying underarm antiperspirant to reduce your sweating. If you notice that your face is oily, wash it more regularly with a facial soap meant for oily skin."
    },
    {
      "title": "Wash your hands regularly.",
      "content": "Wash your hands regularly. Get into the habit of washing your hands after going to the bathroom, playing outside, or handling anything with bacteria. To prevent getting sick or spreading germs to the food you're eating, make sure to wash your hands before and after you eat as well. Consider carrying a bottle of hand sanitizer with you. Note that this does not always automatically replace proper hand washing!"
    }
  ]
}