{
  "url": "https://www.wikihow.com/Have-Boys-Crush-on-You",
  "title": "How to Have Boys Crush on You",
  "steps": [
    {
      "title": "Nobody likes a girl who doesn't hold up a decent conversation or is snotty and rude.",
      "content": "Nobody likes a girl who doesn't hold up a decent conversation or is snotty and rude. Ask him what he likes, Just simple questions like: \"What's your favorite brand of food?\". Be yourself and act kindly around other people. Even if you dislike certain people, act neutrally towards them without any hints of disdain. If you pull off a neutral act to everyone who isn't your friend, you will gain respect and people will start to look up to you. Be a social butterfly. Mingle with different groups - don't just stick with one! Invite those that sit alone to sit with your group, as long as your friends are fine with. Become an outcast just to accompany another outcast. You want to be kind!"
    },
    {
      "title": "This may seem shallow, but boys are attracted to pout lips and blushing cheeks.",
      "content": "This may seem shallow, but boys are attracted to pout lips and blushing cheeks. Flattering clothes, cute makeup, and a fit body are highly recommended. However, not all of these things are necessary to win a guy over. Simply wearing clean, appropriate-fitting clothing and a little natural-looking makeup should be good enough. Exercise and take showers daily, wash your hair at least three times a week and clean your face every day. Wearing comfortable but flattering clothing will boost your confidence and give you a casual, comfortable look. Both you and your crush will be comfortable! It doesn't matter if you aren't the slimmest girl on the block. Just wear flattering clothes and it makes a world of difference. Makeup will give you an unflattering appearance. Makeup should add a \"I'm cute and don't need makeup\" look. High inappropriate clothing that reveals too much is unflattering and will kill your reputation, not to mention your integrity and appearance! It is best to have a modest appearance! (boys are looking for a modest girl)"
    },
    {
      "title": "Confidence is the key to winning a guy over.",
      "content": "Confidence is the key to winning a guy over. Guys dig confident girls, but be sure you aren't over-confident! Be proud of who you are and it will show, adding a glow to you. If you have no confidence in yourself, it will show and downgrade your whole act. Make a list of things about yourself that you're proud of to help boost your confidence."
    },
    {
      "title": "This article cannot stress this enough!",
      "content": "This article cannot stress this enough! It's pointless having a relationship if it only centers on you, so take a break and listen to other people's feelings. Let the guy have his chance in the conversation; normally, people enjoy talking about themselves unless they're shy. Even if the guy you're trying to win over is shy, that doesn't permit you to hog the spotlight. You just have to be a little more gentle with the questions and flirting!"
    },
    {
      "title": "This doesn't mean drunk-at-a-party funny, but it means cracking jokes and smiling as much as possible.",
      "content": "This doesn't mean drunk-at-a-party funny, but it means cracking jokes and smiling as much as possible. Avoid the plastic, forced smiles and stick with the natural, beautiful smiles. Be sure the jokes you tell aren't corny or dumb. Make sure they are downright funny!"
    },
    {
      "title": "Don't flirt obnoxiously, but just enough for the hottie to wonder if you like him.",
      "content": "Don't flirt obnoxiously, but just enough for the hottie to wonder if you like him. Too much flirting will probably scare him and make you look desperate, while too little flirting won't press the hint in deeply enough for him to realize and remember it."
    }
  ]
}