{
  "url": "https://www.wikihow.com/Get-a-Cancer-Man-to-Text-You",
  "title": "How to Get a Cancer Man to Text You",
  "steps": [
    {
      "title": "As one of the most emotional signs, a Cancer loves showing affection.",
      "content": "As one of the most emotional signs, a Cancer loves showing affection. Text him with a sweet message just to let him know you're thinking about him and miss him. Wish him a good day at work, or just say \"good morning.\" It will melt his heart to see you care about him so much that you took the time to share your feelings with him over text. \"Just wanted you to know that I'm thinking of you. I hope you're having a good day! 😊\" [1] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. \"I was missing you today! Hope all is well. ♥️\" \"Good morning, handsome! ☀️ Any day is great with you around.\" Reader Poll: We asked 279 wikiHow readers what small gift they, as Cancers, would be happiest to receive from someone they’re seeing, and 48% of them said a sweet note. [Take Poll] The note doesn’t have to be physical—Cancers will likely appreciate a sweet text, too!"
    },
    {
      "title": "A Cancer guy's sensitive nature means he can get insecure at times.",
      "content": "A Cancer guy's sensitive nature means he can get insecure at times. [2] X Research source Give him a much-needed confidence boost with compliments over text. [3] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. If you feel a connection with a Cancer and wonder why he's not making a move, it might be that he's worried about whether you like him or not! Offer sincere compliments about his best qualities, and he'll start responding to your texts much more confidently. \"That pic you posted to Instagram was adorable! You looked so handsome. 😍\" \"You give such good advice, and it's because you care about other people—more than anyone else I know! You're amazing.\" \"You're so easy to talk to. I feel like I could tell you anything! Thank you for making me feel comfortable. ♥️\" \"I love the way you put words together!\" [4] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019."
    },
    {
      "title": "An expressive Cancer will enjoy using emojis to add character to a text.",
      "content": "An expressive Cancer will enjoy using emojis to add character to a text. Emojis and GIFs can help convey your mood and intentions in ways that a plain text message sometimes can't. A smiley emoji can add warmth to a regular text, and a funny GIF can make him laugh. Any cute emoji that adds some emotional depth to your text is sure to interest a Cancer guy! Add a smiley face to some texts. \"Let's chat today\" could be misinterpreted as severe or unenthusiastic, whereas \"Let's chat today! 😊\" makes your text more friendly and appealing. Use emojis just to make your text a little cuter. \"My dog says hi! I think he misses you. 🐶\" Emojis can also make it clear when you're flirting. \"I really like getting to know you! 😍\" or \"You've been on my mind a lot today…and it's 9 AM. 😉\" Use GIFs your Cancer will find funny. If you both love Friends , start sending GIFs from the show with a few of your texts (including the classic Joey \"How you doin'?\" GIF when you're feeling flirty)."
    },
    {
      "title": "Cancers appreciate emotional expression, so tell him how you're feeling.",
      "content": "Cancers appreciate emotional expression, so tell him how you're feeling. When something great happens, show him that he's the first one you want to share the news with. When you have a bad day, talk to him about it. Cancers enjoy helping people work through their emotions, so vent your frustrations or open up about a problem you're having. For example, if he texts, \"What's up?\": \"I had an excellent conversation with my dad today! We don't talk a lot, so it made me super happy. 🥲\" \"Not so great, actually. I've been pretty upset today—this co-worker is really getting me down. Could we talk about it?\""
    },
    {
      "title": "Introspective Cancers like to reflect on their own emotions.",
      "content": "Introspective Cancers like to reflect on their own emotions. Text to ask him how he's doing, and check in when you know he's having a rough time. Your Cancer guy will be touched if you show the same concern for his emotions that he has for yours. When a Cancer is interested in someone, he'll happily open up and talk through his deeper feelings with them. [5] X Research source \"Hey you! 😊 Just checking in. How've you been this week?\" \"I know you were kinda dreading your family dinner this weekend, so I thought I'd see how you were doing. Wanna talk?\" \"I just want you to know that if you ever need someone to talk to, I'm here for you. ♥️\""
    },
    {
      "title": "Cancers love being a confidante for the people closest to them.",
      "content": "Cancers love being a confidante for the people closest to them. Offer to share a secret or reveal a personal detail that you'd only tell a dear friend. Spark his natural curiosity with a text that hints at your secret, and then wait until he replies to tell him what it is. He'll be eager to learn more about you, especially if you make him feel special in the process. \"Can I tell you something if you promise not to share it with anybody else?\" \"Want to know a secret? 🤫\" \"I have something important to tell you, but it's just between you and me, okay?\""
    },
    {
      "title": "Indulge Cancer's inner romantic with sweet and clean banter.",
      "content": "Indulge Cancer's inner romantic with sweet and clean banter. He won't respond to texts that are overtly sexual—at least, not right away. If you want to start flirting with your Cancer guy, appeal to him with texts that make his heart skip a beat. Hint you can't wait to see him or send him a link to a romantic song, and you'll have his attention. [6] X Research source \"This song makes me think of you every time I hear it! ♥️\" \"I've been waiting all day to see you! Dinner is gonna be so much fun. 😊\" \"Miss me? I've been missing you for sure! 😘\""
    },
    {
      "title": "A touchy-feely Cancer will jump at the chance to spend time with you.",
      "content": "A touchy-feely Cancer will jump at the chance to spend time with you. This sign doesn't mind texting, but they like having quality time in person most of all. Send a text asking him to hang out, and don't be afraid to name specific dates and times. He'll love that you already have a plan for what you want to do with him. If you feel ready, you could even make it an official date! \"Since we both love Ted Lasso , let's watch the new episode together! 🤠 Are you free this Friday evening?\" \"Any lunch plans today? I thought we could meet up somewhere and eat together. 😁\" \"Want to grab coffee this Saturday? And for the record: this is me asking you out. 😉\" Even if your Cancer is busy when you suggest, don't worry. When he likes you, he'll be quick to find an alternative time to see you."
    },
    {
      "title": "Loyalty is vital to a passionate Cancer man.",
      "content": "Loyalty is vital to a passionate Cancer man. Even when you're just getting to know one another, make it clear that you're not texting or flirting with other people. Cancer guys tend to take monogamy very seriously, so he'll be keen to take your relationship to the next level if he knows that you're only interested in him! \"Just wanted you to know I'm still single, and I'm only interested in one person. Guess who? 😘\" \"Nobody gets me like you do! I've never connected with someone so easily before. ♥️\" \"I deleted OkCupid as soon as we matched since I didn't need it anymore—I found the guy I was looking for. 😍\""
    },
    {
      "title": "A sensitive Cancer might get upset if you leave him on read for too long.",
      "content": "A sensitive Cancer might get upset if you leave him on read for too long. Once you've got him texting you, make sure you text back fairly soon after getting the message. This sign doesn't play games when it comes to communication; he'll understand if you're having a busy day, but if you ghost him for days, he'll just think you don't care. Be responsive, and he'll be happy to keep texting you. While Cancers love affection, double-texting can make you seem overeager too soon. Unless it makes sense to send multiple texts, let your Cancer guy reply before sending a follow-up text."
    },
    {
      "title": "Ending a great conversation early will leave Cancer guys wanting more.",
      "content": "Ending a great conversation early will leave Cancer guys wanting more. In a text conversation where you two have been really hitting it off, laughing, and having fun, make sure you finish it before you run out of things to say and the energy dies down. Chances are that he'll text you first next time if he gets good vibes talking to you from beginning to end! After sharing a good joke, text, \"It's been so fun to talk with you, but I actually have to run! 😭 Let's do this again soon, okay?\" \"Thank you so much for the pep talk! I've gotta get back to work, but let's pick this up again soon. 😘\""
    }
  ]
}