{
  "url": "https://www.wikihow.com/Make-Stilts",
  "title": "How to Make Stilts",
  "steps": [
    {
      "title": "Cut your two foot beds.",
      "content": "Cut your two foot beds. These will be trapezoid pieces of wood which will hold your feet. Get a piece of 1/2 inch plywood, and draw two triangles using a pencil. The triangles should have the following dimensions: 10 inch base, two 8 inch sides (use a ruler). It is best to use the edge of the plywood as the 10 inch base, that way one side of the triangle is already smooth and sanded. [1] X Research source Use a table saw to cut out the two triangles. When you have them cut out, measure down 1 inch from where the two 8 inch sides meet (top point). Make a mark one inch down on both of the 8 inch sides. Connect these two points using a pencil and a ruler. Take your table saw out again and cut along the line. Make sure you do this to both triangles. Finally, take a piece of sand paper and smooth over the edges. You should now have two trapezoid shapes with 10 inch bases, and 7 inch sides (triangle with the top cut off)."
    },
    {
      "title": "Make your legs and support beams.",
      "content": "Make your legs and support beams. Purchase two 48-inch 2X2 boards at your local hardware store. Lay the boards down on a flat surface. Mark the middle point of each of the two boards (24 inches) with a ruler and pencil. Use a table saw to cut the boards along the mark you just created. You should now have four pieces of 2X2 wood, each 24 inches long. [2] X Research source [3] X Research source"
    },
    {
      "title": "Line your four 2X2 boards flush with one another.",
      "content": "Line your four 2X2 boards flush with one another. Do this so that the four long sides are next to one another. Use a clamp to press the boards together to make the next few steps easier. Go to one end of your four boards. Make a mark 1 inch down and 5 inches down on one of the boards using a pencil and ruler. Do this again on another one of the boards. [4] X Research source Take your ruler and line up the two 1 inch marks. Draw a line connecting them which runs across all four boards. Take your ruler and line up the two 5 inch marks. Draw a line connecting them which runs across all four boards. On two of your boards, draw an extra dash 6 inches down the board."
    },
    {
      "title": "Lay your boards on top, together.",
      "content": "Lay your boards on top, together. Take two boards (one with the 6 inch mark and one without). Lay the 6 inch marked board on the table, with the pencil lines facing up. Take the board without the 6 inch mark and turn it around 180 degrees. Lay it on top of the bottom board, also with the pencil lines facing up. [5] X Research source The edge of the top piece should lay right on the 6 inch line of the bottom board. The 1 and 5 inch marks of both boards should run parallel with one another. Note: there is only 6 inches of total overlapping board. Clap these two boards together in between the 1 and 5 inch marks of the top board."
    },
    {
      "title": "Drill holes into your boards.",
      "content": "Drill holes into your boards. Make a mark between the 1 and 5 inch marks of the top board. Since they are 2X2 boards, the middle of those lines should be 1 inch. Take a drill and make a hole on those two middle marks. Drill all the way down until you go through both boards. [6] X Research source [7] X Research source Make sure that you are doing this on a sturdy work bench as you don't want to drill down and damage a nice table. Once you have drilled the holes, lay down a washer over each hole and then slide 4 1/2 inch bolts into each of the holes. Take off the clamp once the bolts are all the way through."
    },
    {
      "title": "Take out one trapezoid piece.",
      "content": "Take out one trapezoid piece. This is the piece you cut earlier. Place it underneath the two connected 2X2 boards so that the short edge of the trapezoid is parallel with the edge of the top board. Take out a hammer and gently tap on each of the bolts. This will make two marks on the trapezoid where you will drill holes into. [8] X Research source [9] X Research source Separate the trapezoid from the other boards. Use your drill to drill holes where the two marks are. Place the trapezoid back underneath the boards in the same position, only this time feed the bolts through the two holes you just drilled. Put two washers on the ends of the bolts (side of the trapezoid) and then place a nut on each of the bolts. Use a wrench to tighten and secure the nuts all he way down to the face of the trapezoid."
    },
    {
      "title": "Make a footbed.",
      "content": "Make a footbed. Use the table saw to cut another piece of plywood that is 10 inches long and 4 inches wide. Smooth over the edges using a piece of sandpaper. Flip your attached 2X2 boards around so that the trapezoid is facing up. Place the flat side of the board against the long, 10-inch edge of the trapezoid and the 2X2 board it is parallel with. Drill a hole through the rectangle down into the board underneath. [10] X Research source [11] X Research source Then take a 2 inch screw and place it in the hole. Use a screwdriver to attach the rectangle to the underlying board. You can add as many screws as you would like for added durability. Add a screw to each of the side of the rectangle where only the trapezoid is underneath. Always pre-drill the holes so that the plywood doesn't split."
    },
    {
      "title": "Adjust the stilts to your leg length.",
      "content": "Adjust the stilts to your leg length. Bend your knee so it's at a 90° angle. Measure from 1 1/2 inches below your knee to the floor. Label this length Z. Measure length Z from your footing, up the length of the stilt. Make a mark using a pencil. Then, take your table saw and cut at this mark. [12] X Research source [13] X Research source Doing this will make sure the stilts will be suited to your particular leg length."
    },
    {
      "title": "Create some upper leg supports.",
      "content": "Create some upper leg supports. Purchase plastic piping from your nearby hardware store. The piping should have a 4-5 inch diameter. Once you have purchased the pipe, mark 3 inches down from the edge of the pipe. The pipe should have grooves which will allow you do draw a line all the way around the pipe 3 inches down. You should use a Sharpie or magic marker to make the line. [14] X Research source Take your table saw and cut along this marker line. You can also use scissors if your plastic piping is thin enough"
    },
    {
      "title": "Cut the piping in half.",
      "content": "Cut the piping in half. Cut your 3-inch pipe piece in half along the top (not the side) with a table saw. One of these halves will go on one stilt, while the other half will go on the other stilt. Take one of the halves and place it above the footing, about 1 inch from the top of the stilt, so the pipe curls inward. Pre-drill two holes into the pipe, halfway through the 2X2 inch board. [15] X Research source Place nails into each of the holes and screw them in using a screwdriver. Make sure to add the piping to the other stilt as well."
    },
    {
      "title": "Grab a pair of old shoes.",
      "content": "Grab a pair of old shoes. It's best to use shoes that are rather thin. Place each shoe on the appropriate footing and clamp the shoes down to secure them. Take out your drill and drill 3-4 holds through the inside-bottom of the shoe into the footing below. Make sure not to drill holes through the heel, which could make it uncomfortable to stand in. [16] X Research source Place a screw in each of your holds you just drilled. Take a screwdriver and screw each of them all the way into your footing. Wiggle your shoe slightly to make sure that it is secure. You don't want it to slip off when you stand up in them."
    },
    {
      "title": "Attach one-wrap velcro.",
      "content": "Attach one-wrap velcro. Drill a hole into each of your stilts on the upper part of the backside stilt boards. This hole should be in the middle of the plastic pipe, but on the reverse side. Then, cut a piece of one-wrap velcro that is about 2 inches longer than the circumference of your calf. [17] X Research source Take the end of the strap of velcro and place it overtop the pre-drilled hole. Then place a fender washer overtop of the overlap. Drill again through to the pre-drilled hole to make a hole through the velcro. Place a wood screw into the hole, and screw it in using a screwdriver. Make sure that both stilts get a piece of velcro."
    },
    {
      "title": "Put the stilts on your legs.",
      "content": "Put the stilts on your legs. It is best to sit high-up, like on a bar stool, when you put your stilts on. Also, make sure that the stool is next to a higher structure, such as the edge of your house, or a fence, so that when you stand you have something to hold onto. Sit on the stool and put on each of the stilts on one at a time. [18] X Research source Place your foot in the appropriate stilt. Slide it into the shoe and tie the shoe. Then, wrap the velcro around your leg tightly, and attach it around (the velcro sticks to itself). You do not want to wrap too tightly, otherwise you could lose circulation."
    },
    {
      "title": "Practice walking around with your stilts.",
      "content": "Practice walking around with your stilts. Get out of your stool and stand up on your stilts, as you lean against a taller structure (fence, house, etc.) Walk back and forth slowly, holding onto the structure, to get used to how they feel. Once you feel comfortable enough, let your hands go, but continue to walk near the tall structure in case you fall. [19] X Research source It is best to have an extra person nearby to catch you if you fall in the opposite direction. After you have mastered walking near your structure, begin to venture out. Continue to have someone follow you just in case you fall. It is best to walk around in your yard, in case the worst happens your fall won't hurt so bad."
    },
    {
      "title": "Take your stilts off.",
      "content": "Take your stilts off. Once you are done walking around, sit back down on the stool. Undo the velcro strips, and step out of the shoes. You are now free to decorate your stilts if you would like. Add a coat of paint to them or stain the wood to protect it from moisture. You can even add stickers or pen designs. The possibilities are endless, and all up to you!"
    }
  ]
}