{
  "url": "https://www.wikihow.com/Make-a-Corset-Dress",
  "title": "How to Make a Corset Dress",
  "steps": [
    {
      "title": "Find a formal gown or dress to add a corset back to.",
      "content": "Find a formal gown or dress to add a corset back to. The dress should have a zipper down the back and fit you well in the bust area. It would be even better if the dress already has boning in the bodice. This will give it some structure and make it more corset-like. Choose a dress whose back sits at your shoulder blades, or just below them. You can also sew a formal gown from scratch. Buy a pattern that allows for the gown to zip up the back, preferably something with boning. Make the gown according to the instructions, then click here to continue. It's best if the dress is too small by about 5–6 in (13–15 cm). If it fits correctly, you'll need to take some of the fabric out of the back in a V-shape. [1] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Remove most of the zipper with a seam ripper.",
      "content": "Remove most of the zipper with a seam ripper. Use the seam ripper to open up the seams where the zipper is connected to the dress. Start at the top of the dress, and go down to the waist. If you want your corset to be longer, you can extend it 1 to 2 inches (2.54 to 5.08 centimeters) below the waist instead. Gently pull the lining of the dress away from the outer fabric to help loosen up the zipper. If your dress does not have a lining, then use the seam ripper to cut the stitches holding the zipper to the dress. Do not take the entire zipper out. Having a few inches/centimeters of zipper in the skirt will help you put the dress on and take it off."
    },
    {
      "title": "Undo the zipper, then secure it with a safety pin.",
      "content": "Undo the zipper, then secure it with a safety pin. Tug down on the zipper pull to open the zipper all the way. Use a safety pin to secure the zipper pull to the fabric of the skirt. This will ensure that the zipper head doesn't slide off of the zipper tape in the next step."
    },
    {
      "title": "Cut the excess zipper away.",
      "content": "Cut the excess zipper away. Leave about 1 inch (2.54 centimeters) of the zipper tape on each side of the dress."
    },
    {
      "title": "Tuck the top edges of the zipper into the dress.",
      "content": "Tuck the top edges of the zipper into the dress. When you removed the zipper, you will have cut the lining of the dress away from the outer fabric. Tuck the excess 1 inch (2.54 centimeters) of the zipper into the dress, right between the lining and the outer fabric. Make sure that it matches up with the edges of the fabric, then secure it with sewing pins. You will need to do this for both halves of the zipper."
    },
    {
      "title": "Get material for the lacing loops.",
      "content": "Get material for the lacing loops. You will be attaching these loops to the back of your dress, where the zipper used to be. Choose something that matches both the texture and color of your dress. If you can't find the right color, consider choosing a contrasting color, but in the same material. If your gown came with spaghetti straps, cut those off now, then click here to continue."
    },
    {
      "title": "Cut the material into a 1-inch (2.54-centimeter) wide strip.",
      "content": "Cut the material into a 1-inch (2.54-centimeter) wide strip. Fold it in half lengthwise, with the right sides facing in, and iron it flat. The length of the strip should be the length of the corset back you're creating, plus about 6 in (15 cm) just in case you need a few more loops. [2] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Sew the strip using a ¼-inch (0.64-centimeter) seam allowance.",
      "content": "Sew the strip using a ¼-inch (0.64-centimeter) seam allowance. Use a thread color that matches your material. When you are done, trim the raw edges away so that the seam allowance is ⅛-inch (0.32-centimeter) wide."
    },
    {
      "title": "Turn the lacing right-side-out.",
      "content": "Turn the lacing right-side-out. Clip a small safety pin to one end of your lacing. Tuck it into the tube, then pull it through to the other end. Once you have the entire tube turned right-side-out, unclip the safety pin and set it aside."
    },
    {
      "title": "Cut the tube into short segments.",
      "content": "Cut the tube into short segments. Each segment needs to be about 1¼ inches (3.2 centimeters) long. You are cutting them a little longer than you need to so that you can sew them into the dress more securely. This will look best if you cut on the bias. [3] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Pin the loops into the dress.",
      "content": "Pin the loops into the dress. Open up the left side of your dress, where you took the zipper out. Form the segments into loops, and pin them into the lining part. The bottom strand of the first loop should be overlapping the top strand of the second loop, forming an X inside the lining. Keep going until you reach the bottom of the area you cut out. Don't leave the curved part of the loop sticking out of the dress. It should be resting flush against the edge of the dress. Repeat this step on the right side. Make sure that the loops line up perfectly. Cover the raw edges of the loops with a matching ribbon if your dress doesn't have a lining."
    },
    {
      "title": "Sew the opening back shut.",
      "content": "Sew the opening back shut. Close the opening where you inserted the loops back up, so that the dress looks like it used to. You should now see some loops sticking out of the side where the zipper used to be. Go over the edge on your sewing machine. Backstitch at the start and end of your sewing for extra strength. Sew down the top 1 inch (2.54 centimeters) of each zipper half as well."
    },
    {
      "title": "Lace the dress.",
      "content": "Lace the dress. You can thread matching or contrasting ribbon through the tops, starting at the top and finishing at the bottom. [4] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020. Choose ribbon that is the same width as each loop. You can also make your own ribbon, by folding lone strips of fabric in half lengthwise, sewing them, then turning them right-side-out. If you're making your own tie, you may need to cut and sew 2 pieces of fabric together. [5] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Buy fabric for the modesty panel.",
      "content": "Buy fabric for the modesty panel. It's best of the fabric matches the fabric of your dress. If you can't find any, consider using a contrasting color instead. Your dress does not need to have a modesty panel. Whether you choose to include one is entirely up to you!"
    },
    {
      "title": "Make the pattern.",
      "content": "Make the pattern. Turn your dress so that the back is visible, and flatten it. You will have a large gap between the left and right looped edges. Measure across the top and bottom of the gap, adding 2½ inches (6.35 centimeters) to each measurement. Next, measure from the top of the gap straight down to the bottom, then add 1¼ inches (3.2 centimeters) to the measurement. Draw an upside-down trapezoid based on those measurements."
    },
    {
      "title": "Transfer your pattern to the material, and cut it out.",
      "content": "Transfer your pattern to the material, and cut it out. Fold your material in half, with the right sides facing in. Pin your template to the material, with the top edge aligned with the fold. Cut the pattern out. You don't need to add seam allowances, because it already includes them."
    },
    {
      "title": "Sew the modesty panel.",
      "content": "Sew the modesty panel. Fold the panel in half with the right sides facing in. Sew along the two side edges using a ¼-inch (0.64-centimeter) seam allowance."
    },
    {
      "title": "Add heavy interfacing to the lining side.",
      "content": "Add heavy interfacing to the lining side. Cut a sheet of heavy interfacing that's ¼ inch (0.64 centimeters) smaller than your panel on all sides. Iron it to the lining side of the panel following the instructions on the package. You can also sew boning onto the sides of the panel, if you'd like. [6] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Clip the corners, then turn the panel right-side-out.",
      "content": "Clip the corners, then turn the panel right-side-out. If you need to, use a pencil or a knitting needle to help push out the corners and seams so that they are nice and sharp."
    },
    {
      "title": "Press the panel flat, then sew up the bottom.",
      "content": "Press the panel flat, then sew up the bottom. Fold the bottom raw edges in by ¼ inch (0.64 centimeters) first, then pin them in place. Press the modesty panel flat using a heat setting on your iron that is suitable for the material you are using. Sew the bottom shut using a ladder stitch, removing the pins as you sew."
    },
    {
      "title": "Attach the panel to the left edge of your dress opening.",
      "content": "Attach the panel to the left edge of your dress opening. You can also secure the panel with snaps instead so that you can remove it if you prefer a backless dress."
    }
  ]
}