{
  "url": "https://www.wikihow.com/Hydro-Dip",
  "title": "How to Hydro Dip",
  "steps": [
    {
      "title": "Gather what you need.",
      "content": "Gather what you need. Begin the hydro dip process by deciding what you want to paint, then pick paint colors and find a water-tight container large enough to accommodate the object. You can use one color of spray paint, or several colors to swirl into cool designs with a disposable wooden stick. Purchase spray sealant (available at art stores or hardware stores) to seal your colorful design onto the object after hydro dipping, as well as protective gloves. [1] X Research source The plastic container should be large enough that it won’t overflow if the object being painted is submerged in it. Buckets, large plastic storage containers, and feed tubs are all good options. If you do not wish to get paint on the container you are using, line it with plastic sheeting before pouring in the water."
    },
    {
      "title": "Set up the painting area.",
      "content": "Set up the painting area. If you can, set up outdoors (e.g. in your driveway or on the lawn) to avoid having your home smell like spray paint fumes. Make sure all of the items you will need are within arm’s reach, as the process of hydro dipping can go very quickly. Fill your container about ¾ full with lukewarm or warm water, as the ideal temperature for spray paint is between 50 and 90 degrees Fahrenheit (approximately 10 to 32 degrees Celsius). If you have to set up indoors, open as many windows and doors as possible and nearby furniture with plastic sheeting. Make sure to keep children and pets away from the area while you paint."
    },
    {
      "title": "Apply a base coat.",
      "content": "Apply a base coat. In the event that certain spots on the object do not get covered in paint when you dip it, apply a base coat color that will show through. Use spray paint to coat the entire surface of the object. Let it dry for 2-3 hours before you start the hydro dip process. [2] X Research source"
    },
    {
      "title": "Spray paint onto the water’s surface.",
      "content": "Spray paint onto the water’s surface. Make sure to shake the spray paint cans thoroughly to mix the paint before applying it. Hold the can 10 to 12 inches (approximately 25-30 cm) from the surface of the water and spray it to your heart’s content until the surface is coated. Switch between colors as desired to make your own unique creation. [3] X Research source Colors will swirl together naturally on the water’s surface. To make smaller swirls, use a clean wooden stick to stir the colors until you’re left with a design you like."
    },
    {
      "title": "Dip the object in the container of paint and water.",
      "content": "Dip the object in the container of paint and water. Put on gloves and make sure that the object you are painting is free of dust or debris. Slowly dip it into the container until it is fully submerged. Slowly pull the object back out of the water. [4] X Research source If you do not wish for the object you dipped to receive a second coat of paint on its way out of the water (which might alter the original swirl pattern of the paint), part the paint on the water’s surface before pulling the object out of the container. Having a second person to help you would be a big help for this step!"
    },
    {
      "title": "Leave the object to dry.",
      "content": "Leave the object to dry. Place the painted object on a plastic sheet or piece of cardboard to air dry. To make sure it is completely dry, let it sit for several hours before touching it. If you leave the object indoors to dry, make sure it is left somewhere safe where children or pets will not have access to it. [5] X Research source"
    },
    {
      "title": "Use a clear, spray sealant.",
      "content": "Use a clear, spray sealant. To keep your hydro dip paint looking fresh and clean, spray it with a clear spray sealant (available in hardware stores in matte, semi-gloss, or gloss finish). Spray an even coat over the object and let it dry for several hours. Apply the sealant only after the object is completely dry. [6] X Research source"
    },
    {
      "title": "Purchase a kit.",
      "content": "Purchase a kit. Look online for home hydro dip kits, which allow you to transfer a specific print or design onto a 3-D object (that can be submerged in water without harm) without specialized equipment. In general, companies making these kits will offer an assortment of designs to choose from to customize your kit. Basic home hydro dip kits should include: Patterned film Activator Top coat Basecoat Universal primer"
    },
    {
      "title": "Choose a suitable container.",
      "content": "Choose a suitable container. Most DIY kits will not come with a container to use during the dipping process. Choose a watertight plastic, glass, or aluminum container that is deep enough to fully submerge the object you are hydro dipping. It should also be long and wide enough to leave 5-6 inches (approximately 12-15 cm) between the edge of the container and the object."
    },
    {
      "title": "Prepare the item.",
      "content": "Prepare the item. Make sure that the item you are dipping is free of dust and debris. Spray the item with the primer provided in your kit, enough to coat it but not enough for the primer to run. Apply 1-2 light coats of the base coat spray provided in your kit, and leave the item to dry for one or two hours. [7] X Research source Before applying the primer and base coat, use masking tape to block off any parts of the item that you do not wish to have an image printed on. Do not skip using primer––it helps the image to adhere properly to the surface, making the final product durable and long-lasting."
    },
    {
      "title": "Size and cut the film.",
      "content": "Size and cut the film. Measure the size of the object you wish to cover and add 4-5 inches (approximately 12-15 cm) on each side. Cut the film accordingly. Make sure that the film remains dry during this process, as getting it wet could cause the image to warp. [8] X Research source Place masking tape around the edges of the film to keep it from rolling."
    },
    {
      "title": "Set up the container.",
      "content": "Set up the container. Fill the container with hot (but not boiling) water, approximately ¾ of the way full. Carefully pick up the film and bring the opposite sides together, holding it like a sling. Place the bottom of the sling onto the middle of the surface of the water, and slowly bring the sides down to place the film flat on the water. [9] X Research source"
    },
    {
      "title": "Let the film hydrate and apply the activator.",
      "content": "Let the film hydrate and apply the activator. Use your phone or a stopwatch to ensure that the film dissolves for sixty seconds. After sixty seconds, spray the activator provided in your kit evenly over the film. Once coated, the film should take approximately 5-10 seconds to turn into liquid ink on the surface of the water. [10] X Research source When the film is fully activated it will have a distinctly glossy appearance and will expand to fill the entire surface size of the container."
    },
    {
      "title": "Dip your item.",
      "content": "Dip your item. Hold your item at a 45-degree angle and slowly submerge it into the water. Once the item is fully submerged, even out the angle by pushing it down towards the ink. Keep your movements fluid for best results. [11] X Research source Put on gloves before dipping your item. If they are not supplied in the kit, purchase a pair before starting the whole dipping process."
    },
    {
      "title": "Rinse the item.",
      "content": "Rinse the item. Slowly remove the item from the water. Hold the item lightly and carefully, and avoid rubbing its surface. Rinse it under cold water immediately for approximately 3 minutes to remove any PVA residue. [12] X Research source"
    },
    {
      "title": "Apply the top coat.",
      "content": "Apply the top coat. After air-drying the item, apply an even coat of the aerosol top coat spray provided in your kit. Let the item air dry before applying a second coat. Continue the process until the finish is to your liking. [13] X Research source"
    }
  ]
}