{
  "url": "https://www.wikihow.com/Get-a-PhD",
  "title": "How to Get a PhD",
  "steps": [
    {
      "title": "Complete an undergraduate degree in a broad field.",
      "content": "Complete an undergraduate degree in a broad field. To qualify for a PhD program, you will need a solid record of undergraduate coursework from a reputable university. [2] X Research source This degree should demonstrate your potential for both advanced coursework and independent research. In general, you need to maintain a high GPA and develop a good working relationship with your instructors. Generally, it's recommended that students interested in pursuing advanced degrees should develop a wide skill-base during their undergrad. In other words, while you may ultimately be interested in studying Zoology, an undergrad degree in basic Biology might provide you with a diverse base that you'll be able to narrow in your future studies. Many universities offer majors designed to funnel you into an advanced degree. Pre-law majors and Pre-med majors are two notable examples of this. Talk to your academic advisor about your interest in pursuing a PhD after you graduate, if you've yet to select a major."
    },
    {
      "title": "Develop a close relationship with at least one faculty member.",
      "content": "Develop a close relationship with at least one faculty member. Finding one or more faculty members who will mentor you, guide your development, and assist you in finding the right program for you can be the difference between finding your way into a good Ph.D program, and struggling. You'll also need several letters of recommendation to apply to graduate programs, making these contacts essential. [3] X Research source A good way to develop a relationship with a professor is to take multiple classes with her and join her lab, or research team. Go to office hours, introduce yourself, and express your interest in advanced degree work. Most professors are more than happy to work with a talented student who shows a sincere interest in their work. It's also a good idea to forge relationships with graduate students at your school. Speak to graduate students and faculty about their experiences at the school, even if you plan on going elsewhere for your advanced degree. Many will be happy to let you know about the advantages and disadvantages of studying for and obtaining a Ph.D. It can be a great way to get insider information and get ahead of the game."
    },
    {
      "title": "Obtain experience in the field with a research internship.",
      "content": "Obtain experience in the field with a research internship. In many fields, hard science in particular, securing a summer internship as an undergrad can do a lot to make you stand out on your applications. If you can get experience assisting in the biology lab, or doing field work with the other geologists, or even assisting a professor grade survey-course tests, you'll be one step ahead in the academic field. Work-study programs in your field of interest can also be extremely attractive of graduate applications. If you're studying English, try to secure employment in the Writing Lab, rather than the cafeteria to give yourself an edge and valuable experience."
    },
    {
      "title": "Make contacts in your field.",
      "content": "Make contacts in your field. Become involved in your academic department's club or honor society if one exists. If not, speak with your advisor or department chair about starting one. National and regional conferences, such as the National Conference on Undergraduate Research (NCUR), allow dedicated undergrads the opportunity to rub elbows with experts and contribute to the discussion."
    },
    {
      "title": "Start researching graduate programs in your junior year.",
      "content": "Start researching graduate programs in your junior year. Graduate school applications will be due sometime during the winter or spring of the academic year, for admittance the following fall semester. In other words, the autumn semester of your senior year is most likely too late to start looking at programs, compiling your application materials, and getting them in on time. [4] X Research source Start early and don't miss out. Look for programs with a good reputation, but give more weight to the faculty and the research interests of the other graduate students at prospective schools. What you're looking for in an advanced degree program is camaraderie and common ground, not an arbitrary ranking on some \"prestigious\" list. The applications are expensive--sometimes $50 or $80 dollars each--so you won't be able to apply to all programs. Try to select a range of programs to apply to: choose a few big dream schools with great facilities and prestigious faculty and lots of competition to see if you can't get in. Apply to smaller programs that you'd also be happy attending. Apply to as many as you can afford to give yourself the best chance. For some fields, a master's degree will be a more appropriate subsidiary or even terminal degree. At worst, a master's degree can be an excellent primer for the graduate school life, especially if teaching assistantships or fellowships are available."
    },
    {
      "title": "Take the Graduate Record Examinations (GRE) general or subject test",
      "content": "Take the Graduate Record Examinations (GRE) general or subject test . Many programs require scores from the GRE to admit you to the graduate school, while others (many liberal arts degrees) will waive this requirement. While most Master's programs only require the general test, which is like an advanced version of the SAT, some Ph.D programs will require that you take the subject test, which is given in several sections, including biology, literature, and other fields. It's a much more difficult test than the general--the reading list for the Subject test in lit is several hundred authors from a variety of periods. Make sure you take the correct test for the program to which you're applying. [5] X Research source Schedule your test early in the application season, to give yourself enough time to retake it, if necessary. The test can be somewhat expensive, more than $100, so start studying now with a good-quality commercial study guide. When you arrive for the test, you can arrange to have your scores sent directly to the graduate programs you'll be applying to. This has the advantage of cutting out an extra step in your application process, but also ensures that the school will see your scores, good or bad. If you're worried about your score, arrange to have them sent to you instead."
    },
    {
      "title": "Secure letters of recommendation from people familiar with your work.",
      "content": "Secure letters of recommendation from people familiar with your work. The best recommenders will be distinguished former professors, contacts who can attest to your commitment, work ethic, and who also know the field you're applying to intimately. Often, your undergraduate and graduate professors and advisers will have a better handle on the specific information the admissions committee wants than would a supervisor from outside the academic world. It's important to ask for these letters as early as possible, preferably at least 3 months before you need to submit your applications. Professors will be inundated with letter-writing requests at the last minute, increasing the possibility of them writing a poor evaluation. Don't be one of those students."
    },
    {
      "title": "Write a statement of purpose.",
      "content": "Write a statement of purpose. This should describe what you have already done in your field and what you hope to accomplish with your doctoral research. Good letters will describe who you hope to work with as your research supervisor and the reasons you want to work with that person. Your research program should be in an area that has not been previously researched, or has been underrepresented in the literature. [6] X Research source If you're planning on applying to lots of schools, it can be a time-saver to write a \"form\" version of your letter, allowing space to customize the letter for more specific programs. It's very important to tailor each statement of purpose to the particular program to which you're applying. This demonstrates your seriousness and interest in the school. Each letter should read as if you're only interested in studying at that school."
    },
    {
      "title": "Assemble your application packets and submit them by the deadline.",
      "content": "Assemble your application packets and submit them by the deadline. The graduate school will list the basic requirements for admission, and each program will likely list supplementary documents, including writing samples, portfolios, or other materials that you should submit to the program by a particular deadline. Look for this information on the graduate studies website for the particular university. Most application packets require the following materials: a completed application form Undergraduate and graduate transcripts A curriculum vitae (CV) or resume Recent GRE scores Statement of Purpose TOEFL or IELTS scores (for international students) 2-3 Letters of Recommendation"
    },
    {
      "title": "Apply for teaching or research assistantships.",
      "content": "Apply for teaching or research assistantships. A general rule of thumb is that advanced degrees should always be free. When you're doing your research, apply to programs that offer full funding, or at least offer opportunities to secure funding in exchange for teaching responsibilities. Most Ph.D programs offer some kind of assistantship to pay your way through the years of your doctoral program, with the added option of research assistantships directly tied to your own research. Applying for financial aid will often involve supplementary application materials, like a teaching statement, research statement, or other short writing prompts. Research the specific requirements at each university for specific instructions when applying for financial aid. If full funding isn't an option, consider applying for need-based scholarships. Often, these are available to minority applicants or students in financial straits. Likewise, the application fee can often be waived. Contact individual departments when you're applying to check about need-based application waivers."
    },
    {
      "title": "Choose a major professor and committee.",
      "content": "Choose a major professor and committee. You want an advisor familiar with your area of research who can direct you when needed and have resources and connections you can draw on. Tenured professors have access to more grant money, equipment, and connections, while non-tenured professors are more personally available for assistance and advice. Choose people who you can work with, and who share a common research interest, as well as people you get along with personally. Personal differences often pop up during these kinds of working relationships, making it important to avoid them in the beginning. Your proposed academic advisor/research supervisor should ideally be named in your statement of purpose, with the reasons you want to work with that person. Those reasons should show that you know something about that person's background and why he or she would make an effective advisor."
    },
    {
      "title": "Submit a plan of study.",
      "content": "Submit a plan of study. For most fields, a plan of study is submitted to the graduate school and the degree program within the first year of your studies. The plan will be submitted to the Department Chair, who will either accept it as is or suggest revisions. Obtain the Plan of Study form from the graduate school office, if one is provided. The form needs to include: [7] X Research source The names and signatures of your committee members , the program director, and the student. You'll also need your student ID number and other personal information. A brief statement of your academic and research goals . This will typically be a super-condensed version of your research question or thesis statement, probably no more than 50-100 words. A list of the required courses you'll take over the next two years, listing course number, title, department, and instructor, as well as the semester you intend to take the course. Most programs require around 12 hours of required coursework for an advanced degree. A list of the elective courses you'll take , with corresponding course numbers, titles, departments, and instructors, as well as the semester you intend to take the course. Most programs require somewhere between 20 and 30 elective hours for an advanced degree. Dissertation hours . When you've passed your preliminary examinations, your coursework will change to independent research and dissertation work, but you'll still be registered for a course with a course number and a particular number of credit hours, with your major professor or thesis chair as the instructor. This information will also need to be included on the plan of study form."
    },
    {
      "title": "Complete the requisite coursework.",
      "content": "Complete the requisite coursework. Most programs require somewhere in the neighborhood of 30 hours of departmental coursework, while others require more or less, depending on the field. As with most advanced degrees, you'll likely need to pass all your courses with at least a B, or better. In graduate school, the course load is usually somewhat less than the undergraduate degree, because of the intensity of the coursework and other research or teaching responsibilities. A \"full load\" is usually considered 6 or 9 hours, though you'll be doing 20 or more hours of teaching or research in a given week. [8] X Research source For a PhD student, a typical coursework semester might involve three courses: a required core class and two elective courses. Typically, elective courses will still be in the department the student is studying, if not the particular program. For example, a comparative lit PhD studying Medieval literature may take a 20th century poetry course in the English department as an elective, though probably not a biology class."
    },
    {
      "title": "Complete your written examination.",
      "content": "Complete your written examination. Typically, this will occur sometime at the end of your second year of course work, and will be prepared by your committee. The content of the written examination will depend not only on your field of study, but on your particular research interests and academic needs. Think of it as a test particularly tailored to you. The written examination, sometimes called the \"prelim,\" will typically be submitted to the department chair by your major professor, then administered to you toward the end of your second year of classes. When you pass the exam, you'll be considered \"Post-Prelim\" and may begin the process of completing your dissertation. [9] X Research source"
    },
    {
      "title": "Begin performing research and collecting data.",
      "content": "Begin performing research and collecting data. The goal of the PhD is to complete independent research. It's your first chance to be an academic pioneer, exploring an untapped field, researching new layers of a particular topic, and putting your stamp on the conversation happening in your field. It's also a great opportunity to get deep into a topic that excites and interests you. Choose a research topic that gives you genuine pleasure, and choose something that you're willing to spend several years exploring. Start with a research question. A research question is what you'll hope to answer over the course of your dissertation research. It needs to be narrow, but with broad-reaching implications. A starting research question might be something like, \"How are women represented during the silver age of American comic book publishing?\" or \"What are the implications of spontaneous genetic mutation during breeding in drosophila, and what effect might this have on cancer research?\""
    },
    {
      "title": "Explore the literature in your research field.",
      "content": "Explore the literature in your research field. A large part of your research process should be devoted to exploring the conversation that's already happened around your topic. You need to perform literature reviews to find out what experiments have been performed breeding drosophilae, and what has been written about women in silver age comics. Find an unexplored angle or aspect of the research."
    },
    {
      "title": "Perform your own experiments.",
      "content": "Perform your own experiments. When you find out that, despite the interesting observations of some researchers, a compelling connection doesn't exist yet between drosophilae and on-going attempts to mutate cancer cells, you may well have found an avenue for your experiments. If the critical literature is significantly silent on the topic of Wonder Woman, you've got something to write about. As you complete your coursework and add complexity to the topic in which you're interested, you'll likely change and add depth to your initial research interest. That's fine. Let the research grow your understanding of the topic, and change the way you approach it. That means you're on the right track."
    },
    {
      "title": "Prepare a doctoral dissertation/thesis",
      "content": "Prepare a doctoral dissertation/thesis . Your doctoral dissertation is the written culmination of your research interests, to be completed over the course of multiple research semesters. The dissertation should provide the answer to the research question you set out to explore. These are typically book-length projects that will need to be submitted to your committee, defended orally, and approved to be awarded your doctorate. In the humanities , several semesters following your coursework and preliminary examination will be devoted to completing the research involved with your interests. During this time, you'll be expected to periodically update your committee on your progress, providing them with literature reviews and outlines, depending on your arrangement. You may also be expected to publish supplementary papers periodically in academic journals. In the sciences , you'll spend your post-prelim semesters doing lab work, or other field work depending on your field of study. The time will be spent collecting data and performing experiments to move your research forward, to be collected in the dissertation, and probably published in peer-reviewed journals."
    },
    {
      "title": "Prepare for the oral defense of your dissertation",
      "content": "Prepare for the oral defense of your dissertation . After you've written and submitted a dissertation to your committee, you'll be expected to defend it in a semi-public forum. This usually takes the form of an interview-style question-and-answer session, though you'll generally be privy to the questions your committee will ask. [10] X Research source Most \"defenses\" are cordial affairs, not debates, though you should expect to be pressed and argued with regarding your methods, your conclusions, and other aspects of your work. The best way to prepare for your defense is to know your dissertation and your research inside and out. At a successful defense, you'll need to present yourself and your work well both orally and in writing to earn recognition as a PhD candidate and a researcher. Practice delivering your main point quickly and your overall presentation or paper with confidence."
    },
    {
      "title": "Apply for departmental grants or additional appointments.",
      "content": "Apply for departmental grants or additional appointments. Many PhD programs will fully fund every student admitted into the program, through some combination of teaching responsibilities or research assistance completed in conjunction with the coursework. \"Full funding\" means that any tuition fees will be waived, and you'll be awarded a stipend to cover your living expenses, anywhere between $13,000 and $30,000, depending on the location of the school and the nature of the program. Other programs assist students on a case-by-case level, meaning that you'll need to take funding into your own hands and make sure that your place in the department is financially secure. [11] X Research source In the hard sciences , money is allocated to provide different labs, projects, and individuals money on a competitive case-by-case basis. To apply, you'll typically write a detailed proposal of your research goals and submit it to the department. In the humanities , it's also common to seek subsequent teaching appointments in tangential fields: if your research involves the representation of women in comic books, and you've been teaching in the English department, why not pick up a special-topics course in Women's Studies?"
    },
    {
      "title": "Apply for private research grants.",
      "content": "Apply for private research grants. Most departments acquire funding from a variety of sources, public and private, and it's common to bypass the department and go outside if you've got a particularly-attractive research topic. The Whitehall Foundation commonly provides research grants to scientists, while the NEA and the Poetry Foundation offer a variety of grant funds to artists and writers. Talk to your major professor about applying for private money."
    },
    {
      "title": "Consider crowd-funding options.",
      "content": "Consider crowd-funding options. Increasingly, academics are taking their projects to the people, especially for innovative research topics. If you're pioneering a new approach to artificial intelligence, or another flashy topic that'll look good in a 2 minute video, start a kickstarter, Rockethub, or Petridish.org profile to take your research to the people and work outside the institution."
    },
    {
      "title": "Balance your budget.",
      "content": "Balance your budget. While getting $13,000 dollars for attending school may sound like a lot of money, keep in mind that you'll probably be working in excess of 40 hours a week, attending courses full time, and covering your own rent, food costs, and other expenses. Likewise, many PhD programs only fund during the school year, making part-time employment a common occurrence among PhD students, especially during the summer months."
    },
    {
      "title": "Avoid petty competition and departmental rivalry.",
      "content": "Avoid petty competition and departmental rivalry. Academic departments can be competitive and cut-throat environments. With everyone competing for the same grants, awards, and respect, it can get ugly fast. Try your best to stay out of departmental politics, and make an active effort to reach out to others and collaborate. Put your head down and do your work. No matter how smart you may be, how great a teacher, or researcher, you will need the help of others in your research."
    },
    {
      "title": "Balance teaching responsibilities with research and coursework.",
      "content": "Balance teaching responsibilities with research and coursework. While your research and dissertation are your primary focus during your doctoral studies, make sure you've developed a healthy balance between all your responsibilities. If you've never taught before, it can be difficult to find the time to spend on completing the research you want to complete, when you've got a stack of fifty papers to grade, lesson plans to prepare, and a student in tears at your office door. Don't Try to do everything at once. Because you will spend several years to earn your doctorate, it's important to slow down and do everything with the attention to detail the process deserves. You don't want to get your dissertation hung up because of a silly documentation error you rushed through."
    },
    {
      "title": "Be tenacious and display initiative.",
      "content": "Be tenacious and display initiative. The average PhD takes between 5 and 10 years to complete. You have to be prepared to commit the time and energy, throwing yourself into the deep end of the academic pool. It's not something to rush through, but it is your chance to put your stamp on the field that's captivated you. During the time you spend working on your doctorate, you'll face a variety of challenges. The lab's funding may be cut. You may lose grant money. Your paper may get rejected from a conference. Fail early and fail often. Create opportunities for yourself and work around the challenges."
    },
    {
      "title": "Stay organized.",
      "content": "Stay organized. Despite the reputation of academics as absent-minded Professors, getting a PhD takes an ordered mind. Learn to prioritize tasks and relegate less-critical chores until later. Do one thing at a time. Break large jobs down into smaller manageable tasks that you can complete and move on."
    }
  ]
}