{
  "url": "https://www.wikihow.com/Make-a-Heating-Pad",
  "title": "How to Make a Heating Pad",
  "steps": [
    {
      "title": "Fill an old sock with uncooked rice.",
      "content": "Fill an old sock with uncooked rice. This is the simplest method for a reusable rice-filled heating pad. It just requires an old sock, some rice, a microwave, and something to tie or sew the sock shut. First of all, get hold of a good-sized clean cotton sock that you won't miss, and then pour in the rice. There is no fixed amount of rice to use, but it is recommended that the sock be at least half or three-quarters full. Don't overfill it though. There should be a bit of flexibility so that the pad can rest comfortably on your skin. You want it to be able to mold itself to the shape of your body a little. Some alternative fillings to rice include corn, barley, oatmeal, and beans."
    },
    {
      "title": "Consider adding lavender oil to the rice.",
      "content": "Consider adding lavender oil to the rice. If you are making a heating pad to try to soothe your headaches, try adding some herbal ingredients. The most commonly cited extra ingredient is lavender oil. Simply mix in a few drops, 4 to 6, of lavender oil in with your rice. [1] X Research source It's best to mix this in before you put the rice in the sock. Other suggestions for additions include dried herbs like marjoram, rose petals, and rosemary."
    },
    {
      "title": "Tie or sew the sock shut.",
      "content": "Tie or sew the sock shut. Once you have added the rice, secure it by closing up the sock. For those that are handy with a needle and thread, sew the open end of the sock closed with a basic stitch. If you’re not hand with a needle, simply tie off the end of the sock with a knot. [2] X Research source If you tie the sock, make sure to tie it as close to the end of the sock and as tightly as possible."
    },
    {
      "title": "Heat the sock heating pad up in the microwave.",
      "content": "Heat the sock heating pad up in the microwave. Now that you have made your rice sock, all that’s left to do is heat it up in the microwave. Simply put your secured sock in the microwave and heat it up. How long you put it in will depend on the size of the sock and the amount of rice you have used. [3] X Research source One and a half to 2 minutes is usually long enough. Keep an eye on your sock while it’s in the microwave, and never leave it unattended. As a safety precaution, if you’ve added dried herbs, put a cup of water alongside the sock."
    },
    {
      "title": "Grab a zip-lock freezer bag and uncooked rice.",
      "content": "Grab a zip-lock freezer bag and uncooked rice. This is a very quick and easy way to make a heating pad. All you need is a zip-lock freezer bag and some uncooked rice. Make sure the freezer bag is microwave-safe; if it’s not, it'll melt and smoke when heated. If you have just found a freezer bag around the kitchen and aren't sure if it's microwave-safe, don't use it. Look at the bag’s packaging or box. If it says “microwave-safe” anywhere on the label, it’s okay to use."
    },
    {
      "title": "Pour rice into the bag.",
      "content": "Pour rice into the bag. Once you are certain you have a bag you can use in the microwave, pour in some rice. Fill the bag so that it is about ¾ full with uncooked rice, and then squeeze the top seal closed. Push all of the air out of the bag before sealing it shut."
    },
    {
      "title": "Heat the filled bag in the microwave and wrap it in a cloth.",
      "content": "Heat the filled bag in the microwave and wrap it in a cloth. Pop the bag in the microwave for 1 minute, adding 30 to 60 more seconds if necessary. Once it is heated up, take it out of the microwave and wrap it in a hand towel or other piece of insulating fabric (such as a washcloth or rag). This way, you can place the heating pad on your body without burning yourself. [4] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Choose a piece of fabric for your heating pad.",
      "content": "Choose a piece of fabric for your heating pad. Any design of fabric will work for your heating pad, but it’s best to use cotton fabric, such as a T-shirt or a pillowcase, because cotton can withstand high heats. Ask yourself if what you have chosen would handle being ironed on a high heat. If it can, you’re good to go! If not, it may be best to choose something else."
    },
    {
      "title": "Cut your chosen fabric to size.",
      "content": "Cut your chosen fabric to size. In theory, you could make your heating pad in whatever size or shape you like, providing it will fit in the microwave when you're done. The obvious shape to use would be a rectangle, but the same basic methods apply to whichever shape you opt for. Cut 2 pieces of fabric to your desired shape that are the same size. [5] X Research source If you’re making a rectangular heating pad, use a book that’s the same size as your desired design as a template. If you’re making a circle, use a plate. Try using a sleeve from an old shirt if you don’t feel like finding or shaping the fabric yourself. [6] X Research source"
    },
    {
      "title": "Pin the 2 pieces of fabric together.",
      "content": "Pin the 2 pieces of fabric together. Once you have 2 equal shaped pieces of fabric, pin them together in preparation for sewing. Have the side of the fabric you want to be displayed on the finished article facing inward. When you sew it together, it will be inside out. Having the fabric inside out will hide the stitching and make the project look neater."
    },
    {
      "title": "Sew along the edges of the fabric.",
      "content": "Sew along the edges of the fabric. Sew the 2 pieces of fabric together using a machine or by hand, whichever is best for you. Stitch along the sides and leave a gap of an 1 in (2.5 cm) or 2 in (5.1 cm) on 1 side. This gap will help you turn the fabric right way out, and give you space to add the rice. [7] X Research source"
    },
    {
      "title": "Turn the fabric right way out.",
      "content": "Turn the fabric right way out. Push the fabric through the gap between your stitching to turn it the right way out. This might be a bit tricky, so be careful, especially if your stitches aren’t tight. Now the desired design or pattern on your heating pad is facing outward."
    },
    {
      "title": "Pour the rice into the fabric sack and sew it shut.",
      "content": "Pour the rice into the fabric sack and sew it shut. Fill the sack of fabric with rice until it’s about ¾ full. It might be helpful to use a funnel to get the rice in, especially if the hole is small. Once filled, go ahead and sew the gap shut. [8] X Research source With the bag full of rice, it may be tricky to maneuver with a sewing machine, so it might be easier to sew the final edge by hand."
    },
    {
      "title": "Use your heating pad for lower back pain.",
      "content": "Use your heating pad for lower back pain. There is some evidence that adding heat to your lower back can help relieve pain there, as heat can release tension in muscles. To use your heating pad for this, simply lay it on your lower back (or any part of your back that’s sore). Leave it there for 15 to 20 minutes. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use your heating pad for headaches.",
      "content": "Use your heating pad for headaches. Heating pads can also be used to alleviate headache and migraine pain. The heat relaxes tense muscles, which can ease the pain in your head. Just place the pad on your head or neck to feel the benefits. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use your heating pad for other aches and pains.",
      "content": "Use your heating pad for other aches and pains. The heat from a heating pad relaxes muscles, so use it to relieve pain anywhere on your body. Place the pad where you feel discomfort, aches, or tension. Homemade pads like this are often used to ease tense neck and shoulder muscles, back pain, and period cramps. [11] X Research source"
    },
    {
      "title": "Consider using your heating pad as a cold press.",
      "content": "Consider using your heating pad as a cold press. Believe it or not, you can also use the same heating pad as a cold compress simply by cooling it in the freezer. Cold compresses help relieve muscle pain caused by inflammation, so place it on aching joints or swelling injuries. [12] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If you are using the plastic bag method, be sure to wrap it in a towel before applying it to your skin."
    }
  ]
}