{
  "url": "https://www.wikihow.com/Know-if-You-Are-in-the-Friend-Zone",
  "title": "How to Know if You Are in the Friend Zone",
  "steps": [
    {
      "title": "See if you are the person your crush turns to you to talk about their problems.",
      "content": "See if you are the person your crush turns to you to talk about their problems. If you are your crush's go-to person whenever something goes wrong, then you may be in the Friend Zone. If your crush likes you back, then there will sometimes be an element of mystery in your relationship, and also an element of excitement. If your crush tells you every little thing on their mind or every little problem they have, then your crush isn't trying to impress you or cover things up, and this is probably because they see you as a friend. If your crush says something like, \"I wanted to call you the second this happened,\" or \"Your opinion means so much to me\" or \"I'm so glad I can count on you,\" these are all signs that they think of you as a really good friend."
    },
    {
      "title": "See if your crush tells you about other people they like.",
      "content": "See if your crush tells you about other people they like. This is a dead giveaway that the person only sees you as a friend. If your crush goes on and on about how much he likes his cute coworker or how much she wants a new girl in school to ask her out, then you are definitely in the Friend Zone. If the person asks you for advice again and again and never once thinks that you might be interested, then you are definitely in the Friend Zone. If your crush talks to you about other romantic opportunities, then you are probably in the Friend Zone. However, if you hear them saying things like, \"None of the guys in my class are as good as you...\" Or, \"I just feel like I'll never find the right person...\" then this may be a hint that you're the one. Some people tend to treat their crushes like really good friends. This indicates a level of trust which is healthy in both romantic and platonic relationships."
    },
    {
      "title": "See if your crush has friendly nicknames for you.",
      "content": "See if your crush has friendly nicknames for you. If your crush likes to pal around with you and gives you cute but corny nicknames, such as \"Buddy,\" \"Brother,\" \"Sister,\" \"Champ,\" \"Slugger,\" or \"Kiddo,\" then yeah, you won't be feeling the love any time soon. This doesn't mean that the person will never be able to see you romantically, but that, right now, you are firmly entrenched in the Friend Zone. [1] X Research source"
    },
    {
      "title": "See if you end up consoling your crush through a break-up.",
      "content": "See if you end up consoling your crush through a break-up. This is another red flag that you are absolutely in the Friend Zone. If the person you like just got dumped and you're the one consoling him with a tub of ice cream and a Love Actually DVD, then you are deeply entrenched in the Friend Zone. If you're the one saying things like, \"You can do so much better...\" and \"How could anyone not want to be with you?\" then you are definitely just a friend. If your crush really opens up to you and lets you see them during such a vulnerable time, then you are probably just a friend."
    },
    {
      "title": "See if your crush is comfortable dressing around you.",
      "content": "See if your crush is comfortable dressing around you. If they dress in front of you without any romantic undertones, they are probably not attracted to you and may assume you are not at all attracted to them. If you're heading to the pool together, at the beach together, or just hanging out, and your crush does this without thinking twice, then you may be in the Friend Zone. [2] X Research source If your crush changes around you or wears more revealing clothes around you, like if you're at the beach, pay attention to how they act when this happens. Does the guy you like look down at his chest when he takes his shirt off? Does the girl you like nervously adjust her swimsuit when you're at the beach together? If so, then they may be feeling a bit self-conscious in your presence."
    },
    {
      "title": "Consider whether you've ever shared a bed without taking part in any cuddling or holding hands.",
      "content": "Consider whether you've ever shared a bed without taking part in any cuddling or holding hands . This is friend, or even sibling, behavior. If you find yourself in the same bed with your crush and you're on opposite ends, or perfectly comfortable splaying out on the bed, then you are in the Friend Zone. Though this may not happen too often, it's an opportunity to see where your relationship really stands. If your crush wears dorky pajamas or their retainer, then it's even more likely that you're in the Friend Zone. If your crush seems to have no incentive to look sexy around you, then it's most likely because they only see you as a friend."
    },
    {
      "title": "Consider whether they have told their family about you.",
      "content": "Consider whether they have told their family about you. If the family asks why you two haven't started a relationship, you are probably in the Friend Zone, because you are a couple in every way except romantically and sexually. If your crush has special feelings for you, then having you meet their family would be considered a big deal. Of course, you should keep in mind that feelings do change. Maybe you met your crush's family a long time ago, and they've only just now started having feelings for you."
    },
    {
      "title": "See if your crush is perfectly comfortable around you.",
      "content": "See if your crush is perfectly comfortable around you. This is another sign that you are in the Friend Zone. If your relationship is romantic, then your crush will be nervous around you, at least to an extent. They will fidget occasionally, laugh when nothing is funny, or go out of their way to impress you. If your crush only sees you as a friend, then they won't care about their appearance or about how they come off. If you never detect any nervousness, preening, or worry whatsoever when you're together, then you are probably just a friend. If your crush says anything without censoring themself, backtracking, or wondering how they come off, then you are most likely just friends. Check out how your crush dresses when you hang out. If you get the sense that they haven't tried to look nice, wear makeup, or put on cute clothes around you, then it could be that they think of you as just being friends."
    },
    {
      "title": "See if your crush tries to set you up with other people.",
      "content": "See if your crush tries to set you up with other people. This is another dead giveaway that you're in the Friend Zone. If the girl you like is always telling you about the cute girl in her math class or her cute second cousin that you'd be perfect for, then this is a big red flag. It's even worse if you show up to hang out with her and she brings along a random girlfriend, clearly with the intention of setting the two of you up together. Think about it: if your crush liked you back, why would they try to set you up with someone else? This may even be the person's way of hinting that you should direct your romantic feelings elsewhere."
    },
    {
      "title": "See if you always end up doing what your crush wants to do.",
      "content": "See if you always end up doing what your crush wants to do. If the boy you like really likes you, then he'll go out of his way to do the things you want to do, whether it's going hiking or watching a baseball game. But if you always get roped in to going shopping, getting ice cream, or doing other things that he wants to do, then it may be because he doesn't care about impressing you. Ask yourself when the last time was that you got your crush to do something that you actually wanted to do. This is especially true if you always end up shopping with the person you like. If he's asking you what he should wear or how he looks in a certain outfit, then maybe it's because he doesn't think of you as dating material."
    },
    {
      "title": "See if you and your crush make physical contact a lot.",
      "content": "See if you and your crush make physical contact a lot. If the person you like returns your romantic feelings, then you'll probably be touching each other a fair amount, whether you're playfully hitting each other or finding other excuses to graze arms or fingers. If you never end up touching each other, even when it's easy to do so, such as when you're sharing the same menu, then it may be because your crush just doesn't think of you that way. However, if you like a guy who treats you like one of the bros, then there may be a fair amount of touching. Try to see if it's just friendly or something more. You can even test this out by finding an excuse to lightly graze your crush's arm or to playfully shove them just to see if they respond."
    },
    {
      "title": "See if you do favors for your crush.",
      "content": "See if you do favors for your crush. If you find yourself walking your crush's dog, picking up lunch for her when she's having a busy day, or giving him a ride to school, then your relationship is probably not romantic. If you're already an errand runner for this person, then you are definitely not on your way to dating. If your crush had romantic feelings for you, then they wouldn't ask you to help them out in non-romantic ways all the time."
    },
    {
      "title": "See if your crush always ends up inviting other people out when you're together.",
      "content": "See if your crush always ends up inviting other people out when you're together. [3] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 11 February 2020. If you're always trying to get your crush alone so you can turn your relationship into something more, while she always ends up inviting the whole gang, her three siblings, her random neighbors, and anyone else in the same city, then it's a sign that your crush does not see you taking your relationship to a romantic level. This doesn't mean that it will never happen, but it does mean that, for now, your relationship is not in a romantic place. [4] X Research source If your crush sees you as a romantic prospect, then they would be looking for excuses to be alone with you, not trying to make it so you're never alone together. [5] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 11 February 2020."
    }
  ]
}