{
  "url": "https://www.wikihow.com/Knit-an-Infinity-Scarf",
  "title": "How to Knit an Infinity Scarf",
  "steps": [
    {
      "title": "Cast on 60 sts.",
      "content": "Cast on 60 sts."
    },
    {
      "title": "K 2 P 2 across the row.",
      "content": "K 2 P 2 across the row."
    },
    {
      "title": "Repeat the row until the scarf measures at least 180 cm/70 inches.",
      "content": "Repeat the row until the scarf measures at least 180 cm/70 inches. You can also make it shorter if wished, a suggested shorter length would be 95cm/37 inches. You can make it longer but remember that this is bulk hanging around your neck!"
    },
    {
      "title": "Cast off loosely in rib, twisting as you end the knit.",
      "content": "Cast off loosely in rib, twisting as you end the knit. (Rib = K 1, P 1 to end of row.)"
    },
    {
      "title": "Bind off the stitches.",
      "content": "Bind off the stitches. Line up the cast-on edge with the cast-off edge and sew the ends together, turning the ends inward as you stitch. Some people recommend twisting one end before sewing together, to create the infinity twist. It's up to you, as in putting the scarf on, you'll be twisting it anyway."
    },
    {
      "title": "Done.",
      "content": "Done."
    },
    {
      "title": "Use a very long circular needle.",
      "content": "Use a very long circular needle. If you use a small one, you'll only knit enough to make a cowl, which is a short infinity scarf but you won't be able to wrap it again and again. The needle size should be at least 4mm/6 US and above."
    },
    {
      "title": "Choose the stitch and pattern of your preference.",
      "content": "Choose the stitch and pattern of your preference. Knit stitch works well for beginners––knit even rows, purl odd rows. You can vary the number of rows as you go."
    },
    {
      "title": "Choose the scarf length.",
      "content": "Choose the scarf length. You'll need to gauge the final length from the stitch used by making a sample piece of about 15 stitches and measuring its gauge. This tells you how many stitches fit for each 5cm/2 inches, allowing you to calculate the final length desired."
    },
    {
      "title": "Cast on.",
      "content": "Cast on. Using your calculation from the previous step, cast the number of stitches needed for the required length. Then connect the beginning and end of the row and start knitting in circles."
    },
    {
      "title": "Knit around and around.",
      "content": "Knit around and around."
    },
    {
      "title": "Continue knitting until it reaches the height you'd like.",
      "content": "Continue knitting until it reaches the height you'd like. Then cast off and the infinity scarf is complete."
    },
    {
      "title": "Use the 2.25mm (1 US) needles first.",
      "content": "Use the 2.25mm (1 US) needles first. Cast on 152 sts on 3 (2 or 3 US) needles (50-50-52). Join; do not twist the sts. Work 3.8cm/1 1/2 inches in rounds of K 2, P 2 rib."
    },
    {
      "title": "Change to the 3mm (2 or 3 US) needles.",
      "content": "Change to the 3mm (2 or 3 US) needles. Knit the pattern as follows: 1st round : Knit 2nd round : Knit 3rd round : Knit 4th round : Purl 5th round : Knit 6th round : Purl 7th round : Knit 8th round : Purl."
    },
    {
      "title": "These 8 rounds form the pattern.",
      "content": "These 8 rounds form the pattern. Repeat 13 times more, making a total of 14 patterns."
    },
    {
      "title": "Change back to the 2.25mm (1 US) needles.",
      "content": "Change back to the 2.25mm (1 US) needles. Work in 3.8cm/1 1/2 inches in K 2, P 2 rib."
    },
    {
      "title": "Cast off loosely in rib.",
      "content": "Cast off loosely in rib."
    },
    {
      "title": "Darn the ends in neatly.",
      "content": "Darn the ends in neatly. The cowl is completed! Try it on for size."
    },
    {
      "title": "Choose a pattern.",
      "content": "Choose a pattern. An infinity scarf can be made from many existing scarf patterns, provided the length is long and the style stays rectangular. It should also be of a decent width. Experiment to see what will allow the final scarf to hang nicely."
    },
    {
      "title": "Knit the pattern.",
      "content": "Knit the pattern."
    },
    {
      "title": "Stitch the ends together when done, to create a loop.",
      "content": "Stitch the ends together when done, to create a loop. One infinity scarf from your favorite pattern!"
    }
  ]
}