{
  "url": "https://www.wikihow.com/Know-if-You-Have-a-Cavity",
  "title": "How to Know if You Have a Cavity",
  "steps": [
    {
      "title": "Know that cavities are holes in your teeth.",
      "content": "Know that cavities are holes in your teeth. These can be visible, but they may not be. These holes in your teeth are caused by tooth decay. Untreated, they can cause a great deal as pain as well as damage to your teeth, bones, gums, and even make you very ill. If they become infected, you will need to seek medical attention to prevent abscesses and the spread of infection. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Remember that a cavity is permanent damage.",
      "content": "Remember that a cavity is permanent damage. While there are ways to treat cavities, there is not a way to restore the natural tooth substance. A dentist can drill out the damaged areas and fill them with a safe material. You won't get that part of your tooth back. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Manage underlying causes.",
      "content": "Manage underlying causes. Poor oral hygiene, poor diet, and bad habits such as smoking can all contribute to tooth decay. By limiting or eliminating these problems, you can help to reduce tooth decay. This will help to prevent cavities, as well as promote good oral health overall. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Know that cavities may or may not have clear symptoms.",
      "content": "Know that cavities may or may not have clear symptoms. There are not always obvious external signs that someone has a cavity. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Because of this, a dentist may be the first person to notice. Because cavities can lead to further damage, it is important to see a dentist regularly to prevent cavities from going unnoticed. Go for a dental check up every six months and allow your dentist to see any changes. Some patients may have a mineralization defect of the enamel which allows cavities to form faster."
    },
    {
      "title": "Note pain.",
      "content": "Note pain. This could be a sign you have a cavity. Toothaches; tooth sensitivity; mild to sharp pain when eating or drinking something sweet, hot, or cold; pain when you bite down — all these may be a the sign of a cavity. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you are experiencing these things consistently, you should seek an oral health care professional."
    },
    {
      "title": "Look at your teeth.",
      "content": "Look at your teeth. Visible holes or pits in your teeth, brown, black or white staining on any surface of a tooth can all be indications of a cavity; [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source however, because everyone's mouth is different, it can be difficult to know. A dentist and other oral doctors are the people who are properly qualified to diagnose the problem and identify the stage of cavity development. If you think you see a cavity, you should get it checked out."
    },
    {
      "title": "Find a dentist.",
      "content": "Find a dentist. Talk to people you trust or go online to find a good dentist. Referrals from friends or families will ensure you can trust your experience. Because you are not likely to be qualified to determine if you indeed have a cavity, you will need a dentist to do this. Make sure you get it checked out so as to avoid more damage to your teeth. [9] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020."
    },
    {
      "title": "Tell your dentist about the problem area.",
      "content": "Tell your dentist about the problem area. This will help them to focus on those spots. If the cause of your worry or discomfort is not a cavity, the dentist may still be able to help. Try to be as specific as you can be and explain when and how you feel the pain. Let your dentist know if your feel sharp pain while they are examining your teeth."
    },
    {
      "title": "Get your teeth probed.",
      "content": "Get your teeth probed. This physical probing of your teeth will enable the dentist to tell if you have a cavity. They will poke and prod in different locations to test the strength and damage at any spot. Make sure your dentist does a thorough examination on any tooth that gives you problems. This may reveal cavities or other issues. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Have an x-ray taken.",
      "content": "Have an x-ray taken. When cavities form between your teeth, it is not always easy to tell they are there. In these situations, a dentist cannot probe with a dental tool. They will not fit between your teeth. In this case, a dentist can take an x-ray to reveal the presence of any cavities. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you feel that you have a cavity, you may wish to have your dentist take an x-ray to find out the extent of the damage."
    }
  ]
}