{
  "url": "https://www.wikihow.com/Make-Difficult-Decisions",
  "title": "How to Make Difficult Decisions",
  "steps": [
    {
      "title": "Recognize why some choices are hard.",
      "content": "Recognize why some choices are hard. With easy decisions, we generally are able to pick out one alternative or another. You had the turkey club yesterday, so, perhaps, the egg salad is more appealing today. With tough choices, on the other hand, the alternatives are related. Both are better in some ways, but neither is significantly better than the other. [1] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For example, if you are trying to decide between psychology and business as a college major, you might think about your career prospects for both. Maybe business offers you greater flexibility but psychology interests you more. Neither choice is better overall, which is why choosing is slightly complicated."
    },
    {
      "title": "Reign in your emotions",
      "content": "Reign in your emotions . Making a tough decision in the heat of the moment can lead to catastrophic results. If you are feeling hijacked by your emotions, you may want to delay decision-making until you can get a handle on what you’re feeling. [2] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. One suggestion for managing emotions is to stop, drop and process: Stop. If you notice your heart beating fast, your shoulders feeling heavy, or any physical signs of strong emotions, pay attention to these signs. Don’t make any tough decisions until you can gain control of your feelings. Drop. When strong emotions are interfering with your ability to make a difficult decision, drop whatever you’re doing and take a mental break. Practice deep breathing , go for a walk outside, or engage in a hobby or other activity that calms you. Process. Once you get a handle on the emotion affecting you, strive to understand it. Identify the name of the emotion (i.e. anger, fear, disappointment, worry, etc.). Think about why you are feeling this way. Getting a clue about strong emotional states could guide you in your future decision-making. For example, if you feel anger about having to make a decision, you may only be making this choice out of duty to someone else – not for yourself."
    },
    {
      "title": "Sleep on it.",
      "content": "Sleep on it. You may have heard this advice before and have no idea how sleeping can help you make a tough decision. Research suggests that a process of unconscious thought might assist us in decision-making, while removing any preconceptions or biases from the equation. What’s more, getting inadequate sleep can deter your ability to make good decisions as sleep deficiencies impact healthy brain functioning. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Therefore, squeezing in some shut eye can benefit your choice on several fronts."
    },
    {
      "title": "Release your fear of mistakes.",
      "content": "Release your fear of mistakes. If you are a perfectionist, you may have extreme difficulty making big decisions. Perfectionism involves distorted beliefs about making mistakes. [4] X Research source Follow this process to overcome your fear: Consider what you are thinking about this decision. Perhaps, you worry that if you make a bad choice about your major, your career, and life, will be ruined. Assess whether your thinking is realistic. Rather than assuming what you’re thinking is a fact, question the evidence surrounding it. Have you seen people successfully change majors or careers? Were their lives ruined due to the mistake? Ask yourself “what’s the worst that can happen”? Once you consider this, question whether you can deal with this reality."
    },
    {
      "title": "Limit your options.",
      "content": "Limit your options. When it comes to making tough decisions, too many options can lead to analysis paralysis. When you have an array of options you feel the need to carefully consider every possible alternative. You think that if you consider all the variables, your chances of making a mistake or facing uncertainty are reduced. In reality, more variables means more reasons to delay making a choice. Try to reduce your choices to five or fewer options to expedite your decision-making. A study conducted at Columbia Business School examined two separate jam displays: a table with 24 jams versus one with only 6. In the end, while a larger crowd was attracted to the table with a greater variety, more purchases were made at the table with fewer options. [5] X Research source"
    },
    {
      "title": "Gather information.",
      "content": "Gather information. Once you’ve narrowed down your choices to as few options as possible, search for new information to help you further evaluate each option. [6] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source For example, if your biggest concern about picking a college major is overall satisfaction within the career field, you might research or go interview people who are working in each area. Strive to obtain all the useful information you can in helping guide your decision."
    },
    {
      "title": "Consider the consequences.",
      "content": "Consider the consequences. [7] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source Another aspect of weighing the options is thinking about what could go right or wrong. Get two sheets of paper and a pen. Write out each of your options and then list positive and negative consequences on their respective pages. Doing this can help you to further narrow down your options and get an objective glance at your choice. Consider the benefits of each choice. Consider the downsides of each choice. Look at the big picture. [8] X Research source Ask yourself how each choice will fit into your current or future plans."
    },
    {
      "title": "Talk it over with a trusted advisor.",
      "content": "Talk it over with a trusted advisor. Get in contact with a reliable and impartial friend or acquaintance who can help you sort through the variables of this decision. Discussing the matter with someone you trust may help your ideas out of your head. This person may even think of pros or cons that you have not yet considered."
    },
    {
      "title": "Reflect on past decisions.",
      "content": "Reflect on past decisions. Before you act on this new decision, take time to recount previous choices you have made. Apply critical thinking skills to past decisions to objectively decide was effective or ineffective about your previous choices. Using critical thinking skills while making one decision can transfer into new ones, helping you to become an overall better decision maker. [9] X Research source Taking the time to reflect on your previous decisions can have astounding effects on your well-being. Research shows that people who engage in thoughtfully reflective decision making (TDRM) have a greater likelihood of enrolling in and graduating college, being in good physical health, being involved in community advancement opportunities, and less likely to be criminal offenders. [10] X Research source"
    },
    {
      "title": "Align your actions with your personal values.",
      "content": "Align your actions with your personal values . When you have a strong foundation of values, you can rest with the knowledge that whatever choice you make is meeting your ultimate objective or purpose. Think about what you value most in life. Is it compassion? Self-improvement? Family? [11] X Research source Prioritize any decisions so that they complement your personal values. For example, if you prioritize compassion and self-improvement, you might choose to study psychology so that you can compassionately help people suffering from mental illness lead fulfilling lives. If you are having trouble identifying your personal values, take the free Personal Values Assessment. [12] X Research source"
    },
    {
      "title": "Envision what each choice will feel like.",
      "content": "Envision what each choice will feel like. Another way to consider the long-term aspects of making a tough decision is to visualize that you have already made it. [13] X Research source Close your eyes and imagine that the decision is made. How do you feel about the result? Pretending that you have already decided can help you to know if your gut agrees with your choice. If imagining your choice leaves you with a sense of calm and relief, you may want to move forward with that choice. However, if your choice brings with it a feeling of doom or regret, you may need to go back to the drawing board and reconsider your options."
    }
  ]
}