{
  "url": "https://www.wikihow.com/Make-a-Candy-Lei",
  "title": "How to Make a Candy Lei",
  "steps": [
    {
      "title": "Roll out a piece of cellophane to 35 to 40 inches (88.9 to 101.6 centimeters) long.",
      "content": "Roll out a piece of cellophane to 35 to 40 inches (88.9 to 101.6 centimeters) long. and 6 inches (15.24 centimeters) wide. You can also use plastic wrap instead, but you will have to be extra-careful so that it doesn't fold in on itself or wrinkle. Clear cellophane would be best. If this is for a graduation ceremony, however, consider using one of the school colors instead."
    },
    {
      "title": "Arrange your candy down the center of the cellophane.",
      "content": "Arrange your candy down the center of the cellophane. [1] X Research source Leave about 1 inch (2.54 centimeters) of space between each candy bar. You should also leave about 1 inch (2.54 centimeters) of space between the first/last candy pieces and the short ends of the cellophane. Small candy bars, such as the kind sold during Halloween, work best for this. If you are using small candies, such as Hershey's Kisses or Starburst, you can pile them in groups of 3 to 4. If you are using larger candy bars, arrange them in groups of one. [2] X Research source"
    },
    {
      "title": "Fold the cellophane onto the candy, then start to roll the candy towards the other end of the cellophane.",
      "content": "Fold the cellophane onto the candy, then start to roll the candy towards the other end of the cellophane. [3] X Research source Try to keep the 1-inch (2.54-centimeter) wide spaces between the candy. If you need to, use your finger to separate the candy after you have finished rolling it up in the cellophane."
    },
    {
      "title": "Cut 6 to 8-inch (15.24 to 20.32-centimeter) long pieces of curling ribbon.",
      "content": "Cut 6 to 8-inch (15.24 to 20.32-centimeter) long pieces of curling ribbon. [4] X Research source You can also use satin ribbon or sheer ribbon instead. If this is for graduation, consider using the school's colors."
    },
    {
      "title": "Tie each ribbon around the space between the candy.",
      "content": "Tie each ribbon around the space between the candy. You can do a simple double-knot, or you can tie the ribbon into a fancy bow. If you are using curling ribbon, consider curling the ends. You can do this by pulling the ribbon between your thumb and the pair of scissors."
    },
    {
      "title": "Over lap the two ends of the lei, then tie a ribbon between the two candies.",
      "content": "Over lap the two ends of the lei, then tie a ribbon between the two candies. Be sure to tie the ribbon into a tight, double knot. If you want, you can tie the ends off into a bow, or curl them instead."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    },
    {
      "title": "Get some individually-wrapped candy.",
      "content": "Get some individually-wrapped candy. The candy that works best for this method are candies that are wrapped in cellophane, with the ends twisted shut. Great examples include Werthers, Jolly Ranchers, and saltwater taffy."
    },
    {
      "title": "Cut lots of 6-inch (15.25-centimeter) long pieces of curling ribbon.",
      "content": "Cut lots of 6-inch (15.25-centimeter) long pieces of curling ribbon. You can use just one color or lots of colors. If this is for a graduation ceremony, you could even use the school's colors. You will need one piece of ribbon for each candy. [5] X Research source"
    },
    {
      "title": "Tie a piece of 6-inch (15.25-centimeter) long curling ribbon to one end of the candy.",
      "content": "Tie a piece of 6-inch (15.25-centimeter) long curling ribbon to one end of the candy. Place a piece of ribbon behind the wrapper, right between the candy and the twisted part. Make sure that the ribbon is centered, then pull the ends of the ribbon towards you and tie it into a tight, double-knot."
    },
    {
      "title": "Keep tying the ribbon to the candy until you are all out of candy.",
      "content": "Keep tying the ribbon to the candy until you are all out of candy. Don't worry if the ribbon pieces look too long. You can always cut them down later."
    },
    {
      "title": "Cut a 42-inch (106.68-centimeter) long piece of 2-inch (5.08-centimeter) wide ribbon.",
      "content": "Cut a 42-inch (106.68-centimeter) long piece of 2-inch (5.08-centimeter) wide ribbon. The color of the ribbon does not matter, because it will be covered by candy in the end. It might be a good idea to use a color that matches your candy, however, in case there are any gaps. [6] X Research source"
    },
    {
      "title": "Start tying the candy to the 2-inch (5.08-centimeter) wide ribbon using tight, double-knots.",
      "content": "Start tying the candy to the 2-inch (5.08-centimeter) wide ribbon using tight, double-knots. Alternate the sides you tie the candy onto, and gently scrunch the candy together every so often. This will give you an extra-full lei. [7] X Research source Leave about 2 inches (5.08 centimeters) at each end of the ribbon so that you can tie it together. How full your lei turns out depends on how much candy you add. Consider tying a knot at the end of your 2-inch (5.08-centimeter) wide ribbon to keep the candy from sliding down while you work."
    },
    {
      "title": "Tie the ends of the wide ribbon together to form a loop.",
      "content": "Tie the ends of the wide ribbon together to form a loop. Be sure to use a tight, double-knot, and that there are no gaps between the knot and the candy."
    },
    {
      "title": "Consider trimming or curling the ends of the curling ribbon.",
      "content": "Consider trimming or curling the ends of the curling ribbon. You can leave the curling ribbon as they are, or you can trim them down. You can also curl them slightly by running them between your thumb and a pair of scissors."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}