{
  "url": "https://www.wikihow.com/High-Jump-Using-the-Fosbury-Flop",
  "title": "How to High Jump Using the Fosbury Flop",
  "steps": [
    {
      "title": "Learn the \"J\".",
      "content": "Learn the \"J\". The run-up to the bar is called a \"J\" because the athlete runs in the shape of a \"J\" as he/she approaches the bar. Run back 10 steps from the center of the bar in the shape of a \"J\": the hook part should be five steps, and the line should be three steps. If you are right-footed, you will run in from the left side of the pit, left-footed jumpers will come in from the other side. (This can be for starters. It is important to find what is comfortable for you to do, and which side is more convenient for you.) Run five steps forward in a straight line towards the pit. This will allow you to gain speed. Your next 3 steps will be curved to accelerate towards the pit and build torque (angular momentum). These steps should be run on a curve-- if you were to continue running these steps, you would eventually start running in circles. Instead, take three, which will simulate the circular motion and accelerate you towards the bar. The second-to-last step should be another quick step towards the bar. This is called the \"penultimate step.\" In this step, you should continue to drive your momentum forward and should still be standing tall as if you were a sprinter. Bring both hands back, locked at the elbows."
    },
    {
      "title": "Take off.",
      "content": "Take off. The last step, the \"ultimate step,\" is performed by making a quick step as if you were doing a lay-up in basketball. Point your non-takeoff foot toward the back-left corner of the pit (righties) or back-right hand corner of the pit (lefties). The short step will allow all that speed you acquired to be transferred into height. Using all your strength, drive your hands forward and up, and jump straight up as high as you can. When jumping, you will drive your take-off knee hard into the air to give you more height."
    },
    {
      "title": "Know how to move while in the air.",
      "content": "Know how to move while in the air. Drive your lead-arm up high; this will guide your body over the bar. Arch the arm so it is the first part of your body that is over the bar. Simultaneously, you must allow your body to turn because you have built up so much angular momentum; your body will turn as you are in the air. Control this speed and momentum and harness it when your body has turned 180 degrees and you are perpendicular with the bar. Once you are perpendicular with the bar, you will continue to rise until you reach your maximum height over the bar. Once this is accomplished, your body will start to glide into the bar (the momentum will push you forward even though you have only jumped straight up). Thrust your hips and tilt your head back. Now your body will be perpendicular with the bar and your body will be arched with your hips high in the air above your head and feet. Your head will be over the bar and your head on the way down towards the mat. Your hips will ideally be at their highest point as they travel over the bar, and your feet will be hanging with your knees locked and evenly spaced over the bar (looking at pictures of this will help). Kick your feet up and over the bar. By tucking your chin into your chest and concentrating, you will automatically bring your feet up and they will fly forward over the bar. Sometimes this takes practice and repetition but it is the easiest part of the flop to master. Land on your upper back or shoulders on the mat; your feet will land over your head."
    }
  ]
}