{
  "url": "https://www.wikihow.com/Heal-Piercings",
  "title": "How to Heal Piercings",
  "steps": [
    {
      "title": "Wash your hands before touching the pierced area.",
      "content": "Wash your hands before touching the pierced area. Use mild soap and clean water to scrub your hands clean. Rinse well with clean water before you're ready to touch your skin. Avoid letting anyone else touch your pierced area since they could introduce bacteria."
    },
    {
      "title": "Soak the area in saline for 5 to 10 minutes every day.",
      "content": "Soak the area in saline for 5 to 10 minutes every day. To keep the area clean, dip a clean gauze pad or paper towels into saline solution. Place the pad over the piercing and hold it there for 5 to 10 minutes. You can do this 1 to 2 times a day. Depending on the piercing, you may be able to dip the piercing directly into a cup of saline solution. For example, if you have a finger piercing, submerge your finger in the saline so the piercing is covered."
    },
    {
      "title": "Wash the piercing with soap and water if directed.",
      "content": "Wash the piercing with soap and water if directed. If your piercer tells you to clean the area with soapy water once a day, wash the skin around the piercing with a fragrance-free mild soap and water. Rinse the area with water to completely remove soapy residue. Avoid using soaps with scents, dyes, colors, or triclosan since these will irritate the skin. If the piercing is on your ear, remember to wash behind the piercing as well."
    },
    {
      "title": "Pat the area dry with a paper towel or napkin.",
      "content": "Pat the area dry with a paper towel or napkin. Take a clean paper towel or napkin and blot the cleaned skin. Don't apply too much pressure or rub the skin because you don't want to open the wound. Once you're done, throw the paper towel or napkin away. [1] X Research source Don't use cloth towels because they can become caught or snagged on the jewelry."
    },
    {
      "title": "Limit how often you clean the piercing to once or twice a day.",
      "content": "Limit how often you clean the piercing to once or twice a day. It might seem like a good idea to frequently clean the area throughout the day, but washing the skin too much can actually wear the tissue down. This will slow down the healing time. [2] X Research source Wash your piercing after you shower since water will already be getting around the site of the piercing."
    },
    {
      "title": "Leave any crusty scabs in place.",
      "content": "Leave any crusty scabs in place. Simply soaking the piercing with saline and washing it with gentle soap and water is enough to keep the skin clean. Don't pull or pick at any crusty scabs that form since this can open up the piercing and cause it to bleed. You'll find that the crusty material should fall off on its own as the piercing heals. [3] X Research source You don't need to turn or twist the jewelry as the piercing is healing. Rotating the jewelry may actually irritate the skin and slow the healing."
    },
    {
      "title": "Avoid using antibiotics or disinfectants on the piercing.",
      "content": "Avoid using antibiotics or disinfectants on the piercing. These may irritate the piercing as it's trying to heal. Antibacterial ointments can trap moisture and cause bacteria to grow around the piercing. Disinfectants such as rubbing alcohol or hydrogen peroxide can make it harder for the tissue to heal. [4] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Avoid using antibacterial soaps or disinfectants that container benzalkonium chloride (BZK)."
    },
    {
      "title": "Keep the piercing site clean and dry throughout the day.",
      "content": "Keep the piercing site clean and dry throughout the day. Ensure that other people don't touch the area. You'll also need to keep sweat and dirt out of the piercing. For example, don't put makeup or spray fragrances near the piercing. Clean items that might come into contact with the area so you don't introduce bacteria. [5] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Depending on where the piercing is located, clean your cell phone, headphones, glasses, or hats."
    },
    {
      "title": "Give the piercing time to heal before you take out the jewelry.",
      "content": "Give the piercing time to heal before you take out the jewelry. Most piercings will take at least a few weeks or even months to heal. Be patient and give the piercing a chance to heal before you take out the jewelry. Here are a few healing times for common types of piercings: [6] X Research source Earlobes: 3 to 9 weeks Ear cartilage (such as tragus, conch, industrial, rook, or orbital piercings): 6 to 12 months Nostril: 2 to 4 months Oral: 3 to 4 weeks Lips: 2 to 3 months Navel: 9 to 12 months Genitals: 4 to 10 weeks"
    },
    {
      "title": "Recognize signs of infection such as redness, swelling, or fever.",
      "content": "Recognize signs of infection such as redness, swelling, or fever. While it's normal to feel some pain around the site of the piercing, it's important to pay attention to signs of infection. In addition to pain that doesn't go away or gets worse when you touch the skin around the piercing, other signs of infection include: Yellow discharge, green discharge, or blood High fever Redness, swelling, or a hot sensation Persistent itchiness Bad odor"
    },
    {
      "title": "See your piercer as soon as you can.",
      "content": "See your piercer as soon as you can. Since an infection can become more serious, make an appointment to see the person who did your piercing as soon as possible. In many cases, they can suggest treatments that will resolve the issue without you having to visit the doctor. If your piercer thinks the infection is bad enough to need medical care, they’ll let you know. If you or your piercer suspects a severe infection, visit your doctor. The doctor or dermatologist will take your medical history, do a physical exam, and decide the best treatment for you. Don't be afraid to go to the emergency room if you think you have a severe cartilage infection. These are trickier to treat and can cause more complications than other piercings."
    },
    {
      "title": "Ask the doctor if you have a metal allergy.",
      "content": "Ask the doctor if you have a metal allergy. If you suspect that the infection was caused by an allergy to nickel, ask for an allergy skin test. The doctor or dermatologist will test a small patch of your skin to determine if you have a metal allergy. Nickel is the most common metal to cause a skin allergy that leads to infection. The doctor may recommend putting cortisone cream on the area and replacing the nickel jewelry with niobium, titanium, or gold. [7] X Research source If your allergic reaction is severe, you may have to remove the jewelry and let the hole close. Once the skin heals, you can re-pierce the site, but use a metal you’re not allergic to. Even jewelry that is labelled “hypoallergenic” can contain nickel or cause allergic reactions. You should also avoid stainless steel jewelry, which contains nickel."
    }
  ]
}