{
  "url": "https://www.wikihow.com/Grow-a-Van-Dyke-Beard",
  "title": "How to Grow a Van Dyke Beard",
  "steps": [
    {
      "title": "Start with a clean-shaven face.",
      "content": "Start with a clean-shaven face. Whether you’re a beard-styling expert or this is you're first time growing a beard, your face is your canvas - start fresh. Have a clean shave and then wait a week for your hair to even out. Your face is ready for the Van Dyke when your stubble has grown out to about ¼ inch. For some people it may take more than a week for the hair to grow back in. If you’re patient, you’ll be rewarded with a better-looking Van Dyke. If you’re reluctant to start from scratch, you can create the Van Dyke from facial hair that already exists. However, it’s much more difficult to control the final outcome when you aren’t working with fresh hair."
    },
    {
      "title": "Apply shaving cream.",
      "content": "Apply shaving cream. Go ahead and apply it all over your chin, above your lip, and up to your sideburns. It's best to use a clear shaving cream or gel so that you can see your beard as you shave and create a sharp line. [1] X Expert Source Woody Lovell Professional Barber Expert Interview. 28 January 2020."
    },
    {
      "title": "Make a circle beard.",
      "content": "Make a circle beard. Begin by shaving your sideburns and cheeks. Start near your ears and remove your sideburns, as well as most of the hair on your cheeks, leaving approximately 2 inches (5.1 cm) to both sides of your mouth. Shave the hair from the bottom and sides of your neck, stopping just above your Adam’s apple. Leave your moustache and soul patch intact. The end result is what’s called a “circle beard,” a still common style that was popular in the 1990s."
    },
    {
      "title": "Rinse off your face.",
      "content": "Rinse off your face. Wash away any excess hair or shaving cream. The precision work is about to begin, and you need to be able to see what you’re doing. At this point, it’s helpful to use just enough shaving cream to guide your razor, without covering up all your hair. [2] X Expert Source Woody Lovell Professional Barber Expert Interview. 28 January 2020."
    },
    {
      "title": "Create a neat goatee.",
      "content": "Create a neat goatee . Carefully trim the hair from your neck until you are left with a small, neat beard, resembling a goatee. [3] X Expert Source Woody Lovell Professional Barber Expert Interview. 28 January 2020. Scissors or an electric razor will help you control the overall shape and definition of your chin hairs. Classically, the Van Dyke beard is somewhat pointed; wax will help your hair retain its shape."
    },
    {
      "title": "Disconnect your mustache from your chin beard.",
      "content": "Disconnect your mustache from your chin beard. Leave the skin around your soul patch (if you grow one) completely smooth."
    },
    {
      "title": "Trim your moustache using scissors or a beard trimmer.",
      "content": "Trim your moustache using scissors or a beard trimmer. Measure twice, cut once, as a single errant swipe could force you to start all over again. Like the chin beard, the classic Van Dyke mustache is pointed and very neat."
    },
    {
      "title": "Wash your face again.",
      "content": "Wash your face again. Make sure you didn’t miss any visible hairs. Run your hand over your cheeks and around your beard to feel for rough spots, and go back over any you find with a razor."
    },
    {
      "title": "Comb your beard.",
      "content": "Comb your beard. [4] X Expert Source Woody Lovell Professional Barber Expert Interview. 28 January 2020. A small beard comb works wonders when it comes to identifying and removing stray whiskers . . . and food crumbs. The Van Dyke is a refined look; inattention will show!"
    },
    {
      "title": "Keep the lines defined.",
      "content": "Keep the lines defined. The shape of your chin beard has a huge effect on your overall appearance, so keep the lines clean as time passes. While new beard growth is inevitable, daily attention to your face, and precision upkeep of your mustache, soul patch and chin beard area with a pair of sharp scissors and a beard trimmer will help you extend the mileage on your Van Dyke."
    },
    {
      "title": "Employ wax to fancy it up.",
      "content": "Employ wax to fancy it up. Beard and mustache wax - especially when applied with a twist of your fingers - can turn your Van Dyke into a show stopper at a party or special event. Be sure to wear clothes as stylish as your beard."
    }
  ]
}