{
  "url": "https://www.wikihow.com/Know-Your-Puppy-Has-Worms",
  "title": "How to Know if Your Puppy Has Worms: Signs & Prevention",
  "steps": [
    {
      "title": "Watch for roundworms.",
      "content": "Watch for roundworms. Almost all dogs, including puppies, will get roundworms at some point in their lives because they are the most common parasitic worm in dogs. Puppies are especially vulnerable to roundworm infections from their mother’s either through transmission in utero or through her milk. However, eating other small animals such as mice can give your puppy roundworms. Although many dogs don’t have any symptoms of roundworms, the following signs can indicate a severe case of roundworms in your puppy: Diarrhea Vomiting Weight loss Dull fur or hair Potbelly Cough, which indicates the roundworms have moved into your puppy’s lungs Worms of white or light brown color up to several inches long in your puppy’s feces. [2] X Research source"
    },
    {
      "title": "Detect hookworms.",
      "content": "Detect hookworms. This parasite, which “hooks” itself onto the lining of your puppy’s intestines by ingestion of larvae or eggs in the soil or through routine licking and cleaning, is also relatively common. [3] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Hookworms can lead to malnutrition and death, especially in puppies, so it’s very important to watch for signs of infection and get treatment immediately. Unlike roundworms and tapeworms, it’s difficult to see hookworms in your puppy’s stool. However, you can detect hookworms by looking for other symptoms or signs such as: Diarrhea Weight loss. [4] X Research source"
    },
    {
      "title": "Look for whipworms.",
      "content": "Look for whipworms. Just like hookworms, whipworms burrow into the intestine of your puppy and suck on her blood after she ingests their eggs in soil or other substances such as feces. [5] X Research source However, they do not cause serious blood loss unless your puppy has a large number of them, which can also cause death. Your puppy can get whipworms from contaminated soil or grooming. Many dogs won’t have signs of whipworms, but bloody diarrhea may be a sign of a severe infection and you should seek treatment immediately. [6] X Research source Be aware that your vet will check your puppy for whipworms and other worms as a part of any checkup."
    },
    {
      "title": "Inspect for tapeworms.",
      "content": "Inspect for tapeworms. Puppies can get tapeworms from a variety of sources such as eating a mouse or flea infected with tapeworms. This can happen when she is outside or through the course of daily grooming. Tapeworms live off of food in your puppy’s intestine and can break off, which makes them easy to spot either in your puppy’s feces or on her anus. [7] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Tapeworms are generally not harmful, but may cause weight loss if your puppy has a bad case. [8] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Look for these typical signs of tapeworms in your puppy: ”Rice-like” segments of tapeworms around your puppy’s rectum or on top of her feces. [9] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Skin irritation, which might cause your dog to scoot her anus across the ground or another rough surface like a rug Licking or biting the area Portions of the worm in vomit Weight loss. [10] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Monitor for heartworms.",
      "content": "Monitor for heartworms. Puppies can get heartworm through mosquito bites, which cause the worms to travel through the bloodstream and infect the heart and lungs. Heartworms, which are harmful to a dog no matter its age, can be costly to treat and even fatal. However, they are preventable with affordable medication. Many dogs will show no symptoms in the early stages of heartworm infestation because it takes six months for the worms to develop into adulthood, but the following signs may appear after your puppy is six months old: Mild persistent cough Reluctance to exercise Fatigue after moderate activity Decreased appetite Weight loss Swollen belly from excess fluid in the belly Heart failure. [11] X Research source"
    },
    {
      "title": "Be aware of your puppy’s risk.",
      "content": "Be aware of your puppy’s risk. Worms, which are an intestinal parasite, are very common in puppies, especially if they spend time outdoors. Knowing your puppy’s risk for worms, especially harmful heart- and hookworms can help you watch for the signs of infection. Puppies are often infected with worms by: Ingesting the eggs or larvae of worms from soil or routine cleaning Eating birds, rodents, or other dead animals Having fleas Getting worms from their mother in utero [12] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source"
    },
    {
      "title": "Give your puppy preventative medication.",
      "content": "Give your puppy preventative medication. The primary goal with worm infestations is prevention. Giving your pet monthly medications can go a long way in keeping your puppy happy, healthy and worm free. Be aware that most heartworm preventative medications contain general de-wormers, so this may help prevent and control other types worms such a hook-, whip-, and tapeworms. [13] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source You’ll need a prescription from your vet for heartworm medications, but these are relatively inexpensive and can keep your puppy from requiring expensive treatments for heartworm or other worms. [14] X Research source Make sure to give your puppy her medication every month at the same time. If you find that you can’t afford the medication talk to your vet about a possible payment plan. If you forget to give her the medication, administer it as soon as you remember."
    },
    {
      "title": "Maintain good hygiene practices.",
      "content": "Maintain good hygiene practices. Keeping your puppy and her environment clean is another key component of prevention. [15] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Picking up your puppy’s stool and keeping common and yard areas clean can help minimize the risk of worm infestations. Remove and seal your puppy’s feces in a plastic bag. Dispose of the waste in a place that other animals or children can’t access. Clean any common areas where your puppy or other pets defecate, such as a litter box or when an animal has had an accident. Avoid dead or wild animals and their excrements. Try and keep your pet from eating wild and/ or dead animals, such as mice, raccoons, or deer because these can carry worms. [16] X Research source Keep your puppy away from other animals’ feces, too, as this can also carry worms. Consider hiring a professional company to clean your yard of feces if you do not want to do this."
    },
    {
      "title": "Control and manage fleas.",
      "content": "Control and manage fleas. Worms are a common result of flea infestations on your pet. Find solutions to control fleas in both indoor and outdoor areas to promote your pets health and prevent worms. [17] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Administer topical or oral products to your pet to control fleas on their body. You can use prescription treatments from your vet or buy one over-the-counter at a pet store. Clean your home thoroughly by vacuuming and spraying insecticides on furniture, baseboards, windowsills, and carpeted areas. Realize that outdoor treatments generally aren’t necessary if you control the indoor environment. If you do have a bad flea infestation outside, consider hiring a professional to remove them. [18] X Research source"
    },
    {
      "title": "Schedule an appointment with your vet.",
      "content": "Schedule an appointment with your vet. In addition to yearly checkups that can detect worm infestations, it’s very important see your vet if you suspect or detect any signs of worms in your puppy. Your vet can definitely diagnose what type of worms your puppy has and give her proper and timely treatment before the infestation leads to more serious conditions. Call your vet’s office if you have any questions about worms. If your dog has had prior worm infestations, let the office staff know that you’ve noticed the signs again. Remember that some worm infestations, especially heartworm and hookworm, can be fatal to puppies, so don’t wait to see your vet for treatment. Be aware that although there are many over-the-counter de-wormers, many won’t kill worms such as tapeworms. Treatment thus requires a prescription from your vet. [19] X Research source"
    },
    {
      "title": "Give your puppy medication for most worms.",
      "content": "Give your puppy medication for most worms. Depending on the diagnosis, your puppy will most likely need a medicated de-wormer to get rid of her worms. Follow the instructions of your vet to ensure that you completely knock out the infestation. In addition, your puppy may get: Heartworm preventative medication that also containers a general de-wormer. [20] X Research source Combination parasite medications, such as Sentry HC, that can treat tapeworm, hookworm, roundworm, and whipworm in one tablet. Oral or injected praziquantel for tapeworms. [21] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Undergo treatment for heartworm.",
      "content": "Undergo treatment for heartworm. Unlike other worm infestations, heartworm often requires more in depth treatment than a medication. Although prevention is the best way to control heart worm, your puppy’s vet may prescribe the hospitalization and the following to stabilize and treat your puppy for heartworm: Restricted exercise, to minimize the rate of damage to the heart and lungs Treatment for related conditions Surgery Medication, including pain relievers Repeat testing after treatment Preventative medication. [22] X Research source"
    }
  ]
}