{
  "url": "https://www.wikihow.com/Give-Someone-the-Silent-Treatment",
  "title": "How to Give Someone the Silent Treatment",
  "steps": [
    {
      "title": "Don't talk to the person.",
      "content": "Don't talk to the person. The primary characteristic of the silent treatment is not talking to the person. Basically, you don't say anything, not even if the person tries to engage you in conversation. [1] X Research source You actively choose not to respond to any comments, discussions, or accusations. If the person keeps engaging, simply tell him you are not willing to engage at this time. Say, “This isn’t something I want to talk about at this moment” or “I’m not in an emotional space to talk about this constructively. Let’s talk later.” Be aware that silence can anger someone, and this person may begin to demand a response, or escalate his or her actions to protest your silence."
    },
    {
      "title": "Ignore phone calls and messages.",
      "content": "Ignore phone calls and messages. Another form of silent treatment is ignoring other types of communication, such as phone calls, emails, messages, and text messages. If you are giving someone the silent treatment, it can be effective to ignore these forms of communication, as well. [2] X Research source If you do reply, you could take much longer to get back to them than you normally would. Again, you can alert this person to your silence. Say, “This isn’t a good time to talk. Let’s revisit this in the future.” You can also stop being responsive on social media to make a point."
    },
    {
      "title": "Ignore advances.",
      "content": "Ignore advances. This tactic works best in a crowd. The person may speak up and say something, but you continue whatever you are doing without acknowledging that the person wants your attention. [3] X Research source In fact, you don't even respond non-verbally. You don't make a movement to acknowledge the person spoke, for instance, such as turning your body or face. If you do, it gives the person an in. [4] X Research source If the person keeps talking, you can ask to talk to the person later when you have both calmed down. For instance, if someone in a meeting keeps trying to bring up the same topic, you could say, \"Thank you for that information, but right now isn't the time for it. Can we talk about that later?\""
    },
    {
      "title": "Avoid the person's routes.",
      "content": "Avoid the person's routes. If you are trying to avoid talking to a person, try to skip places where you know he or she will be. Go another route, or choose a different time to be in a place you know the person will be. [5] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source This is one way to create distance you need while you sort through your emotions and take a break from the person. If you work with this person, avoid eating at the same time for lunch breaks. If this is a classmate, sit further from him or her. If it is your family member, plan activities to do if you think you may be home at the same time."
    },
    {
      "title": "Avoid getting emotional with them.",
      "content": "Avoid getting emotional with them. If you're showing anger or even sadness, another person can take that as a response. Of course, in some situations, it's hard not to show any emotion, but if you can do it, it leaves the person with fewer ways to attack you. [6] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Monitor your reactions and emotions as much as possible. Monitor your facial reactions and eye contact. Many emotions are evident on the face, so try to react as minimally as possible."
    },
    {
      "title": "Know that it's okay to say nothing.",
      "content": "Know that it's okay to say nothing. In some situations, words are not needed and even not appreciated. Especially if you may say something that either may not be helpful or make the situation worse, keep your words to yourself. You can avoid hurting someone’s feelings by simply not saying anything at all. While silence may be beneficial in the moment, do make a point to address the issue at a later time, especially if it’s something that has hurt you or offended you. The silence is a temporary approach that shouldn’t be prolonged. Don't let anyone bully you into speaking if you choose not to speak. However, it can be beneficial to state that you are choosing to remain silent. Say, \"I'm having a hard time controlling my emotions right now, and for that reason I'm choosing to stay silent. Let's talk about this later when we're both more calm.\" Sometimes, it's not a good idea to use the silent treatment in a relationship. If you’re using silence to punish someone or manipulate behaviors, it ultimately prolongs and does not resolve the issue. [7] X Research source"
    },
    {
      "title": "Avoid the conflict.",
      "content": "Avoid the conflict. One purpose of the silent treatment, at least by some people, is to avoid the conflict altogether. That is, any time the conflict is brought up, you refuse to talk about it. [8] X Research source While this is not a productive way to handle all conflicts, you may want to handle certain situations through silence. For instance, if you’re out in public and do not want to start arguing, you can say, “This isn’t the time or place for this discussion. I refuse to talk about it further until we can better engage this.”"
    },
    {
      "title": "Don't engage in tantrums.",
      "content": "Don't engage in tantrums. Whether from a child or from an adult, it never helps to engage a tantrum. Tantrums serve to get attention or to manipulate a situation to go a certain way. [9] X Research source Instead of engaging over-the-top behaviors, it's best to ignore them and not allow the behavior to have any emotional anchor on you. [10] X Research source If your parent threatens hysterics on account of something you may do in the future, or if your partner threatens drastic behavior if you leave, calmly disengage from the situation."
    },
    {
      "title": "Keep from hurting or offending someone.",
      "content": "Keep from hurting or offending someone. If you feel triggered by someone's words or actions and really want to respond back, this may be a good opportunity to practice silence instead. Especially if this person is egging you on, withhold your statements. If this person keeps pressuring you, you can say, \"I'm doing my best not to say anything that may hurt or offend you, and it's best that I say nothing at all.\""
    },
    {
      "title": "Respond through silence to degrading remarks.",
      "content": "Respond through silence to degrading remarks. If someone is taunting you or spouting off negative comments to you, don't dignify the words with a response. By not responding, you enact your power of standing for yourself, and of not allowing the comment to affect you. [11] X Research source If someone is attacking you or belittling you, there's no sense in defending yourself or reaching that same level of stupidity. It's best to ignore the comments, not let them emotionally affect you, and move on."
    },
    {
      "title": "Avoid intensifying negative emotions.",
      "content": "Avoid intensifying negative emotions. Arguments can reach the point where rationality flies out the window and you find yourself yelling for no apparent reason. If you notice someone reaching a point of inability to listen to rational statements, there's nothing you can say to respond well. Instead of intensifying the situation, take a step back and say nothing. You may try to explain things or make a defense for your actions. Many times it's best to say nothing and move on. When in an intense argument, it can be beneficial to shift your attention to fully listening to the other person. The other person will see that you are attentive and being heard, and may begin to calm down. Monitor your own emotions and keep from saying things out of anger."
    },
    {
      "title": "Ask if you can take a breather.",
      "content": "Ask if you can take a breather. If you really are too mad or can't deal with your emotions, tell the person you want to step away for a bit. That way, you're not ignoring, but you'll have time to get yourself under control. [12] X Research source As an example, you could say, \"I really want to talk about this situation with you. However, my emotions are running really high right now. Can we come back and talk about this in an hour when I feel more calm?\""
    },
    {
      "title": "Use silence to calm yourself.",
      "content": "Use silence to calm yourself. It's easy to get caught up in emotions when you feel accused of something or that you're being unfairly treated. You may need your own calming during an argument. Retreating to silence may be a way for you to calm down, clear your head, and begin thinking from a more rational state of mind. [13] X Research source"
    },
    {
      "title": "Understand the silent treatment can hurt relationships.",
      "content": "Understand the silent treatment can hurt relationships. If you're regularly using the silent treatment against someone you love, it can damage the relationship. In fact, many psychologists consider it a form of abuse, as you are intentionally punishing the other person for something he or she has done. [14] X Research source Regularly using silence as a way to retaliate is not a way to solve problems, and can build up resentment in the other person. If you notice yourself engaging in this behavior, approach the person and break the silence. Ultimately, the silent treatment is a bit immature. If you're in a mature relationship, you're going to have to talk about what's upsetting you—it's important to communicate, work through things, and see if the other person will actually change."
    },
    {
      "title": "Focus on the issue.",
      "content": "Focus on the issue. Instead of focusing on the emotions around the issue, focus on the issue. Don’t get sidetracked by things that the person said that trigger you, stay on track with what’s important. Work on the issue together to figure out how you can move forward. [15] X Research source If you’re ready to move forward, say, \"Can we take a moment to talk about this problem? I'd like to work it out.\" If your arguments often get sidetracked, you can take a moment, write your feelings on a piece of paper, and then trade papers. That way, you can express your emotions without interruption or being sidetracked."
    },
    {
      "title": "Tell the person how you're feeling.",
      "content": "Tell the person how you're feeling. Instead of giving into the silent treatment, let the person know how his or her action made you feel. Stick to \"I\" statements instead of \"you\" statements, as that focuses on how you feel rather than putting blame on the person. [16] X Research source For example, if you're unhappy because your spouse has come home late again, you could say, \"I feel anxious when you don't come home on time and don't call. I fear for your safety, and I miss your company.\" That's a better thing to say than \"You're never home on time, and I hate it.\" The first one opens a discussion. The second one places blame."
    },
    {
      "title": "Work on a compromise together.",
      "content": "Work on a compromise together. Once you've both aired your grievances, take time to brainstorm a solution. Of course, that may mean you both need to compromise, which means you'll both have to give a little. [17] X Research source To compromise, find your core concerns first. Then brainstorm ways to meet the needs with both of you benefitting."
    },
    {
      "title": "Listen as much as you talk.",
      "content": "Listen as much as you talk. To truly communicate, you must take time to listen to what the other person is saying and feeling as well. If you've gotten to a point where all you want to do is give the person the cold shoulder, that's probably an indication you need to have a serious conversation. [18] X Research source Listening to what someone has to say shows that you are engaged, interested, and respectful. Actively listen to what the person is feeling and thinking, and show him or her that you are listening by summarizing what they've said every so often and asking relevant follow-up questions."
    },
    {
      "title": "Don't be afraid to say \"I'm sorry.\"",
      "content": "Don't be afraid to say \"I'm sorry.\" Everyone makes mistakes, and it’s important to take responsibility for your actions when you hurt someone. If you handled a situation wrong, own up to it. Don't be afraid to apologize for any actions you have done that have caused harm. [19] X Research source"
    }
  ]
}