{
  "url": "https://www.wikihow.com/Improve-Balance-While-Riding-a-Horse",
  "title": "How to Improve Balance While Riding a Horse",
  "steps": [
    {
      "title": "Sit deeply.",
      "content": "Sit deeply. Once you have mounted, you can start to find your balance. Sit in the lowest part of the saddle. Do not lean too far forward or back or your balance may be off. If the horse won’t stand still, you can have another person hold the reins while you mount and find your balance."
    },
    {
      "title": "Align your body.",
      "content": "Align your body. Place your feet in the stirrups, with the balls of your feet pressed against the stirrups and your heels pointed towards the ground. Your legs should not be in front of your body. Imagine a straight line drawn down through your ears, shoulders, hips, and heels. [1] X Research source Your body should not be rigid. Make sure you’re sitting up straight and keeping your shoulders relaxed. Allow your body to communicate with the horse so that you can adjust your balance as you ride. Do not arch your back or hunch. You may find it helpful to have someone take a photo of you in the saddle so you can see and analyze your own alignment. This allows you and your trainer to critique how you’re sitting and make any changes."
    },
    {
      "title": "Distribute your weight evenly.",
      "content": "Distribute your weight evenly. Do not rest your weight entirely on your seat or tail bones. Instead, allow your whole body to help you maintain your position on the horse. Keep your shoulders rolled back and your gaze looking forward to keep this posture. It may be tempting to squeeze the horse with your thighs, calves, or knees. Instead of pressing in on the horse with one part of your leg, each part of your leg should have an even amount of contact with the horse. [2] X Research source"
    },
    {
      "title": "Keep your arms flexible.",
      "content": "Keep your arms flexible. If you do not have strong balance on a horse, you may be tempted to clench the reins or hold them tightly to yourself. This interferes with the communication between you and the horse. Instead, hold your elbows so that they line up with the horse’s mouth. Hold the reins tightly enough to control the horse, but do not yank or restrict the horse’s movements."
    },
    {
      "title": "Stand in the stirrups after mounting.",
      "content": "Stand in the stirrups after mounting. Once you have positioned yourself correctly, you can try standing in the stirrups. Lift your weight so that you are not sitting on the saddle. This position will resemble a crouching position. It will automatically put you in the proper position for balanced riding. After a minute, try lowering yourself while carefully maintaining the proper leg position. [3] X Research source"
    },
    {
      "title": "Trot at a two-point position.",
      "content": "Trot at a two-point position. Once you have gotten the hang of standing in your stirrups, you can try riding in this position as well. Trot the horse around the ring while crouching in the two-point position. This is a very good exercise for building leg muscle and improving your balance. Start with five or ten minute sessions, and work your way up to thirty or forty minute sessions. [4] X Research source You can alternate your exercises by alternating a two point form with sitting. Try doing seven paces sitting and seven paces in two-point."
    },
    {
      "title": "Ride without stirrups.",
      "content": "Ride without stirrups. By riding without stirrups, you will automatically learn how to balance yourself on a horse. It will teach your muscles how to grip the horse without additional aids. Hold your feet the same way you would in the stirrups, with the heels pointed down. Practice sitting in this manner before you start moving. [5] X Research source You don’t need to remove the stirrups in order to do this. You can achieve the same effect by crossing the stirrups over the saddle to the opposite side. When you are starting out, you can have someone hold the horse on a long line. If it helps, hold onto your saddle with a few fingers, and practice riding around a ring for ten minutes at a time. [6] X Research source If the horse is not yours or if you do not know the horse you are riding well enough, you may want to try riding with stirrups first before removing them."
    },
    {
      "title": "Lean in other directions.",
      "content": "Lean in other directions. This exercise can promote mobility on the horse’s back while still keeping you balanced in the saddle. While sitting in the saddle, try reaching forward to touch the horse's ears. Next lean back and touch your horse's rump. Now lean side to side, and just touch the horse as you go. Keep on talking to the horse, and experiment with leaning in different directions. Once you have start building up your balance, you can try this exercise while in two-point position."
    },
    {
      "title": "Stretch in the saddle.",
      "content": "Stretch in the saddle. Once you have finished your exercises on your horse, don’t forget to stretch. While still sitting in your saddle, point your toes in the ground to stretch your calves and thighs. If you were using stirrups, be sure to drop them before doing this stretch.You can also stretch out your arms, and rotate them in circles to relieve tension and help you relax."
    },
    {
      "title": "Build core muscles.",
      "content": "Build core muscles. The core muscles are those in your abdomen and back. Core strength will help you stabilize the proper upper body posture on the horse while giving you extra control over your body movements. You should do between ten and twenty reps of these exercises. Some good core exercises for riders include: One Leg Extension: Lay down on your back. Bend your knees, and keep your feet hips-width apart. Place your hands on your stomach. Raise your head slightly off the floor. Lift one leg up, keeping it straight. Hold for a few breaths before lowering and lifting the other leg. [7] X Research source Full Body Curl: Lay down on the floor with your knees bent. At the same time, lift your head, shoulders, and feet off the floor, bringing your knees towards your chin. Straighten your body until your head, shoulders, and feet are flat on the ground again. Plank: Lay on your belly and then push your body up so that only your forearms and toes touch the floor. Tighten your core and keep your back straight. Hold this position for one minute and then take a quick rest before repeating a few more times. Bicycle Crunch: Lift your legs until they are 45 degrees from the floor. Bend one knee, and hold the other one straight. Raise your shoulders and head off the ground, and touch your opposite elbow to your knee. Lower your head to the ground. Straighten your leg, and bend the other one. Repeat. [8] X Research source"
    },
    {
      "title": "Strengthen your legs.",
      "content": "Strengthen your legs. To improve your grip, balance, and control over the horse, leg exercises are important. Any exercise that works your thighs or calves can help. For example, you can try: Squats: Keep your back straight and your feet hip-width apart. Lower yourself to a 90-degree angle before slowly rising to a stand again. If you having difficulty, you can start by positioning yourself against a wall. Skipping: As you skip, push off with one foot and lift the other one high, until your thigh is horizontal. Reach across your body with your opposite arm. Repeat this movement on the opposite leg. You can do this around a track or around your neighborhood. [9] X Research source Quad Stretch: Kneel on the ground with one leg bent in front of you. With your hands on your hips, gently move your hips forward. You should keep your back straight. [10] X Research source"
    },
    {
      "title": "Learn yoga.",
      "content": "Learn yoga. Yoga helps your balance both on and off the horse. It also keeps you relaxed, encouraging you to keep a more flexible posture while riding. You can attend a yoga class, watch videos on the internet, or try the following moves. Warrior Pose: Stand straight. Stretch your right foot back behind you as far as you can; this will naturally put you in a lunge position. Stretch your arms straight above your head. Take about five breaths, and repeat with the other leg. Spinal Twist: Sit with your spine straight, and your shoulders lined up with your hips. Stretch your legs in front of you so that they are flat against the ground. Bend one leg, and place it over the other. Wrap the opposite arm around the bent knee, and twist your body. Hold this pose for five breaths before repeating on the other side. [11] X Research source Pilates and ballet are other great options if you want to improve your core strength and balance."
    }
  ]
}