{
  "url": "https://www.wikihow.com/Make-Papier-M%C3%A2ch%C3%A9-Planets",
  "title": "How to Make Papier Mâché Planets",
  "steps": [
    {
      "title": "Create a work area.",
      "content": "Create a work area. Find a table or other flat area that can be easily covered to make as little of a mess as possible. Cover the area with newspaper to make for a quick and easy clean up. The adhesive used in papier-mâché can be difficult to remove from wood and other surfaces."
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. You'll need some basic materials to get started. Papier-mâché doesn't require special supplies. You will need: A large bowl for mixing your adhesive mixture. A cup or two of water. Newspapers torn into long, narrow strips. A good size to aim for is 2 to 3 inches wide and 6 to 7 inches long per strip. Paint brushes. Paint or markers to color the planets. In order to make the planets as realistic as possible you'll need all your basic colors handy: orange, yellow, blue, brown, green, red, gray, and white. At least a dozen balloons, in case you need a few extra. Ingredients for adhesive: you can use either white craft glue or flour and water. Material for planet rings. Saturn, Jupiter, Uranus, and Neptune all have rings. You'll need a thin flexible wire or pipe cleaner to form rings, or you can just use construction paper."
    },
    {
      "title": "Mix your adhesive.",
      "content": "Mix your adhesive. There are two easy ways to make an adhesive that you'll use to apply the newspaper strips to the balloons. You can either use a white craft glue base or a white flour base. If you want to use glue, you can buy any basic white glue. Mix two parts glue to one part water in a bowl. [1] X Research source You'll need several cups to make the entire set of planets. If you don't have glue readily available, you can grab some white flour from your cupboard. Mix one part flour to one part water in a bowl. [2] X Research source Make about two cups. You'll want a consistency that resembles the thickness of glue, but not so thick that it does not spread easily over your newspaper strips. If it is too thick add more water. If it is too watery, add some more glue or flour."
    },
    {
      "title": "Inflate the balloons to proper size.",
      "content": "Inflate the balloons to proper size. You will use ten balloons total. One balloon will represent the sun, and the other nine, the planets. In order from the sun, these are: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune and Pluto (which has been demoted in status to a \"dwarf planet\"; [3] X Research source after conducting your own research, you may choose whether or not to include it). Although you may not be able to get the scale exact, it will be useful for educational purposes to blow up the balloons so that their relative size matches the planets they represent. The biggest balloon will be the Sun, which is approximately ten times the largest planet Jupiter. For sake of scale, each planet can be roughly compared to the following objects: Mercury — marble Venus — walnut Earth — golf ball Mars — acorn Jupiter — basketball Saturn — soccer ball Uranus — soft ball Neptune — small grapefruit Pluto — kidney bean"
    },
    {
      "title": "Prepare the papier-mâché.",
      "content": "Prepare the papier-mâché. If you’ve never worked with papier-mâché before, it's both a fun and easy medium to work with. The process of making it is simple, but will almost certainly get messy. You will be dipping newspaper strips in your adhesive mixture and applying it to an object, in this case a balloon. Once the strips dry, you'll be left with hardened objects that will represent the planets. Tear the newspaper into long, thin strips. Use one strip at a time and get rid of excess adhesive from each strip over the bowl by running your fingers lightly over it. This will conserve your mixture but also make sure your planets are not too soggy."
    },
    {
      "title": "Add the papier-mâché to the balloons.",
      "content": "Add the papier-mâché to the balloons. Drape the wet newspaper strips across the surface of each balloon. It may help to make two layers, one horizontal and one vertical, so you can be sure of full coverage. Balloons have a tend to wander if not held in place. If you have an extra pair of hands, have one person hold the balloon while the other applies the strips. Otherwise, you can put the balloon in a large bowl that will keep it in place or nestle it between two weighted objects, like some books. [4] X Research source In order to cover the tie end of the balloon, tape it down and then place a strip directly over the end. Make sure there are no gaps between the strips. You want to cover the balloon completely. Use your paintbrush to smooth the surface and get rid of excess glue from the newspaper strips. It's okay to leave some texture to the final product as this will make the balloons appear more realistic to the topography of a planet."
    },
    {
      "title": "Look for problem areas.",
      "content": "Look for problem areas. You won't want to peel off layers of dry, painted papier-mâché, so look for any issues after you place the strips. If you see a strip that doesn't look right and it's not yet dry, simply remove it and reapply a new strip. You can do this after it's dry, but the strip may break apart and require a little more work."
    },
    {
      "title": "Allow the glue to dry.",
      "content": "Allow the glue to dry. Factors like humidity and room temperature can affect drying times. You may need to wait until the next day to proceed to the finishing touches. Using a gentle blowing fan may speed the process somewhat, as long as it doesn’t scatter the balloons around the room. It would be best if you have a drying rack, or an enclosed protected space to prevent the balloons from rolling around. Otherwise, the added weight of the glue should limit their movement on its own."
    },
    {
      "title": "Paint your planets.",
      "content": "Paint your planets. Many of the planets of our solar system have bright, vivid colors. You'll want to be as accurate as possible if it's an educational project, but otherwise, have fun and be creative! Mercury is typically a slight gray or blue. Venus is a pale yellow. Earth is mainly blue with white for clouds and green and browns land masses. Mars is a reddish brown due to its rusty rocks and minerals. Jupiter is orange with light white bands. Saturn is a pale gold due to its high concentration of ammonia. Uranus is a pale blue. Neptune is also a light blue due to its high concentration of methane. Should you wish to include Pluto, paint it light brown."
    },
    {
      "title": "Make planetary rings.",
      "content": "Make planetary rings. Saturn, Jupiter, Uranus, and Neptune all have rings. The easiest way to make rings is to use a thin wire purchased from any local hardware store. You can make a small hole in the dried exterior using the wire or a small knife. You'll want the hole to be on the side of the balloon and somewhat centered to make it as much like the real placement of the rings as possible. Put the wire through the hole and close the end to anchor it. Then form a circle around each ringed planet with the wire long enough to stretch the entire diameter. The wire will support itself and will simply need to be bent around each planet. If you do not have wire, you can use construction paper. Cut the construction paper 2 to 3 inches wide and long enough to make it around the entire balloon. Glue the construction paper ring around each planet. [5] X Research source"
    },
    {
      "title": "Make a place to hang your planets.",
      "content": "Make a place to hang your planets. If you want to hang your planets using fishing line or other string to give the allusion of a floating solar system, you'll need a place to tie the string. The easiest way to do this is to gently poke a hole in the hardened paper (being careful to not pop the balloon) and put a curved paper clip through the hole where string can be tied."
    },
    {
      "title": "Display your project.",
      "content": "Display your project. One simple way to display your project is to use the paper clips you placed in earlier, tie fishing string and hang from something like a paneled ceiling, putting the planets in order so they realistically portray the solar system. You can also tie each planet to something simple like coat hangers that can be hung around the room, or make a wooden dowel that planets can be hung from. The sun should be the first balloon, followed by each planet in order. The string should hang the planets low enough that they are visible to each child and readily able to be interacted with. Since it will be difficult to replicate the exact scale of each planet's distance from the sun, you should make them far enough apart to be clearly distinguished from one another. A good distance to shoot for would be 2 to 3 feet apart if you have plenty of space, otherwise use your space the best way you see fit."
    },
    {
      "title": "Use your completed project to educate children.",
      "content": "Use your completed project to educate children. Point out the difference in sizes, colors, and so on. This is a great way to convey facts and to help children begin a journey of understanding our solar system better."
    }
  ]
}