{
  "url": "https://www.wikihow.com/Love-Reading",
  "title": "How to Love Reading",
  "steps": [
    {
      "title": "Consider why you want to read.",
      "content": "Consider why you want to read. People read for a wide variety of reasons. Before you pick up a book, consider what you want to get out of reading. Some people like reading books that teach them new skills, from computer programming languages to skills for hunting or camping. Other people enjoy narratives, whether fictional or biographical, to transport them to other times, worlds, or situations. Think first about what you ultimately want to get out of reading. You are much more likely to learn to love reading if you connect with something that seems purposeful to you. If reading is just an exercise or something you feel you “should” like, it's not likely to have a meaningful impact."
    },
    {
      "title": "Identify what you want to read.",
      "content": "Identify what you want to read. Once you know whether you want to learn, be entertained, or something else entirely, you can narrow down types of books based on your answer. For instance, knowing you want an entertaining story alone doesn't narrow between poetry, literature, popular fiction, memoir, and other types of writing, all of which could provide an entertaining narrative. Try doing an internet search for popular books in the area that you've chosen. This can give you a list of suggestions where you might start. Consult with your local librarian. Librarians are usually delighted to make reading recommendations. Once you know what you're “looking for” from your reading, ask your librarian if s/he knows of any books that might suit. Talk with the employees at your local bookstore. Most people who work at bookstores love reading and love books. They can be a great source of recommendations. Chatting with people who are passionate about reading might even spark a little fire of your own!"
    },
    {
      "title": "Consider the genre you think you'll most enjoy.",
      "content": "Consider the genre you think you'll most enjoy. You can narrow down reading choices even more once you've picked a general type of writing by considering the genre you want. If you've decided on popular fiction, for instance, you can choose between horror, science fiction, historical, fantasy, romance, mystery, or more realist books that take a less whimsical approach to their characters and settings. As another example, if you decide to want to read nonfiction history books, then consider the time period and subjects that most interest you. A book about D-Day in Normandy during World War II will obviously be a very different reading experience than a book about the politics of the Roman senate around the time of Julius Caesar."
    },
    {
      "title": "Sample the genre to find writers who click with you.",
      "content": "Sample the genre to find writers who click with you. Even within a particular genre, a particular writer's style might not work for you due to his/her particular voice. This can be due to when the book was written, the tone, the point of view, or a number of other reasons. If you don't like a book in the genre you think you should most enjoy, try to narrow down the reason why. For instance, if you decide you want to read horror novels, older novels such as Frankenstein or Dracula are going to read very differently than Stephen King or Clive Barker novels."
    },
    {
      "title": "Make connections between reading and other interests.",
      "content": "Make connections between reading and other interests. You may feel very passionately about social issues or something else. Seek out books that connect to the issues about which you are passionate or that frame the issue in a wider context. [1] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Remember that you can read more than books, too. Look at print and online magazines, blogs, and other places to find other reading material."
    },
    {
      "title": "Put down books you don't like.",
      "content": "Put down books you don't like. People sometimes feel obligated to finish a book even when they don't like it. You'll develop an aversion to reading rather than a love of it if you try to slog through a 300-page novel that you don't like. Many books can start slow as they develop the setting and people/characters involved, but if a book hasn't hooked you within 50-75 pages, then there's nothing wrong with moving to another one."
    },
    {
      "title": "Remember that reading is deeply personal.",
      "content": "Remember that reading is deeply personal. Reading isn't a competition. It's a deeply personal, highly subjective activity. There's no reason why you should feel guilty for not loving that award-winning novel everyone's talking about. Nor should you feel embarrassed if you truly love something that others may consider “lowbrow,” like comics or romance novels. Read what you love, and don't compare yourself to anyone else. If you dont like one book, that doesnt mean you have to give up on reading! Just that you haven’t found the book for you yet."
    },
    {
      "title": "Create or find a good reading environment.",
      "content": "Create or find a good reading environment . Find a place that is quiet, well-lit, and comfortable. You can even make a reading nook in your room . Constant distractions from the book in front of you can make it hard to concentrate, and no one likes reading the same passages over and over. Finding the proper environment in which to read can be just as important as finding the right book for many people. [2] X Research source Sometimes, people may suffer from light sensitivity, which can cause headaches when you read. Avoid high-contrast print, glossy paper, and fluorescent lighting. You don't have to read only at home, either. Check out the coffee shops, cafes, or bars in your area."
    },
    {
      "title": "Set times to read.",
      "content": "Set times to read. Try to set aside time to read every day. Even if it just starts as ten minutes on a lunch break, twenty minutes on the bus, and fifteen minutes before bed at night, that's suddenly forty-five minutes that day you've spent reading. [3] X Research source You can even turn this into a little game with yourself. Set a daily goal for reading time and give yourself a reward when you hit it. Eventually, you may come to find reading is its own reward."
    },
    {
      "title": "Always carry a book with you.",
      "content": "Always carry a book with you. You never know when you might find a few extra minutes to read. Sitting in waiting rooms, commuting on public transportation, waiting at a restaurant for a friend to arrive, etc. are all situations where we tend to pull out our phones and send text messages or check Facebook. By having a book in your bag, you can help develop your love of reading. [4] X Research source If you have an e-reader, you'll be able to carry an entire library around with you. The choices are endless."
    },
    {
      "title": "Keep a reading list.",
      "content": "Keep a reading list. Whether it's in a pocket notebook, a memo on your phone, or someplace else, try to keep a reading list of books you hear about that you want to read. [5] X Research source Remembering titles and authors is difficult and drawing a blank once you're at the bookstore or the library is frustrating. By having a list handy, you'll always remember what books sounded interesting. If you're at the library or bookstore and see a book that intrigues you, snap a photo of the cover. That way, you'll remember it for later."
    },
    {
      "title": "Track authors or series you enjoy.",
      "content": "Track authors or series you enjoy. When you find an author whose style you love, try tracking down his or her other books. Even if the plot or subject of the author's other books doesn't necessarily grab you, loving a particular writing style can lead to enjoyment of books you might not expect. Try looking into the other books of an author you find yourself really enjoying."
    },
    {
      "title": "Socialize around reading.",
      "content": "Socialize around reading. Look into book clubs or reading groups that specialize in the books you enjoy. Reading can be more of a solo activity than watching movies or television shows, but it doesn't have to be. Books can be just as fun to talk about with others as other media. [6] X Research source Finding these groups locally isn't always easy, so remember to look online for reading communities as well."
    },
    {
      "title": "Try audiobooks.",
      "content": "Try audiobooks. Sometimes school, work, or other obligations might not leave you as much time to read as you'd like. In these situations, try listening to audiobooks to still get your daily dose of books. [7] X Research source Even having books read aloud to you will still keep you involved and enthralled with reading during the period where you cannot pick up the actual book."
    },
    {
      "title": "Visit your local library.",
      "content": "Visit your local library. Your tax dollars pay for libraries, and you can try out as many books as you would like for free (as long as you remember to return or renew them on time). Many public libraries even loan out e-books so you can read them from home."
    },
    {
      "title": "Visit the bookstore.",
      "content": "Visit the bookstore. Bookstores, whether the big chains or intimately used book shops, are also great places to browse if you prefer to own your books. Sometimes being surrounded by cases and cases of books is all it takes to reignite your passion for picking up a few new ones."
    },
    {
      "title": "Offer a choice.",
      "content": "Offer a choice. One reason many students and young people don't enjoy reading is that they feel it is always “required,” and never a choice. If you can offer them a choice of reading that takes their interests into account, they're more likely to learn to love reading. [8] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source A choice of how to read can also be helpful. For example, in-class reading periods can be very helpful for some students, while others need to be at home alone in their rooms to focus. A choice of what to read can help young people understand that reading doesn't always mean dry or boring. In addition to the classics, provide options such as magazines and comics."
    },
    {
      "title": "Provide an environment that fosters reading.",
      "content": "Provide an environment that fosters reading. If your home doesn't have many books or other reading materials, it will be more difficult for your child to see reading as something enjoyable that s/he could do even in leisure time. Keep interesting, fun books around your home. [9] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Set a good example by reading yourself. If your children see you enjoying a good book, they may be more likely to pick one up themselves. Try reading together as a family. Creating a positive association between reading and family fun time can help take the pressure off of young people to “perform” in their reading. Create a “reading space,” either in your classroom or your home. It should not have other distractions and should be a pleasant little retreat where the child can enjoy reading. Use books as rewards. Offer to take your child on a trip to the bookstore to pick out a few new books as a reward for chores or good performance in school. Help your child see that reading can be something that's fun and rewarding."
    },
    {
      "title": "Encourage creativity.",
      "content": "Encourage creativity. There's no reason that the story has to end when the back cover shuts. Encourage young people to engage with their reading creatively. [10] X Research source For example, you could encourage students or your own children to draw scenes from what they read. Performing reading in funny character voices can provide extra drama to reading. Ask questions about how children feel about the reading. Encourage them to think about what might happen next in the story, or write their own continuation. Ask them to create a movie poster highlighting what they think is the most important element from the book."
    },
    {
      "title": "Be supportive and encouraging.",
      "content": "Be supportive and encouraging. One reason children may feel uncomfortable reading is that they worry they don't understand what they read or will get the “wrong” answer. Be supportive and encouraging of young readers. Never tell a young reader that his/her opinion or interpretation is “wrong.” Instead, ask the child how s/he came to this opinion. This will help her/him articulate how she formed her ideas and will help teach him/her about how to hone reading skills. If a young reader tells you that s/he is having trouble understanding, be patient. Don't make the child feel stupid or ignorant for not “getting” the material. Instead, ask questions to find out where the confusion is, and guide the child into stronger skills. Accept every comment, no matter how “wrong” or inaccurate it may seem, as a valuable contribution. Remember that it can be terrifying for young or inexperienced readers to even offer their opinions. If the idea is inaccurate or needs correcting, ask further questions about it rather than rejecting it out of hand."
    }
  ]
}