{
  "url": "https://www.wikihow.com/Hold-a-Bearded-Dragon",
  "title": "How to Hold a Bearded Dragon",
  "steps": [
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Washing your hands before you handle a bearded dragon will reduce the risk of passing any germs or illnesses on to the dragon. You may also consider wearing gloves; this has the added benefit of protecting your hands from the dragon’s rough skin."
    },
    {
      "title": "Approach the lizard slowly until you are able to touch it.",
      "content": "Approach the lizard slowly until you are able to touch it. It is important that your actions around the beardie are calm and deliberate. If the beardie is stressed, it will not be comfortable being held. If the beardie is in a cage or enclosure, you will have to slowly reach in, but do not attempt to reach from above; bearded dragons have sensory nerves on top of their heads that will interpret your reach as an attack. Do not interrupt the bearded dragon while it is eating. Do not back a beardie up in a corner, as it will feel threatened. Do not tease the lizard with your finger, as it might think it's a worm and chomp!"
    },
    {
      "title": "Pet the bearded dragon gently.",
      "content": "Pet the bearded dragon gently. This will allow the dragon to become accustomed to your hand and feel comfortable. When the bearded dragon has blinked or closed its eyes, it is calm enough to pick up. A beardie shows anger or stress by making his chin go black, and if he's very angry his chin is black and puffed up. If you see this, then it's best to back off as the beardie is not in the right frame of mind to be picked up. [3] X Research source Again, remember not to approach your beardie from above, as holding your hand above their head or eyes will trigger their predatory instincts."
    },
    {
      "title": "Pick up the beardie.",
      "content": "Pick up the beardie. Gently put your hand, palm upturned, under its body and scoop it up. Use your thumb and forefinger to support the front arms while the body rests in the palm of your hand. Make sure that all of the dragon's legs are supported. You might place a second hand under the tail as well. If getting your hand under the dragon is awkward, gently grasp the dragon behind the front shoulders with your forefinger and thumb to lift slightly, and slide your other hand underneath. Don’t squeeze, just support. Let it sit on your hands. Be aware that if the beardie's back end is not supported, he will 'windmill' his tail around in circles. If this happens, immediately support his rear legs and tail, so that he feels more secure. Otherwise, he may injure his back."
    },
    {
      "title": "Get comfortable and stay calm.",
      "content": "Get comfortable and stay calm. Place the bearded dragon on your arm, chest, or lap and it will most likely stay there comfortably while you pet it. Your calm gentle touches will help the beardie to feel relaxed. Adult bearded dragons can be up to two feet long, so you may be most comfortable sitting with it. Young dragons are speedy, so you may want to loosely hold on. Know that a beardie's scales and spikes point in one direction, so pet him along the scales rather than against or you will end up with prickles in your skin and an angry beardie."
    },
    {
      "title": "Read the bearded dragon’s body language.",
      "content": "Read the bearded dragon’s body language. The bearded dragon will communicate its level of comfort to you and if you’re able to decipher what it’s saying, you’ll have a better experience holding it. If it becomes stressed or agitated, put it back in its cage. Watch for these gestures: Inflated, black beard: When a lizard wants to show dominance, or feels startled or threatened - this particularly happens during breeding season - it puffs its throat out. The lizard's beard will also turn black when it is agitated. Mouth gaping: As with the inflated beard, this gesture is meant to make the dragon look menacing, as a show of dominance or to scare off a potential aggressor. Mouth open, but not wide. It may just be trying to cool off. Bobbing head: Males show dominance with this gesture. Arm waving: Sometimes a dragon may hold up one front leg and slowly wave it, which is a sign of submission. Raised tail: This is commonly seen during breeding season. It can also be a sign of alertness and activeness. Juveniles tend to raise their tail when they're hunting prey. [4] X Research source"
    },
    {
      "title": "Return the dragon to its habitat.",
      "content": "Return the dragon to its habitat. When you are done holding the dragon, or the dragon is done being held, return it to is enclosure using the steps described above. You can hold a bearded dragon for as long as it will tolerate being held. Start with 15 minutes once a day and as it gets used to being handled, you can hold it longer. Some dragons enjoy being held several times a day for several hours. When the beardie becomes restless, it is time to put him back. The length of time he can stay out of his vivarium depends on the room temperature. Reptiles are cold-blooded, so if the room is cool, he may start to chill and his digestion will stop. If his belly feels cool to the touch, then return him to the vivarium to warm up."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Bearded dragons, like most reptiles carry Salmonella. It is normal for them, but can cause illness in people. Always wash your hands after handling a bearded dragon."
    }
  ]
}