{
  "url": "https://www.wikihow.com/Make-Homemade-Weapons-out-of-Everyday-Objects",
  "title": "How to Make Homemade Weapons out of Everyday Objects",
  "steps": [
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. You'll need several sheets of printer paper, regular tape, duct tape, Popsicle sticks, a pencil, strong twine, a ruler, an x-acto knife, and scissors. You can even use old paper boxes. [1] X Research source Save some shipping paper and use it for this purpose. Or use recycled toilet paper. [2] X Research source"
    },
    {
      "title": "Make the arms.",
      "content": "Make the arms. Take 4 sheets of printer paper and cut them in half along the long line. Roll each set of collated 4 into a tube (with a pencil at the center) from short side to short side. Tape the tube closed at three points along the barrel and then remove the pencil. [3] X Research source"
    },
    {
      "title": "Make the barrel.",
      "content": "Make the barrel. Take 5 sheets of paper, collate them, and wrap them short end to short end into a tube with a pencil at the center once again. Tape the tube in several places and then remove the pencil. [4] X Research source"
    },
    {
      "title": "Insert the arm supports.",
      "content": "Insert the arm supports. Cut two 1.5\" sections of Popsicle stick and place it in the end of the tube so that the end is flush with the opening and mark 1.5\" from that end of the tube on the outside of the barrel. Finally, insert a Popsicle stick in the opposite end and at a 90 degree turn from the other stick and place a single layer of duct tape around the whole barrel to keep it from breaking. Bend the arms at the 1.5\" mark you made."
    },
    {
      "title": "Attach the arms.",
      "content": "Attach the arms. Pinch the end of the barrel and then place the short sections of the arms on either side of the pinched end. Duct tape them into place. Make sure the connection is very tight and strong."
    },
    {
      "title": "String the crossbow.",
      "content": "String the crossbow. Use a bowline knot to attach the far ends of the bow together. Attach it to one side, secure with tape, pull the string about 1\" beyond the end of the other side, and then attach that side and secure it as well."
    },
    {
      "title": "Add the trigger.",
      "content": "Add the trigger. Pull the bow back until it makes a square shape with the arms. Mark the point on the barrel where the center of the string reaches and place your trigger at that location. Use the x-acto knife to cut a hole straight through the barrel. Cut the end off of a Popsicle stick, split it down the middle, and place it through the hole to create the trigger. It should be able to wiggle back and forth a bit, and be long enough to extend out from the barrel on either side of the hole. If you're a kid, get help from an adult with this. It's very easy to stab yourself or cut your finger off!"
    },
    {
      "title": "Build the guides.",
      "content": "Build the guides. Cut a single sheet of paper in half along the long line and roll two tubes. Flatten them and tape them in place along either side of the trigger. Then take another strip of single sheet, this time in quarters rather than halves, and roll a tube which you will place between the arms of the crossbow. Make sure a pencil fits easily through this tube."
    },
    {
      "title": "Done!",
      "content": "Done! Cock your string back so that it fits on the trigger, load your pencil, and then fire!"
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. You'll need large pieces of thick, sturdy cardboard, craft glue, paint, ribbon, and optionally a flat corner bracket which you can purchase from your local hardware store. [5] X Research source"
    },
    {
      "title": "Make your template.",
      "content": "Make your template. Draw the shape of the axe you want, blade and handle, onto a piece of paper. The simpler the shape, the better it will work. [6] X Research source"
    },
    {
      "title": "Cut out your pieces.",
      "content": "Cut out your pieces. Trace this shape onto at least four pieces of cardboard (six is better) and cut them out with a box cutter knife. [7] X Research source If you're a kid, get help from an adult with this. It's very easy to stab yourself or cut your finger off!"
    },
    {
      "title": "Reinforce the center.",
      "content": "Reinforce the center. Take one piece of cardboard to act as the center. Glue the corner bracket at the L between the handle and the blade. You can also place a thin stick or dowel rod in the handle piece if you want to. [8] X Research source"
    },
    {
      "title": "Glue the pieces together.",
      "content": "Glue the pieces together. Glue all of the layers together, with the reinforced section in the middle. [9] X Research source"
    },
    {
      "title": "Add finishing touches.",
      "content": "Add finishing touches. You can use the box cutter to bevel the edges of the blade section if you want. Once this is done you can cover the whole thing in duct tape, paint it to look real, or wrap the ribbon around the handle to give it a really authentic look. [10] X Research source"
    },
    {
      "title": "Done!",
      "content": "Done! Enjoy your new battle axe!"
    },
    {
      "title": "Get your materials.",
      "content": "Get your materials. You'll need two long cardboard tubes, such as the ones that come at the center of a roll of paper towels. You'll also need tin foil and duct tape. You can optionally make the nunchucks a bit more dangerous by adding weights (metal butter knives are good for this). [11] X Research source"
    },
    {
      "title": "Create the center weights if you are using them.",
      "content": "Create the center weights if you are using them. If you decide to use the weights, you want to put them in first. Take two butter knives, flip them opposite end to opposite end, and tape them together into a single object. Thoroughly cover them in tape to keep them from breaking loose and cutting you. [12] X Research source"
    },
    {
      "title": "Fill the cardboard tubes.",
      "content": "Fill the cardboard tubes. Tape closed one end of each of the tubes. Make a ball of tin foil and shove it down into the end of the tube. Continue stuffing balls of tin foil into the tube or surround your weight in bunched tin foil and then center it in the tube. Fill the tube until the tin foil is level with the open end. Tape the end closed. [13] X Research source"
    },
    {
      "title": "Make the rope.",
      "content": "Make the rope. Cut long strips of duct tape into thin sections and then fold those sections in half to create strings. Braid the strings together to create a rope. Your rope will need to reach from end to end of the tubes with about 6\" of space between them. [14] X Research source"
    },
    {
      "title": "Attach the rope to the tubes.",
      "content": "Attach the rope to the tubes. Unbraid the section of the rope that covers the cardboard tubes and tape them, spaced equally, around the outside of the tube. This should leave the braided section at the center. [15] X Research source"
    },
    {
      "title": "Cover the outside.",
      "content": "Cover the outside. Wrap the tubes completely in duct tape and continue wrapping so that the rope is covered as well. [16] X Research source"
    },
    {
      "title": "Done!",
      "content": "Done! Enjoy your nunchucks and be careful, especially if you used weights."
    }
  ]
}