{
  "url": "https://www.wikihow.com/Know-when-Google-Maps-Is-Coming",
  "title": "When Will a Google Street View Car Come to Your Area?",
  "steps": [
    {
      "title": "Google has a loose schedule for where their cars will be during the year.",
      "content": "Google has a loose schedule for where their cars will be during the year. Google’s cars come randomly, but you can see when they’re planning on visiting certain areas in a yearly time frame. Head to https://www.google.com/streetview/how-it-works , enter your country and region, and check to see when a car may be in your area. [1] X Research source Keep in mind that Street View cars can be delayed by weather, traffic, and other outside forces, which is why there isn’t a definitive schedule. Generally, Google Maps updates every 1 to 3 years, depending on the location."
    },
    {
      "title": "A Street View car is a 4-door car with a tall camera on top.",
      "content": "A Street View car is a 4-door car with a tall camera on top. Painted with Google Street View logos, these cars are usually easy to spot. But, if the decal doesn’t set it apart, the tall spherical camera on top will. Resting on a tall tripod that towers over other vehicles, this modular camera consists of 7 cameras that capture a 360° 3D image of the street. [2] X Research source Google doesn’t use a specific make or model for these cars, but the cars do need 4 doors to hold the tripod in place. A newer camera with a compact design with 2 spherical cameras (that resemble owl eyes) will start replacing older models in 2023. [3] X Research source"
    },
    {
      "title": "Google gives users creative liberty to publish their own Street View imagery.",
      "content": "Google gives users creative liberty to publish their own Street View imagery. Has a Google car not come by your neighborhood in years? Is there a trail you hike that’s not on a map? Uploading a 360° video of your favorite locations can help put your town on the map. Here’s what you need to do: [4] X Research source Gear up with a Street View-compatible camera, like the Insta360 Pro 2 , GoPro Max , or Labpano Pilot Era . Mount your camera on a vehicle or helmet and go for a drive, ride, or walk. Publish your images to the Street View Studio in your selected location. This process only works if your area is already on Google Maps."
    },
    {
      "title": "Google cars may not come when you’d like, but you can ask Google’s satellite to stop by your desired place.",
      "content": "Google cars may not come when you’d like, but you can ask Google’s satellite to stop by your desired place. Say you’ve done a lot of landscaping work on your house recently. Maybe you’ve installed a pool, built a barn, or planted trees. If the image of your property on Google Maps is from before those renovations, ask Google to take a new satellite image. [5] X Research source Head to Google Earth . Go to the area you’d like updated on the Map. Click the 3 bars on the top left-hand side of the screen and select “Feedback.” Type “I would like to recommend an imagery refresh” in the feedback window. Select “Capture screenshot.” Send your request. This doesn’t ensure a Google Satellite will come on a specific day or time."
    }
  ]
}