{
  "url": "https://www.wikihow.com/Make-a-Diaper-Wreath",
  "title": "How to Make a Diaper Wreath",
  "steps": [
    {
      "title": "Purchase a small wire wreath form from the craft store.",
      "content": "Purchase a small wire wreath form from the craft store. Choose a wreath that’s about 16 inches (41 cm) in diameter to fit around 16-20 diapers. Opt for a wire wreath if possible, since there are more places to secure the diapers than a cardboard or foam wreath, making the wreath sturdier. [1] X Research source If you plan to add more than 20 diapers, look for a form that’s at least 18 inches (46 cm) in diameter. When you’re purchasing diapers for the wreath, select sizes 1 or 2 so the baby can grow into them. If you want to make a cloth diaper wreath, be sure to ask the future parents if they would like to use the cloth diapers. Cloth diapers can be washed and reused many times as the baby is growing, but some parents prefer the disposable diapers!"
    },
    {
      "title": "Roll the diapers into your desired shape and secure them with a rubber band.",
      "content": "Roll the diapers into your desired shape and secure them with a rubber band. Unfold the diapers to roll them up tightly, or keep them folded for a foam or cardboard wreath. Then, wrap a rubber band around the outside of the diaper so that it doesn’t come undone before you put it on the wreath. [2] X Research source If you’re worried about the rubber bands being visible, try using a clear rubber hair tie instead, which will be harder to see."
    },
    {
      "title": "Slide the diapers in between the wires until the wire form is covered.",
      "content": "Slide the diapers in between the wires until the wire form is covered. Position the diapers on top of and in between the wires of the form to make the design you like. Layer them in front of and behind each other until all visible parts of the form are covered by a diaper. Once you use all of the diapers, you can adjust their position before you secure them to the wreath form. [3] X Research source For tightly rolled diapers, it may be better to work on the back layer of the wreath behind the middle wire first, since the rolls will be slightly smaller. Then, work on layering diapers in front of the wire to make sure it’s covered. If you’re using a cardboard or foam wreath form, simply lay the diapers along the form in a circle. Try to make sure all parts of the form are covered by a diaper!"
    },
    {
      "title": "Tie the diapers to the wreath form using ribbon.",
      "content": "Tie the diapers to the wreath form using ribbon. When you have all of the diapers in position, pick them up one at a time to wrap a ribbon of any width that’s about 12–18 inches (30–46 cm) long around one of the wires on the form. Then, have someone hold the diaper in place and tie a bow to secure it to the form. Do this for each diaper until they’re all attached to the wreath where you placed them before. [4] X Research source If you don’t have someone to hold the diaper for you, use a piece of masking tape to secure the diaper to the form so that it doesn’t move while you tie the ribbon. Once you have the diaper tied on, you can remove the tape. You can leave the bows on the front of the diapers, or you can slide the ribbon so that the bow faces the back of the wreath. If you’re using a cardboard or foam wreath form, you can tie the ribbon around the back of the form to hold the diaper in place. If you don’t want to use ribbon, you can use a dot of hot glue or double sided tape to attach the diapers."
    },
    {
      "title": "Tie on extra baby items with colorful ribbon for added gifts.",
      "content": "Tie on extra baby items with colorful ribbon for added gifts. Choose items like baby booties, bottles, spare onesies, and pairs of socks, which will come in handy when the baby is born. Secure them tightly to the wreath with the ribbon, and make sure they don’t move when you lift the wreath up. [5] X Research source If the baby is going to be born near a holiday, you might purchase a special decoration for the event. For example, if the baby is due in early December, you could tie a “Baby’s First Christmas” ornament to the wreath. If you know that the baby shower or the baby’s nursery has a theme, try to get toys or items that match the theme! For example, if the theme is Disney, you can get a few pairs of socks with Disney characters on them, a Disney character onesie, and a pair of mini Mickey Mouse ears!"
    },
    {
      "title": "Weave colorful tulle in between the diapers for an eye-catching feature.",
      "content": "Weave colorful tulle in between the diapers for an eye-catching feature. Take a piece of tulle that’s at least 24 inches (61 cm) long, and tuck one of the ends behind a diaper. Then, criss cross the fabric above and behind the diapers, wrapping all the way around the wreath. This will create a few pops of color on the wreath. [6] X Research source If you don’t want to weave the tulle, you can tie 4–6 in (10–15 cm) strips of tulle in between the diapers for smaller tufts of fabric around the wreath!"
    },
    {
      "title": "Attach a coordinating bow at the top of the wreath for a focal point.",
      "content": "Attach a coordinating bow at the top of the wreath for a focal point. Choose a colorful pre-made bow or make your own out of ribbon. Then, tie the bow to the very top of the wreath with the extra ribbon, or attach a twist tie to the bow if there isn’t any extra ribbon for tying. [7] X Research source For a bow with dangling ribbons, try tying it on the left or right side of the wreath so that the ribbon doesn’t cover up too many of the diapers."
    },
    {
      "title": "Add wooden letters to spell out the baby’s first or last name.",
      "content": "Add wooden letters to spell out the baby’s first or last name. Get a set of wooden letters at the craft store and decorate them with paint that coordinates with the colors on your wreath. If you know what the baby’s name will be, you can use that, or you can use the parents’ surname. When the letters dry, tie them tightly to the wreath with ribbon so that they rest on top of the diapers that you already have in place. [8] X Research source Keep in mind that wooden letters are heavy, so you should make sure they’re securely attached to the wreath form. If you’re using a cardboard or foam wreath, you can still use ribbon to tie the letters to the wreath. Just make sure they’re secure!"
    },
    {
      "title": "Present the wreath to the new parents so they can use it.",
      "content": "Present the wreath to the new parents so they can use it. Transport the wreath by laying it down flat, and give it as a gift at a baby shower or just before the baby is born. With the wreath, include a card to tell the parents what size the diapers are and how to remove them from the wreath, since they might not know how to! Some parents like to hang the wreath on the door of the delivery room in the hospital or on the door of their nursery. If you think they might like that, you can suggest it in your card!"
    }
  ]
}