{
  "url": "https://www.wikihow.com/Layer-Cut-Your-Own-Hair",
  "title": "At-Home Guide for Cutting Your Hair into Layers",
  "steps": [
    {
      "title": "Decide on a length for your layers.",
      "content": "Decide on a length for your layers. Take extra time to examine your hair and decide where you want the layers to be and how long you want them. To help you better visualize the final look, print out a picture of your face and use a pen to mark where you think the layers should go. Some people like long, natural-looking layers, while others choose to go for a bolder look with sharper distinctions between the different hair lengths. Take the following factors into consideration: Your hair texture. Layering tends to add body to hair, especially when some of the layers are short in length. If your hair is already full-bodied or curly, you may want to go for longer layers that don't differ much to frame your face. [1] X Research source Your face shape. Longer layers look gorgeous with round or square faces, while shorter layers accent faces that are oval or heart-shaped."
    },
    {
      "title": "Invest in a pair of hair cutting scissors.",
      "content": "Invest in a pair of hair cutting scissors . The most important tool required to make sure your hair turns out looking great is a sharp, professional-grade pair of hair cutting scissors. Using craft scissors or kitchen scissors can result in uneven cuts and overall choppy-looking results. If that’s not the look you’re going for, pick up a pair of hair cutting scissors online or at your local store. [2] X Research source"
    },
    {
      "title": "Set up a space in front of a mirror with all of your hair-cutting supplies.",
      "content": "Set up a space in front of a mirror with all of your hair-cutting supplies. Work in a well-lit place with access to a sink and a mirror. Gather together a towel to drape over your shoulders, a set of hair clips for holding back sections of your hair, your scissors, and a comb. Get a small, handheld mirror as well so that you can check the back of your hair. You may also need a spray bottle filled with water to keep your hair damp, depending on how fast it dries."
    },
    {
      "title": "Wash your hair and dry it until it’s just damp.",
      "content": "Wash your hair and dry it until it’s just damp. When you're ready to get started, wash your hair with shampoo and conditioner and comb out the tangles with a wide-toothed comb. Towel it dry so that it's damp, but not dripping. You’ll achieve the best results by starting with clean hair. [3] X Research source If you’re cutting curly hair into layers , completely dry your hair before cutting it. Or, just skip washing it altogether if that’s easier."
    },
    {
      "title": "Make a ponytail at the top of your head.",
      "content": "Make a ponytail at the top of your head. Turn your head upside down and use a comb to help gather up your hair. Use an elastic band to secure the ponytail at the top of your scalp. Make sure it’s exactly in the center of your head to avoid cutting uneven layers. [4] X Research source The ponytail should be on the top of your scalp, not the crown of your head. This ensures the layers will be positioned correctly."
    },
    {
      "title": "Slide the elastic down the length of your hair.",
      "content": "Slide the elastic down the length of your hair. If you want short layers, stop sliding the elastic several inches from the tip of your hair. For longer layers, slide it down until it's about 1 inch (2.5 cm) from the tips of your hair. [5] X Research source Alternatively, slide your fingers down instead of the elastic. This method is helpful if you have long hair. Another option is to tie a second elastic around your hair where you’ll be making your cut. [6] X Research source"
    },
    {
      "title": "Cut off the end of your hair below the elastic.",
      "content": "Cut off the end of your hair below the elastic. Use the scissors to snip off the ends of the hairs that are sticking out from the ponytail or from between your fingers. [7] X Research source If you have thick hair, it may take more than one snip to get through all of the layers. Make sure you cut them all in the exact same place. Don't cut at an angle, or the layers will come out jagged. Make sure you hold the scissors horizontally and cut them straight across."
    },
    {
      "title": "Remove the elastic and examine your layers.",
      "content": "Remove the elastic and examine your layers. You will have even, natural-looking layers around your head. To make the cut a bit softer-looking, take your scissors and point cut your hair . Turn the point of your scissors inwards towards your hair and cut upwards into your hair rather than across in a horizontal line. [8] X Research source"
    },
    {
      "title": "Divide your hair into even sections in the front, sides, and back of your head.",
      "content": "Divide your hair into even sections in the front, sides, and back of your head. To ensure your layers come out symmetrical on the right and left sides of your head, make each section as even as possible. Divide your hair using the following steps: Use a comb to create two parts on the very top of your head: one on the left side of your head, and one on the right. The hair in between these parts will be your top section. Divide the top section into a front and back section. The front part extends from the crown of your head to your forehead, and the back part extends from the crown of your head to the nape of your neck. Use hair clips to keep the sections in place. Make right and left front sections starting at your temples and ending at the top of your ears. Comb the right and left front sections out and hold them up with clips. Leave the back sections loose. You won't be cutting the longest part of your hair, so leave it down and use it as a guide to measure the other layers against."
    },
    {
      "title": "Trim the ends of the front top section.",
      "content": "Trim the ends of the front top section. Unclip the front top section and lift your hair straight above your head by holding it between your forefinger and middle finger. Keeping your hair between your fingers, bring it down in front of your face. Slide your fingers toward the tips of your hair until they are level with the place where you want your shortest layers to start. Trim the length of hair sticking out from between your fingers. It's common to cut the shortest layer just below the earlobe or right at the jawline. For longer hair, cut the shortest layer right at the shoulders. Your hair will appear shorter once it’s fully dried. Keep your layers a bit longer at first. You can always cut more if you need to."
    },
    {
      "title": "Cut the front right section so that it’s longer than the top section.",
      "content": "Cut the front right section so that it’s longer than the top section. Unclip the front right section of hair and lift it away from your head at a ninety-degree angle. Hold it straight between your forefinger and middle finger and bring it down the side of your face. Then, slide your fingers toward the tips of your hair until they are level with the place where you want the side layers to be cut. Use the scissors to trim the length of hair extending from your fingers. Hold a section of hair from the top section against the section you’re cutting to give yourself a guide to reference. To get softer-looking layers, trim at an angle rather than in a horizontal line, keeping the front of the section longer than the back."
    },
    {
      "title": "Trim the front left section so that it’s even with the right side.",
      "content": "Trim the front left section so that it’s even with the right side. Just as you did on the right side, lift the left section with your fingers at a ninety-degree angle away from your head. Hold it straight between your forefinger and middle finger and bring them down toward the tips of your hair until they are level with the place where the right side layer was cut. Then, snip off the ends of the hairs right below your fingers."
    },
    {
      "title": "Layer the hair in the back to add more dimension.",
      "content": "Layer the hair in the back to add more dimension. Take a section of hair from the very top of your head and use it as a guide when cutting the back portion of your hair. Divide the hair at the back of your head evenly down the middle, then bring the two sections over your right and left shoulders. Divide each section into two smaller sections to make cutting more manageable. Hold your guide section against your hair and cut each section either to the same length as the guide or a bit longer. [9] X Research source If you’re layering short hair and can’t bring the back section around to the front, use a handheld mirror to look at the back of your head and check your progress frequently."
    },
    {
      "title": "Comb your hair out and examine your layers.",
      "content": "Comb your hair out and examine your layers. Once you've finished cutting, check all of the layers to make sure they fall where you want them to. Check the evenness of your cut by examining the hair vertically and horizontally. If you see uneven layers, carefully trim the hair to make them look even."
    }
  ]
}