{
  "url": "https://www.wikihow.com/Make-a-Dictionary-of-Made-up-Words",
  "title": "How to Make a Dictionary of Made up Words",
  "steps": [
    {
      "title": "Get a piece of lined/plain paper and a writing utensil.",
      "content": "Get a piece of lined/plain paper and a writing utensil. It's recommended that you use a pencil so that you can erase your mistakes."
    },
    {
      "title": "Brainstorm.",
      "content": "Brainstorm. Write out the words that you want to include in your dictionary. For more fun, plan it out with friends so that you have a variety of different ideas."
    },
    {
      "title": "Define the words.",
      "content": "Define the words. Next to each word, include a clear definition. If you like, you could include an example of how it could be used in a sentence."
    },
    {
      "title": "Alphabetize the words.",
      "content": "Alphabetize the words. On a separate piece of paper, organize your words so that they'll be easier to find. Organize them by the first letter of the word, then the second, then the third, etc."
    },
    {
      "title": "Edit your rough draft.",
      "content": "Edit your rough draft. To ensure that you have a good dictionary, go through your paper and correct any mistakes. Be sure that you've correctly spelled each word and that you have clear definitions."
    },
    {
      "title": "Write your final copy.",
      "content": "Write your final copy. You can write it out by hand with a pen for a neater effect. Alternatively, you could type it up on Microsoft Word before printing it out."
    },
    {
      "title": "Design your cover.",
      "content": "Design your cover. There are many different ways that you can make a cover, so allow your imagination to run wild. You could design one with markers and construction paper, or you could make one on your computer and print it out."
    },
    {
      "title": "Enjoy your dictionary!",
      "content": "Enjoy your dictionary! Make sure to show to friends and family!"
    }
  ]
}