{
  "url": "https://www.wikihow.com/Make-a-Mushroom-Omelette",
  "title": "How to Make a Mushroom Omelette",
  "steps": [
    {
      "title": "Wash the mushrooms and cut them into thin slices.",
      "content": "Wash the mushrooms and cut them into thin slices. You can leave the stems on, or discard them. Be sure to scrub the mushrooms with a soft-bristled brush to remove any dirt. You don't need to peel them."
    },
    {
      "title": "Heat 1 teaspoon (5 grams) of unsalted butter in a medium-sized frying pan over medium heat.",
      "content": "Heat 1 teaspoon (5 grams) of unsalted butter in a medium-sized frying pan over medium heat. Save the rest of the butter for frying the eggs. Wait until the butter starts to sizzle and foam. Alternatively, add a little avocado oil to a nonstick frying pan over medium heat and let it warm."
    },
    {
      "title": "When the butter starts to sizzle, add the mushrooms, some salt, and some pepper.",
      "content": "When the butter starts to sizzle, add the mushrooms, some salt, and some pepper. How much salt you use is up to your personal tastes. For extra flavor, add 1 clove of minced garlic. [2] X Research source You can also add some sliced onion or scallions. [3] X Research source"
    },
    {
      "title": "Fry the mushrooms until they turn soft and brown.",
      "content": "Fry the mushrooms until they turn soft and brown. This will take about 4 minutes. [4] X Research source Stir the mushrooms from time to time using a spatula, so they don't burn."
    },
    {
      "title": "Remove the mushrooms from the pan, and set them aside.",
      "content": "Remove the mushrooms from the pan, and set them aside. Place them into a bowl or onto a plate. Cover them with a lid, plate, or a piece of foil to keep them warm. You will be adding the mushrooms to your omelette just before serving it."
    },
    {
      "title": "Crack two eggs into a bowl, and add the salt, pepper, and water.",
      "content": "Crack two eggs into a bowl, and add the salt, pepper, and water. For a lighter omelette, use 4 egg whites instead. [5] X Research source The water will evaporate when you fry the eggs, and help make them fluffier in the end. [6] X Research source"
    },
    {
      "title": "Beat the eggs with a fork until they turn frothy.",
      "content": "Beat the eggs with a fork until they turn frothy. If you are using whole eggs (instead of whites), make sure that you break the yolks up. You won't be scrambling the eggs once you add them into the frying pan."
    },
    {
      "title": "Heat the rest of the butter in the frying pan over medium-high heat.",
      "content": "Heat the rest of the butter in the frying pan over medium-high heat. The butter will start to sizzle and foam. Don't add the eggs yet. Instead, wait until the foam starts to disappear. [7] X Research source"
    },
    {
      "title": "Tilt pan to coat the bottom with oil, then add the eggs.",
      "content": "Tilt pan to coat the bottom with oil, then add the eggs. Once you have the eggs on the pan, continue tilting the pan around until the entire bottom is evenly covered with the egg mixture. [8] X Research source If necessary, use the tip of your spatula to help spread the egg mixture across the bottom of the pan. For extra flavor, add 2 chopped, green shallots. [9] X Research source"
    },
    {
      "title": "Let the omelette cook until the edges turn firm, then pull the edges away from the sides of the frying pan.",
      "content": "Let the omelette cook until the edges turn firm, then pull the edges away from the sides of the frying pan. This will happen after only a few seconds. Pulling the edges of the omelette away from the pan will allow the raw egg mixture to flow onto the hot pan and cook. [10] X Research source"
    },
    {
      "title": "Let the omelette cook for about 1 minutes.",
      "content": "Let the omelette cook for about 1 minutes. As it continues to cook, it will turn opaque and set. Don't \"scramble\" the omelette during this time, or you will get scrambled eggs instead."
    },
    {
      "title": "Add the mushroom mixture when the omelette still has some raw egg on top.",
      "content": "Add the mushroom mixture when the omelette still has some raw egg on top. Only cover half of the omelette with the mushroom mixture; you will be folding the omelette in half. Don't worry, the omelette will continue to cook, even after you take it off the frying pan. If you'd like some extra flavor, add ¼ cup (25 grams) of shredded cheese. Popular choices include: cheddar, parmesan, and gruyere. [11] X Research source [12] X Research source"
    },
    {
      "title": "Fold the omelette in half.",
      "content": "Fold the omelette in half. Use your spatula to gently separate the edges of the omelette from the frying pan. Then, slip the spatula under the bare side of the omelette, and flip it over onto the mushroom side. [13] X Research source"
    },
    {
      "title": "Slide the omelette onto a plate and serve it immediately.",
      "content": "Slide the omelette onto a plate and serve it immediately. If you'd like, you an garnish the omelette with some chopped chives, parsley, or grated cheese. Don't wait too long, however, or the mushrooms will turn greasy and cold."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}