{
  "url": "https://www.wikihow.com/Make-Glue-Dry-Faster",
  "title": "How to Make Glue Dry Faster",
  "steps": [
    {
      "title": "Leave your project in the sun to dry large areas of glue.",
      "content": "Leave your project in the sun to dry large areas of glue. Pick a sunny spot in either your home or garden. Place your project in the sun for several hours until the glue is dry. This method is ideal as you don’t have to monitor the process and you can even leave your project out overnight if you prefer. If you are going to be drying the glue in a sunny spot indoors, either pick a well-ventilated area or open some windows to help speed up the process even more."
    },
    {
      "title": "Use a heater to increase the room temperature.",
      "content": "Use a heater to increase the room temperature. Place your project in the same room as a heater. Turn the heater on and set it to a warm, comfortable temperature. Shut any doors and windows in the room if possible to keep the heat contained in the room so that the glue can dry faster. Using a heater is best for cooler, winter months, as the extra heat may feel as though it’s too much during warmer temperatures. This method is ideal if your project is taking too long to dry in the sun."
    },
    {
      "title": "Use an electric blanket to speed up the curing process.",
      "content": "Use an electric blanket to speed up the curing process. Lay an electric blanket flat on the ground. Switch it on, place your project on top, and leave it resting there until the glue has cured. Alternatively, you can cover your project with an electric blanket if it’s easier. It’s best to use an old electric blanket if possible in case any glue sticks to it. If you are going to be using an electric blanket for this purpose regularly, it may be best to purchase a secondhand one."
    },
    {
      "title": "Use a hairdryer to help small areas of glue dry.",
      "content": "Use a hairdryer to help small areas of glue dry. Hold the hairdryer approximately 12 in (30 cm) away from the surface for 2-3 minutes. Make sure that the air flow is directed at the glue. [1] X Research source Don’t use the hairdryer to dry the glue for extended periods of time as the excess heat could damage your project. Keep a close eye on it at all times."
    },
    {
      "title": "Use a fan to keep the area well-ventilated.",
      "content": "Use a fan to keep the area well-ventilated. Many types of glue cure with air exposure. This means that the more air that the glue is exposed to, the faster that it will dry. Set up and turn on 1-2 fans around the surface that you are drying. Make sure that the fans are pointing towards the glue. [2] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 28 April 2021."
    },
    {
      "title": "Apply an accelerator product if you are using super glue.",
      "content": "Apply an accelerator product if you are using super glue. Accelerators are designed to speed up the time that it takes for the glue to cure. Hold the spray bottle approximately 1 foot (30 cm) away from the super glue that you have applied. Then dispense the accelerator sparingly over the super glue, making sure that the coat is even. [3] X Research source Avoid applying too much accelerator, as this can make the surface turn white. This is a cosmetic problem called blooming. The accelerator will cause the super glue to turn solid after only a few minutes. [4] X Research source"
    },
    {
      "title": "Dry hot glue instantly using compressed air.",
      "content": "Dry hot glue instantly using compressed air. Turn the can of compressed air upside down. Spray the compressed air over the hot glue that you have just applied. The compressed air chills the glue and causes it to dry in just a few seconds. [5] X Research source Be very careful when you are using compressed air, as it can burn your skin on contact."
    },
    {
      "title": "Work in a warm environment with low humidity if possible.",
      "content": "Work in a warm environment with low humidity if possible. Glue cures the fastest when the temperature is high and the amount of moisture in the air is low. If you can pick a day to work with glue, try to choose a warm, sunny day with low humidity. [6] X Research source A cooler temperature or higher humidity will slow down the drying time of all types of glue."
    },
    {
      "title": "Make sure that the surface is dry before you apply the glue.",
      "content": "Make sure that the surface is dry before you apply the glue. Wipe down the surface to remove any excess water before you begin applying the glue. [7] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 28 April 2021. If you are working with a damp, porous surface such as wood, let it air-dry for 2-3 days first in a well-ventilated area until it is dry to touch. [8] X Research source It will take much longer for the glue to dry if it is applied to a wet surface and it may not cure properly at all."
    },
    {
      "title": "Choose a quick-dry glue if possible.",
      "content": "Choose a quick-dry glue if possible. Quick-dry adhesives are designed to cure faster than standard types of glue. Check if there is a quick-dry option for the type of glue that you need. Fast-setting types are generally available for wood and super glues. [9] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Use the smallest amount of glue that you need.",
      "content": "Use the smallest amount of glue that you need. Follow the directions on the label of the glue closely and only use as much as is directed. For many types of glue, 1 drop spread out over 1 in2 (6.5 cm2) is enough. Use a thin piece of plastic or a toothpick to spread out or remove some glue if necessary. [10] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 28 April 2021. [11] X Research source If you have used too much glue, it will take much longer to dry. The thinner the layer of glue, the more quickly it will dry."
    }
  ]
}