{
  "url": "https://www.wikihow.com/Hide-Text-Within-an-Image",
  "title": "How to Hide Text Within an Image",
  "steps": [
    {
      "title": "Choose an image file.",
      "content": "Choose an image file. For example: XXX.jpg"
    },
    {
      "title": "Place this image in one of the drives in your computer system (running on Windows operating system only).",
      "content": "Place this image in one of the drives in your computer system (running on Windows operating system only). Lets say you place it in \\:D drive."
    },
    {
      "title": "Open command prompt.",
      "content": "Open command prompt. (Press Windows+R , type 'cmd' and press 'Enter' key)"
    },
    {
      "title": "Type following command:",
      "content": "Type following command: cd.. and press 'Enter' key. Repeat this step until you left with C:\\> on your command prompt window. See this image:"
    },
    {
      "title": "Now, type D:",
      "content": "Now, type D: and press 'Enter' key. See this image: Now, your command prompt is able to locate D: drive."
    },
    {
      "title": "Type following command very carefully:",
      "content": "Type following command very carefully: echo \"Type your message here\" >> \"XXX.jpg\" and press 'Enter' key. Do mind the spaces given and braces I put in the command. See this image:"
    },
    {
      "title": "If everything went perfect, Your text has been hidden within the image file XXX.jpg.",
      "content": "If everything went perfect, Your text has been hidden within the image file XXX.jpg."
    },
    {
      "title": "In order to see the hidden text, Right-click 'XXX.jpg' image file and open it with 'Notepad'.",
      "content": "In order to see the hidden text, Right-click 'XXX.jpg' image file and open it with 'Notepad'. You'll see something like shown in this image: This is actually your image information in encrypted form. You've nothing to do with this."
    },
    {
      "title": "Simply, scroll down to the end or just keep pressing 'Page dn' key.",
      "content": "Simply, scroll down to the end or just keep pressing 'Page dn' key."
    },
    {
      "title": "Here you're!",
      "content": "Here you're! You can see the text (you typed in Step 6) in simple readable form in the end. See this highlighted text in the image: You can check this is what I typed in the image shown in Step 6."
    },
    {
      "title": "You can also hide a file within an image file read How To Hide A File In An Image File.",
      "content": "You can also hide a file within an image file read How To Hide A File In An Image File ."
    }
  ]
}