{
  "url": "https://www.wikihow.com/Harvest-Almonds",
  "title": "How to Harvest Almonds",
  "steps": [
    {
      "title": "Harvest almonds when the hulls begin to split open.",
      "content": "Harvest almonds when the hulls begin to split open. Hull split will begin with the nuts at the top of the tree rather than the ones at eye level, so make sure to check the fruits that are higher up! Once the hull splits, you’ll be able to see the in-shell almond inside. [2] X Research source Almonds in the U.S. most commonly come from California and harvesting will take place from early August to late September. In southern hemisphere locations, such as Australia, harvesting is done between February and April. [3] X Research source The almond tree goes from dormancy during the winter months, to blossoming (flowers on the tree), to maturing of the nuts (this is when the flowers fall off and fuzzy gray fruit begins to grow), to fully mature nuts on the tree, and finally to hull-split. Then, you can harvest the nuts. The hull of the almond has a thick, leathery, green-gray coat with a fuzzy exterior (like a peach). Inside of the hull is a wood-like shell, and inside of that shell is where you find the actual nut, or kernel, that you eat. When a hull has split open, you will see the shell inside, and the brown shell should be starting to split open, too. This crack indicates the almond is ripe. [4] X Research source"
    },
    {
      "title": "Put a clean, dry tarp beneath the tree when you are ready to harvest.",
      "content": "Put a clean, dry tarp beneath the tree when you are ready to harvest. This will make the gathering process much easier after you’ve shaken the nuts from the tree! Instead of picking hundreds of nuts off the ground, you’ll be able to pick up your tarp, thus saving you a lot of time. [5] X Research source The tarp also helps protect the nuts from ants or other insects that might try to crawl inside the hull."
    },
    {
      "title": "Strike the branches with a rubber mallet to knock down the nuts.",
      "content": "Strike the branches with a rubber mallet to knock down the nuts. Start at the end of the branch and work your way toward the trunk of the tree. The nice thing about almonds is that you don’t have to pick them individually from the tree. [6] X Research source Rubber mallets are used for harvesting many different kinds of nuts and can be purchased online or at a local garden supply store. If you don’t have a rubber mallet, you could also use a broom handle or a long plastic pole. Make sure to wear protective eyewear and a hard hat! The nuts will follow the mallet down toward you, so you want to protect your eyes and your head. There will also be a lot of dust floating around from the hulls, so keeping the debris out of your eyes is important. [7] X Research source"
    },
    {
      "title": "Remove the hull of the almond with your hands.",
      "content": "Remove the hull of the almond with your hands. Because the downy hull has already split open, all you need to do is peel it off of the shell. It’s best to do this right after shaking the almonds from the tree to keep the almonds as fresh as possible. Consider composting the hulls to dispose of them in an environmentally friendly way."
    },
    {
      "title": "Dry the nuts in the sun for 2 days to reduce risk of mold.",
      "content": "Dry the nuts in the sun for 2 days to reduce risk of mold. Place your hulled shells on a tray or screen and leave in the sun. Stir or shake the shells several times a day, and make sure to keep the shells dry! If there is going to be rain, move your trays inside immediately. [8] X Research source Cover your trays with netting to protect the almonds from birds and pests. If your nuts are still not dry after 2 days, that is okay! Depending on humidity and moisture levels, it can sometimes take up to 1 week for almonds to fully dry."
    },
    {
      "title": "Crack the shell of 1 or 2 nuts with a nutcracker to determine if they are dry.",
      "content": "Crack the shell of 1 or 2 nuts with a nutcracker to determine if they are dry. Break the almond open, and if it is rubbery to the touch, that means it is not dry yet. It should be crisp and brittle when you break it. Leave your trays in the sun until they all are fully dried. [9] X Research source When the nuts are completely dry, you can shake the shell and feel the nut moving around on the inside. [10] X Research source"
    },
    {
      "title": "Store nuts",
      "content": "Store nuts in an airtight container. This will protect them from absorbing the odors of other foods, and it will keep them safe from bugs, ants, or other insects that want to eat them. When stored properly, almonds can last for up to 2 years. [11] X Research source Keep the almonds in a cool, dry place to help them last even longer."
    },
    {
      "title": "Store almonds at room temperature for up to 8 months.",
      "content": "Store almonds at room temperature for up to 8 months. A temperature around 68 °F (20 °C) will keep almonds fresh. If you are keeping the nuts on the counter, try to keep them away from direct sunlight as that will change the flavor over time. [12] X Research source Don’t store nuts near other foods that have a strong smell, like garlic or onions. Almonds can absorb odors, so try to keep them separate. [13] X Research source"
    },
    {
      "title": "Refrigerate almonds to keep them fresh for 1 year or more.",
      "content": "Refrigerate almonds to keep them fresh for 1 year or more. 32–45 °F (0–7 °C) is ideal to keep almonds fresh and safe to consume. Nuts can last for several years when stored properly, though some people don’t like the taste or texture of almonds past 1 year—they can shrink and get wrinkly. [14] X Research source You can freeze almonds before storing them in the fridge to kill pests, like the navel orange worm. Freeze nuts in an airtight container for 48 hours and then move them to the fridge. Make sure to put the nuts into a new, clean, airtight container when moving them to the fridge. [15] X Research source"
    }
  ]
}