{
  "url": "https://www.wikihow.com/Help-Postnasal-Drip-at-Night",
  "title": "How to Help Postnasal Drip at Night",
  "steps": [
    {
      "title": "Sleep with an extra pillow to prevent mucus from gathering at the back of your throat.",
      "content": "Sleep with an extra pillow to prevent mucus from gathering at the back of your throat. Have you noticed that your throat feels clogged or scratchy when you wake up? While you sleep, mucus might be collecting in the back of your throat. To make yourself more comfortable, prop your head up with an extra pillow or two. [1] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you're still really uncomfortable in bed, try sleeping in a reclining armchair until your postnasal drip improves."
    },
    {
      "title": "Run a humidifier in your bedroom so moisture thins the mucus.",
      "content": "Run a humidifier in your bedroom so moisture thins the mucus. If it's dry in your bedroom, the mucus in your throat and nasal passage might thicken and make you feel uncomfortably stuffed up. To relieve pressure and make it easier to swallow, run a humidifier in your bedroom so you breathe in moist air while you sleep. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Don't have a humidifier? Don't worry—take a steamy shower before you go to bed. Breathing in the moist steam can help you feel less clogged."
    },
    {
      "title": "Use a neti pot or squeeze bottle to flush out some of the excess mucus.",
      "content": "Use a neti pot or squeeze bottle to flush out some of the excess mucus. Fill a sterile squeeze bottle or neti pot with warm saline solution. Then, stand over a sink and tilt your head at a 45-degree angle. Breathe in and slowly pour the saline solution into the upper nostril so it drains out of the bottom one. Repeat this for the other nostril to clear your nasal passages of excess mucus. [3] X Research source You can buy the saline solution from the pharmacy or make your own. Just mix 1/8 teaspoon (0.75 g) of table salt with 1 cup (240 ml) of warm distilled water."
    },
    {
      "title": "Reach for antihistamines if you feel stuffed up.",
      "content": "Reach for antihistamines if you feel stuffed up. If uncomfortable pressure or clogged sinuses from postnasal drip are making it hard to sleep, try oral antihistamines like diphenhydramine or chlorpheniramine. These work by narrowing the blood vessels in your nose so it's easier to breathe and get comfortable. They can also make you drowsy. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Antihistamines reduce mucus-production to relieve postnasal drip and they usually make you drowsy so they're great for nighttime. Read the manufacturer's dosing instructions so you know how much medication to take and how often to take it. Most oral antihistamines shouldn't be used for more than 2 or 3 days."
    },
    {
      "title": "Reach for an intranasal corticosteroid spray to treat nighttime coughing.",
      "content": "Reach for an intranasal corticosteroid spray to treat nighttime coughing. If it's the constant coughing and stuffiness that keeps you up at night, use an intranasal spray about 2 hours before you go to bed. This gives the medication a chance to start working before you try to fall asleep. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Look for sprays that contain fluticasone or triamcinolone to treat postnasal cough. Always follow the manufacturer's dosing instructions."
    },
    {
      "title": "Avoid taking decongestants before bed since these can make you alert.",
      "content": "Avoid taking decongestants before bed since these can make you alert. Most decongestants contain pseudoephedrine which works to open up stuffy sinuses. Unfortunately, it can make you feel jittery or keep you awake, so just use it during the daytime. [6] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Read OTC sinus medications carefully since some contain combinations of antihistamines and decongestants. Always follow the manufacturer's dosing instructions."
    },
    {
      "title": "Soothe your throat and manage nighttime coughs.",
      "content": "Soothe your throat and manage nighttime coughs. Hopefully, you won't wake up with coughing or a scratchy throat, but if you do, have a glass of water on your bedside table. Water can temporarily stop you from coughing and it can help you clear mucus that's stuck in the back of your throat. [7] X Research source Stay hydrated throughout the day, too! Sip water, decaffeinated tea, or juice to keep the mucus moving. If your throat dries out, it might start to feel scratchy."
    },
    {
      "title": "Set up a soothing station on your bedside so you don't have to get up in the night.",
      "content": "Set up a soothing station on your bedside so you don't have to get up in the night. It's bad enough to be woken by a cough or throat irritation so make things easier on yourself by keeping water, cough drops, tissues, or pain relievers next to your bed. [8] X Research source Have a bedside lamp or small light available so you can see your medication."
    },
    {
      "title": "Minimize screen time and do something calming before you try to sleep.",
      "content": "Minimize screen time and do something calming before you try to sleep. It can be hard to fall asleep even when you're not suffering from postnasal drip! Bright computer or tv screens and loud music could keep you energized, making it harder to drift off. To set yourself up for sleep success, avoid screens a few hours before you sleep and do something relaxing like journaling, yoga, or reading. [9] X Research source Skip the caffeine and alcohol so it doesn't keep you alert when you're trying to fall asleep."
    }
  ]
}