{
  "url": "https://www.wikihow.com/Identify-a-German-Shepherd",
  "title": "How to Identify a German Shepherd",
  "steps": [
    {
      "title": "Examine the coat.",
      "content": "Examine the coat. German Shepherds can have three different varieties of coat: double coat, plush coat, and long haired coat. The breed standard is the double coat, which consists of dense, straight, short hair that lies close to the body. The long haired coat is also quite common among German Shepherds that are family pets. [1] X Research source German Shepherds shed consistently throughout the year, and require regular brushing."
    },
    {
      "title": "Look for tan and black colouring.",
      "content": "Look for tan and black colouring. The most common colouring for a German Shepherd is black and tan; however, the breed can also appear in all black. Typically the coat is predominantly tan with black facial and saddle markings. [2] X Research source"
    },
    {
      "title": "Recognize variations in colouring.",
      "content": "Recognize variations in colouring. In rare instances, German Shepherds can have white, blue, or reddish brown coats. These colours are not recognized by the breed standard, but do occur periodically. In fact, the white German Shepherd is actually considered a separate breed in some areas and is called the American White Shepherd. [3] X Research source Black and tan German Shepherds with white markings are sometimes called the Panda Shepherd. The white colouring usually takes up 35% of the dog's coat. [4] X Research source"
    },
    {
      "title": "Examine the dog’s strong build.",
      "content": "Examine the dog’s strong build. The German Shepherd is part of the working dog classification and has a strong proportioned build. Typically, the German Shepherd is 22 to 26 inches (56 to 66 cm) tall and weighs between 50 and 90 pounds (23 and 41 kg). [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source It has a narrow and deep chest, and the front legs and shoulders are muscular and sloping. Its body is slightly longer than it is deep, measuring from the shoulders to the rump. [6] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source German Shepherd puppies typically weigh 7-9 pounds (3-4 kg) after the first month and will continue to grow steadily throughout their first year. By six months they will weigh approximately 50-57 pounds (22-26 kg)."
    },
    {
      "title": "Look for pointed ears.",
      "content": "Look for pointed ears. German Shepherds have very distinct pointed ears that are erect. They are long at the base and face forwards, making the shape of a triangle. As puppies, the tips of the ear may flop over slightly, but they will straighten as the dog ages. [7] X Research source"
    },
    {
      "title": "Notice the bushy tail.",
      "content": "Notice the bushy tail. German Shepherds have a long and bushy tail that hangs down when the dog is resting. When a German Shepherd is alert or in motion, the curve of the tail is accentuated and the tail will be slightly raised. [8] X Research source"
    },
    {
      "title": "Notice the dog's loyalty.",
      "content": "Notice the dog's loyalty. German Shepherds can be fairly aloof and reserved when first meeting new people. However, once the dog has formed a connection with their owner, they are extremely loyal. German Shepherds are usually friendly and loyal to their family, but can be protective if they feel threatened. [9] X Research source"
    },
    {
      "title": "Recognize the dog's energy level.",
      "content": "Recognize the dog's energy level. German Shepherds are high energy dogs and they need lots of daily exercise. If a German Shepherd is left a lone for long periods of time it will likely become bored and destructive. For example, the dog may start barking, chewing things, or digging. Make sure that your German Shepherd receives at least 1 hour of exercise each day. [10] X Research source Every German shepherd is different, so their individual temperaments can vary."
    },
    {
      "title": "See if the dog is trainable.",
      "content": "See if the dog is trainable. This breed is highly intelligent and trainable. They like to have a job or task to do, and you can train a German Shepherd to do a variety of different jobs. For example, German Shepherds are often used as \"working\" dogs, helping with search and rescue, drug sniffing and security, as well as providing aide and assistance to the visibly impaired. [11] X Research source Take your German Shepherd to obedience classes to train the dog to follow commands and complete a variety of tasks. This is fun and stimulating for the dog."
    },
    {
      "title": "See if the dog have sense of possession.",
      "content": "See if the dog have sense of possession. This breed is known to herd the sheep, count them, and keep them safe. This sense of possession make them apt for guarding a family. A pet can guard when he knows what all belongs to him and what does not. This ability helps a German Shepherd to differentiate between an enemy and the family. Protection to this breed comes naturally and that's why they are known as police dogs, too. German Shepherds are fantastic with your own kids and can act strange with the strangers and other kids."
    },
    {
      "title": "Ask the owner.",
      "content": "Ask the owner. If you see a dog that you think might be a German Shepherd and are curious about the breed, approach the owner and ask. For example, you could say something like “Is that a German Shepherd? It is such a cute dog.” Alternatively, you could say “What kind of dog do you have? I am considering getting one.” Most dog owners will be happy to tell you about their dog and the breed."
    },
    {
      "title": "Talk with your veterinarian.",
      "content": "Talk with your veterinarian. If you are unsure of your dog’s breed or lineage, ask your veterinarian to help you identify the breed. Veterinarians will be familiar with the breed standard of most dog breeds. They will be able to easily examine the physical characteristics of the dog to help with identifying the breed."
    },
    {
      "title": "Ask the breeder.",
      "content": "Ask the breeder. If you are purchasing a German Shepherd from a breeder, you should talk with the breeder about the puppy’s parentage and lineage to make sure that you are getting a purebred dog. A licensed breeder will be able to provide you with paperwork that proves both parents are recognized as German Shepherds by the American Kennel Club. Make sure that you always use a breeder that is licensed by the American Kennel Club. This will also help to ensure that you are purchasing a purebred dog."
    },
    {
      "title": "Download a dog breed identification app.",
      "content": "Download a dog breed identification app. There are a number of applications available that can help to identify different dog breeds. In order to use the app, simply upload a photo of a dog and the app will identify the breed. [12] X Research source For example, try using the Microsoft app called Fetch! These apps are not always 100% accurate, but a German Shepherd has fairly unique characteristics."
    },
    {
      "title": "Purchase a DNA test kit online.",
      "content": "Purchase a DNA test kit online. Search Google for a “dog DNA test kit.” These kits cost approximately $80 to $100 and can be ordered online. [13] X Research source"
    },
    {
      "title": "Read and follow the instructions.",
      "content": "Read and follow the instructions. Once you receive the DNA test kit in the mail, open the package and carefully read all of the instructions. The instructions will provide you with steps on how to take a DNA swab and then how to return the results to the lab for testing. Each kit is only designed to test the DNA of one dog."
    },
    {
      "title": "Swab the dog’s cheek.",
      "content": "Swab the dog’s cheek. The kit will likely come with two swabs. They are both to be used on the same dog. Open your dog’s mouth and rub the swab across the inside of the dog’s cheek. Do the same thing with each of the swabs."
    },
    {
      "title": "Mail the kit.",
      "content": "Mail the kit. Place the swabs into the plastic baggies provided. Then place them in the pre-paid return envelope or box. Once sealed, mail the results to the lab for testing."
    },
    {
      "title": "Read the results.",
      "content": "Read the results. Approximately three weeks after you complete the test, you will receive detailed DNA results. Your dog’s DNA will be compared to approximately 200 different breeds. If you have a German Shepherd, a DNA test will easily be able to identify this breed. The results can even test to see if your dog is a mixed-breed that is part German Shepherd."
    }
  ]
}