{
  "url": "https://www.wikihow.com/Improve-Your-Attitude",
  "title": "How to Improve Your Attitude",
  "steps": [
    {
      "title": "Identify what attitude needs changing.",
      "content": "Identify what attitude needs changing. Have a clear understanding what needs changing. Setting goals is the key to success in any venture. You need to do an honest and in-depth self-evaluation. This will help you point out exactly which of your traits need improvement or change. [1] X Research source"
    },
    {
      "title": "Assess why you want to improve your attitude.",
      "content": "Assess why you want to improve your attitude. Your motivation for change directly impacts your ability to change. Thus, you need to want to change your attitude to improve it and must prepare to play an active role in this process. [2] X Research source Ask yourself why you want to improve your attitude about a certain person, object or event. Is your decision to do so externally influenced? For example, has your boss come to you and asked for an attitude change? Or has a friend said that your attitude is bumming them out? Thus, having your own motivation to improve your attitude is important . Drawing upon internal motivation produces more excitement and creativity, leading to better results."
    },
    {
      "title": "Try journaling to facilitate self-reflection.",
      "content": "Try journaling to facilitate self-reflection. When trying to improve your attitude about a person, object, situation, or event, you need to examine what is influencing your attitude. What you are basing your value judgment on? What do you hope to accomplish by adjusting your attitude. Journaling is important for self-reflection. It can help you understand yourself with greater clarity, make stronger and more thoughtful decisions, and help you engage in self-care. It is deeply connected to improving your mental well-being and mood. [3] X Research source Here are some good questions to get you started on this path of self reflection: Will improving my attitude make me feel better about this person or event? Will it alleviate uncomfortable emotions? Will improving my attitude ensure better communication with others? Or will people look upon me more favorably? Will it allow me to work more effectively with this group or person? Will improving my attitude help me accomplish a goal or change something about the event? What is influencing my judgment about this person, event, or object? Have I had a similar experience in the past? What was it? What about the experience was negative? What emotions do I have surrounding my judgment? Am I resentful, angry, jealous, etc.? What are the reasons for these feelings? Is there a specific belief that is influencing my attitude (judgment)? If so, what is it? How does this belief connect to my attitude about this specific person, event, or object? Is my belief being challenged? Is this belief open to evaluation or augmentation?"
    },
    {
      "title": "Visualize how an improved attitude will affect your life.",
      "content": "Visualize how an improved attitude will affect your life. Visualization techniques are a way of imagining or seeing your goals realized. They can help bolster your commitment to those goals. Athletes, like Usain Bolt, top businessmen, and career educators endorse visualization techniques. Visualization techniques help to activate your creative subconscious. This can assist you in developing strategies to help you reach your goals. It also helps keep you focused, motivated, and programs your brain to realize the resources you will need to succeed. So, if you want to improve your attitude, imagine what it would be like if you were successful. What would happen if you began to have a positive attitude towards a specific person? Or if you started to embrace your job more? [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To engage in visualization, sit in a comfortable position and close your eyes. Then imagine, with as much detail as you can (like a very vivid dream) what you would be seeing if you successfully changed your attitude. Imagine that you're seeing the results with your own eyes. Maybe during this technique, you see yourself actually becoming friendly and even having lunch with this person you had previously held a negative attitude about. Or perhaps you envision yourself getting a promotion once you start thinking more positively about your job and finding ways to be more efficient. You could also add some positive affirmations to support your visualization techniques. An affirmation evokes the experience of already having what you want, yet it is in the present tense. For example, \"I get up in the morning and look forward to going to work. I'm excited about the new project I started up with support from my boss.\" Repeat these affirmations several times a day and you'll feel more goal-directed and motivated."
    },
    {
      "title": "Gather more information.",
      "content": "Gather more information. To improve your attitude, you will need to challenge your current judgements of people, events, or objects. To do so, you will need additional information. Improving your attitude requires you to seek out alternative information that will favorably influence your judgment. Information gathering may involve talking to people, reflecting on what you already know with a closer eye to the details or doing additional research. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, if you are required to attend a work dinner and now understand you are resentful because you have to miss your son’s baseball game, you can seek out additional information about the work dinner. Think about why the dinner is important and what the company believes they are accomplishing with a mandatory dinner. To gather this information, you may talk to your colleagues or manager, do research on your company, or use resources, such as a memo about the dinner. Seeking out new sources of information like this may inform you that the dinner functions as a mentoring program for young associates and it can provide career boosts and promotions. Knowing this information may help you feel more positive about the dinner. [6] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source"
    },
    {
      "title": "Take into account things you have ignored.",
      "content": "Take into account things you have ignored. Another aspect of information gathering means considering things that you may have ignored or missed in the past. Sometimes we experience tunnel vision and can only focus on the one thing that we see or that is rousing a particular response from us. However, take a step back and look at the bigger context. This can help you identify new information that you may have overlooked and that can aid you in reshaping your attitude. For example, if you have a negative attitude about a certain person because you had an uncomfortable first meeting, you can expand your view of the person by seeking information that may not have mattered to you previously. Understanding more about the person can give you a bigger picture of who he or she is, which may change your original negative judgment of her, thus effectively changing and improving your attitude."
    },
    {
      "title": "Believe in change.",
      "content": "Believe in change. One of the most important factors in changing your attitude is believing that you can in fact make the change needed. A lot of times we just assume our attitudes are natural and an essential part of ourselves and thus unchangeable. However, if you don't believe that you can change your attitude, then you won't be able to. You either won't start in the first place, give up quickly, or only every make the attempt half-heartedly. [7] X Research source One way to believe in the possibility of change and improvement is to recall other instances where you've improved your life. Perhaps when you were in school, you decided that you were going to have a better attitude about your education and put more effort in. And the result was an increased GPA (grade point average). Try to come up with as many experiences or times when you made a goal to change and were successful. This is the best way to instill belief in yourself."
    },
    {
      "title": "Let things go.",
      "content": "Let things go. Holding on, worrying, and fretting can help contribute to negative attitudes and have adverse affects on your mental health. Instead, recognize that you can't control everything. You can't control that someone else got a promotion over you. What you can control is how those events affect your attitude and how you respond. Minimize the room for negativity by letting go of what you can't control. Move on and try not to let those things sour your general outlook on life. [8] X Research source One way to let things go is to try to avoid thinking that you have been personally singled out for suffering, pain, sadness, etc. Most of the time, life amounts to a series of circumstances and events that have little to do with us individually. Try to avoid thinking of yourself as a victim. Seeing yourself as a victim will cause you to think repeatedly about the negative emotions you have experienced. Remember that life is for living, not dwelling."
    },
    {
      "title": "Identify your strongest qualities and accomplishments.",
      "content": "Identify your strongest qualities and accomplishments. Focus on your strengths to help create more positive emotional experiences and attitudes. It also provides you with a reservoir of positivity during moments when you may be experiencing more negative attitudes. In turn, this will make handling adversity easier. [9] X Research source Consider writing down your achievements and positive attributes in your diary or journal. You can write in a freestyle manner or create a list of different categories. See this exercise as never-ending. Always add to the list as you do new things, such as graduate from school, rescue a puppy, or get your first job."
    },
    {
      "title": "Do things you enjoy.",
      "content": "Do things you enjoy. Another way to build up a reserve of positive experiences is to make time to do things that you make you happy. If you like music, set aside time to listen to your favorite albums. Other people like to have time to read each evening in a relaxed environment. You can also do your favorite physical activity, whether that is going for an evening walk, doing yoga, or playing a team sport. Stay active doing the things that bring you pleasure. This is a great way to maintain a positive and healthy attitude."
    },
    {
      "title": "Pause and reflect on the good things.",
      "content": "Pause and reflect on the good things. Every day devote 10 minutes to writing in your journal about any positive experiences that you had. This gives you a chance to review and reflect on the day and to seek out the positives, even if they may be small things. These can include things that made you happy, proud, awestruck, grateful, calm, content or pleased. Re-experiencing positive emotions can help you adjust your perspective on the negative moments. [10] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For example, reflect on your morning routine to identify if there were moments where you felt noticeably happy. Perhaps you enjoyed the sunrise or had a friendly interaction with a bus driver or maybe it was the first sip of your cup of coffee."
    },
    {
      "title": "Show gratitude.",
      "content": "Show gratitude. Be sure to also take time to acknowledge your gratitude for all the things you have in your life. Gratitude correlates strongly with optimism. Maybe someone did something nice for you, such as paying for your coffee or making the bed. These can be small things, such as gratitude for your partner making the bed. You might also take pride in the way you accomplished a task. [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You could even keep a \"gratitude journal\". That is a notebook specifically designated for things you are happy and grateful for every day. Writing things down often helps solidify them more into our consciousness. Having a written record means that you will have something to consult when you need a gratitude boost!"
    },
    {
      "title": "Reframe negative moments and attitudes.",
      "content": "Reframe negative moments and attitudes. Consider negative thoughts or experiences that you have had. Then, try to re-frame them in a way where you can get positive (or at least neutral) emotions out of these experiences. This re-framing action is one of the cornerstones of a positive attitude. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For example, a new co-worker may have spilled coffee on you. Instead of getting angry and passing a judgment that she was clumsy or stupid, think of it from her point of view. It was an accident and she was likely embarrassed. Instead of developing a negative attitude towards her, pass the incident off as one-off. Maybe even make a joke about what a great \"ice-breaker\" that was for her first day. Re-framing your thoughts and experiences doesn't mean assuming everything is fine. Instead, it means not letting negativity overtake you. This will help you find a more positive approach to life in general."
    },
    {
      "title": "Don't compare yourself to others.",
      "content": "Don't compare yourself to others. Our competitive nature as humans means that we have a tendency to compare ourselves to others. You may compare your looks, lifestyle or general attitude to those qualities in others. When we compare ourselves to other people, we tend to see only the negative of ourselves and only the positives in the person we are comparing ourselves to. It's far healthier and more realistic to acknowledge our strengths. The key is not to compare and just accept who you are. Accepting yourself gives you the power to control your own thoughts, attitudes and life more generally. This will aid you in making less subjective inferences about other people’s behavior. [13] X Research source Every single person is different. So, there’s little reason to judge yourself based on other people’s standards. You may enjoy things that other people don’t enjoy and take different life path."
    },
    {
      "title": "Surround yourself with positive people.",
      "content": "Surround yourself with positive people. If you want to improve your attitude, then you need to surround yourself with people who will encourage a more positive attitude. The people you spend your time with - your family, friends, spouses, co-workers - have an impact on how you view the things that happen in your everyday life. So always make sure that these people share your positive vibe, and lift you up rather than bring you down. This social support can help bolster you when you do feel yourself experiencing negative attitudes. [14] X Research source Research has shown that people who experience major life stresses can navigate the ordeal more easily with a network of friends and family upon whom they can rely. [15] X Research source Billings, A. G., &amp; Moos, R. H. (1985) “Life stressors and social resources affect posttreatment outcomes among depressed patients.”Journal of Abnormal Psychology, 94, 140-153. Spend your time with people who are positive forces in your life. Surround yourself with people who make you feel appreciated, valued, and confident. Allow these people to encourage you to be your best possible self. Avoid individuals who are negative and who feed your negative thoughts and judgments. Remember, negativity breeds negativity. Try minimizing your contact with the negative people in your life. This helps to foster a generally positive attitude."
    },
    {
      "title": "Assess your current physical state.",
      "content": "Assess your current physical state. Your physical condition has an impact your mental state and emotional attitude. [16] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Take a long look at your day-to-day routine. Decide if adjusting your daily patterns of sleep, physical activity, or dietary habits could be beneficial for your improving your attitude."
    },
    {
      "title": "Exercise every morning.",
      "content": "Exercise every morning. Daily exercise and physical activity, when carried out each morning, can help you expend excess energy. This will make you less edgy and more agreeable throughout the day. Exercise releases endorphins, which lead to feelings of happiness and overall well-being. Also, daily exercise can help you improve your body-image. This also leads to higher levels of self-esteem and self-worth. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Walking, jogging or running in the morning are all great ways to engage in physical activities and lower your overall stress."
    },
    {
      "title": "Increase your social interactions.",
      "content": "Increase your social interactions. Even minor or mundane social interactions have a positive impact on people’s mental health. Try to engage with other people throughout the day. This will improve your attitude and mental outlook. [18] X Trustworthy Source National Alliance on Mental Illness Grassroots mental health-focused organization providing resources, support, and education for those affected by mental illness Go to source Social interactions naturally impact the release of serotonin in the human brain. Serotonin will affect an improvement in your mood and overall happiness. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Get more sunlight.",
      "content": "Get more sunlight. Humans derive vitamin D from exposure to sunlight. A lack of vitamin D can cause fatigue, negativity and poor mental attitude in some people. Even 15 minutes a day in the sun or under a sun-lamp can have positive effects on your mental state. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Improve your eating habits.",
      "content": "Improve your eating habits. It is hard to stay positive and have a cheery disposition if you are not eating right. Studies show that people with better dietary habits tend to see improvements in their overall mental attitude. Conversely, individuals who have poor dietary habits tend to be quicker to anger, less approachable and more irritable. Try eating healthier to see if it has any impact on your mental or emotional attitude. [21] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Make sure you include a wide variety of foods from all the relevant food groups in your diet, including meats, fish, vegetables, fruits, dairy and wheats. B-12, which is in a variety of red meats and leafy green vegetables, has shown a positive relationship to overall happiness and mental health."
    },
    {
      "title": "Spend more time around animals.",
      "content": "Spend more time around animals. Studies have affirmed that spending time around animals can lower your overall stress levels. This can improve your emotional and mental state. Even brief periods of interaction with animals can improve your attitude. [22] X Research source"
    },
    {
      "title": "Engage in meditation or relaxation techniques.",
      "content": "Engage in meditation or relaxation techniques. Stress can build throughout the day, negatively impacting your mental attitude towards the world around you. As such, it can be helpful to engage in meditation or relaxation practices each evening to help you unwind. [23] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get the recommended amount of sleep.",
      "content": "Get the recommended amount of sleep. Too much sleep or a lack of sleep has the ability to negatively impact your mental state and emotional outlook. Set a daily sleep routine and try to stick to it. Most researchers agree that 7 to 8 hours of sleep a night is ideal for an average adult. You should see positive improvements in your attitude if you keep a stable and healthy sleeping routine each night. [24] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    }
  ]
}