{
  "url": "https://www.wikihow.com/Identify-Oak-Leaves",
  "title": "How to Identify Oak Leaves",
  "steps": [
    {
      "title": "Differentiate oak trees from other species.",
      "content": "Differentiate oak trees from other species. Oaks, which all fall under the genus (Quercus) are wide-spread trees found in temperate climates the world over. There are over 600 known species of Oak, with 55 found in the continental United States. [1] X Research source Because there is such a wide variety of oak trees in the world, it can be hard to find characteristics that unite them all. However, they do exist: Acorns are the easiest way to spot an oak tree. If the tree produces acorns, it's an oak. [2] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 25 June 2021. Lobed leaves are leaves that have rounded or pointed knobs extending out from the center line. While a few oaks do not have lobes, all of the leaves are generally symmetrical around a clear median line. [3] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 25 June 2021. Small, scaly bark. Bark on oak trees is variable, but it is generally made up of small, hard, and scaly bits of bark. This is unlike the large, flaky chunks of pines or the wallpaper-like bark on birch trees, and is much more cracked and grooved."
    },
    {
      "title": "Look at the tips of the lobes to determine if you have a red or white oak.",
      "content": "Look at the tips of the lobes to determine if you have a red or white oak. Lobes are the bits of leaf that extend out to each side from the center of the leaf, like points on a star. White oaks have rounded lobes while red oaks have pointed ones. This is an important distinction that will cut the number of potential trees you're trying to identify in half. [4] X Research source On red oaks, the vein of the leave extends all the way out to the edge, creating this point."
    },
    {
      "title": "Consider your geographical region.",
      "content": "Consider your geographical region. Each area has its own assortment of oak species, which is often drastically different from other areas. The species of oak you will encounter changes great depending on where you are in the world, as it is rare for an oak found on the east coast to be found in the west, a southern oak in the north, etc. You can generally figure out your region with a few criteria (examples here are for Continental US): General location -- Northeast, Southeast, Midwest, Northwest, Southwest Inland or coastal. Mountainous or flat terrain. [5] X Research source"
    },
    {
      "title": "Count the lobes on each leaf.",
      "content": "Count the lobes on each leaf. The lobes are the sections that extend out from the center of the leaf's stem on both sides. If possible, compare multiple leaves to find the average number of lobes. A few species such as the willow oak have no lobes at all, but most oaks have multiple lobes. Count at least 4-5 leaves when identifying, as this will help when you turn to the field guide."
    },
    {
      "title": "Measure the indentations between the leaves.",
      "content": "Measure the indentations between the leaves. Look at the area between the lobes and determine whether the indentations are deep or shallow. White oak leaves often have variable indentations that alternate randomly between shallow and deep, where red oaks can have dramatic, sharp indentations or none at all. [6] X Research source Evergreen species can have leaves that are ‘entire’ (without lobes or teeth) or that have only faintly wavy edges. [7] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 25 June 2021."
    },
    {
      "title": "Look for color changes in the fall.",
      "content": "Look for color changes in the fall. The leaves of evergreen oaks are shiny and dark green all year, but most oaks will turn colors in autumn. Some oaks, such as scarlet oak (Quercus coccinea), sport brilliant colors in the fall. White oaks and chestnut oaks are often a dull brown when color comes around. [8] X Research source If it's summer, look at whether the leaves are dark green or light green, and whether they're shiny or not, to help determine the species."
    },
    {
      "title": "Measure the overall size of the leaves.",
      "content": "Measure the overall size of the leaves. Evergreen oaks and a couple red oaks such as scrub oak have smaller leaves while most red oaks and nearly all deciduous white oaks have much larger leaves (at least 4 in.). This is one of the more important distinguishing features between similar species of oak. [9] X Research source"
    },
    {
      "title": "Identify any unknown oaks using a Field Guide by the US Forestry Service.",
      "content": "Identify any unknown oaks using a Field Guide by the US Forestry Service. Using the data you've collected, identify your oak tree using a tree manual or field guide. There are dozens and dozens of oak trees out there, and you can't he expected to know them all by heart. [10] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 25 June 2021. Use the above criteria to narrow down your choices, then use the guide to find what oak you're looking at. You can look through the collection of common oak trees below, or consult a Field Guide, found through the US Forestry Service. Turn to the appropriate section. Most guides are divided into a red oak section and a white oak section Narrow your selection down to the oaks specific to your area. A good guide should have distribution maps for each species. Once you have a list of possibilities, look at the pictures for each one to determine your tree."
    },
    {
      "title": "Identify the common White Oak by its scaly, warty acorns.",
      "content": "Identify the common White Oak by its scaly, warty acorns. There is not only a category for all white oaks, there is actually a White Oak (Quercus alba) as well. It is distinguished by scaled, wart-like marks on the acorns and lightly colored bark. [11] X Research source The leaves have: 5-7 lobes, fanning out wider as you get to the tip of the leaf. Indentations roughly halfway to the center. Bright, light green color. Lobes with rounded tips (like rabbit ears). [12] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 25 June 2021."
    },
    {
      "title": "Identify the Post Oak.",
      "content": "Identify the Post Oak. This Midwestern oak has dark bark and distinctive leaves: [13] X Research source Usually 5 lobes. Wide, cross-like lobes. Leathery, dark texture and color."
    },
    {
      "title": "Identify the Bur Oak.",
      "content": "Identify the Bur Oak. Bur oaks, also found in the Midwest, have enormous leaves and distinctive acorns, which have an enormous cup (the little hat on the end) that almost covers the entire thing. [14] X Research source Leaves can get up to 1ft long Wide, almost flat-ended lobes."
    },
    {
      "title": "Identify the Chestnut Oak.",
      "content": "Identify the Chestnut Oak. Found often in rocky terrain, this widespread tree has reddish-brown acorns, dark brown, furrowed bark. [15] X Research source The edges of the leaves look like a serrated knife, but the veins don't go all the way to the points. Leaf is wide on top, then gets smaller near the base. Leaves between 4-9\" long and 4\" wide."
    },
    {
      "title": "Identify the common Red Oak.",
      "content": "Identify the common Red Oak. The common red oak has flat-topped acorns, like it was wearing a pork-pie hat. [16] X Research source Light-green leaves with 6-7 lobes. Indented roughly midway to the center. Pointed lobes may have two smaller points on either side and bristle-like tips (like those on a holly leaf but not sharp to the touch). [17] X Expert Source Michael Simpson, PhD Registered Professional Biologist Expert Interview. 25 June 2021."
    },
    {
      "title": "Identify the Shumard Oak.",
      "content": "Identify the Shumard Oak. The cup of the egg-shaped acorn only covers 1/4 of the whole nut, and the bark is long and light colored. A tall tree, it can get over 100 feet in height. [18] X Research source Leaves are dark green. Lobes divide at the end into many bristle-tipped teeth. Deep indentations."
    },
    {
      "title": "Identify the Pin Oak.",
      "content": "Identify the Pin Oak. A common decorative tree, these fast-growing oaks have small, distinctive acorns with a saucer shaped cap and smooth, gray bark. [19] X Research source Thin leaves with deep indentations, making the leaf look skinny. 5-7 lobes, each with multiple points at the end. Very bright, vibrant fall coloring to leaves. The northern Pin Oak has similar leaves, but a much longer acorn."
    },
    {
      "title": "Identify the Black Oak.",
      "content": "Identify the Black Oak. Black oaks have indistinctive leaves, but they do have a bright orange under-bark that you can often see in cracks on the tree. [20] X Research source Dark green leaves. Large leaves, up to 12-inches long, that are wider at the ends than the base. [21] X Research source"
    }
  ]
}