{
  "url": "https://www.wikihow.com/Kill-Poison-Oak",
  "title": "How to Kill Poison Oak",
  "steps": [
    {
      "title": "Identify poison oak plants.",
      "content": "Identify poison oak plants. Poison oak has green, shiny leaves that turn red in the fall and die off in the winter. The leaves are thick and have a rumpled surface. They have a similar shape to oak leaves and grow in groups of 3 (hence the \"leaves of 3, let it be\" adage). In open sun, poison oak grows in the form of bushy shrubs. In areas with partial shade, it can grow as a vine, climbing up trees and stumps. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Look for poison oak along trails, near the edges of woods, and in abandoned lots. Left to grow, poison oak plants can become quite large, but you'll also see baby plants sprouting from the ground. Look for the classic leaves for positive identification. Even when a poison oak plant has lost its leaves, the dry sticks left behind are still poisonous, so don't dismiss a plant just because it doesn't have leaves."
    },
    {
      "title": "Cover yourself from head to toe.",
      "content": "Cover yourself from head to toe. Manual removal requires actually touching the plants, so you need to make sure you're completely covered to protect your skin from urushiol, the toxic oil they produce. Put on thick gloves, several layers of long shirts, long pants, socks, and heavy boots. Since some people get affected by simply breathing the air near poison oak, you should cover your face as well. [2] X Research source This is the most effective removal strategy, but it's also the most dangerous. This method is not recommended for people who are severely allergic to poison oak . Either find someone who's immune (15% of the population can touch poison oak without getting a rash) or try another method. Be aware that if you only had a mild rash in the past, it's possible that another exposure could have a worse effect. Be very careful when you remove your clothes after the job is done. The oils from the poison oak plants will be on your gloves, shoes and other clothing. It should all be promptly washed using the hot cycle in your washing machine."
    },
    {
      "title": "Dig out the plants by the roots.",
      "content": "Dig out the plants by the roots. [3] X Research source Smaller plants may be pulled out by hand, but you might need a shovel to dig out larger ones. It's very important to get the entire plant, including the roots. Otherwise the plant will grow right back. It's easiest to manually remove plants in the spring, when they're green and the ground is relatively soft. Waiting until the ground gets dry or cold will make it difficult to get all the roots, since the plants will tend to break off at the stems. After removing the plants, disinfect all your gardening tools ."
    },
    {
      "title": "Discard the plants.",
      "content": "Discard the plants. Once you've collected all of the plants and their roots, either stack them in an out-of-the-way area or put them in garbage bags to be thrown away. Dead poison oak plants are still poisonous, so don't leave them in a place where other people will come into contact with them. [4] X Research source"
    },
    {
      "title": "",
      "content": "Don't use the plants as mulch or compost. Again, it's just too risky, since they're still full of the oils that can cause an extreme rash. Don't burn the plants. Breathing the smoke from burning poison oak plants is extremely dangerous."
    },
    {
      "title": "Consider getting a professional involved.",
      "content": "Consider getting a professional involved. If you don't want to go near the poison oak, it might be best to hire someone else to do it. A licensed professional will apply a high-powered pesticide such as Imazapyr to wipe out the poison oak. It's best to do this in spring or early fall. [5] X Research source"
    },
    {
      "title": "Use an early-season spray if treating poison oak in the spring.",
      "content": "Use an early-season spray if treating poison oak in the spring. Choose an herbicide made with triclopyr . This chemical is most effective early in the growing season, and you can it from spring to mid-summer when plants are growing rapidly and flowering. Don't spray on a windy day. The chemicals will kill nearby plants in addition to the poison oak, or they may blow back in your face. Don't spray trees. Spray when it's dry, not when it's rainy out. The herbicide will need at least 24 hours to work effectively."
    },
    {
      "title": "Use a late-season spray if treating poison oak in the fall.",
      "content": "Use a late-season spray if treating poison oak in the fall. Use an herbicide made with glyphosate late in poison oak's life cycle. You can use glyphosate after the poison oak has flowered, but while its leaves are still green. Apply a 2 percent solution of glyphosate to the poison oak, spraying it directly on the poison oak plant's leaves. Glyphosate will damage or kill other nearby vegetation, so be careful where you spray it. [6] X Research source"
    },
    {
      "title": "",
      "content": "Please note: The WHO considers glyphosate to be a probable human carcinogen. Its use is prohibited in some states and countries. Please check with your local laws and use caution if handling this chemical. Don't spray on a windy day. The chemicals will kill nearby plants in addition to the poison oak, or they may blow back in your face. Don't spray trees. Spray when it's dry, not when it's rainy out. The herbicide will need at least 24 hours to work effectively."
    },
    {
      "title": "Apply a chemical treatment to poison oak stumps.",
      "content": "Apply a chemical treatment to poison oak stumps. You can use glyphosate, triclopyr, or a combination of both chemicals to kill the poison oak plants. The plant will drink in the chemical down to the roots. Before doing this, be sure to cover yourself from head to toe to protect against the toxic oils in the plant. [7] X Research source Use long-handled loppers to cut down the poison oak plant so that the stems are just 1 to 2 inches (2.5 to 5.1 cm) above ground. Immediately after cutting the stems, apply the chemicals with a 1 inch (2.5 cm) wide paintbrush or a squeeze bottle. Thoroughly cover each stump with the chemical. You will have to re-treat any new growth that shoots out of the stump."
    },
    {
      "title": "Wait for the roots to die, then dig out the plants.",
      "content": "Wait for the roots to die, then dig out the plants. When the stems turn brown a few days later, use a shovel to dig out the dead roots. Don't mulch or burn the dead material; throw it away, since it could still cause a rash. [8] X Research source"
    },
    {
      "title": "Cover the plants with plastic to kill them.",
      "content": "Cover the plants with plastic to kill them. Use plastic sheeting to cover poison oak plants that are in a contained area. This works best if you first cut the plant down to a few inches above the ground. The dead roots must be removed and discarded properly, or they'll come back."
    },
    {
      "title": "Pour boiling water over the roots to get rid of small plants.",
      "content": "Pour boiling water over the roots to get rid of small plants. Heat up your tea kettle until the water has come to a rolling boil. Take it outside and pour it near the roots of the poison oak plant. The boiling water should kill the plant, but you'll need to get rid of the roots. This method is better for small plants. Large shrubs probably won't be affected. [9] X Research source If you use this method, be very careful not to breathe in any steam that rises from the boiled plant."
    },
    {
      "title": "Employ a goat to do the job, if possible.",
      "content": "Employ a goat to do the job, if possible. Goats love to eat poison oak (they aren't affected by the oils) and since they're always hungry, they can clear out an area riddled with the stuff in no time at all. This is a great natural way to get rid of poison oak plants. Check around to see if there's a goat farm in your area. It's becoming increasingly popular for goat owners to hire out their goats for natural landscape management. If you go this route, you'll need to get the roots in order to make sure the plants grow back. However, you could instead hire goats every spring to keep them maintained. Interestingly, goats that eat poison oak produce milk that's free of the toxic oils."
    },
    {
      "title": "Try a vinegar spray for a simple method.",
      "content": "Try a vinegar spray for a simple method. This method might be worth a try, especially for smaller plants. Fill a spray bottle with undiluted white vinegar and spray the leaves and stems of the poison oak plants in your area. In a few days, the plants should die. Remove the roots if you don't want them to grow back. [10] X Research source"
    },
    {
      "title": "Spray bleach on the plants as an alternative.",
      "content": "Spray bleach on the plants as an alternative. Fill a spray bottle half full with warm water. Add 1/2 cup (136.5 g) of salt, 1 ⁄ 2 cup (120 ml) of hydrogen peroxide, and 2 cups (470 ml) of bleach to the bottle. Put the sprayer on the bottle and shake it to mix the ingredients. Then, spray the poison oak plants liberally with the mixture."
    },
    {
      "title": "Plant your yard with healthy ground cover to discourage poison oak.",
      "content": "Plant your yard with healthy ground cover to discourage poison oak. Since poison oak tends to thrive in \"disturbed\" areas with bare soil, you can prevent it from invading by planting other plants to take up that open space."
    }
  ]
}