{
  "url": "https://www.wikihow.com/Make-a-Bed-Skirt",
  "title": "How to Make a Bed Skirt",
  "steps": [
    {
      "title": "Measure your bed.",
      "content": "Measure your bed. Take measurements for the width and length of your box spring as well as the height from the floor to the top of your box spring. [1] X Expert Source Donna Serino Dry Cleaning & Alterations Specialist Expert Interview. 31 August 2021. To sew bed skirts, you need 2 length-by-height panels and 1 width-by-height panel for the skirt as well as 1 width-by-length panel to cover the top of your box spring. Add 1 inch (25 mm) to the width and length measurements and 2 inches (5 cm) to the height measurement for the seam allowance. You now have the measurements that you will use for your panels."
    },
    {
      "title": "Decide on the fullness for your bed skirt.",
      "content": "Decide on the fullness for your bed skirt. If you want to make a flat paneled bed skirt, then you may use the measurements you have. For a ruffled bed skirt, you need to account for fullness; determine how full you want the skirt to be, either 2 to 3 times fuller than a smooth/flat bedskirt. A fullness of 2 is mildly full, while a fullness of 3 is extremely full. Multiply all the width and length measurements for the skirt panels by the amount of fullness you want. Use the resulting dimensions when cutting your fabric panels."
    },
    {
      "title": "Prepare your fabric.",
      "content": "Prepare your fabric. Wash and dry the fabric first to account for any shrinkage, then iron the fabric so that it is flat and wrinkle-free. Measure and mark your panels using a ruler, straight edge and fabric marker."
    },
    {
      "title": "Cut your panels.",
      "content": "Cut your panels. You should have a total of 4 panel pieces (3 for the skirt and 1 for the main panel) to cut."
    },
    {
      "title": "Sew the hems.",
      "content": "Sew the hems. Press the bottom edge of the 3 skirt panel pieces up 1/2 inch (12 mm), with the wrong side in, in order to create the hem. Additionally, press the 2 length edges and only 1 width edge of the main panel under, wrong side in, 1/2 inch (1.25 cm). Use a straight stitch along the pressed edge to give a clean, finished look to your hem. This will also help prevent the bed skirt from fraying over time. If you’re making your bed skirt out of thick fabric like canvas, use a heavy needle with a ballpoint. This will help you sew through the fabric easily. [2] X Expert Source Alessio Iadicicco Apparel Manufacturing Specialist Expert Interview. 16 June 2021."
    },
    {
      "title": "Prepare gathered panels.",
      "content": "Prepare gathered panels. If you are making a bed skirt with smooth/flat sides, then you don't need to do anything before sewing them to the main fabric piece. If you are choosing to make a ruffled bed skirt, then you will need to gather your panels before you sew them to the main panel. To make gathered panels: Set your sewing machine to a zig-zag stitch, on the longest available stitch length. You will be stitching 1/2 inch (12 mm) in from the top edge (opposite of the hemmed edge) of the skirt paneling. Line up cotton crochet thread in the center of the presser foot so that, when you sew, the zig-zag stitch encloses the crochet thread. Make sure you do not sew the crochet thread into place, as you will need to pull it through the chamber made by the zig-zag stitching in order to create the gathering. Sew along the entire length of the panel. Pull the crochet thread from either end of the panel in order to gather the fabric until the panel is the appropriate width or length measurement. Adjust the gathers until they appear to be evenly spaced. Sew a straight stitch along the gathered edge to secure the gathers in place."
    },
    {
      "title": "Sew the panels together.",
      "content": "Sew the panels together. Beginning at the hem edge, pin 1 vertical end of each lengthwise skirt panel to each vertical end of the widthwise skirt panel, right sides facing together. Allowing for a 1/2 inch (12 mm) seam allowance, sew the panels together along the 2 connecting vertical edges. When you are finished, you will have 1 continuous bed skirt panel that spans the circumference of the bed (not including the head end)."
    },
    {
      "title": "Attach the skirt panels to the main panel.",
      "content": "Attach the skirt panels to the main panel. Lay the main panel in place. It should cover the entire face of the box spring and extend over the unfinished top edge of the bed skirt paneling. Pin the main panel to the bed skirt panel around the entire perimeter. Sew along the edge of the main panel on all 3 sides that are edged by the skirt panel, using a regular straight stitch. Be sure to use the 1/2-inch seam allowance."
    },
    {
      "title": "Finish your bed skirt.",
      "content": "Finish your bed skirt. With the panels all sewn into place, put the bed skirt over the box spring to check its fit. If everything lies smoothly in place, then you are finished! Otherwise, remove the bed skirt and adjust any mistakes accordingly. [3] X Research source"
    },
    {
      "title": "Use a fitted bed sheet as a bed skirt.",
      "content": "Use a fitted bed sheet as a bed skirt. If you're not up for sewing and want a fast and easy bed skirt, you can use a fitted bed sheet instead. Simply put the fitted sheet over the box spring instead of the mattress, and tuck the elastic band along the bottom under the box spring. Voila! You've now successfully covered the box spring with a sheet that already matches your bedding and decor. [4] X Research source Using a fitted bed sheet will not cover any space under the box spring, meaning that under-the-bed storage will be exposed."
    },
    {
      "title": "Pin a long strip of fabric in place of a bed skirt.",
      "content": "Pin a long strip of fabric in place of a bed skirt. If you want the ruffled look and storage cover of a real bed skirt without the sewing, you can simply pin some fabric in place. Measure the distance around the perimeter of your bed and the height from the floor to the top of the box spring, and cut a long strip of fabric that meets these dimensions. Pin this in place using straight pins along the edge of the box spring. Put the pins on the top of the box spring, so that when the mattress is replaced, you can't see that your skirt is actually just pinned in place."
    },
    {
      "title": "Try using a dropcloth.",
      "content": "Try using a dropcloth. The final easy no-sew alternative to a traditional bed skirt, is using a piece of fabric large enough to cover the entirety of the box spring and then drape to the floor. The best option for this, without spending loads of money? A regular dropcloth. A linen dropcloth will cover the entire space of a queen size bed or smaller, and have enough excess fabric to reach the floor. Just spread the dropcloth out over your box spring, and use pins to hold it in place around the perimeter. You're done! [5] X Research source"
    }
  ]
}