{
  "url": "https://www.wikihow.com/Is-Gossip-a-Sin",
  "title": "Is Gossiping a Sin? (And How to Avoid It as a Christian)",
  "steps": [
    {
      "title": "Gossip is a sin according to the Bible.",
      "content": "Gossip is a sin according to the Bible. To find our answer, we don’t need to look any further than Matthew 12:36, in which Jesus says: “But I tell you that everyone will have to give account on the day of judgment for every empty word they have spoken.” [1] X Research source Here, Jesus is talking about a person who speaks evil things “because of the evil stored up in him,” and that “a good man brings good things out of the good stored up in him.” [2] X Research source Jesus condemns those who say things out of ill will or bad intentions, calling them “a brood of vipers” and that “for your words you will be condemned.” A few lines earlier, Jesus says that “every kind of sin and slander can be forgiven,” clearly associating slander, a form of gossip, with sin."
    },
    {
      "title": "“Gossip” is a more modern translation of other Hebrew words in the Bible.",
      "content": "“Gossip” is a more modern translation of other Hebrew words in the Bible. New translations use the word “gossip,” but the original text and closer translations prefer the terms “slander,” “whispers,” “backbiting,” “false witness,” and others. These usually come from the Hebrew word “rāḵîl,” which means something close to “scandal-monger.” [3] X Research source Here are relevant passages: Proverbs 17:9: “Whoever would foster love covers over an offense, but whoever repeats the matter separates close friends.” [4] X Research source Proverbs 20:19: “A gossip betrays a confidence; so avoid anyone who talks too much.” [5] X Research source Romans 1:29-30: “They are full of envy, murder, strife, deceit and malice. They are gossips, slanderers, God-haters, insolent, arrogant and boastful.” [6] X Research source 2 Corinthians 12:20: “I fear that there may be discord, jealousy, fits of rage, selfish ambition, slander, gossip, arrogance and disorder.” [7] X Research source 1 Timothy 5:13: “Besides, they get into the habit of being idle and going about from house to house. And not only do they become idlers, but also busybodies who talk nonsense, saying things they ought not to.” [8] X Research source"
    },
    {
      "title": "It has bad intentions",
      "content": "It has bad intentions When someone spreads a rumor about someone they dislike, they’re often doing it because they want other people to also dislike that person, and to ruin their reputation. [9] X Research source This shows malice, which is itself a sin. As Psalm 15 says, “whose tongue utters no slander, who does no wrong to a neighbor, and casts no slur on others” shall live with the Lord. [10] X Research source Example: “Did you hear that John failed his test? I know, totally pathetic, right?”"
    },
    {
      "title": "It goes behind someone’s back",
      "content": "It goes behind someone’s back When we talk about someone else and want to make sure they don’t hear us, that’s probably hurtful gossip. Psalm 101:5 says, “Whoever slanders their neighbor in secret, I will put to silence.” [11] X Research source When we go behind someone’s back, we take control of the situation away from them and leave them vulnerable to be hurt even more. Example: “Don’t tell Macy I said this, but I just heard that her boyfriend wants to break up.”"
    },
    {
      "title": "It spreads negative or private information",
      "content": "It spreads negative or private information Oftentimes, other people’s lives just aren’t any of our business. We almost never know the full story, and so can’t speak on it with accuracy or authority. And when we only tell half the story, we hurt the person in question before they can represent their side of things. [12] X Research source Example: “I hear those two are getting a divorce. I bet it’s his fault.”"
    },
    {
      "title": "Spreading information that people need to know",
      "content": "Spreading information that people need to know Gossip does serve an important function, which is spreading news, or enforcing positive social norms. [13] X Research source For example, if someone said they wanted to harm another, you’d want the potential victim to know, right? In this way, gossip can be productive, and not a sin. The Church calls this “ conferral .” Example: “I wouldn’t invite that guy to the party, if I were you. He can’t really be trusted around women.”"
    },
    {
      "title": "Sharing positive news or someone’s accomplishments",
      "content": "Sharing positive news or someone’s accomplishments There’s nothing wrong with sharing a little good news, or praising someone to other people. Actually, in a way, the Church says that this form of gossip is a lot like evangelizing, which itself means “to spread good news.” [14] X Research source Example: “I hear John aced the test. Maybe I’ll ask him to help me study for the next one.”"
    },
    {
      "title": "When you have permission to tell other people",
      "content": "When you have permission to tell other people Of course, the Church doesn’t view it as gossip when you have permission from the person you’re talking about to talk about them, but that’s the best way to be sure you’re not sinning! When you have permission, the person in question knows what you’re saying and still has agency, control, and dignity in the situation. Example: “Macy told me to tell you not to mention Jordan. The two of them broke up, and it hurts her to think about it.”"
    },
    {
      "title": "Ask yourself some questions before you spread rumors.",
      "content": "Ask yourself some questions before you spread rumors. Certified image consultant Sheila A. Anderson tells us that to avoid gossip, “Pause before you speak and ask yourself, ‘Is what I’m about to say harmful or helpful?’” You can never un-say something, so it’s best to make sure what you’re about to say is kind. Ask yourself: Am I trying to be mean by saying this? Do I know what I’m about to say is true and correct? Would I say this to the person face-to-face? Does the person I’m talking to need to know this for their own well-being? Will someone be hurt if I say this? Will someone be hurt if I don’t say this?"
    },
    {
      "title": "Tell gossipers that you're not interested in the conversation.",
      "content": "Tell gossipers that you're not interested in the conversation. Anderson also says that if someone else starts gossiping, deal with it by cutting in and telling them that it makes you uncomfortable. You might also defend the person that people are talking about, if you know it’s an unfair rumor. Be kind, patient, and non-judgemental, but also firm, and explain your reasoning. For example: “Hey, I don’t really want to talk about this. We don’t know Josh’s situation, and so it’s unfair to speculate on it.” “I just don’t really think Mary’s personal life is any of my business, so I’d rather not hear it. I’ve got enough to worry about. “I think they’re going through a really rough time as it is. Let’s not make it worse by spreading rumors.”"
    },
    {
      "title": "Limit your time around serial gossipers.",
      "content": "Limit your time around serial gossipers. Anderson also suggests simply avoiding people who can’t help but gossip, because if one person is gossiping, it’s way too easy to start gossiping yourself. You don’t have to cut them off completely, and you can still talk to a chronic gossiper, but when the conversation starts turning to rumors, you might excuse yourself and find someone else to talk to. Example: “What’s that about Mark? I wouldn’t know. Actually, it looks like I have to go. Well, talk to you later!”"
    },
    {
      "title": "Gossip is spreading rumors about other people.",
      "content": "Gossip is spreading rumors about other people. The rumors might be true, they might be false, or it might be impossible to say. Usually, gossip is meant to hurt someone, but it doesn’t have to be. Plenty of gossip isn’t malicious and is just a way to spread local news. In fact, gossip helps people bond, and can even alert people to danger. [15] X Research source That doesn’t mean it’s always right, though. In the Bible, “gossip” refers to hurtful or malicious gossip that harms others or spreads false information. “Positive gossip” is also sometimes called “conferral” by the Church. Conferral is meant to celebrate and lift up the goodness and accomplishments of other Christians or spread joyous news, and is considered different (and better than) gossip."
    }
  ]
}