{
  "url": "https://www.wikihow.com/Make-Him-Want-You-Back",
  "title": "How to Make Him Want You Back",
  "steps": [
    {
      "title": "Accept the break-up.",
      "content": "Accept the break-up. Handle the break-up maturely and with grace. If he broke up with you, respect his decision and give him some time to see things more clearly. He will appreciate your understanding and respect you all the more for handling yourself with dignity. The last thing you want to do is make a scene. Crying or getting angry with him won't get you anywhere, in fact, he'll be more likely to run in the other direction. By accepting the break-up calmly, you are leveling the playing field. He was probably expecting a different reaction from you, but now he .will be curious as to why you're not more upset. This may plant the first seed of doubt in his mind."
    },
    {
      "title": "Cut all communication.",
      "content": "Cut all communication. After a break-up, emotions run high and people don't always make rational decisions. For this reason, it is advisable to cut all communication with your ex for a while. [1] X Research source Don't harass your ex with phone calls, texts or Facebook messages. This will have the opposite of the desired effect. Wait until he contacts you first. It will be tough, but try not to contact your ex for at least 2-3 weeks. Give him time to miss you."
    },
    {
      "title": "Give each other time to heal.",
      "content": "Give each other time to heal. Break-ups can be rough. Harsh words are exchanged and feelings get hurt. You need to give both yourself and your ex time to cool down, reflect and heal. Only then should you consider resuming the relationship. [2] X Research source Getting back together while the wounds are still fresh will cause the same old issues to resurface and your efforts to revive the relationship are sure to fail. Wait until enough time has passed that you can think about the break-up objectively and can speak to your ex without getting upset or angry. Reader Poll: We asked 1592 wikiHow readers how they’d handle a partner who's pulled away, and 53% agreed that they’d give them space to come to a decision on their own . [Take Poll]"
    },
    {
      "title": "Honestly assess your relationship.",
      "content": "Honestly assess your relationship. Take this time apart to honestly assess your relationship, think about what went wrong and what went right. Try to pinpoint the exact problems that led to the end of the relationship and figure out whether they can be fixed. If you believe that the problems in your relationship are fixable, and both you and he are willing to put in the effort to make that happen, then your relationship stands a chance. If, on the other hand, the circumstances which led to the end of the relationship are not likely to change, or if you or your ex are unwilling to modify your behavior for the sake of the relationship, then getting back together may not be the best idea. Use your head for this decision, not just your heart."
    },
    {
      "title": "Apologize",
      "content": "Apologize , if necessary. Towards the end of the relationship or during the break-up, you might have said some things you didn't mean or that you now regret. It's never too late to be the bigger person and apologize. [3] X Research source If the break-up came about as a result of your actions, then you should definitely make the first move to apologize. Your ex will appreciate the gesture and may feel warmer and more sympathetic to you as a result. You will never be able to move on from the past if you don't own up to your mistakes."
    },
    {
      "title": "Stay calm",
      "content": "Stay calm . If you've just been through a break-up that you didn't initiate, it can feel like your world is spinning out of control. Don't panic. Stay calm and remind yourself that you are strong and you handle whatever life throws at you. Don't make any rash decisions. You are in a vulnerable state of mind right now, try not to do anything you might regret. If you have your mind set on getting your ex back , that's fine. But allow yourself some personal time to work through your own issues first."
    },
    {
      "title": "Talk to someone.",
      "content": "Talk to someone. [4] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 10 September 2021. After a break-up, it's probably safe to say that you have some demons you need to work out. The best thing you can do is talk to somebody you trust - a friend, a family member, a therapist. With them, you can unleash all the rage, hurt and pent-up tears you have inside. You'll feel much better after. By talking about the break-up with someone on the outside of the situation, you are free to express every feeling and thought without the risk of doing irrevocable damage to your relationship with your ex. Talking about the break-up will help you to work through your feelings and give you some perspective on the situation. You might start to see matters from a different point of view and understand where your ex was coming from. This understanding and empathy can help you to get back on the right track later."
    },
    {
      "title": "Be independent",
      "content": "Be independent . Use this break-up (even if it's only temporary) as a chance to liberate yourself. In a relationship, people tend to over-rely on their partner and forget how to function on their own. Now is your chance to recover your long-forgotten, independent self. You won't regret it. Go places on your own, meet new people, try new things. Doing things by yourself will allow you to gain confidence and help you to feel whole again. Reconnect with your friends. Many people are guilty of neglecting their friends while in a relationship. Now that you're free to do as you please, take the initiative and organize a girls' night in or out. You'll soon be laughing so hard you'll wonder why you didn't do it more often."
    },
    {
      "title": "Take care of yourself",
      "content": "Take care of yourself . [5] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 10 September 2021. You've been through a rough time recently, so take a moment to focus on you and your needs. Do things that make you happy and make you feel good. [6] X Research source Take long baths, get plenty of rest , eat healthily and do some exercise . You'll look and feel better for it. You need to feel good about yourself before you think about re-entering a relationship."
    },
    {
      "title": "Work on improving yourself.",
      "content": "Work on improving yourself . Have you been complaining about your job for the last year? Quit and find something better! Been talking about taking up a new hobby or starting a new exercise regime for forever? Now is the time! Embrace this opportunity to improve yourself and become the best you that you can be. Many people claim that a hot new body is the best way to recapture your ex's attention. But don't just do it for him, do it for yourself. Exercise and healthy eating will release the good mood hormones and will give you more energy and motivation to get through your day. Getting a new job or taking up a long talked-about hobby will give you a new outlet to focus your attentions on and leave you less time to mope about the break-up. Hopefully your ex will also be impressed by your new go-get-em attitude."
    },
    {
      "title": "Put yourself out there.",
      "content": "Put yourself out there. Just because you have your heart set on getting back with your ex doesn't mean you can't have a little fun in the meantime. Get yourself all dolled up and go out and flirt to your heart's content. If nothing else, you will be reminded that you are an attractive and interesting person and that you have plenty of other options if your relationship doesn't work out as planned. Letting your ex see you with another guy can arouse feelings of jealousy and desire in your ex. This might make him realize that he wants you back and help you in your quest. Be careful with this tactic, however - if your ex feels that you're perfectly happy with someone else, he might move on too."
    },
    {
      "title": "Let him contact you.",
      "content": "Let him contact you. Let him make the first move. It might be hard to wait, but stay strong. A least then when he contacts you, you will know that he was thinking about you and that he's ready to take a step forward in your relationship, whatever that might be. If you push him too soon, he might pull in the other direction. Once he contacts you, don't play hard to get. Respond in a timely fashion and be perfectly sweet and polite . After he has made contact, you can suggest meeting up to talk in person. Go for somewhere neutral where you can have a private conversational, but can leave easily if things take a turn for the worse. A cafe or public park would be perfect."
    },
    {
      "title": "Remind him why he was attracted to you in the first place.",
      "content": "Remind him why he was attracted to you in the first place. [7] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 10 September 2021. Sometimes the bad things that happen at the end of a relationship can overshadow all the good that came before. Remind this guy why he fell in love with you in the first place. Spark his memory by wearing the same perfume you wore on your first date, or a piece of clothing he thought you looked good in. Reminisce about some of the great times you had together. Make him remember how he felt about you when times were good."
    },
    {
      "title": "Take things slowly.",
      "content": "Take things slowly. Don't rush headfirst back into the relationship. Take time to talk things through and make sure the two of you are on the same page. Ensure that you both know what you need to work on and are willing to give things a chance. Try dating again . Go out for dinner, go bowling or go see a movie together. Spend short, concentrated periods of time together. Get to know one another all over again. If you try to pick up exactly where you left off, then history is doomed to repeat itself."
    },
    {
      "title": "Leave the past in the past.",
      "content": "Leave the past in the past. If the two of you have worked through your issues and you're both willing to make a fresh start, be thankful for it. Look on this as a brand new relationship, with no baggage attached. Forget about what happened in the past and focus on your future together."
    }
  ]
}