{
  "url": "https://www.wikihow.com/Grow-Celery-from-a-Stalk",
  "title": "How to Grow Celery from a Stalk",
  "steps": [
    {
      "title": "Cut the celery stalks from the base to make room for new stalks to grow.",
      "content": "Cut the celery stalks from the base to make room for new stalks to grow. Using a long, sharp knife, cut the celery stalks about 1 inch (2.5 cm) to 2 inches (5.1 cm) from the base. This will provide room for new stalks to grow without removing the necessary nutrients. [1] X Research source Thoroughly clean the cut celery stalk base with water and pat dry with a paper towel or cloth. Make sure that you have cleaned the celery stalk base well and have cleaned the stalk of any dirt, debris, or bugs."
    },
    {
      "title": "Put the celery stalk base in a 2 inches (5.1 cm) to 3 inches (7.6 cm) deep bowl partially filled with warm water.",
      "content": "Put the celery stalk base in a 2 inches (5.1 cm) to 3 inches (7.6 cm) deep bowl partially filled with warm water. Using warm water will stimulate the growth of the new celery stalks. [2] X Research source Place the cut and cleaned celery stalk base in a bowl with the bottom of the plant down and the recently cut portion facing up. Make sure that the bowl you use is clean and deep enough to hold several ounces of water without spilling over. Fill the bowl with enough water so that about 2/3 of the celery stalk base is submerged, approximately .5 inches (1.3 cm) to 1.5 inches (3.8 cm) depending on the size of your celery stalk base."
    },
    {
      "title": "Store the celery stalk base in the bowl in a sunny place for 5 to 7 days.",
      "content": "Store the celery stalk base in the bowl in a sunny place for 5 to 7 days. It is crucial that your celery stalk base gets a lot of natural light. To generate the energy it needs to grow, your celery stalk will need an average of about six to seven hours of natural light per day. [3] X Research source If you do not have a place indoors that receives enough natural light, you can learn how to use grow lights. This will help you re-create the conditions necessary for your celery to grow."
    },
    {
      "title": "Change the water regularly.",
      "content": "Change the water regularly. As your celery stalk begins to grow, it will absorb a significant amount of the water surrounding the stalk. It is important that you replenish the water so that your celery can continue to flourish. Check the water level in the bowl containing your celery stalk daily. Top off the water in the bowl as needed so that 2/3 of your celery stalk remains submerged. Change the water every 2 to 3 days. This will ensure that your celery stalk has the clean water it needs to grow tall and strong. [4] X Research source"
    },
    {
      "title": "Check your celery for signs that it is ready to be transplanted.",
      "content": "Check your celery for signs that it is ready to be transplanted. After 5 to 7 days, your celery stalk base should have begun to grow new shoots and should be ready to transfer into a pot with soil. There are a few signs that indicate that your celery stalk is ready to be transplanted. The outside of the celery stalk base should have begun to brown and break down. While the appearance may be concerning, this is a normal and essential part of the growth process. The old celery stalk breaks down in order to create natural nutrients for the new stalk to grow. [5] X Research source Tiny sprouts of new growth have begun to spring up. This is a sure sign that the celery stalk is producing new growth and is ready to be transplanted."
    },
    {
      "title": "Fill about 2/3 of the planting pot with high quality general use potting soil.",
      "content": "Fill about 2/3 of the planting pot with high quality general use potting soil. You will want to use your own judgement here, as the exact amount of potting soil needed will vary depending on the size of your celery stalk. The size of the planting pot will also vary depending on how wide your celery stalk base is. On average, a celery stalk base is about 4 inches (10 cm) wide. To allow room for the celery to grow, you will likely want to choose a planting pot that is at least 6 inches (15 cm) wide and 5 inches (13 cm) tall. [6] X Research source The goal is to fill the pot with enough soil so that you can add more around and on top of the celery stalk base so that only the new sprouts are sticking out."
    },
    {
      "title": "Plant the celery stalk in the potting soil.",
      "content": "Plant the celery stalk in the potting soil. Gently lift your celery stalk out of the bowl and place it in the center of your planting pot on top of the potting soil. Adding just a little at a time, slowly cover the original celery stalk base with new soil, leaving only the new celery shoots sticking out at the top."
    },
    {
      "title": "Water your new celery plant generously.",
      "content": "Water your new celery plant generously. While you want to be careful not to overwater your plant, it is crucial that your celery plant continues to get plenty of water so that it can continue to flourish. While there is no steadfast rule about how often you should water your celery plant, there are a few ways to ensure that your plant is getting the water it needs. Check if the soil is dry. If there is little moisture to the touch, your plant probably needs to be watered. Examine the growing celery for deterioration, yellowing, or brown spots. If any of these are present, your celery is not getting the water it needs. Celery requires a lot of water to grow strong, so if your new growth shoots appear discolored, dry, or small, water more often or use a spray bottle daily. [7] X Research source"
    },
    {
      "title": "Watch as your celery stalk grows into a new celery plant.",
      "content": "Watch as your celery stalk grows into a new celery plant. With the proper amount of sunlight and water, your celery stalk will grow into a new celery plant that can be harvested, eaten, and enjoyed! Usually, it takes about 5 months from the time that you first cut the original celery stalk for the new plant to grow completely. [8] X Research source After you have harvested your new celery plant, you can repeat this process and grow more celery at no additional cost."
    }
  ]
}