{
  "url": "https://www.wikihow.com/Hide-That-You-Vape-from-Dentist",
  "title": "How to Hide the Fact That You Vape from a Dentist",
  "steps": [
    {
      "title": "Brush and floss thoroughly before your appointment.",
      "content": "Brush and floss thoroughly before your appointment. You’re not going to get rid of nicotine stains, but at least you’ll clear up that bad breath and dry mouth. This will also give you a little bit of time to scrub your teeth clean without adding any more vape juice or residue. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Brush and floss your teeth twice a day the same way you normally should. Don’t brush your teeth hard to try and “scrub off” any nicotine stains. You’re more likely to wear your tooth enamel down than remove the stains. You can also try a teeth whitening treatment a day or two before the appointment. [2] X Trustworthy Source American Dental Association World's largest dental professional organization and advocate for proper oral health Go to source"
    },
    {
      "title": "Rinse with mouthwash right before the visit.",
      "content": "Rinse with mouthwash right before the visit. This won’t get rid of any of the bigger signs if you’ve been vaping for a while, but it will give you the good breath dentists don’t normally see on smokers. This may help sell the idea you don’t vape. If you have a choice of mouthwashes, use one that contains alcohol. The alcohol should do a better job of neutralizing your vape breath."
    },
    {
      "title": "Claim you’re a heavy coffee drinker.",
      "content": "Claim you’re a heavy coffee drinker. Coffee is notorious for staining your teeth, so casually drop the fact that you drink coffee into the conversation with your dentist when you walk in. This may plant the seed in your dentist’s head that any stains aren’t from nicotine. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You might apologize in advance for bad breath ahead of time by mentioning you just had coffee an hour ago. Alternatively, you can yawn as you walk in and take a seat and say, “Sorry about that. I didn’t have my coffee this morning.”"
    },
    {
      "title": "Just own it and admit you vape.",
      "content": "Just own it and admit you vape. Your dentist really just wants you to be happy and healthy. They’ve seen chain smokers, people who don’t brush, folks who chug coffee, tobacco chewers, and more. However gross you think your mouth is, they’ve seen way worse. If they didn’t care then, they don’t care now. [4] X Research source In fact, your dentist may be able to offer you special advice or unique toothpastes and products if they know you vape. Doctors are legally required to keep patient info to themselves, but that doesn’t apply to dentists in most states. If you ask your dentist not to reveal the fact that you vape to anyone, they’ll likely honor the request. No good dentist keeps patients by revealing their secrets to others."
    },
    {
      "title": "Your dentist probably won’t be able to tell for sure.",
      "content": "Your dentist probably won’t be able to tell for sure. If you don’t vape very often or you just picked the habit up, your dentist may not necessarily be able to tell. However, if you’ve been vaping for a while (think over a year or so), they’ll probably know something is up. [5] X Research source The evidence won’t come from the vapor, but the nicotine. Nicotine stains your teeth and gums, which will be the most obvious sign you’re a vape user. Vaping also causes a dry mouth, so the dentist may spot your teeth and gums drying out quickly during the exam. Lastly, vaping can contribute to basically every dental issue out there, like bad breath and cavities, so your dentist may notice all of the signs and put everything together. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Vaping weakens your tooth enamel.",
      "content": "Vaping weakens your tooth enamel. Vape juice contains propylene glycol (that’s the main ingredient, actually). It’s not dangerous to inhale on its own, but it is an acid that breaks down the enamel on your teeth. Once the enamel wears down, there isn’t really anything protecting your teeth. [7] X Research source Some studies suggest that it’s possible to regrow tooth enamel but most dentists are of the belief that once it’s gone, it’s gone. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Vaping increases your risk of cavities and tooth decay.",
      "content": "Vaping increases your risk of cavities and tooth decay. Without the enamel, all of the acid and bacteria entering your mouth from your vaping can begin wearing away the dental tissue. This will result in a rapid increase in tooth decay and increase the odds that you develop cavities. [9] X Research source Most people will get a cavity at some point, but vaping will make any cavities worse than they already would be."
    },
    {
      "title": "Vaping causes gum inflammation and increases the odds of gum disease.",
      "content": "Vaping causes gum inflammation and increases the odds of gum disease. Propylene glycol is a soft tissue irritant. Your gums happen to be made up entirely of soft tissue, so the longer you vape, the more you increase the odds of developing gum disease. All of that irritation will also inflame your gums. [10] X Research source Inflamed gums will be especially sensitive and occasionally painful."
    }
  ]
}