{
  "url": "https://www.wikihow.com/Know-if-a-Message-Was-Delivered-on-Apple-Messages",
  "title": "How to Tell If a Text Was Delivered or Read on iPhone, iPad, or Mac",
  "steps": [
    {
      "title": "Send a text in the Messages app.",
      "content": "Send a text in the Messages app. Type your message into the text field, then tap or click the up arrow to send it. Most texts will go through right away, but for messages that take longer to send (like photos or videos), you might see a loading bar at the top of the screen while the message is sending."
    },
    {
      "title": "Look for “Delivered” under your last message.",
      "content": "Look for “Delivered” under your last message. It will appear just below the message bubble. If you see nothing listed under your last message, your message has not yet been delivered. Look for the loading bar at the top of the screen. If \"Send Read Receipts\" is enabled by the recipient, then it will change to \"Read\" once the message has actually been seen. If you see \"Sent as a Text Message,\" that means your message was sent using your carrier's SMS service rather than Apple's iMessage servers."
    },
    {
      "title": "Try resending the message if you see a “Not delivered” alert.",
      "content": "Try resending the message if you see a “Not delivered” alert. If your messages don’t go through for some reason, you will see a red “Not delivered” alert with an exclamation point in a circle under the last message. Tap or click the exclamation point, then select Try Again . [1] X Research source You also have the option to send the message as a regular text instead of an iMessage. If Try Again doesn’t work, tap or click the exclamation point, then select Send as Text Message . This will only work if you have cellular/mobile data enabled on the iOS device associated with your phone number, or if you have Wi-Fi calling enabled on your phone and/or other connected devices you are trying to text from."
    },
    {
      "title": "Check for a “Read” message under your text.",
      "content": "Check for a “Read” message under your text. If your recipient has Read Receipts enabled on their device, you’ll be able to see if they’ve read your messages. Watch for the word “Delivered” to become “Read” to tell if they’ve looked at your text. The message will also display a timestamp, so you know exactly when it was read. If you’re still running iOS 17 or earlier, you’ll only be able to see read receipts from other iMessage users. However, the iOS 18 update supports RCS (Rich Communication Services). Among other things, this means you can now see read receipts from Android users, too! [2] X Research source"
    },
    {
      "title": "Enable read receipts on your device (optional).",
      "content": "Enable read receipts on your device (optional). If you want your contacts to know when you’ve seen their texts, you can turn this feature on in your device’s settings. [3] X Research source On an iPhone or iPad, go to Settings > Apps > Messages (or just Settings > Messages in iOS 17 or earlier). Toggle on the switch next to Send Read Receipts . On a Mac, open the Messages app and click Messages > Settings… in the menu bar at the top of the screen. Click the iMessage tab at the top of the Settings window, then check the box next to Send Read Receipts ."
    },
    {
      "title": "Check if the iMessage service is offline.",
      "content": "Check if the iMessage service is offline. It doesn’t happen often, but sometimes the iMessage servers go down. Visit Apple’s System Status page to check. If there’s a green dot next to iMessage , the servers are up and running and the problem is on your or the recipient’s end."
    },
    {
      "title": "Check your connection settings.",
      "content": "Check your connection settings. If you don’t have a good Wi-Fi or cellular connection, you might have trouble sending texts. Look at the Wi-Fi or cellular signal icons at the top right side of your screen to make sure you have a strong connection. [4] X Research source You can also go to Settings > Cellular (or Mobile) on your iPhone or iPad to make sure Cellular Data is toggled on, or to Settings > Wi-Fi to check the status of your Wi-Fi connection. On a Mac, click the Wi-Fi icon at the top right side of your screen to see your connection status. You can also connect to a different network if necessary. [5] X Research source"
    },
    {
      "title": "Make sure you have iMessage enabled.",
      "content": "Make sure you have iMessage enabled. If you don’t have iMessage turned on, you might have trouble sending messages from your device. To make sure it’s enabled: Open Settings > Apps > Messages on your iPhone or iPad (or Settings > Messages in iOS 17 or earlier). Check that the switch next to iMessage is toggled on. On a Mac, there’s no simple way to toggle iMessage on and off. Just make sure you have the Messages app set up correctly. For detailed instructions, check this article from Apple Support."
    },
    {
      "title": "Turn on Send as Text Message.",
      "content": "Turn on Send as Text Message. This setting on your iPhone or iPad allows Messages to automatically attempt sending texts as SMS or MMS if iMessage isn’t working. To turn it on, go to Settings > Apps > Messages (or Settings > Messages before iOS 18) and toggle on the switch next to Send as Text Message ."
    },
    {
      "title": "Enable Wi-Fi Calling.",
      "content": "Enable Wi-Fi Calling. This feature allows you to send texts over Wi-Fi even if you don’t have a cellular/mobile connection available. You’ll need to enable this feature on your iPhone and also on any other devices connected to the same Apple Account that you use for sending texts. Open Settings > Apps > Phone (or Settings > Phone in iOS 17 or earlier). Scroll down and tap Wi-Fi Calling . Toggle on Wi-Fi Calling on This iPhone . If you want to be able to text from your other devices even if you’re not connected to your mobile account, toggle on Add Wi-Fi Calling For Other Devices ."
    },
    {
      "title": "Enable Low Quality Image Mode if you have trouble sending images.",
      "content": "Enable Low Quality Image Mode if you have trouble sending images. Some cell phone carriers set limits on the size of files you can send over text. If your image and video texts aren’t getting through, it might help to reduce the image size. Here’s how: Go to Settings > Apps > Messages . Scroll all the way down and toggle on the switch next to Low Quality Image Mode . If you still can’t send images or videos, ask the recipient to check how much space they have on their phone. They may not have enough space to receive image or video files."
    },
    {
      "title": "Make sure message forwarding is set up correctly for Mac.",
      "content": "Make sure message forwarding is set up correctly for Mac. If you’ve set up your Mac to send and receive iMessages but not other types of texts (like SMS and MMS), you might have trouble texting with Android users. On your iPhone: Go to Settings > [Your Name] > iCloud > See All and select Messages . Toggle on Use on this iPhone or Sync on this device (depending on your version of iOS). Go to Settings > Apps > Messages > Text Message Forwarding and turn on Text Message Forwarding for all your other devices, including your Mac. On your Mac, open Messages, then select Messages > Settings… > iMessage and tick the box next to Enable Messages in iCloud . Select any email addresses and phone numbers from which you want to send and receive messages."
    },
    {
      "title": "Restart your device.",
      "content": "Restart your device. Sometimes a glitch will prevent you from sending texts. Try restarting your iPhone , iPad, or Mac to get it working again."
    },
    {
      "title": "Update to the latest OS.",
      "content": "Update to the latest OS. If you’re using an outdated version of iOS or macOS, your Messages app may not work correctly. Make sure you’re running the most recent OS that’s available for your device. On an iPhone or iPad, go to Settings > General > Software Update and install an update if there’s one available. On a Mac, go to Apple menu > System Settings… > General > Software Update . If an update is available, install it now."
    },
    {
      "title": "Change your date and time settings.",
      "content": "Change your date and time settings. If your date and time settings are incorrect, it can interfere with Messages. Here’s how to fix it: On an iPhone, go to Settings > General > Date & Time . Toggle on Set Automatically , or make sure you have the correct time zone selected under Time Zone. On a Mac, go to Apple menu > System Settings… > General > Date & Time and toggle on Set time zone automatically using your current location . Or, make sure that you have the correct time zone set if you’d rather not set the time automatically."
    },
    {
      "title": "Check with your carrier.",
      "content": "Check with your carrier. It’s possible that your cellular network provider doesn’t support the kind of text you’re trying to send. If you’re not sure what kind of texts you can send or what the limitations are on your account, get in touch with your carrier for more information."
    }
  ]
}