{
  "url": "https://www.wikihow.com/Give-the-Evil-Eye",
  "title": "How to Give the Evil Eye",
  "steps": [
    {
      "title": "Consider the consequences and be prepared for a confrontation.",
      "content": "Consider the consequences and be prepared for a confrontation. Evil eyes are meant to be noticed. They are meant to make the target feel uncomfortable or guilty. Unfortunately, they can also lead to confrontations. Your target may try to ask you what's wrong. If you are already very annoyed with this person, talking to them might be the last thing you feel like doing. Your target may even take the evil eye as a challenge and try to start a fight with you. Have an escape route if you want to avoid unwanted conversation. Do not give the evil eye when you are still stuck in line or in class. Instead, try to give it just as you are leaving the line or classroom. This will prevent the other person from cornering you. Have some sort of response in mind if the person does try to talk to you. A simple \"nothing\" will prevent the person from talking further to you, but it will also leave them questioning what they did that annoyed you."
    },
    {
      "title": "Have a target and motive in mind.",
      "content": "Have a target and motive in mind. Evil eyes tend to be personal. They are as much of a mental exercise as they are a physical one. They do not work well on random people who did nothing to annoy you. Because of this, you should have someone—a target so to speak—in mind. If you don't, seek someone out who has wronged you in some way. Jealousy is one of the most common reason for giving the evil eye. Your target maybe someone you don't know, but who did something annoying, such as ordering the last cupcake, humming too loudly and off-key, or refusing to calm her hyper, screaming child. Your target may be someone you have known for quite a while—and you may dislike everything about this person's appearance and personality. It can be a sibling, or even the precious, teacher's pet who can do no wrong."
    },
    {
      "title": "Choose the right moment.",
      "content": "Choose the right moment. This will depend on who your target is. Because evil eyes are meant to be noticed, you should wait until your target does something that irks you. For example: If your target is someone you don't know, wait until they do something annoying, such as paying for the cupcake you wanted so badly. If your target is someone you do know, you can give the evil eye after he or she does just about anything. It can be as simple as a sneeze or a girly hair flick."
    },
    {
      "title": "Dwell on the offenses, both past and present, to build your energy.",
      "content": "Dwell on the offenses, both past and present, to build your energy. An evil eye is not just about looking a certain way. Your target should be able to feel the anger and hatred seething off of you. Chances are, you might already be thinking about the offense (such as that annoying humming). If you already know the person and want to let them know how much you dislike them, you might need to dwell on previous offenses to get that energy built up. Here are some ways to build up this energy: Think about all the annoying things the person did in the past. Think about how unfair it is that they can get away with violating the dress-code while you get ticketed for your shirt becoming un-tucked when you bend over to get something out of your backpack. If you are having troubles finding past offenses, try thinking about things that make you upset or angry instead, such as: discrimination, politics, abuse, and so forth. Focus on something that happened that made you really angry. The more recent the event, the stronger the feeling will be."
    },
    {
      "title": "Maintain the energy and thoughts.",
      "content": "Maintain the energy and thoughts. Once you have started the train of negative thoughts, keep them up. You will need to keep at this until you are done giving the evil eye. If you are having trouble keeping up the energy, imagine something bad happening to your target, such as them dropping the cupcake (frosting side down) on the dirty floor."
    },
    {
      "title": "Keep your face relaxed and expression cool.",
      "content": "Keep your face relaxed and expression cool. Calm anger is more intimidating than out-of-control anger. Don't snarl, bare your teeth, or arch your eyebrows in a villainous way. This won't look very intimidating and will take away from the intensity of your stare. The most you should be doing is squinting or widening your eyes. Your mouth can be drawn into a straight line, as though you tasted something bitter."
    },
    {
      "title": "Look at the person until they notice and make eye contact.",
      "content": "Look at the person until they notice and make eye contact. This may not happen right away. Don't give up. Keep staring at the person and don't let your gaze wander. Eventually, the person will \"sense\" your gaze, and turn to look at you."
    },
    {
      "title": "Maintain eye contact for a few seconds, then look away.",
      "content": "Maintain eye contact for a few seconds, then look away. The longer you know this person, the longer the stare should be. For example, if this is a stranger who ordered that last cupcake you wanted, half a second to a full second should be enough. If this is someone you know, like that annoying teacher's pet, a second or two will be plenty. Keep in mind that the longer you look, the more likely the person you are giving the evil eye to will talk to you. When you look away, allow your face to relax into its usual expression."
    },
    {
      "title": "Return to whatever is it that you were doing beforehand.",
      "content": "Return to whatever is it that you were doing beforehand. Act as though nothing has happened. This will help make your evil eye stand out from your usual routine, and make the person realize that they did something wrong. It may also help prevent them from approaching you and confronting you."
    },
    {
      "title": "Keep the negative thoughts going once you get them started.",
      "content": "Keep the negative thoughts going once you get them started. This will help make your gaze all the more intense."
    },
    {
      "title": "Avoid looking directly at the person at first, if you are within their eyesight.",
      "content": "Avoid looking directly at the person at first, if you are within their eyesight. If you are in the person's line of sight, try to position yourself so that he or she can only see the side of your face. This will allow you to turn your head and look at them slowly in a most intimidating way."
    },
    {
      "title": "Squint or widen your eyes.",
      "content": "Squint or widen your eyes. This sudden change from your normal gaze will alert your target that something is wrong. This is the first step to making him or her feel uncomfortable."
    },
    {
      "title": "Keep your lips drawn into a straight line.",
      "content": "Keep your lips drawn into a straight line. Try not to bare your teeth or snarl. This won't look very intimidating. The last thing you'd want to look like is a cartoon villain; you will look more comical than intimidating."
    },
    {
      "title": "Dip your chin a little.",
      "content": "Dip your chin a little. This way, you will be looking out at your target from under your eyebrows. This will make your face look more angular, and thus more threatening."
    },
    {
      "title": "Slowly turn your head to look at the person.",
      "content": "Slowly turn your head to look at the person. If they are already looking in your direction, this will make you look more ominous. If they aren't looking at you yet, they will eventually notice your gaze."
    },
    {
      "title": "Try to make eye contact, and maintain it for a few seconds.",
      "content": "Try to make eye contact, and maintain it for a few seconds. Think of it as though you are looking \"through\" the person. Try not to blink, as this may break the intensity of your stare. If you want, you can raise one eyebrow slightly, for a more sarcastic touch."
    },
    {
      "title": "Walk away as though nothing has happened.",
      "content": "Walk away as though nothing has happened. Once the person has noticed your evil gaze, break eye contact and leave. If you can't walk away, slowly look away, and return to whatever it was that you were doing."
    }
  ]
}