{
  "url": "https://www.wikihow.com/Host-a-LAN-Party",
  "title": "How to Host a LAN Party",
  "steps": [
    {
      "title": "Decide how big your LAN party will be.",
      "content": "Decide how big your LAN party will be. You can probably host a smaller LAN party (6-16 people) with equipment you already have. For larger LANs (16 or more people) you may need to buy/rent more equipment. The other limiting factor is the venue. A good way to gauge how much room you will need is to plan for 2 people per 6-foot table ."
    },
    {
      "title": "Find a venue.",
      "content": "Find a venue. The garage is perfect for smaller LAN parties. You can usually fit about 20 gamers in the average size 2- car garage. If you need more room, start looking for large meeting halls. Try asking around at local colleges, churches, Elks lodges, and other public spaces. Finding free space is best, but if no owners are willing, then a hotel meeting room may be your best option. It can cost a lot of money , but they will be able to provide you with reliable power, air conditioning, and even tables and chairs."
    },
    {
      "title": "Acquire all the necessary networking equipment.",
      "content": "Acquire all the necessary networking equipment. You will need at minimum a router (ex: Linksys BEFSR41 or [1] ). Most routers only have 4 network ports, so if you plan to have more than 3 people over, then may also need a switch (ex: [2] or D-Link DSS-16+ ). You should have 1 network port per person. 10/100BaseT equipment is more than adequate for gaming , although gigabit speeds are nice for fast file transfers. However, if you want to save money (and who doesn't?), you can find cheap 48-port 10/100 switches on eBay . The switch plugs into the router , and all the gamers plug into the switch. Some network guidelines depending on the size of your LAN party follow: Up to 10 PCs - You will need a network card for every PC, a small 100BASE-TX Ethernet switch, and at least 2 100BASE-TX network cables; you may be able to purchase a network starter kit. 11 - 40 PCs - Get 100BASE-TX switches with enough ports for all your guests (or multiple switches with linkup ports) and enough cables to connect the computers to the switches. To save time and headaches , ask guests to have their network cards installed and configured and TCP/IP protocol installed before they show up. They should also bring their own switches and cables, but you should have some extra just in case. 41 - 200 PCs - In addition to the previously listed equipment, you will need switches (preferably 10/100, at least one port for each 40 people) and dedicated servers in order to avoid a lag. Consider running all your servers on 100 Base-TX, or a gigabit network."
    },
    {
      "title": "Acquire all the necessary power equipment.",
      "content": "Acquire all the necessary power equipment. If you overload your circuits, the circuit breaker will trip and the pressure will be on for you to fix it on the spot. The best solution is to be prepared. If hosting in your garage or house , you will need extension cords to run from electrical sockets around the house. This is because you can only plug so many computers into one circuit. To determine which sockets are on which circuits, you will need to go out to the circuit breaker box. If you are lucky, then the circuits are labeled. If not, you will need a 2nd person in the house who can tell you which room's lights go out when you flip off each circuit. If you are at a hotel venue or using a generator (see Tips), you will be provided with distribution boxes, which have multiple 20 amp circuits. A good guideline is 4 gamers on a 15 amp circuit and 6 gamers on a 20 amp circuit. Run extension cords to each table to evenly distribute power, and make sure the gamers know which plug they should plug into. It's a good idea to check every circuit and map it out on a piece of paper, hand out a copy to everyone, and label each outlet. Be careful with refrigerators and air conditioning being on the same circuit as PCs. When their compressors turn on, they draw a lot of power."
    },
    {
      "title": "Acquire seating.",
      "content": "Acquire seating. For a small LAN, your dining table and desk may be all you need. For a garage LAN, you may have to rent some folding tables and chairs. Your local party rental store will be able to help you out for less than $100. 6 foot (1.8 m) tables are the perfect size for 2 gamers. 8 foot (2.4 m) tables can fit 3 gamers with a bit of a squeeze. As already mentioned, hotel meeting rooms will have tables and chairs already available for you."
    },
    {
      "title": "Decide which games will be played.",
      "content": "Decide which games will be played. Choose a variety of game styles (FPS, RTS, Racing). Keep in mind that choosing only the newest games will alienate gamers with older PCs. If you are planning a tournament, decide the game, format, rules, and maps. You may want to run software like LanHUB or Autonomous LAN Party , which helps you track the tournament ladders."
    },
    {
      "title": "Set up dedicated game servers.",
      "content": "Set up dedicated game servers. Most games today will benefit from having a dedicated server, even running on a modest PC. Search the internet for configuration files, and get everything installed and tested. Learn server commands. You don't want to be setting this up the day of the LAN."
    },
    {
      "title": "Plan activities besides gaming.",
      "content": "Plan activities besides gaming. No one can sit at a computer for 24 hours straight (...at least they shouldn't). Try classic LAN party games, like dodgeball , hard drive shuffleboard, and power supply chucking'."
    },
    {
      "title": "Make lunch and dinner plans.",
      "content": "Make lunch and dinner plans. It can be as simple as ordering pizzas or a group exodus to a local restaurant . You could also plan a BBQ or hire [catering services]. Try to get a wide variety of food do there are options for everyone to choose from."
    },
    {
      "title": "Choose a date and other details.",
      "content": "Choose a date and other details. The date may be determined by when the venue is available. For small LANs, try to make it at least 3 weeks in advance (2 months for larger LANs) so people can keep their schedule open."
    },
    {
      "title": "Get sponsored.",
      "content": "Get sponsored. It's surprisingly easy to do. Companies like Intel, AMD, nVidia, and OCZ will send you small things like stickers, posters, and t-shirts. If your LAN is of a good size, you might be able to get some hardware to give away. Make it worth their while. Prizes can make your LAN party more appealing, but they should never be the focus. You're there for the gaming!"
    },
    {
      "title": "Promote it.",
      "content": "Promote it. This is the most important step! Post in forums, list it on LANparty.com, Blue's News , and post fliers in the area. Have your friends tell their friends. Make it clear what time it takes place, what games will be played, and what the person should bring with them."
    },
    {
      "title": "A few days before the LAN, download the latest patches, mods, and maps for the games you plan to play.",
      "content": "A few days before the LAN, download the latest patches, mods, and maps for the games you plan to play. Organize them onto a shared folder on your computer or a dedicated file server. This way, gamers can update their games without throttling your internet connection. You may even want to burn these files to CDs, to hand out to the LAN attendees."
    },
    {
      "title": "Set up the room the night before the LAN.",
      "content": "Set up the room the night before the LAN. Set up chairs, tables and trash cans. Prepare a sign-in sheet, and have assigned IP addresses next to each name. (assigned IPs are unnecessary if you are running a DHCP server) Print out hand-outs welcoming the guests and describing some rules and guidelines. Set up and connect your networks and servers, and test away."
    }
  ]
}