{
  "url": "https://www.wikihow.com/Identify-a-Yorkshire-Terrier",
  "title": "How to Identify a Yorkshire Terrier",
  "steps": [
    {
      "title": "Know if the dog is a Yorkshire Terrier or a Silky Terrier.",
      "content": "Know if the dog is a Yorkshire Terrier or a Silky Terrier . Silky Terriers are an Australian breed and a part of the toy group. [3] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Silkys and Yorkies are remarkably similar in appearance, since Yorkies were part of Silkys' development. [4] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source The breeds are close in size, though Silkys are the larger of the two, being 10–11 pounds (4.5–5.0 kg). [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Both breeds have straight, silky blue and tan coats; however, the coat of a Silky isn't as long as a Yorkie's for show. Silkys have more of a wedge-shaped head while Yorkies have round heads, and a Silky's ears are sharper and not as large at the base. [6] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Yorkies and Silkys have similar terrier temperaments, but a distinct characteristic of the Silky Terrier is being alert and constantly watchful. [7] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Identify differences between Yorkshire Terriers and Australian Terriers.",
      "content": "Identify differences between Yorkshire Terriers and Australian Terriers. Australian Terriers are another native Australian breed, and they are a member of the terrier group. [8] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Aussies are larger than Yorkies, weighing 15–20 pounds (6.8–9.1 kg). [9] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Both Aussies and Yorkies may be seen with blue and tan coats, though Aussies may also be solid sandy or solid red in color. [10] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Australian Terriers have harsh, straight coats [11] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source rather than the straight, silky coat of a Yorkie. When it comes to temperament, Aussies are spirited and alert. [12] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Understand how Yorkshire Terriers and Maltese differ.",
      "content": "Understand how Yorkshire Terriers and Maltese differ. The Maltese is a popular breed from the toy group that was once a fashion symbol in Rome. [13] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Maltese and Yorkies are almost identical in size; Maltese stand at 7–9 inches (18–23 cm) in height with a weight of under 7 pounds (3.2 kg). [14] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source While Yorkies sport blue and tan coats, Maltese are solid white with long, straight single coats. [15] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The tail of a Maltese is carried over the back, [16] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source while a Yorkie's tail is docked to a medium length. Maltese are affectionate and gentle yet lively. [17] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "See if the dog is a Yorkshire Terrier or a Chihuahua.",
      "content": "See if the dog is a Yorkshire Terrier or a Chihuahua . Chihuahuas are a national symbol of Mexico and part of the toy group. [18] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Yorkies are very small dogs, but Chihuahuas are even smaller, weighing no more than 6 pounds (2.7 kg) and standing at 5–8 inches (13–20 cm) tall. [19] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Chihuahuas have large, erect ears and undocked sickle tails, [20] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source while a Yorkie's tail is typically docked. Yorkies are blue and tan, but a Chihuahua's soft coat, which may be smooth or long, may be any color or pattern. [21] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Chihuahuas are terrier-like in temperament and are alert and confident. [22] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Recognize how Yorkshire Terriers and Pomeranians differ.",
      "content": "Recognize how Yorkshire Terriers and Pomeranians differ. Pomeranians are a spitz-type breed and part of the toy group. [23] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Yorkies are one of the smallest breeds, but Pomeranians can be smaller, standing at 6–7 inches (15–18 cm) in height and weighing 3–7 pounds (1.4–3.2 kg). [24] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source They have small, erect ears and, unlike the docked tail of a Yorkie, a heavily plumed tail that lies flat and straight on the back. [25] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Pomeranians have long, harsh double coats that may be any color or pattern. [26] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source When it comes to temperament, Pomeranians are extroverted, being vivacious and intelligent. [27] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Tell the differences between Yorkshire Terriers and Papillons.",
      "content": "Tell the differences between Yorkshire Terriers and Papillons . Papillons are a European toy breed. [28] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Like Yorkies, Papillons are small dogs, but they are slightly larger than Yorkies, having a weight of 5–10 pounds (2.3–4.5 kg) and a height of 8–11 pounds (3.6–5.0 kg). [29] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source A Papillon may have erect or drop ears, the erect ears resembling butterfly wings and the drop ears being completely down. [30] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Papillons have long, silky, straight coats, similar to a Yorkie, but are always parti-color or white with patches of any color. [31] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source They are happy, alert, and friendly. [32] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Spot differences between Yorkshire Terriers and Shih Tzu.",
      "content": "Spot differences between Yorkshire Terriers and Shih Tzu . The Shih Tzu is a toy breed from Ancient China. [33] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Shih Tzu are small dogs but larger than Yorkies, being 9–10.5 inches (23–27 cm) tall with a weight of 9–16 pounds (4.1–7.3 kg). [34] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Shih Tzu have long, flowing coats that may be slightly wavy and come in every color. [35] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Instead of a docked tail, Shih Tzu have tails that curl over the back. [36] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The personality of a Shih Tzu is described as outgoing, happy, and friendly. [37] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Pay attention to the dog's size.",
      "content": "Pay attention to the dog's size. Yorkshire Terriers are very small dogs. They are 7–8 inches (18–20 cm) tall and weigh under 7 pounds (3.2 kg). [38] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Sometimes people consider \"Teacup Yorkies\" a separate size, [39] X Research source but these aren't recognized as an individual size of Yorkshire Terrier by dog show standards."
    },
    {
      "title": "Look at the eyes.",
      "content": "Look at the eyes. A Yorkie's eyes are medium in size and dark in color, with dark eye rims. [40] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source They seem to sparkle with a sharp, intelligent expression. [41] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Inspect the ears.",
      "content": "Inspect the ears. Yorkies have small ears that are carried erect. They are V-shaped and set not too far apart. [42] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Examine the muzzle.",
      "content": "Examine the muzzle. The muzzle of a Yorkshire Terrier is not too long. The head is small and rather flat on the top, and Yorkies may have either a scissors or level bite, with a black nose. [43] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Check the tail.",
      "content": "Check the tail. A Yorkie's tail is carried slightly higher than the level of the back. For show, it is docked to a medium length, [44] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source though it may be kept long otherwise."
    },
    {
      "title": "See the dog's overall structure.",
      "content": "See the dog's overall structure. Yorkshire Terriers have well-proportioned, very compact bodies. They have short backs, a level backline, and straight legs. [45] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Yorkies give off an appearance of vigor and self-importance. [46] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Analyze the texture of the coat.",
      "content": "Analyze the texture of the coat. Yorkshire Terriers have glossy, fine, silky hair. [47] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The coat is moderately long and perfectly straight, with very long hair on the muzzle. [48] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Yorkies may have hair tied up with a bow on the head. [49] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Yorkies have long hair for show, but a Yorkie may be seen with a different haircut. This may include having the coat trimmed short."
    },
    {
      "title": "Check the coat color.",
      "content": "Check the coat color. Yorkies have blue and tan coats. The blue is a dark steel-blue color that extends over the body from the back of the neck to the tail, and the tail may even have a darker blue. [51] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The head is a rich golden tan that may be darker at the sides, ears, and muzzle. [52] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The chest and legs are a bright tan that doesn't extend above the elbows. [53] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Puppies are born with black and tan coats, and they are normally darker in color, with an intermingling of black hair with tan until the dog matures, so take age into account. [54] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Understand that Yorkshire Terriers are not white.",
      "content": "Understand that Yorkshire Terriers are not white. Though they may have a small white spot on the forechest, [55] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Yorkshire Terriers aren't seen in white. The Biewer Terrier is another toy terrier breed that was originally from a piebald gene in Yorkies. [56] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source They are tri-colored, being blue or black, gold or tan, and white. Biewers are now recognized as a separate breed from Yorkies, [57] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source not as piebald or parti Yorkies. Some people consider the \"Parti Yorkie\" and Biewer Terrier separate breeds, the former being a Yorkshire Terrier with white markings. However, dog show standards only permit solid blue and tan Yorkies, with only a small spot of white on the chest permissible. [58] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Additionally, solid white and gold dogs are considered their own breed or a variety of Biewer Terrier called the Golddust Yorkshire Terrier. [59] X Research source"
    },
    {
      "title": "See if the dog is attention-seeking.",
      "content": "See if the dog is attention-seeking. Yorkies like being the center of attention. This may lead to frequent barking or stubbornness if they aren't given the attention they desire. [60] X Research source"
    },
    {
      "title": "Expect high self-esteem.",
      "content": "Expect high self-esteem. Yorkshire Terriers are spunky and don't act their size. They may try to act dominant or aggressive and may stand up to bigger dogs. [61] X Research source"
    },
    {
      "title": "Notice if the dog is protective.",
      "content": "Notice if the dog is protective. A Yorkie may be wary or suspicious of strangers. Combined with their barking, this can make them good watchdogs. [62] X Research source"
    },
    {
      "title": "Check if the dog is affectionate.",
      "content": "Check if the dog is affectionate. Yorkshire Terriers are very affectionate and loyal. Once they learn their place in the household, they are loving and show more signs of affection, such as sitting on their owner's lap. [63] X Research source"
    },
    {
      "title": "Watch for a desire to be with their owner.",
      "content": "Watch for a desire to be with their owner. Yorkies are possessive of their owners and don't enjoy being alone. They are prone to having separation anxiety if they aren't around their owner. [64] X Research source"
    }
  ]
}