{
  "url": "https://www.wikihow.com/Introduce-a-Pleco-to-a-Goldfish-Tank",
  "title": "How to Introduce a Pleco to a Goldfish Tank",
  "steps": [
    {
      "title": "Ask how large the pleco will grow to be.",
      "content": "Ask how large the pleco will grow to be. Although most pet stores will sell plecos that are only a few inches in length, you should know that they can grow quite large. Fully grown plecos can reach up to two feet in length. The exact size of the pleco will vary depending on the species. Ask someone at the pet store how large the pleco will get before making a purchase. [1] X Research source"
    },
    {
      "title": "Check to see if a pleco is compatible with your goldfish.",
      "content": "Check to see if a pleco is compatible with your goldfish. There are a few varieties of pleco fish and each will have their own temperament. Some plecos may become rather aggressive when they grow to a larger size or encounter other fish. Because of this, you will want to make sure that the species you are buying will be safe to place in the same tank as your goldfish. Ask someone at your pet store if the pleco you are interested in would be a good mix with your goldfish. [2] X Research source [3] X Research source [4] X Research source Rubber-lipped plecos are generally non-aggressive towards goldfish and prefer a similar tank environment. Longfin bristlenose plecos will usually have no conflicts with your goldfish. However, these plecos tend to fight with other plecos. Zebra plecos tend to be more carnivorous and may eat other fish in your tank."
    },
    {
      "title": "Be ready for a commitment.",
      "content": "Be ready for a commitment. Plecos can live for a long time and grow quite large. Because they can live so long, you'll need to be committed to caring for the pleco over the course of its life. If you don't think you will maintain your goldfish tank for around ten years, you may want to reconsider purchasing a pleco. [5] X Research source"
    },
    {
      "title": "Make sure your tank is big enough for a pleco.",
      "content": "Make sure your tank is big enough for a pleco. Plecos will start off quite small and can seem like the perfect addition to any goldfish tank. However, it's important to realize that your pleco can grow up to 2 feet in length. You'll need to have a tank large enough to accommodate the full grown pleco or have plans to provide a larger tank later on. [6] X Research source [7] X Research source [8] X Research source The tank should be around 75 gallons to comfortably accommodate a fully grown pleco. Plecos may become dangerous to other fish if the tank is overcrowded. Don't try to house multiple plecos in one tank as they will likely fight and kill one another."
    },
    {
      "title": "Add some driftwood to the tank.",
      "content": "Add some driftwood to the tank. Plecos will get most of their diet from the algae on the fish tank walls. However, plecos have a need to gnaw on driftwood to provide extra nutrition. Make sure your tank has some driftwood placed in it to provide a proper and healthy environment for your pleco. [9] X Research source"
    },
    {
      "title": "Provide cover for your pleco.",
      "content": "Provide cover for your pleco. Plecos will love to have plenty of hiding places in the aquarium. These spaces can help make your pleco feel more relaxed, give them a place to rest and prevent aggressive behavior. Make sure your tank has a few areas where your pleco can take a break and get some rest. [10] X Research source Adding in some pipes or tunnels can be a good idea. You can find many different styles and types of cover for your pleco at most pet stores. Make sure you securely position any plants in your aquarium. Pleco fish will easily uproot and destroy any plants that aren't securely rooted."
    },
    {
      "title": "Measure the pH and temperature levels of the tank.",
      "content": "Measure the pH and temperature levels of the tank. Like most fish, plecos will have a specific range of temperature and pH levels that they can comfortably live in. You'll want to take careful measurements of both the tank's temperature and pH levels before adding in your pleco. Levels that are too high or too low may cause your pleco to become unhealthy or even die. [11] X Research source [12] X Research source Plecos will do well in tanks that range from 68-84 degrees Fahrenheit. pH levels can range between 6.5 and 8."
    },
    {
      "title": "Check to see if your filter is set up correctly.",
      "content": "Check to see if your filter is set up correctly. In their natural environment, plecos enjoy fast moving water and strong currents. While you won't be able to emulate the full strength of the pleco's preferred current, you will want to have a high powered filter. Providing a constant water current in the tank will help your pleco feel comfortable and at home. [13] X Research source"
    },
    {
      "title": "Add the bag containing your pleco to the tank.",
      "content": "Add the bag containing your pleco to the tank. The first step in introducing your pleco to the tank will be to simply place the entire bag into the tank. Adding the bag that contains your pleco to the tank will gently match the temperature of the water in the bag to that of the tank's water. This will help your pleco avoid any shock that can come from large temperature differences in the water. [14] X Research source Keep the bag closed when placing it on the water's surface. Let the bag sit for at least ten minutes. Make sure none of the water in the tank or the bag are able to mix."
    },
    {
      "title": "Pour some tank water into the pleco's bag.",
      "content": "Pour some tank water into the pleco's bag. Once your pleco has been floating on the surface of the tank water for a while, you can start adding tank water to the pleco's bag. Adding water will help to gently introduce the pleco to the temperature and pH levels of the tank's water. Adding the tank water to the pleco's bag is an important step and will help avoid potential health risks to your pleco. [15] X Research source Wait ten minutes between adding more water to the bag. Keep the bag sealed to avoid the uncontrolled mixing of tank and bag water. Do not let the bag's water spill into the tank. Eventually, the entire bag will be filled with tank water."
    },
    {
      "title": "Scoop the pleco out of the bag and place it in the tank.",
      "content": "Scoop the pleco out of the bag and place it in the tank. After the bag has been filled with tank water and the pleco has had time to acclimate, you can scoop it out with a net and put it in the tank. Open up the bag and put your net in to catch the pleco. Put the net and the pleco into the tank and allow it to swim out of the net. [16] X Research source Don't dump the pleco out into the tank. Do not mix the bag water into the tank water."
    },
    {
      "title": "Keep an eye on your fish.",
      "content": "Keep an eye on your fish. Now that your pleco is at home in the tank, you'll want to keep an eye on all of your fish. Your pleco will likely adjust with no trouble. However, your pleco may attack or try to feed off of your goldfish. You will need to keep an eye on the behavior of all your fish to make sure they are getting along well. [17] X Research source Goldfish have a film around them that plecos may try to eat. Look for red marks on your goldfish. These marks can indicate your pleco is feeding from the goldfish."
    },
    {
      "title": "Feed your pleco.",
      "content": "Feed your pleco. Although plecos will be happy to eat any algae or plants they find in your aquarium, they will still require you to give them food. Adding in these additional food items will help ensure that your pleco is getting the nutrients that it needs. Try offering some of these food items to help keep your pleco happy and healthy: [18] X Research source Large plecos can eat tiny bits of shrimp or fish. Vegetables such as salad, cucumbers or squash can be given to your pleco. Spirulina tablets can be given to your pleco."
    }
  ]
}