{
  "url": "https://www.wikihow.com/Make-Citrus-Spray",
  "title": "How to Make Citrus Spray",
  "steps": [
    {
      "title": "Wash your desired citrus fruit, then peel it.",
      "content": "Wash your desired citrus fruit, then peel it. Clean the citrus with warm, soapy water first, then pat it dry. Peel the fruit by hand to ensure that there is no pulp clinging to the pith. Any pieces of fruit can lead to mold. [1] X Research source You can use any combination of lemons, limes, grapefruits, or oranges. You can also use just one type of peel if you prefer. [2] X Research source You need enough peels to fill up a glass jar."
    },
    {
      "title": "Fill a glass jar with your collected citrus peels.",
      "content": "Fill a glass jar with your collected citrus peels. How many peels you end up using depends on the size of jar. The larger the jar, the more citrus peels you will need. Make sure that you fill the jar all the way to the top. If you can, use a jar with tapering sides. This will reduce the chances of any small pieces floating to the top and causing mold. [3] X Research source The jar must be glass; the oils released by the citrus peels will break down a plastic jar."
    },
    {
      "title": "Add some herbs, if desired.",
      "content": "Add some herbs, if desired. You don't have to do this, but it can give your spray a more interesting fragrance. Listed below are some suggestions based on the type of citrus peel you may have used: [4] X Research source If you used orange peels, add some cinnamon sticks, whole cloves, and almond extract for a Fall-like fragrance. Add rosemary sprigs and vanilla extract to lemon peels for a fresh, yet sweet, fragrance. If you used lime peels, add some thyme for a zesty scent. Add mint leaves, extract, or essential oil to grapefruit peels for something more refreshing."
    },
    {
      "title": "Cover the peels with white vinegar.",
      "content": "Cover the peels with white vinegar. Pour the vinegar into the jar until the citrus peels are completely submerged. If you see any small pieces floating on the surface of the vinegar, place a large peel on top to weigh everything down. [5] X Research source"
    },
    {
      "title": "Let the jar sit in a cool, dark place for 2 weeks.",
      "content": "Let the jar sit in a cool, dark place for 2 weeks. Check the jar every few days to ensure that the peels are submerged and that there is no mold developing. [6] X Research source If the vinegar level has gone down, open the jar up and add more vinegar. If you see any mold, you will need to discard the affected piece(s) immediately. Write the date on the jar with a permanent marker to help you keep track of time. [7] X Research source"
    },
    {
      "title": "Strain the liquid.",
      "content": "Strain the liquid. Once the 2 weeks are up, open up the jar. Place a strainer over another jar, then pour the liquid into it. Discard the peels caught in the strainer. The liquid may still have a lingering vinegar odor, which is normal."
    },
    {
      "title": "Dilute the liquid with distilled water.",
      "content": "Dilute the liquid with distilled water. How much water you end up using is up to you. For best results, however, plan on using equal amounts of strained citrus liquid and distilled water."
    },
    {
      "title": "Transfer the liquid to a glass spray bottle.",
      "content": "Transfer the liquid to a glass spray bottle. Open up a glass spray bottle, and stick a funnel into the neck. Pour the strained liquid through the funnel and into the spray bottle. Avoid using a plastic bottle, as the oils will cause it to degrade over time."
    },
    {
      "title": "Use the spray to clean up counters, stoves, and microwaves.",
      "content": "Use the spray to clean up counters, stoves, and microwaves. Close the spray bottle and give it a shake. Adjust the nozzle, if needed, then spray it on the surface to be cleaned. Wipe the spray off with a sponge or paper towel. This spray may cause etching on marble, granite, and other stone surfaces. [8] X Research source"
    },
    {
      "title": "Select a small, glass spray bottle.",
      "content": "Select a small, glass spray bottle. Choose a bottle that is able to hold at last 4 ounces (120 milliliters) of liquid. Insert a small funnel into the neck of the bottle to make filling easier."
    },
    {
      "title": "Fill the bottle with 1 tablespoon (15 milliliters) of vodka.",
      "content": "Fill the bottle with 1 tablespoon (15 milliliters) of vodka. This will help dilute the essential oils and make it easier to mix them in with the water. If you can't find any vodka, you can try witch hazel or rubbing alcohol instead."
    },
    {
      "title": "Add 15 to 20 drops of your favorite citrus essential oil.",
      "content": "Add 15 to 20 drops of your favorite citrus essential oil. You can use just one type of essential oil or a combination of different ones. Lemon, orange, and grapefruit are all popular choices, but don't be afraid to experiment with different ones too. For a classic citrus spray, try a combination of bergamot, lemon, and orange. You can also use this spray on your furniture as a cat deterrent. Try a combination of lemon and eucalyptus. [9] X Research source"
    },
    {
      "title": "Swirl the oils and alcohol together to combine.",
      "content": "Swirl the oils and alcohol together to combine. Close the spray bottle or plug the opening with your thumb. Gently swirl the oils and witch hazel/alcohol together. This will create a base and make it easier to mix into the water."
    },
    {
      "title": "Add 3½ ounces (104 milliliters) of distilled water.",
      "content": "Add 3½ ounces (104 milliliters) of distilled water. If you don't have any distilled water, use filtered water instead. Distilled water will make the spray last longer, however."
    },
    {
      "title": "Close the bottle and shake it to combine everything.",
      "content": "Close the bottle and shake it to combine everything. Your spray is now ready to use! Keep in mind that you will need to shake the bottle each time before you use it. You can use this spray to fragrance your room, bed linens, and furniture."
    },
    {
      "title": "Fill a glass spray bottle with 1 tablespoon (15 milliliters) of witch hazel.",
      "content": "Fill a glass spray bottle with 1 tablespoon (15 milliliters) of witch hazel. The witch hazel will act as a preservative. It will also help dilute the essential oils and allow them to blend with the water. [10] X Research source If you don't have any witch hazel, you can use vodka instead. [11] X Research source Avoid using rubbing alcohol however, as it is too harsh on the skin. Make sure that the spray bottle is able to hold at least 2 ounces (60 milliliters). Insert a funnel into the neck of the bottle to make filling it easier."
    },
    {
      "title": "Add 15 to 20 drops of your desired essential oil.",
      "content": "Add 15 to 20 drops of your desired essential oil. You can use just one fragrance, or a combination of different ones. For example, if you wanted a classic, citrus fragrance, you could try: 10 drops grapefruit essential oil, 4 drops lime essential oil, and 4 drops lemon essential oil. [12] X Research source Here are some more ideas to get you started: [13] X Research source For something sweet, try 1/8 teaspoon of pure vanilla extract and 10 drops wild orange essential oil. For something energizing, try a combination of grapefruit and lavender essential oil. For a Fall-like fragrance, start with a base of sweet orange essential oil, then add a few drops of cinnamon leaf essential oil. For something refreshing, start with a base of lemon essential oil, then add a few drops of lavender and sandalwood essential oil. [14] X Research source"
    },
    {
      "title": "Gently swirl the two ingredients together.",
      "content": "Gently swirl the two ingredients together. If you want to, you can add in 1 tablespoon (15 milliliters) of vegetable glycerin. This is not absolutely necessary, but it will help keep the fragrance last longer. [15] X Research source"
    },
    {
      "title": "Add 2 tablespoons (30 milliliters) of distilled water.",
      "content": "Add 2 tablespoons (30 milliliters) of distilled water. If you don't have any distilled water, try filtered water or bottled water. Avoid using tap water, as it may contain minerals that could interfere with the final spray. [16] X Research source For a more citrus-y fragrance, consider using orange blossom water instead; note that it is not the same thing as orange juice. [17] X Research source"
    },
    {
      "title": "Shake the spray before using it.",
      "content": "Shake the spray before using it. Close the spray bottle tightly, then give it a shake. You can use it just like you would any other body spray, but using it on any areas that will be exposed to the sun; citrus makes the skin more sensitive to sunlight, which can increase chances of sunburn. [18] X Research source You will need to shake the bottle each time before you use it."
    },
    {
      "title": "Fill a small, glass spray bottle part-way with distilled water.",
      "content": "Fill a small, glass spray bottle part-way with distilled water. Insert a funnel into the neck of a 3-ounce (88-milliliter) glass spray bottle. Pour in 1½ ounces (45 milliliters) of distilled water. If you can't find any distilled water, use filtered or bottled water instead. You can also use water that's been boiled and cooled instead. [19] X Research source If you can't find a 3-ounce (88-milliliter) spray bottle, you can use one that is a little larger."
    },
    {
      "title": "Add 2 tablespoons (30 milliliters) of witch hazel.",
      "content": "Add 2 tablespoons (30 milliliters) of witch hazel. This will add to the base as well as act as a preservative. Witch hazel will also act as a natural astringent. [20] X Research source"
    },
    {
      "title": "Add 1 teaspoon of liquid aloe vera.",
      "content": "Add 1 teaspoon of liquid aloe vera. This will give the spray a soothing, cooling effect. If you can't find any liquid aloe vera, you can try using some aloe vera juice instead, just be sure to strain the pulp out. [21] X Research source You can also try ½ teaspoon of aloe vera gel."
    },
    {
      "title": "Add 1 teaspoon of citronella essential oil.",
      "content": "Add 1 teaspoon of citronella essential oil. This is the secret to keeping those bugs away. Make sure that you are using pure essential oil and not lamp oil or torch oil as those are not considered to be skin-safe. [22] X Research source"
    },
    {
      "title": "Add some fragrance with lemon and grapefruit essential oil.",
      "content": "Add some fragrance with lemon and grapefruit essential oil. You will need ½ teaspoon of each. If you aren't a fan of grapefruit, however, you can use more lemon essential oil. Eucalyptus or tea tree essential oil are also great choices; they pair well with lemon and are effective at repelling insects. [23] X Research source Do not use lemon extract; it is not the same thing."
    },
    {
      "title": "Close the bottle and shake it to mix the ingredients together.",
      "content": "Close the bottle and shake it to mix the ingredients together. Your citrus bug spray is now ready to use! You can spray it on your arms, legs, and clothes to keep mosquitoes away, just be careful to avoid the face and eyes. [24] X Research source Shake the bottle each time before you use the spray. If you are using aloe vera juice, be aware that the spray may expire."
    }
  ]
}