{
  "url": "https://www.wikihow.com/Introduce-a-Journal-Article-in-an-Essay",
  "title": "How to Introduce a Journal Article in an Essay",
  "steps": [
    {
      "title": "This option is best if either the article or the author is well-known.",
      "content": "This option is best if either the article or the author is well-known. When you're using a journal article that is frequently cited in your field or is written by a well-established authority, introduce it with simply the title and the author. Your readers will understand why you're using that article because it's widely considered an authority. For example, you might write: \"Albus Dumbledore describes the origin of the four Hogwarts houses in his article 'Separating Hogwarts Fact and Fiction.'\" Put the title of the article in double-quotation marks in your text. [1] X Research source If you're quoting directly from the source, include the author's full name the first time you quote them. [2] X Research source"
    },
    {
      "title": "Use a summary if you only need the main point of the article.",
      "content": "Use a summary if you only need the main point of the article. Read the entire article so you can provide a complete summary of the point of the article in a sentence or two. Then, introduce the article with your summary of what it's about. [3] X Research source For example, you might write: \"The history of Hogwarts makes clear that the houses were never intended to be seen as 'good' or 'evil.' Rather, each house emphasizes and nurtures specific traits students have—how they use those traits is up to them.\" Paraphrasing from the article is similar to summarizing. However, when you summarize, you're covering the entire article in a sentence or two. A paraphrase typically only covers a small portion of the article."
    },
    {
      "title": "Explain how the author or the article is important with background info.",
      "content": "Explain how the author or the article is important with background info. Discuss the background of the source to demonstrate the author's expertise in the field or why their conclusions are reliable. List the author's credentials if they relate to the topic of your essay—they'll give your writing more credibility. For example, you might write: \"Professor Slughorn was one of the longest-serving teachers at Hogwarts, schooling generations of students in potions until his retirement.\" You might also include some background if the author of the article is controversial or the article's conclusions have been seriously questioned. If you're doing this, go on to explain why you're using the article in your essay."
    },
    {
      "title": "Try this if you need to justify using the source.",
      "content": "Try this if you need to justify using the source. If an article doesn't seem obviously related to your essay, let your readers know exactly how the article addresses the point you're making. You can also distinguish any part of the article that isn't relevant. For example, you might write: \"Although this essay doesn't discuss defenses against the dark arts, Gilderoy Lockhart's article provides an example of how you can't learn anything by plagiarizing the work of others.\""
    },
    {
      "title": "This is a good option if the article supports your own ideas.",
      "content": "This is a good option if the article supports your own ideas. Using a published article to support your own ideas gives what you're saying more credibility. With this option, you might also lean on the expertise of the author of the article to give you even more support. For example, you might write: \"This article demonstrates broad support for the idea that Hogwarts should continue to sort students into four houses.\""
    },
    {
      "title": "Go with signals to make a simple transition.",
      "content": "Go with signals to make a simple transition. Signal phrases let your readers know that you're no longer talking about your own ideas, but rather the ideas expressed in the article. Some signals you can use include \"argues,\" \"notes,\" \"observes,\" \"addresses,\" confirms,\" and \"contends.\" For example, you might write: \"McGonagall argues that Slytherin House should be disbanded after the Battle of Hogwarts.\""
    },
    {
      "title": "Include limitations if the source is an opposing viewpoint.",
      "content": "Include limitations if the source is an opposing viewpoint. Start by telling your readers how the author went wrong or what their analysis was missing. You can then move on to explain how your argument or position clearly refutes the conclusion the author reached. For example, you might write: \"While McGonagall makes a compelling argument that Slytherin House should be disbanded, she was biased by her experiences. In this essay, I will show that the personality traits emphasized by Slytherin are positive traits that can be used for good.\""
    }
  ]
}