{
  "url": "https://www.wikihow.com/Get-a-Divorce-in-Prison",
  "title": "How to Get a Divorce in Prison",
  "steps": [
    {
      "title": "Decide if a divorce is the right option for your situation.",
      "content": "Decide if a divorce is the right option for your situation. Before you move forward with your divorce, consider the different types of divorce to determine which one will work best for your situation. There are four types of divorce and they are called dissolution, summary dissolution, annulment, and legal separation."
    },
    {
      "title": "Consider a dissolution.",
      "content": "Consider a dissolution. Dissolution ends a marriage or domestic partnership. As part of a dissolution, all of the other aspects of the marriage will be settled: custody and financial support of children, alimony and the division of property."
    },
    {
      "title": "Consider a summary dissolution.",
      "content": "Consider a summary dissolution. Summary dissolution is a simplified form of divorce that is available in some states. Because it is faster and less complicated, a summary dissolution is preferable to a regular dissolution. To qualify for this type of divorce you have to meet specific criteria. For example, in California you may qualify for a summary dissolution if you meet all of these requirements: [1] X Research source have been married for less than five years have no children together do not own any land or buildings do not rent any land or buildings other than your home do not have more than $6,000 in debt have less than $40,000 in acquired property do not have any separate property worth more than $40,000 agree that neither spouse will receive support sign an agreement stating that all property and debts will be divided up equally."
    },
    {
      "title": "Consider an annulment.",
      "content": "Consider an annulment. Annulment is not the same as a divorce. An annulment is a court order that specifies that the original marriage never existed because one of the partners misrepresented him or herself or because it was illegal. States have specific criteria that specifies what may be grounds for an annulment. Some of the criteria include incest, fraud and deceit, marriages of minors, and marriages of incompetent individuals. Check your state's laws to determine if your marriage qualifies for an annulment. [2] X Research source"
    },
    {
      "title": "Consider a legal separation.",
      "content": "Consider a legal separation. When you file for a legal separation it terminates your marriage, but it is not a final order like a dissolution. You and your spouse will still have to complete a dissolution to finalize the end of the marriage. A legal separation is useful, because any property acquired by either party after the separation will be deemed separate property."
    },
    {
      "title": "Determine where to file your paperwork.",
      "content": "Determine where to file your paperwork. While states vary on which courts handle divorces, most states require a divorce petition to be filed either in the county where your spouse lives currently or in the county where you lived before you went to prison."
    },
    {
      "title": "Gather the required documents.",
      "content": "Gather the required documents. Visit the prison library in order to get information on the divorce forms you will need and the resources available to prisoners. The forms you will need will depend on state you live in and the type of divorce you plan to pursue. Your prison library should have the forms you need. Ask the librarian for help finding the forms. The required forms vary by county but common forms include: Petition. The petition states that you are filing for divorce from your spouse. This form may include the reasons for divorce, and it is common for the petition to list the assets that you and your spouse share. Summons. The summons is a piece of paper that your spouse will receive along with a copy of the divorce petition. The summons tells your spouse how long they have to respond to the divorce papers. Court information sheet. The court information sheet will specify which court is handling your divorce and which judge has been assigned to the case."
    },
    {
      "title": "Ask about available resources to help with your divorce.",
      "content": "Ask about available resources to help with your divorce. Ask the librarian about what types of help the prison offers to inmates seeking a divorce. You could also ask for help from a “jailhouse lawyer,” an inmate who helps inmates with legal issues. [3] X Research source Ask about law school clinics. Some law schools have clinical programs that work with inmates on legal issues."
    },
    {
      "title": "Fill out the paperwork.",
      "content": "Fill out the paperwork. Complete the divorce forms for the county where your spouse is a resident. You should be able to find the forms on your state court's website. You will need to know your spouse's full name, your spouse's current address, and the names and ages of any children you have together. The forms are usually “fill in the blank” types so it should be easy to complete them if you have all of the required information. You can also ask a trustworthy friend or a family member who is not incarcerated to fill out the forms and file them for you. Look at the forms before they are filed to make sure they are filled out exactly how you want them to be. You can also fill an affidavit for a fee waiver if you cannot afford the filing fee, which is about $300."
    },
    {
      "title": "Pay the filing fee or apply for a fee waiver.",
      "content": "Pay the filing fee or apply for a fee waiver. If you cannot afford to pay the filing fee, you can apply for a fee waiver from the court. There is a form to fill out that can be obtained from the clerk of court if you did not already receive one. The amount of the filing fee varies from state to state."
    },
    {
      "title": "File the paperwork.",
      "content": "File the paperwork. Once you have completed and checked all of your paperwork, you will be ready to file. To file the forms, you should try to get help from the prison's legal service. Bring all of the required paperwork with you and say that you want to file divorce papers. Your prison's legal service should file the papers for you. They should also give you the documents that you will need along with proof that they filed the forms. If your prison does not have a legal services program that handles divorces, ask a trustworthy friend or family member to file the papers for you with the clerk of the court where you will be getting divorced."
    },
    {
      "title": "Serve a copy of the divorce papers on your spouse.",
      "content": "Serve a copy of the divorce papers on your spouse. Your spouse must receive notice of the divorce proceedings in order for the court to proceed with the case. You can either serve the divorce papers on your spouse by certified mail or in person. [4] X Research source To serve the papers by mail, you will need to pay to have the papers sent by certified mail. If it is sent by certified mail, your spouse will have to sign for the papers. To serve the papers in person, hire a process server or have someone you trust personally hand a copy of the summons and complaint to your spouse. The person who serves the papers to your spouse must be 18 years or older. You cannot serve your spouse with the divorce papers."
    },
    {
      "title": "File a proof of service affidavit.",
      "content": "File a proof of service affidavit. After your spouse has been served with the divorce papers, you will need to file an affidavit of service. This document will need to be signed by the person who delivered the divorce papers to your spouse. If you sent the papers by certified mail, then you will need to sign the affidavit."
    },
    {
      "title": "Await your spouse's response.",
      "content": "Await your spouse's response. After filing the papers for divorce, your spouse can respond in several ways. Your spouse can decide “agree to” the divorce, meaning that the divorce is “uncontested.” This makes the rest of the divorce process much easier than the other options. In an uncontested divorce, the parties do not have to appear in court over the divorce proceedings, although they may still need to appear in court to determine any property divisions or child custody or child support issues. [5] X Research source Keep in mind that you cannot request custody of any children that you have with your spouse while you are incarcerated. You may request that the court grant you visitation rights. Your spouse may “counterclaim” for divorce, meaning that he or she does not agree with what you have claimed in your complaint. In that case, you and your spouse will need to appear in court to determine how to proceed with the divorce. Keep in mind that unless you are going to be released soon, you cannot attend divorce proceedings in court. Therefore, it is in your best interest to try to come to an agreement with your spouse outside of court. Your spouse could choose to ignore the divorce papers and do nothing. In that case, some courts will enter a judgment of divorce after a certain number of days have elapsed, since the spouse was served with the divorce papers. Other courts will not make a default judgment. The laws pertaining to this issue vary from state to state."
    },
    {
      "title": "Obtain a judgment of divorce.",
      "content": "Obtain a judgment of divorce. Once you have finished negotiating with your spouse, you will be issued a judgment of divorce from a judge. This document signifies that your marriage has been legally dissolved."
    }
  ]
}