{
  "url": "https://www.wikihow.com/Link-to-Google-Calendar",
  "title": "How to Link to Google Calendar",
  "steps": [
    {
      "title": "Go to Google Calendar.",
      "content": "Go to Google Calendar. Open a new web browser tab or window on your computer, and visit the Google Calendar page."
    },
    {
      "title": "Sign in.",
      "content": "Sign in. Under the Sign In box, type in your Gmail email address and password. This is your one Google ID for all of Google’s services. Click the “Sign in” button to proceed."
    },
    {
      "title": "Select calendar.",
      "content": "Select calendar. All your calendars on Google Calendar will be listed on the left panel. Hover over the calendar you want to share publicly, and a down arrow button will appear beside it."
    },
    {
      "title": "Open the settings.",
      "content": "Open the settings. Click the down arrow, then click “Calendar settings.” You will be brought to the Settings page of the selected calendar."
    },
    {
      "title": "Make the calendar public.",
      "content": "Make the calendar public. Click the “Share this calendar” link on the header of the settings page. You will be brought to the sharing settings for the calendar. Click the tick box for the “Make this calendar public” option to enable your calendar to be publicly accessible. Make sure there’s nothing private or confidential in your calendar when you do this."
    },
    {
      "title": "Click the “Save” button right below the header links.",
      "content": "Click the “Save” button right below the header links. All the contents of your calendar will be accessible to the world, and they can be searched via Google Search. You will be brought back to your calendar view."
    },
    {
      "title": "Select the public calendar.",
      "content": "Select the public calendar. Back in the calendar view, hover over the public calendar you want to share. A down arrow button will appear beside it."
    },
    {
      "title": "Open the Settings menu.",
      "content": "Open the Settings menu. Click the down arrow, then click “Calendar settings.” You will be brought to the Settings page of the selected calendar."
    },
    {
      "title": "Get the calendar address.",
      "content": "Get the calendar address. Your calendar can be linked and displayed differently. You can share your calendar publicly or access it privately through the links provided. Getting a public link—Locate the “Calendar Address” item on the page. There are three buttons for XML, ICAL, and HTML beside it. These are the supported formats on how your calendar can be linked and displayed publicly. Click on the appropriate button. Getting a private link—Locate the “Private Address” item on the page. There are two buttons for XML and ICAL beside it. These are the supported formats on how your calendar can be linked and displayed privately. Click the appropriate button."
    },
    {
      "title": "Get the link.",
      "content": "Get the link. A window will appear with your calendar’s private or public link or address. Copy it. If you opted for private access, you should be careful with this link. Anyone who has access to it can see all the entries in your calendar. If you opted for public sharing, you can now use this link to embed and share your calendar."
    },
    {
      "title": "Share the link through email.",
      "content": "Share the link through email. Once you have your Google calendar link, you can simply copy and paste the link on the body of your email and send it to whoever you want to share it with. If you’re using Gmail, click on compose new message. Once the new message box pops up, click on the insert link icon on the bottom toolbar, it has a chain icon. A new window will open where you can insert the text on one box, and the link on the other. For example, My Calendar in the text box and then your Google Calendar link on the next one."
    }
  ]
}