{
  "url": "https://www.wikihow.com/Make-a-Leather-Riding-Crop",
  "title": "How to Make a Leather Riding Crop",
  "steps": [
    {
      "title": "Choose a flexible core.",
      "content": "Choose a flexible core. Find a thin, flexible rod made from brass or fiberglass. Cut it down to 2½ feet (76.2 centimeters), or have the store do it for you. [1] X Research source"
    },
    {
      "title": "Cut two pieces of leather lace.",
      "content": "Cut two pieces of leather lace. Each pieces needs to be 3.5 times the length of the rod. It would be even better if you cut the lace a little bit longer than you need to. Remember, you can always cut the excess off at the end, but you can't add lace back. [2] X Research source Choose leather lace that is flat and wide, like ribbon. Don't use the round, tube type. Use thin leather lace. Do not use the thick, suede lace."
    },
    {
      "title": "Cross the two strands in front of the rod's tip.",
      "content": "Cross the two strands in front of the rod's tip. Cross both of the leather strands at the center to make an X. Place that X right at the top of the rod, just below the tip. [3] X Research source"
    },
    {
      "title": "Cross the top-right strand behind the rod.",
      "content": "Cross the top-right strand behind the rod. Take the top-right strand, and pull it across the back of the rod. Angle it downward so that it comes out between the top-left and bottom-left strands. Keep the lace flat. Don't let it twist or turn."
    },
    {
      "title": "Bring the strand across front of the rod and back to the right side.",
      "content": "Bring the strand across front of the rod and back to the right side. Pull the strand between the two strands on the left. Cross it in front of the rod, back towards the right side."
    },
    {
      "title": "Hold the right strand under the other right strand.",
      "content": "Hold the right strand under the other right strand. The strand that used to be on the top-right is now on the bottom-right. Hold the two strands so that they are parallel to each other. Pull on all four strands to tighten them."
    },
    {
      "title": "Repeat the process for the top-left strand.",
      "content": "Repeat the process for the top-left strand. Bring the top-left strand behind the rod. Pull it out between the two strands on the right. Cross it over the front of the rod, and back over to the left. Tug on the strands to tighten them. [4] X Research source"
    },
    {
      "title": "Continue weaving your way down the length of the rod.",
      "content": "Continue weaving your way down the length of the rod. After you wrap each side, remember to tug on the strands to tighten them. Stop weaving when you reach the bottom end of the rod."
    },
    {
      "title": "Secure the leather lace strands at the bottom of the rod with tape.",
      "content": "Secure the leather lace strands at the bottom of the rod with tape. Don't tape the ends directly to the rod. Instead, set the rod down on the table, and tape the strands to the table as well. You can also wrap some tape around the strands instead, just below the base of the rod."
    },
    {
      "title": "Cut a long piece of sinew or waxed thread.",
      "content": "Cut a long piece of sinew or waxed thread. About 8 to 12 inches (20.32 to 30.48 centimeters) should be enough. You will be using this to whip lash the bottom of your rod. [5] X Research source"
    },
    {
      "title": "Fold the thread in half and place it against the bottom of the rod.",
      "content": "Fold the thread in half and place it against the bottom of the rod. Fold the thread in half first, so that the ends match up. Place it against the bottom 2 to 3 inches (5.08 to 7.62 centimeters) of the rod. Make sure that the folded part of the string is pointing towards the rod, and the tails are pointing away. [6] X Research source"
    },
    {
      "title": "Wrap one of the tails around the rod, towards the fold.",
      "content": "Wrap one of the tails around the rod, towards the fold. Hold both of the tails against the base of the rod. Take one of the tails, and start wrapping it around the base of the rod, securing the thread to it. Keep wrapping until you are about ½ to 1 inch (1.27 to 2.54 centimeters) from the fold. [7] X Research source Be sure to wrap tightly."
    },
    {
      "title": "Slide the end of the thread up through the loop.",
      "content": "Slide the end of the thread up through the loop. Bring the thread under the folded part of the thread, then slide it up through the loop. Do not slide it down through the loop. [8] X Research source"
    },
    {
      "title": "Tug on the bottom tail to pull the loop under the wrapped thread.",
      "content": "Tug on the bottom tail to pull the loop under the wrapped thread. Find the remaining thread tail hanging off of the bottom of the rod. Give it a tug until the loop disappears under the wrapped thread. Keep tugging until about half of the top tail disappears under the wrapped thread as well. [9] X Research source"
    },
    {
      "title": "Tug on both threads, then snip them off.",
      "content": "Tug on both threads, then snip them off. Once you can't see the loop anymore, give both threads a sharp tug. Snip the excess off as close to the wrapping as you can. [10] X Research source"
    },
    {
      "title": "Decide how long you want the handle, then cut four strips of leather lace.",
      "content": "Decide how long you want the handle, then cut four strips of leather lace. Each strip needs to be four times the length of your handle. [11] X Research source A good way to determine ho long the handle should be is to measure the width of your palm, then add 2 inches (5.08 centimeters). Use the same type of leather lace as you did for the rod. It can be the same color or a different one."
    },
    {
      "title": "Weave the four strips into an X in front of the rod.",
      "content": "Weave the four strips into an X in front of the rod. Place two of the strips at an angle in front of the rod, going from the top left to the bottom right. Take the third strip, and weave it over and under across the first two strips. Take the fourth strip, and weave it under and over across the first two strips. [12] X Research source Adjust the strips to make an X shape. You will have two strips on each arm of the X."
    },
    {
      "title": "Bring the top-right strip behind the rod, and weave it through the strands on the left.",
      "content": "Bring the top-right strip behind the rod, and weave it through the strands on the left. Take the top-right strip, and pull it behind the rod. Weave it under and over, under and over the strands on the left, starting from the one on the top. [13] X Research source"
    },
    {
      "title": "Bring the strand across the front of the rod and back towards the right.",
      "content": "Bring the strand across the front of the rod and back towards the right. Position it right beneath the other three right strands. This is almost like weaving the covering for the rod, but you don't want to tighten the strands just yet. [14] X Research source"
    },
    {
      "title": "Repeat the process on the left.",
      "content": "Repeat the process on the left. Take the top-left strand and pull it behind the rod. Weave it under and over, under and over the strands on the right, starting from the top. Pull it across the front of the rod, and back over to the left. [15] X Research source"
    },
    {
      "title": "Tighten the strands.",
      "content": "Tighten the strands. Make sure that the strands are where you want the top of the handle to start, then pull on them to tighten them. Make sure that you are pulling the left strands to the left, and the right strands to the right. [16] X Research source"
    },
    {
      "title": "Repeat the process until you reach the bottom of the rod.",
      "content": "Repeat the process until you reach the bottom of the rod. Alternate between doing the right and left sides. After each right and left set, pull on the strands to tighten them, then continue weaving."
    },
    {
      "title": "Whip lash and trim the ends of the strands.",
      "content": "Whip lash and trim the ends of the strands. Use the same lashing technique as you did for the base of the rod. Once you have the ends lashed together, trim off all the excess leather lace strands. Coat the bottom of the rod with leather glue, if desired, for extra strength. [17] X Research source"
    },
    {
      "title": "Cut a small rectangle out of leather.",
      "content": "Cut a small rectangle out of leather. Use a ruler and a chalk or pen to draw an 8 by 2-inch (20.32 by 5.08-centimeter) rectangle. It would be the easiest to do this with a rotary cutter, but you can use a sharp pair of scissors as well. [18] X Research source Use white chalk on dark leather and pen on light leather. If your leather has a finished side and an unfinished side, make sure that you are drawing on the unfinished side."
    },
    {
      "title": "Coat the narrow edges of the rectangle with glue.",
      "content": "Coat the narrow edges of the rectangle with glue. Turn the rectangle so that the unfinished side of the leather is facing you. Coat the top and bottom edges with glue, about 1 inch (2.54 centimeters) for each. [19] X Research source A leather glue would work the best, but you can try using an industrial-strength glue instead. [20] X Research source"
    },
    {
      "title": "Let the glue get tacky, then set the rod on top.",
      "content": "Let the glue get tacky, then set the rod on top. Make sure that only the first inch (2.54 centimeters) or so of the rod is touching the leather, and that it is centered."
    },
    {
      "title": "Fold the top edge of the leather rectangle down.",
      "content": "Fold the top edge of the leather rectangle down. You rectangle will now be 4 inches (10.16 centimeters) tall. Make sure that the top and bottom edges of the rectangle are aligned. [21] X Research source"
    },
    {
      "title": "Clamp the edges shut and let them dry.",
      "content": "Clamp the edges shut and let them dry. Place a binder clip to each side of the rod sandwiched inside the leather. Leave them there until the glue dries. How long this takes depends on the type of glue you used; it will typically take a few hours. [22] X Research source Once the glue dries, you can remove the clamps."
    },
    {
      "title": "Fold and glue the bottom corners down to the middle.",
      "content": "Fold and glue the bottom corners down to the middle. Coat the bottom inch (2.54 centimeters) of the leather rectangle with more glue. Fold the left and right edges towards the middle, making sure that the bottom edges are aligned. This will cause the leather rectangle to flare and taper outward towards the top. [23] X Research source"
    },
    {
      "title": "Whip lash the leather corners down.",
      "content": "Whip lash the leather corners down. Use the same method as you did for the base of the rod and the handle."
    },
    {
      "title": "Braid three strips of leather for the strap.",
      "content": "Braid three strips of leather for the strap. How long you make this braid is up you you, but it should be long enough to loop over your palm. Leave a few inches/centimeters at the top and bottom of the braid un-braided so that you can secure it to the handle. [24] X Research source"
    },
    {
      "title": "Whip lash the strap to the top of the handle.",
      "content": "Whip lash the strap to the top of the handle. Fold the braid to make a loop, then position it over the top of the handle. The folded part of the strap should be pointing to the rod's tip, and the loose tail ends should be pointing to the base. Whip lash the strap down using the same technique as you did for the base of the rod, the base of the handle, and the leather tip. [25] X Research source"
    },
    {
      "title": "Trim off the excess ends of the leather strap.",
      "content": "Trim off the excess ends of the leather strap. Try to cut as close to the wrapped threads as you can. If you ant to, you can coat the wrapped threads with some leather glue for extra strength and durability. [26] X Research source"
    },
    {
      "title": "Cut three, small rectangles out of leather to cover the whip lashing.",
      "content": "Cut three, small rectangles out of leather to cover the whip lashing. The strips need to be long enough to wrap around the whip lashed parts at the tip, top of the handle, and base. They need to be at least 1 inch (2.54 centimeters) wide. [27] X Research source If your whip lashing is wider, then make the rectangles wider."
    },
    {
      "title": "Pierce four holes on each narrow end of the leather rectangles.",
      "content": "Pierce four holes on each narrow end of the leather rectangles. Place the first leather rectangle over a wooden board, then use an awl and a mallet to pierce four, evenly-spaced holes into both of the narrow edges. Do this step for all of the leather rectangles."
    },
    {
      "title": "Wrap the first leather rectangle around the base of the rod.",
      "content": "Wrap the first leather rectangle around the base of the rod. Cut a long piece of waxed thread of sinew, and string a leather needle onto each end. Pull each needle through the second hole on each side of the rectangle, starting from the inside. [28] X Research source"
    },
    {
      "title": "Saddle-stitch the leather rectangle shut.",
      "content": "Saddle-stitch the leather rectangle shut. Push the left needle down through the first left hole, and out the first right hole. Push the right needle down through the first right hole and out the first left hole. Repeat this step until you reach the top of the leather rectangle. [29] X Research source Pull on the thread often to tighten the stitching. Move onto the second set of holes, then the third, then the fourth."
    },
    {
      "title": "Back-stitch back down to the third or second hole, then cut the threads.",
      "content": "Back-stitch back down to the third or second hole, then cut the threads. This should be enough to hold your leather rectangle together. If you are worried about it coming undone, you can tie knots into the threads before cutting them. [30] X Research source"
    },
    {
      "title": "Repeat the process for the remaining whip lashed areas.",
      "content": "Repeat the process for the remaining whip lashed areas. This includes the tip of the crop and the top of the handle."
    }
  ]
}