{
  "url": "https://www.wikihow.com/Litter-Train-a-Rabbit",
  "title": "How to Teach a Rabbit to Use a Litter Box",
  "steps": [
    {
      "title": "Place a litter tray where your rabbit normally eliminates.",
      "content": "Place a litter tray where your rabbit normally eliminates. If your rabbit already has a particular place in your home where they like to use the bathroom, place the litter tray there, so that it’s an easy transition from eliminating on the floor to eliminating in the tray. If they don’t have a particular place, or they’re new, set the tray wherever you like—a bathroom or someplace with a hard floor is often best. [1] X Research source Make sure the tray is large enough for your rabbit to stretch and lay down in comfortably. Litter trays designed for rabbits have a raised back to prevent litter flying everywhere when they scrape, and a low front to make it easier for the rabbit to hop in."
    },
    {
      "title": "Fill the litter tray with non-clumping rabbit litter.",
      "content": "Fill the litter tray with non-clumping rabbit litter. Rabbits require hay, straw, oat or alfalfa pellets, or even pelleted food as litter. [2] X Research source Line the pan with newspaper, for easy cleaning, and fill the tray with about 1 in (2.5 cm) of litter , making sure it’s evenly distributed along the bottom of the tray. [3] X Research source Other litters, like any wood shavings or any litter that clumps, including clay or deodorant crystals and most cat litters, are unsafe, and may cause respiratory or digestive issues."
    },
    {
      "title": "Place some of your rabbit’s hay and waste inside the litter tray.",
      "content": "Place some of your rabbit’s hay and waste inside the litter tray. Collect up some of the rabbit's pellets, or any soiled litter or bedding you may already have, and drop them into the tray. This shows them that this is where they should eliminate, and they’ll naturally gravitate toward the tray. [4] X Research source Also place some hay , in a hay rack or small box, in and near the tray itself to attract the rabbit to the tray, and give them something to munch on as they eliminate."
    },
    {
      "title": "Surround the litter tray with a large pen or enclosure.",
      "content": "Surround the litter tray with a large pen or enclosure. Ensure the pen is spacious enough for your rabbit to comfortably live in for a few days—at least 3-6 times the length of the rabbit. Enclosing your rabbit with a litter pen encourages them to use the tray, rather than going elsewhere in the house. [5] X Research source In the pen, arrange your rabbit’s bedding, shelter, food, water, and any other toys away from the litter tray to make your rabbit more comfortable."
    },
    {
      "title": "Confine your rabbit to the litter enclosure for 3-4 days.",
      "content": "Confine your rabbit to the litter enclosure for 3-4 days. Rabbits naturally want to keep their home clean, so when they’re confined to a smaller space, they’ll usually begin to eliminate in one specific area within that space—the litter tray. Place your rabbit in the large enclosure you’ve prepared, and keep them there for a few days, until they’re consistently using the litter tray. [6] X Research source Note that it may take up to a few weeks for some rabbits to learn to use a tray—stay patient, and keep your rabbit in the pen until they do. It’s fine to let your rabbit explore outside the pen now and then, but don't let them wander unsupervised if they're not litter-trained."
    },
    {
      "title": "Reward your rabbit for using the tray, and correct unwanted behavior.",
      "content": "Reward your rabbit for using the tray, and correct unwanted behavior. Pet your rabbit and offer a little treat, such as a bite of apple or carrot, immediately after they use the litter tray to reinforce a positive connection between toileting and the box. If you see their tail raise—a sign they’re about to eliminate—gently pick them up and place them in the tray. If they do eliminate outside the tray, move the urine or droppings to the tray and disinfect the spot. [7] X Research source Never scold or punish your rabbit—they don’t understand, and it may only distract them from using the tray."
    },
    {
      "title": "Expand your rabbit’s enclosure once they get the hang of the litter.",
      "content": "Expand your rabbit’s enclosure once they get the hang of the litter. Once your rabbit is reliably using the litter box, take down the pen and let them roam freely about the room. Supervise them and ensure they still use their litter with their added freedom. After a few days of good habits, you may let your rabbit roam freely around the house again."
    },
    {
      "title": "Place 1-2 additional litter trays in other areas of the house.",
      "content": "Place 1-2 additional litter trays in other areas of the house. For proper rabbit care, It’s best to have 2-3 trays placed throughout your home, even for a single rabbit. Multiple rabbits require at least 1 tray for each rabbit. Once your rabbit has learned to use the first tray, put out other trays in areas your rabbit spends time or exercises in. The more litter trays you have, the more likely it is that the rabbit will use one of them. You may need to introduce extra litter boxes the same way you did the first—by confining your rabbit to a small area around the new box, until they use it. Or, if your rabbit only uses 1 or 2 litter boxes and ignores the others, the extras may be removed."
    },
    {
      "title": "Consider spaying or neutering your rabbit.",
      "content": "Consider spaying or neutering your rabbit. Un-neutered adult rabbits are more territorial and use their scent to claim space. This involves depositing urine and pellets around the house, using scent as a territory marker. Getting your rabbit neutered will make it much easier to litter train them, their need to be territorial is vastly reduced. [8] X Research source Unspayed or unneutered rabbits may never learn to use a litter tray consistently."
    },
    {
      "title": "Spot clean the tray once a day.",
      "content": "Spot clean the tray once a day. Once a day, scoop out litter soiled with urine, and discard it in the trash, but don’t remove all the pellets or urine—leave a small amount still in the tray to act as scent markers for the rabbit to go back to. [9] X Research source Also place a handful or 2 of fresh hay into the litter box once a day. Keep an eye out for large, moist-looking pellets, which are made up of half-digested food. Leave them in the tray for the rabbit to re-eat and get vital nutrients. [10] X Research source Without these pellets, your rabbit could suffer from gastric disturbances and diarrhea, and in the long term, dietary deficiencies."
    },
    {
      "title": "Completely clean the litter box once a week.",
      "content": "Completely clean the litter box once a week. Simply dump the entire contents of the tray into a plastic bag, tie it off, and throw it in the trash. Clean the tray with a disinfectant or dish soap, rinse it well, and dry it with a clean cloth. Then remake the tray with newspaper and litter. If the litter tray gets too dirty, your rabbit might do their business elsewhere. [11] X Research source Or, gather your rabbit’s droppings and add them to the soil in your garden—they make excellent fertilizer!"
    },
    {
      "title": "Use an enzymatic cleaner to wash away any accidents.",
      "content": "Use an enzymatic cleaner to wash away any accidents. Rabbits like to eliminate where they can smell past urine or droppings, so if your rabbit goes anywhere other than the litter box, use a specially formulated pet urine cleaner, like an enzymatic cleaner or biological washing powder , to clean it up and prevent further accidents. [12] X Research source Let the cleaner sit and soak into the area for 10-15 minutes before soaking it up or wiping it away with paper towels. Do not use cleaning products that contain bleach. It contains ammonia, a component of urine, and can actually strengthen the smell of urine."
    },
    {
      "title": "Move the litter tray to your rabbit’s preferred potty spot.",
      "content": "Move the litter tray to your rabbit’s preferred potty spot. Some rabbits are stubborn and will continue to eliminate where they please, often in a particular corner. If this happens, move the tray to this spot. If they continue to avoid it, they may take issue with the tray itself—it may be too small, or your rabbit may dislike the litter type. [13] X Research source After your rabbit has learned to use it, you may nudge the tray an inch or so each day toward where you’d prefer it to be. Note that some rabbits may learn to urinate in a tray, but may never learn to defecate in one."
    },
    {
      "title": "Try a few different litter types if your rabbit refuses the tray.",
      "content": "Try a few different litter types if your rabbit refuses the tray. Rabbits can be finicky, and may not always click with the first litter you try. If you’re stuck, swap out the old litter with a new type after 4-5 days, and keep trying until you find a litter your rabbit accepts. [14] X Research source You may even try a combination of different litters, or different amounts of litter in the tray."
    },
    {
      "title": "Switch to a high-sided tray if your rabbit kicks litter.",
      "content": "Switch to a high-sided tray if your rabbit kicks litter. Some rabbits like to scatter their litter with their hind legs, causing quite the mess. If this is the case, pick up a tray with higher sides, or even use tape to add cardboard walls to the perimeter of the tray. Just ensure the entrance is low enough for them to use! [15] X Research source"
    },
    {
      "title": "Take your rabbit to the vet if they continue to refuse the tray.",
      "content": "Take your rabbit to the vet if they continue to refuse the tray. There are a number of health reasons your rabbit may not want to use a litter tray. They may be overly stressed due to something in your home, have a weight problem, urinary tract infection, or any number of other conditions. If all else fails, visit the vet for an exam to see if your rabbit is sick , or if there’s something else preventing your rabbit from using their litter. [16] X Research source"
    }
  ]
}