{
  "url": "https://www.wikihow.com/Grow-a-Peony-in-a-Pot",
  "title": "How to Grow a Peony in a Pot",
  "steps": [
    {
      "title": "Pick out a peony that will fit in a pot.",
      "content": "Pick out a peony that will fit in a pot. Peonies (Paeonia spp. and hybrids) are commonly grown outdoors, but they can also be grown in a pot. Select a variety that naturally stays smaller. Some peonies like “Zhao Fen” (Paeonia suffruticosa “Zhao Fen” or “Zhao’s Pink”) can grow to a height of 3 to 6 feet (0.9 to 1.8 m) and width of 2 to 4 feet (0.6 to 1.2 m). Two smaller, more suitable options are “Zhu Sha Pan” (Paeonia “Zhu Sha Pan” or “Cinnabar Red”), which grows to a height and width of 2 to 2 ½ feet, and fern leaf peony (Paeonia tenuifolia), which grows to only 1 to 2 feet (0.3 to 0.6 m) tall and 9 to 16 inches (22.9 to 40.6 cm) wide."
    },
    {
      "title": "Choose the right pot for your peony.",
      "content": "Choose the right pot for your peony. Pot up the peony in early spring. Put it in a container that is at least 1 foot (0.3 m) in diameter and 1 ½ to 2 feet (0.6 m) deep to give the peony plenty of room to grow. Larger varieties will require an even larger pot. The container must also have several drain holes in the bottom. Gardeners should also note that these plants respond badly to being transplanted and should start out their lives in large containers. Therefore, a 5 gallon (18.9 L) size pot is ideal for peonies."
    },
    {
      "title": "Fill the container so it is about half full with a peat-based potting mix.",
      "content": "Fill the container so it is about half full with a peat-based potting mix. Set the tuber on top of the potting mix to check the depth. There should be no more than 1 to 2 inches (2.5 to 5.1 cm) of soil over the top of the tuber. When the potting mix is at the right depth, mix water into it until it is thoroughly moistened."
    },
    {
      "title": "Add some compost to the soil.",
      "content": "Add some compost to the soil. Before planting the peony bulbs, it’s a good idea to sprinkle some compost into the soil for additional nutrients. In the spring, adding some slow-release low nitrogen fertilizer to the peonies is also recommended. This will help keep them healthy and encourage blooms but will not burn the plants as other types of fertilizer might."
    },
    {
      "title": "Set the peony tuber on top of the moist mix with the “eyes” or growth buds facing up.",
      "content": "Set the peony tuber on top of the moist mix with the “eyes” or growth buds facing up. Finish filling the container with potting mix and water it until the water drains from the bottom. Peony bulbs should only be covered with 1 to 2 inches (2.5 to 5.1 cm) of potting soil. Gardeners should err on the side of caution in such cases because peonies that are buried too deep will not bloom. Specimens that are producing lush foliage but no flowers may have to be dug up and reburied to appropriate depths before they begin to produce blossoms."
    },
    {
      "title": "Give your peony the light it loves.",
      "content": "Give your peony the light it loves. Set the container outdoors in a protected location where the peony will be exposed to at least six to eight hours of direct sunlight. Peonies require lots of light to grow and bloom. If the peony is to be grown indoors, put it in front of a south- or west-facing window where it will get plenty of direct sunlight."
    },
    {
      "title": "Use a grow light in addition to natural light.",
      "content": "Use a grow light in addition to natural light. A grow light will be necessary to supplement the natural light. Use a four-bulb fluorescent light fixture with two special full-spectrum 40-watt fluorescent bulbs and two 40-watt cool white bulbs. Set up the fixture so that the bulbs are about 6 inches (15.2 cm) above the peony and leave it on for 12 to 14 hours each day. The light should be plugged into a timer that turns it on in the morning around sunrise and turns it off at the end of the day."
    },
    {
      "title": "Water your peony.",
      "content": "Water your peony. Water the peony when the top inch of potting mix becomes dry. Pour the water evenly over the potting mix until the water drains freely from the bottom of the pot."
    },
    {
      "title": "Feed your peony with a houseplant fertilizer.",
      "content": "Feed your peony with a houseplant fertilizer. When the new peony stems appear, begin giving it houseplant fertilizer every four weeks. It is important to use houseplant fertilizer as opposed to fertilizer for garden-grown peonies since it is being grown in a container. A water-soluble fertilizer is best. Always give it the fertilizer after a regular watering. Stop giving fertilizing around mid-summer."
    },
    {
      "title": "Prepare your plant for its resting period.",
      "content": "Prepare your plant for its resting period. In late summer, water the peony less often. Let the soil dry completely before watering it again to encourage the peony to go dormant for the winter. Peonies must have a two- to three-month rest period. If the peony is being grown indoors, slowly reduce the number of hours of supplemental light it receives to coincide with the shorter days of autumn. If the peony is outdoors, leave it out until after a few hard frosts."
    },
    {
      "title": "Prune the stems and move the plant to a cool, dark locations.",
      "content": "Prune the stems and move the plant to a cool, dark locations. When the leaves begin to turn yellow and die, use hand pruners to snip the stems off all the way down to the soil. Set the pot in an unheated garage or cool area in the basement. Bring it back out in the spring when the weather warms. Put it outdoors in a sunny spot or in front of the window and water it generously."
    }
  ]
}