{
  "url": "https://www.wikihow.com/Get-over-Being-Cheated-on-and-Left",
  "title": "How to Get over Being Cheated on and Left",
  "steps": [
    {
      "title": "Accept that you're not to blame.",
      "content": "Accept that you're not to blame. It's not your fault that your ex cheated. When you look back on the relationship, there might be things you wish you had done differently. Your ex might even blame you for their infidelity. But no matter what happened, it's not your fault. [1] X Expert Source Kelli Miller, LCSW, MSW Relationship Coach Expert Interview. 11 June 2020. Your ex made the choice to turn to another person while the two of you were still together, and that was wrong. [2] X Research source Also, your partner didn't cheat on you because of how you looked or because of anything you did or didn't do. They cheated because of something inside themselves."
    },
    {
      "title": "Take some time to grieve.",
      "content": "Take some time to grieve. Tell yourself that anything you feel is okay. Being betrayed is really painful, and it's perfectly understandable if you need some time to just feel upset. In fact, it's healthy to let yourself sit with your emotions, so don't try to push them down or ignore them. If you feel sad, have a good cry. If you need someone to talk to, call up a friend. There's no right or wrong way to feel right now, so just let yourself process your emotions as they come up. [3] X Expert Source Kelli Miller, LCSW, MSW Relationship Coach Expert Interview. 11 June 2020. It's okay if your emotions change quickly. For instance, you might feel overwhelmed with sadness, then shortly afterward you may feel a sense of relief that it's over—especially if you suspected that your partner was cheating for a long time. You might also feel guilty for struggling to get past the pain of being cheated on, especially if it starts impacting different areas of your life, like your job. [4] X Research source"
    },
    {
      "title": "Write about how you're feeling.",
      "content": "Write about how you're feeling. Use a journal as a private way to express your thoughts. Getting cheated on can bring up a whole slew of painful emotions, and it might even bring back past hurts in your life. Writing is a great way to help you start sorting through these thoughts and feelings—and that can make it easier to start healing. Plus, you never have to show your journal to anyone else, so you can be completely honest without any fear of being judged. [5] X Research source You can also express yourself in other ways—if you're musical, you might write a song , for instance, or you might paint something if you're more artistic. [6] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Be kind to yourself.",
      "content": "Be kind to yourself. Treat yourself like you would treat a friend. When your partner leaves you for someone else, you might look internally for reasons why they didn't want to be with you. Unfortunately, that can turn into a cycle of negative thinking where you start to see yourself in the worst possible light, and that can be hard to break out of. It's not impossible, though, so learn to pay attention to what you're thinking about yourself. If you start thinking critical thoughts, say to yourself, \"What would I say to a friend who's going through this right now?\" [7] X Research source For instance, if you think, \"They left because I'm not good enough,\" challenge that. Instead, think, \"I'm going to find someone who loves me for exactly who I am.\" Sit down and write out a list of some of your best qualities. Add to the list over time as you think of new things. Then, when you're having a hard time, read back over the list to remind yourself of how great you are!"
    },
    {
      "title": "Avoid thinking of the relationship as all good or all bad.",
      "content": "Avoid thinking of the relationship as all good or all bad. Things aren't usually that black and white. A breakup can change the way you see your relationship, especially if you realize your ex lied and cheated. You might idealize what you thought you had, thinking everything was perfect until the moment you found out your partner was unfaithful to you. Or, you might find it difficult to remember anything good about the relationship. Try to think of the relationship in neutral terms—let the good memories be good, and learn what you can from the bad times. [8] X Research source There might always be a little bit of a negative tint on your happy memories with your ex, but keep in mind that it was still an important time in your life, and you deserve to remember the good times with some fondness. Similarly, try not to paint yourself as the victim and your ex as the villain. They're still just a person, even though they wronged you."
    },
    {
      "title": "Stay busy to stop repetitive thoughts.",
      "content": "Stay busy to stop repetitive thoughts. Find a way to distract yourself when you're ruminating. If you catch yourself replaying your last fight with your ex or you can't stop picturing them with their new partner, do whatever you can to break that cycle. Busy yourself in a tough puzzle , challenge yourself with a new recipe, put on some loud upbeat music, call a friend—anything that will occupy your mind for a bit. [9] X Research source Overthinking won't change what happened, but it can make it harder to move on."
    },
    {
      "title": "Do something healthy for yourself each day.",
      "content": "Do something healthy for yourself each day. Make self-care your top priority. After a painful breakup, even getting out of bed can seem impossible. If you need a day or two to just feel sad, take it. But after that, make a real effort to start taking care of yourself again. Even small things like taking a shower and getting out of the house can help you start to feel better. [10] X Research source Even if you don't feel hungry, eat regular, nutritious meals to fuel your body and stay healthy. Drink plenty of water to stay hydrated . Physical activity is a great way to release stress and negative emotions. Even if you don't feel like hitting the gym, try going for a walk, dancing to your favorite song, or tossing a ball around with a friend. Try to stick to a regular schedule at night to make it easier to get the sleep you need. Do something you enjoy that helps you feel relaxed, like taking a long bath, burning a scented candle, reading a book, having coffee with a friend, or listening to your favorite album."
    },
    {
      "title": "Get support when you need it.",
      "content": "Get support when you need it. Talk to your friends, a support group, or a therapist . You don't have to go through this alone. If you have supportive family and friends, reach out to them when you need someone to talk to. It can also be really helpful to join a support group for people who have been cheated on. If you'd like to meet in person, check whether there are any local groups near you. Otherwise, try joining an online forum or group where you can chat with people who've experienced this too. [11] X Research source A therapist can be really helpful for helping you sort through your thoughts and feelings about what happened. They might also be able to help you identify and change patterns in your relationships so you can date again successfully in the future. [12] X Expert Source Kelli Miller, LCSW, MSW Relationship Coach Expert Interview. 11 June 2020. Reader Poll: We asked 566 wikiHow readers who've gone through a difficult breakup, and only 7% of them agreed that the best way to cope is by seeking professional help. [Take Poll] So while you should always see a therapist or counselor if you need it, it may be enough to vent to and rely on trusted friends and family members."
    },
    {
      "title": "Be grateful for the closure.",
      "content": "Be grateful for the closure. The other person can actually make it easier to close the chapter. Sometimes when a relationship ends, it's hard to let go of the idea you'll get back together. When your partner chooses to start a new life with someone else, though, it can be a little easier to accept that it's really the end. As hard as it is, try to see the silver lining in this, and just focus on the work you need to do to heal and move on . [13] X Research source"
    },
    {
      "title": "Embrace your own strength.",
      "content": "Embrace your own strength. This is hard, but you can overcome it. In the world of romance, there's not much that feels worse than being left for someone else. It might not seem like there's much of an upside to that, but going through something like this can make you pretty strong. Lean on yourself and determine that you can and will get through this. You might just be surprised what you learn about your own resilience! [14] X Expert Source Kelli Miller, LCSW, MSW Relationship Coach Expert Interview. 11 June 2020. That doesn't mean that you have to feel strong all the time. It's okay if you struggle with feeling sad and hurt while you go through the process of healing. In fact, overcoming that is what will make you stronger."
    },
    {
      "title": "Find lessons in the failed relationship.",
      "content": "Find lessons in the failed relationship. Don't blame yourself but do see if there's anything to learn. Once you have a little time and distance after the breakup, reflect back on your relationship. Is there anything you would do differently if you could go back and try again? Try not to dwell on the past, though, and be compassionate with yourself as you do this. Just try to think mainly in terms of how you can improve on any mistakes you made so your next relationship will be stronger. [15] X Research source For instance, if you and your ex bickered a lot, you might find that you could have been more easygoing. That's not an excuse for them cheating on you, but you might approach your next relationship with that in mind."
    },
    {
      "title": "Let yourself trust others again.",
      "content": "Let yourself trust others again. Look for the people in your life who have been consistent. Just because your ex betrayed you, it doesn't mean everyone will. In fact, you probably have people who have been there for you all along, like old friends, family members, or even coworkers you've gotten close to. Remind yourself of this so you can start opening up again. [16] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source It's okay if you're not ready to date again right away. When you do decide to open yourself up to another partner, try not to hold them responsible for how your ex hurt you, but do keep your eyes open for red flags that indicate they might not be reliable."
    },
    {
      "title": "Don't stalk your ex on social media.",
      "content": "Don't stalk your ex on social media. Avoid poring over photos of the new relationship. It can be tempting to follow your ex-partner's every move online. But when you're scouring pics and status updates for any clue about why they chose that person, you're really only hurting yourself. Get as much distance as you can—unfriend and unfollow your ex. If you need to, temporarily unfollow mutual friends so you don't accidentally come across a picture of the new couple when you least expect it. [17] X Research source It's best to cut off all contact with your ex, if you can. If you have kids together, limit your conversations strictly so you're only talking about parenting-related things. It might even be a good idea to take a break from all of social media for a while. Just focus on yourself, and reach out to people over the phone or in person."
    },
    {
      "title": "Don't retaliate in anger.",
      "content": "Don't retaliate in anger. Try to keep your cool. It might be tempting to confront your ex, send their partner a nasty email, or spread rumors about the two of them. In the end, though, that's just going to make you look petty and spiteful, and it's not going to make you feel any better in the long run. Just do your best to be the bigger person and focus on your own healing. [18] X Research source Make a rule with yourself that you have to wait 24 hours before taking any action that involves your ex or their new partner. For instance, if you're thinking of sending a text, draft it, then go back to it the next day to see if you still think it's a good idea."
    }
  ]
}