{
  "url": "https://www.wikihow.com/Have-Firmer-Stool",
  "title": "How to Have Firmer Stool: Diet, Lifestyle and Medical Options",
  "steps": [
    {
      "title": "Try going on a BRAT diet.",
      "content": "Try going on a BRAT diet. If you have diarrhea or loose stool, try having foods that help solidify your stools, such as bananas, rice, apples, and toast (BRAT). You can also try to incorporate other foods like oatmeal and potatoes to add more bulk to your stool. Do what you can to avoid foods that are spicy, high in fat, or contain artificial sweeteners since they can make your symptoms worse. [1] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source"
    },
    {
      "title": "Limit your fiber intake to 13 grams per day.",
      "content": "Limit your fiber intake to 13 grams per day. Your body will tolerate a low-fiber diet better if you have diarrhea since it won’t stimulate your bowels. Since too much fiber can cause loose stools, you may want to reduce your intake down to 13 g a day to help manage your symptoms. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Talk to your doctor and ask them for recommendations. Getting more fiber is a treatment for chronic diarrhea or soft stools. If you’re having acute diarrhea, like from a stomach bug, then cutting out some fiber until the diarrhea stops is a better option. It’s possible to have too much fiber. Eating more than about 38 g per day could cause gas, bloating, and cramps. Keep track of your fiber intake so you don’t have too much."
    },
    {
      "title": "Have smaller meals so your digestive system doesn’t get overwhelmed.",
      "content": "Have smaller meals so your digestive system doesn’t get overwhelmed. You might not think the size of your meals has anything to do with loose stools, but large meals can actually trigger diarrhea. [3] X Research source Rather than 3 large meals, try having more small meals throughout the day. This way, your body can digest more effectively."
    },
    {
      "title": "Eat low-fat foods that are easy to digest.",
      "content": "Eat low-fat foods that are easy to digest. Fat is harder to digest, so a high-fat diet could cause loose stools. It’s best to switch to low-fat foods like white meat poultry and lean meat, low-fat dairy, fish, and whole grains. This way, your meals will be easier to digest and you can avoid more diarrhea in the future. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Fried, greasy, and oily foods are high in fat too, so avoid these items. Also watch out for creamy sauces and condiments. These can add a lot of fat to your meal without you realizing it."
    },
    {
      "title": "Cut added sugars and artificial sweeteners out of your diet.",
      "content": "Cut added sugars and artificial sweeteners out of your diet. Sugars can aggravate your colon and cause loose bowel movements. If you often have a lot of sugary foods, desserts, or drinks like soda, then cut these out of your diet to get firmer stools. [5] X Research source Get into the habit of checking nutrition labels to see how much sugar is in the food you eat. You might be surprised about how much sugar you’re actually eating every day. If you’re having a bad bout of diarrhea, then a bit of sugar might actually be helpful. Sugar can help you absorb salt and prevent dehydration. Just cut back once your diarrhea clears up. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Eat more binding foods if you’re having a bout of diarrhea.",
      "content": "Eat more binding foods if you’re having a bout of diarrhea. If you’re having multiple loose bowel movements per day, then you probably have a moderate case of diarrhea. [7] X Research source In this case, switch over to some binding foods to tighten your bowel movements and prevent more diarrhea. Good choices include rice, potatoes, bananas, apples without the skin, toast, noodles, and eggs. See if having more of these foods helps. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Avoid foods that act as natural laxatives.",
      "content": "Avoid foods that act as natural laxatives. Some foods stimulate bowel movements, which could cause loose stools. If you regularly eat any of the following foods, then cut back to avoid overstimulating your digestive system. Prunes and prune juice, beans, figs, bran, licorice, and berries are all known as natural laxatives. Spicy foods can also trigger loose stools. Try to reduce the amount of spice you use in your cooking. [9] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source You might not have to avoid these foods forever. Once your stool gets firmer, try slowly reintroducing these foods to see what you can tolerate."
    },
    {
      "title": "Drink 8-10 cups of liquid each day.",
      "content": "Drink 8-10 cups of liquid each day. This is important for having normal bowel movements, but also for avoiding dehydration during a bout of diarrhea. Keep yourself hydrated with 8-10 cups of liquid each day to see if this helps make your stools more regular. [10] X Research source Water is a great choice, but you can also have soup or broth, weakly brewed tea, electrolyte replacement drinks, and fruit juices (except prune). If you’ve had a bad bout of diarrhea, then an electrolyte replacement drink like Pedialyte is a good choice as well. This can help you avoid dehydration. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Reduce or cut the amount of caffeine you drink.",
      "content": "Reduce or cut the amount of caffeine you drink. Caffeine is a stimulant and diuretic that can trigger soft stools and worsen dehydration. If you regularly drink a lot of caffeine, then cutting back might help. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Remember that other drinks besides coffee have caffeine in them. Tea, soda, and energy drinks could have high doses too."
    },
    {
      "title": "Stop using medications that can cause diarrhea as a side effect.",
      "content": "Stop using medications that can cause diarrhea as a side effect. Certain medications like antibiotics and some antacids can trigger diarrhea or loose stools. Review any medications you take to see if diarrhea is a side effect. Stop taking the ones that can cause diarrhea if your doctor approves. [13] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you’ve taken a lot of laxatives in this past, it could trigger prolonged diarrhea. Stop using laxatives and speak to your doctor about this. Never stop taking medications without asking your doctor first, especially if they’re prescribed."
    },
    {
      "title": "Try taking probiotics if you often have diarrhea.",
      "content": "Try taking probiotics if you often have diarrhea. This isn’t a proven remedy, but some people find it helpful. Probiotics can balance your gut bacteria and might prevent loose stools in the future. Try taking a daily probiotic supplement to see if this works for you. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Lactobacillus and Bifidobacterium are the two most common probiotics that come in supplements. Try getting one of these varieties. [15] X Research source You can also get more probiotics from your regular diet. Try eating more fermented foods like sauerkraut, kombucha, miso, tempeh, kimchi, pickles, and yogurt."
    },
    {
      "title": "Cut out alcohol so you don’t get dehydrated.",
      "content": "Cut out alcohol so you don’t get dehydrated. Alcohol is a bad choice if you’re having loose stools or diarrhea. It can irritate your bowel and also cause dehydration during a bout of diarrhea. It’s best to avoid drinking until your loose stools pass. [16] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you regularly have diarrhea after drinking, then you might want to quit altogether. Some people are more sensitive to alcohol than others."
    },
    {
      "title": "Cut your fiber intake for serious diarrhea.",
      "content": "Cut your fiber intake for serious diarrhea. While fiber can help with occasional soft stool, it's actually bad if you're having a serious case of diarrhea. Try cutting back on fiber and having 13 g per day instead of the recommended 25-35 g. This can help slow your bowel movements and might improve your diarrhea. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Continue avoiding foods that work as natural laxatives like prunes and prune juice, beans, figs, bran, licorice, and berries. Go back to a normal daily serving of fiber as soon as your diarrhea clears up. Otherwise, you could end up constipated."
    },
    {
      "title": "Drink electrolyte replacement formulas to replace lost nutrients.",
      "content": "Drink electrolyte replacement formulas to replace lost nutrients. If you have serious diarrhea, then you're at high risk for dehydration. Replace lost salt and electrolytes with an electrolyte replacement drink like Pedialyte. This can help you avoid dehydration during a bout of diarrhea. [18] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Also drink regular liquids like water and juice. You can also eat soup, chicken broth, or bone broth for extra fluids. Avoid very sugary drinks like soda. This can make diarrhea worse."
    },
    {
      "title": "Ask your doctor about taking antidiarrheal medicine if you have serious diarrhea.",
      "content": "Ask your doctor about taking antidiarrheal medicine if you have serious diarrhea. If you have diarrhea that’s caused by a stomach bug, you may want to clear it out of your system rather than using antidiarrheals. However, sometimes medication is an option if no other steps help treat your loose stools. These are over-the-counter medications, so you can get them at any pharmacy without a prescription. Popular ones are Pepto Bismol and Imodium. These come in liquid and tablet form, so take the type that you prefer. [19] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Always check with your doctor before taking antidiarrheal medications. If you have a virus or parasitic infection, then the diarrhea is actually helping flush it out of your body. Your doctor might want to let the infection run its course instead of trapping it inside you with anti-diarrheal medications."
    },
    {
      "title": "See your doctor if the loose stools last more than a few days.",
      "content": "See your doctor if the loose stools last more than a few days. Everyone experiences diarrhea from time to time, and it’s usually not a problem. However, if it continues for more than a few days, then you might have an infection or other health condition that’s causing it. In this case, schedule an appointment and see your doctor to get to the bottom of it. [20] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source You should also see your doctor right away if you have a fever, bloody stool, or dehydration. These could be serious issues that need medical attention."
    }
  ]
}