{
  "url": "https://www.wikihow.com/Make-a-Poodle-Skirt-Without-a-Pattern-and-With-Minimal-Sewing",
  "title": "How to Make a Poodle Skirt Without a Pattern and With Minimal Sewing",
  "steps": [
    {
      "title": "Measure around your waist and add two inches (5.08 centimeters).",
      "content": "Measure around your waist and add two inches (5.08 centimeters). Making a circle skirt requires a bit of basic geometry, but it is easier than it might seem. First, you will need to measure your waist to get your skirt's waist size. Use a tape measure and then write down the measurement. Then, add two inches or 5.08 centimeters to this measurement. For example, if the waist measurement is 30 inches, the skirt's waist will need to be 32 inches. [1] X Research source You are making the skirt's waist a little bit larger because you will need to bunch up the material."
    },
    {
      "title": "Divide your skirt's waist size by 6.28 to get your first radius.",
      "content": "Divide your skirt's waist size by 6.28 to get your first radius. Write this number down. You will need this number to help you cut out the right size waist for your skirt. For example, if your skirt's waist is 21 inches, then your first radius will be about 3.34 inches."
    },
    {
      "title": "Fold your felt in half and find the midpoint of the fold.",
      "content": "Fold your felt in half and find the midpoint of the fold. Use your marker or some tailor's chalk to make a mark on this point. You will be using this point to create half circles that will help you to mark and cut out the waist of your skirt. If your felt is black, or a dark color, try using a light-colored fabric pen or a piece of chalk."
    },
    {
      "title": "Create your compass.",
      "content": "Create your compass. You will need to create a compass using a piece of string, a pen, and a pin. This will ensure that you cut out the waist in the correct measurement. Take a long piece of string and tie it around a pen. Then, measure the end of the string extending from the pen. It will need to be the same length as your radius. For example, if your radius is 3.34 inches, then measure the string to this length. Tie a knot, do not cut as cutting the string will leave a frayed edge that the pin will instantly slip out of. This way you can use ONE string with three knots: one knot to pin the string to the fold of the fabric, a second knot for the waistline circle, and third knot for the hemline circle. Waist and hemline knots must be at correct distance from center-top pin. Then, pin the end of the string to the mark you made in the felt. You will be using the pen and string like a compass to draw your circles. You might need to anchor the pin to the table with tape to keep it from dragging the fabric around as you draw the half-circles."
    },
    {
      "title": "Pull the string taut and use the pen to draw a half circle.",
      "content": "Pull the string taut and use the pen to draw a half circle. Leave the fabric folded in half and pick up the pen. Make sure that the string stays pinned to the fabric. Start on one side of the fold and swing the pen around to the other side. You will end up with a half circle extending from one side of the fold to the other side."
    },
    {
      "title": "Measure down from your waist to two inches (5.08 cm) below your knee.",
      "content": "Measure down from your waist to two inches (5.08 cm) below your knee. Next, you will need to find the length of your skirt. Add this number to your radius. This new number will be your new radius. For example, if your skirt is going to be 24 inches long, and your first radius was 3.34 inches, then your new radius will be 27.34 inches. [2] X Research source"
    },
    {
      "title": "Adjust your compass.",
      "content": "Adjust your compass. Take the old string off of your pen and discard it. You won't need it anymore. Then, take a new piece of string and tie it to the pen. Measure the new string extending from the end of the pen. It should be the same length as your new radius. For example, if your new radius size was 27.34 inches, then you should have 27.34 inches of string extending from the end of your pen. Then, pin the end of the string to the middle of the fold again and draw a second half circle above the first one. You should end up with something that looks like a rainbow, or half a doughnut."
    },
    {
      "title": "Cut the large circle out first, then the small one.",
      "content": "Cut the large circle out first, then the small one. Do not use pinking shears; the felt fabric will not fray so they are not necessary. Cut through both layers of felt at the same time. This will help to ensure that your skirt is even. Also, try to cut just inside the lines you drew. This way, the pen marks won't show."
    },
    {
      "title": "Create or purchase a poodle appliqué.",
      "content": "Create or purchase a poodle appliqué. You can purchase a ready-made, iron-on poodle appliqué in a craft store or cut one out of some black, white, or grey felt. There are many free patterns for the poodle cutout that are available online. Try searching for “poodle outline,” or “cat outline,” or “giraffe outline” or whatever type of animal you want on your poodle skirt. If you are confident in your artistic abilities, then you can also try drawing the outline of a poodle free-hand."
    },
    {
      "title": "Iron or glue on a poodle appliqué.",
      "content": "Iron or glue on a poodle appliqué. You can either iron the poodle appliqué on, use some fabric glue to attach it, or use a hot glue gun with a small point. The attachment will be instant with the hot glue for both the poodle and the leash, and will hold better than fabric glue. If you use fabric glue, then you will need to let the glue dry overnight. Try placing a heavy book over the poodle to help it bond with the felt as the glue dries. To iron on the poodle applique: Place the poodle onto the skirt, close to the hem, and cover it with a piece of fabric (preferably cotton). Set your iron to the hottest setting (no steam) and press down on the patch for 35 to 45 seconds. Turn the skirt inside out and place the piece of fabric on the back, right where the patch is. Press down on it again with the iron for another 35 to 45 seconds. Take the piece of fabric off and switch off your iron. Let the patch cool down before adding the leash. [3] X Research source"
    },
    {
      "title": "Add the leash.",
      "content": "Add the leash. Apply a line of fabric glue going from the top of the poodle's neck up to the waistband of the skirt. Add a few loops to the line. Next, press down some thin ribbon, rickrack, or sequin trim onto the glue. Let the glue dry before moving on to the next step."
    },
    {
      "title": "Measure your waist and add one inch (2.54 centimeters).",
      "content": "Measure your waist and add one inch (2.54 centimeters). Use a fabric measuring tape to measure your waist. Then add one inch to this measurement. The total will be the length of your elastic. For example, if your waist measurement is 28, then you will need to have 29 inches of elastic."
    },
    {
      "title": "Cut the elastic according to your measurement.",
      "content": "Cut the elastic according to your measurement. If you are making the dress for a child, try to use a two-inch (5.08) wide elastic. If you are making the dress for an adult, try to use a three-inch (7.62) wide elastic. Black is the most popular color, but a white elastic might look cute against a black skirt."
    },
    {
      "title": "Sew the narrow ends of the elastic together.",
      "content": "Sew the narrow ends of the elastic together. Use a ½ inch (1.27 centimeter) seam, and knot the ends of the thread. Snip off any excess thread when you are done sewing."
    },
    {
      "title": "Press the seam flat, and stitch the edges down.",
      "content": "Press the seam flat, and stitch the edges down. Turn the elastic so that the seam is facing you. Use your iron to press the two edges down. They should be facing away from each other, and rest flat against the elastic. Topstitch them down. Be sure to knot the ends of the thread, and to snip any excess off. This will help prevent the elastic from fraying. It will also give you a nice, clean finish on the inside. A sewing machine will give you the cleanest finish, but you can also use fabric glue to tack the two edges down instead."
    },
    {
      "title": "Tuck the skirt inside the elastic and pin it in place.",
      "content": "Tuck the skirt inside the elastic and pin it in place. The seam of the elastic should be on the inside. The waist/top hem of the skirt and the bottom edge of the elastic should be overlapping by ¼ inch (0.64 centimeters). Keep in mind that you will not be flipping the skirt inside out. You want to have the entire waistband visible when you are done sewing."
    },
    {
      "title": "Sew the elastic onto the skirt with a zigzag stitch.",
      "content": "Sew the elastic onto the skirt with a zigzag stitch. Make sure that you stretch the elastic as you sew to ensure that it will be evenly sewn onto the felt. This will allow your waistband to stretch better. Keep sewing until you get to the end of the elastic. When you are done sewing, you should have a sleek waistband for your skirt. Your poodle skirt is now ready to wear!"
    }
  ]
}