{
  "url": "https://www.wikihow.com/How-Can-I-Delete-Order-History-on-Amazon",
  "title": "How to Remove Order History from Amazon & Keep Purchases Private",
  "steps": [
    {
      "title": "Log in to Amazon in a web browser.",
      "content": "Log in to Amazon in a web browser. While you can't completely delete your order history from Amazon, you can remove an order from your history by archiving it. This will hide the order from your order list, though it won't completely delete it, and you can still find it if you know where to look. However, there's no way to do this in the Amazon mobile app—you must use a web browser. If you're using an Android, iPhone, or iPad, you will also need to enable \"Desktop mode\" after signing in so you see the correct options. Here's how: On Safari for iPhone , Tap Aa and select Request Desktop Website . Using Chrome on your Android, iPhone, or iPad, tap the three-dot menu and select Request Desktop site . If you share an account with someone, they can still view your archived orders if they know where to find them. Most people don't know about this feature, but they can easily find information about it if they're very dedicated to seeing your order history!"
    },
    {
      "title": "Click Returns & Orders.",
      "content": "Click Returns & Orders . You'll see this at the top-right corner of Amazon. A list of your recent orders will appear."
    },
    {
      "title": "Click Archive order below the order you want to remove.",
      "content": "Click Archive order below the order you want to remove. You'll see a pop-up that lists the products you'll be archiving. [1] X Research source By default, you'll see your Amazon orders from the last 3 months on the Orders page. You can search for a specific order using the \"Search all orders\" search bar or use the drop-down menu to browse older orders. You can hide up to 500 total orders."
    },
    {
      "title": "Click Archive order to confirm.",
      "content": "Click Archive order to confirm. The order has been removed from your Amazon order history. However, you can still find it by searching or visiting your Archived Orders directly. To learn the best way to keep your future Amazon orders a secret from your family members, jump down to How to Keep Amazon Orders Private ."
    },
    {
      "title": "Find your archived orders.",
      "content": "Find your archived orders. After removing an order from your history, you may need to access it again—perhaps you need to make a return or get support. There are two ways to find your archived orders: One is to search for products from the order using the \"Search all orders\" box at the top of the Orders page, and the other is to follow these steps: Click the Accounts & Lists menu at the upper-right corner of Amazon. Click Account under \"Your Account.\" Click Archived Orders ."
    },
    {
      "title": "Open your Amazon browsing history.",
      "content": "Open your Amazon browsing history. If you don't want people you share an account with to see what products you've looked at, you can clear your browsing history. To open your browsing history: In the Amazon mobile app, tap the profile icon at the bottom-center, scroll down to the \"Keep shopping for\" section, and then tap View your browsing history just beneath it. On a computer, go to https://www.amazon.com/gp/history ."
    },
    {
      "title": "Delete individual items (optional).",
      "content": "Delete individual items (optional). If you only want to remove an item or two from your browsing history, just click Remove from view below or next to the item. If you want to clear your entire browsing history on Amazon, continue with this method."
    },
    {
      "title": "Click or tap the gear at the top-right.",
      "content": "Click or tap the gear at the top-right. This pops up a Settings window."
    },
    {
      "title": "Select Remove items.",
      "content": "Select Remove items . This instantly clears your entire Amazon browsing history."
    },
    {
      "title": "Turn off your browsing history (optional).",
      "content": "Turn off your browsing history (optional). If you don't want Amazon to log the items you've browsed, you have some options: Pause your browsing history for Today , 3 Days , 1 week , or 2 weeks by selecting the corresponding button. To turn off your browsing history permanently, click or tap More settings and toggle the \"Browsing History\" switch to Off."
    },
    {
      "title": "Switch to Amazon Household.",
      "content": "Switch to Amazon Household. If you subscribe to Amazon Prime, Amazon Household allows you to share all your Prime benefits (including free shipping, Amazon Grocery, and even digital content if you choose to share it) with other family members without sharing the same username and password. Every adult account will have its own private order history that cannot be seen by anyone else in the family. Each Amazon Household can contain up to 2 adults (18+), up to 4 teenagers (13-17), and up to 4 children. [2] X Research source To add family members, go to https://www.amazon.com/myh/manage in a web browser. Click Add Adult , Add a Teen , or Add a Child . Enter the name and email address (or phone number) of the person you want to add and click Continue . When the person receives their invitation, they should follow the instructions in the message from Amazon to complete the signup within 14 days of receiving it. [3] X Research source If adding an adult, they'll be prompted to sign in with their Amazon account if they have their own, or create a new one if they don't. If you want to allow family members to share a payment method, go to https://www.amazon.com/myh/manage and select Manage Your Shared Payment Instruments . To share (or not share) digital content like Kindle books , audiobooks , and purchased apps and games, select Manage Your Family Library ."
    },
    {
      "title": "Don't let Alexa spoil the surprise gifts you buy for your family.",
      "content": "Don't let Alexa spoil the surprise gifts you buy for your family. If you have an Echo or another Alexa device, it'll alert you when you receive an Amazon package—even if the package is delivered to a different address or Amazon Locker. And if someone in your home asks Alexa about your recent orders, it'll tell them exactly what you bought! To turn these features off: Open the Alexa app and tap More (the three squares and a plus sign). [4] X Research source Tap Settings (the gear icon). Tap Notifications . Select Amazon Shopping . Under \"Let Alexa say or show titles for items you've ordered\", toggle off \"Items in your shopping basket marked as gifts, or those that might be gifts during major holidays.\" Toggle off \"For items in delivery updates\"."
    },
    {
      "title": "To ensure nobody sees your Amazon packages arrive, use Amazon Pickup.",
      "content": "To ensure nobody sees your Amazon packages arrive, use Amazon Pickup. Amazon Pickup allows you to have your Amazon order shipped to another location, such as an Amazon counter in a Whole Foods store, an Amazon Locker , and some UPS Stores. Choosing a Pickup location is especially great for your own discreet purchases, though they'll also come in handy for Christmas and birthday gifts. If you buy qualifying items sold or fulfilled by Amazon.com, you'll see the Pickup option at checkout. Your order is eligible for Amazon Locker if it's smaller than 10 lbs, smaller than 16 x 12 x 14 inches, and has a total value of less than $5000. Amazon counters at Whole Foods can accommodate larger packages up to 33 lbs and up to 36 x 24 x 24 inches. You can select a UPS Store if the item value is less than $5000 and smaller than 38 x 38 x 38 inches. [5] X Research source"
    }
  ]
}