{
  "url": "https://www.wikihow.com/Light-a-Cigar",
  "title": "How to Light a Cigar",
  "steps": [
    {
      "title": "Choose a well-made cigar you want to smoke.",
      "content": "Choose a well-made cigar you want to smoke. Cigars come in many sizes, so when shopping for a cigar, choose a cigar you could see yourself smoking. Smell the cigar beforehand, too; if its smell is appealing, you will probably enjoy smoking it. Additionally, choose a cigar without gaps or tears in its wrapper, and avoid cigars that are mottled, spotted, or flakey. [1] X Research source Cigars can be up to an inch thick; if you're a new smoker, consider choosing a smaller one. A cigar should never crumble in your hands. If you're cigar shopping online, always read others' reviews to make sure the cigar is good quality."
    },
    {
      "title": "Use an odorless flame to light the cigar.",
      "content": "Use an odorless flame to light the cigar. This includes wooden matches, torch lighters, or butane lighters; petrol lighters and candles should not be used because the odors from them will overwhelm the taste of the cigar. [2] X Research source"
    },
    {
      "title": "Light your match or a butane lighter.",
      "content": "Light your match or a butane lighter. If you are using a match, let the head of the match completely burn out before toasting the cigar, or you may inhale a sulfur taste. When you are sure the match or lighter is lit, hold the cigar in your hand. You can hold the cigar with your thumb and pointer finger. When using matches, wait a brief moment after lighting the match for the initial flame to reduce to a more manageable size. If you are using matches, you may need more than one to light the cigar. Do not hold the flame too close to your face."
    },
    {
      "title": "Toast the cigar.",
      "content": "Toast the cigar. [3] X Research source You will put the lit flame once inch from the foot of the cigar (the end you do not inhale from). Hold the cigar at a 45 degree angle very close to but not directly into the flame. This will prepare it for lighting. Gently rotate the cigar as you toast it. Toasting the foot of the cigar dries out the tobacco leaves to prepare them to light. Toast the cigar until the tip is smoldering. Sometimes, people just toast the cigar until it lights."
    },
    {
      "title": "Place the cigar in your mouth when it begins to smolder.",
      "content": "Place the cigar in your mouth when it begins to smolder. After toasting the cigar for a few moments, it will begin to smoke. It isn't lit yet, but it is ready to be lit. At this time, you can place the cigar in between your lips."
    },
    {
      "title": "Take short puffs from the unlighted end while holding the cigar close to the flame.",
      "content": "Take short puffs from the unlighted end while holding the cigar close to the flame. This draws the flame into the cigar and lights the end. Just as before, do not hold the cigar into the flame, but just above it. Never inhale cigar smoke as if you are smoking a cigarette; this can cause an unpleasant feeling and can make you nauseous. You can blow gently across the lit end of the cigar to see how evenly it has been lit. When it is evenly lit, the entire end will glow. You want to only put the very end of your cigar in your mouth to avoid getting too much saliva on the end. Continue to puff the cigar and rotate it until the tip is glowing."
    },
    {
      "title": "Rotate the slow-burning part down.",
      "content": "Rotate the slow-burning part down. [4] X Research source Cigars will often get \"runs,\" or areas that are burning faster than others. This uneven burning needs to be fixed. The first way you can fix a run is to rotate the cigar so the area that isn't burning as quickly is at the bottom of the cigar. Because a fire needs oxygen to burn, the bottom of the cigar burns faster. The slower-burning part should soon even out with the rest of the cigar. Try another method if the burn continues to be uneven."
    },
    {
      "title": "Apply moisture to the wrapper to slow the burn down.",
      "content": "Apply moisture to the wrapper to slow the burn down. If rotating the fast-burning end doesn't help even the burn, apply moisture to the wrapper where you want the burn to slow down. Touch a little bit of saliva to your finger and then to the wrapper. Do not drench the cigar in saliva; this will ruin it. Do not touch the tip of the cigar since it is very hot. Only touch the wrapper."
    },
    {
      "title": "Burn off the uneven section.",
      "content": "Burn off the uneven section. This is a drastic measure, as it will make you lose part of the cigar, but it will even out the burn. Use your match or lighter to roast the end of the cigar until the uneven section falls off. Then, the end of the cigar will be even, and it should burn more evenly. Use an ashtray to catch the uneven section. Be careful; the glowing tip is hot and could fall on you."
    },
    {
      "title": "Use small, shallow puffs to enjoy the cigar smoke.",
      "content": "Use small, shallow puffs to enjoy the cigar smoke. Do not inhale any smoke, but rather, hold the smoke in your mouth for a few second before blowing it out. You also do not need to puff on the cigar constantly; taking a puff twice every minute will keep it lit. [5] X Research source"
    },
    {
      "title": "Let any ash build up until it is ready to fall.",
      "content": "Let any ash build up until it is ready to fall. Cigars do not need to be ashed until they build up a bit of ash on the end. If you ash the cigar too often, it will get put out. When ash does build up, lightly tap the cigar into an ash tray, allowing the ash to fall."
    },
    {
      "title": "Relight the cigar as needed.",
      "content": "Relight the cigar as needed. Cigars will often go out, especially near the last third. [6] X Research source When this happens, light the cigar again by holding it close to a lit match or lighter. Puff on the cigar and rotate it until the entire end is once again glowing."
    },
    {
      "title": "Lay the cigar down in an ashtray when you are done.",
      "content": "Lay the cigar down in an ashtray when you are done. After smoking a cigar two-thirds of the way down, it is done. [7] X Research source To put out a cigar, simply leave it on an ashtray until it naturally goes out. Cigars do not need to be stubbed out like cigarettes."
    }
  ]
}