{
  "url": "https://www.wikihow.com/Grow-Lanzones",
  "title": "How to Grow Lanzones",
  "steps": [
    {
      "title": "Get your seeds from healthy trees with large fruit.",
      "content": "Get your seeds from healthy trees with large fruit. You can get the seeds to grow your lanzone tree from the flesh of the fruit. Find a lanzone tree that already grows good tasting fruit. Split open the fruit and extract the largest green seeds within the pulp of the fruit. [2] X Research source It's best to plant the seeds as soon as you extract them from the fruit. They will not germinate if you wait longer than eight days. [3] X Research source You can also buy the seeds at a gardening store or online."
    },
    {
      "title": "Rinse the seeds off.",
      "content": "Rinse the seeds off. The seed will likely have a sticky substance around it called mucilage. To remove the substance, run the seeds under cold water from your faucet. [4] X Research source If you purchase the seeds from the store this substance will already be removed."
    },
    {
      "title": "Plant the seeds in sandy loam, 3-5 cm (1-2 inches) apart.",
      "content": "Plant the seeds in sandy loam, 3-5 cm (1-2 inches) apart. Dig small holes about 1 cm (.4 inch) deep, put the seeds in the holes and cover the seeds with soil. You can do this in an indoor planter with good water drainage. Sandy loam that has a lot of organic material and is slightly acidic to neutral is the best kind of soil that you can use. [5] X Research source It's a good idea to plant multiple langsat seeds just in case some of them don't germinate."
    },
    {
      "title": "Keep the planted seeds in sunlight for 15 hours a day.",
      "content": "Keep the planted seeds in sunlight for 15 hours a day. Young seeds require a considerable amount of sunlight in order to germinate. If you are growing indoors, set your light timer to give your seeds 15 hours of light per day, or place your seed beds in a window facing south. [6] X Research source"
    },
    {
      "title": "Water the planted seeds every day.",
      "content": "Water the planted seeds every day. After you plant your seeds, water them with a watering can. Make sure that you return to the seeds every day and keep the soil moist, but not flooded. You can check the moisture in the soil by putting your finger into it and checking if the soil under the surface is dry. [7] X Research source"
    },
    {
      "title": "Wait 2-3 weeks for the seeds to germinate.",
      "content": "Wait 2-3 weeks for the seeds to germinate. In around 2-3 weeks, you should start to see your seeds germinate and grow small stalks. These seedlings will take about 10-18 months before they can be planted outside. [8] X Research source When growing lanzone trees from seeds, it could take anywhere between 10-30 years or more for them to bear fruit."
    },
    {
      "title": "Make sure the climate is tropical enough to sustain your lanzone.",
      "content": "Make sure the climate is tropical enough to sustain your lanzone. Lanzone trees thrive in ultra-tropical climates. These trees can be found naturally in hardiness zone 11+. If you plan on growing a lanzone or langsat tree, make sure that you live in a climate that can promote its growth. [9] X Research source In the United States, Hawaii and some areas in southern Florida, particularly parts of the Florida Keys, are the best locations for growing Lanzone trees. You will still need soil amendments."
    },
    {
      "title": "Find a shaded area that has soil with a lot of organic matter.",
      "content": "Find a shaded area that has soil with a lot of organic matter. Lanzone trees prefer shaded areas that are out of direct sunlight. Find a location that has well-drained sandy loam soil or another soil that's slightly acidic. Lanzone trees will not grow in clay or alkaline soils. [10] X Research source"
    },
    {
      "title": "Dig holes 25 to 33 ft (8 to 10 m) apart from one another.",
      "content": "Dig holes 25 to 33 ft (8 to 10 m) apart from one another. Use a tape measure to mark 25 to 33 ft (8 to 10 m) from each tree. If you plant lanzone trees too close together, it will make them unhealthy. [11] X Research source"
    },
    {
      "title": "Dig holes that are 50 cm deep and wide.",
      "content": "Dig holes that are 50 cm deep and wide. 50 cm wide holes will be large enough to hold the roots of the tree. Use a shovel or a hoe to dig holes that are deep enough to fully encompass the root ball of your lanzone tree. [12] X Research source"
    },
    {
      "title": "Mix a 6-6-6 fertilizer with the backfill soil in the bottom of the hole.",
      "content": "Mix a 6-6-6 fertilizer with the backfill soil in the bottom of the hole. This fertilizer will help promote the growth of your lanzone tree. Adding this same compost to your tree two to three times a year after planting it will help it as it grows into an adult tree. [13] X Research source"
    },
    {
      "title": "Plant the lanzone tree into the hole.",
      "content": "Plant the lanzone tree into the hole. Place the langsat tree into the hole. Once it's in the hole, cover the hole with topsoil and press down on the soil around the trunk of the tree to help stabilize it. Once you're done, water it immediately. [14] X Research source"
    },
    {
      "title": "Fertilize your tree twice a year.",
      "content": "Fertilize your tree twice a year. Fertilize your tree with 200g of ammonium sulfate fertilizer a month after you plant it and a month before the rainy season. Once the tree starts to bear fruit, you'll want to change the fertilizer you're using to a complete 14-14-14 fertilizer so that you can provide the tree with additional phosphorus and potassium. [15] X Research source At the peak of fruiting, 2 kgs of 14-14-14 fertilizer should be applied annually."
    },
    {
      "title": "Water the trees enough to keep the soil moist.",
      "content": "Water the trees enough to keep the soil moist. If you are growing your trees outside and there is regular rainfall, you won't need to water them regularly. If you're growing them inside or there is a dry period, however, you should use a watering can to water the plants every day. Keep the soil moist, but not overly wet. You can test this by poking your finger deep into the soil. If it's dry an inch under the surface, it's well watered."
    },
    {
      "title": "Prune your lanzone tree.",
      "content": "Prune your lanzone tree. Once your tree grows to 1.5 meters (4.92 feet), cut off the top .5 meters (1.64 feet) of the tree. Your tree should be about a meter tall. This will promote the growth of your tree's branches and fruit. Remove dead or dying branches from your lanzone tree. You should also prune off clusters of flowers to promote the growth of the fruit."
    },
    {
      "title": "Harvest the fruit 140-150 days from flower formation.",
      "content": "Harvest the fruit 140-150 days from flower formation. Harvest the fruit early in the day or later in the evening when the sun is not hot. Cut the fruit stalk with shears or a sharp knife. Do not detach the fruit's branch where it connects to the tree, or it won't be able to grow fruit on that branch in the future. [16] X Research source"
    }
  ]
}