{
  "url": "https://www.wikihow.com/Learn-Without-Forgetting",
  "title": "How to Learn Without Forgetting",
  "steps": [
    {
      "title": "Approach studying in a positive manner.",
      "content": "Approach studying in a positive manner. If you crack open the books while in a bad mood about having to study, you won’t have an effective study session. However, if you are motivated about what you are about to learn, you will have an easier time learning it and remembering it come test time. [1] X Research source Don’t tell yourself, “I’m never going to learn this.” Be patient with yourself as you try to master new material and be consistent in your studying."
    },
    {
      "title": "Create and stick to a good study schedule.",
      "content": "Create and stick to a good study schedule. Take the time to think about when you are most alert and able to concentrate. For some, this may be immediately after school. Others may be more productive if they take a break after school and relax a bit before opening the books. Regardless of when you choose to study, you will retain more information if you study a bit each day (for 30 to 60 minutes at a time) rather than cramming at the last minute. [2] X Research source Remember to incorporate breaks into your study schedule. Breaks give your brain a chance to absorb what you just studied. During your break, it is helpful to take a short walk or get some fresh air to help clear your mind."
    },
    {
      "title": "Pick a good place to study.",
      "content": "Pick a good place to study. You need to find a quiet space free of distractions, such as a library or an isolated area of your house. By having an area devoted to studying, your brain will become used to calming down and absorbing material once you get there. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Keep a set of materials near your study space, such as books, paper, pens, highlighters, a calculator, and so on. If you need a computer for your research or studies, you can utilize an app to block specific websites for a certain period of time. That way, you won’t be tempted to check social media accounts or news feeds when you should be studying instead. [4] X Research source"
    },
    {
      "title": "Stay organized.",
      "content": "Stay organized. Disorganized notes or a messy study room can be enemies to your memory. By creating order in your environment, you foster order in your mind, so you can better memorize facts and recall them later."
    },
    {
      "title": "Get enough sleep.",
      "content": "Get enough sleep. When you sleep, your brain converts facts from short-term memory to long-term memory. Even a short nap can help with this process. [5] X Trustworthy Source Darmouth University Academic Skills Center Center within Dartmouth University dedicated to assisting students achieve academic goals by providing pedagogical resources Go to source If you study in the afternoon and don’t have time for a nap then, review your notes or flashcards at night before going to bed. Aim to get 9 hours of sleep each night, the optimal level for adolescents. The recommended sleep range for adults is between 7 and 9 hours. [6] X Research source"
    },
    {
      "title": "Read your materials out loud.",
      "content": "Read your materials out loud. Using multiple senses can help you retain more information, so even just saying the words out loud and then hearing them can be helpful. Don’t worry about looking foolish reading your biology notes to your dog. You’ll be happy if it helps you ace your next exam. [7] X Research source If you’re in the library or somewhere else you can’t speak aloud, try mouthing the information."
    },
    {
      "title": "Discuss what you are learning or teach someone else.",
      "content": "Discuss what you are learning or teach someone else. Similar to reading your notes out loud, talking about what you are learning can also help you retain the information better. You can either study with a friend and quiz each other, or you can try to teach the material to a parent or younger sibling. Using your brain to figure out a way to teach the material to someone else causes you to think about the material more in-depth and analytically. You will be able to figure out which materials you need to further study if you have a difficult time teaching the concept to someone else."
    },
    {
      "title": "Write out what you have to memorize.",
      "content": "Write out what you have to memorize. Putting pen to paper and either taking notes on what you’ve read or simply re-writing over and over a formula or concept you’re trying to master can really help. [8] X Research source It can also be helpful to write out an outline of the materials you are trying to learn. Just the process of organizing the materials in a visual manner can help your brain recall the information in an organized manner. You can also write out flashcards with important facts, dates, or formulas on them. This is doubly helpful, since the act of writing will help you remember, and the flashcards are a portable tool you can review while riding on a bus or waiting for an appointment. If you’re reading, summarize each paragraph in the margins. You are in effect teaching it to yourself when you summarize and analyze it. [9] X Research source"
    },
    {
      "title": "Take a practice test.",
      "content": "Take a practice test. If you can locate a practice exam or one used in the past, this can be a good tool for figuring out what you have mastered and which topics you still need to study. [10] X Research source Once you finish the practice test, research the material you did not know and try another test again in a few days. Remember not to limit your studies to only those items found on the practice exam. Odds are, your test will include all of the information you’ve been assigned to study, not just questions you found on a previous or practice test."
    },
    {
      "title": "Master mnemonic devices.",
      "content": "Master mnemonic devices. These are memory tools that help you recall things such as names, dates, and facts through turning that information into a memorable rhyme, word, or sentence. For instance, you can remember the names of the Great Lakes (Huron, Ontario, Michigan, Erie, and Superior) by remembering the word HOMES. The first letter of the name of each lake is used to create that new word. [11] X Research source Another example of a common mnemonic is the name “Roy G. Biv,” which correlates with the colors of the rainbow: red, orange, yellow, green, blue, indigo, and violet. [12] X Research source Be creative. Use the first letter of a group of words you’re trying to remember and make a silly sentence or phrase with words that start with the same letters."
    },
    {
      "title": "Create rhymes for what you are trying to remember.",
      "content": "Create rhymes for what you are trying to remember. Rhymes are a type of mnemonic device that use audio (sound) information to help remember things. In other words, the rhymes are easily linked together for us by their sound. Think about this classic rhyme: “In 1492, Columbus sailed the ocean blue.” Try to organize the information or list of words you’re trying to remember into a rhyme."
    },
    {
      "title": "Develop a mind map.",
      "content": "Develop a mind map. Mind maps are diagrams or pictures you can create to help you visually organize information. They help show relationships between pieces of information so you can better understand the connections between different concepts or groups of data. By better understanding how different ideas connect together, you can better remember them and recall them at test time. [13] X Research source Place the main idea in the center of your mind map, and use connected branches to add related information. You can create a mind map on paper, or there are computer tools to help you create them digitally. Alternatively, you might decide that a different study format may work better for you, like flash cards or a summary sheet! Reader Poll: We asked 382 wikiHow readers and 50% of them agreed that the most effective study guide format is a summary sheet . [Take Poll]"
    },
    {
      "title": "Chew gum while studying.",
      "content": "Chew gum while studying. Some researchers believe that the act of chewing gum actually allows more oxygen into your brain, which helps you concentrate better. Furthermore, if you chew a particular flavor of gum while studying, such as peppermint, you may be able to better remember information you studied if you also chew that gum during your test. [14] X Research source"
    },
    {
      "title": "Use your sense of smell.",
      "content": "Use your sense of smell. Smells are often associated with memories, so you can use this to help you remember what you’re studying. [15] X Research source Try this experiment: smell a perfume or scent while studying. Then, smell the same scent right before your exam. You may be able to better recall the information you studied."
    }
  ]
}