{
  "url": "https://www.wikihow.com/Know-if-a-Capricorn-Man-Likes-You",
  "title": "How to Know if a Capricorn Man Likes You: Signs & Behaviors",
  "steps": [
    {
      "title": "Pay attention to if he jokes around with you a lot.",
      "content": "Pay attention to if he jokes around with you a lot. Capricorn men are usually reserved and quiet, but they do open up and show their humorous side with people they really like. If he tells you jokes, teases you, or acts silly when he’s around you, it could be a sign he’s into you . Next time you see him, try telling him a joke or teasing him and see how he reacts. If he laughs and starts teasing you back, it could mean he likes you. Make sure you smile and laugh when you tease him so he knows you're just kidding around and being flirtatious ."
    },
    {
      "title": "Ask yourself if he confides in you.",
      "content": "Ask yourself if he confides in you. Capricorn men can be shy and distant around others. They don’t open up easily, and they’re very strategic about who they trust. If a Capricorn man shares his secrets with you and talks to you about his personal problems, there’s a good chance he likes you. [1] X Research source If you're always the first person he goes to when something is wrong, it could be a sign that he likes you. Check your texting and social media conversations. Do you exchange short, surface-level messages, or does he talk a lot about what's going on in his personal life?"
    },
    {
      "title": "Notice if he gets jealous when you flirt with other people.",
      "content": "Notice if he gets jealous when you flirt with other people. Once a Capricorn man decides he likes someone, he doesn’t take well to people getting in his way. If he seems moody or upset whenever you focus your attention on others, it could mean he wishes you were talking to him instead. Pay attention to how he acts when you're talking to others. If he glances over at you a lot or interrupts your conversations, it could be a sign that he's jealous."
    },
    {
      "title": "Take it as a good sign if he invites you over to his place.",
      "content": "Take it as a good sign if he invites you over to his place. Capricorn men cherish their personal space and belongings. They don’t let just anyone into their home. If he's inviting you over to his place , it's a sign that he really trusts you. If he gives you rides in his car or lets you use his stuff, it could also be a sign that he trusts and likes you."
    },
    {
      "title": "Know that he might push you away if he likes you.",
      "content": "Know that he might push you away if he likes you. Capricorn men are calculating. They need a lot of time to think before they make decisions, especially when it comes to relationships. If you notice he starts to pull away or go cold on you, don’t panic. It might mean he likes you, and he’s just taking time to figure out whether you’re the one he wants to be with. [2] X Research source According to Astrologer Tara Divine, Capricorns tend to be afraid of rejection. So they might be slower to make a move as opposed to being spontaneous. Keep in mind that if you confront him about being distant, he may not tell you the real reason he's pushing you away."
    },
    {
      "title": "Understand that he’s looking for a lifelong partner.",
      "content": "Understand that he’s looking for a lifelong partner. Capricorn men aren’t interested in short romantic flings — they’re looking for someone to spend their lives with. If a Capricorn man likes you, it means he wants to be together long-term . If you've told him in the past that you're not looking to settle down and you only want a casual relationship, he may not be interested in you. If he thinks you're not interested in a long-term relationship but you've changed your mind, casually mention it to him so he knows you're ready to settle down with someone. You could casually say, \"I was enjoying dating around for a little while, but lately I've been wanting to find the right person to settle down with.\""
    },
    {
      "title": "Don’t expect him to be a good communicator at first.",
      "content": "Don’t expect him to be a good communicator at first. Capricorn men aren’t always good at sharing their feelings up front. They wait until they’re really close with someone before they fully open up. If you're feeling closed off from him, that doesn't mean he's not into you. It just means you'll need to get closer with him before he shares everything with you. [3] X Research source It may help if you take charge and tell him about your feelings for him first. It might make him feel more comfortable being vulnerable with you. Reader Poll: We asked 1250 wikiHow readers how they would handle a Capricorn who doesn’t prioritize their relationship, and 53% said they would communicate their feelings and expectations clearly and assertively. [Take Poll]"
    },
    {
      "title": "Be prepared to wait for him to make up his mind.",
      "content": "Be prepared to wait for him to make up his mind. Capricorn men are in no rush to be in a relationship . They’re extremely patient, and they think long and hard about whether or not they want to be with someone. Just because you’ve been friends for a long time and he hasn’t confessed his feelings for you doesn’t mean he doesn’t have them. If you really like him, try to be patient while he sorts things out. Focus on being his friend and spend your time together getting to know him more."
    },
    {
      "title": "Be supportive of his work life.",
      "content": "Be supportive of his work life. Capricorn men love to work, and sometimes they value working over other aspects of life, like friendship and romance. If you want a Capricorn man to like you, be there for him when it comes to his work. Encourage him to tackle new projects and cheer him on when he accomplishes things. [4] X Research source For example, if he’s been wanting to apply for a promotion at work but he’s doubtful he’ll get it, be supportive and tell him he should go for it."
    },
    {
      "title": "Tell him about your plans and dreams for the future.",
      "content": "Tell him about your plans and dreams for the future. When Capricorn men are looking for a partner, they think ahead to the future . They want someone who will fit in with their life plan. By telling a Capricorn man what your priorities and goals are for life, he’ll see that you care about the future too, and he’ll be able to decide whether you both could come together and pursue your goals as a team. [5] X Research source For example, you could casually bring up that you’re interested in having kids someday, or that you’re interested in settling down and pursuing a career."
    },
    {
      "title": "Avoid trying to change him.",
      "content": "Avoid trying to change him. Capricorn men are stubborn, and they’re not interested in being someone’s project. If you try to pull him away from his work or pressure him to be more sociable and outgoing, it could backfire and cause him to dislike you. Capricorn men like people who can fit into their plan, and they’re usually not willing to change that plan to accommodate others. If you want a Capricorn man to like you, part of that is accepting who he is. [6] X Research source It’s OK to expect him to compromise with you sometimes. Just don't try to change who he is as a person. For example, it's OK to ask him to go out with your friends on occasion, but you wouldn't want to pressure him to go out every weekend if he's not interested."
    }
  ]
}