{
  "url": "https://www.wikihow.com/Make-Ice-Cubes-Without-a-Tray",
  "title": "How to Make Ice Cubes Without a Tray",
  "steps": [
    {
      "title": "Choose a mold that will hold water easily without spilling.",
      "content": "Choose a mold that will hold water easily without spilling. If you have a baking mold made of silicone that is rigid and deep enough that water will stay in as you move it around, it will work just like an ice cube tray. The best molds are ones with solid shapes like squares or circles, but ones with a design on them will also work. Since silicon molds are often used to make shaped cookies and candies, each “cube” will take on the shape of whatever the mold is."
    },
    {
      "title": "Fill the shapes with water.",
      "content": "Fill the shapes with water. Run your tap over the mold until each shape fills with water. Don’t let the water spill into other shapes or sit above the depressions, as this can cause a thin sheet of ice to form on top of the ice “cubes.” Try to hold the mold with your hands on the bottom so that it doesn’t sag or begin to leak. You can leave a little air at the top of each depression if you want to avoid the risk of a thin layer altogether."
    },
    {
      "title": "Freeze the molds for at least 4-8 hours.",
      "content": "Freeze the molds for at least 4-8 hours. In order to freeze all the way through, the ice cubes need to stay in the freezer for several hours at a minimum. If you want to make sure the cubes won’t break or melt as quickly, be sure to freeze them for at least 8 hours. Doing this overnight is a good way to make sure you have solid ice by morning."
    },
    {
      "title": "Pop the ice out by twisting the mold, just like an ice tray.",
      "content": "Pop the ice out by twisting the mold, just like an ice tray. The soft silicone should bend a bit, allowing the ice to break off and be pulled out. You can also try to pat the tray from the underside to release loosened ice cubes. If you are too rough with the mold, it could break or get damaged. Use the flat end of a fork or spoon handle to get between the ice and the mold if you are struggling to break the ice loose."
    },
    {
      "title": "Fill a plastic zipper bag 1/4 full with water.",
      "content": "Fill a plastic zipper bag 1/4 full with water. Run your tap into a plastic bag until it looks like it’s about a quarter of the way full. You can use any size of bag, with larger bags producing more ice because they can hold more water. No matter the size, the water shouldn’t go past the 1/4 mark, and you should never fill the bag to the brim. [1] X Research source You can use both freezer bags and thinner sandwich bags to make ice."
    },
    {
      "title": "Zip the bag shut to keep the water inside.",
      "content": "Zip the bag shut to keep the water inside. Once you’ve filled the bag up 3/4 of the way, zip the bag at the top by securely pressing the two sides together or by pulling the zipper across to secure the bag. Leaving this open at all will lead to spillage in your freezer, so make sure you close it tightly. [2] X Research source Leave some air in the bag so that it’s easier to get the ice cubes out after breaking them apart. You only need just enough air that the top of the bag isn’t pressed tightly against the water."
    },
    {
      "title": "Lay the bag on its side in the freezer.",
      "content": "Lay the bag on its side in the freezer. In order to get a layer of ice that is easy to break apart or crush, you’ll need the water to freeze horizontally in the bag. Lay the lay the bag flat on the flattest available surface in the freezer. [3] X Research source The flattest surface is probably the freezer’s floor, as the grates used to create shelves will let the bag droop and form an uneven block. If you’re worried about spillage, you can put the bag on top of a tray, or inside of another bag."
    },
    {
      "title": "Freeze the water in the bag for 4-12 hours, depending on the amount of water.",
      "content": "Freeze the water in the bag for 4-12 hours, depending on the amount of water. A small bag may freeze in 4 hours, but larger bags could take 8-12 hours to freeze hard enough that you can break the ice up without it melting too quickly. The more water in the bag, the longer it will take to freeze. [4] X Research source The longer amount of time is due to the fact that the water has to freeze as a single block, rather than separate, individual pieces."
    },
    {
      "title": "Break up the ice after removing it.",
      "content": "Break up the ice after removing it. You can use your hands to break up the ice into small, thin chunks that resemble cubes, or you can simply take a rolling pin and crush up the ice. If you filled the bag over 1/4 of the way full, you’ll almost definitely need to crush up the ice, as there won’t be a thin, snappable layer. [5] X Research source You should do this while the ice is still in the bag to keep it from spilling out."
    },
    {
      "title": "Choose a styrofoam egg carton for a simple, waterproof ice tray.",
      "content": "Choose a styrofoam egg carton for a simple, waterproof ice tray. If your eggs come in a styrofoam carton, you already have a perfect ice tray alternative. The styrofoam will be almost entirely waterproof, and the water will freeze without binding to the styrofoam like it would with a paper carton. Be sure to wash the carton thoroughly beforehand to get rid of any possible food borne illnesses like salmonella."
    },
    {
      "title": "Line a paper carton with foil if you don’t have a styrofoam one.",
      "content": "Line a paper carton with foil if you don’t have a styrofoam one. If you get your eggs in the more common paper carton, you can still use it to make ice cubes. Take a sheet of aluminum foil and break off squares to press into the dimples. So long as no holes form as you do this, the foil will create a waterproof barrier between the water and the paper. [6] X Research source Make sure there aren’t any gaps by using a square piece and pressing it down into the middle of the dimple to create a seamless lining. It’s a good idea to let the foil stick up a bit above the carton so it’s easier to pull the ice out."
    },
    {
      "title": "Fill the dimples with water.",
      "content": "Fill the dimples with water. Whether you are using a lined paper carton or a styrofoam one, you can fill the dimples up with tap water to a point just below the top of the dimple. If you fill the dimples too far, they might spillover into one another. Your ice will form little dome shapes in the carton. Do this especially carefully if you are using a paper carton, as spray from the water could dissolve the paper."
    },
    {
      "title": "Freeze the carton for at least 4-8 hours with the lid off.",
      "content": "Freeze the carton for at least 4-8 hours with the lid off. As you put the carton in the freezer, make sure the lid doesn’t cover the dimples, as this could keep the water from freezing as quickly. The ice will need at least 4 hours to become solid and at least 8 hours, or an overnight freeze, to minimize melting and breaking. You can also remove the lid entirely before filling the carton up."
    },
    {
      "title": "Remove the ice from the carton by pressing up on the bottom.",
      "content": "Remove the ice from the carton by pressing up on the bottom. A push on the underside of each dimple will apply pressure to the ice and help you get it out of the carton. If you used a paper carton, you might be able to simply pull up on the foil, depending on how much condensation formed between the paper and the foil."
    }
  ]
}