{
  "url": "https://www.wikihow.com/Make-Flour-Dumplings",
  "title": "How to Make Flour Dumplings",
  "steps": [
    {
      "title": "Gather your ingredients and mix the dry ingredients together.",
      "content": "Gather your ingredients and mix the dry ingredients together. Mix together the flour, baking powder, and salt. You can add spices to taste as well. [1] X Research source Some recipes recommend using cake flour, but any flour should work."
    },
    {
      "title": "Heat the liquid.",
      "content": "Heat the liquid. Bring the water or chicken/vegetable stock to almost boiling over medium-high heat in a wide soup pan or Dutch oven. Reduce the heat to medium once the water or stock is nearly boiling. The liquid will begin to form small bubbles on the bottom of the pan. When these small bubbles begin to float to the surface, the liquid is about to boil and the heat should be reduced. If you are making chicken and dumplings, you will prepare chicken soup and then drop the dumplings into the soup mix instead of heating liquid for them separately. [2] X Research source"
    },
    {
      "title": "Mix the cold milk or ice water into the flour mixture.",
      "content": "Mix the cold milk or ice water into the flour mixture. Slowly add the cold liquid into the flour, mixing gently. The batter should become wet but remain fluffy. If it becomes runny, you have added too much liquid and you may need to mix in a bit more flour. [3] X Research source Do not over-mix the batter. This can cause your dumplings to deflate. The amount of ice water or cold milk you need will be determined by the consistency of the dough, but it will likely be between 3 ⁄ 4 cup (180 ml) and 1 cup (240 ml)."
    },
    {
      "title": "Drop the dumpling batter into the preheated liquid.",
      "content": "Drop the dumpling batter into the preheated liquid. Scoop out heaping spoonfuls of the dumpling batter and drop them into the near-boiling water or broth. [4] X Research source Be sure to drop all of the dough while it is still cold."
    },
    {
      "title": "Cook on medium-high heat until dumplings are firm.",
      "content": "Cook on medium-high heat until dumplings are firm. Continue cooking the dumplings for approximately 15-20 minutes, or until they are firm and solid in the middle. Cover the pot while cooking to ensure that the dumplings heat evenly. This may require you to reduce the temperature slightly. [5] X Research source When you think the dumplings are done cooking, you may want to remove one of the largest dumplings from the water/broth and cut it open to ensure that it is cooked through."
    },
    {
      "title": "Remove the dumplings from the heat and serve.",
      "content": "Remove the dumplings from the heat and serve. Most dumplings are served in the broth that they were cooked in, [6] X Research source so there is no need to remove the dumplings from the liquid they were cooked in. Just move the pot off of your cooktop and prepare to serve. Ladle the dumplings and broth into bowls. Keep any leftovers in an air-tight container in the refrigerator, and reheat on the stovetop."
    },
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. You may want to obtain special fine dumpling flour from the Asian market, but it is not necessary. You could also try cake flour, which tends to be a bit finer than standard flour. Some recipes call for nearly boiling water, some call for warm water, and some do not specify a water temperature. Try different methods and see which one works best for you. [7] X Research source"
    },
    {
      "title": "Mix the flour, water, and salt.",
      "content": "Mix the flour, water, and salt. Dumpling batter is traditionally mixed by hand, and often not measured in exact measurements. If you do want to measure, the ratio of flour to water is typically 2 to 1, but you can always add more flour if your dough seems sticky or more water if it seems too dry. Add the flour to the water in a medium bowl. Mix together with a wooden spoon or a spatula until it begins to be sticky. Remove the dough from the bowl and knead it by hand on a clean surface. (Use caution if you used boiling water to form the dough.) Continue kneading until the dough is smooth."
    },
    {
      "title": "Allow the dough to rest.",
      "content": "Allow the dough to rest. After you have kneaded the dough into a smooth ball, let the dough rest for about 10 minutes. This will help the texture and consistency of your dumpling batter. [8] X Research source"
    },
    {
      "title": "Divide the dough into 2-4 sections.",
      "content": "Divide the dough into 2-4 sections. Begin with one section and cover the others with plastic wrap to keep them moist. This gives you ample time to form each dumpling without having the remainder of your dough dry out. You may be able to skip this step once you are able to make dumplings quickly or if you have help filling them."
    },
    {
      "title": "Roll out a long section of dough.",
      "content": "Roll out a long section of dough. Using one of your divided sections, roll the dough into a rope by placing both hands on it and rolling them towards and away from you while slowly extending them out from the center. The dough rope should be no more than 1 inch (25 mm) in diameter."
    },
    {
      "title": "Divide each dough rope into segments.",
      "content": "Divide each dough rope into segments. The segments should be less than 1 inch (25 mm) long. Consistency in the size of your dough segments will lead to consistency in the size of your dumplings."
    },
    {
      "title": "Flatten each segment into a circle.",
      "content": "Flatten each segment into a circle. Use your hands to flatten each ball of dough into a flat piece. Then use a rolling pin dusted with flour to roll each dumpling skin very thin. The ideal method of rolling the skins leaves the center of the dumpling a bit thicker and the edges very thin. You can do this by applying more pressure with the rolling pin as you reach the edge of the dumpling wrapper."
    },
    {
      "title": "Repeat the process with the remaining dough.",
      "content": "Repeat the process with the remaining dough. Repeat this process until all of the dough has been made into wrappers. If you have a helper, have someone begin filling and sealing the dumplings while you are still making the dough skins."
    },
    {
      "title": "Make or buy some dumpling skins.",
      "content": "Make or buy some dumpling skins. Either make your own dumpling skins (see the process above) or buy dumpling skins from an Asian market or the ethnic foods aisle of your grocery store."
    },
    {
      "title": "Choose a filling.",
      "content": "Choose a filling. Dumplings can be filled with a wide variety of things. You can make your dumplings vegetarian or fill them with ground meat or seafood, according to your tastes. [9] X Research source Most dumplings are traditionally filled with a combination of ground meats and finely-chopped vegetables. Here are a few filling ideas: Ground pork, chopped shrimp, and chopped cabbage Chopped cabbage, and shaved carrots Chopped shrimp, chopped cabbage, and cilantro Mashed potatoes and mushrooms Berries and sugar (for a sweet dumpling)"
    },
    {
      "title": "Fill with desired filling.",
      "content": "Fill with desired filling. Scoop a small amount of the desired filling onto the center of the dumpling. Be sure you have enough to fill the dumpling, but not so much that the dumpling cannot be easily sealed shut. You probably need less filling than you think you need. [10] X Research source"
    },
    {
      "title": "Close the dumplings.",
      "content": "Close the dumplings. Fold the edges of the dumplings towards each other and pinch them together. [11] X Research source Be sure no excess flour or meat is in the way of the dough adhering to itself. Pinch the dough tightly across the top, then fold the pinched part towards you to make a crescent-shaped dumpling. [12] X Research source"
    },
    {
      "title": "Store the dumplings uncooked.",
      "content": "Store the dumplings uncooked. If you are not going to eat all of the dumplings at once, the best way to store them is uncooked, after you have assembled them. Place dumplings on a cookie sheet in the freezer until they are frozen, then transfer them into a large freezer bag or other airtight container. No need to defrost them when you are ready to cook them later."
    },
    {
      "title": "Preheat your pan.",
      "content": "Preheat your pan. Cook the dumplings in a large non-stick pan that has a lid. Oil the pan and preheat it over medium-high heat."
    },
    {
      "title": "Arrange the dumplings in the pan.",
      "content": "Arrange the dumplings in the pan. They can touch each other while cooking. Once all of the dumplings are in the pan, add water to the pan until the bottom third of the dumplings are submerged in water."
    },
    {
      "title": "Pan fry the dumplings.",
      "content": "Pan fry the dumplings. Cover the dumpling pan and cook over medium high (or high) heat for about 20 minutes. Check to ensure that the dumplings still have water around them, and add water if the pan starts to go dry. Check the bottoms of the dumplings to ensure that they are not burning. Adjust the cooking temperature as necessary. When the dough on top of the dumplings appears to be cooked, remove the lid and allow the water to cook off. Allow the dumpling bottoms to sizzle for a few moments to add a crispy flair to your dumpling, but do not allow them to burn. If you think your dumplings are done, remove a larger dumpling and cut it open. Check the temperature of the filling with a meat thermometer to ensure that the meat has cooked thoroughly."
    },
    {
      "title": "Boil the dumplings.",
      "content": "Boil the dumplings. Alternatively, you can drop the dumplings into a large pan of boiling water. This will slightly change the texture of your wrappers. You can try cooking either way and see which type of dumpling you prefer. [13] X Research source"
    },
    {
      "title": "Serve dumplings warm.",
      "content": "Serve dumplings warm. If you have allowed the bottoms of your dumplings to crisp, serve them with the crisped side facing up. Also serve with a dipping sauce or soy sauce."
    }
  ]
}