{
  "url": "https://www.wikihow.com/Make-a-Door-That-Locks-in-Minecraft",
  "title": "How to Make a Door That Locks in Minecraft",
  "steps": [
    {
      "title": "Make an iron door.",
      "content": "Make an iron door. Smelt six iron ingots , then open a crafting table . Arrange the ingots in the crafting area in a tall 2 x 3 pattern. Drag the iron door to your inventory, then place it wherever you like. If you want to pick up the door again, attack it with any tool (an axe is fastest). Do not break it with your bare hand, or it will fall apart. [1] X Research source"
    },
    {
      "title": "Decide on a door control.",
      "content": "Decide on a door control. Iron doors cannot be opened by hand. You'll need to make one of the following to operate it: [2] X Research source [3] X Research source Lever : Using it once will open the door, and using it a second time will close it. Pressure plate : Simply walk over it to open the door, and have it close automatically behind you. Monsters can use these, so they should only be placed on the inside of the door. Button : Opens the door for a short time, then closes it. Less practical than a pressure plate but harder to use accidentally."
    },
    {
      "title": "Place the control next to the door.",
      "content": "Place the control next to the door. Craft an place the control of your choice as follows: Lever : Craft one stick above one stone block. Place it on any surface adjacent to the door, including above or below it. Pressure Plate : Craft two stone blocks on the same row. Place it on the ground in front of the door. Button : Put one stone block alone in the crafting area. Place the button on any surface adjacent to the door."
    },
    {
      "title": "Add a way to get back inside.",
      "content": "Add a way to get back inside. You've just made a door that can only be opened from one side. This is an easy and effective lock, but not the most convenient one. Here are a few ways to get back inside your base, without leaving it open to mobs: Place a second button on the outside. Monsters cannot use it, unless they accidentally fire an arrow at it. [4] X Research source Carry around a second pressure plate and place it in front of the door when you want to get back inside. After you walk in, stand on the inside pressure plate while you remove the one outside. Make a secret tunnel and cover the entrance with an easily removed block. Using two levers is not recommended, since you can still lock yourself out if you leave the one on the far side in the \"closed\" position."
    },
    {
      "title": "Make two redstone repeaters.",
      "content": "Make two redstone repeaters. Open your crafting table and place a chunk of redstone in the center. Place a redstone torch on either side, then three stone blocks on the lowest row. Repeat this recipe to make a second block. Look for red-flecked redstone ore deep underground (at least 47 blocks below sea level.) Mine it with an iron or diamond pick. [5] X Research source You'll need several extra chunks of redstone as well. To make a redstone torch, craft one chunk of redstone above a stick."
    },
    {
      "title": "Make an iron door and two pressure plates.",
      "content": "Make an iron door and two pressure plates. Place a single iron door wherever you need your entrance. Place a pressure plate on the external side of the door, but not near enough to activate it. Keep a second pressure plate in your inventory for now. Craft an iron door with a tall 2 x 3 pattern of iron ingots. Craft a pressure plate with two stone or wooden blocks side by side."
    },
    {
      "title": "Connect the pressure plate with a repeater, then the door.",
      "content": "Connect the pressure plate with a repeater, then the door. Place a redstone chunk directly on any solid, opaque block next to the pressure plate. Make a line of redstone from the pressure plate to a redstone repeater, then another line from the repeater to the door. Make sure the line on the repeater connects the lines of redstone. You can hide the redstone underground to make the entrance look nicer, but you might want to practice with everything out in the open first."
    },
    {
      "title": "Place a lever on the interior side.",
      "content": "Place a lever on the interior side. Normally, pressure plates can be used by any player or monster who walks over them. You'll need to block the redstone connection to lock the door. The first step is placing a lever near the interior side of your door, but not right next to it. Craft a lever by placing a stick over a block of stone."
    },
    {
      "title": "Place a second repeater blocking the first.",
      "content": "Place a second repeater blocking the first. Turn 90 degrees and place a second redstone repeater next to the first. The line of torches visible on one repeater should be at right angles to the line on the second. [6] X Research source When this second repeater is activated, it will block the first repeater, breaking the connection between the pressure plate and the door."
    },
    {
      "title": "Connect the lever with the second repeater.",
      "content": "Connect the lever with the second repeater. Use another line of redstone to connect the lever to the second repeater. As before, make sure the line of redstone meets the line visible on the repeater."
    },
    {
      "title": "Test your door.",
      "content": "Test your door. From outside, walk over the pressure plate and through the door. Wait for the door to close, then use the lever to push it to the \"on\" position. This will lock the door in its current state (closed), preventing the pressure plate outside from functioning."
    },
    {
      "title": "Leave the room with your second pressure plate.",
      "content": "Leave the room with your second pressure plate. Place your second pressure plate on the interior of the door, right in front of it. This one is not connected to the redstone, so you can use it to leave the room at any time. Careful — if the lever is in the locked position, you will lock yourself out."
    }
  ]
}