{
  "url": "https://www.wikihow.com/Host-a-School-Talent-Show",
  "title": "How to Host a School Talent Show",
  "steps": [
    {
      "title": "Get support from school leaders.",
      "content": "Get support from school leaders. The principal, counselors, and heads of the music, art, and theater departments are your most likely sources of support. As teachers are already engaged in the creative arts, it's natural for them to be involved in your show. In addition, students can see by their instructors' enthusiasm that their school is committed to developing their overall quality of life, as well as their curriculum. [1] X Research source"
    },
    {
      "title": "Highlight the benefits of the creative arts to the student body.",
      "content": "Highlight the benefits of the creative arts to the student body. If teachers or administrators are reluctant to sanction a talent show, argue that such initiatives can have tangible academic benefits. Research shows that pursuing an interest in creative arts reduces feelings stress and anxiety and increases positive emotions. [2] X Research source Children are more likely to score higher on college entrance exams if they participate in four or more years of artistic study outside of their regular classes. [3] X Research source"
    },
    {
      "title": "Be sure that the show participants follow school rules.",
      "content": "Be sure that the show participants follow school rules. The content of the performances, dress code, and hours of operation should be taken into account when scheduling and selecting the acts. Each school's code of conduct differs, but mature content and dress will probably be prohibited. You may also have to obtain permission for utilizing school grounds after hours for planning, rehearsing, or putting on the show."
    },
    {
      "title": "Recruit help.",
      "content": "Recruit help. Running any event is a huge amount of work and nobody can do it alone. You need a team of reliable people to help you. Make a list of everything you need help with and assign volunteers to work on each item. This can be everything from selling tickets to promotions, set-building, lighting, stewarding, and backstage logistics. If a role is particularly vital, have a back-up person to help if something goes wrong at the last minute. Don't be afraid to delegate. Trust your volunteers and assign them enough help to accomplish their tasks. [4] X Research source"
    },
    {
      "title": "Allow plenty of time to plan the show.",
      "content": "Allow plenty of time to plan the show. Beginning to plan several months from the show date is usually ideal to let guests clear their schedules in advance. Four to six months should be plenty of time. If RSVP's are required, you'll need to determine a timeline for that as well, as the RSVP date will need to be included on the flyers and invitations."
    },
    {
      "title": "Avoid scheduling the show on or near holidays and weekends.",
      "content": "Avoid scheduling the show on or near holidays and weekends. You'll want a great turnout, so you won't want anyone to miss the show by being out of town. Some students might not have transportation during the evenings or weekends, so it's crucial to keep the show as close to school hours as possible."
    },
    {
      "title": "Avoid double-booking with other school events.",
      "content": "Avoid double-booking with other school events. Both students and parents will be more likely to attend if you're aware of the other activities going on each week. Coordinate with the school's administrators to avoid conflicts with other school events such as athletics, other performances, or faculty meetings."
    },
    {
      "title": "Decide where to hold the show.",
      "content": "Decide where to hold the show. The school itself will be easiest for everyone to access, and everyone will feel more comfortable in a familiar space. An auditorium or gym are large enough for a sizable audience and have plenty of room for a make-shift stage. The parking lot, school grounds, or a sports field can be used as long as weather permits."
    },
    {
      "title": "Ask local businesses or public spaces for help.",
      "content": "Ask local businesses or public spaces for help. If you can't host the event at your school, many facilities will be willing to help a local school if you can demonstrate that the event will be efficiently run and will benefit the community as a whole."
    },
    {
      "title": "Make a budget.",
      "content": "Make a budget. Project all of your possible costs, including the venue, technical aspects such as lighting or sound, transportation, and compensating any staff involved in setup or cleanup. Include any assets you are able to gain either from the school or from outside donations. Allocate the right amount of funds for each budget item. If any one item is significantly more expensive than the others, you may need to review whether it is necessary. [5] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Encourage parents to donate.",
      "content": "Encourage parents to donate. Parents of students participating in the show will want to support their kids, as will their friends. [6] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Place donation jars in the school's main offices, classrooms, or cafeteria."
    },
    {
      "title": "Sell tickets.",
      "content": "Sell tickets. If you are having trouble meeting the costs of putting on the talent show, a small ticket fee might be your best option. [7] X Research source"
    },
    {
      "title": "Organize a fundraiser.",
      "content": "Organize a fundraiser. This can be a big addition to your workload, but if you still have outstanding costs you might find it necessary. [8] X Research source"
    },
    {
      "title": "Send out invitations.",
      "content": "Send out invitations. The student body, teachers, and parents should be the first to get the details about the show. Sending an invitation home can provide a good reminder, and encourage parents to get involved. Include clear information about the dates for the auditions, RSVP, and the show itself. Also highlight the location, theme, and contact information, and give credit to sponsors or donors."
    },
    {
      "title": "Make flyers.",
      "content": "Make flyers. Use this as a fun DIY project that can get students involved with their own artwork and writing. [9] X Research source"
    },
    {
      "title": "Ask teachers to make announcements in class.",
      "content": "Ask teachers to make announcements in class. Perhaps the most direct way to spread the word, seeing their instructors excited about the show will make the students even more excited to participate or attend."
    },
    {
      "title": "Employ social media.",
      "content": "Employ social media. Many schools have incorporated the use of social media in classrooms, so take advantage of its speed and efficiency to advertise your event. Not only students, but parents, are active on social media. Instead of parents having to ask what their children are up to on a daily basis, it's more effective to show them. [10] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source"
    },
    {
      "title": "Send out e-mails.",
      "content": "Send out e-mails. Mass e-mails to the student body and parents can serve as a quick method of communication. As the date of the show approaches, this might be the best way to send a quick reminder. [11] X Research source"
    },
    {
      "title": "Hold an audition.",
      "content": "Hold an audition. Even if you intend to let everyone that wants to be involved perform, it is a good idea to hold an audition to see what they intend to do for yourself. [12] X Research source Once you've seen the acts for yourself, you can suggest modifications to their performances or costumes to ensure that they conform with school rules and time restrictions. Doing this early in the process allows for plenty of time to make any necessary modifications."
    },
    {
      "title": "Make a schedule of the acts.",
      "content": "Make a schedule of the acts. Allow each act the same amount of time to perform. About 5 minutes should be enough. Consider the flow of the acts. Is it a good idea to put a rock band on after a romantic monologue from Shakespeare? Also, try to schedule a high-energy performance to end the show. You can use the schedule as the basis for a program to pass out to audience members at the beginning of the show."
    },
    {
      "title": "Select a Master of Ceremonies (MC).",
      "content": "Select a Master of Ceremonies (MC). They need to have enough stage presence to engage the audience during transitions between the acts, and enough poise to handle any awkward moments or unplanned interruptions to the show. Consider a principal or teacher. If the school has a drama or performance program, a student not involved in one of the acts might be a good choice. Make the MC's duties clear from the outset. They will need to make an opening speech and introduce each act, so provide them with a copy of the schedule as soon as it is available."
    },
    {
      "title": "Decide if there will be a competition element to your show.",
      "content": "Decide if there will be a competition element to your show. If so, will there be judges and prizes? How will you score the acts and display the results? Does this effect the format of your show or the running order?"
    },
    {
      "title": "Hold a rehearsal.",
      "content": "Hold a rehearsal. Holding a test-run of the show about two weeks before the public performance will allow you to get a better sense of the timing, flow, and work out possible complications. It will also give the kids a chance to practice their acts onstage."
    },
    {
      "title": "Arrive early.",
      "content": "Arrive early. You will need to be on the spot to organize your volunteers, guide guests and performers, and answer questions."
    },
    {
      "title": "Supervise your volunteers.",
      "content": "Supervise your volunteers. You might be tempted to become personally involved in each task, but as long as each individual or group has been fully informed of their job, you can circulate among them to ensure they are not overwhelmed."
    },
    {
      "title": "Run a stage check.",
      "content": "Run a stage check. Run tests of the lighting and sound equipment. Check to make sure that any sets or props are in place and ready to be moved onstage. As students arrive, verify that they have any necessary costumes or equipment with them. [13] X Research source Remember that you can delegate any of these tasks to volunteers, instead of trying to do them all yourself."
    },
    {
      "title": "Give a pep-talk before the show starts.",
      "content": "Give a pep-talk before the show starts. This creates the right energy backstage and allows you to thank performers or congratulate them on coming this far. It also helps build confidence before an act."
    },
    {
      "title": "Help the MC to keep the show moving.",
      "content": "Help the MC to keep the show moving. The MC will be in charge of most of what happens onstage during the show, but you can provide help from backstage. Make sure that members of upcoming acts are ready and waiting to go on. Make a plan with the MC to provide support for students who forget lines or get stage fright. If any of the student performers are too frightened to go onstage at their scheduled time, move their act to later in the show and bring on the next act. While the student waits to go on, give them a pep talk, remind them of how well they did in the audition or rehearsal, and make sure that their friends encourage them."
    },
    {
      "title": "Keep to the event schedule.",
      "content": "Keep to the event schedule. Don't allow acts to overrun. Losing five minutes here and there will lead to you falling seriously behind schedule. You also run the risk of losing momentum and boring your audience."
    },
    {
      "title": "End the show by showing your appreciation.",
      "content": "End the show by showing your appreciation. Many teachers and school staff members probably helped you put on your show. Make a list of these people in advance and remember to thank them in a genuine way at the end of the show. [14] X Research source You might consider presenting volunteers with a small gift or flowers, or asking them to come on stage at the end of the show for a round of applause."
    },
    {
      "title": "Clean up.",
      "content": "Clean up. Whether you're using a school building or an outside facility, you don't want to leave a mess. Supervise your volunteers or the facility's staff in cleaning up the building and breaking down any lighting, sets, or equipment you used in the show. [15] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    }
  ]
}