{
  "url": "https://www.wikihow.com/Make-Jelly",
  "title": "Basic Recipe for Delicious Homemade Jelly",
  "steps": [
    {
      "title": "Sort and wash ripe fruit for your jelly.",
      "content": "Sort and wash ripe fruit for your jelly. You can use any fruit to make your own jelly. Pick fruits that are fully ripe for the most intense flavors, and toss out any damaged or diseased pieces you find. Rinse all the fruit you’re using under cool running water to clean off any dirt on the surface. You’ll need enough fruit for about 4–5 cups (950–1,180 ml) of fruit juice, so use: [1] X Research source 3 pounds (1.4 kg) of apples for 4 cups (950 ml) of juice. 3 pounds (1.4 kg) of strawberries for 4 cups (950 ml) of juice. 2 1 ⁄ 4 – 3 3 ⁄ 4 pounds (1.0–1.7 kg) of blackberries or blueberries for 4 cups (950 ml) of juice. 3 1 ⁄ 2 –4 pounds (1.6–1.8 kg) of fresh grapes for 5 cups (1,200 ml) of juice. You can use pre-packaged fruit juice instead of fresh fruit."
    },
    {
      "title": "Cut the fruit into 1 in (2.5 cm) pieces.",
      "content": "Cut the fruit into 1 in (2.5 cm) pieces. It’s a lot easier to extract juices when your fruit pieces are bite-sized. Use a chef’s knife to chop all of your fruit into cubes. Leave the peel and core with the pieces since they contain pectin, which will help give your jelly its texture. [2] X Research source Small fruits like berries and grapes are tiny enough that you don’t need to cut them beforehand."
    },
    {
      "title": "Crush the fruit with a potato masher in a large pot with cold water.",
      "content": "Crush the fruit with a potato masher in a large pot with cold water. Pour all of the cubed fruit pieces into a large pot. Press the fruit with a potato masher to extract the juices. If you don’t see a lot of juice in the pot, you may need to add some cool water to help break the pieces down. [3] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source For every 1 pound (0.45 kg) of apples, add 1 cup (240 ml) of water. For 1 pound (0.45 kg) of blackberries or blueberries, use 1 ⁄ 4 cup (59 ml) of water. Use 1 ⁄ 4 cup (59 ml) of water for 1 pound (0.45 kg) of grapes. Add 1 ⁄ 4 cup (59 ml) of water for 1 pound (0.45 kg) of strawberries. [4] X Research source"
    },
    {
      "title": "Bring the fruit to a boil and simmer it over medium-low heat until it’s soft.",
      "content": "Bring the fruit to a boil and simmer it over medium-low heat until it’s soft. Set the pot on your stove and turn it on high heat until the fruit mixture starts boiling. After it bubbles, turn the heat down and let the fruit soften. Stir the fruit frequently so the fruit doesn’t burn or stick to the bottom of the pot. [5] X Research source Give yourself about 20–25 minutes if you’re extracting apple juice. It usually takes about 5–10 minutes to extract juice from blackberries, blueberries, strawberries, and grapes. As the fruit cooks, try using your potato masher on the pieces to crush them and extract even more juice."
    },
    {
      "title": "Strain the fruit juice into a bowl through a jelly bag.",
      "content": "Strain the fruit juice into a bowl through a jelly bag. A jelly bag has a fine mesh that hangs over a bowl so the juice can drain out. Set a bowl underneath the jelly bag and slowly pour the fruit into it. Just let all of the juice drip out of the bag before you get rid of the fruit pieces. [6] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source You can squeeze the fruit while it’s inside the bag to get more juice, but your jelly may look cloudy. If you end up squeezing the bag, strain the juice one more time to get rid of any small pieces that snuck through."
    },
    {
      "title": "Give your fruit juice a taste test to see if it needs more acid.",
      "content": "Give your fruit juice a taste test to see if it needs more acid. Jelly needs acid to help the juice gel up and give it a tart flavor, but fruit may not have enough natural acid. In a separate bowl, mix 1 teaspoon (4.9 ml) of lemon juice , 3 tablespoons (44 ml) of water, and ½ teaspoon (2 g) of cane sugar and taste it. Then, taste your fruit juice to see if it has the same tartness as the lemon juice. [7] X Research source If your fruit juice doesn’t taste like the lemon juice solution, then add 1 tablespoon (15 ml) of lemon juice and do another taste test. Sour apples, grapes, and sour blackberries have high acid content and shouldn’t need any extra. Ripe apples, ripe blackberries, and California grapes sometimes need a little extra acid, but they may taste okay without it. Blueberries, peaches, raspberries, and strawberries always need additional acid. [8] X Research source"
    },
    {
      "title": "Mix fruit juice with rubbing alcohol to see if it gels or needs added pectin.",
      "content": "Mix fruit juice with rubbing alcohol to see if it gels or needs added pectin. Pectin is found naturally in fruits, but they may not contain enough to turn the juice into jelly. In a small glass, mix 1 teaspoon (4.9 ml) of your fruit juice with 1 tablespoon (15 ml) of rubbing alcohol . After 2 minutes, check if the mixture has a solid, jelly-like consistency. If the juice is still runny, you’ll need to add commercial pectin . [9] X Research source Grapes, cranberries, gooseberries, and tart apples all have high pectin, so you shouldn’t have to add any extra. [10] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Blueberries, cherries, peaches, raspberries, and strawberries are all low in pectin, so you’ll probably need to add some to your jelly. Rubbing alcohol is not food-safe, so avoid eating the alcohol-juice mixture."
    },
    {
      "title": "Put the fruit juice and any added pectin in a clean pot.",
      "content": "Put the fruit juice and any added pectin in a clean pot. Use around 4–6 cups (950–1,420 ml) of fruit juice to make a 3–4 c (710–950 ml) batch of jelly. If your juice needed pectin, add around 4 teaspoons for every 2 cups (470 ml) of fruit juice you’re using for your jelly. Use a spoon to stir and combine the ingredients. [11] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source Commercial pectin comes with a chart letting you know how much you need to add for specific fruits."
    },
    {
      "title": "Bring the fruit juice to a rolling boil.",
      "content": "Bring the fruit juice to a rolling boil. Turn your stove to high heat and keep stirring the juice and pectin together to ensure it’s completely mixed. Let the fruit juice come to a rolling boil, which is when the bubbles don’t go away as you’re stirring. [12] X Research source"
    },
    {
      "title": "Stir cane sugar into the fruit juice until it completely dissolves.",
      "content": "Stir cane sugar into the fruit juice until it completely dissolves. The amount of cane sugar you’re using depends on the fruit you used to make your jelly. Pour in all of the sugar at once and continuously stir it into the juice. Keep mixing the fruit juice with the sugar until you don’t feel any more lumps. You’ll mix in: [13] X Research source ¾ cup (150 g) of sugar for every 1 cup (240 ml) of apple juice. ¾–1 cup (150–200 g) of sugar for 1 cup (240 ml) of blackberry or blueberry juice. 1 cup (200 g) of sugar for every 1 cup (240 ml) of grape juice. ¾ cup (150 g) of sugar for every 1 cup (240 ml) of strawberry juice. Stirring the juice also prevents the bottom of the pot from burning or scorching."
    },
    {
      "title": "Heat the jelly until it reaches 220 °F (104 °C).",
      "content": "Heat the jelly until it reaches 220 °F (104 °C). Continue stirring your jelly for the entire time that it’s cooking on your stove. When the juice is boiling, check if the temperature is 220 °F (104 °C) with a candy thermometer . If it’s reached temperature, take the pot off of the heat right away. [14] X Research source You can also test if jelly is done by dipping a cool metal spoon into the juice and holding it sideways above the pot. If the jelly hands down in one large drop, then it’s finished."
    },
    {
      "title": "Skim the foam off the top of the jelly with a spoon.",
      "content": "Skim the foam off the top of the jelly with a spoon. Use a spoon to scoop out the foam that formed on the surface of the pot. Try to remove as much foam as you can before the jelly cools since it could ruin the flavor of your jelly. [15] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source Adding ½ teaspoon (2.5 g) of butter to the juice when you first start cooking can prevent foam from forming, but it can give your jelly an off-flavor."
    },
    {
      "title": "Pour the jelly into clean pre-warmed glass jars.",
      "content": "Pour the jelly into clean pre-warmed glass jars. Use clean glass canning jars with lids since they’ll protect your jelly the best. Warm the jars in a hot water bath or your dishwasher so the hot jelly doesn’t break them. Pour the jelly into the jars, leaving about 1 ⁄ 4 inch (0.64 cm) of space at the top, before screwing on the lid. [16] X Research source Set the jars on a heat-safe surface before you pour in the jelly so you don’t accidentally damage anything underneath them."
    },
    {
      "title": "Process and seal your jelly in boiling water to prevent mold growth.",
      "content": "Process and seal your jelly in boiling water to prevent mold growth. Fill a food canner halfway with water and heat it to 180 °F (82 °C). Load the sealed jars of jelly into the canner on a wire rack and add water so it’s 1 inch (2.5 cm) above the jar. Let the jars heat for about 5 minutes so they properly seal. [17] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Canning your jelly makes the jar airtight so bacteria can’t get inside before you have a chance to use it."
    },
    {
      "title": "Let the jar of jelly cool for 12 hours.",
      "content": "Let the jar of jelly cool for 12 hours. Your jelly hasn’t completely set yet, so leave the jar upright on your countertop so it has a chance to gel. Wait until your jelly has completely cooled to room temperature before it’s ready to use. [18] X Research source"
    },
    {
      "title": "Store the sealed jars at room temperature for up to 1 year.",
      "content": "Store the sealed jars at room temperature for up to 1 year. Once you seal the jelly jar, store it in a cool, dark place. Keeping jelly in a warm, bright spot in your kitchen could darken its color and deteriorate its texture, so try to keep it in a cabinet or pantry. As soon as you open it, move the jelly to your fridge. [19] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source Label the jelly with the day you made it so you know how long you’ve been storing it."
    },
    {
      "title": "Keep opened jelly in your fridge for 1 month.",
      "content": "Keep opened jelly in your fridge for 1 month. If you want to use your jelly right away, break the seal on the jar and scoop out as much as you need. Keep the jelly refrigerated when you aren’t using it so it doesn’t develop any mold or bacteria. [20] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source If you ever notice mold in the jelly or if it has a pungent odor, toss it out."
    }
  ]
}