{
  "url": "https://www.wikihow.com/Look-Like-a-Victoria%27s-Secret-Model",
  "title": "How to Look Like a Victoria's Secret Model",
  "steps": [
    {
      "title": "Work out at least three to five times a week.",
      "content": "Work out at least three to five times a week. It’s obvious that no one (even the genetically gifted Angels) can look like a Victoria’s Secret model without hard work and intense exercise. These girls aren’t just skinny - they’re healthy, fit and toned. If you want to be like them you will have to put in the time and effort. It may be tough but the end results will be worth it. During most of the year, Victoria’s Secret models will exercise between three and five times per week, for one to two hours per session. They usually try to vary their workout sessions by alternating between cardio, muscle toning and strengthening exercises. However, running up to the VS Fashion Show, the Angels up their game in order to look their absolute best. For the two weeks before the show, they will usually work out six times a week, two hours per day, under the supervision of a personal trainer."
    },
    {
      "title": "Do cardio.",
      "content": "Do cardio. If you want to look like a Victoria’s Secret model, cardio is a must. [1] X Expert Source Souad Gharib Exercise & Wellness Specialist Expert Interview. 8 June 2021. Cardio gives your body an all-over workout, helping you to shed any extra pounds and increase your fitness levels. Choose a cardio exercise based on your own personal preference - if you find a type of exercise that you enjoy, you’ll be much more inclined to keep it up. Some good options include running (outside or on the treadmill), cycling (spinning classes are fantastic!) and swimming - basically anything that gets your heart rate up! Before the show they do incline walking to work on their butts!"
    },
    {
      "title": "Do body sculpting exercises.",
      "content": "Do body sculpting exercises. It’s important to remember that losing weight isn’t enough - you’ll also need to get that body looking toned and firm! The best way to do this (as the Angels know) is through body sculpting exercises. The Angels particularly love Ballet Beautiful - a fitness class inspired by ballet moves which helps to create strong, sleek muscles, improve posture and increase flexibility. Lily Aldridge, in particular, is a fan: “It’s my go-to.” High-intensity kickboxing is another favorite, as it provides a cardio workout while also toning the legs and butt. Candice Swanepoel swears by it. Jump-rope is another much preferred form of workout. The girls are also fans of yoga and pilates, which help to lengthen and strengthen the muscles. Although strength is important - bulky muscles are a no-no. You want your body to look as lean and feminine as possible."
    },
    {
      "title": "Focus on your tummy, legs and butt.",
      "content": "Focus on your tummy, legs and butt. When your day job involves prancing around in skimpy underwear, having lean legs, a firm butt and a tight tummy are essential. So if you want to look like a Victoria’s Secret model, you’ll have to work on these features. For your legs, lunges are ideal for working the inner and outer thighs. Try doing them with a 5 to 10 lb weight in each hand to increase the intensity. For your calves, try doing calf pulses (where you rise up onto your toes from a standing position. See more leg toning exercises here. For your butt, squats and deadlifts are the way to go - not only will they get you a firm, rounded booty, they will also work your legs and core. Just remember - you want to look lean rather than bulky, so focus on doing more repetitions with smaller weights, rather than the other way around. For more butt toning exercises see here . For a toned tummy, crunches are your best friend. Also, try reverse crunches and side crunches to work all of your abdominal muscles. Planks are also fantastic for building core strength. For more stomach toning exercises see here ."
    },
    {
      "title": "Work towards ideal Angel measurements.",
      "content": "Work towards ideal Angel measurements. When working out, it’s good to have a specific goal in mind. And what better goal to work towards than the VS Angel ideal measurements? Most Angels have a body measurement of a 32” bust, a 23.6” waist, and 34.4” hips. This means that Victoria Secret models have a classic hourglass figure. Through your exercise you can strive to achieve body measurements as close to these as possible. However it is important to be realistic - most women will not be able to reach these measurements exactly, as a lot depends on genetics and your natural body shape. Don’t let this get you down though! You can still be beautiful and Angel-like even without these measurements - just do your best to be in the best shape possible for you, but remember all VS angels are above 5' 9\" in height, and that's with flat feet."
    },
    {
      "title": "Eat smoothies, juices and nutritional bars for breakfast.",
      "content": "Eat smoothies, juices and nutritional bars for breakfast. It’s important to realize that most Angels don’t ‘’diet’’, per se, but they do eat very healthily and try to eat fresh, organic, clean foods as much as possible. Therefore, sugary cereals and cream cheese bagels are out the window when it comes to breakfast and eat the white of an egg on some whole grain toast. Many of the Angels have proclaimed their love for healthy smoothies and juices for breakfast - as they are healthy, filling and provide tons of energy to kick off the day. For a fruity start, try blending 1 cup of ice with ½ cup of frozen berries (like strawberries, raspberries or blueberries). ½ cup of plain yogurt (low-fat), 1 small banana, 1 tablespoon (14.8 ml) of honey and ½ cup of rolled-oats. For an uber-healthy green juice filled with vitamins and nutrients, push 2 green apples, 4 celery stalks, 1 cucumber, 6 kale leaves, ½ a lemon and a 1” piece of fresh ginger through a juicer. These are their favourites, apparently one of these a day will make you feel great! If you require something a little more filling in the mornings, combine your juice with a nutrition bar, or prepare a small, egg-white omelette or some oatmeal and have some yoghurt."
    },
    {
      "title": "Eat lean meat and steamed veggies for dinner.",
      "content": "Eat lean meat and steamed veggies for dinner. Lunch and dinner are more or less the same, generally - lean meat and steamed veggies or salad. When steaming vegetables make sure that you don’t overcook them - in fact the closer to raw you cook them, the better! Some of the Angel’s favorite veggies include artichoke, asparagus, broccoli and kale, which they like to season with salt, spices and a little olive oil (according to their nutritionist, Dr. Charles Passler). In terms of protein, stick to things like chicken, turkey and fish, which you can flavor with spices, herbs or lemon juice before steaming or grilling. Try to stay away from fattier red meats and from carb-heavy foods like pasta and bread. The Angels like to “eat clean” which means avoiding any foods that are processed in any way and only eating foods which are natural and chemical-free. That also means staying away from greasy foods like French fries and from sugary candy and desserts. Of course, it’s important to treat yourself to a small salty or chocolatey treat every once in a while. It's better than going overboard all at once. Consider prepping your meals in advance. It will make it easier to stay on track. [2] X Expert Source Souad Gharib Exercise & Wellness Specialist Expert Interview. 8 June 2021."
    },
    {
      "title": "Have a snack every 2 to 3 hours.",
      "content": "Have a snack every 2 to 3 hours. Victoria’s Secret models are really careful about the type of foods they eat. There’s no need to starve yourself - in fact, their nutritionist encourages the models to eat every 2 to 3 hours! Eating a small snack every 2 to 3 hours helps to keep the metabolism running smoothly and prevents blood sugar from dipping too low. It also helps to stem any cravings you might have for foods that are on “the naughty list!” Recommended snacks include half of a nutrition bar, a piece of fruit or a handful of almonds and dark chocolate once a week to reduce temptations."
    },
    {
      "title": "Take supplements for healthy hair, skin and nails.",
      "content": "Take supplements for healthy hair, skin and nails. Although a diet rich in healthy juices and plenty of fresh fruit and veg will provide you with plenty of vitamins and nutrients, it’s a good idea to take some additional dietary supplements in order to get Angel-worthy hair, skin and nails. Consider taking a cure-all vitamin supplement such as PHYTO Phytophanere, which helps hair, skin and nails to grow faster and stronger, and works to significantly reduce skin blemishes and minimize pores. Alternatively, you could you a water booster, like Dr. Brandt Anti-Oxident Water Booster. This is a kind of vitamin-rich syrup which you add to water. It keeps your skin looking clear and healthy, while also giving you an added energy boost! The Angels’ nutritionist also recommends taking a supplement to get the gastrointestinal system working (to prevent bloating and aid weight loss) and a supplement to promote muscle function. However, it’s probably a good idea to speak to your doctor before you start taking either of these. Take advice from the Angels themselves! Miranda Kerr drinks four teaspoons of coconut oil a day to keep her skin and hair looking glowing and healthy."
    },
    {
      "title": "Drink plenty of water every day.",
      "content": "Drink plenty of water every day. You’re probably already aware that it’s really, really important to drink lots of water, but if you want to look like a VS model, you’ll need to take that advice very seriously! [3] X Expert Source Souad Gharib Exercise & Wellness Specialist Expert Interview. 8 June 2021. The Angels drink about 2 US quarts (2,000 ml) of water per day - which is the same as four pints! To compete with that, you’ll probably need to have a water bottle attached to your hand for the entire day! Water is so important because it flushes toxins from your system, increases blood flow and leaves your skin looking fresh and glowing! Don't forget to wash, cleanse, tone and moisturise your skin! You can also increase your water intake by drinking herbal and green teas (which are full of anti-oxidants) and by eating fruit and veg with a high water content, such as cucumbers, tomatoes, watermelon, beets and lettuce."
    },
    {
      "title": "Do Angel-worthy make up.",
      "content": "Do Angel-worthy make up. To look like a VS Angel, you need to learn how to do your makeup like a VS angel. The Angels don’t tend to go overboard on their makeup, they prefer more of a healthy, glowing look with some added sparkle and shimmer! Try to go for a mineral or powder foundation that matches your skin tone perfectly - you really don’t want to look like you’re caked in makeup! Apply a little matching concealer under the eyes or to cover any blemishes, if necessary. Then use a pinky-bronze colored blush to add a healthy glow to your cheeks. Apply eyeshadow in neutral colored creams and browns. Then, depending on your skin tone, use a black or brown eyeliner to line your upper lid only. Use a matching mascara to add volume and definition to your lashes. The Angels don’t usually wear bold lipsticks, they prefer to go for soft pink and nude pouts. Try using a balmy lipstick that’s just a shade or two lighter or darker than your natural lip color. Stay away from glosses or anything that’s too shiny or shimmering. Just look at MAC lipsticks for a lovely nude shade."
    },
    {
      "title": "Get fabulous hair.",
      "content": "Get fabulous hair. Having fabulous hair is essential for any VS Angel. Make sure yours is in tip top condition by getting regular trims, using a weekly deep conditioning treatment and by avoiding excessive heat from styling tools like flat irons, curling tongs, and hair dryers. The better you treat your hair, the faster it will grow - and as you know, long, healthy hair is a VS model’s trademark. When it’s time to get all-dolled up, the Angels favor loose, tousled-looking curls. To achieve this make sure your hair is freshly washed and conditioned, and use a nourishing serum or oil (such as argan oil) to add shine. Blow dry your hair using a round bristled brush to add lots of volume. When your hair is dry, spritz it with some heat protection spray and begin making large, loose curls using your flat iron or curling tongs (for more specific instructions see here and here ). When you’re done, spritz your hair with some loose hold hairspray and you’re ready for the runway!"
    },
    {
      "title": "Get a beautiful bronzed body.",
      "content": "Get a beautiful bronzed body. As you may have noticed, all of the Angel’s have beautiful, sun-kissed glows. Therefore, if you want to look like a VS model you’ll have to get your tan on! However, as the Angels know, having healthy skin is far more important than having a tan. Therefore, it is absolutely essential that you wear sunscreen if you plan on lying out by the pool. Otherwise, you could be exposing your skin to burns and sunspots - not to mention contributing to wrinkles, premature aging and skin cancer! If getting a natural tan feels like too much effort, you’re super pale, or you just want to avoid sun exposure - fret not! You can get a natural-looking tan from a bottle. Just make sure to exfoliate well before you apply any self-tanning products. For more info on using a self-tanner, see here ."
    },
    {
      "title": "Have perfect, white teeth.",
      "content": "Have perfect, white teeth. Having perfect, straight, white teeth is another Angel must-have! Practice good oral hygiene by brushing your teeth 2 to 3 times a day, flossing regularly and avoiding sugary food and drinks. You should also make an effort to see your dentist a couple of times a year. He can give your teeth a proper cleaning, getting rid of any stains or built-up plaque that are impossible to remove at home. This will also leave your teeth looking whiter! If necessary, you can also ask your dentist about whitening treatments like laser or bleaching. These can be pricey, but are worth it if you really want a dazzlingly white smile! The same goes for braces - if your teeth are a little crooked, ask your dentist about your options for straightening them."
    },
    {
      "title": "Dress to impress.",
      "content": "Dress to impress. The VS models are classy ladies, and even though they spend a lot of time in their underwear, they still manage to look glamorous and elegant - never trashy. Try to emulate this in your everyday life by wearing polished, well-tailored clothes which highlight your feminine side. Think dark bootcut jeans, with crisp, button down shirts, or A-line dresses and skirts which cinch in at the waist. Wear understated jewelry and opt for low heels or pretty flats. The most important thing is to wear clothes that fit you. Don’t wear too-small clothes thinking that they’ll make you look skinnier - they’ll actually have the opposite effect. Always try on clothes before buying and bring a trusted friend with you who can give you an honest opinion. Even in their downtime, the Angel’s look well-put-together. Wear matching gym clothes (like the oh-so-comfortable yet stylish VS tracksuits) and always have your hair looking neat, even if it’s just tied back in a pony. Of course, no Angel would be complete without her VS lingerie! Don’t be afraid of sexy lingerie, girls - it’s designed to make you feel beautiful, even underneath jeans and a t-shirt! Again, it’s important to wear the right size, as too-small lingerie can create bulges and lumps in all the wrong places, while too-big lingerie won’t give you the support you need."
    },
    {
      "title": "Be beautiful inside and out!",
      "content": "Be beautiful inside and out! Not only are they some of the most beautiful people on the planet, the VS Angels are also well-known for their friendliness, kindness and overall great personalities! This is something you can easily adopt in your everyday life. Just by smiling and being kind, you will radiate beauty - just like an Angel!"
    }
  ]
}