{
  "url": "https://www.wikihow.com/Make-a-Circle-Skirt",
  "title": "How to Make a Circle Skirt",
  "steps": [
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Making a circle skirt is easy and you don’t even need a pattern. To make a circle skirt, you will need: [1] X Research source one yard of stretch fabric (in the color of your choice) a fitted skirt (one that fits you well) scissors pins sewing machine"
    },
    {
      "title": "Fold the fabric four times.",
      "content": "Fold the fabric four times. Take your stretch fabric and fold it in half so that the shortest edges are even with each other. Then, fold your fabric again so that the long edges are even. [2] X Research source If you have chosen a print fabric, make sure that the print is facing in. Lay your fabric out flat when you're finished, with the folded edges facing you."
    },
    {
      "title": "Cut a bit of fabric off for your waistband.",
      "content": "Cut a bit of fabric off for your waistband. You will need to have a couple of strips of fabric to use for your waistband, so cut in a straight line a few inches away from the narrow edge of the open part of your fabric. Do not cut along the folded side. [3] X Research source Set these strips aside for now."
    },
    {
      "title": "Use the fitted skirt as a guide for the waist.",
      "content": "Use the fitted skirt as a guide for the waist. Fold the fitted skirt four times length-wise and then place the waistband of the folded fitted skirt over the edge of the folded corner of your stretch material. Use the width of the folded fitted skirt as a guide for how wide to make the waistband of your circle skirt. [4] X Research source To create the waistband, take your scissors and cut a half circle for the waistband that is about the same width as the width of the folded fitted skirt. Cut it from the corner that's closest to you. [5] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020. It is better to cut the waist a little smaller. Remember that the fabric is stretchy and you can always make it a little wider if you need to. If you prefer, you can also measure your waist circumference with a measuring tape. Just divide the number by four to determine how wide to cut the waist. [6] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Cut the bottom of the skirt.",
      "content": "Cut the bottom of the skirt. Measure from the waist down to the cut length on both folded edges and mark those spots with a pencil. Then, draw a curved line between the marks you just drew. Next, take your scissors and cut along that curved line. [7] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020. Don’t worry if there are a few jagged edges at the bottom of your skirt. You will be hemming the bottom edges, which will cover up any minor imperfections. Cut the skirt so it's an extra 1 in (2.5 cm) longer than the length you want. This will account for the top seam allowance and a small hem. [8] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Check the width of the waistband.",
      "content": "Check the width of the waistband. Unfold the fabric once so that is it just folded in half. Then unfold your fitted skirt and hold the waistband of it up against the waist of your circle skirt. This will help you to determine if the waist is the correct size. [9] X Research source If it is too small, then you can make it a bit wider."
    },
    {
      "title": "Measure fabric for the waistband.",
      "content": "Measure fabric for the waistband. Next, take the fabric that you set aside for your waistband and place it next to the waist of your skirt. You should have two strips on top of each other with the patterns facing each other (if the fabric has a pattern). Place the strips near the waist and cut the edges of the strip so that you will have enough to hem the waistband. [10] X Research source Since the waist is a half circle and the strips are straight, you may want to measure for this part or at least cut a little more fabric than you think you will need."
    },
    {
      "title": "Sew the waistband pieces.",
      "content": "Sew the waistband pieces. Take your waistband pieces and make sure that they are lined up. If the fabric has a pattern, it should still be facing in. Take your two waistband pieces and sew them together along the short edges. Then, hem the long edges by folding about a half inch of the fabric over and sewing along the edge of this fabric. [11] X Research source Use a regular stitch to sew the waistband. You do not need to use any elastic for the waistband since you are using stretch fabric."
    },
    {
      "title": "Pin the waistband to your circle skirt.",
      "content": "Pin the waistband to your circle skirt. Open up your circle skirt and lay it out on your table or floor. Then take your waistband and start pinning it onto the waist of your circle skirt. As you pin on the waistband, make sure that the print side of your waistband faces the print side of your circle skirt. [12] X Research source The edges of the waistband and the circle skirt edge should be even as well. Start by pinning one edge to the circle skirt and then pin the opposite edge. Then, pin the part of the waistband that is halfway between the two pins you just placed. Then, pin the part of the waistband across from that pin. Keep pinning in the way to ensure an even distribution of the waistband."
    },
    {
      "title": "Attach the waistband to your circle skirt.",
      "content": "Attach the waistband to your circle skirt. After your waistband is pinned to your circle skirt, start sewing along the edge of your waistband and circle skirt waist with a zig-zag stitch. Remove the pins as you go. [13] X Research source Make sure that you stretch both pieces of fabric a bit as you sew to make sure that they will be even and smooth. After you are done, just flip the waistband fabric over and tuck it into the waist when you wear it."
    },
    {
      "title": "Fold over the edges of the skirt bottom.",
      "content": "Fold over the edges of the skirt bottom. Before you hem the skirt, you will need to fold the edges over. Create the fold about a half inch away from the edge of the skirt bottom all the way around. You can pin the edges if you want to be sure that the hem will be even or you can just fold the edges as you go. [14] X Research source Another option is to start with a baste stitch to mark the hem fold. You can sew a baste stitch about ½ inch away from your skirt edge and then use this stitch as a guide as you fold over the material and sew the hem. Fold along the baste stitch as if it is a perforated line. Then, you can either remove the baste stitch or fold over the edge again and sew. [15] X Research source For even more accuracy, try sewing a piece of ribbon onto the inner edge of your skirt bottom. Then, fold over the ribbon and sew again. The ribbon can also help to provide some structure and added body to your circle skirt. [16] X Research source"
    },
    {
      "title": "Hem the skirt.",
      "content": "Hem the skirt. Sew the hem using a regular stitch. Make sure that the edges are even all around the skirt. If you are worried about making a mistake, then you can always start with a basting stitch and then go over it with a regular stitch when you are happy with the results. [17] X Research source Hemming a skirt can be a challenge because of the curved edges. Go slow and try to be patient. Try ironing the edge before you sew. You can also iron the hem edge flat before you sew it in place. This may reduce the chances of puckering material or uneven spots. [18] X Research source"
    },
    {
      "title": "Trim off the excess thread and wear your skirt.",
      "content": "Trim off the excess thread and wear your skirt. After you finish the hem, trim away any loose excess threads along your hem and waistband. Now your skirt is ready to wear! You can wear a circle skirt in lots of different ways, so have fun experimenting. [19] X Research source Try pairing your circle skirt with a fitted t-shirt and pair of sandals for an easy spring or summer look or wear it with tights, a sweater, and some boots for a cute fall or winter look."
    }
  ]
}