{
  "url": "https://www.wikihow.com/Make-a-Paper-Mosaic",
  "title": "How to Make a Paper Mosaic",
  "steps": [
    {
      "title": "Get some sheets of paper in different colors.",
      "content": "Get some sheets of paper in different colors. Construction paper is the most popular, but you can also use scrapbook paper, paint chips, magazine pages, or even cereal boxes! What colors you need depends on your design. You don't have to use all of the colors of the rainbow. You could just use different shades of the same color, such as: light blue, medium blue, and dark blue."
    },
    {
      "title": "Cut the paper into small pieces to make your tiles.",
      "content": "Cut the paper into small pieces to make your tiles. The pieces should be small, about the size of your thumbnail. You can make squares, rectangles, triangles, or even thin strips. The pieces don't have to be the same size. In fact, try to cut some smaller ones too. This way, you can fit them into tight corners. Sort your shapes by color and put them into small piles or cups. This will make it easier to find the color you need."
    },
    {
      "title": "Start gluing the pieces of paper to the outline of a shape.",
      "content": "Start gluing the pieces of paper to the outline of a shape. Lightly draw a simple shape on a sheet of paper, which will be the outline for your mosaic. When you start gluing the pieces on it, leave a small gap between each one. You can apply the glue directly to the sheet of paper, or you can apply it to the back of your tile instead. If you are using irregular shapes, including triangles, make sure that the straightest edge is on the outside of the outline—otherwise, your shape will look jagged. If you are using white school glue, apply it with a paintbrush. This will keep things less messy. If you are applying the glue directly to the paper, work only in small sections at a time, or the glue will dry too fast. [1] X Research source"
    },
    {
      "title": "Glue the rest of your tiles to the inside of your shape.",
      "content": "Glue the rest of your tiles to the inside of your shape. If your shape has designs on the inside, like spots on a butterfly wing, outline those designs first with more tiles before filling them in. Don't be afraid to cut some pieces down to help them fit! For a more professional touch, continue aligning the pieces along the outline, going smaller and smaller with each row until you reach the center."
    },
    {
      "title": "Consider filling in the background, if desired, using a contrasting color.",
      "content": "Consider filling in the background, if desired, using a contrasting color. [2] X Research source This will make your work stand out. If you used different colors for your shape (this includes different shades of the same color), consider using just one color for the background. This will make your shape the focus. You can also leave the background blank."
    },
    {
      "title": "Set the mosaic out to dry.",
      "content": "Set the mosaic out to dry. If you'd like to make your mosaic last longer, coat it with an acrylic sealer or a brush-on decoupage glue, such as Mod Podge. Let it dry before moving on."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    },
    {
      "title": "Draw a large oval or rectangle on a sheet of black paper.",
      "content": "Draw a large oval or rectangle on a sheet of black paper. The shape needs to be just a little bit larger than your head. Don't cut anything out yet. [3] X Research source Use poster paper, construction paper, or cardstock for this."
    },
    {
      "title": "Draw some shapes for the eyes, nose, and mouth.",
      "content": "Draw some shapes for the eyes, nose, and mouth. You will be cutting the eyes out, so figure out where your eyes will be when you put the mask on, and place them accordingly. Keep the nose and moth simple; you will be filling them in with tiles. A triangle for the nose and a rectangle or sausage shape for the mouth would be perfect!"
    },
    {
      "title": "Cut some colored paper into small tiles.",
      "content": "Cut some colored paper into small tiles. You can use construction paper, scrapbook paper, or paint chips for this. The shapes can be squares, rectangles, triangles, or even a combination of all three. They can be different sizes, but try to make them no larger than your thumbnail. You will need at least two different colors for this: one color for the mask and a contrasting color for the nose and mouth. For a different look, paint your own paper, let it dry, then cut it out. [4] X Research source Sort your shapes by color. This will make it easier to find the color you need."
    },
    {
      "title": "Start gluing your paper tiles to the edge of your mask.",
      "content": "Start gluing your paper tiles to the edge of your mask. Leave a small gap between each tile, and make sure that it doesn't go past the edges of the paper shape. You can use a glue stick or white school glue. If you are using white school glue, apply it using a paint brush. This will make things less messy."
    },
    {
      "title": "Glue some more tiles to the inside edges of the nose and mouth.",
      "content": "Glue some more tiles to the inside edges of the nose and mouth. This way, your nose and mouth won't be too big. Remember to leave a slight gap between each tile. For a cleaner finish, align any straight edges with the outline, and keep pointy edges on the inside of the shape. Use your contrasting color(s) for this. It will help them stand out better."
    },
    {
      "title": "Outline the outside of the eyes with more tiles, if desired.",
      "content": "Outline the outside of the eyes with more tiles, if desired. Don't fill the eyes in. You will be cutting them out later. You can use the same color you will use for the inside of the mask, or you can use a contrasting color."
    },
    {
      "title": "Start filling in your mask with tiles.",
      "content": "Start filling in your mask with tiles. You can glue them down randomly, or you can follow the curves of the outlines as you work your way towards the center. Remember to leave slight gaps between each tile. Use your contrasting color for the nose and mouth."
    },
    {
      "title": "Let your mask dry.",
      "content": "Let your mask dry. If you'd like to make your mask last longer, you can seal it with a clear, acrylic sealer or a brush-on decoupage glue, such as Mod Podge. Remember to let the mask dry after sealing it."
    },
    {
      "title": "Cut the mask and the eyes out.",
      "content": "Cut the mask and the eyes out. If you are a child, ask an adult to help you cut the eyes out. You can cut the mask itself out using a pair of scissors, but you will need a shape craft knife (such as an Xacto knife) to cut the eyes out."
    },
    {
      "title": "Punch some holes to either side of the mask, and thread some ribbon or elastic through them.",
      "content": "Punch some holes to either side of the mask, and thread some ribbon or elastic through them. The holes should be at about ear level, or just where the eyes are on your mask. This will make the mask more comfortable to wear."
    }
  ]
}