{
  "url": "https://www.wikihow.com/Get-Wavy-Hair",
  "title": "How to Get Wavy Hair",
  "steps": [
    {
      "title": "Prepare your hair.",
      "content": "Prepare your hair. Before turning in for the evening, shampoo and condition your hair. Remove excess water by squeezing your locks with a towel. Brush through your tresses to remove any snarls, then divided it into sections based on how long it is. If your hair goes to your mid-back or longer, divide it into 2 sections by creating a center part from the top of your forehead to the nape of your neck. If your hair is shorter, divided into more than 2 sections for smaller, defined waves."
    },
    {
      "title": "Create waves with french and standard 3-section braids.",
      "content": "Create waves with french and standard 3-section braids. When left in wet hair overnight, basic 3-strand plaits create luxurious, all-over natural waves. [1] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. Divide the left section into three equal subsections and plait the hair. French braid (or Dutch braid) your hair from the top of your left ear to the nape of your neck, gathering loose hair as your go. Once you reach the nape of your neck, braid the remaining hair in a standard 3-section plait. Secure the ends with a rubber band. Repeat on the right section. If you want loose waves, flatten the braids by pulling on the individual subsections. [2] X Research source"
    },
    {
      "title": "Create waves with the fishtail braid.",
      "content": "Create waves with the fishtail braid. Leaving a fishtail braid in overnight will allow you to achieve a messier, smaller wave without the hassle of using a curling iron. Separate the left section into two equal halves. Grab the front subsection with your right hand and the back subsection with your left hand—your palms should face you. Section off a small piece of hair from the front subsection with your right index finger. Bring this hair across the front section and lay it in between the two subsections. Grad the hair with the left index finger and add it to the back subsection of hair. Repeat this process, but begin with the back subsection. Continue to alternate until you have reached the ends of your hair. Secure with a rubber band. Repeat this process on the right section. Your left hand will hold the front section and your right hand will grasp the back section."
    },
    {
      "title": "Create waves with a twisted rope braid.",
      "content": "Create waves with a twisted rope braid. When you leave a twisted rope braid in your hair overnight, you will wake up with voluminous beach waves. Divide the left section of hair into two sub-sections. Tightly twist each subsection counterclockwise from root to end. While holding one end in each hand, tightly twist the subsections around each other in a clockwise motion until you reach the ends. Secure the twisted rope braid with a rubber band. Repeat this process on the right section. If you have short or natural hair, try making more than 2 braids. Try twisting 10-20 braids for pretty, defined waves."
    },
    {
      "title": "Undo the braids and style your waves in the morning.",
      "content": "Undo the braids and style your waves in the morning. Sleep with the braids in your hair. Upon waking up, remove the elastics and undo the braids. Tousle your hair with your fingers. Spray lightly with hairspray. [3] X Research source If your hair isn't prone to unraveling at the ends, you can skip the elastics. If you are using one of these methods in the morning or afternoon, leave your hair in braids until it is day. You may speed up the drying process with a blow dryer or by sitting under a hooded dryer, especially if you have thick hair."
    },
    {
      "title": "Twist your hair into a bun if you have long, straight hair.",
      "content": "Twist your hair into a bun if you have long, straight hair. To achieve big natural, loose waves without a curling iron, twist and secure your hair into one bun. Pull your wet or dry hair up into a high ponytail. Raise the ponytail straight above your head. Twist the ponytail tightly from top to bottom. A tighter twist will produce more pronounced waves. Bring your twist forward over your head. Coil the twist around itself to form a bun. Secure the bun with a hair tie. Leave your hair in the bun for at least one hour. You may sleep with it in the bun overnight. Remove the ponytail holder and untwist the coil. Run your fingers through you hair to separate the waves and spray your hair with hair spray."
    },
    {
      "title": "Twist and pull your hair into two buns.",
      "content": "Twist and pull your hair into two buns. To create bouncy waves throughout the lower half of your locks, put your hair into two twisted side buns. Spray your dry hair with sea salt spray. Part your hair down the center from the top of your forehead to the nape of your neck. Grab the left section near the top of your left ear. From the point, begin tightly twisting your hair until you reach the end. Coil the twist around itself to form a bun near the top of your left ear. Secure the bun in place with a scrunchie. Repeat this process on the right section of hair. Leave your hair in these two side buns for at least an hour. Remove the scrunchie and uncoil the bun. Run your fingers through your hair and scrunch your locks in your fists. Complete the look with a quick mist of hairspray."
    },
    {
      "title": "Twist and pull your hair into multiple buns.",
      "content": "Twist and pull your hair into multiple buns. When you want a perfectly tousled head of messy waves, set down the small curling iron and twist and pull your hair up into several mini buns instead. Use a rattail comb to section your damp hair into two inch square sections. Instead of using straight lines, part your hair in a zigzag pattern for a more intentionally imperfect look. Secure the individual sections with small duck clips. Undo one clip and apply a small amount of mousse to the section. Twist the section tightly from root to tip. Coil the twist into a bun and secure it with a bobby pin. Repeat this process on every section. [4] X Research source Individually apply heat to each bun with a blow dryer. Once the bun is dry and the bobby pin is hot to the touch, move on to the next bun. Once the bobby pins are cool, undo each bun. Use a blow dryer to fix sections that are too curly and a curly iron to fix pieces that are too straight. Spray with hairspray. [5] X Research source"
    },
    {
      "title": "Enhance your natural waves with a diffuser.",
      "content": "Enhance your natural waves with a diffuser. Diffusers, attachments that spread a blow dryer's heat evenly throughout the hair, were created for those with curly and wavy hair. The diffuser will bring your natural curl out quicker. Run a few drops of smoothing serum through your towel dried hair to prevent frizz. Apply from the middle of the hair shaft down to the ends—do not apply to the roots. Dry your hair with the diffuser. Place the blow dryer near the ends of your hair and angle the tool towards your face. As you dry your hair, move the blow dryer up towards your roots. Your hair will scrunch onto the surface of the diffuser. Repeat this process until all of your hair is dry. Brush through your waves with your fingers and mist with hairspray or an anti-humidity spray. [6] X Research source"
    },
    {
      "title": "Tame your curls into waves with a blow dryer and round brush.",
      "content": "Tame your curls into waves with a blow dryer and round brush. When you are looking to tame your naturally curly, springy hair into loose waves, all you need are a round brush, a blow dryer, and patience. After washing your hair, keep frizz at bay by applying a smoothing treatment to your damp locks. Place the flat nozzle attachment onto your blow dryer. Divide your hair into 1 to 2 inch sections. Leave one section out and pin the rest back. This will provide you with more control. Use a round brush and your blow dryer to smooth out the section of hair you intentionally left out. Once dry, gently twist the hair around the brush in the direction you wish the curl to fall. While keeping the section lightly twisted, carefully pull out the brush. Repeat on the rest of the sections. Don't pull the curls too hard, or you'll get straight hair instead of waves. Finger comb your hair to separate the twists into loose waves. Add volume to your do by fluffing the hair near your roots. Mist with hairspray or an anti-humidity spray to complete this look. [7] X Research source"
    },
    {
      "title": "Achieve wavy hair with velcro rollers.",
      "content": "Achieve wavy hair with velcro rollers. Medium sized velcro rollers will allow you to achieve the perfect wave without exposing your hair to the heat of a curling iron. Apply a tennis ball sized amount of mousse to your damp hair. Allow your hair to air dry until it is just slightly damp. Divide your hair into three layers—a bottom, middle, and top—and secure them with a duck clip. Unclip the bottom layer and divide it into several one to two inch sections. Begin with the left front section. Place a velcro roller on top of the ends and roll it up towards your roots. Secure the roller with a bobby pin. Repeat this process until all of the hair in the bottom, middle, and top layers are rolled. Use a blow dryer to apply heat to each individual apply roller. When your hair feels cool to the touch, mist your hair with hairspray. You could also keep the rollers in overnight to dry, or sit under a hooded dryer. Remove the rollers one at a time. Start with the bottom layer and work your way up. Unpin the roller and grab it near the roots. To remove the roller, do not unwind the hair but pull the roller from your roots and down the strand of hair. Repeat until all of the rollers are removed. Finger comb through your locks to separate the curls into loose waves. [8] X Research source"
    },
    {
      "title": "Use a curling iron to create finger waves.",
      "content": "Use a curling iron to create finger waves. Producing S-shaped waves throughout your hair will provide you with a glamorous, Hollywood worthy look. Before curling your hair, shampoo, condition, and blow dry your locks. [9] X Research source To achieve finger waves, you must curl your hair in the same direction. Vertically wrap one inch sections of hair around a one inch curling rod. Once all of your hair is curled, brush through your tresses with a boar bristle brush and mist with shine spray."
    },
    {
      "title": "Use a curling iron to create voluminous bouncy waves.",
      "content": "Use a curling iron to create voluminous bouncy waves. If you prefer an old-Hollywood do, curl your hair into luscious loose waves. After washing your hair, apply a generous amount of mousse to your damp tresses. Blow dry your hair completely. [10] X Research source Wrap a two inch sections of hair around a one and a half inch curling iron. Remove the barrel without unwinding the curl. Use a bobby pin to secure the curl near your scalp. As you move from one section to the next, alternate the directions of the curls. After twenty minutes, remove the bobby pins and brush through your hair."
    },
    {
      "title": "Curl random sections of your hair for barely there waves.",
      "content": "Curl random sections of your hair for barely there waves. The barely there wave is a natural, effortless look that is easy to achieve. Rough dry your hair before curling—as you hold a section of hair straight up, move your blow dryer up and down the section at a 45° angle. [11] X Research source Randomly select large sections of hair to wrap around a one and half inch curling iron. Instead of curling the entire strand, curl only the middle of the hair shaft. Finger comb your hair and mist with a texturizing spray."
    },
    {
      "title": "Apply mousse and scrunch your hair into messy waves.",
      "content": "Apply mousse and scrunch your hair into messy waves. Mousse can transform fine, pin-straight hair into messy wavy locks. Apply a generous amount of volumizing mousse to your damp hair. As you distribute the mousse, scrunch the ends of your hair up towards your roots. [12] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. [13] X Research source Rough dry your mousse treated hair—as you hold a section of hair straight up, move your blow dryer up and down the section at a 45° angle. [14] X Research source Do not comb through your hair. [15] X Research source"
    },
    {
      "title": "Apply sea salt spray for a textured, beachy wave.",
      "content": "Apply sea salt spray for a textured, beachy wave. With sea salt spray, you can achieve that “fresh from the ocean” wavy-do year round. After showering, squeeze excess water from your locks with a towel then wrap your hair in a cotton shirt. Once your hair is damp, apply a generous amount of spray from the mid-shaft to the root. Use the cotton shirt to scrunch your hair, this will build up texture and volume. Allow your hair to air dry. [16] X Research source You may blow dry your hair on low with a diffuser attachment."
    },
    {
      "title": "Apply dry shampoo for a gritty wavy look.",
      "content": "Apply dry shampoo for a gritty wavy look. Using dry shampoo as a texturizing spray will make it appear as though you just came from a rock show rather than the beach. Thoroughly spray your dry hair with dry shampoo. Scrunch your hair from the ends up towards your roots. Finger comb your hair for a more piecey look. [17] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}