{
  "url": "https://www.wikihow.com/Make-Arrowheads",
  "title": "How to Make Arrowheads",
  "steps": [
    {
      "title": "Look for the right type of rock.",
      "content": "Look for the right type of rock. It should be brittle, fine-grained (no large patterns or striations), uniform in texture, and contain no fractures. Jasper, chalcedony, quartzite, obsidian, and any type of chert or flint are all excellent choices. [1] X Research source Obsidian is the most distinct, a very shiny black glass, but it only occurs in certain areas. Even if you can't identify any of these, however, there are still ways to test whether a rock is useful: Tap the stone with another stone and listen to the ring. Generally speaking, the higher the pitch, the better the core. [2] X Research source Strike it once with a harder stone. If a cone-shaped impression is left and sharp fragments break off, this rock is good for shaping. Glass and porcelain will also work, but unless you have an unusually large piece, you'll probably skip straight to the instructions for shaping it into an arrowhead. If you have no success finding the right rock in your area, you can use a beer bottle base and skip straight to instructions for shaping an arrowhead."
    },
    {
      "title": "Select a large rock of the right type.",
      "content": "Select a large rock of the right type. This will be your core , and the larger it is, the more chances you'll have at breaking off a good piece. However, it should be small enough to hold steadily between one hand and your leg."
    },
    {
      "title": "Select a hard stone or other tool.",
      "content": "Select a hard stone or other tool. If you're using obsidian, glass, or another especially brittle material, you can select a softer rock. A specialized tool called a billet will also work. The stone should be roughly round, easy to grip, and harder than the material you selected. This is called a hammerstone . A billet is a hard cylindrical object traditionally made from moose antler, bone, or very hard wood. Soft hammerstones and billets are used on softer cores and for more precise flaking, since they \"catch\" on the core's material and allow you to direct the force more accurately. You only need one tool, but trying out several will let you test which one works best for the size and type of rock you chose."
    },
    {
      "title": "Find or create a striking surface.",
      "content": "Find or create a striking surface. This is called a \"platform\", and should be located next to an edge of the rock with an acute angle (less than 90 degrees). If your rock does not have a suitable platform, break apart one of the rounded edges with a large hard hammerstone. A flatter platform will be easier to strike, but the angle of the edge is more important. A rough platform will improve as you hammer it."
    },
    {
      "title": "Use your tools to break flakes off your platform.",
      "content": "Use your tools to break flakes off your platform. It may take practice before you can reliably form suitable flakes. Sit with legs apart and hold the core firmly against your leg using your left hand (if you are right handed). Keep the platform oriented over the gap between your legs. Strike the edge of the platform with a controlled glancing blow, coming from above and following through below the core. [3] X Research source The ideal flake is long and fairly thin, though not so thin it will break. Large is good, so strike the platform with a good deal of force if you're only making small fragments."
    },
    {
      "title": "Prepare the surface between strikes.",
      "content": "Prepare the surface between strikes. Set aside the flake just created and grind off small fragments from the striking surface's edge. This strengthens the platform and reduces the chance of unwanted breakage. You can use your hammerstone, any soft rock, or a nail file. [4] X Research source This shouldn't require much force. This is also referred to as \"brushing\" or \"abrading\" the rock."
    },
    {
      "title": "Select a flake.",
      "content": "Select a flake. Once you've removed at least a few flakes, decide which one(s) to shape into an arrowhead. An ideal flake for this purpose is long, relatively thin, and convex on both sides."
    },
    {
      "title": "Select a suitable object.",
      "content": "Select a suitable object. If you completed Part 1, you'll already have one made exactly for this purpose. Otherwise, a flat piece of glass such as the base of a beer bottle is an easily accessible material for practicing. Either way, the rest of the instructions refer to this as a flake . [5] X Research source If using a beer bottle base, be sure to carefully remove hanging glass fragments with a rock before you begin. Gloves are especially important for this."
    },
    {
      "title": "Grind the edge of the flake to remove weak fragments.",
      "content": "Grind the edge of the flake to remove weak fragments. If you created the flake yourself, this is the same process you used on the core to strengthen it between strikes. You can use a soft stone or nail file. If there are any protrusions or areas too thin to use, break them off as you grind. WARNING: Always prepare the edge below the centerline of the flake (an imaginary plane running through the horizontal center of the flake). Striking above the centerline will cause the flake to shatter."
    },
    {
      "title": "Select a small shaping tool.",
      "content": "Select a small shaping tool. This is called a pressure flaker : a durable flexible tool, usually with an antler or copper tip. You can purchase one or make it yourself out of a copper nail fastened in a piece of hardwood."
    },
    {
      "title": "Sit and prepare to start working.",
      "content": "Sit and prepare to start working. This should be in an outdoor area so you don't fill an enclosed space with rock dust. Gloves and goggles will prevent cuts. Firmly hold the flake against your knee. The next step will require a fair amount of force, so you'll need to keep it stable."
    },
    {
      "title": "Use the tool to shape an edge around the entire object.",
      "content": "Use the tool to shape an edge around the entire object. You'll be working on both sides of the flake to reduce the object to two convex sides with one edge between them. This is called creating a bifacial edge. [6] X Research source Push down with your pressure flaker below the centerline (midpoint of the object) to push off a smaller flake. This will create a \"flake scar\". Flip the object over and use the flake scar to create a similar flake on the opposite side. Rotate slightly and repeat. Eventually you'll have one edge all around the flake, with flake scars on either side."
    },
    {
      "title": "Flake more material off both sides of the edge to create the desired shape.",
      "content": "Flake more material off both sides of the edge to create the desired shape. Pay attention to where you're applying force as you do this; you'll need to remove more material from portions of the object in order to end up with the \"rounded triangle\" or \"lens\" shape of an arrowhead. REMEMBER, always keep the side you're working on face down. Pushing through the top of the object will shatter it. Place your tool against the \"valley\" of a flake scar and push hard into the center of the object (not down as before). Maintain that pressure inward and push down to remove a long flake extending as far toward the center of the object as you can manage. Moving around the edge on both sides, repeat this process until the flakes you are removing reach the center of the object on both sides and the arrowhead shape is achieved. You may need to fully rotate the object several times. Consider switching to smaller tools to make smaller adjustments as you near your goal. [7] X Research source"
    },
    {
      "title": "Notch your arrowhead.",
      "content": "Notch your arrowhead. If you'd like to bind your arrowhead to an arrow shaft, you'll need to create two notches at the base. You can use a specialized notching tool similar to a flathead screwdriver, or use the same pressure flaking tool as before. Using the same technique you used to begin your bifacial edge, flake off a portion of the base angled toward the center of the arrowhead. Gradually work your way into the arrowhead until the notch is long and wide enough to tie onto an arrow shaft. Keep flipping the object over to work on each side of the notch in equal amounts. Grind the inside edge of the notch smooth using a nail file. Create a second notch on the opposite side of the base."
    }
  ]
}