{
  "url": "https://www.wikihow.com/Make-Plant-Based-Meat",
  "title": "How to Make Plant-Based Meat: 4 Incredible Recipes",
  "steps": [
    {
      "title": "Make a marinade.",
      "content": "Make a marinade. In a bowl, whisk together the vegetable broth, soy sauce, tomato paste, vegan Worcestershire sauce, garlic powder, onion powder, paprika, smoked paprika, and black pepper until fully mixed. [1] X Research source"
    },
    {
      "title": "Add the textured vegetable protein.",
      "content": "Add the textured vegetable protein. Pour the textured vegetable protein into the bowl and mix into your marinade until fully incorporated. Let it sit for 5 minutes to marinate. [2] X Research source"
    },
    {
      "title": "Preheat your frying pan.",
      "content": "Preheat your frying pan. On your stove top, add your vegetable oil to a frying pan and turn on to medium heat. [3] X Research source"
    },
    {
      "title": "Cook the vegan ground beef for 10 minutes.",
      "content": "Cook the vegan ground beef for 10 minutes. Add your marinated vegan ground beef to the frying pan. Cook for 10 minutes, or until the vegan ground beef is fully browned. [4] X Research source"
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! It's that simple. Vegan ground beef is a versatile and simple protein that can be used in dishes like tacos, sloppy joes, or even shepherd's pie. [5] X Research source"
    },
    {
      "title": "Preheat your frying pan.",
      "content": "Preheat your frying pan. Add 1 tablespoon of olive oil in a frying pan. Place the pan over medium heat. [6] X Research source"
    },
    {
      "title": "Add the chopped pepper, onions and garlic.",
      "content": "Add the chopped pepper, onions and garlic. Saute until the pepper and onions are tender. Remove from the heat. [7] X Research source"
    },
    {
      "title": "Transfer the cooked pepper, onions and garlic to a food processor.",
      "content": "Transfer the cooked pepper, onions and garlic to a food processor. Make sure you scoop everything out of the pan! [8] X Research source"
    },
    {
      "title": "Add the remaining ingredients.",
      "content": "Add the remaining ingredients. Carefully add the cooked black beans, chili powder, garlic powder, cumin, smoked paprika, bread crumbs, eggs, Worcestershire sauce and ketchup into the food processor. [9] X Research source"
    },
    {
      "title": "Gently pulse all of the ingredients.",
      "content": "Gently pulse all of the ingredients. Be sure not to overmix! You’ll want some larger chunks of those black beans in your patty. [10] X Research source"
    },
    {
      "title": "Form the black bean patties.",
      "content": "Form the black bean patties. Divide the mixture into 6 portions. With your hands, scoop up each portion of the mixture and press it into a patty. Repeat to form the rest of the patties."
    },
    {
      "title": "Cook the black bean patties on each side for 2-3 minutes.",
      "content": "Cook the black bean patties on each side for 2-3 minutes. The burger can either be grilled or pan-fried. Cook on each side for 2-3 minutes, or until the exterior of the patty becomes brown and crispy. [11] X Research source"
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! This black bean burger is not only high in fiber, but it is high in protein as well. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you’re feeling left out at your neighborhood cookout, whip up some of these patties and share!"
    },
    {
      "title": "Add the ingredients to a food processor.",
      "content": "Add the ingredients to a food processor. Pour in the chickpeas, vegetable stock, nutritional yeast, garlic powder, onion powder, thyme, coriander powder, sage, poultry seasoning, and dijon mustard into the food processor. [13] X Research source"
    },
    {
      "title": "Mix the ingredients for 1 minute.",
      "content": "Mix the ingredients for 1 minute. Pulse for 1 minute, or until everything has become fully mixed. Be sure to scrape the sides of your food processor to fully mix all of your ingredients. Once the ingredients are mixed, transfer the mixture to another bowl with a spoon. [14] X Research source"
    },
    {
      "title": "Add the vital wheat gluten.",
      "content": "Add the vital wheat gluten. Once the gluten is poured into the bowl, vigorously mix with your hands until the gluten is incorporated and the mixture starts to become firm. Be careful not to overmix, as overmixed gluten may become too chewy. [15] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Transfer the mixture to a flat surface.",
      "content": "Transfer the mixture to a flat surface. A cutting board or a rolling mat would be perfect. Feel free to oil the board or mat to prevent any sticking. [16] X Research source"
    },
    {
      "title": "Divide the mixture into 6 pieces.",
      "content": "Divide the mixture into 6 pieces. Using a spatula, cut the mixture into 6 filet-sized chunks. The shapes do not need to be uniform as long as they are similarly portioned. [17] X Research source"
    },
    {
      "title": "Wrap each piece in foil.",
      "content": "Wrap each piece in foil. Take each filet and carefully seal them inside aluminum foil. Wrap the foil nice and tight around each filet. [18] X Research source"
    },
    {
      "title": "Steam the filets for 20 minutes.",
      "content": "Steam the filets for 20 minutes. Place the 6 foiled-wrapped filets into a steamer and steam for 20 minutes. This will allow the filets to become firm. [19] X Research source"
    },
    {
      "title": "Remove the filets from the steamer.",
      "content": "Remove the filets from the steamer. Using a set of tongs, carefully remove each filet from the steamer. The steam will be hot, so use caution. [20] X Research source"
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! Whether you’re in the mood for chicken soup or fajitas, this plant-based chicken recipe is a great starting point! Chickpeas are packed with many health benefits that make this chicken alternative a great nutritional option. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Preheat the oven to 375 degrees.",
      "content": "Preheat the oven to 375 degrees. While your oven preheats, you can form the meatballs. [22] X Research source"
    },
    {
      "title": "Saute the onions, mushrooms, and garlic.",
      "content": "Saute the onions, mushrooms, and garlic. In a skillet, add the olive oil and turn on the heat to medium. Add the onions, mushrooms, and garlic until the onions and mushrooms become slightly tender. [23] X Research source Mushrooms are an essential ingredient for making your own plant-based meat substitute."
    },
    {
      "title": "Let the flaxseed sit for 5 minutes.",
      "content": "Let the flaxseed sit for 5 minutes. In a food processor, combine the flaxseed, water, and nutritional yeast. Let the mixture rest for 5 minutes. [24] X Research source"
    },
    {
      "title": "Combine and mix the ingredients.",
      "content": "Combine and mix the ingredients. Add the onions, mushrooms, garlic, cooked lentils, Parmesan cheese, fennel seed, Italian seasoning, salt, and pepper to the food processor. Pulse the meatball mixture until each ingredient is properly combined. Be sure not to overmix. You want some texture left! [25] X Research source"
    },
    {
      "title": "Form the meatballs.",
      "content": "Form the meatballs. Transfer the meatball mixture into a separate bowl. Use a spoon to scoop out any remaining mixture into the bowl. Using a cookie scoop or medium-sized spoon, form the meatballs and place them in rows on a baking sheet. [26] X Research source"
    },
    {
      "title": "Bake the meatballs for 20-25 minutes.",
      "content": "Bake the meatballs for 20-25 minutes. Place the baking sheet into the oven for 20-25 minutes, or until cooked completely. Once cooked, remove the baking sheet from the oven. [27] X Research source"
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! Whether you’re in the mood for a good Italian dish or a helping of plant based Swedish meatballs, this meatless meatball recipe is as straightforward as it is tasty. The addition of lentils adds an impactful health benefit that makes these meatballs shine in any dish. [28] X Research source"
    }
  ]
}