{
  "url": "https://www.wikihow.com/Increase-Luteinizing-Hormone",
  "title": "How to Raise LH Levels in Males & Females",
  "steps": [
    {
      "title": "Ask about a gonadotropin treatment.",
      "content": "Ask about a gonadotropin treatment. When the fertility drug Clomiphene doesn't work, doctors often turn to gonadotropin treatment. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source In women, LH is needed for ovulation, and gonadotropin acts in a similar way to LH, encouraging your body to produce the other hormones needed for ovulation. In men, LH is needed to produce testosterone. Gonadotropin can act in its place, increasing testosterone and a man's sperm count, which also increases a couple's chances of conceiving. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take human menopausal gonadotropin (hMG) to produce eggs.",
      "content": "Take human menopausal gonadotropin (hMG) to produce eggs. Typically, if you're a woman, you take this treatment every day for about two weeks, and you or your partner will inject it under your skin. Once your body has responded, you stop the treatment and a doctor will monitor your follicles until they are ready for an egg to be released. [4] X Research source"
    },
    {
      "title": "Inject human chorionic gonadotropin (hCG) to release eggs.",
      "content": "Inject human chorionic gonadotropin (hCG) to release eggs. When your follicles are ready, your doctor will give you an injection of hCG to tell your body it's time to release the eggs into your uterus. At that time, you can try to conceive for the next day or so. [5] X Research source"
    },
    {
      "title": "Begin with hCG if you're a man.",
      "content": "Begin with hCG if you're a man. Men usually start with hCG. Generally, you'll have a couple of injections a week. You'll try it for about half a year. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If it hasn't helped, your doctor may add hMG to your regimen."
    },
    {
      "title": "Watch for side effects.",
      "content": "Watch for side effects. The primary side effects of gonadotropin are swelling, irritability, restlessness, headaches, tiredness, and depression. [7] X Research source Men may also have an increase in acne, an increase in breast size, and changes in sex drive. [8] X Research source"
    },
    {
      "title": "Decide whether you need to increase the levels of LH.",
      "content": "Decide whether you need to increase the levels of LH. LH is important, but an absence of this hormone can be treated in other ways than increasing LH. That is, you can treat the effects of low LH rather than trying to increase LH levels. [9] X Research source"
    },
    {
      "title": "Ask about estrogen replacement for women.",
      "content": "Ask about estrogen replacement for women. If you are not trying to get pregnant, then the most likely treatment for you will be to take estrogen to replace what's not being produced because you are low on LH. You'll also need to take cyclic progestins to decrease your chances of developing cervical cancer. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Generally, you take estrogen and progestins in pill or patch form. [11] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Consider testosterone replacement for men.",
      "content": "Consider testosterone replacement for men. In men, the treatment often means taking testosterone. Testosterone can be taken by young men who have a delayed onset of puberty because of low LH. It can also be taken by men who have a low sex drive or who have lost some of the defining male characteristics, such as facial hair. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, some doctors may recommend that men with low LH take gonadotropin even if they are not wanting to increase their chances of producing a baby. [13] X Research source Testosterone can be taken in shot, pill, or patch form. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Gain weight to treat anorexia nervosa.",
      "content": "Gain weight to treat anorexia nervosa. Some people develop low LH because of an eating disorder such as anorexia nervosa. You should be within 15 percent of your ideal weight to stave off low LH due to an eating disorder. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If you do have an eating disorder, reach out to a medical professional. You'll likely need a team of medical professionals helping you, including your primary doctor, a psychologist or psychiatrist, and a nutritionist. Your primary doctor can help point you in the right direction. [16] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source"
    },
    {
      "title": "Treat the underlying condition.",
      "content": "Treat the underlying condition. Many conditions can cause your LH to be low, such as overuse of opioids and steroids, issues with your pituitary gland, high levels of stress, long-term infections, and nutrition issues. Sometimes, treating the underlying condition will help with your LH levels. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Try D-aspartic acid.",
      "content": "Try D-aspartic acid. Some people have luck with taking 3 milligrams of D-aspartic acid per day. This supplement may increase the levels of LH in your body. However, only take supplements under the advice of your doctor, as anything that messes with your LH may affect your other hormones, too. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Consider chasteberry.",
      "content": "Consider chasteberry. Another supplement that may help increase your LH levels is chasteberry. This supplement may also decrease your FSH levels, though. FSH is a hormone that's important for fertility, so this supplement is likely not a good choice if you're trying to get pregnant. Ask your doctor before taking it. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}