{
  "url": "https://www.wikihow.com/Make-a-Garter",
  "title": "How to Make a Garter",
  "steps": [
    {
      "title": "Measure around the area where you want to wear the garter.",
      "content": "Measure around the area where you want to wear the garter. Wrap the measuring tape around the center of your thigh, or wherever you would like to wear the garter. [1] X Expert Source LaTricia Brown Master Tailor & Creative Director Expert Interview. 9 July 2021. Make sure that the measuring tape lays flat and is not twisted. [2] X Research source Don’t squeeze the measuring tape around your thigh! It should be snug, but not tight."
    },
    {
      "title": "Cut a piece of satin ribbon 1.5 times your thigh measurement plus 1 in (2.5 cm).",
      "content": "Cut a piece of satin ribbon 1.5 times your thigh measurement plus 1 in (2.5 cm). Multiply the measurement you got by 1.5. Then, add 1 in (2.5 cm) for your seam allowance. Cut your ribbon to this length with a sharp pair of scissors. [3] X Research source For example, if your measurement was 20 in (51 cm), then multiplying this number by 1.5 would give you 30 in (76 cm). Add an extra 1 in (2.5 cm) for a total of 31 in (79 cm)."
    },
    {
      "title": "Fold the ribbon in half and sew the ends together.",
      "content": "Fold the ribbon in half and sew the ends together. Match up the ends of the ribbon and pin them together. Then, sew a straight stitch halfway down the pinned edge. Do not sew all the way down the seam. Sew halfway down the edges of the 2 ends of the ribbon. [4] X Research source This will leave an opening that you will insert the elastic through later on."
    },
    {
      "title": "Press down the fabric on the edges of the seam and sew both sides down.",
      "content": "Press down the fabric on the edges of the seam and sew both sides down. Next, turn the fabric so that the seam is facing out. Lay the ribbon on a flat surface with the seam facing up. Then, press the ends of the ribbon down and sew a straight stitch along the raw edges of these flaps to make them lay flat. [5] X Research source You may place a pin through each of the flaps to keep them in place while you sew. Just be careful not to sew over the pins!"
    },
    {
      "title": "Fold the ribbon in half lengthwise and sew along the fold.",
      "content": "Fold the ribbon in half lengthwise and sew along the fold. Pin the ribbon to keep it folded in half. Then, sew a straight stitch along the folded edge to secure the fold. Do not sew across the pins or you may damage your sewing machine. [6] X Research source The straight stitch setting is #1 on most sewing machines."
    },
    {
      "title": "Cut out a piece of lace trim to the same length as the ribbon.",
      "content": "Cut out a piece of lace trim to the same length as the ribbon. Use the same measurement that you used to cut out your ribbon. Cut the lace to the desired length using a sharp pair of scissors. [7] X Research source Make sure to cut straight across to avoid any jagged edges!"
    },
    {
      "title": "Pin the lace along the edge of the ribbon between the front and back.",
      "content": "Pin the lace along the edge of the ribbon between the front and back. Position the flat edge of the lace trim so that it will be hidden between the 2 pieces of ribbon. Then, insert pins through the ribbon and lace trim to hold them together. [8] X Research source Insert the pins so they are perpendicular to the edges of the ribbon. This will make it easier to remove them as you sew."
    },
    {
      "title": "Sew a straight stitch along the 2 edges of ribbon and lace.",
      "content": "Sew a straight stitch along the 2 edges of ribbon and lace. Place the ribbon and lace under your presser foot and lower it. Then, apply gentle pressure to sew a straight stitch about 0.25 in (0.64 cm) from the raw edge of the ribbon. Do not sew over the opening that you left in the seam! [9] X Research source Make sure to remove the pins as you sew. Do not sew over them or you may damage your sewing machine."
    },
    {
      "title": "Cut a piece of elastic the circumference of your thigh.",
      "content": "Cut a piece of elastic the circumference of your thigh. Wrap a piece of elastic around your thigh, or wherever you want to wear the garter. Overlap the ends of the elastic by about 0.5 in (1.3 cm) on each end. Then, cut the elastic to this length. [10] X Research source You may also use your thigh measurement and add 1 in (2.5 cm) if that is easier for you."
    },
    {
      "title": "Attach a safety pin to the elastic and pin the other end to the seam.",
      "content": "Attach a safety pin to the elastic and pin the other end to the seam. Insert the safety pin into the end of the elastic and then close the safety pin. Insert a pin through the other end of the elastic to attach it to the seam. This will make it much easier to work the elastic through the opening that you left in the garter. [11] X Research source The second pin acts as an anchor to prevent the end of the elastic from going into the tube."
    },
    {
      "title": "Weave the elastic through the opening in the ribbon.",
      "content": "Weave the elastic through the opening in the ribbon. Push the safety pin into the opening, and then use your fingers to work it through the tube of ribbon. Go slowly and be careful not to open the safety pin as you push it through the tube. When the pin reaches the other end of the tube, pull it out. [12] X Research source Remember to check the end of the elastic periodically to ensure that it is still pinned to the seam and does not slip through the opening."
    },
    {
      "title": "Remove the pins and sew the ends of the elastic together.",
      "content": "Remove the pins and sew the ends of the elastic together. Take the safety pins out of the ends of the elastic while holding them securely. Then, overlap the ends of the elastic and insert a pin through the 2 pieces of elastic to keep them together. Sew a straight stitch across the 2 pieces of elastic to secure them together. [13] X Research source Trim off any excess threads using a pair of scissors. Your garter is ready to wear!"
    },
    {
      "title": "Choose 3 in (7.6 cm) wide stretch lace ribbon.",
      "content": "Choose 3 in (7.6 cm) wide stretch lace ribbon. You will need enough lace to wrap around the thickest part of your thigh 1 time with about 1 in (2.5 cm) of overlap, so you may want to measure your thigh before you buy the ribbon. [14] X Expert Source LaTricia Brown Master Tailor & Creative Director Expert Interview. 9 July 2021. Make sure that the lace is stretchy before you buy it! Non-stretch lace ribbon will not work for this project. White or off white lace makes a pretty garter. Opt for blue lace if you need something blue for your wedding ensemble! Go with black or red lace for something daring and sexy."
    },
    {
      "title": "Cut a piece of lace ribbon 1 in (2.5 cm) wider than your thigh.",
      "content": "Cut a piece of lace ribbon 1 in (2.5 cm) wider than your thigh. Wrap the ribbon around your thigh and overlap the ends by 1 in (2.5 cm). Then, mark the spot where you want to cut the ribbon with your finger. Take the ribbon away from your leg and then cut a straight line across it where you are grasping it. [15] X Research source Make sure to use a pair of sharp scissors to cut the lace! Cut straight across and be careful not to create any jagged edges."
    },
    {
      "title": "Sew sequins and beads onto the ribbon to add a decorative touch.",
      "content": "Sew sequins and beads onto the ribbon to add a decorative touch. Thread a needle with 18 in (46 cm) of thread that matches your lace ribbon. Pull the end until the 2 ends are even and tie a knot in the ends of the thread. Insert the needle through the ribbon where you want to attach a bead or sequin, and then insert the end of the needle through the bead or sequin. Pull the thread taut and then bring the needle back through the lace to the back again. [16] X Research source Repeat this as many times as you like to attach more beads and sequins."
    },
    {
      "title": "Glue rhinestones onto the ribbon for a sparkly complement.",
      "content": "Glue rhinestones onto the ribbon for a sparkly complement. To make your lace garter sparkly, apply a dot of hot glue to the back of a rhinestone. Then, press the rhinestone onto the lace ribbon where you want to add it. Hold it in place for a few seconds to ensure that it bonds with the fabric. [17] X Research source Repeat as many times as desired to add more rhinestones. Make sure to plug in your glue gun about 10 minutes before you want to use it! It will take about this long for it to warm up. [18] X Research source"
    },
    {
      "title": "Pin the ends of the ribbon together.",
      "content": "Pin the ends of the ribbon together. When you have finished decorating the lace ribbon how you want it to look, match up the ends so that the decorations are on the inside of the loop. Insert a pin through the ends of the ribbon to hold them together. [19] X Research source By pinning the ends this way, the raw edges of the ribbon will be hidden on the inside of the garter."
    },
    {
      "title": "Sew a straight stitch",
      "content": "Sew a straight stitch about 0.5 in (1.3 cm) from the raw edges. Place the ribbon ends under the presser foot on your sewing machine. Lower the presser foot and sew a straight stitch about 0.5 in (1.3 cm) from the raw edges of the ribbon. [20] X Research source Be careful not to sew over the pins or you may damage your sewing machine."
    },
    {
      "title": "Hand-sew the opening closed if you don’t want to use a machine.",
      "content": "Hand-sew the opening closed if you don’t want to use a machine. Thread a needle with 18 in (46 cm) of thread and tie a knot in the ends just as you did before. Then, insert the needle through the 2 pieces of ribbon about 0.5 in (1.3 cm) from the raw edge. Bring the needle all the way through the other side, pull it taut, and then bring it down through the lace again. Continue to sew across the edge and sew through the last stitch 3 times to secure it. Cut the thread close to the lace ribbon."
    },
    {
      "title": "Choose a wide piece of decorative elastic.",
      "content": "Choose a wide piece of decorative elastic. Visit your local craft supply store or search online to find elastic that comes in different colors and designs. Purchase elastic that is about 2 in (5.1 cm) wide. [21] X Research source You will only need enough to wrap around your thigh with 0.5 in (1.3 cm) of overlap, so measure before you go to determine how much you will need."
    },
    {
      "title": "Cut the elastic 1 in (2.5 cm) wider than your thigh.",
      "content": "Cut the elastic 1 in (2.5 cm) wider than your thigh. Wrap the elastic around your thigh or wherever you want to wear the garter. The elastic should be a little snug but not tight. Overlap the ends by 0.5 in (1.3 cm) on each end and then cut it at this point. [22] X Research source Use a sharp pair of scissors and cut straight across the elastic. Glue guns take about 10 minutes to heat up, so turn on your glue gun right when you start this craft! [23] X Research source"
    },
    {
      "title": "Glue on rhinestones, silk flowers, or other embellishments.",
      "content": "Glue on rhinestones, silk flowers, or other embellishments. Lay out the strip of elastic with the decorative side facing up. Then, choose an embellishment to add. Dispense a dot of hot glue onto the back of the embellishment and then press it onto the garter where you want it to go. [24] X Research source Add a silk rose to the center of the garter for an elegant touch. Create a row of rhinestones along 1 or both edges of the garter for sparkly finish. Glue on buttons in random spots for a fun, crafty garter."
    },
    {
      "title": "Overlap the ends of the elastic and glue them together.",
      "content": "Overlap the ends of the elastic and glue them together. When you have finished gluing your embellishments onto the garter, grasp the ends of the garter and place 1 end over the other end so that they are overlapping by about 0.5 in (1.3 cm). Apply a generous dab of glue to the top of 1 end and press the other end into it. Hold the ends together until they are secured, or about 15 seconds. [25] X Research source Your garter is now ready to wear! The garter should fit tight around your thigh without it sliding down. [26] X Expert Source LaTricia Brown Master Tailor & Creative Director Expert Interview. 9 July 2021."
    }
  ]
}