{
  "url": "https://www.wikihow.com/Hang-Garland-on-Stairs",
  "title": "How to Hang Garland on Stairs",
  "steps": [
    {
      "title": "Measure the banister to see how much garland you’ll need.",
      "content": "Measure the banister to see how much garland you’ll need. Hold the measuring tape at one end of the banister, and measure each section of the banister. Since you’ll either be draping or wrapping the garland, add about 1 foot (0.30 m) to your measurements for every 3 feet (0.91 m) of banister. [1] X Research source For example, if you have a banister that is 15 feet (4.6 m) long, you would purchase 20 feet (6.1 m) of garland."
    },
    {
      "title": "Create a classic “swag” look by letting the garland sag between spindles.",
      "content": "Create a classic “swag” look by letting the garland sag between spindles. Interior designers use this look often because it’s very classic and reminds many people of the holidays! Secure the garland at every third or fourth spindle and let it sag between those points. The dips in the garland are called swag! The amount of swag in between each point depends on your preference. You can make the drops as large and dramatic or as small and quaint as you’d like! Larger drops between the points will use more garland, so make sure you have enough on hand if you’re planning on going for a dramatic look."
    },
    {
      "title": "Wrap the garland around the banister for a festive holiday look.",
      "content": "Wrap the garland around the banister for a festive holiday look. Many people use this method because it helps to make a typically not-festive part of the house very festive! Wrap the garland tightly between every baluster, or keep it loose for a more laid-back look. This method does restrict the use of the handrail, so be careful when using the stairs!"
    },
    {
      "title": "Lay the garland straight along the banister for an easy decorating trick.",
      "content": "Lay the garland straight along the banister for an easy decorating trick. This method is easy, quick, and uses the least amount of garland. Simply lay the garland on top of the banister and secure it at either end. The garland will also cover the handrail, but you can still carefully grab onto it if needed."
    },
    {
      "title": "String the garland at the bottom of the spindles for for a modern look.",
      "content": "String the garland at the bottom of the spindles for for a modern look. Run the garland opposite of the handrail, on the lower part of the spindles. Be sure to weave the garland in and out of the spindles to secure it along the floor. Lowering the garland allows for more use of the hand rail, but still makes your stairs look festive! For a fuller look, weave two strands of garland in opposite directions to completely cover the bottom of the spindles. Be careful when walking on the stairs, especially if you have children. Decorations from the garland can easily fall off onto the stairs and cause you to trip."
    },
    {
      "title": "Secure one end of the garland to the end of the banister with a zip tie.",
      "content": "Secure one end of the garland to the end of the banister with a zip tie. Place one end of the garland at the top of your staircase. Wrap a zip tie around the end of the garland and the banister and pull it tight. [2] X Research source Many stores sell special hook-and-loop fastener for hanging garland. It tends to be more expensive and zip ties can accomplish the same thing! Some stores sell green zip ties as a seasonal item. Keep an eye out in the holiday decor section! Be sure to leave a tail at the end of the garland so that it doesn’t slip through the zip tie. Your tail can be long for a more dramatic look, or short for a cleaner look!"
    },
    {
      "title": "Attach the garland to the banister with a zip tie every 2 ft (0.61 m).",
      "content": "Attach the garland to the banister with a zip tie every 2 ft (0.61 m). Place the zip ties every few feet to ensure that the garland won’t fall down, and make sure they’re secured tightly! [3] X Research source If your garland is heavily decorated, you may need more than one zip tie to hold it in place and keep it from falling."
    },
    {
      "title": "Clip off the ends of the zip ties with a pair of sharp scissors.",
      "content": "Clip off the ends of the zip ties with a pair of sharp scissors. Once all of your garland has been secured to the banister, go back and snip off all of the ends of the zip ties so that they aren’t sticking out from the banister. Try to cut them as close to the “lock” as possible, and then spin them around the banister so that the lock and part you just cut are hidden in the garland. [4] X Research source Dull scissors probably won’t work for cutting the thick plastic, so use a pair of sharp kitchen or floral scissors."
    },
    {
      "title": "Cover the zip ties with floral wire or tape.",
      "content": "Cover the zip ties with floral wire or tape. If the appearance of the clear or colored zip ties on the banister bothers you, use green floral wire wrapped around the zip ties to conceal them. Alternatively, you can use green floral tape wrapped around the zip ties, but be sure you don’t tape onto the banister, as it can cause discoloration! [5] X Research source You may need to cut off the ends of the floral wire with your scissors so they aren’t sticking out from the garland."
    },
    {
      "title": "Wrap lights around the garland for a festive look.",
      "content": "Wrap lights around the garland for a festive look. Before hanging the garland, string lights around the boughs to create a lighted focal point on the stairs. If you’ve already hung the garland, you can drape the lights over and around the boughs for a more casual look. [6] X Research source If you don’t want to bother with hiding the wires of the lights, use battery-operated fairy lights, which tend to come on a thin, metal wire that’s easy to conceal in the branches."
    },
    {
      "title": "Tie bows",
      "content": "Tie bows around the zip ties to conceal them. This is a great and festive way to hide zip ties. Use ribbon to tie large bows on the places where the garland is secured to the banister. [7] X Research source Your bows can be as small or as large as you’d like. Larger bows tend to look more dramatic and will complement garland that has large dips. Choose colors like silver, gold, red, blue, or white to complement the season and stick out from green garland."
    },
    {
      "title": "Spray flocking powder on the garland to give the appearance of snowfall.",
      "content": "Spray flocking powder on the garland to give the appearance of snowfall. Most craft stores sell fake snow in spray cans during the holidays. Take the garland outside and spray the entire length with the “snow,” focusing mostly on the ends of the branches. Let the flocking powder dry for an hour before hanging the garland on the stairs. [8] X Research source Never spray the garland in the house! The wet flocking will get everywhere and can stain the banister or your floors. You might have some shedding from the garland as people brush against them. If you’re worried about shedding, spray any brand of extra-strength hairspray over the garland to seal the “snow” in place."
    },
    {
      "title": "Hang ornaments on the garland to coordinate with your tree.",
      "content": "Hang ornaments on the garland to coordinate with your tree. Use ornament hooks to secure the ornaments in clusters of 3 or 4 bulbs of varying sizes. Simply thread the hook through the top of the bulb and then hook the bulb onto a piece the garland. Wrap the hook around the garland a few times for added security. [9] X Research source Pick bulbs of a similar color scheme to coordinate with the rest of your decorations! You could also decorate the garland with pine cones. Wrap wire or twine around the pine cone, then tie it to the garland or banister. Make sure the bulbs or pine cones are attached to the garland well, as they can fall when bumped. It might be helpful to wrap the hooks around the garland a few times to make sure they won’t fall."
    }
  ]
}