{
  "url": "https://www.wikihow.com/Make-Your-Ex-Miss-You",
  "title": "How to Make Your Ex Miss You",
  "steps": [
    {
      "title": "Don't initiate contact.",
      "content": "Don't initiate contact. As a general rule, you should wait 2 weeks to a month before making any contact with your ex . Making contact first and making contact quickly will send the message that you miss your ex, which, oddly enough, is not the message you want to send in order to make your ex miss you in return. In addition, staying in contact with the person does not give your ex a chance to miss you because are still chatting. [1] X Research source At the start of a breakup, your ex might feel confident that you will cave in and be the first to call. After a week or two passes without word from you, your ex will start wondering why you have not called and may even start to feel angry. After another week or two, you will be on your ex's mind so much that he/she might be willing to acknowledge that he or she misses you."
    },
    {
      "title": "Do not call or text your ex back.",
      "content": "Do not call or text your ex back. Within the first few weeks of your breakup, you should not return your ex's calls even if he/she contacts you first. Your ex might call you looking for a quick, temporary fix to get himself or herself through the initial hurt. However, if you want your ex to really, honestly miss you, you need to drag out the waiting period longer so that stronger feelings of nostalgia can form. [2] X Research source"
    },
    {
      "title": "Consider leaving town.",
      "content": "Consider leaving town. One way to completely cut ties is to take a vacation . That way, you can't just run into your ex somewhere. In addition, it'll give you the break you need. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Take some time to pull yourself together.",
      "content": "Take some time to pull yourself together. Another reason to cut ties is you need time to heal . If you broke up, you're obviously upset. You need time to evaluate what went wrong, especially if you are trying to get back together, and taking a step away from the other person can give you the time you need. [4] X Research source Sometimes people get pulled apart and then are pulled back together. If a relationship did not work, there may have been issues and problems in that relationship. So the partners need to get therapy or read books to learn how to interact, listen, communicate better, and have boundaries. During this month, get out of the house. Go do something you enjoy, by yourself or with friends . Get used to being independent and single. Regaining your independence can help you bring a new perspective to the relationship if you do get back together. [5] X Research source In addition, you'll be happier and healthier, making your ex miss you more."
    },
    {
      "title": "Do not stalk your ex.",
      "content": "Do not stalk your ex. If you're stalking the person, you're not taking the space you need. Plus, if you get caught, you look desperate, which is not an attractive quality. You'll likely push your ex farther away rather than make him or her miss you. [6] X Research source Stalking includes “real world” stalking (sitting outside your ex's home when you know he/she might be returning or leaving, calling at 3 AM without saying a word, following your ex around town) and cyber stalking (obsessing over new photos of your ex's social media accounts, secretly snooping around an email that you discovered the password to, and so on)."
    },
    {
      "title": "Don't acknowledge your sadness.",
      "content": "Don't acknowledge your sadness . That is, don't be sad on social media where your ex can see you. In fact, don't talk about the breakup at all. Eventually, the silence will get the better of your ex, and your ex will start to miss you."
    },
    {
      "title": "Make new friends.",
      "content": "Make new friends . Getting new friends will help you feel confident and strong, plus it will give you a chance to change and grow. In addition, it will show your ex that you can create a social life without him. If you had the same friends before you broke up, any sadness you show around them may get back to your ex, and it's harder to cut ties if you're constantly hanging out with the same people."
    },
    {
      "title": "Feel free to date.",
      "content": "Feel free to date . You have the right to see whomever you want now, so feel free to go out on dates. In addition, if the information happens to get back to your ex, all the better. Your ex may find that he misses you more than he thought. [7] X Research source Also, you might even find the beginnings of a new love and realize that you are not as desperate for your ex to miss you or want you back."
    },
    {
      "title": "Take up a hobby.",
      "content": "Take up a hobby . You need to feel happy about your life again. You also want your ex to miss you. The more well-rounded you are, the more interesting you are as a person. If your ex sees you doing something new, she may miss you more. [8] X Research source This technique could cause your ex to feel jealous of how much fun you are having without him/her. This action also causes the familiar to become unfamiliar. By expressing attractive, fun-loving sides of yourself that your ex may never have seen, you might cause your ex to wish she was still around to see them."
    },
    {
      "title": "Focus on your health.",
      "content": "Focus on your health . After a breakup, you might feel tempted to let yourself go and indulge in comfort foods that are bad for your body. Do not cave in. Instead, make yourself eat healthier foods, and take the time to exercise. You'll feel better, and you'll look better, whether you lose weight or not, which may cause your ex to miss you. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Treat yourself to a new look.",
      "content": "Treat yourself to a new look. You do not need a completely new wardrobe or a total makeover to get a new look. Just try a different haircut or pick out a jacket that's a bit different than you normally wear. Even adding a different style scarf can make you look a little bit different and feel confident. Getting a new look may make your ex jealous by itself, but it will also give you more confidence, which will certainly make your ex miss you more. The key is to avoid going crazy with it. You can spice up your look a little to put a little pep in your step and to give your ex something good to look at and long for, but if you go into debt trying to redo yourself, you will regret it. Also, right now is not the time to make drastic decisions about your body. Avoid any kind of plastic surgery, and take a little while to think before getting a tattoo."
    },
    {
      "title": "Be yourself.",
      "content": "Be yourself . When the time comes for you to cross paths again, be polite. Smile, and speak warmly. You will remind your ex of your good points while also suggesting to her that you are no longer deeply affected by the breakup."
    },
    {
      "title": "Try a text first.",
      "content": "Try a text first. A text is a good way to start contact again. It doesn't have the pressure of a phone call, and it gives your ex a chance to respond in his or her own time. [10] X Research source"
    },
    {
      "title": "Start with substance.",
      "content": "Start with substance. When you do decide to contact your ex, send a message or start with a conversation that has a bit of substance to it. After ignoring your ex for a month, your first bit of contact needs to seem comfortable, not awkward. [11] X Research source For example, you could say something like, “I saw that there was going to be a sequel to This-And-That-Movie. I know how much you loved the first one, and I immediately thought of you when I heard the news.” You could also try something like, “I heard your favorite song on the radio today and thought of you. It actually made me smile, just so you know.\" Reminding him or her of the good times will cause your ex to miss you more. [12] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Break into a conversation about the good ol' days.",
      "content": "Break into a conversation about the good ol' days. After you have begun talking casually again, mention a fond memory that will remind your ex about the good aspects of your relationship. Bringing up the good times will help him remember why he fell in love with you in the first place, increasing how much he or she misses you. [13] X Research source Consider something along the lines of, “Remember when we tried to go to that fancy restaurant, but ended up getting lost on the way there? I can't believe we missed that reservation, but I'm glad we did. Eating hot dogs on the beach with you is one of my favorite memories.\""
    },
    {
      "title": "Act like the person your ex fell for.",
      "content": "Act like the person your ex fell for. When you first met your ex, you probably acted differently than you did by the time your relationship ended. By acting like the person your ex fell for, you have a better chance at swaying his or her emotions back toward affection. That is, try to recapture that initial chemistry by showing her the person you were, that laid-back and fun person who may have gotten lost in the shuffle of your relationship. [14] X Research source Of course, the effectiveness of this tactic will depend on how different you were while you were dating. If you were more attentive while trying to woo your ex but a little less so during the relationship, this tactic may work. However, if your behavior did a complete 180 and you changed from a sweet person to a verbally or physically abusive person, this tactic will probably only remind your ex of how crazy the change was."
    },
    {
      "title": "Play it cool.",
      "content": "Play it cool. Even after you initiate contact again, you should avoid communicating with your ex obsessively. Make sure that your ex knows how much you miss him/her, but do not seem desperate about staying in your ex's life. You want to remind your ex why he or she liked you, but you also want to still give the person space to miss you. Try this rule of thumb: let your ex contact you twice as much as you are contacting him or her."
    },
    {
      "title": "Show pictures of your new life.",
      "content": "Show pictures of your new life. Once you begin contact again, feel free to share pictures of your new life with your ex. Of course, the best route to share them is likely more subtle than just sending them in a text message; try posting them on social media, as long as your ex is still friends with you. If not, you can occasionally send him or her a text of what you're doing. [15] X Research source"
    },
    {
      "title": "Show you care on special occasions.",
      "content": "Show you care on special occasions. Remembering special dates, like your ex's birthday or Christmas, is a good way to be subtle about expressing affection. These small gestures can let your ex know that he/she is still on your mind without making it seem like your ex is the only thing you think about. When taking special considerations into account, it is better not to include any of your anniversaries among them. Keep your gestures small. A card on Christmas or a birthday works well, but pricey tickets to a sports game or expensive jewelry is coming on too strong."
    },
    {
      "title": "Don't beg for attention.",
      "content": "Don't beg for attention. Jealousy can work to your advantage if done right, but too often, people are too obvious in their attempts to make another person feel jealous. If you're doing something just because you know it will catch your ex's eye, it is likely that you will come off as desperate. For instance, don't date someone your ex knows just to make your ex mad."
    }
  ]
}