{
  "url": "https://www.wikihow.com/Install-Microsoft-Office-2007",
  "title": "How to Install Microsoft Office 2007",
  "steps": [
    {
      "title": "Purchase Microsoft Office 2007 on CD.",
      "content": "Purchase Microsoft Office 2007 on CD. Since Microsoft no longer supports Office 2007, it's not possible to purchase it from them online. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source What you can do is buy Office 2007 Home & Student or Professional on CDs from an online retailer—as of August 2020, there are many retailers offering the physical discs for sale on Amazon and eBay. You can also try local computer stores that sell used software. Before ordering Office 2007 online, make sure you'll be receiving physical discs that come with a valid 25-digit product key. Do not buy a product key from anyone separately, as these are often stolen. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Always read a seller's reviews before making an online purchase."
    },
    {
      "title": "Insert the Microsoft Office 2007 setup disc into your PC's optical drive.",
      "content": "Insert the Microsoft Office 2007 setup disc into your PC's optical drive. If there are multiple discs, insert the one that says something like \"Installation\" or \"Disc 1.\""
    },
    {
      "title": "Press ⊞ Win+E to open the File Explorer.",
      "content": "Press ⊞ Win + E to open the File Explorer. You can also open the File Explorer by right-clicking the Start menu and selecting File Explorer ."
    },
    {
      "title": "Navigate to the CD-ROM drive.",
      "content": "Navigate to the CD-ROM drive. If you see your CD-ROM drive in the right panel, double-click it to open it. If not, scroll down the left panel until you find the CD-ROM drive under \"This PC\" or \"Computer,\" and then click it to view its contents in the right panel."
    },
    {
      "title": "Double-click the Setup.exe file to run it.",
      "content": "Double-click the Setup.exe file to run it. It'll be in the root folder of the Office 2007 CD. This launches the installer wizard."
    },
    {
      "title": "Enter your 25-character Product Key and click Continue.",
      "content": "Enter your 25-character Product Key and click Continue . This product key is usually on a sticker on the CD case, but it may also be on your receipt (check the email receipt if you ordered online). If you've installed Office 2007 on the same computer in the past, you may find an Office product key on a Certificate of Authenticity sticker on the PC itself."
    },
    {
      "title": "Accept Microsoft's license terms and click Continue.",
      "content": "Accept Microsoft's license terms and click Continue . You'll have to check the box next to \"I agree\" to accept the terms."
    },
    {
      "title": "Follow the on-screen instructions to install Office.",
      "content": "Follow the on-screen instructions to install Office. The process may take several minutes to complete."
    },
    {
      "title": "Click Close when the installation is complete.",
      "content": "Click Close when the installation is complete."
    },
    {
      "title": "Open Microsoft Word 2007.",
      "content": "Open Microsoft Word 2007. Now that the software is installed, you'll need to register it online an Office app. You can use Word, PowerPoint, Excel, or Access, and you'll find all of these in the Microsoft Office 2007 group in the Start menu."
    },
    {
      "title": "Activate Office 2007.",
      "content": "Activate Office 2007. Although you've already entered your product key, now you'll need to validate it online. Once your key is accepted, you can use all Office 2007 apps without limitations. To register: Click the Office button, which is the round button near the top-left corner of the app. Click Options on the menu. Click Activate Microsoft Office . Follow the on-screen instructions."
    }
  ]
}