{
  "url": "https://www.wikihow.com/Iron-Rayon",
  "title": "How to Iron Rayon",
  "steps": [
    {
      "title": "Spray the garment with water.",
      "content": "Spray the garment with water. You can iron rayon when it is dry, but it’s easier to do it while the fabric is damp. If your garment is already damp from the wash, then you don’t have to do anything. If it is dry, spray it with a bottle filled with clean water. The rayon doesn’t have to be very wet. It should just be slightly wet to the touch. [1] X Research source"
    },
    {
      "title": "Turn the garment inside out.",
      "content": "Turn the garment inside out. The rayon can be damaged if you iron it right side out. At the very least, the fabric will become shiny if it makes direct contact with the iron. Always turn the fabric inside out unless you have a pressing cloth between the iron and rayon. [2] X Research source If you are starting with a dry garment, you can use a spray bottle to dampen it."
    },
    {
      "title": "Put a press cloth between the iron and rayon if you iron it right side out.",
      "content": "Put a press cloth between the iron and rayon if you iron it right side out. If you must iron the fabric right side out, you will need to have something on top of the rayon. You can buy a pressing cloth, or simply use a piece of unbleached or white cotton muslin. Always use the pressing cloth when ironing rayon right side out."
    },
    {
      "title": "Turn the iron to a low setting.",
      "content": "Turn the iron to a low setting. Rayon is a sensitive fabric, so it can’t handle high heat. Use a low heat setting when ironing your garment. The wool setting is usually a good option for rayon fabric."
    },
    {
      "title": "Iron in small portions.",
      "content": "Iron in small portions. Rayon is easily stretched out, especially when the fabric is hot. Ironing the rayon in large portions can contribute to the rayon stretching out. Iron one small portion of the rayon at time until you have ironed the entire garment. [3] X Research source"
    },
    {
      "title": "Keep the iron moving as you go over the rayon.",
      "content": "Keep the iron moving as you go over the rayon. Because rayon is easy to iron, you don’t have to press down for a long time. You should gently press the iron on the fabric and move it in a smooth, steady motion. [4] X Research source"
    },
    {
      "title": "Use steam if there’s a tough crease.",
      "content": "Use steam if there’s a tough crease. As mentioned, rayon is sensitive and pretty easy to iron. You can use steam when doing a routine ironing, but it isn’t necessary. Ideally, you should only use steam if there’s a tough crease you’re trying to work out."
    },
    {
      "title": "Let the fabric cool before moving it.",
      "content": "Let the fabric cool before moving it. Since rayon can easily be stretched out, you shouldn’t move it while it is still hot from the iron. Give the fabric a few minutes to completely cool down. Then, you can hang it up or store it away."
    },
    {
      "title": "Hang the garment on a non-metal hanger.",
      "content": "Hang the garment on a non-metal hanger. Metal hangers can leave rust spots on the fabric over time. Plus, the rayon will probably slip off of a metal hanger. Instead, hang the garment up on any type of non-metal hanger with a solid grip. [5] X Research source"
    },
    {
      "title": "Store the rayon in a sealed tub when not regularly wearing it.",
      "content": "Store the rayon in a sealed tub when not regularly wearing it. Rayon is an edible fabric that easily attracts bugs. If you won’t be wearing your rayon for a while, store it in your closet in a sealed, plastic tub or space-saving bag. Use cedar bags or lavender sachets to keep the fabric fresh."
    }
  ]
}