{
  "url": "https://www.wikihow.com/Learn-to-Play-an-Instrument",
  "title": "How to Learn to Play an Instrument",
  "steps": [
    {
      "title": "Get to know the different families of musical instruments.",
      "content": "Get to know the different families of musical instruments. Musical instruments are categorized in families. Often, learning how to play one instrument in a family makes it easier to learn other instruments in the same family. [2] X Research source The strings family includes the violin , viola , cello , double bass, as well as the guitar (both acoustic and electric) and the ukulele . The ukulele is relatively easy to learn and can serve as a gateway to learning other stringed instruments. Some orchestras and groups also include a harp. Though it isn’t part of the “violin family” (instruments with that type of shape), it still adds a lot to the orchestra. The brass family includes the trumpet , trombone , and tuba . The woodwind family includes the flute , oboe , clarinet , and bassoon . The keyboard family includes the piano , organ , and harpsichord. The percussion family includes all drums , cymbals, and maracas. Bongo drums are considered relatively easy percussion instruments to learn. The xylophone or glockenspiel is also a relatively easy percussion instrument."
    },
    {
      "title": "Decide which genre of music you'd like to play.",
      "content": "Decide which genre of music you'd like to play. Many different instruments are associated with a particular genre of music. If you know what type of music you'd like to play, you can better narrow down what instruments you're interested in learning. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source For example, the guitar is a prominent instrument in rock and pop music. You can also play many rock and pop songs on the ukulele. If you enjoy country or bluegrass music, on the other hand, you might want to try the banjo or the violin. A violin and a country \"fiddle\" are the same instruments, although the style of play is very different. A piano or keyboard is a versatile instrument associated with many different genres, including rock, jazz, and classical. If you have more varied interests and want to learn several different styles of music, piano would be a good instrument choice."
    },
    {
      "title": "Connect to your ethnic culture with a traditional instrument.",
      "content": "Connect to your ethnic culture with a traditional instrument. Traditional ethnic music is often played on distinct instruments that aren't used in any other setting. If you're interested in exploring your ethnic roots or learning more about your cultural traditions, you might try a traditional instrument. [4] X Research source For example, if you are Indian, you might want to learn the sitar . On the other hand, if you have Scottish ancestors, you might want to give bagpipes a try. If you have a Polish background, you might want to learn how to play the accordion so you can learn some traditional polka tunes."
    },
    {
      "title": "Evaluate the relative popularity of the instrument.",
      "content": "Evaluate the relative popularity of the instrument. Choosing a more popular instrument may mean you face stiffer competition if you want to try out for a band or orchestra. At the same time, sometimes learning a less popular instrument in the same family will make it easier to learn that other instrument later on. For example, the violin is a popular instrument and young violinists always face stiff competition when trying out for school orchestras. However, many of these same school orchestras don't have enough students who play the viola. You might also think about accompanying instruments. For example, if you want to learn how to play the bagpipes and don't live near an active Scottish community, you might have a hard time finding other people to play with."
    },
    {
      "title": "Visit a music store to try instruments you're curious about.",
      "content": "Visit a music store to try instruments you're curious about. Before you make a final decision on which instrument you want to play, take some time to actually pick one up and hold it. Even though you don't know how to play it, you can still get an idea of whether it's right for you. Employees at music specialty stores typically have a musical background and play multiple instruments. They can talk to you about learning the instrument and give you a better idea of what to expect if you want to take it up, or you could go to a store with a friend who already plays an instrument, to easily know what to look for in an instrument."
    },
    {
      "title": "Watch musicians playing the instrument live.",
      "content": "Watch musicians playing the instrument live. Try a small show or an open mic night where you can watch the performance up close and see people play who are at different levels of mastery. Watching skilled musicians perform can give you a better idea of what you can do with the instrument or you could watch YouTube videos of established musicians who play in shows or events. In a smaller setting, you may also be able to talk to the musicians. Ask them what their favorite (and least favorite) things are about the instrument, why they picked that particular instrument, and if there are any other instruments they play."
    },
    {
      "title": "Research maintenance and ownership costs for the instrument.",
      "content": "Research maintenance and ownership costs for the instrument. The initial purchase price of an instrument can be a relatively small investment in comparison to how much it costs to keep and maintain it. Take these costs into account before you dedicate yourself to a particular instrument. An employee at a music store or a skilled musician can help you understand the true cost of owning that particular instrument. Costs aren't solely financial. Factor in whether you have the space to store the instrument properly, how you can transport the instrument if you need to, and whether your practicing will disturb others. For example, if you live in a small apartment surrounded by neighbors, you likely wouldn't want to take up a loud instrument, such as the trumpet. In that situation, an electronic keyboard or electric guitar would be a better option because you could play with headphones."
    },
    {
      "title": "Find an instrument that is the right size for you.",
      "content": "Find an instrument that is the right size for you. Many instruments come in different sizes to accommodate people of all ages and statures. When choosing the right instrument, consider your finger size, hand span, and the relative strength in your arms (especially if you'll have to hold the instrument while you play it). [5] X Research source Wind and brass instruments typically aren't suitable for younger players. Until your adult front teeth come in (upper and lower), you won't have the strength to hold the instrument in your mouth. If you're a younger musician, considering renting or borrowing an instrument rather than buying so you can trade it in for a larger size as you grow."
    },
    {
      "title": "Purchase your instrument and any necessary accessories.",
      "content": "Purchase your instrument and any necessary accessories. There are many beginner's kits available for different instruments that come with any necessary accessories you might need. Make sure you have everything you'll need to play and maintain the instrument, even if you won't necessarily use all the accessories right away. For example, if you've decided to learn to play the ukulele, you'll need a case for your ukulele and maybe some extra strings, but that's about it. On the other hand, if you've decided to pick up the guitar, you'll need a case, guitar picks of different weights and thicknesses, extra strings, a string winder, a tuner, and a capo. While it doesn't necessarily have to be top-of-the-line, make sure to buy an instrument of good quality. A poor quality instrument may easily fall out of tune, have a flat tone, or be more difficult to play."
    },
    {
      "title": "Sit or stand with proper posture.",
      "content": "Sit or stand with proper posture. If you're sitting to play an instrument, sit on the edge of a chair or bench with your feet flat on the floor. Keep your back straight and your shoulders relaxed so that your shoulder blades are tucked along either side of your spine. When standing, retain the same upper body posture as when you're sitting. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Slouching or hunching over when you're playing a musical instrument can lead to back pain and even injury. Poor posture also makes it more difficult to play your instrument, particularly when you start learning more advanced techniques. Check online for specifics on how to sit or stand while playing your particular instrument. You can also ask a local music instructor to give you tips on proper form."
    },
    {
      "title": "Hold your instrument correctly.",
      "content": "Hold your instrument correctly. If you're playing an instrument that you hold in your hands or strap to your body, learn the correct way to hold it from the beginning so you don't pick up any bad habits. Check online or talk to a local music instructor to learn how to hold your particular instrument like trumpet, trombone , tuba, flute, violin etc. Holding an instrument incorrectly can affect the instrument's tone, make it more difficult to play, and eventually lead to repetitive motion injuries. When you're just starting out, holding your instrument correctly may feel weird. With time it will come to feel more natural. Keep your muscles relaxed as you hold your instrument. Any tension will make it more difficult to play your instrument, as well as cause physical strain."
    },
    {
      "title": "Make your instrument produce a sound correctly.",
      "content": "Make your instrument produce a sound correctly. Before you learn how to play music , you need to learn how to make the instrument produce sound. With some instruments, such as a piano or keyboard, this is relatively easy – you simply press a key. Others, such as woodwinds and brass instruments, may take some time to figure out how to get the sound right. However, remember to keep the flow of the sound, in that you switch intervals in between playing one note correctly and playing two or more notes together correctly. This will boost learning and confidence. Before you get into making music, become familiar with your instrument and the different types of sounds it can make. For example, you can strum or pluck guitar strings to make a sound, but you can also rap your hand or fingers on the guitar's body to make a percussive sound. Different areas of the guitar's body will produce different tones, so don't be too fixed in playing one part of the guitar. Switch it up from time to time. Have fun with your instrument at this stage and don't get discouraged if the sounds you're producing aren't particularly pleasing to your ears. You'll get better with practice."
    },
    {
      "title": "Pick up your first notes, chords, or beats.",
      "content": "Pick up your first notes, chords, or beats. Some instruments, such as the piano and the guitar, can play both individual notes and chords – depending on the style of music you're playing. However, most instruments, including the saxophone or the trombone, can only play one note at a time. Look for a simple melody to start playing your first notes. [7] X Research source The simple songs you play don't have to be something as boring as \"Mary Had a Little Lamb\" or \"Twinkle Twinkle Little Star.\" Some simple melodies include themes from video games and TV shows, also don't be afraid or reluctant to make up your own songs. If you find two or more notes sounding good together, keep playing until you have a song or at least an interesting sound. If you're learning guitar or ukulele, do an internet search for \"3 chord songs\" or \"4 chord songs\" to find dozens of songs that you can start playing right away, even if you only know a few chords. [8] X Research source For percussion instruments, do an internet search for classic beats or fills to play on your particular instrument. You can also start by putting on a song you like and drumming out the beat as you listen. Don't worry about trying to mimic a professional drummer – start with a simple, stripped down beat and build from there."
    },
    {
      "title": "Hire a teacher to help guide your learning.",
      "content": "Hire a teacher to help guide your learning. A teacher can prevent you from developing bad habits and keep you accountable for your practicing and your progress. A good teacher will also help motivate you when you're having difficulty. If you're in school, you may be able to take a class offered by your school. If you're not in school (or if your school doesn't offer instruction in your instrument), find out if there are schools near you with group classes. Group classes are typically less expensive than individual private lessons. If there is a school of music near you, check to see if any students also offer lessons. Many music students offer private lessons to beginners to make a little extra money while they're in school, and they'll typically have lower rates than professional teachers. You can also search for music teachers near you online, or ask people you know who play the same instrument for recommendations. Some music teachers also post advertisements at music stores."
    },
    {
      "title": "Use online resources if you can't find a teacher.",
      "content": "Use online resources if you can't find a teacher. If there aren't teachers of your instrument near you or you can't fit the expense of a teacher into your budget, you can still learn to play an instrument. There are numerous free resources online, as well as apps you can download on your smartphone or tablet. [9] X Research source For example, if you're learning piano, you might try Zebra Keys or Piano Nanny. For budding guitarists, Justin Guitar provides video tutorials, articles, and other resources. Some apps require a subscription or only allow minimal access for free. However, you can still use them as a starting point even if you can't afford to add the premium content."
    },
    {
      "title": "Start practicing scales.",
      "content": "Start practicing scales. Scales are the building blocks of music. Whether on a guitar , piano, or other instrument, when you practice scales, you learn how to play notes on your instrument as well as how those notes relate to one another. Although it may seem boring, if you don't master scales you won't have the proper foundation to be a strong musician. [10] X Research source You can practice other skills and techniques while playing scales to make the exercise a bit more interesting. For example, if you're learning to play the violin or any other instrument that is played with a bow, you could try to play the entire scale with one bow stroke."
    },
    {
      "title": "Keep your instrument in tune.",
      "content": "Keep your instrument in tune. If your instrument is out of tune, nothing you play will sound right. For the beginner, there are websites you can visit or free apps you can download to your smartphone that will help you tune your instrument. Make a habit of tuning your instrument every time you play it. Some instruments, such as electronic keyboards, will never go out of tune. Others, especially stringed instruments, such as guitars and violins , need to be tuned every time you play – sometimes more than once in a single practice session or performance. Even drums need to be tuned periodically to ensure they maintain the proper tone. If you have a piano , you likely won't be able to tune it yourself. Hire a piano tuner to come out at least once a year – maybe more frequently if you play every day, or if you have an older piano."
    },
    {
      "title": "Set a goal for playing your instrument.",
      "content": "Set a goal for playing your instrument. A goal gives you something concrete to work toward and can make you more motivated. Find a realistic goal that you can achieve with practice and training within a few months. [11] X Research source Make your goal as specific and attainable as possible. For example, perhaps your goal is to join your high school's band. If you start playing your instrument in the spring and practice each day, you may be ready to audition for the band in the fall. Having someone else involved in your goal helps keep you accountable. For example, if your goal is to learn how to play your favorite song, offer to play it for a friend after you've learned it."
    },
    {
      "title": "Designate a specific practice area.",
      "content": "Designate a specific practice area. Ideally, choose a quiet, private area with few distractions where you can practice. Set up everything you need for practice so all you have to do is enter the space to start practicing your instrument. [12] X Research source This may be more difficult if your instrument is in a communal place. For example, if you're learning piano and the piano is in the living room, you don't have much choice for your practice area. In this situation, set a specific time when you will practice and ask others to stay out of the room as much as possible. Music schools have practice rooms available for students and may open these rooms up to the general public. If there's a music school near you, call and find out if you can access their practice rooms."
    },
    {
      "title": "Schedule 30-minute practice sessions 3 to 5 days a week.",
      "content": "Schedule 30-minute practice sessions 3 to 5 days a week. Try to practice at the same time each day so practicing your instrument becomes habitual. Ideally, you should practice every day, but you may need to work up to that. [13] X Research source With daily practice you'll retain more information and won't feel like you're starting over again with each practice session. Learning to play an instrument requires discipline. Be prepared to take out your instrument on days that you don't particularly feel like playing."
    },
    {
      "title": "Start each practice session with a brief warm-up.",
      "content": "Start each practice session with a brief warm-up. Playing a musical instrument can be physically demanding as well as mentally challenging. Do a few stretches or brief exercises to warm up the joints and muscles you'll use while playing. [14] X Research source A good warm-up can also reduce your risk of repetitive motion injuries, which are common among experienced musicians who've been playing for many years. There are many videos available online that show exercise and stretching techniques, particularly to limber up your fingers and hands."
    },
    {
      "title": "Focus on a single song each week that you want to learn.",
      "content": "Focus on a single song each week that you want to learn. Plan your practice sessions at the beginning of each week so you can get the most out of your time. When you're just starting out, it may take you a whole week to learn a single song. When you get better, you may find that you can learn a song in a single practice session. [15] X Research source Avoid repeating the same mistakes – this reinforces bad muscle memory and will make it harder for you to play the song correctly. If you find yourself missing the same notes or beats, play the brief sequence slowly with the correct notes. Gradually increase your speed until you can play it correctly at the right tempo. Don't be afraid to practice a song out of order or focus on the end before the beginning. If a particular part of the song is challenging for you, you may want to work on that first before you tackle the easier parts."
    },
    {
      "title": "Include time for honing fundamental playing skills.",
      "content": "Include time for honing fundamental playing skills. After practicing the piece you're working on, spend the next 10 minutes of your practice playing scales or learning new techniques. Even when you start to get comfortable playing music you enjoy, you won't get any better if you neglect the fundamentals. [16] X Research source For example, if you're learning violin, you may want to try some drills to improve your bowing technique. If you've decided to learn how to read music, you might want to spend this block of time sight-reading music or working out of a music theory workbook."
    },
    {
      "title": "End each practice session with something fun.",
      "content": "End each practice session with something fun. Spend the last 10 minutes of your practice session doing something you enjoy doing. This will help remind you why you wanted to learn to play the instrument in the first place. Taking some time to have fun can be especially helpful if you've had a challenging or frustrating practice session. [17] X Research source Your fun time doesn't even necessarily need to be spent playing your instrument. For example, you may want to watch a video of your favorite musician playing the instrument."
    },
    {
      "title": "Clean and store your instrument correctly after each practice session.",
      "content": "Clean and store your instrument correctly after each practice session. Wipe down your instrument after playing and return it to its case. Keep your instrument out of direct sunlight or high levels of humidity. Dry the inside of brass or woodwinds instruments carefully. If they are left damp, they could become unplayable. Don't place books or other objects on top of the case, even if it's a hard case. The weight could damage your instrument."
    },
    {
      "title": "Teach yourself how to read music notation.",
      "content": "Teach yourself how to read music notation. It isn't strictly necessary to know how to read music to play an instrument. There are many famous musicians who never learned how to read music and play by ear. However, if you know how to read music you'll have a much easier time learning new songs. Music notation is written on staff paper with 5 lines and 4 spaces in between. Each note sits on the line or space that corresponds with the tone of that note. There are 2 sets of lines representing the treble clef and the bass clef – the higher notes and the lower notes. Use mnemonic devices to remember the names of the notes and the order they appear on the staff. For the treble clef, the spaces spell the word FACE from bottom to top. The lines are EGBDF from bottom to top. Think of the sentence \"Every Good Boy Does Fine\" (or you can make up your own sentence that you might remember better, like “Every Good Burger Deserves Fries”). For the bass clef, the spaces are ACEG from bottom to top (\"All Cows Eat Grass\"). The lines are GBDFA (\"Great Big Dogs From Alaska\")."
    },
    {
      "title": "Join a band or start your own.",
      "content": "Join a band or start your own. Once you have the basics down and can play a few songs, sharpen your skills by playing with others. If you're in school, you may be able to join a marching band, pep band, or school orchestra. Even if you're not in school, there may be community bands that you could participate in. [18] X Research source You can also put up fliers at music stores or music schools to find people to play with. It doesn't have to be a formal thing – just put the word out that you would enjoy the opportunity to play with others and learn new skills."
    },
    {
      "title": "Play your instrument in public for encouragement and feedback.",
      "content": "Play your instrument in public for encouragement and feedback. If a bar or café near you has an open mic night, you can sign up to perform there. If you have stage fright or the thought of performing in front of others causes anxiety, film yourself playing alone at home. You can share the video with friends and family. [19] X Research source Be cautious about posting your videos on the internet for anyone to see and comment on, especially if you're a beginner. Many of the comments you'll get will be far from encouraging. Instead, share with people you know and love."
    },
    {
      "title": "Study the techniques of skilled musicians who play your instrument.",
      "content": "Study the techniques of skilled musicians who play your instrument. Look for videos online where you can actually see how the musician is playing the instrument. Live sets or videos where the person is performing for a small audience are good for this. Watch for tricks that you can pick up and add to your own playing. [20] X Research source If you hear a song by a musician you like and wonder how they made a particular sound or musical phrase in the song, look for videos of them playing. Many musicians also have more technical videos where they actually demonstrate specific skills and teach viewers how to do them."
    }
  ]
}