{
  "url": "https://www.wikihow.com/Learn-Welsh",
  "title": "How to Learn Welsh",
  "steps": [
    {
      "title": "Start with the 7 Welsh vowels.",
      "content": "Start with the 7 Welsh vowels. Welsh has the 5 vowels that exist in English, plus 2 more. While one of them is sometimes used as a vowel in English, the other (\"w\") is not, so this can trip you up if you're a native English speaker. All of them have a single, consistent sound all the time except for \"y.\" [2] X Research source A sounds like the \"a\" in the English word \"man.\" E sounds like the \"e\" in the English word \"bet.\" I sounds like the \"ee\" in the English word \"queen.\" O sounds like the \"o\" in the English word \"lot.\" U sounds like the \"i\" in the English word \"pita.\" W sounds like the \"oo\" in the English word \"zoo.\" Y sounds like \"uh\" when used alone as a definite article (the equivalent of the word \"the\" in English). When used in a word with 2 letters, it sounds like the \"u\" in the English word \"under.\" In other words, it sounds like the \"i\" in the English word \"pita\" (similar to the Welsh \"u\")."
    },
    {
      "title": "Combine vowel sounds together to pronounce diphthongs.",
      "content": "Combine vowel sounds together to pronounce diphthongs. Welsh has 13 diphthongs, but not all of them make unique sounds. Since all letters are pronounced in Welsh, think of diphthongs as combining the 2 distinct vowel sounds together. [3] X Research source \"Ae,\" \"ai,\" and \"au\" all sound like the \"y\" in the English word \"my.\" \"Aw\" sounds like the \"ow\" in the English word \"cow.\" \"Eu\" and \"ei\" both sound like the \"ay\" in the English word \"pray.\" \"Ew\" makes something of an \"eh-oo\" sound unique to Welsh. To practice this, listen to native speakers saying Welsh words such as \"mewn\" and \"tew,\" and try to mimic their pronunciation. \"Iw\" and \"yw\" sound like the \"ew\" in the English word \"yew.\" \"Oe\" sounds like the \"oy\" in the English word \"toy.\" \"Ow\" sounds like the \"ow\" in the English word \"low.\" \"Wy\" sounds like the \"wi\" in the English word \"win.\" \"Ywy\" sounds like the \"ui\" in the English word \"fluid.\""
    },
    {
      "title": "Pronounce most single consonants the same as you would in English.",
      "content": "Pronounce most single consonants the same as you would in English. The letters \"b,\" \"d,\" \"h,\" \"l,\" \"m,\" \"n,\" \"p,\" \"r,\" \"s,\" and \"t\" make the same sounds in Welsh as they do in English. Because all letters in Welsh are pronounced, however, the letter \"h\" is never silent, as it can be in English. [4] X Research source The letters \"c\" and \"g\" are always hard, as in the English words \"cat\" and \"goat.\" The letter \"f\" sounds like the \"v\" in the English word \"five.\""
    },
    {
      "title": "Practice double consonants that are unique to Welsh.",
      "content": "Practice double consonants that are unique to Welsh. Unlike English, the Welsh alphabet doesn't include the consonants \"j,\" \"k,\" \"q,\" \"v,\" \"x,\" or \"z.\" However, there are 7 double consonants that produce sounds different than what you might expect if English is your first language. \"Ch\" is a soft, aspirated sound from the back of your throat, similar to the Scottish \"ch\" in the word \"loch.\" \"Dd\" sounds like the \"th\" in the English word \"seethe.\" \"Ff\" sounds like the \"f\" in the English word \"fight.\" \"Ll\" is a sound unique to Welsh, something like a \"thl\" sound. Listen to native speakers to get a better idea of how to pronounce this sound. \"Ng\" sounds like the \"ing\" in the English word \"finger.\" \"Rh\" sounds as if the \"h\" comes before the \"r,\" exhaling a bit before pronouncing the \"r.\" As with the \"ll,\" listening to native speakers will help you get the hang of it. \"Th\" sounds like the \"th\" in the English word \"think.\""
    },
    {
      "title": "Use the contraction \"su'mae\" to say \"hello.\"",
      "content": "Use the contraction \"su'mae\" to say \"hello.\" This is a traditional Welsh greeting, and typically one of the first words people learn when they set out to learn Welsh. In regular conversation, it's typically pronounced \"s'mae,\" and you can write it like that as well. [5] X Research source This phrase is itself a contraction of \"sut mae,\" literally \"how is,\" and is used to mean, roughly, \"how are things?\" Almost all Welsh speakers also speak English, so it's common to hear \"helo\" as a greeting as well."
    },
    {
      "title": "Follow up by asking \"Sut dach chi?\"",
      "content": "Follow up by asking \"Sut dach chi?\" This phrase typically follows \"su'mae,\" and means \"how are you?\" This is the formal version of the phrase, used with people you don't know, people older than you, or people in positions of authority. To friends, family, children, and close acquaintances, you can say \"sut wyt ti?\" [6] X Research source The typical response to \"sut dach chi?\" is \"da iawn,\" which means \"very good.\" You can also use this phrase to congratulate someone on an accomplishment or indicate that you approve of something they said or did. You might also hear \"iawn\" on its own, which is the equivalent of saying \"fine\" or \"okay\" in English."
    },
    {
      "title": "Tell the person that you're learning to speak Welsh.",
      "content": "Tell the person that you're learning to speak Welsh. Most Welsh speakers also speak English (and maybe a few other languages), so when you start your conversation, make it clear that you want to talk in Welsh because you're learning the language. Here are some phrases you can use: [7] X Research source \"Dw I'n dysgu Cymraeg\" (I'm learning Welsh.) \"Dach chi'n meindio siarad Cymraeg efo fi?\" (Do you mind speaking Welsh with me?) \"Fedrech chi ddeud hynny eto?\" (Could you say that again?) \"Fedrech chi siarad yn arafach?\" (Could you speak more slowly?)"
    },
    {
      "title": "Ask questions to keep the conversation going.",
      "content": "Ask questions to keep the conversation going. Asking your conversation partner questions about themselves is a good way to get them to speak to you in Welsh so you can listen. Pay attention to their pronunciation and ask them to explain any words that you don't understand. Here are some good starter questions: [8] X Research source \"Beth ydy eich enw chi?\" (What's your name?) \"Lle dach chi'n byw?\" (Where do you live?) \"Sut mae'r tywydd?\" (How's the weather? Note: the weather is an important topic of conversation in Wales.) \"O ble ydych chi'n dod?\" (Where are you from?) [9] X Research source"
    },
    {
      "title": "Add polite words and phrases to show respect.",
      "content": "Add polite words and phrases to show respect. In Welsh, as in any language, respect and politeness are important. You'll go a long way to endear yourself to native speakers if you include these polite words and phrases in your speech: [10] X Research source Os gwelwch yn dda: please Diolch: thank you Croeso: you're welcome (reply to \"thank you\") Mae'n ddrwg 'da fi: sorry Esgusodwch fi: excuse me"
    },
    {
      "title": "Use free online resources to learn Welsh on your own.",
      "content": "Use free online resources to learn Welsh on your own. Search for courses, online dictionaries, and other resources to compile your own self-designed language study. You can also take courses offered online or on mobile apps — some are free, while others require you to pay a subscription or membership fee. [11] X Research source Search for Welsh chat groups online that you can join if you want to practice speaking with other Welsh learners. [12] X Research source"
    },
    {
      "title": "Listen to Welsh music.",
      "content": "Listen to Welsh music. Welsh pop music is on the rise, and there are many videos and albums available on YouTube or through your favorite streaming service. The repetitive nature of most lyrics makes music a fun and easy way to learn any language, and you'll also pick up some popular phrases and cultural references that you might not find anywhere else. [13] X Research source For passive learning, put Welsh music on in the background while you're doing chores or commuting to work or school. If you're interested in taking a more active approach, search online for the lyrics to the song, then try to translate them from Welsh into English (or any other language)."
    },
    {
      "title": "Watch films, television shows, and videos in Welsh.",
      "content": "Watch films, television shows, and videos in Welsh. Many films and TV shows in Welsh are available for streaming in other countries, either online or through a streaming service such as Netflix or Hulu. While you likely want to start with subtitles in your native language, you can turn them off once you feel more comfortable with your listening comprehension skills. [14] X Research source If you turn on Welsh subtitles, you can practice reading in Welsh as well as listening to it being spoken. Just keep in mind that the Welsh subtitles might not reflect what's said verbatim. You can also watch tv shows and films about Wales to get a glimpse of Welsh people and their culture, as well as the beautiful Welsh countryside. [15] X Research source"
    },
    {
      "title": "Take a trip to Wales to speak with Welsh people.",
      "content": "Take a trip to Wales to speak with Welsh people. If you have the time and budget to do so, spending time in Wales is the best way to immerse yourself in the language. Most people in Wales do speak English, so you've always got that to fall back on if you find yourself in a tight spot. You can also take courses in Welsh while visiting. Look up the Welsh for Adults courses offered by Aberystwyth University."
    }
  ]
}