{
  "url": "https://www.wikihow.com/Groom-a-Cairn-Terrier",
  "title": "How to Groom a Cairn Terrier",
  "steps": [
    {
      "title": "Decide how you want to roll the coat.",
      "content": "Decide how you want to roll the coat. Cairn terriers do not shed. When the hairs die, they stay in the hair follicle, rather than simply falling off with regular shedding. To keep a Cairn terrier’s coat nice and healthy, those dead hairs need to be physically removed from the follicle. This is called rolling or stripping the coat. [3] X Research source Rolling the coat can be done by hand or with a grooming tool called a stripping knife. Either method will be effective."
    },
    {
      "title": "Consider contacting a groomer.",
      "content": "Consider contacting a groomer. Rolling the coat can be done at home, but it can be tricky if you have never done it before. It may be worth it to contact a groomer so you can be sure you are using the right technique. Rolling the coat should not cause your dog pain, and should not leave them with bald patches."
    },
    {
      "title": "Roll the coat once a month.",
      "content": "Roll the coat once a month. Rolling a Cairn terrier’s coat can take a long time. Fortunately, unless the Cairn terrier is a show dog, the rolling process needs to be done only about once a month. [4] X Research source Rather than rolling the coat all at once, you could break up the task into several months. [5] X Research source This would be a good idea if your Cairn terrier doesn’t like staying still for long periods of time."
    },
    {
      "title": "Hold your dog still.",
      "content": "Hold your dog still. Rolling the coat needs to be done in small sections, a few hairs at a time. Depending on how calm your dog is, you could hold it the entire time. If this isn’t practical, ask someone to gently hold your dog as you do the rolling."
    },
    {
      "title": "Brush the coat first.",
      "content": "Brush the coat first. Before rolling, brush your Cairn terrier’s coat in the direction of hair growth. This will help ensure that the new hair grows in the proper direction. Cairn terriers have a double coat: a soft, fluffy undercoat and a coarse topcoat. [6] X Research source Brush both coat layers. Use a slicker brush. You can find one at your local pet store."
    },
    {
      "title": "Grip a small section of hair.",
      "content": "Grip a small section of hair. Gently lift a small section of hair with your thumb and index finger. With your other hand, stretch the skin in the opposite direction. Stretching the skin this way will support it as you roll the coat. If you’re using a stripping knife, hold the hair with your thumb and the knife. [7] X Research source Your thumb should be on the underside of the hair and the knife on top. Consider putting some cholesterol on either the stripping knife or your fingers. The cholesterol will make it a little easier to pull out the hair. Purchase a jar of cholesterol at a beauty supply store."
    },
    {
      "title": "Pull the dead hair out.",
      "content": "Pull the dead hair out. Pull the hair in the direction of hair growth so the dead hairs come out and the healthy hairs stay in place. Do not yank the hair out: if the dead hairs are ready to come out, they’ll come out easily and your dog won’t feel any pain. Your dog may fuss during the process, but it won’t be in pain. [8] X Research source Start the rolling process at the back of your dog’s neck and work your way down its back. Be especially gentle pulling your dog’s belly hair. As you pull, do not bend your wrist. Doing so could break the hair."
    },
    {
      "title": "Work on the tail.",
      "content": "Work on the tail. A Cairn terrier’s tail has a characteristic cone shape. It will be easier to maintain this shape by pulling out the dead hair, rather than clipping the hair. [9] X Research source Pull the hair from the tail’s tip to the tail’s base. Be gentle with the pulling, since many Cairn terriers don’t like their tails being handled."
    },
    {
      "title": "Gently pull the facial hair.",
      "content": "Gently pull the facial hair. The dead hair on your Cairn terrier’s face will also need to be removed. Your dog won’t enjoy this part either, so be gentle. First, brush the hair back in the direction of hair growth. Pull the hairs, working from the muzzle to the jawline. Pull the hairs around the eyes so the hairs don’t cover up the eyes. [10] X Research source"
    },
    {
      "title": "Use the proper tools.",
      "content": "Use the proper tools. Brushing your Cairn terrier will certainly be less time consuming than rolling its coat. Even still, you should still take the time to do a good job. Regular brushing (at least once a week) with the proper tools will help keep both coat layers healthy and clean. Use these tools: [11] X Research source Stiff-bristled brush for detangling Slicker brush to distribute healthy oils through the hair Coarse comb for detangling Fine-toothed comb"
    },
    {
      "title": "Start with the coarse brush.",
      "content": "Start with the coarse brush. A coarse brush has stiff bristles and works well on coarse, weather-resistant coats. It can get out some of the tangled hair. After using this brush, use a coarse comb to continue detangling. Then, go through the coat with a fine-toothed comb. [12] X Research source Consider using a detangling spray before you start brushing. Be gentle as you brush and comb on the belly and down the legs."
    },
    {
      "title": "Remove mats carefully.",
      "content": "Remove mats carefully. Mats are clumps of tangled hair and cannot be brushed or combed through easily. If your Cairn terrier has mats, be patient and remove them with care. If the mats are small, break them up with your fingers and then brush through them starting at the tip. [13] X Research source For larger mats: Use small scissors to vertically split the mat into small sections. [14] X Research source Scissors can damage the skin, so don’t use them to remove the entire mat. Brush through the mat with a slicker brush and comb until the mat is gone. [15] X Research source Do not yank through the mats. This will not remove the mats and you’ll hurt your dog."
    },
    {
      "title": "Complete the brushing with a slicker brush.",
      "content": "Complete the brushing with a slicker brush. Once the hair is nice and smooth, use a slicker brush as a final ‘once over.’ [16] X Research source The slicker brush will distribute healthy skin oils through the coat, helping it look glossy and healthy."
    },
    {
      "title": "Bathe only when necessary.",
      "content": "Bathe only when necessary. Unlike other dog breeds, Cairn terriers do not need regular baths. Your Cairn terrier will need a bath only if something dirty gets into its coat and can’t be brushed out. [17] X Research source"
    },
    {
      "title": "Use a shampoo for coarse-haired dogs.",
      "content": "Use a shampoo for coarse-haired dogs. If you do have to bathe your Cairn terrier, don’t use just any dog shampoo. You will need to use one that’s specially formulated for coarse-haired dogs. [18] X Research source Other dog shampoos could make your dog’s coat age more quickly, causing the hair to die more quickly. [19] X Research source"
    },
    {
      "title": "Wash your dog.",
      "content": "Wash your dog. Other than using a specific shampoo, you will bathe your Cairn terrier like you would any other dog. Follow these tips for giving your dog a good bath: Put a few inches of lukewarm water in the tub. [20] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Work the shampoo through both coat layers and down to the skin. Rinse all the shampoo out so your dog’s skin doesn’t feel itchy and irritated."
    },
    {
      "title": "Dry off your dog.",
      "content": "Dry off your dog. Use some regular bath towels to dry off your Cairn terrier. If you want dry off your dog a little more quickly, you could use a dog hair dryer. Dog hair dryers don’t get as hot as human dryers and are much quieter. [21] X Research source Do not try to blow dry your dog’s face. Your dog will not appreciate the blow of air directly in its face."
    },
    {
      "title": "Clean your dog’s eyes.",
      "content": "Clean your dog’s eyes. Small dogs with short muzzles can develop problems with their tear ducts. Tear duct problems can cause frequent weeping, which can lead to a dry and crusty buildup in the inner corners of the eyes. [22] X Research source If you notice this buildup around your Cairn terrier’s eyes, you will need to gently remove it. Ask your vet which eye cleaner to use. Put some of the ear cleaner on a cloth and wipe around the eyes as needed. If you see specks of dirt around your dog’s eyes, you could use a fine-toothed comb to remove the dirt."
    },
    {
      "title": "Care for your dog’s ears.",
      "content": "Care for your dog’s ears. Taking care of your Cairn terrier’s ears is another important aspect of grooming. If you see some dirt or wax building up in the ears, put some ear cleaner on a cotton ball and clean each ear. Move the cotton ball from the inside to the outer ear flap. Do not use cotton swabs in the ears. Cotton swabs can damage the ear canals and can increase the risk of inflammation or infection in the ears. [23] X Research source If your dog’s ears look unusual (swelling, redness, scabs) or smell really bad, take your dog to your vet. Your dog could have an ear infection or other ear disease."
    },
    {
      "title": "Trim the nails.",
      "content": "Trim the nails. Cairn terriers tend to spend a lot of time indoors, meaning they don’t get outside very much to wear their nails down. [24] X Research source When your Cairn terrier’s nails are clicking on the ground, you’ll know it’s time to trim them. To do a good job of trimming the nails: Follow the natural curve of the nail when trimming. Avoid clipping the quick, which is the pink vein running through the center of each nail. Clipping the quick will be painful to your dog and cause the nail to bleed. If the quick is hard to see (if your dog has dark nails), clip the nail little by little. If the white spot in the center of the nail begins to darken you are nearing the quick, and should stop clipping. If the nail starts to bleed, apply a small pinch of styptic powder to the nail. Styptic powder is available at your local pet store."
    },
    {
      "title": "Maintain your dog’s teeth.",
      "content": "Maintain your dog’s teeth. If you get your dog as a puppy, you can train them to accept teeth brushing by exposing them to the sensation early and often. Ideally, you should try to brush your dog’s teeth daily, but aim for at least 2-3 times per week. Brushing your dog’s teeth can limit the need for your dog to be anesthetized for dental cleaning by your veterinarian. You should still have a dental cleaning performed whenever your vet recommends it."
    }
  ]
}