{
  "url": "https://www.wikihow.com/Land-a-Helicopter-After-Your-Pilot-Has-Been-Killed",
  "title": "How to Land a Helicopter After Your Pilot Has Been Killed",
  "steps": [
    {
      "title": "Get the pilot off the controls.",
      "content": "Get the pilot off the controls. He will likely be slumped-over pushing the stick forward. This will cause the helicopter to go nose forward into the ground. A person sitting behind the pilot will be of great value here. They can reach forward and hold the pilot back. Pull him back against his seat and lock his seat belt. Many aircraft have handles on the reels of the lap belt, by your hips. Flip this handle and the seat belt will lock him in place. Alternately, you can try yanking the shoulder harness forward to trick it into locking up (like when you slam the brakes in your car)."
    },
    {
      "title": "Familiarize yourself with the controls.",
      "content": "Familiarize yourself with the controls. Unfortunately the odds of having the second set of controls installed in the helicopter on a tour is slim to none, so this is where you plummet to your death screaming. Cyclic : The main control stick coming up between your legs is called the cyclic. Push forward, the nose goes down. Pull back, the nose goes up. Push left, the helicopter banks (or tilts) left. Push right, bank right. Pedals: The pedals on the floor control the tail rotor. Push the left pedal to turn the nose left, push right to turn the nose right. You use these to keep the nose pointed forward. If you want to turn the helicopter, use the cyclic; adjust the pedals only as necessary to keep the nose from being cocked off to one side or the other. Collective: The stick coming out of the floor by your left thigh is the collective. It makes the rotor blades blow more or less air. When you pull up on the collective all the rotor blades rotate slightly so that each blade takes a bigger bite and more airflow is induced through the rotor system. Throttle: The throttle that controls engine speed is usually found as a motorcycle-like twist-grip on the collective, or as an overhead lever between the two pilots. In almost all helicopters the throttle is automatic. Before takeoff you set it to 100% and leave it there the whole time. So don't mess with the throttle. Radio and intercom: On the cyclic there is likely a trigger (think Top Gun, \"too close for missiles, switching to guns.\"). Different helicopters work different ways. Sometimes you pull the trigger half-way to use the intercom, and all the way to talk on the radio. Other times you push up for intercom, and squeeze the trigger for radio broadcast. There is also, usually, a floor switch that looks like the old-fashioned high-beam floor switch in a car. This will also work either the intercom or radio. If you have time and the aircraft is under control, play around with these and see if you can talk to someone."
    },
    {
      "title": "Get the aircraft flying straight and level.",
      "content": "Get the aircraft flying straight and level. This is critical to your safety. Once you are straight and level you can formulate a plan, relax a little, and get a feel for the helicopter. Make small control inputs! If the nose is pointing down, pull back on the stick a tiny bit, and see what happens. If it's not enough, just pull a little more and see what happens. Slow and steady wins the race. It takes time for your control inputs to have an effect, so move the cyclic a little bit and then count to three before deciding that it's not working. Don't let the nose stay above the horizon (flying in a nose high attitude). This will cause your airspeed to decrease and you will eventually come to a stop. This is called hovering, and if you haven't done it before, you will surely crash and die. Most small helicopters safest at about 60 knots; they are more efficient here than any other speed, and besides, the forward speed will keep the helicopter straight for you at this stage. If you need to stop a descent, or start a climb, keep the nose level by using the cyclic and pull up slightly on the collective - try 1 ⁄ 4 inch (0.6 cm) movement and then wait to see what happens. The nose of the helicopter should remain slightly below the horizon during everything you do."
    },
    {
      "title": "Turn towards safety.",
      "content": "Turn towards safety. Once you have the helicopter under some semblance of control, you need to think about landing. Your best bet is a large airport. You are going to land like an airplane, so you need a big piece of concrete. Big airports have all the emergency equipment and the biggest pieces of concrete. A small airport would be your second best bet, followed by straight wide road without wires, and an open field is your last choice. If you have managed to get someone on the radio, hopefully they have put you in contact with a radar controller. This guy will tell you where to go. If you aren't talking to anyone, the easiest way to find one is with the GPS. Hopefully your helicopter has a moving map display. This works much like the one in your car. There should be a little airplane on the digital map- that's you. There should also be a few little airport symbols with their three-letter identifier next to the symbol (eg: LAX, that would be a good one). Start a slow turn and watch the map spin around the miniature airplane. Once the nose of your digital plane is pointing at the symbol for an airport, fly straight and level and you will eventually fly over the airport or run out of gas trying. Keep looking out of the window at something in the distance (preferably the airport, if you can see it). If it is the airport, keeping it at the same place on the window will take you straight to it, and also gradually lose height. If it is not the airport that you are looking at but something on he way to the airport, be careful to keep you height, so your target will move slowly down the windshield - then you pick another target, until you are looking at the airport."
    },
    {
      "title": "The Approach",
      "content": "The Approach Now it's time to get serious. Hopefully, by now you have figured out how to control the helicopter a little bit. Remember, you are going to land like an airplane, with forward airspeed. If you try to hover and land to a spot, you will crash and die. (That is for experienced pilots only!) The key to a good approach is to set yourself up so you're lined up with the runway a good ways out (this way you are not doing any last-minute turns), and with a slow descent, so you are not diving down onto the runway. Take a moment to ensure everyone has their seat belt securely fastened, and that any carry-on items are stowed securely. Once you are lined up with the runway, push down on the collective slightly to start a slow descent. Imagine a piece of string running from the end of the runway to your helicopter. Fly down that piece of string. Remember to fly in a slightly nose-down attitude, this will keep your airspeed under control during the approach. Keep looking at a spot about 50m after the start of the runway, and try to keep that place still on the windshield. When you are getting closer to touchdown you may find that you have misjudged your approach and are going to land before or after the runway, or off to the side. You need to decide whether you want to go around and try to line up again. If you feel reasonably confident in your ability to fly straight and level, this would be the recommendation. The last 100 feet (30.5 m) is not the time to fix a bad approach. Pull up the collective about 2 inches (5.1 cm), and wait to see how the helicopter responds. Use your feet to keep going straight ahead. It should climb away, but if it didn't - just leveled out - pull-up the collective another inch, and wait. Keep the helicopter straight with your feet. Repeat until you are climbing. If, however, you have been wrestling a greased pig all the way down, you may wish to choose a small crash on the airport instead of a big one in the neighborhood adjacent the airport."
    },
    {
      "title": "In the last few seconds before touchdown you are going to feel the urge to pull way up on the collective, and way back on the stick.",
      "content": "In the last few seconds before touchdown you are going to feel the urge to pull way up on the collective, and way back on the stick. Don't. You may want to pull up the collective a little to cushion the landing, but as long as you are not screaming toward the earth don't worry about a hard landing. Helicopters are pretty tough, and it's not yours anyway, so don't worry about roughing it up."
    },
    {
      "title": "Use the pedals to keep the nose of the helicopter pointed down the runway.",
      "content": "Use the pedals to keep the nose of the helicopter pointed down the runway. Small corrections are all that's needed. If you start veering off to the side, resist the urge to slam in full opposite pedal. This will make it worse."
    },
    {
      "title": "After you touch down-Keep Flying The Helicopter!",
      "content": "After you touch down-Keep Flying The Helicopter! As you are skidding down the runway, keep using those pedals to point the nose, and keep using the cyclic to keep the rotor disc flat (which you were doing when keeping the nose slightly below the horizon)."
    },
    {
      "title": "Once you touch down, slowly move the collective all the way down till it stops.",
      "content": "Once you touch down, slowly move the collective all the way down till it stops. This collective movement will cause the nose to turn one way or the other. Use the pedals to keep the nose lined up with the runway. After you lower the collective fully the helicopter will come to a stop rather quickly. Congrats! You're alive!"
    },
    {
      "title": "Don't get out of the helicopter with the blades spinning!",
      "content": "Don't get out of the helicopter with the blades spinning! Using the throttle, turn the engine off. If the throttle is on the collective hand grip, roll the throttle all the way to idle. If it is a lever on the ceiling up by the middle of the windshield, pull it backwards to idle. There is almost always a safety catch to prevent you from accidentally turning the engine all the way off. You will probably have to push a button to roll the throttle off, or pull down on the lever to pull it all the way off. Once you figure it out you will immediately hear the engine spool down."
    },
    {
      "title": "After the engine shuts down, sit there holding all the controls level until everything stops moving.",
      "content": "After the engine shuts down, sit there holding all the controls level until everything stops moving. You and your passengers can then egress the helicopter. Don't move the wounded/dead pilot until paramedics arrive."
    },
    {
      "title": "If your helicopter is on fire after landing you may want to exit the helicopter before everything stops moving, and pull the disabled pilot out.",
      "content": "If your helicopter is on fire after landing you may want to exit the helicopter before everything stops moving, and pull the disabled pilot out. Just be very careful around the rotor blades. Without you holding the controls steady it can very easily flap around low enough to cut your torso in half. The typical tip speed of a helicopter rotor is around 450 mph (720 km/h) (some are faster) so they will not stop if you put your hand / head / torso in the way."
    }
  ]
}