{
  "url": "https://www.wikihow.com/Make-a-Fletching-Table-in-Minecraft",
  "title": "Make Fletching Tables in Minecraft for Better Villager Trades",
  "steps": [
    {
      "title": "A Fletching Table is a job site block that turns unemployed villagers into fletchers.",
      "content": "A Fletching Table is a job site block that turns unemployed villagers into fletchers. Fletching tables occur naturally inside of fletcher houses, but you can also craft them to encourage more villagers to become fletchers. [1] X Research source The Fletching Table looks like a tan block with a bow and arrow on one side, and a target on the other. Fletching Tables are available in all current versions of Minecraft beginning with 1.14 (Java Edition) and 1.11.0 (Pocket Edition & Windows 10). You won't find Fletching Tables on Xbox 360, PS3, or WiiU."
    },
    {
      "title": "Create a Fletching Table if you want more fletchers to trade with.",
      "content": "Create a Fletching Table if you want more fletchers to trade with. By making your own Fletching Table with a few basic materials, you can get better trades, as fletchers are some of the best villagers to trade with—you can trade for emeralds, bows, crossbows, enchanted crossbows, and tipped arrows. [2] X Research source Fletching Tables can also be used as furnace fuel—they can smelt one and a half items per block. You can also place Fletching Tables under note blocks to make bass sounds."
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. The recipe for a Fletching Table requires only a few basic materials: [3] X Research source 4 wooden planks of any type, including oak, dark oak, spruce, birth, jungle, acacia, crimson, and warped planks. 2 flints , which you can acquire by mining gravel. [4] X Research source"
    },
    {
      "title": "Open your crafting table.",
      "content": "Open your crafting table. You can open the crafting table by standing in front of it and right-clicking or tapping it. [5] X Research source If you're playing on a console: PS4: Press L2 . Xbox One: Press LT . Nintendo Switch or Wii U: Press ZL ."
    },
    {
      "title": "Place 2 flints in the top-left two slots.",
      "content": "Place 2 flints in the top-left two slots. Leave the third slot on the top row blank."
    },
    {
      "title": "Place 2 planks into the first two slots on the second line.",
      "content": "Place 2 planks into the first two slots on the second line. These can be two planks of any type. [6] X Research source Leave the third slot on the second row blank."
    },
    {
      "title": "Place 2 more planks into the first two slots on the third row.",
      "content": "Place 2 more planks into the first two slots on the third row. This recipe produces a Fletching Table, which you can now drag down into your inventory."
    },
    {
      "title": "Place the Fletching Table in a cramped area.",
      "content": "Place the Fletching Table in a cramped area. If you need a quick way to produce more fletchers in a village, you can coerce jobless villagers into interacting with a Fletching Table by placing the table in a villager's home or anywhere near the villager. [7] X Research source"
    },
    {
      "title": "Seal off the area once a villager is near the Fletching Table.",
      "content": "Seal off the area once a villager is near the Fletching Table. If the villager doesn't interact with the table on their own, you can block off any exits to speed along the process. By preventing the villager from exiting the area with the Fletching Table, they'll have no choice but to interact with it. Once a villager interacts with the table, you'll see green stars around their head, and they'll suddenly be wearing a brown hat."
    },
    {
      "title": "Level up the fletcher by buying and selling.",
      "content": "Level up the fletcher by buying and selling. When the fletcher is a novice, you can only trade for emeralds, arrows, and flints. By continuing to trade with one fletcher, you'll eventually turn them into a Master Fletcher who can get you tipped arrows. [8] X Research source Here are all of the trades you can do with a fletcher at different levels: Novice 32 sticks for 1 emerald. 1 emerald for 16 arrows. 1 emerald and 10 gravel for 10 flints. Apprentice 26 flints for 1 emerald. 2 emeralds for 1 bow. Journeyman 14 strings for 1 emerald. 3 emeralds for 1 crossbow. Expert 24 feathers for 1 emerald. 7 to 21 emeralds for 1 enchanted bow. Master 8 tripwire hooks for 1 emerald. 8 to 22 emeralds for 1 enchanted crossbow. 2 emeralds and 5 arrows for 5 tipped arrows."
    }
  ]
}