{
  "url": "https://www.wikihow.com/Make-a-Coupon-Book-for-Tasks",
  "title": "How to Make a Coupon Book for Tasks",
  "steps": [
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Card-stock paper is the best type of paper to use for a coupon book. It is sturdy and will last longer than other types of paper. You will also need scissors, a hole puncher, a ruler, and pens or markers. You can get card-stock paper with lots of different colored paper to make the coupon book really colorful. You can also use construction paper, notecards, copy paper, or art paper instead of card-stock paper."
    },
    {
      "title": "Cut the card-stock paper to make your coupons.",
      "content": "Cut the card-stock paper to make your coupons. It's up to you how big or how small your coupons are. A good size for a coupon is 6 inches (15 cm) wide and 3 inches (7.6 cm) long. Pick the size you want your coupons to be and mark an outline of your coupon on the card-stock paper. Cut the shape out of the paper with scissors. You can lay the first coupon you cut out on top of the other sheets of paper. The more paper you use, the harder you'll find it to cut through it with scissors. Place the coupon on top of the other sheets and cut around the coupon to cut out the other paper as well."
    },
    {
      "title": "Create a front cover page on 1 of your coupons.",
      "content": "Create a front cover page on 1 of your coupons. This coupon will be placed at the front of the coupon book and will tell the person you give the book to exactly what it is. Draw a few different designs on the cover page using different colored markers. Write something like \"A Coupon Book for Tasks for [the person you're giving the gift to] from [you]\" on the front cover."
    },
    {
      "title": "Draw a design on your coupons.",
      "content": "Draw a design on your coupons. Your coupon book will look a lot better if all of the pages have interesting and cool designs. Use your markers to draw borders on your coupons. You can also draw polka dots on the coupons. Don't stick to the same design for every page. Mix it up and have a different design on every coupon."
    },
    {
      "title": "Write out the tasks on the coupons.",
      "content": "Write out the tasks on the coupons. Once you've designed your coupons, you can write out the tasks you're willing to perform for your friend or family member. Make sure you write clearly so the person you give the gift to can read the coupons. Write tasks on the coupons that you know the other person would like to use. Some ideas for tasks are: You'll do their laundry You'll bring them breakfast in bed You'll clean the house You'll wash up after dinner for a week You'll take the dog walking for a month"
    },
    {
      "title": "Punch a hole in the top left corner of all of the coupons.",
      "content": "Punch a hole in the top left corner of all of the coupons. Lay your hole puncher flat on a steady work surface. Hold your coupons under the device and press down on the handle. The puncher will cut out small holes in your coupons for you. Be careful if you try to punch more than 1 piece of paper at a time. You could easily jam the hole puncher."
    },
    {
      "title": "Thread string, twine, or a ribbon through all of the coupons.",
      "content": "Thread string, twine, or a ribbon through all of the coupons. Once you've a hole punched in all of your coupons, put 1 of these items through all of the holes. Tie the ribbon, twine, or string together to bind all the coupons together. You can also use shoe laces instead of a ribbon, string, or twine."
    },
    {
      "title": "Present the book to the person you made it for.",
      "content": "Present the book to the person you made it for. When your book is finished, tell the person you made it for to close their eyes and place it on their hands. When they want to redeem a coupon, all they have to do is present it to you and you have to carry out that task."
    },
    {
      "title": "Create the front cover of your coupon book.",
      "content": "Create the front cover of your coupon book. In Microsoft Word, use clip art or import a design you made in paint. Play around with the \"insert\" feature on Word to put some cool designs or drawings on the front cover. Don't take up more than half the page with the design."
    },
    {
      "title": "Design each page of your coupon book.",
      "content": "Design each page of your coupon book. For practicality with Word, it's a good idea to use the same design for every page of the book. You can use a couple of different designs by creating a few different designs on Word and printing each 1 out multiple times. [1] X Research source Type something like \"This coupon allows ......... to ............\" Fill in the person's name and what the coupon lets them do on the dotted lines. Measure your page and take note of the halfway point. Put 1 coupon on the top of the page and the other on the bottom of the page."
    },
    {
      "title": "Print your coupons from Microsoft Word.",
      "content": "Print your coupons from Microsoft Word. Once you're happy with your design, click \"File\" then \"Print\" in Word. Word will show you a preview screen of your design before you decide to print. Print on different colored paper for a cool looking design on your coupon book. [2] X Research source Card-stock paper is the best type of paper to use for your coupon book. Print your design page separately."
    },
    {
      "title": "Fold the pages in half.",
      "content": "Fold the pages in half. Lay each page flat on your table or work surface. Pull 1 end towards the other, placing the 4 corners together. Double-check to make sure that you have the corners lined up. Flatten out the crease in the middle. [3] X Research source"
    },
    {
      "title": "Cut along the fold in the middle of the page.",
      "content": "Cut along the fold in the middle of the page. Use scissors or a paper cutter and cut right across the crease along the middle of the page. When finished, you should have 2 halves of paper, each with 1 coupon. [4] X Research source If you want to be absolutely sure of the right place to cut, measure the page and mark the halfway point on each side. Draw a line across the page in very light pencil if you need to. When you've cut all of the pages, you should be left with a front cover and a significant stack of coupons."
    },
    {
      "title": "Use a hole puncher to put holes in each coupon.",
      "content": "Use a hole puncher to put holes in each coupon. When you're using the hole puncher, punch 1 coupon at a time. While you can do more, the puncher might get stuck and struggle to punch through 2 layers of card-stock. Punch the holes at the left side of each coupon. Try to punch in the same spot every time. [5] X Research source"
    },
    {
      "title": "Place the front page facing down and lay the coupons on top.",
      "content": "Place the front page facing down and lay the coupons on top. Before you attach all of the pages together, make sure that you have all of the coupons facing the right direction. Start by putting the front cover facing down and place every coupon on top of that, with the coupon side facing down. [6] X Research source When finished, turn the stack over and push all the coupons neatly together in the pile."
    },
    {
      "title": "Attach all the pages with ribbon or twine.",
      "content": "Attach all the pages with ribbon or twine. Ribbon will make the book look fancy and twine will make it look very artisanal. Feed either material through the first hole and then up through the second hole. Tie it together when you've fed all of the material through the holes. [7] X Research source Image:Make a Coupon Book for Tasks Step 16.jpg"
    },
    {
      "title": "Fill in the design page and each coupon.",
      "content": "Fill in the design page and each coupon. Use a fancy pen and take your time writing on each page so you don't make any mistakes. There's a wide variety of things you could write in the coupons. For example: For young kids, you could write coupons letting them pick a movie to watch, to stay up past their bedtime, or to play a game. For a boyfriend or girlfriend, you could have a coupon for a romantic dinner, a massage, or to let them watch whatever they want on TV."
    },
    {
      "title": "Give the coupon book to the person you made it for.",
      "content": "Give the coupon book to the person you made it for. Make sure you've filled in every page before you give the person the book. You can wrap it up before you give it to them or tell them to close their eyes before you place it in their hands."
    },
    {
      "title": "Get a wooden box to put your coupons into.",
      "content": "Get a wooden box to put your coupons into. You can use an old jewelry box that's been lying around the house or buy one at the local arts and crafts store. The wooden box doesn't need to be very big, you just need to be able to fit the coupons into it. [8] X Research source The box can have a lid with a hinge or a cover lid. If the box looks old or dirty, you might need to paint it."
    },
    {
      "title": "Use 150-grit sandpaper on the wooden box.",
      "content": "Use 150-grit sandpaper on the wooden box. Before you paint the box, gently rub the inside and outside with 150-grit sandpaper. The sandpaper will make the wood much nicer looking and smoother, and it'll make it easier to paint. [9] X Research source Wipe the wood with a wet cloth to remove any leftover sand dust. Lay down newspaper under the box before you sand to protect your work surface."
    },
    {
      "title": "Apply primer to the box before you paint it.",
      "content": "Apply primer to the box before you paint it. You can get primer at your local hardware store. Use a small brush to apply it to your box. Prime the entire box, inside and out. Use smooth, even strokes on the wood with the brush to evenly apply the primer. [10] X Research source Give the primer 4 to 5 hours to dry before painting the first coat. Remove the hinges with a screwdriver if you don't want to paint them."
    },
    {
      "title": "Paint the box once the primer has fully dried.",
      "content": "Paint the box once the primer has fully dried. Find out the favorite color of the person you're making the book for and use that color to paint your box. Dab the primer with a tissue after 4 or 5 hours to check if it's dry. Inspect the tissue and if there's no primer on it, you can apply the first coat of paint. Use a small brush and paint with even, measured strokes. [11] X Research source Paint the inside of the box too. To paint the corners, put plenty of paint on your brush and push it into the corner. Give the paint 4 to 5 hours to dry. Dab the paint with a tissue to test if it's dry once the time is up."
    },
    {
      "title": "Apply the second coat of paint when the first coat has dried.",
      "content": "Apply the second coat of paint when the first coat has dried. Use the small brush and even, measured strokes to apply the second coat of paint to the box. Look for any areas that really need more paint and paint them to match the rest of the box. [12] X Research source"
    },
    {
      "title": "Measure the length and width of your box with a ruler.",
      "content": "Measure the length and width of your box with a ruler. Before you make the coupons, you need to find out what size they should be. When you've measured the size of the box, write it down on a piece of paper. Take .25 inches (0.64 cm) away from the measurement to allow your coupons to fit neatly inside the box. [13] X Research source Image:Make a Coupon Book for Tasks Step 24.jpg This new measurement is the size your coupons should be."
    },
    {
      "title": "Cut your card-stock paper to the new width measurement.",
      "content": "Cut your card-stock paper to the new width measurement. Use scissors or a paper cutter to cut your card-stock paper to the width measurement of your wooden box minus .25 inches (0.64 cm). Cut as many strips of card-stock as you'd like. The more strips you cut, the more coupons you can make. [14] X Research source"
    },
    {
      "title": "Mark your strips at intervals of your length measurement minus .25 in (0.64 cm).",
      "content": "Mark your strips at intervals of your length measurement minus .25 in (0.64 cm). Lay your strips of card-stock flat on your work surface and use a ruler to measure these intervals. For example, if your box has a length of 5 inches (13 cm), take away .25 inches (0.64 cm). This leaves you with a length measurement of 4.75 inches (12.1 cm). [15] X Research source Use your ruler to mark as many intervals as you can of this length on your card-stock strips."
    },
    {
      "title": "Fold the strips at the measurement mark in an accordion style.",
      "content": "Fold the strips at the measurement mark in an accordion style. An accordion style of folding means that the paper will look like an accordion when you unwrap it. For example, fold the first section under the strip and the next section on top of the strip. [16] X Research source Image:Make a Coupon Book for Tasks Step 27.jpg This will create a neat design that will look far more complicated than it was to make."
    },
    {
      "title": "Use a perforating tool to add strips to your coupons.",
      "content": "Use a perforating tool to add strips to your coupons. Place your strips flat on top of your work surface again. Run your perforating tool across the points where you see the folds in the card-stock. The perforating tool will make it easy for the person you give the coupons to to tear them out. [17] X Research source Use plenty of pressure with the perforating tool as you roll it across the folds."
    },
    {
      "title": "Fill in each section of the card-stock to create coupons.",
      "content": "Fill in each section of the card-stock to create coupons. With your card-stock flat on your work surface, write down what each gift allows the person to do or have. If you want, you can create designs on each page to spice up the look of the coupon book. [18] X Research source Use different colored markers so the whole coupon book doesn't look the same."
    },
    {
      "title": "Put glue on the bottom strip to attach your coupons to the box.",
      "content": "Put glue on the bottom strip to attach your coupons to the box. Once you've finished writing out all of the coupons, spread glue over the very last sheet. Then place it flat on the floor of the box and lay all the other sheets into the box in the accordion style. Place a small weight such as a bottle of water on the coupons to make the last strip stick to the bottom of the box. [19] X Research source Give the glue around 30 minutes to dry."
    },
    {
      "title": "Give the coupon box to the person you made it for.",
      "content": "Give the coupon box to the person you made it for. With your box painted and your coupons added, you can hand the box to your friend or relative. Test the box at home first by unfurling the pages from the box to see if the accordion style has worked."
    }
  ]
}