{
  "url": "https://www.wikihow.com/Harvest-Pecans",
  "title": "How & When to Harvest Pecans",
  "steps": [
    {
      "title": "Observe the pecan trees for indications the nuts are ready to fall.",
      "content": "Observe the pecan trees for indications the nuts are ready to fall. Pecans may begin falling from early September to November, and preparing for harvesting should be done prior to the nuts falling, but closely enough to the anticipated fall that your efforts will not have been undone by time and weather."
    },
    {
      "title": "Establish the fact that the nuts your target tree are bearing are worth the efforts you will put forth.",
      "content": "Establish the fact that the nuts your target tree are bearing are worth the efforts you will put forth. Some pecan trees will produce low-quality nuts, either because of a poor growing season, low quality soil and nutrients, or it is simply a product of a poor genetic background. Some examples of these contributions to the nut quality are these: Non hybridized trees produce seedling nuts, often no larger than small oak acorns, with incredibly hard shells which makes obtaining the nutmeats almost impossible. Other poor genetics can be found even in hybrid trees whose gene pool has passed on poor quality. Poor growing conditions may include a dry spring and summer that did not enable the trees to produce a good crop, especially when irrigation is not used, and in soils that have poor moisture retention to begin with. Low levels of critical soil nutrients, especially nitrogen and trace minerals/elements like zinc, iron, and manganese can substantially reduce the quality of the nuts. Insect infestations such as web worms, bud worms, and pecan weevils can also have a serious impact on the health of the tree and the nut itself. Very late frosts or freezes can damage the blooms and buds of the pecan tree, reducing the set of the nuts during or after the blooming period."
    },
    {
      "title": "Observe the tree itself for indications of the nut crop, both in quality and quantity.",
      "content": "Observe the tree itself for indications of the nut crop, both in quality and quantity. In late summer, the pecans will have reached their full size, including their husks, so you should have a good idea of how large the nut will be after the husk dries and falls off. Note that the husk represents between 25-30% of the total mass of the pecan, so a pecan that appears large while in its husk may still be disappointingly small when the husk is gone."
    },
    {
      "title": "Watch for the husks to begin splitting.",
      "content": "Watch for the husks to begin splitting. When a substantial portion of the nut's husks have split and opened, it is time to clean beneath the tree. Raking any debris from bare earth beneath a tree, and possibly taking action to level out the ground may be all that is needed in this situation, but for trees with lawn or pasture grasses, or even weeds beneath the canopy, more work will be needed."
    },
    {
      "title": "Mow around trees with lawn grasses beneath them.",
      "content": "Mow around trees with lawn grasses beneath them. Circle the tree so that the clippings discharge away from the trunk, while beginning to circle as near the trunk as possible. This will allow the mower discharge to propel the trimmings and any other debris away from the tree. Continue mowing until at least 10–15 feet (3.0–4.6 m) beyond the tree's canopy so that nuts that fall near the edge will be visible to gather. High winds can leave pecans a surprising distance from the tree when they are blown free."
    },
    {
      "title": "Pick up pecans when they begin to drop.",
      "content": "Pick up pecans when they begin to drop. Wet weather can be detrimental to the nuts, and foraging wildlife may beat you to them if they are left on the ground. Crows and squirrels are particularly fond of pecans, as are deer and other wildlife."
    },
    {
      "title": "Keep leaves raked up or blown away.",
      "content": "Keep leaves raked up or blown away. Use a leaf blower if possible, since finding the pecans in a sea of similarly colored leaves will make the task even more difficult."
    },
    {
      "title": "Stoop and pick your pecans.",
      "content": "Stoop and pick your pecans. If the first few pecans are not sufficient to justify using more technological means to harvest them, you can simply bend over and pick up individual pecans as you walk beneath the tree. Have a container, such as an empty five gallon plastic bucket, to keep your harvest in. For the strong and energetic, this is an efficient technique for harvesting pecans underneath one or two trees. Some find that crawling on their knees will also suffice for the purpose of gathering pecans."
    },
    {
      "title": "Use a pecan picker if the challenge of crawling around or stooping (bending) over is too much for you.",
      "content": "Use a pecan picker if the challenge of crawling around or stooping (bending) over is too much for you. There are several varieties of pickers mounted on short handles, but most consist of a wire spring configuration with a small hopper to hold the nuts. The spring is pressed down on the nut, which spreads the wires allowing it to slip between them, and it is captured in the hopper. Empty the hopper often into a bucket or other container to avoid spilling the pecans. (See the first video below.)"
    },
    {
      "title": "Use a manually operated rolling picker.",
      "content": "Use a manually operated rolling picker. These are simple machines that operate like a reel-type lawnmower, catching the nuts between flexible rollers or fingers and depositing them in a hopper. Most of these contraptions will pick up a considerable amount of debris, so keeping the ground clean underneath the tree is critical in reducing the labor involved. (See the second video below.)"
    },
    {
      "title": "Hire a pecan harvester for large orchards.",
      "content": "Hire a pecan harvester for large orchards. Pecan harvesters use tractor powered machines that sweep the orchard to harvest the nuts. When used in conjunction with tree shakers , this is the least labor-intensive, and most efficient way of harvesting pecans, but is really beyond the focus of this article."
    },
    {
      "title": "Sort out deformed or damaged nuts when you have finished harvesting them.",
      "content": "Sort out deformed or damaged nuts when you have finished harvesting them. Unless you choose to crack and shell the pecans yourself, you will end up paying to have these undesirable nuts processed. If you intend to sell your pecans, having substandard or worthless nuts will cause the buyer to offer a lower price than for consistent, high quality pecans. This is especially true if you sell to a wholesaler, who grades his purchases carefully to insure the quality of his product. Some things to look for to help determine the quality of your pecans are these: Coloration. Good pecans should have a uniform color. Some varieties, like Stuarts and Donaldsons have stripes near the bud ends, and a good definition between the stripe color (usually black), and the shells (light tan) are indicative of a good nut. Shell shape. Pecans form inside the husk as nutrients are passed through the veins in the husk, then through the still soft shell, filling out from the bud end to the tip. If dry weather, depletion of soil nutrients, or insect damage to the husk interrupts this feeding process, the nut will taper toward the tip end, meaning the nutmeat has not continued to grow completely. Sound. This may seem unusual, but pecans, when they are rattled or dropped together, make a distinctive sound. Hollow sounding pecans are likely not filled out, whereas good, full pecans will sound solid, even if just rattled together in your hands. As you gather the pecans, shake them, and crack a few suspicious sounding ones, and you will soon develop an ear for the sound of a good, full pecan. Weight. Although individual pecans weigh very little, an experienced picker, especially when picking or sorting by hand, will soon notice a distinct difference in weight of full pecans, compared to lesser quality ones."
    },
    {
      "title": "Sack your pecans for storage.",
      "content": "Sack your pecans for storage. Generally, pecans can be stored in loose cloth sacks, in a cool, dry place for several weeks after harvest. The nuts will actually improve in quality, particularly those harvested early, as they cure . Do not skip the curing step. Uncured pecans will not crack properly, and are difficult to shell. Freezing stops the curing process, so make sure the nuts are cured before you freeze them. Freezing will allow you to store the nuts even longer, with almost no effect on their quality. Remember that nature has provided the nuts with hard shells, an almost perfect storage container."
    },
    {
      "title": "Shell your nuts.",
      "content": "Shell your nuts. If you are fortunate enough to have a pecan processing facility nearby, you can take your pecans in and have them cracked by machine. You can also check with your local farm supply store, as many of them have cracking machines. Expect to pay 25 to 40 cents per pound for this service. If you want to crack them yourself, you can purchase a pecan cracker for this task."
    }
  ]
}