{
  "url": "https://www.wikihow.com/Make-Gratin-Dauphinoise-Without-Cream",
  "title": "How to Make Gratin Dauphinoise Without Cream",
  "steps": [
    {
      "title": "Preheat the oven.",
      "content": "Preheat the oven. To ensure that the oven is hot enough to bake the gratin, you must preheat it. Set the temperature to 425°F (220°C), and allow it to fully heat. [1] X Research source"
    },
    {
      "title": "Rub the garlic clove over a shallow baking dish.",
      "content": "Rub the garlic clove over a shallow baking dish. For the gratin, you’ll need a fairly shallow baking dish. Use a clove of peeled garlic to rub down the interior of the dish. This helps season the dish so the gratin has an extra level of flavor. [2] X Research source A ceramic pie or tart dish works best for making the gratin. You can discard the garlic clove after you’ve rubbed down the baking dish or save it for another recipe."
    },
    {
      "title": "Mist the dish with olive oil spray.",
      "content": "Mist the dish with olive oil spray. Hold the bottle of spray 5- to 6-inches (13- to 15-cm) from the baking dish and evenly coat the entire interior. Be careful not to disturb any of the garlic on the inside of the dish. [3] X Research source"
    },
    {
      "title": "Peel",
      "content": "Peel and cut the potatoes into thin slices. For the gratin, you’ll need 6 medium Yukon Gold potatoes. Peel the potatoes, and then use a sharp knife to cut them into slices that are no thicker than ⅛-inch (3-mm). [4] X Research source You’ll know the potatoes are the right thickness if they look thin enough to fry up as potato chips. You can use a mandoline to slice the potatoes if you prefer."
    },
    {
      "title": "Combine the potatoes, butter, salt, pepper, and garlic powder.",
      "content": "Combine the potatoes, butter, salt, pepper, and garlic powder. Add the potatoes to a large bowl with 2 tablespoons (28 g) of melted light butter, ½ teaspoon (1 g) of garlic powder, and salt and white pepper to taste. Toss the ingredients well, so the potatoes are evenly coated. [5] X Research source"
    },
    {
      "title": "Layer some potato slices and cheese in the baking dish.",
      "content": "Layer some potato slices and cheese in the baking dish. Arrange about half of the potato slices in a thin layer so they aren’t piled up on top of one another. Next, sprinkle about ¾ cup (81 g) of finely grated Gruyere cheese over the potatoes. Cover the cheese with the remaining potatoes. [6] X Research source"
    },
    {
      "title": "Bring the milk, thyme, bay leaf, and nutmeg to a boil.",
      "content": "Bring the milk, thyme, bay leaf, and nutmeg to a boil. Add 1 cup (273 ml) of fat-free milk, a bay leaf, 2 teaspoons (3 g) of thyme, and ¼ teaspoon (½ g) of nutmeg to a small saucepan. Heat the mixture on medium-high heat until it comes to a boil, which should take about 5 minutes. [7] X Research source You can use a lactose-free or non-dairy milk, such as soy. Non-dairy milks tend to be thinner, though, so your finished gratin may not be as thick and creamy as traditional gratin dauphinoise. Make sure you're using whole milk rather than reduced-fat milk. If you use reduced fat milk, the sauce will break and you'll end up with a goopy mess."
    },
    {
      "title": "Pour the milk mixture over the potatoes.",
      "content": "Pour the milk mixture over the potatoes. Take the saucepan directly off the stove, and evenly distribute the milk mixture over the entire gratin. All of the potatoes should be doused with the liquid. [8] X Research source"
    },
    {
      "title": "Sprinkle the rest of the cheese over the potatoes.",
      "content": "Sprinkle the rest of the cheese over the potatoes. Use the remaining ¾ cup (81 g) of finely grated Gruyere cheese to cover the top layer of potatoes. Distribute the cheese as evenly as possible to ensure that all of the potatoes are covered. [9] X Research source"
    },
    {
      "title": "Cover the dish and bake the grain until the potatoes are tender.",
      "content": "Cover the dish and bake the grain until the potatoes are tender. Once the gratin is fully assembled, place a piece of foil over the top of the baking dish. Add the dish to the preheated oven, and allow it to bake until the potatoes are fork tender, which should take 30 to 40 minutes. [10] X Research source"
    },
    {
      "title": "Uncover the gratin and cook for another 10 minutes.",
      "content": "Uncover the gratin and cook for another 10 minutes. When the potatoes are tender, take the foil off the baking dish and return the gratin to the oven. Continue cooking the gratin so the top layer of cheese begins to brown slightly. [11] X Research source"
    },
    {
      "title": "Let the dish rest for several minutes before serving.",
      "content": "Let the dish rest for several minutes before serving. Remove the gratin from the oven once it begins to brown on top. Leave the dish out on the counter for 5 to 10 minutes to help it set up a bit. Serve the grain while it’s still warm. [12] X Research source"
    }
  ]
}