{
  "url": "https://www.wikihow.com/Get-the-Truth-Out-of-a-Liar",
  "title": "How to Get the Truth Out of Somebody Calmly",
  "steps": [
    {
      "title": "It's unlikely the person will confess in front of a bunch of other people.",
      "content": "It's unlikely the person will confess in front of a bunch of other people. If you think someone may be lying to you, arrange a one-on-one meeting with them or broach the subject in private. This gives the person a comfortable space to tell the truth, as they may feel less judged or put on the spot. [1] X Research source"
    },
    {
      "title": "This can make the person more comfortable telling the truth.",
      "content": "This can make the person more comfortable telling the truth. Slow down your speech and say your words in a calm manner. Avoid yelling or using an aggressive tone of voice. [2] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. That may cause them to get defensive and less likely to tell the truth. [3] X Research source Adopting a more even keel tone can make the person think that you're more interested in understanding their behavior than accusing them of doing something wrong. [4] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020."
    },
    {
      "title": "If they keep giving you the same canned response, they may be lying.",
      "content": "If they keep giving you the same canned response, they may be lying. If you're still not sure if they're lying but feel like something is up, try repeating your question in varying ways. It's likely that the person is lying if they don't change the wording of their response. Repeating the question may also cause them to get uncomfortable and potentially confess. [5] X Research source Let's say an employee took money out of the donation jar at an event. Ask them, \"How come there were $20 dollars missing from the jar?\" Next, ask, \"What happened to the $20 dollars?\" Then, \"If all the donations were recorded accurately, why is there a missing $20 dollars?\" If their answer doesn't change, especially their exact word choice, that's a sign that they're giving a premeditated response and are not being genuine. Don't take this as a definite sign that they're lying, though. It's also possible that they're just really nervous and don't know what to say."
    },
    {
      "title": "Make them think what they did isn't such a big deal.",
      "content": "Make them think what they did isn't such a big deal. Use statements that minimize the severity of their lie as well as the consequences that they will face if they tell the truth. People who lie often fear the repercussions of their actions, which makes them less likely to fess up. [6] X Research source Try something like, \"I won't be angry. I just want us both to be on the same page\" or \"I don't want to make this a bigger deal than it is. I just want to understand what happened.\""
    },
    {
      "title": "Show that you understand their point of view.",
      "content": "Show that you understand their point of view. Use empathetic language like \"I understand\" and \"I completely get it.\" Make an effort to show that you understand their motivations, too. [7] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. Even if you don't support their behavior, validating their perspective can help level the playing field so that the liar feels more comfortable admitting what happened. [8] X Research source Maybe your partner lied to you about where they were for the evening. Say, \"I know you're not telling me, but I understand why you did this. It's been stressful at home. It makes sense that you'd want to be by yourself for a while.\" Empathizing with their behavior doesn't mean you have to support what they did. Use it as a tool to get the truth out in the open and diffuse the conflict, then discuss the ramifications of their actions."
    },
    {
      "title": "This can really make a liar uncomfortable.",
      "content": "This can really make a liar uncomfortable. Their discomfort may prompt them to tell the truth. After you've asked them a question, pause and look them in the eye. Suppress the need to fill up the silence and wait for them to respond instead. This may put pressure on the person who's lying to confess what happened. [9] X Research source"
    },
    {
      "title": "List out all of the facts and be thorough.",
      "content": "List out all of the facts and be thorough. This encourages the person who's lying to disagree with your reading of the events. It may even prompt them to confess to get the story straight. To really encourage them to tell the truth, exaggerate what they did so that the person feels like they have to reveal what actually happened. [10] X Research source Maybe you can't find your favorite dress and you know that your sister took it. Say something like, \"When I left for the weekend, I hung up all my clean clothes. I came back to find the dress, my tights, and my favorite necklace missing!\" This may prompt your sister to confess with something like, \"I only took the dress!\""
    },
    {
      "title": "Feeling judged can make the person more reluctant to tell the truth.",
      "content": "Feeling judged can make the person more reluctant to tell the truth. Though it may be tempting to just say that they're lying (especially if you know it's true), hold off on any direct accusations. [11] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. Putting a liar on the spot may cause them to place the blame on you, lash out, and get defensive. [12] X Research source"
    }
  ]
}