{
  "url": "https://www.wikihow.com/Hide-Alopecia",
  "title": "How to Hide Alopecia",
  "steps": [
    {
      "title": "Comb or style your hair to hide smaller patches of missing hair.",
      "content": "Comb or style your hair to hide smaller patches of missing hair. If you’re dealing with a few frustrating bald spots, combing or styling your hair differently can do wonders to hide your missing hair. If you have shorter hair, comb your hair in the direction of the hair loss to cover it. If alopecia affects both sides of your head, consider shaving the sides for a simple undercut. For longer hair, tie it up in a ponytail or bun to cover missing hair on top of your head. If you’re missing hair on the sides, straighten your hair and let it hang over the missing patches. Alopecia areata is a temporary form of alopecia that results in small patches of missing hair. While it may be frustrating now, keep in mind that your hair is almost always going to grow back. If you have traction alopecia, where hair loss is triggered by pressure on your hair, avoid tying your hair up or brushing your hair too often."
    },
    {
      "title": "Spray root concealer near your roots to hide traction loss.",
      "content": "Spray root concealer near your roots to hide traction loss. [1] X Expert Source Courtney Foster Licensed Cosmetologist Expert Interview. 9 December 2019. If you have traction alopecia, your hair is likely coming out in patches where it’s thinner at the root. Purchase a root concealer that matches the color of your hair. Gently lift your hair up to access the effected roots. Then, spray your root concealer into the missing patch for 3-4 seconds. Inspect the roots to see if the color is filled in and reapply your concealer as needed. [2] X Research source Root concealer is typically designed to hide grey hairs, but it can also add color to your scalp and hair to make it look full and give it volume."
    },
    {
      "title": "Apply hair mascara to thinner hairs near smaller patches.",
      "content": "Apply hair mascara to thinner hairs near smaller patches. Hair mascara is a hair coloring tool used to add streaks of color or cover grey hair. Purchase a hair mascara that matches the color of your hair. To apply it, unscrew the cap on the mascara and brush it into both sides of your thinned-out hair. Continue reloading the built-in brush and reapplying the mascara until the hair around your small patch is thick enough to cover the spot. [3] X Research source This is not the best option for larger patches of missing hair, since the mascara doesn’t add color to your scalp."
    },
    {
      "title": "Use artificial hair fibers to cover obvious spots on shorter hair.",
      "content": "Use artificial hair fibers to cover obvious spots on shorter hair. Purchase a bottle or container of artificial hair fibers that matches your natural hair color. Spray the patch where you’re missing hair with a holding hair spray until the entire area is wet. Then, tilt your head and shake the bottle of hair fibers over your missing patch. Continue shaking the bottle until the hair fibers are covering the area. Then, apply an additional layer of holding spray to keep the fibers from moving or falling off. [4] X Research source This is an ideal option if you have a shorter haircut and don’t need to worry about long strands of hair rubbing against the location where you applied the hair fibers. It is not a great choice if you have longer hair, though."
    },
    {
      "title": "Wear a hat or head cover to hide temporary hair loss.",
      "content": "Wear a hat or head cover to hide temporary hair loss. If you tend to lose hair but it grows back, wear a hat for a few weeks while you’re waiting for the hair to return. Alternatively, wrap a scarf or bandanna around your head at an angle where it will cover your patches of missing hair. Covering temporary hair loss is the easiest way to hide it without putting too much effort in while you’re waiting for the hair to come back. [5] X Research source This is a great option if you don’t want to put any product in your hair."
    },
    {
      "title": "Get a high-quality wig made to completely cover your head.",
      "content": "Get a high-quality wig made to completely cover your head. A wig is the best way to handle permanent hair loss without having a surgical procedure or seeking medical treatment. Contact a high-quality wig producer and let them walk you through the process. Have the circumference of your head measured and select a wig style that matches the style you like. Have your wig made and wear it whenever you’re going out to look like you again! [6] X Research source Alopecia universalis is often permanent form of alopecia. It causes a total loss of hair, often including the body and eyebrows. There’s no need to worry, though—wigs are getting better and better every year. You probably know someone that wears a wig and haven’t even noticed yet! Dermatologists and hair-loss specialists will be able to recommend a high-quality wig producer that specializes in constructing wigs for alopecia patients."
    },
    {
      "title": "Fill in your eyebrows using a stencil and eye shadow.",
      "content": "Fill in your eyebrows using a stencil and eye shadow. Purchase an eyelash stencil that suits the natural shape of your brow. Get a soft makeup brush and load it with an eyeshadow that matches your hair’s natural color. Hold the eyebrow stencil over your first eye and brush over the stencil until you fill in the color. Then, remove the stencil and brush gently over the shadow with a clean brush to smooth the edges out. Next, use an eyeliner pencil to draw small hairs into the brow and add some texture. Repeat this process using the other stencil on your other eye. [7] X Research source It may feel kind of awkward to do this at first, but the more you get used to drawing in your eyebrows, the easier it will become."
    },
    {
      "title": "Use eyelash extensions to give your eyes their natural look.",
      "content": "Use eyelash extensions to give your eyes their natural look. Squeeze a thin line of eyelash glue along your upper and lower eyelids. Next, apply a thin layer of glue to each of your eyelash extensions. Wait for all of the glue to turn clear. Use tweezers to attach the corner of your first lash to the corner of your eyelid. Then gently pull the lash down until the glue along your eye connects with the glue on the lash. Repeat this process for each of the eyelashes you’re adding. [8] X Research source You can glue your eyelash extensions on yourself or hire someone at a salon to do it for you. If you wear eye makeup, apply your makeup first and add your eyelashes after."
    },
    {
      "title": "Opt for hair transplants to regain a natural head of hair.",
      "content": "Opt for hair transplants to regain a natural head of hair. If alopecia is only causing hair loss on your head, talk to your doctor about getting hair transplants. A medical hair transplant involves transferring follicles from one part of your body (or from a donor) and surgically implanting them in your scalp. [9] X Expert Source Courtney Foster Licensed Cosmetologist Expert Interview. 9 December 2019. If the procedure is right for you, get a referral from your doctor to see a specialist and get a hair transplant. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Hair transplants may not work for some alopecia patients. Talk to your primary care doctor and consult a dermatologist to see if hair transplants may be able to bring your head of hair back. It will take time for your hair to grow back, but this can be a permanent solution if you’re patient and the procedure works."
    },
    {
      "title": "Use micropigmentation to replace your eyebrows and hair line.",
      "content": "Use micropigmentation to replace your eyebrows and hair line. If your hair and eyebrows have disappeared completely, talk to your doctor about micropigmentation. Micropigmentation is the process of inserting hair pigment into your follicles to create the appearance of actual hair. Get a referral from your doctor to visit a micropigmentation specialist and have the procedure carried out. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Micropigmentation is often used to create the appearance of eyebrows or a hair line for wigs and transplanted hair."
    }
  ]
}