{
  "url": "https://www.wikihow.com/Make-Samurai-Armor",
  "title": "How to Make Samurai Armor",
  "steps": [
    {
      "title": "Use a shirt to trace a pattern for the chest plate.",
      "content": "Use a shirt to trace a pattern for the chest plate. Take a t-shirt and tuck the sleeves inside. Place the shirt onto a large sheet of cardboard and trace around it with a pen, making it longer at the hem. Put the shirt away when you are done. You are making the chest plate longer because you will be cutting it apart and overlapping it. You can also use craft foam or EVA foam. The type used on yoga mats may also work."
    },
    {
      "title": "Divide the pattern into eight segments, then number them.",
      "content": "Divide the pattern into eight segments, then number them. Draw 7 horizontal lines across your pattern to divide it into 8 equal-sized sections. These will make the overlapping horizontal plates."
    },
    {
      "title": "Cut the pieces out and number them F1 through F8.",
      "content": "Cut the pieces out and number them F1 through F8. The top piece will be F1 and the bottom piece will be F8. This will help you keep track of your pieces. The \"F\" will strand for \"Front.\" You will be making another set of plates for the back shortly [1] X Research source"
    },
    {
      "title": "Trace and cut slightly larger pieces out of fake leather.",
      "content": "Trace and cut slightly larger pieces out of fake leather. Lay the pattern pieces out on a sheet of fake leather. Trace around them, adding ½ to 1-inch (1.27 to 2.54-centimeter) seam allowances. Cut the fake leather out, then clip the corners to help reduce bulk. [2] X Research source Cut notches into the collar of the top piece. This will prevent wrinkling. Number the fake leather pieces on the back so that they match up with the cardboard pieces."
    },
    {
      "title": "Cover the front of each plate with fake leather.",
      "content": "Cover the front of each plate with fake leather. Lay a piece of fake leather on a flat surface, wrong side up. Coat it with glue, then place a matching cardboard piece on top, number side up. Wrap the edges of the fake leather around the edges of the cardboard piece. Repeat this process for the other pieces. [3] X Research source You may need to secure the edges with a fast-dying glue, such as hot glue. If the fake leather won't stay down, you can secure it with clips."
    },
    {
      "title": "Repeat this section for the back of the chest plate.",
      "content": "Repeat this section for the back of the chest plate. This time, number the pieces B1 through B8. You will also want to make the shoulders on the back piece longer. This will make the chest plate easier to assemble. You can use a similar method to make upper arm pads and a paneled skirt. Make these using a rectangle base."
    },
    {
      "title": "Punch two rows of holes on each side of your chest plate segments.",
      "content": "Punch two rows of holes on each side of your chest plate segments. You can do this with a hammer and a nail. Each narrow edge needs to have two rows of six holes. Make the holes towards the bottom half of the collar piece (F1). Make the holes towards the top half of the other pieces (F2 through F8). This will allow you to overlap them upwards, like reverse shingles on a roof. [4] X Research source You can make more sets of holes down the middle of each chest plate segment for more detail. [5] X Research source"
    },
    {
      "title": "Thread two long pieces of cording through the holes on the left side of F1.",
      "content": "Thread two long pieces of cording through the holes on the left side of F1. Cut two long pieces of colored cording. Thread the cords through the first set of holes. Start from the front of the piece so that the cords come out the back. Leave a couple of inches of cording at the front; you'll need this to assemble the armor. [6] X Research source Don't worry about the right side of F1 just yet."
    },
    {
      "title": "Cross the cords, then thread them down through the next set of holes.",
      "content": "Cross the cords, then thread them down through the next set of holes. Cross the left cord over and thread it down through the next right hole. Cross the right cord over and thread it down through the next left hole. They should form an X shape. [7] X Research source"
    },
    {
      "title": "Thread the cords up through the next set of holes.",
      "content": "Thread the cords up through the next set of holes. Bring the left cord up through the next left hole. Bring the right cord up through the next right hole. You do not need to cross the cords, since this is the back of the piece. [8] X Research source"
    },
    {
      "title": "Place F2 on top of F1 and weave the cords through the next set of holes.",
      "content": "Place F2 on top of F1 and weave the cords through the next set of holes. Make sure that the top edge of F2 is covering the bottom edge of F1. Push the cords up through the first set of holes on F2. [9] X Research source Don't worry about the right side of the plates just yet."
    },
    {
      "title": "Cross the cords and continue lacing the pieces.",
      "content": "Cross the cords and continue lacing the pieces. Cross the cords, right over left, and bring them down through the next set of holes. Push them up through the left set of holes on F2, and up through the first set of holes on F3. Keep lacing the pieces in this manner until you reach the bottom of F8. [10] X Research source"
    },
    {
      "title": "Tie the cords off, then trim the rest off.",
      "content": "Tie the cords off, then trim the rest off. Leave a couple of inches/centimeters on each cord. This will allow you to tie the armor together at the waist."
    },
    {
      "title": "Repeat the process for the other side of the front chest plate.",
      "content": "Repeat the process for the other side of the front chest plate. Once you have that done, you can lace the back plate together. Punch two holes into the top edge of each shoulder on the back piece so that you can assemble the armor later."
    },
    {
      "title": "Tie the front and back chest plates together.",
      "content": "Tie the front and back chest plates together. Thread the cord tails from the top of the chest plate (F1) through the holes on the shoulder straps of the back piece (B1). Tie the cords together on each shoulder into a tight knot. If you don't plan on adding any other pieces, trim them off. If you made arm pads and a skirt, you can lace them together in a similar fashion. If you made arm pads, use the tails from connecting the shoulder straps to secure them. The cords into knots, then trim them off. [11] X Research source"
    },
    {
      "title": "Paint a hard hat black.",
      "content": "Paint a hard hat black. Buy a hard hat from the store, and paint it black using spray paint. You don't have to paint the inside, but you should paint the underside of the brim. [12] X Research source"
    },
    {
      "title": "Cut 10 thin strips out of craft foam for the vertical lines.",
      "content": "Cut 10 thin strips out of craft foam for the vertical lines. The strips need to be long enough to extend from the top of the helmet down to the brim. Use a craft blade and a straight edge to make the strips neat and straight. Plan on making them about ⅛ to ¼-inch (0.32 to 0.64-centimeter) wide. [13] X Research source You can also use gold cording or ribbon instead."
    },
    {
      "title": "Paint the foam gold.",
      "content": "Paint the foam gold. You can do this with spray paint or acrylic paint. You only need to paint one side, but you should paint the top and side edges. If you used gold cord or ribbon, you can skip this step."
    },
    {
      "title": "Hot glue the foam strips to the helmet.",
      "content": "Hot glue the foam strips to the helmet. Apply the hot glue directly to the back (unpainted) side of foam piece. Press the foam against the side of the helmet. Hot glue sets up quickly, so only work 1 to 2 inches (2.54 to 5.08 centimeters) at a time. Glue all of the strips to the helmet, making sure that they are evenly spaced. [14] X Research source"
    },
    {
      "title": "Add a gold coat button to the top of the helmet.",
      "content": "Add a gold coat button to the top of the helmet. Find a fancy coat button and paint it gold to match the vertical strips on the helmet. Hot glue it to the top of the helmet. Not only does this act as an ornament, but it helps hide the part where all of the strips connect. [15] X Research source"
    },
    {
      "title": "Make the neck protector.",
      "content": "Make the neck protector. Use the same technique and materials as you did for the chest plate. Cut out four rectangles long enough to wrap around half of the helmet's brim; each one needs to be a little longer than the previous one. Cover and lace them together using the same technique as you did for the chest plate. The shortest rectangle goes on top, and the largest goes on the bottom. [16] X Research source For added support, add another set of lacing holes down the middle of each neck protector segment. If you don't have enough of the base materials left, try one of the following: cardboard, cardstock, poster paper, or craft foam for the base rectangles. If you don't have enough fake leather left, you can paint the base material to match the helmet instead."
    },
    {
      "title": "Secure the neck protector to the helmet.",
      "content": "Secure the neck protector to the helmet. There are two ways that you can do this. You can punch holes in the bottom of the helmet, then thread the cords from the neck protector through the holes and tie them into knots. You can also glue the neck protector to the back of the helmet using hot glue or industrial-strength glue."
    },
    {
      "title": "Create a crest.",
      "content": "Create a crest. This is one of the most important features on a samurai helmet. Cut a circle and a crescent moon shape out of craft foam. The crescent needs to be about the same height as the helmet, or taller. The circle needs to be small enough to side inside the crescent, a few inches across. You can also make the crescent using lines that curve inward then out, like horns. [17] X Research source"
    },
    {
      "title": "Assemble the crest.",
      "content": "Assemble the crest. Turn the crescent on its side, so that it looks like a U. Place the circle on top, making sure that the bottom edges match up. Hot glue the circle in place. [18] X Research source The circle needs to be small enough to fit inside the moon's cusp."
    },
    {
      "title": "Paint the crest gold.",
      "content": "Paint the crest gold. You can do this with spray paint or acrylic paint. Make sure that you get the edges of the foam as well. If you want to, you can draw details onto the crescent moon, such as a dragon."
    },
    {
      "title": "Hot glue the crest to the helmet.",
      "content": "Hot glue the crest to the helmet. Place a large swirl of hot glue on the back of the crest. Press it against the helmet, right above the front brim. The prongs of the crescent moon should be pointing upwards."
    },
    {
      "title": "Paint a costume samurai mask using glossy black paint.",
      "content": "Paint a costume samurai mask using glossy black paint. You can find them in costume shops and online. [19] X Research source You can also make your own by buying a full-face mask from the craft store, then doing the following: Cut out the mouth in a rectangle shape. Cut off the top part, about mid-cheeks and up, but leave the nose bridge intact. Cover the mask with paper mache. Sculpt over it using paper clay or paper mache paste. Use pictures of real samurai masks for reference. Paint the mask black."
    },
    {
      "title": "Add some details.",
      "content": "Add some details. If you added teeth to your mask, paint them white. You can also paint the lips reddish, or another dark color. Some masks have mustaches. Gather some stiff bristles and tie them together in the middle with string. Hot glue the mustache to the upper lip, just below the nose. If your mask didn't come with straps, add a strong piece of elastic to the back so that you can wear it under the helmet. [20] X Research source"
    }
  ]
}