{
  "url": "https://www.wikihow.com/Make-Divining-or-Dowsing-Rods",
  "title": "How to Create a DIY Dowsing Rod",
  "steps": [
    {
      "title": "Find or cut a forked (Y-shaped) branch.",
      "content": "Find or cut a forked (Y-shaped) branch. This branch can stem from a tree, a bush – any substantial wood source. Find or use pruners to cut a branch that is at least a foot long, from tip to tip. Make sure that the forks are relatively equal in length; otherwise, your dowsing rod may be unbalanced. [1] X Research source Scan the ground for forked twigs that have already broken – perhaps by the passing of a deer, or perhaps by something more mysterious. If you see a perfect Y-shape that is still growing from a tree, feel free to cut it off and use it; some dowsers prefer rods that are freshly cut. If you break the forked branch from a tree, do it with intention. Think about the tree, the surrounding area, and why you are commissioning this dowsing rod. Consider leaving something of your own behind to replace what you have taken from the tree."
    },
    {
      "title": "Try to find the branch in the same area that you'll be using it.",
      "content": "Try to find the branch in the same area that you'll be using it. If you're going to be using this dowsing rod to, say, explore an unfamiliar stretch of woods, or look for water in a mysterious valley, try to find your dowsing rod nearby. Look at the brush at the edge of the woods; look for a tree at the rim of the valley. Some dowsers prefer to use branches from particular trees. [2] X Research source Hazel and witch hazel branches are commonly used in Europe and the U.S., respectively – as are willow and peach tree cuttings. [3] X Research source These branches are popular because they are light and porous: many believe that rods from these trees can better absorb vapors rising from buried metals or water, which weighs down the un-forked end so that it points toward the source."
    },
    {
      "title": "Decorate the dowsing rod, if desired.",
      "content": "Decorate the dowsing rod, if desired. If you only plan to use your rod once, you may not care to decorate it, but if you intend to use it frequently, or if you plan to give it to someone as a gift, decorating your rod can make it more unique. Consider carving patterns into the dowsing rod (carefully!) with a knife, wrapping beads or charms around the wood, or even painting portions of it. Wrapping pretty fabric such as lace or printed cotton or silk onto your rod will give it some flair, and it'll also make your rod easier to hold. You can approach decoration minimalistically and just paint your rod, or you can go all out by adding dangling beads, feathers, charms, or ribbons, or covering your rod in glitter. If you don't want to carve your rod, check out the stamp selection at your local craft store. There may be nature-themed designs you can print onto your rod for decoration."
    },
    {
      "title": "Use your rod",
      "content": "Use your rod by holding one fork in each hand and pointing it away from you. Grip the handles of your dowsing rod in an underhanded grasp, with the heels of your hands facing upward and the rod (the bottom section of the Y) away from you at arm's length. Make sure that the fork is parallel with the ground or tilted very slightly downward. Walk slowly around until your divining rod discovers something! [4] X Research source You’ll know you’ve found what you’re looking for when the butt end of the rod points sharply downward at the ground, or when it whirls around and around. Some people believe the number of times your divining rod bobs indicates the depth (in feet or fathoms or other common units of measurements) of the item you're searching for. Historically, divining rods were used exclusively to locate water underground, but some people use them to locate all sorts of things, from money to dead bodies. There's not enough scientific evidence to suggest divining rods work for certain, but there are many people who claim to have had success using them. [5] X Research source"
    },
    {
      "title": "Acquire 2 equal lengths of wire, each about 20 inches (50.8 cm) long.",
      "content": "Acquire 2 equal lengths of wire, each about 20 inches (50.8 cm) long. The wire can be brass, copper, steel – any sturdy but bendable material. For an easy divining rod, try cutting a wire coat hanger into 2 equal pieces – or straightening 2 coat hangers by untwisting their hooks. You could also use metal antennae from an old radio or TV. [6] X Research source Choose the rod material based on purpose and availability. Brass and copper are especially popular because they don't rust. If you have wire fencing or coat hangers readily available, however, it won't hurt to work with what you have. Use a strong pair of wire cutters to trim the metal to size. There is no hard, fast rule that the wires must be 20 inches (50.8 cm) long. Make sure that they are long enough to dip of their own accord, and short enough to hold comfortably."
    },
    {
      "title": "Bend each wire into an \"L\" shape.",
      "content": "Bend each wire into an \"L\" shape. If your wires are 20 inches (50.8 cm) long, make the twist about 5 inches (12.7 cm) from one end. Be sure the bend creates a 90-degree angle in the wire. The short leg will become the handle of each rod. The longer legs will dip, cross, and guide you as you approach what you are looking for. [7] X Research source"
    },
    {
      "title": "Use cloth or other material to cover the dowsing rod's handles.",
      "content": "Use cloth or other material to cover the dowsing rod's handles. Create handles to cover the smaller legs of the L-shaped rods – 4-5 inches of the wire, or whatever is comfortable. The handles will protect your hands and give you a firmer grip. There is no one way to make a usable handle, so work with what you have available, whether it’s cloth or a hollow dowel rod. Use a length of 1 inch (2.5 cm) dowel rod, with a hole through the center. Alternatively, glue several cotton reels together into a cylinder. Use a pen. Remove the innards and caps of 2 cheap plastic pens, then thread the wire through the pen body. You may also pass the wire through a couple of drinking straws. Wrap a rag, a cloth, or a piece of felt around the shorter leg of each \"L.\" Tie the cloth in place with tightly-stretched rubber bands, a piece of twine, or even a safety pin."
    },
    {
      "title": "Hold one rod in each hand when dowsing.",
      "content": "Hold one rod in each hand when dowsing. Hold the wire by the handle (the shorter leg of the \"L\") so that the long part is parallel with the ground, with the rod resting flat over your index finger and the butt of the handle fitting into the heel of your hand. Make sure to hold the dowsing rods loosely enough that they can swing freely from side to side, but tightly enough that they won't fall from your grip. Hold the rods at arms length away from the body and about 9 inches apart. Remember to keep the rods parallel with the ground or tipped very slightly downward. Many people use dowsing rods to find water and other tangible objects, but some folks believe copper dowsing rods can be used to locate and manipulate energies that follow an invisible grid along the earth's surface. If the rods whirl counterclockwise, it's a sign of negative energy; if they spin clockwise, it indicates positive energy. These dowsers will use their copper rods to locate positive energy fields on which to build hospitals or sacred spaces, and they will place copper rods in areas with negative energy in order to cure that area of its bad chi. [8] X Research source Some dowsers also use metal dowsing rods to answer questions about the future or about decisions they must make, with the rods turning to the left to indicate a \"no\" or right to indicate a \"yes.\" [9] X Research source"
    }
  ]
}