{
  "url": "https://www.wikihow.com/Make-Instant-Coffee",
  "title": "How to Brew a Cup of Instant Coffee: 5 Delicious Methods",
  "steps": [
    {
      "title": "Heat up a mug of water.",
      "content": "Heat up a mug of water. Fill a mug with water and put it in your microwave for about 1–2 minutes, or until it starts to bubble. Alternatively, use a kettle and take it off of heat right before the water starts to boil, which should only take a few minutes. [1] X Research source You can also heat the water in a pot on your stovetop. Take the water off of the burner as soon as it starts forming bubbles on the bottom. For 1 serving, heat 6 fluid ounces (180 ml) of water. Use more water if you want to make additional servings. Just remember to leave room for milk or creamer in your mug if you don’t like drinking your coffee black. For a sweeter and richer coffee, heat milk to mix with your instant coffee instead of water. [2] X Research source"
    },
    {
      "title": "Add 1–2 teaspoons (2–4 g) of instant coffee to the mug.",
      "content": "Add 1–2 teaspoons (2–4 g) of instant coffee to the mug. Double-check the label on your instant coffee to see how much they recommend using to get the best taste. Scoop the instant coffee directly into your mug. [3] X Research source Some instant coffee comes in bags like tea, and others may come in prepackaged single servings."
    },
    {
      "title": "Stir your coffee into the mug of hot water.",
      "content": "Stir your coffee into the mug of hot water. Use a spoon to mix the coffee with the water so it dissolves completely. If you don’t feel any chunks of instant coffee with your spoon, you’re ready to enjoy your cup of coffee! [4] X Research source"
    },
    {
      "title": "Mix in sugar, spices, milk, or cream if you want them.",
      "content": "Mix in sugar, spices, milk, or cream if you want them. For a sweeter cup of coffee, sprinkle in about 1 teaspoon (5 g) of sugar. If you want to add some fancy flavors to make your coffee taste more gourmet, try stirring in a dash of cocoa powder, cinnamon, or allspice. Try dairy milk, almond milk, or coffee creamer for even more sweetness. [5] X Research source Homemade simple syrup or prepacked syrup (like Torani) are great additions to your coffee. You can also create barista blends with caramel and vanilla or peppermint chocolate. Sauces like caramel or chocolate are a nice addition, too, and adding sea salt can be a fun way to elevate the flavor."
    },
    {
      "title": "Mix 2 tsp (4 g) of instant coffee with hot water.",
      "content": "Mix 2 tsp (4 g) of instant coffee with hot water. Heat 2 US tbsp (30 ml) of water in a glass inside your microwave for 30 seconds to 1 minute. Add your instant coffee to the glass, and stir it together until the coffee granules dissolve completely. [6] X Research source Instant coffee dissolves better in hot water. If you try mixing it with cold water first, you may not have as flavorful a cup. Mix your coffee in a separate glass from the one you want to drink from. Just choose one that’s microwave-safe . Stir sugar or spices into the warm mixture if you want added flavors. Sugar, cinnamon, pumpkin spice, and nutmeg are all great choices to add to your coffee."
    },
    {
      "title": "Add 1⁄2 cup (120 mL) of cold water or milk to the warm mixture.",
      "content": "Add 1 ⁄ 2 cup (120 mL) of cold water or milk to the warm mixture. Add your water or milk directly to the glass that you’ve been mixing in. Water works great to make an iced coffee , but using cold milk will make your drink richer and creamier. Stir everything with a spoon until it’s thoroughly combined. [7] X Research source"
    },
    {
      "title": "Pour your cold coffee over some ice.",
      "content": "Pour your cold coffee over some ice. Fill a tall glass with ice cubes, and slowly pour your cold coffee over the ice. Give your coffee one last stir to help chill it even more before you enjoy it. [8] X Research source Make coffee ice cubes to add to your drink so the flavor doesn’t get watered down as they melt."
    },
    {
      "title": "Grind your coffee beans",
      "content": "Grind your coffee beans into a fine powder. Add your favorite beans to a coffee grinder and turn it onto the finest setting. Turn on your grinder and pulse your beans until they all have a fine consistency. To make a single serving of instant coffee, grind about 0.19 ounces (5.4 g) of coffee beans for 1 teaspoon of grounds."
    },
    {
      "title": "Sift the ground coffee beans to remove larger pieces.",
      "content": "Sift the ground coffee beans to remove larger pieces. Set a fine-mesh sieve on top of a bowl and pour your ground coffee in. Shake the sieve so all of the fine powdered coffee falls into the bowl underneath. If you have any large coffee grounds that don’t fall through the sieve, put them back into your grinder and run it again."
    },
    {
      "title": "Use 1 teaspoon (2 g) of your ground coffee for a single serving.",
      "content": "Use 1 teaspoon (2 g) of your ground coffee for a single serving. Take a scoop of the powdered coffee and add it to the bottom of your coffee mug. Fill your mug with about 6 fluid ounces (180 ml) of hot water and stir it together. Then, just sip and enjoy your coffee! Unlike instant coffee, homemade grounds won’t fully dissolve in the hot water but they’ll collect on the bottom of your mug. Just avoid drinking the last sip since it may have a strong, bitter taste."
    },
    {
      "title": "Store your homemade instant coffee in an airtight container for 7–10 days.",
      "content": "Store your homemade instant coffee in an airtight container for 7–10 days. Put your instant coffee in a glass mason jar or a plastic container with a lid so it doesn’t develop a stale flavor. Keep the coffee at room temperature in a cool, dry place until you’re ready to use it."
    },
    {
      "title": "Mix a 1 ½ tsp (3 g) of instant coffee with 1⁄4 cup (59 mL) of hot water.",
      "content": "Mix a 1 ½ tsp (3 g) of instant coffee with 1 ⁄ 4 cup (59 mL) of hot water. Heat the water in the microwave for 20 to 30 seconds to warm it up and make the coffee easier to dissolve. Add the instant coffee, and stir it up until the coffee granules are completely dissolved. [9] X Research source Combine the water and coffee in the mug you plan on using. Make sure the mug fits at least 1 cup (240 mL)."
    },
    {
      "title": "Add sugar or spices, if desired.",
      "content": "Add sugar or spices, if desired. If you like your latte sweet or flavored, add 1 teaspoon (2 g) of sugar, cinnamon, pumpkin spice, vanilla extract, or flavored coffee syrup. Stir it into your mug and mix it up until it’s completely dissolved in the water. [10] X Research source"
    },
    {
      "title": "Shake 1⁄2 cup (120 mL) of milk in a sealed jar.",
      "content": "Shake 1 ⁄ 2 cup (120 mL) of milk in a sealed jar. Pour your milk into a microwave-safe jar with a lid and seal it shut. Then, shake the jar vigorously for 30 to 60 seconds to make it foam up so you can brew a classic latte . [11] X Research source Alternatively, you can use a milk frother to create your foam."
    },
    {
      "title": "Microwave the milk uncovered for 30 seconds to separate the foam.",
      "content": "Microwave the milk uncovered for 30 seconds to separate the foam. Remove the jar’s lid and set it in your microwave. Run your microwave on medium to make the foam rise to the top so it’s easier to add to your latte. [12] X Research source"
    },
    {
      "title": "Pour the hot milk into the mug.",
      "content": "Pour the hot milk into the mug. Use a large spoon to hold back the froth as you pour the hot milk into the coffee base. Gently stir the mixture until it’s uniform in color. Leave a little space on the top of your mug so you can add the foam. [13] X Research source"
    },
    {
      "title": "Top the latte with the milk foam.",
      "content": "Top the latte with the milk foam. Spoon the milk froth from the jar over the latte. Leave the foam sitting on top of the coffee and avoid mixing it in. [14] X Research source Alternatively, add a dollop of whipped cream for extra richness."
    },
    {
      "title": "Garnish your latte with a sprinkle of spices to serve it.",
      "content": "Garnish your latte with a sprinkle of spices to serve it. Lightly dust the milk foam or whipped cream with cinnamon, nutmeg, cocoa powder, or any other spice of your choice. Sip or serve your latte promptly while it’s hot and the milk is still frothy for the best flavors. [15] X Research source"
    },
    {
      "title": "Add ice, instant coffee, milk, vanilla extract, and sugar to your blender.",
      "content": "Add ice, instant coffee, milk, vanilla extract, and sugar to your blender . Combine 6 ice cubes, 1 teaspoon (2 g) of instant coffee, 3 ⁄ 4 cup (180 mL) of milk, 1 teaspoon (4.9 ml) of vanilla extract, and 2 teaspoons (4 g) of sugar in your blender. [16] X Research source For a rich mocha flavor, add 2 teaspoons (9.9 ml) of chocolate syrup as well."
    },
    {
      "title": "Blend",
      "content": "Blend the mixture on high for 2 to 3 minutes. Put the lid on the blender and turn it on to the highest setting. Hold your hand on the lid as you blend everything to prevent it from splashing out. Run your blender until the ice is completely crushed and the mixture has a thick, smoothie-like consistency. [17] X Research source If the consistency is too thick, add a splash of milk. If the consistency is too runny, add an ice cube."
    },
    {
      "title": "Pour the blended coffee into a tall glass.",
      "content": "Pour the blended coffee into a tall glass. Take off the blender lid, and slowly pour the blended coffee into the glass. You may have to use a spoon or spatula to scrape some of the coffee off the sides of your blender. [18] X Research source Be careful when you’re pouring your coffee since the ice may stick together and make some liquid splash out."
    },
    {
      "title": "Garnish with whipped cream and serve it immediately.",
      "content": "Garnish with whipped cream and serve it immediately. Add final touches like whipped cream, chocolate syrup, or small chocolate chips. Alternatively, try sprinkling cocoa powder on top to add a light dusting of flavor. Enjoy your blended coffee while it’s still frozen so it doesn’t melt. [19] X Research source"
    }
  ]
}