{
  "url": "https://www.wikihow.com/Get-a-Quick-Appointment-With-a-Doctor",
  "title": "How to Get a Quick Appointment With a Doctor",
  "steps": [
    {
      "title": "Call your personal physician's office.",
      "content": "Call your personal physician's office. Most people would prefer to see their personal physician in the event of illness or injury. Your doctor knows you and your medical history and may provide a sense of ease. Before you consider other ways to seek treatment, call your doctor’s office first to see if they can accommodate you. Accept whatever the scheduler tells you and offer that you are flexible in when you can see your doctor, which can help you get an appointment. [1] X Research source It is possible the doctor will have a few \"walk-in\" slots reserved for people to be seen at the practice. You may not be able to see your specific doctor, but you would still be seen by someone that same day. Make sure to remain calm and courteous with the scheduler at your doctor’s office. Threatening them may make them more reluctant to work with you and find an appointment. [2] X Research source"
    },
    {
      "title": "Provide a brief but detailed description of your symptoms.",
      "content": "Provide a brief but detailed description of your symptoms. When talking to the scheduler, give a brief but specific description of your symptoms. This can help the call handler adequately assess the severity of your situation and may help you get into your doctor more easily. [3] X Research source Keep in mind that they may also advise you if you need to go to an emergency room for immediate treatment. Consider the nature of your complaints, if body function is affected, how long it has been bothering you, treatments that you have tried, and any thing that makes it better or worse. Use adjectives such as “sharp,” “throbbing,” “gushing,” or “draining” to describe your symptoms. If you are having trouble breathing, or with your circulation, you should call emergency services or go to an emergency room or casualty department in a hospital for immediate attention."
    },
    {
      "title": "Speak to the manager or head nurse.",
      "content": "Speak to the manager or head nurse. In many cases, the person answering the phone has no authority to make exceptions that could get you in to your doctor quickly. Ask to speak either to the office manager or head nurse, who may be able to fit you into the schedule. Explain your situation to the manager or nurse as specifically as possible. You may want to gently remind the staff remember that you have been a patient of the practice for a long time and really value the advice your doctor gives you. You can say that you would rather see your doctor than any other health professional, but don't try to use this as a threat or something to hold over the nurse's head."
    },
    {
      "title": "Email your doctor.",
      "content": "Email your doctor. If you can, email your doctor's practice or find your doctor's actual email address. Explain the urgency of your situation and kindly request to be seen as soon as possible. You may need to do a little Internet research to find your doctor’s email address, but now many doctors provide an address at which they can be reached for advice. Keep the email as brief as possible while describing your symptoms and the urgency of your situation. Most people won’t read more than one page."
    },
    {
      "title": "Ask for a referral.",
      "content": "Ask for a referral. Doctors will generally work with other doctors to best serve their patients. If you cannot get in to see your regular doctor, ask the office to refer or suggest another physician. Consider asking for the names of a couple of doctors in the event that the referrals are also busy."
    },
    {
      "title": "Thank your doctor’s staff.",
      "content": "Thank your doctor’s staff. In either case, if the doctor’s office can or is unable to accommodate you, offer the staff a genuine thank you for their efforts. This can help you in the future if you need an appointment."
    },
    {
      "title": "Contact your referral physician.",
      "content": "Contact your referral physician. If your primary physician’s office referred or recommended you to a different physician, contact this doctor’s office. Kindly explain that your primary physician referred you and you were wondering if this doctor can see you. Remember to remain calm and kind and work with the staff as much as possible. This can help you get an appointment quickly and leave a good impression not only on the staff, but also on your primary doctor’s office."
    },
    {
      "title": "Locate the nearest urgent care clinic.",
      "content": "Locate the nearest urgent care clinic. Many areas now have urgent care facilities for people who cannot get into their doctors or another medical professional. Urgent care facilities can help you avoid long waits in the ER while receiving immediate care for whatever is wrong with you. Remember that an urgent care facility is not a replacement for a primary care physician. You can find a local urgent care facility either in the yellow pages or by searching on the internet."
    },
    {
      "title": "Visit an urgent care facility.",
      "content": "Visit an urgent care facility. Urgent care facilities provide immediate medical care without an appointment. If you realize you need to see a doctor for a non-life threatening condition, visit the urgent care facility at your convenience. You do not need to call ahead or make an appointment at an urgent care facility. You will be triaged, with patients with the most severe or communicable symptoms being seen first. Be aware that you may have to wait for a short amount of time depending on your needs and illness."
    },
    {
      "title": "Urgent care facilities are not open at all times, so you may want to consider the ER if you need immediate care.",
      "content": "Urgent care facilities are not open at all times, so you may want to consider the ER if you need immediate care. [4] X Research source Urgent care centers cost significantly less than ERs, if cost is a concern to you. [5] X Research source Take any insurance information with you. Some facilities may not accept insurance and will bill you after treatment. There may be a fee you must pay upfront, especially if you do not have insurance."
    },
    {
      "title": "Go to the ER.",
      "content": "Go to the ER. If you cannot get an appointment and need to see a doctor immediately or are suffering from a life-threatening condition, go to the emergency room as soon as possible. Emergency rooms offer the benefit of always being open and they may be able to treat your illness or injury in less time than a doctor or urgent care center. [6] X Research source Only visit the ER if your condition is serious. An emergency room is not a replacement for a doctor and you shouldn’t take away time from patients who genuinely need immediate care if you can wait. [7] X Research source Visit the ER if you need to see a doctor during evening or early morning hours that your doctor or an urgent care facility is not open. [8] X Research source Make sure to always have any insurance information for your visit."
    },
    {
      "title": "Prepare to wait.",
      "content": "Prepare to wait. Emergency rooms can get very busy and address patients based on their need and severity of illness or injury. [9] X Research source If you decide to see a doctor at an ER, be prepared to wait to see a doctor, though the time may be less than waiting for an appointment with your primary care physician or the urgent care center. [10] X Research source If you are experiencing chest pain, difficulty breathing, or trauma that involves loss of blood, your care will be considered a priority."
    },
    {
      "title": "Use specific, detailed, and descriptive vocabulary.",
      "content": "Use specific, detailed, and descriptive vocabulary. Every person feels the symptoms of illness in different ways, so use words that are as specific, detailed, and descriptive as possible. This can help the doctor diagnose you and develop proper treatment. Adjectives can help the doctor understand how you feel. For example, if you have pain, explain it to your doctor by using terms such as dull, throbbing, intense, or piercing."
    },
    {
      "title": "Tell your doctor the truth.",
      "content": "Tell your doctor the truth. You should never feel embarrassed discussing anything with a doctor. Be absolutely honest when you discuss your symptoms or medical history. Not telling your doctor everything relevant to your health may make it hard to diagnose your symptoms. [11] X Research source Doctors get training for different kinds of medical conditions and contingencies. Symptoms that could embarrass you are probably something your doctor sees regularly. Don't be afraid to discuss things like STDs, rashes, or personal habits. Keep in mind that any information you give your doctor remains confidential by law."
    },
    {
      "title": "Summarize why you’re seeing your doctor.",
      "content": "Summarize why you’re seeing your doctor. Many doctors will ask \"What brings you to the office today?\" Be honest and tell your doctor all your symptoms, which can give your doctor context and may help her more effectively diagnose any illnesses during your visit. Some common symptoms include: Pain , fatigue, Nausea , gastrointestinal distress, fever, respiratory issues, or headache. For example, you can tell your doctor “I’ve been experiencing headaches and persistent vomiting for the past couple of weeks.\""
    },
    {
      "title": "Explain your specific symptoms and their location.",
      "content": "Explain your specific symptoms and their location. Describe your specific symptoms to the doctor, showing him where on your body where you are experiencing each ailment. This information may aid your doctor in making a definitive diagnosis and formulating possible treatment. [12] X Research source Remember to use specific and descriptive vocabulary as much as possible. If you’re having elbow pain, don’t say it’s on your arm, but point out to your doctor the exact spot on which you have the pain."
    },
    {
      "title": "Describe the beginning and regularity of your symptoms.",
      "content": "Describe the beginning and regularity of your symptoms. It could be vital to describe to your doctor when your symptoms started and how often you experience them. This may help your doctor formulate possible diagnoses. [13] X Research source Tell the doctor when your symptoms began, if and when they stop and how often you experience them. For example, “I haven’t been able to keep any food down for the past two days.\" Tell your doctor how the symptoms are affecting you and your lifestyle. Other things to mention include what helps relieve symptoms, what makes symptoms worse, any treatments you have attempted, any specific medication or substances you have taken to help alleviated the problem. Include how much over-the-counter medication has been used, and how your symptoms responded to treatment."
    },
    {
      "title": "Mention what alleviates or makes your symptoms worse.",
      "content": "Mention what alleviates or makes your symptoms worse. Tell the doctor if anything relieves or exacerbates your symptoms. She may be able to make a diagnosis and formulate potential treatment plan for you based on this information. [14] X Research source For example, if you have pain, describe movement that makes the pain worse. You can describe this by saying \"My ankle feels fine until I bend it towards my leg, and then I experience a sharp and shooting pain.\" Describe other situations or elements that make your symptoms worse. This includes food, drink, position, activity, or medication."
    },
    {
      "title": "Rate how severe your symptoms are.",
      "content": "Rate how severe your symptoms are. Describe how bad your symptoms are using a numerical scale of one to ten. This may help your doctor more effectively diagnose your condition and may further indicate the severity of your condition. The severity scale should range from one having virtually no impact on you to ten being the most excruciating pain you can imagine."
    },
    {
      "title": "Let your doctor know if others have the same symptoms.",
      "content": "Let your doctor know if others have the same symptoms. It’s very important to tell your doctor if someone else you know or with whom you have contact is experiencing the same issues as you. This may help your doctor formulate a diagnosis and any alert her to potential public health issues."
    }
  ]
}