{
  "url": "https://www.wikihow.com/Lose-10-Kg-Fast",
  "title": "How to Lose 10 Kg Fast",
  "steps": [
    {
      "title": "Cover half of the plate at every meal with non-starchy vegetables.",
      "content": "Cover half of the plate at every meal with non-starchy vegetables. Veggies should make up the bulk of your diet because they are low-calorie and contain lots of essential nutrients to keep you healthy. Many experts recommend at least 4 servings of vegetables per day, but if you want to lose weight then you'll need to eat more than that. By planning meals around a generous portion of non-starchy vegetables, you'll feel full without eating too much. Non-starchy vegetables include cauliflower, broccoli, carrots, zucchini, lettuces, asparagus, and lots of other delicious foods that can all be prepared in many different ways so you won't get bored of them."
    },
    {
      "title": "Include a serving of a lean protein in every meal.",
      "content": "Include a serving of a lean protein in every meal. Lean proteins include chicken and eggs, white fish (like salmon and tuna), some cuts of beef, and legumes. Proteins are important for weight loss because eating them helps your body to build lean muscle and boosts your metabolism. A good rule of thumb to remember is that a single serving of most meats is about the same size as your palm. If you don't eat meat, there are lots of plant-based meat alternatives available that are even healthier options! Look for them in the frozen section of your grocery store."
    },
    {
      "title": "Replace refined carbs with whole grains and lots of fiber.",
      "content": "Replace refined carbs with whole grains and lots of fiber . Many studies show that if you want to see quicker weight loss results from a diet, you should follow a low-carb diet. Instead of eliminating all carbs, however, you can focus on cutting out refined carbs and processed sugars and eating whole grains and plenty of fiber. This category of food should make up the smallest portion of every meal, just one serving or about 1/4 of the plate. Healthy carbs can be found in fruits, legumes (like chickpeas, lentils, and black beans), whole grains (like oats, brown rice, quinoa, or whole-wheat breads and pastas), and starchy vegetables. Stick to the proper serving sizes of the different types of carbs. Make sure to look at the nutrition label on your foods and measure them properly before eating."
    },
    {
      "title": "Look for low-calorie versions of your favorite condiments and dressings.",
      "content": "Look for low-calorie versions of your favorite condiments and dressings. Toppings for your favorite foods often are sneaky ways that calories and carbs show up in meals. One tablespoon of mayonnaise, for example, can have up to 90 calories! Restock your kitchen with low-calorie options of the dressings and condiments that you use often. You can also practice seasoning foods with herbs and spices, which naturally have fewer calories and more flavor."
    },
    {
      "title": "Supplement meals with a few small, nutritious snacks throughout the day..",
      "content": "Supplement meals with a few small, nutritious snacks throughout the day.. Having an occasional snack can be a part of a nutritious weight loss diet because it will keep you from getting too hungry and overeating. When you do snack, make sure that you’re choosing foods that are filling, high in nutrient content, and low in calories. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Examples of filling and healthy snacks include: a medium-sized fruit, like a banana or apple; a 1 ounce (28 g) serving of your favorite nuts; a small bag of carrots and celery with hummus; and beef jerky. Lots of snacks are available at grocery stores in 100 calorie serving packs. Stock up on these and keep one or two on you during the day just in case you get hungry. [2] X Research source"
    },
    {
      "title": "Stop drinking sodas, fruit juices, most alcohols, and other high-calorie drinks.",
      "content": "Stop drinking sodas, fruit juices, most alcohols, and other high-calorie drinks. One of the easiest ways to lower the amount of calories you consume in a day is to start with liquids because people often forget or don't know just how many calories their favorite drinks are. To lose weight fast , you'll need to eliminate these drinks from your daily life."
    },
    {
      "title": "Drink 2 to 3.25 kg (8 to 13 cups) of water throughout the day.",
      "content": "Drink 2 to 3.25 kg (8 to 13 cups) of water throughout the day. Water is a great drink to help you lose weight because it fills you up, reducing feelings of hunger, but doesn't have any hidden calories. Aim to drink approximately 8-13 glasses of water [3] X Research source Contrary to popular belief, retaining water and water bloat comes from not drinking enough water, not drinking too much."
    },
    {
      "title": "Have a cup of a low-calorie drink for added flavor.",
      "content": "Have a cup of a low-calorie drink for added flavor. If you find it's hard to drink only water, you can have other liquids, but make sure that they're low-calorie and have few sugars or carbs. Coffee and teas are great choices since they're mostly water. If you don't like those options, look for sugar-free lemonades, sports drinks, or flavored seltzers. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Keep a food journal",
      "content": "Keep a food journal to track your food intake. Dieticians can be expensive and hard to find, but you can use an online service or smartphone app to get the same benefits for free. These apps allow you to input what you ate and how much and then will often provide the amount of calories and other nutrients you've consumed throughout the day. With this information, you can track your eating and set smarter goals for weight loss. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source As you log foods, look to see what times of day you eat the most, the types of food that you get the most calories from, and the nutrient breakdowns of the foods you eat the most. This information is crucial for rethinking your dieting plan. Some great apps to check out are MyFitnessPlan, My Food Diary, and MyPlate. All of these (and more!) are available for free in the Apple App Store and on Google Play."
    },
    {
      "title": "Try out intermittent fasting routines.",
      "content": "Try out intermittent fasting routines . Instead of spreading out 3 large meals throughout the entire day, try to eat all of your food in a period of 8 or 10 hours and then fasting until the next day. Pick a window of time, like 11 am to 7 or 9 pm, and allow yourself to eat during then. Outside of those hours, only drink water or other no-calorie drinks. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Some studies have shown that intermittent fasting boosts metabolism and increases the amount of fat lost during regular exercise, which makes this a great addition to any dieting plan. An easy way to start intermittent fasting is to pick 1 or 2 days to do it in a week, then working your way up in 1- or 2-day increments to doing it full-time."
    },
    {
      "title": "Eat larger meals early in the day and smaller meals towards the evening.",
      "content": "Eat larger meals early in the day and smaller meals towards the evening. Foods eaten after 8 p.m. have the same amount of calories as before 8 p.m., but you're more likely to not be engaging in physical activity at night or closer to bed. Instead of having a small breakfast and finishing the day with a big dinner, have a larger breakfast and lunch and a small dinner. This way, you can work off the calories from those meals as you go about your day. [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If this doesn't work for your schedule, you can also try eating several smaller meals throughout the day instead of the 3 main ones. The goal is to eat enough to keep you full but not overindulge because you're hungry, which tends to happen if you start to feel hungry."
    },
    {
      "title": "Allow yourself to have cheat foods in moderation to keep from burning out.",
      "content": "Allow yourself to have cheat foods in moderation to keep from burning out. It can be tough to cut out lots of different foods at once, especially if that means you don’t get to enjoy a favorite food. Once or twice a week, give yourself the chance to eat something that you cut out, like a serving of your favorite ice cream or a glass of wine. Doing so will help curb cravings and keep you from over-indulging. There are lots of healthier versions of many junk foods (like ice cream, cookies, chips, or wine) available! Often these foods are right next to or close by the regular foods in the grocery store. If not, you can order these foods online and have them delivered to your door."
    },
    {
      "title": "Get in approximately 30 minutes of aerobic exercise a day.",
      "content": "Get in approximately 30 minutes of aerobic exercise a day. In addition to changing your diet, you'll need to add cardiovascular exercise. Cardio exercises are ones that get your heart rate up, which boosts your metabolism and burns fat. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Exercises like jogging or running , swimming, biking, or using a rowing machine are great ways to start if you haven’t done much cardio training before. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source When choosing your exercises, aim to pick activities that are moderate-intensity for you. You'll need to be out of breath, sweating and have your heart rate raised."
    },
    {
      "title": "Add in high-intensity interval training (HIIT) to your exercise routine.",
      "content": "Add in high-intensity interval training (HIIT) to your exercise routine. HIIT is a great method for maximizing the amount of fat you burn in a single workout session. When you do HIIT, you’ll want to get your heart rate as high as it can go for a short period of time, take a break, and then get your heart rate back up again. Make 1-2 of your cardio sessions in a week a HIIT workout. The combination of HIIT and steady-state cardio (like jogging for 30 minutes) is great for weight loss."
    },
    {
      "title": "Move more throughout the day.",
      "content": "Move more throughout the day. In addition to participating in planned, structured exercise, try increasing how much you move throughout the day. This can also help your overall calorie burn throughout the day. Take the stairs instead of the elevator whenever you can. When you go to the store or run an errand, park far away from the building and get in a short walk. If you have a one-on-one meeting at work, see if the other person would be okay with taking a walk as you talk. Bring your lunch to work and then walk to a nearby spot to eat it. Do quick exercises, like crunches , jumping jacks , or lunges , during commercial breaks as you watch TV."
    },
    {
      "title": "Increase the intensity of your workouts over time.",
      "content": "Increase the intensity of your workouts over time. If you notice that you aren't losing weight or have plateaued, you might need to make your workouts longer or harder. As your body begins to get used to working out, it also makes exercising more efficient, which burns fewer calories. To fix this, increase the length of time you spend doing cardio exercises or do them at a faster pace for the same amount of time. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, if you usually spend 20 minutes running each day, try going for 5 or 10 minutes longer each time. Or you can run at a faster pace for the same amount of time. Reader Poll: We asked 174 wikiHow readers they found cardio and aerobic exercises effective for fat loss, and 68% of them said yes. [Take Poll]"
    },
    {
      "title": "Include regular strength training in your weekly workout routine.",
      "content": "Include regular strength training in your weekly workout routine. Strength training is another type of exercise that will supplement weight loss in the short-term and help you keep the weight off in the long run. [11] X Research source No matter what weights exercise you're doing (like bicep/tricep curls, chest presses, pushups, or deadlifts), you should aim to do 3 sets of 12 repetitions for each one. In order to pick the best weight amount, start at a low number and increase the weight until you feel struggle a little to do the exercise. Strength or resistance training doesn't burn all that many calories by itself. However, it helps increase your lean muscle mass and your metabolism or your body's ability to burn calories. [12] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source"
    },
    {
      "title": "Do simple exercises that use your body weight instead of equipment.",
      "content": "Do simple exercises that use your body weight instead of equipment. Building muscle doesn't require a full rack of weights; you can do lots of different exercises with just your body. The best part of this is that you can do this type of training anywhere—at the office, in your house, in a park, or anywhere you have a moment of free time! [13] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Bodyweight exercises include pushups , planks, squats , lunges, mountain climbers, and burpees, among others. Aim to do 15 of any bodyweight exercise or hold a position for 1 minute as one set, and then repeat it 2 more times in a routine."
    },
    {
      "title": "Train all of the major muscle groups in order to lose weight over your entire body.",
      "content": "Train all of the major muscle groups in order to lose weight over your entire body. There are 6 major muscle groups to think about when creating a strength training routine: chest , biceps , triceps , back, legs, and shoulders. You should spend at least 20 minutes working on each muscle group twice a week, with a rest day in between one day of working a group and the next. [14] X Research source For example, you might focus on chest, biceps, and your back on Mondays and Wednesdays and choose to work your triceps, legs, and shoulders on Tuesdays and Thursdays."
    }
  ]
}