{
  "url": "https://www.wikihow.com/Log-Out-of-Messenger-on-iPhone-or-iPad",
  "title": "How to Sign Out of Facebook Messenger on iPhone or iPad",
  "steps": [
    {
      "title": "Open the Facebook app.",
      "content": "Open the Facebook app. This looks like a white f with a blue background. If you aren't already logged into your account, do so now. Facebook is available for iOS in the App Store . Since Messenger doesn't have the typical log out button, you'll need to use the Facebook app."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . This will be in the bottom-right corner. [1] X Research source"
    },
    {
      "title": "Tap Settings & Privacy.",
      "content": "Tap Settings & Privacy . This will be below Help & support . The menu will expand."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . A new page will open."
    },
    {
      "title": "Tap Accounts Center.",
      "content": "Tap Accounts Center . This is the section at the very top of the page. A new menu will open."
    },
    {
      "title": "Tap Password and security.",
      "content": "Tap Password and security . You can find this under the Account settings header."
    },
    {
      "title": "Tap Where you're logged in.",
      "content": "Tap Where you're logged in . This will be under the Security checks header."
    },
    {
      "title": "Tap your Facebook account.",
      "content": "Tap your Facebook account. If you have multiple accounts synced to your iPhone or iPad, you'll see them listed here."
    },
    {
      "title": "Tap Select devices to log out.",
      "content": "Tap Select devices to log out . A new page will open with a list of all devices currently logged into Messenger and your Facebook account."
    },
    {
      "title": "Tap the device logged into Messenger.",
      "content": "Tap the device logged into Messenger. If you need to sign out of Messenger on more than one device, you can select multiple, or tap Select all ."
    },
    {
      "title": "Tap Log out.",
      "content": "Tap Log out . This is the blue button at the bottom. You'll be logged out of Messenger on the selected device(s). This is also how you can log out of Facebook on all devices."
    },
    {
      "title": "Find the Messenger app on your Home screen.",
      "content": "Find the Messenger app on your Home screen. This looks like a white lightning bolt in a purple-blue speech bubble. You can also find the app in your App Library . Deleting the Messenger app is another way to sign out."
    },
    {
      "title": "Tap and hold the Messenger app icon.",
      "content": "Tap and hold the Messenger app icon. A pop-up menu will open. When it does, release your finger."
    },
    {
      "title": "Tap Remove App.",
      "content": "Tap Remove App . This is at the bottom of the menu in red."
    },
    {
      "title": "Tap Delete App.",
      "content": "Tap Delete App . This is at the top of the menu in red."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . Facebook Messenger will be deleted from your device. If needed, you can reinstall the app later."
    }
  ]
}