{
  "url": "https://www.wikihow.com/Make-Mineral-Water",
  "title": "How to Make Mineral Water",
  "steps": [
    {
      "title": "Pour the filtered water into an open container.",
      "content": "Pour the filtered water into an open container. Add 34 ounces (1 liter) of tap water that’s been filtered to a large bowl or measuring cup that you can easily stir a spoon in. You can use a basic water filter pitcher to filter the tap water, but it’s important to remove any heavy metals, such as lead, from it. [1] X Research source If you prefer, you can use bottled water in place of the filtered tap water."
    },
    {
      "title": "Mix the baking soda into the water.",
      "content": "Mix the baking soda into the water. Add ⅛ teaspoon (.6 g) of baking soda to the water, and stir well to ensure that it’s fully incorporated. Stirring the baking soda into the water adds the mineral sodium to the water."
    },
    {
      "title": "Add the epsom salt to the water.",
      "content": "Add the epsom salt to the water. Mix ⅛ teaspoon (.6 g) of epsom salts into the water, stirring until it’s fully incorporated. The epsom salts, also known as magnesium sulfate, help purify the water. You can find epsom salts at most grocery and drug stores. In the United States, be sure to use epsom salts that are marked as “USP” grade. They have tested by the FDA and are considered safe for human consumption."
    },
    {
      "title": "Stir the potassium bicarbonate into the water.",
      "content": "Stir the potassium bicarbonate into the water. Add ⅛ teaspoon (.6 g) of potassium bicarbonate to the water, and mix well to ensure that it’s fully blended in. It makes the water alkaline, so it can help to keep your bodily fluids from becoming too acidic. [2] X Research source Potassium bicarbonate is often used to keep wine from being too acidic so they aren’t too tart. You can usually purchase it from stores and online retailers that sell winemaking supplies."
    },
    {
      "title": "Transfer the mixture to a seltzer bottle and enjoy.",
      "content": "Transfer the mixture to a seltzer bottle and enjoy. After you’ve mixed all of the minerals into the water, slowly pour it into a seltzer bottle. When you squeeze the handle of the bottle to dispense the water into a glass, the bottle will carbonate the water with a carbon dioxide cartridge for refreshing, fizzy mineral water. Not all mineral waters are carbonated. If you prefer flat mineral water, pour it into any airtight container that you like."
    },
    {
      "title": "Add the filtered water to a container.",
      "content": "Add the filtered water to a container. Pour 34 ounces (1 liter) of filtered tap water into a large bowl or container that you can easily stir a spoon in. The water should be run through a water filter pitcher or another filtering system to remove any heavy metals, chemicals, or other contaminants. [3] X Research source"
    },
    {
      "title": "Stir in the epsom salts.",
      "content": "Stir in the epsom salts. Add ⅛ teaspoon (.6 g) of epsom salts to the water, and mix well to ensure that it’s fully incorporated. Epsom salts adds sodium to the water, which is a common ingredient in commercially made mineral water. [4] X Research source Epsom salts are also known as magnesium sulfate. They are often used for medicinal purposes, such as soaking sore muscles, so you can find them at most grocery and drug stores."
    },
    {
      "title": "Mix in the calcium chloride.",
      "content": "Mix in the calcium chloride. Add ⅛ teaspoon (.6 g) calcium chloride, and stir well to fully blend it in. Calcium chloride adds calcium to the water, which can help strengthen the bones. [5] X Research source Calcium chloride is often used as a preservative for canned foods. You can usually purchase it from stores or online retailers that sell canning and food preservation supplies."
    },
    {
      "title": "Use a seltzer bottle to carbonate the water or enjoy as is.",
      "content": "Use a seltzer bottle to carbonate the water or enjoy as is. Some natural mineral waters are carbonated. You can get the same effect by transferring your mineral water to a seltzer bottle that’s equipped with a carbon dioxide cartridge. However, you can also enjoy the mineral water flat. Pour it into any airtight container and enjoy. [6] X Research source"
    }
  ]
}