{
  "url": "https://www.wikihow.com/Make-Different-Colors-With-Food-Coloring",
  "title": "How to Make Different Colors With Food Coloring",
  "steps": [
    {
      "title": "Be aware of the possible dangers of artificial food dye.",
      "content": "Be aware of the possible dangers of artificial food dye. Some medical and scientific sources argue that artificial food dyes can be linked to cancer, brain tumors, hyperactivity, and behavioral issues in children. [1] X Research source The FDA has recently required manufacturers to add warning labels to the most commonly used artificial colors, including Yellow #5 & #6, Red #40 & #3, Blue #1 & #2, Green #3, and Orange B. But, these colors can still be added and are still added to processed food and are sold in stores. While it is up to you whether or not you use artificial dyes in your food, its important to be aware of the possible dangers associated with them and make an informed decision as a consumer."
    },
    {
      "title": "Consider using organic food coloring.",
      "content": "Consider using organic food coloring. There are several brands that produce organic or natural food coloring made from food and plant extracts available online and in stores. Keep in mind most of these products advise testing out several different organic colors to see which ones work the best for your project, as some colors may not hold up well under high heat. These organic dyes can also be expensive, so purchase a small quantity to try out before committing to larger, more expensive quantities."
    },
    {
      "title": "Make your own food coloring.",
      "content": "Make your own food coloring. Though this may be a more time consuming option upfront, it is cost efficient and you can be assured that the food coloring you’re using came from a natural source. Using the juices from fruits and vegetables like beets, pomegranate, carrot, cabbage and potato, as well as spices like cinnamon, turmeric, and cocoa powder, you can create beautiful, natural colors for your food. [2] X Research source However, it’s important to keep in mind the differences between natural dyes and artificial dyes, such as: Natural dyes often have a more dull or light hue than artificial dyes, as concentrated store bought food coloring requires only a few drops to add color, so it doesn’t change the texture of the food by adding a lot of liquid to it. So, it's a bit more challenging to get a true deep “red” color from beet juice rather than a light pink color as most recipes can’t handle the amount of liquid required to get a true red from beets. Because natural food coloring contains other foods, strongly colored foods also tend to be strongly flavored foods. So avoid using large quantities of homemade food dyes in your food to ensure it doesn’t overpower the food or render it inedible. For example, a small amount of cinnamon can add a deep brown color, but a large amount will make it difficult to taste anything but cinnamon. Use powders instead of juices, when possible. For example, using beet powder rather than beet juice will allow you get a nice deep red color, without adding excess liquid to your dish. If you decide to use this method, you will need to purchase or have access to a juicer. [3] X Research source"
    },
    {
      "title": "Print out a copy of the color wheel.",
      "content": "Print out a copy of the color wheel. This is the key reference for mixing colors so it may be useful to have a copy in front of you to visualize the colors as you mix them."
    },
    {
      "title": "Gather together your primary colors.",
      "content": "Gather together your primary colors. These are: blue, red, and yellow. You will need to mix these colors together to get secondary colors, and then mix the secondary colors together to get tertiary colors. Think of the primary colors as the parent colors in the family. When you combine any two primary colors, you get three new hues called secondary colors. So the secondary colors are like the children in the color family. When you mix a primary color and its nearest secondary color on the color wheel, you create six new hues called tertiary colors. So the tertiary colors are like the grandchildren in the color family. Experiment with your colors and their ratios. For example, if you want to make a light green that has more yellow than blue, start with yellow then slowly add blue until you get to the right value and hue."
    },
    {
      "title": "Mix your three secondary colors.",
      "content": "Mix your three secondary colors. Use three clean bowls to mix your colors. Keep in mind if you are using artificial dyes, you will only need a few drops of each color. If you are using natural dyes, you may need to use more of each color. Take yellow and combine it with red to create orange. Take red and combine it with blue to make purple. Take blue and combine it with yellow to make green."
    },
    {
      "title": "Create your tertiary colors.",
      "content": "Create your tertiary colors. Now that you’ve made your secondary colors, put out six more clean bowls to mix your tertiary colors. Take yellow and combine it with orange to make yellow-orange. Take red and combine it with orange to make red-orange. Take red and combine it with violet to make red-violet. Take blue and combine it with violet to make blue-violet. Take blue and combine it with green to make blue-green. Take yellow and combine it with green to make yellow-green."
    },
    {
      "title": "Play around with other hues, tints, tones, and shades.",
      "content": "Play around with other hues, tints, tones, and shades. Now that you have twelve basic colors, you can add more red or orange to make a certain shade of red or add more purple or blue to make a certain tone of blue. The sky’s the limit on the colors you can now create to add something extra to your food. If you’d like to start with a neutral base for food like icing or cake decorations, begin with pure-white frosting and then add colors to the frosting. Do not add vanilla extract to the frosting as this will alter the color. [4] X Research source"
    }
  ]
}