{
  "url": "https://www.wikihow.com/Heal-Cervicitis",
  "title": "How to Treat and Cure Cervicitis",
  "steps": [
    {
      "title": "Be aware of the symptoms of cervicitis.",
      "content": "Be aware of the symptoms of cervicitis. In some women, cervicitis produces no symptoms; you may not realize you have it until a doctor notices a problem during a routine gynaecological exam. However, many women do notice symptoms. These include: [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Abnormal vaginal discharge that has an odor or is a gray or yellow color. Spotting between menstrual periods or after sexual intercourse. A feeling of heaviness in the lower abdomen, especially during sex. A burning or itchy sensation when you urinate."
    },
    {
      "title": "Allow your doctor to perform a pelvic exam.",
      "content": "Allow your doctor to perform a pelvic exam. The symptoms of cervicitis can easily be confused with the symptoms of other conditions, so do not attempt to diagnose cervicitis yourself. Consult your primary care physician or gynecologist if you suspect you may have cervicitis. If your doctor suspects cervicitis, she will perform a standard pelvic exam, using a speculum to examine your cervix. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If your pelvic exam reveals cervicitis, your doctor will order the appropriate laboratory tests to confirm the cervicitis and determine its cause. These tests may include a culture of your cervical discharge, a culture of the cervical cells themselves, blood tests, and, if you are sexually active, tests for sexually transmitted infections, including gonorrhoea and chlamydia."
    },
    {
      "title": "Determine the cause of the cervicitis.",
      "content": "Determine the cause of the cervicitis. With the right tests, your doctor should be able to identify the cause of your cervicitis. There are two different kinds of cervicitis: infectious (also known as “acute”) and noninfectious (also known as “chronic”). Infectious cervicitis and noninfectious cervicitis have different possible causes and therefore require different treatment regimens. [4] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Infectious cervicitis is typically caused by a sexually transmitted infection (STI) such as gonorrhoea or chlamydia. It is usually treated with antibiotic medication. Noninfectious cervicitis can be caused by a number of things, including foreign objects, such as intrauterine devices and cervical caps, an allergic reaction to latex due to sexual intercourse with latex condoms, and douches, vaginal washes, and other products that can irritate the vagina and cervix. It is usually treated with antibiotics and with removal of the offending agent."
    },
    {
      "title": "Take the prescribed antibiotics for an STI.",
      "content": "Take the prescribed antibiotics for an STI. If you have infectious cervicitis caused by a sexually transmitted disease like gonorrhoea, chlamydia, or syphilis, your doctor will prescribe antibiotics to treat the infection. [5] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If you have gonorrhoea, your doctor will prescribe an antibiotic called Ceftriaxone, which can be administered in a single injection of 250 milligrams. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source In complicated or advanced infections, you may need stronger doses and/or additional oral antibiotics. Your doctor may also prescribe Azithromycin or Doxycycline, which are used to treat chlamydia. This step is taken because patients are often infected with both STIs. [7] X Research source If you have chlamydia, your doctor will prescribe an antibiotic called Azithromycin, which can be taken in a single oral dose of 1 gram. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Alternatively, she may prescribe Erythromycin, Doxycycline, or Ofloxacin; these drugs are typically taken for seven days. Additionally, your doctor will prescribe Ceftriaxone to treat gonorrhoea, as the two infections often co-exist. [9] X Research source If you have trichomoniasis, your doctor will prescribe an antibiotic called Metronidazole, which can be administered in a single dose. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you have syphilis, your doctor will prescribe penicillin. A one-time dose should be sufficient to cure syphilis in its early stages, when the infection is less than one year old. For more advanced cases, you may also need additional injections or other treatments. If you are allergic to penicillin, your doctor will prescribe Azithromycin. [11] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Take antiviral medications as prescribed.",
      "content": "Take antiviral medications as prescribed. If you have infectious cervicitis caused by a virus, such as genital herpes, your doctor will prescribe antiviral medications to treat the virus. [12] X Research source If you have genital herpes, your doctor will prescribe the antiviral drug Acyclovir, which is taken for five days. Alternatively, she may prescribe Valacyclovir or Famciclovir, used for three days and one day, respectively. If you have a severe or complicated case, you may need additional treatments and/or increased dosages. Keep in mind genital herpes is a chronic, lifelong infection and you will need to treat the disease continually once you contract it. [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Make sure your sexual partners are treated.",
      "content": "Make sure your sexual partners are treated. If you are treated for an STI, all of your partners need to be tested and treated, too. Sexually transmitted infections can be present in men and women without producing any symptoms at all, and untreated carriers of STIs can easily re-infect you in the future. Make sure all your previous sexual partners see a doctor. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Follow your doctor’s instructions and take your medication properly.",
      "content": "Follow your doctor’s instructions and take your medication properly. It’s important that you also tell your doctor if you are pregnant (or may possibly become pregnant), breastfeeding, or dealing with any other health issues before you are prescribed any medication. Contact your doctor if you have adverse reactions to your medication, including diarrhea, nausea, vomiting, and rashes. Cervicitis can become a serious, long term problem if it is not treated with the right medication and given time to heal properly. With the right medication and treatment, you can make a full recovery from cervicitis. However, if you have genital herpes, you will need to commit to lifelong management of this chronic infection."
    },
    {
      "title": "Consider cryosurgery.",
      "content": "Consider cryosurgery. If you have persistent non-infectious cervicitis, you may need to address the problem surgically with cryosurgery, also called freeze therapy. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Cryosurgery involves the use of extreme cold to destroy abnormal tissue. A cryoprobe, which is an instrument that contains liquid nitrogen, is inserted into the vagina. The cold compressed nitrogen makes the metal instrument cold enough to destroy the diseased tissues. Freezing is done for three minutes. The cervix is then allowed to thaw, and freezing is repeated for another three minutes. Cryosurgery is relatively painless, but you may experience cramping, bleeding, and, in more serious cases, infection and scarring. For two to three weeks after your surgery, you can expect to notice a watery discharge. This is caused by the shedding of dead cervical tissue."
    },
    {
      "title": "Talk to your doctor about cauterization.",
      "content": "Talk to your doctor about cauterization. Another possible surgical treatment for persistent non-infectious cervicitis is cauterization, also called heat therapy. Cauterization is an outpatient procedure that burns away the inflamed or infected cells. You will lie on your back with your legs in stirrups, and a speculum will be inserted into the vagina to hold it open. The cervix is then cleansed using a vaginal swab, and a heated probe is used to destroy the diseased tissues. Anesthesia may be used to prevent discomfort before cauterization. You may experience cramping, bleeding, and watery discharge for up to four weeks. Call your doctor, however, if the discharge has an offensive smell, or if the bleeding is heavy."
    },
    {
      "title": "Ask your doctor about laser therapy.",
      "content": "Ask your doctor about laser therapy. A third possible surgical treatment for persistent non-infectious cervicitis is laser therapy. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Laser therapy is typically done in an operating room under general anesthesia and involves the use of an intense laser beam/light to burn/destroy abnormal tissues. A speculum is inserted into the vagina to hold it open. The laser beam is directed toward any abnormal tissue. Anesthesia will limit your discomfort during the procedure. Afterward, you may notice cramping and bloody, watery discharge for two to three weeks. Call your doctor if this discharge has an offensive smell, or if you notice increased bleeding or pelvic pain."
    },
    {
      "title": "Abstain from sexual activity.",
      "content": "Abstain from sexual activity. You cannot cure cervicitis without medical care, especially if the cervicitis is infectious. However, you can take steps at home to make yourself more comfortable and help the prescribed treatments to work effectively. It’s important that you abstain from sexual activity until your doctor confirms you have healed from the infection. [17] X Research source If your cervicitis is infectious, you need to avoid spreading the bacteria or virus; even if your cervicitis is non-infectious, avoid having sexual intercourse as this could further irritate your cervix and make your symptoms worse."
    },
    {
      "title": "Avoid any vaginal irritants.",
      "content": "Avoid any vaginal irritants. Do not use products that may cause additional irritation or inflammation to your vagina or your cervix, including tampons and douching. [18] X Research source Use menstrual pads instead of tampons. Do not use scented soaps, sprays, or lotions. These and other products may cause irritation. Do not use a diaphragm for birth control."
    },
    {
      "title": "Wear comfortable, cotton under garments.",
      "content": "Wear comfortable, cotton under garments. Avoid tight, constricting underwear made of synthetic fabrics, as this can cause irritation and a buildup of moisture in the genital area. Look for 100% cotton undergarments to allow your genital area to breathe and stay clean. [19] X Research source"
    }
  ]
}