{
  "url": "https://www.wikihow.com/Make-Fake-Breasts",
  "title": "Make Your Own DIY Boobs on a Budget: 2 Easy Methods",
  "steps": [
    {
      "title": "Wear a bra",
      "content": "Wear a bra and stuff the cups with socks. Choose a bra that has a little padding already, which can help conceal the sock padding. Fold 1 sock up to approximately the size of the bra cup. Then slip the bra on. If you have breasts already, cup your breast with your hand, lift it up, and situate the sock at the bottom of the bra cup, under your breast. If you don’t have breasts, simply situate the socks inside the bra so that they fill out the bra. Use 1 sock per breast. Adjust the size by choosing thicker or thinner socks. If you want large breasts, use thick sweat socks. If you're only going for a small enhancement, use thin socks or ankle hosiery. [1] X Research source Choose socks made of a soft material so they won't rub your skin raw. If you're not using a bra, but want to have fuller breasts, try using breast tape . Breast tape is usually adhesive without being sticky, so your skin won’t hurt when ripping it off. Just add the tape to your nipples, pull up, and adhere it below your collarbone or on the top of your shoulders, depending on your clothes. [2] X Research source [v161997_b01´]. 12 October 2021."
    },
    {
      "title": "Stuff a bra with tissue or toilet paper.",
      "content": "Stuff a bra with tissue or toilet paper. This is one of the easiest and cheapest solutions. Unroll the desired amount of tissue from the spool and fold it up so it looks smooth. Lift your breasts, if you have any, and tuck the layered tissue beneath them; otherwise, use the toilet paper to fill out the whole bra. Be sure to situate the tissue deep into the bra cups to prevent it from spilling out when you're moving around. If you have access to socks, they make better stuffers because they're less likely to fall out. In a pinch, though, tissue paper gets the job done! [3] X Research source Wear a bra with a little padding to disguise the added tissue paper."
    },
    {
      "title": "Wear 2 bras at the same time.",
      "content": "Wear 2 bras at the same time. Choose 2 padded bras with molded cups that fit you relatively well. Put on 1 bra, then put on the other bra right on top of it. Adjust the straps and bands as needed so everything looks as smooth as possible underneath your clothing. For a more seamless look, wear a strapless bra underneath a regular bra. However, 2 regular bras with straps work fine. 2 strapless bras also work well! This technique is a particularly great option if you don’t have breasts or have very small breasts. [4] X Research source"
    },
    {
      "title": "Tuck silicone enhancement pads in your bra cups.",
      "content": "Tuck silicone enhancement pads in your bra cups. You can buy these at lingerie shops or order them online in a variety of sizes. Insert 1 of the silicone pads into your bra cup. If you have it on hand, use double-sided tape so the pad stays firmly in your bra and against your body. Simply pull off a small piece, stick it to the pad, then stick the pad to the bra. Once you've got both pads inserted, adjust your bra straps as needed until everything feels comfortable. Go with a padded bra to create a smooth appearance and hide the lines of the enhancement pads."
    },
    {
      "title": "Cut out 2 sets of bra cups from old bras.",
      "content": "Cut out 2 sets of bra cups from old bras. For best results, use the large or extra-large size. Make sure that they have no wires inside and are white. You’ll be covering these with several layers of pantyhose, so be sure to get a bra with a light base color. If you get a dark shade you may have a hard time getting an even color at the end. [5] X Research source"
    },
    {
      "title": "Glue 2 matching bra cups together to form a larger breast shape.",
      "content": "Glue 2 matching bra cups together to form a larger breast shape. Stack the 2 left bra cups together. Make sure that the breast cups are facing in the same direction, then slide them apart slightly so that the bottom part of one cup rests over the center of the other cup. Once you’re happy with the breast shape, secure both cups with fabric glue, hot glue, or super glue. [6] X Research source Repeat this step for the right set of bra cups. Set the breast cups aside when you are done."
    },
    {
      "title": "Cut apart some pantyhose to form flat sheets.",
      "content": "Cut apart some pantyhose to form flat sheets. Get 4 to 5 pairs of extra-large pantyhose that match your skin tone. Cut the legs off, then cut off the toes. Slice apart each leg along one of the seams to form a flat sheet. Discard the toes and seat/waist or save them for another project. [7] X Research source Some types of pantyhose have control tops that extend to the thighs. They will be darker than the rest of the material. You need to cut below this."
    },
    {
      "title": "Drape one of your pantyhose sheets over one of the breast cups.",
      "content": "Drape one of your pantyhose sheets over one of the breast cups. Wrap the edges of the pantyhose sheet over the edges of the breast cup. Secure the pantyhose to the underside of the breast cup with a fast-drying glue as you go. Pull the pantyhose taut over the breast so that there are no gaps. It will look sheer, but that's fine. [8] X Research source Hot glue will work especially well for this step because of how fast it sets up. Start working at one end of the pantyhose. This way, you may have enough left over to cover the other breast."
    },
    {
      "title": "Trim off the excess pantyhose with fabric scissors.",
      "content": "Trim off the excess pantyhose with fabric scissors. Wait for the glue to dry first, if necessary, then flip the breast cup over. Trim off the excess pantyhose as close to the glue line as you can. When you are done, repeat the entire process for the other breast cup. [9] X Research source If you have enough pantyhose leftover from the first breast cup, you can use it for the second one. Make sure that the bra cup doesn't show through, however. Save the remaining pantyhose sheets for later."
    },
    {
      "title": "Trace the upper part of a t-shirt onto a sheet of white craft foam.",
      "content": "Trace the upper part of a t-shirt onto a sheet of white craft foam. Tuck the sleeves inside the shirt first, so that you have nice, curved edges for the arm holes. Place the shirt on top of the craft foam . Trace around the shirt, including the arm holes, stopping a few inches below each arm pit. This will be the base for your chest plate. [10] X Research source If you can't find craft foam, thin, flexible cardboard may also work. Make sure it's white. Stay on the safe side, and add a few extra inches to the top of the shoulders."
    },
    {
      "title": "Cut the chest plate out.",
      "content": "Cut the chest plate out. Lay it over your own chest to make sure it fits. Be sure the top edges wrap over your own shoulders and the bottom edge extends a few inches past your armpit. Don't worry about it wrapping all the way around your torso."
    },
    {
      "title": "Glue the breast cups to the bottom of your chest plate.",
      "content": "Glue the breast cups to the bottom of your chest plate. Make sure that the breast cups are touching each other in the middle (this forms the cleavage). The top edges of the breast cups must be just below the armpit of the chest plate. The bottom edges will likely hang over the bottom edge of the chest plate. [11] X Research source Ensure the thinner part of the breasts are pointing upwards and that the thicker, fuller part is pointing downwards."
    },
    {
      "title": "Trim off the excess chest plate behind the breast cups.",
      "content": "Trim off the excess chest plate behind the breast cups. Once the glue dries, flip the chest plate over. Trim off the excess chest plate until you can see the entire inside of each breast cup again. This will make the breasts more comfortable to wear, especially if you already have breasts."
    },
    {
      "title": "Glue pantyhose sheets across the breasts.",
      "content": "Glue pantyhose sheets across the breasts. Drape a pantyhose sheet lengthwise across the breasts. Find the center of the top, long edge, and glue it to the center of your chest plate's neck. Just a drop will do. Stretch the bottom edge of the pantyhose sheet across the bottom edge of both breasts and glue it to the inside edge of each breast. [12] X Research source For a neater finish, glue the pantyhose to the underside of the collar, not the front. Start with the outer edges first, then work your way to the bottom and inner (cleavage) edges. Hot glue is recommended for this section because of how fast it sets."
    },
    {
      "title": "Continue wrapping the pantyhose around the breasts.",
      "content": "Continue wrapping the pantyhose around the breasts. Working a little bit at a time, wrap the pantyhose around the outer edge of the chest plate and glue it to the underside. Make sure that you cover the entire collar, shoulders, arm holes, and sides. [13] X Research source The covering will be very sheer, and the chest plate may warp as you tighten the pantyhose over it. This is fine."
    },
    {
      "title": "Add 5 more layers of pantyhose.",
      "content": "Add 5 more layers of pantyhose. Using the same technique as before, add 5 more layers of pantyhose sheets to your breasts and chest plate. Make sure that you have no gaps or holes showing; otherwise the skin tone will be uneven. With each layer that you add, you may notice the color getting darker and more consistent. [14] X Research source"
    },
    {
      "title": "Glue a thin piece of cardboard to the back of the chest plate for support.",
      "content": "Glue a thin piece of cardboard to the back of the chest plate for support. The pantyhose covering will likely cause the chest plate to curve or warp. Flip the chest plate over, and measure from the top of one shoulder down to the top of one breast. Cut a piece of thin cardboard according to that measurement, then glue it to the back of the chest plate. Make sure that it's not visible from the front. [15] X Research source Repeat this step for the other shoulder and breast. You can also use plastic boning, featherlight boning, or thermoplastic/worbla."
    },
    {
      "title": "Glue elastic to the shoulders and sides of the chest plate.",
      "content": "Glue elastic to the shoulders and sides of the chest plate. Cut 4 equal lengths of elastic. Hot glue 2 of the pieces to each shoulder of the chest plate. Hot glue the other 2 pieces to the sides of the chest plate, right below the arm pits. [16] X Research source If your costume will be light colored, use white elastic. You can glue an old bra inside the chest plate to make it more comfortable to wear."
    },
    {
      "title": "Add small backpack buckles or Velcro to the end of each elastic.",
      "content": "Add small backpack buckles or Velcro to the end of each elastic. You can use hot glue, but sewing the Velcro or the elastic to the buckles would be more secure. Give yourself enough elastic so that you can connect the left shoulder elastic to the right chest elastic, and the right shoulder elastic to the left chest elastic. If you need to, trim and cut the elastic first so that it is short enough to do this. [17] X Research source If you are gluing your breastplate onto an old bra, you can skip this step."
    },
    {
      "title": "Try on the chest plate.",
      "content": "Try on the chest plate. Place the chest plate over your chest. Cross the elastics across your back in an X-shape and snap (or Velcro) them together. Put on your costume, and adjust it until it rests over the fake breasts naturally. If you need to, use makeup to help match your skin tone to the breasts. You can also get clever with carefully-placed accessories, such as scarves, collars, or necklaces. If you attached the chest plate to an old bra, then put it on like a bra. If your fake breasts will be visible under your costume, consider painting them with watercolors or watered-down acrylics."
    }
  ]
}