{
  "url": "https://www.wikihow.com/Hang-an-Ironing-Board",
  "title": "How to Hang an Ironing Board",
  "steps": [
    {
      "title": "Find a door to hang your ironing board.",
      "content": "Find a door to hang your ironing board. An ideal door would be one located in your laundry room or near your laundry facilities. Hanging your ironing board in this area of your home helps you stay organized by keeping your ironing board close to other laundry items. If you don’t have a laundry facility in your home, consider a place where you keep your laundry items, such as a closet that stores your detergent, laundry basket, etc. When hanging an ironing board over a door, the board can hang on either side. However, hanging the ironing board behind a door will present a more organized look as the board remains out of sight. While the over-the-door hanging method is one of the best ways to store your ironing board, there are many creative options out there. [1] X Research source"
    },
    {
      "title": "Ensure the board will fit on the back of the chosen door.",
      "content": "Ensure the board will fit on the back of the chosen door. Measure your ironing board by width and length and compare it to the dimensions of the door. Another helpful way to consider measurements is simply holding up the ironing board to the door. Next, measure the width of the top of your door. This is very important for the over-the-door method. Keep this measurement in mind as you shop for your ironing board hanger. You don’t want to buy a bracket hanger that won’t fit your door. The measurements for a full size ironing board is usually between 42 by 14 inches (107 cm × 36 cm) and 48 by 18 inches (122 cm × 46 cm). While most ironing board hangers should fit standard door frames, it is possible for some older homes to have unique doors with different measurements."
    },
    {
      "title": "Buy a hanger with 2 hooks for a board with a T-shaped base.",
      "content": "Buy a hanger with 2 hooks for a board with a T-shaped base. There are many versions of this type of hanger and prices range from anywhere from $8 to $40. These types of hangers come in metal and plastic varieties. So choose according to your budget and taste. Many over the door ironing board hangers also include a space to store your iron. Keep an eye out for these products, and be mindful of the size and shape of your iron, too."
    },
    {
      "title": "Choose bendable hooks for a board with a U- or V-shaped base.",
      "content": "Choose bendable hooks for a board with a U- or V-shaped base. Since these types of boards are slightly more difficult to hang, it is smart to buy a hanger with bendable hooks. This feature enables you to shape the hooks so that the ironing board fits securely. If you have a smaller, table top ironing board, you will also have to take the shape into consideration."
    },
    {
      "title": "Place the ironing board hanger over the door.",
      "content": "Place the ironing board hanger over the door. Once you have purchased your hanger, follow the instructions carefully. Most products have a bracket system and easy installation requirements that do not require tools or assembly. Affix your hanger on a side of the door that will create less clutter according to your home needs. One downside to this hanging method is that the bracket of the hanger will be visible."
    },
    {
      "title": "Hang your ironing board on the hanger.",
      "content": "Hang your ironing board on the hanger. For T-shaped boards, place your ironing board on the hanger by laying each side of the base onto the hooks. These types of hangers will normally involve a double-hook system. So each side of the base should fit perfectly. For V-shaped and U-shaped boards, you will need to adjust the movable hooks and hang the board feet accordingly. Make sure that the feet are secure and will not slide off of the hooks. The best way to hang an ironing board is with the pointed end at the top. The wider end will likely be heavier, and you want to make sure that this end is at the bottom. Make sure that your board is secure to keep it from falling as you open and close the door. If you purchase a hanger with a space to store your iron and other accessories, make sure that your iron and accessories are also secure and neatly placed. Always wrap the cord of your iron neatly around the iron itself or tied together. You never want a loose cord hanging from the door."
    },
    {
      "title": "Choose a load-bearing wall to hang the ironing board.",
      "content": "Choose a load-bearing wall to hang the ironing board. When choosing the wall for your ironing board mount, it is important to make sure that you choose wall that will support a standard ironing board. You can do this by searching for structural clues, such as nearby beams and floor joists that are being used to support the structures of your home. You can also locate a stud in the wall by using an electronic stud finder and by using other structural clues, such as visible beams and pillars. You can also tap the wall for hollow sounds, which indicate a beam is not present where you tapped. If a beam is present behind the wall, you will notice a dense sound. Most stud finders are used by sliding the tool across the wall's flat surface. The tool should alert you when there is a study by flashing a light or beeping. [2] X Research source Make sure to select a wall that will accommodate your ironing board and will not cause too much clutter."
    },
    {
      "title": "Confirm that the board will fit your chosen wall.",
      "content": "Confirm that the board will fit your chosen wall. Make sure to measure your ironing board by width and length. Next, measure the wall space that you have chosen for your wall mount. While most walls will accommodate an ironing board, it is helpful to visualize how the board will hang and helpful to center it on the wall. By taking these precautions and measurements, you will ensure that there is enough space and that the ironing board will look straight and tidy. Remember that a standard ironing board is approximately 48 by 18 inches (122 cm × 46 cm). But some boards may exceed this size. Additionally, older boards may weigh more than newer boards, because they could be made of stronger material. As you take measurements and play around with positions of the ironing board on the wall, it is helpful to take photos of the different positions. These photos will be help you remember which positions worked best for the space."
    },
    {
      "title": "Mark the wall where the top ironing board base will rest.",
      "content": "Mark the wall where the top ironing board base will rest. Once you have decided where the ironing board will hang, ask someone to hold the board exactly in this position. Next, take your pencil and measure and mark where the base (T-shaped) will rest and where the coat hooks will best be situated. You want to make sure that the marking for the hooks are evenly spaced and level. As you make your markings, you can also draw a line between each coat hook point. Use your level, either bubble or electronic, and a ruler to make sure that the line between each coat hook point is level. After you have made these markings, it is useful to position the ironing board again in reference to these markings. This is a good way to double check your measurements and also see how the board will rest on the wall. Another good way to mark the level line between the two coat hook points is to use painter's tape to mark the line. By doing this, you can easily remove the tape once you are finished without leaving marks on the wall ."
    },
    {
      "title": "Choose your coat hooks.",
      "content": "Choose your coat hooks. New or re-purposed coat hooks work great. But make sure to use metal hooks rather than plastic hooks. Whether your coat hooks are new or re-purposed, they need to be able to hold the weight of your ironing board. Plastic hooks, which are made to hang clothing, will not be strong enough. When choosing your coat hooks, be creative choosing colors and styles that reflect your own home style. While these fixtures are small and for the purpose of an ironing board, have fun!"
    },
    {
      "title": "Install the coat hooks.",
      "content": "Install the coat hooks. Now that you have marked the points where the hooks will rest, you are ready to install your DIY ironing board wall mount. Your best option is to use a power drill to drill the hooks into the wall. Using a drill bit that is designed for screw heads, drill each hook into the place where you have marked. This method is best used for standard screws. [3] X Research source Remember, these markings should have already been measured out in the previous step. Install the hooks neatly, and make sure that the screws go in completely. Most store-bought coat hooks are going to have screws included. But if you are using re-purposed or antique hooks, make sure to purchase the correct screws. These screws should be long and sturdy. Consider using finishing screws and wall anchors to provide more stability, especially since ironing boards can be heavy. Finishing screws and anchors are easy to use and don't require a power drill. You simply use a screwdriver to screw the anchor into the wall. Then, you drive the included screw into the anchor, which will expand and lock into the wall. [4] X Research source"
    },
    {
      "title": "Hang your ironing board on the installed hooks.",
      "content": "Hang your ironing board on the installed hooks. Once you have drilled your coat hooks into the wall and made sure that they are secure, hang your ironing board on the hooks. Be careful to hang the board with an even weight distribution. Make sure that the board is secure."
    }
  ]
}