{
  "url": "https://www.wikihow.com/Make-a-Love-Potion",
  "title": "How to Create Love Potions (Plus, How to Use Them)",
  "steps": [
    {
      "title": "Place a pinch of rose petals, chicory root, and jasmine into a jar.",
      "content": "Place a pinch of rose petals, chicory root, and jasmine into a jar. These 3 herbs have magical romantic properties on their own, and when combined, create a love potion that draws you closer to the one you love. Take your time adding each ingredient to your jar to infuse your potion with calming energy. [1] X Research source Rose is a universal symbol of love and can welcome romantic energy. [2] X Research source Chicory root is said to remove spiritual obstacles and encourage success. Jasmine is a delicate flower that can attract emotional love and increase sensuality."
    },
    {
      "title": "Write you and your lover’s names on a piece of paper to put in the jar.",
      "content": "Write you and your lover’s names on a piece of paper to put in the jar. On a tiny piece of paper, neatly write down the name of the person you hope to attract and your name. Roll the piece of paper up and slip it into the jar. [3] X Research source Make this a self-love potion by writing down your name twice or writing your name and something you want to love about yourself."
    },
    {
      "title": "Fill the jar with rose oil.",
      "content": "Fill the jar with rose oil . Roses not only attract romantic energy, but they also promote luck, beauty, and confidence. [4] X Research source Pour the oil over the ingredients until you reach the top of the bottle, and then screw or pop on the lid."
    },
    {
      "title": "Light a pink candle and speak an affirmation over the jar.",
      "content": "Light a pink candle and speak an affirmation over the jar. You can’t cast a love spell without intention. Charge your love potion with romantic or self-affirming energy by lighting a pink candle next to the jar. Then, say your intention for the potion out loud while the candle burns. [5] X Research source Try saying something like, “I welcome love,” “I’m open to romance and compassion,” or “The love I have for myself is strong.” Pink candles work best for setting romantic intentions because they represent love."
    },
    {
      "title": "Let the candle burn until it naturally flickers out.",
      "content": "Let the candle burn until it naturally flickers out. The longer your candle burns, the more energy your potion will have. If the flame goes out sooner than you’d like, no worries! Simply continue relighting the candle to keep your path toward love clear. Never leave a burning candle unattended. Keep a watchful eye on the flame while you perform other tasks or meditate on the love you hope to receive."
    },
    {
      "title": "Bury the jar once your love has come true.",
      "content": "Bury the jar once your love has come true. This love potion welcomes and brings more love into your life, especially with the person whose name is on the note inside the jar. Once the love you’ve asked for has manifested, bring the jar to a secluded outdoor space and bury it to release the energy and thank the universe. [6] X Research source"
    },
    {
      "title": "Toss a handful of dill, hibiscus, and orange peels into a saucepan.",
      "content": "Toss a handful of dill, hibiscus, and orange peels into a saucepan. These 3 ingredients are packed with love-attracting energy, and when brewed together, make a bright, citrus tea. Use as much or as little of each ingredient as you’d like. Remember, this love potion is meant to help you attract what you need. [7] X Research source Dill is said to cultivate joy, wealth, and energy. [8] X Research source Hibiscus flowers are considered an aphrodisiac and can attract romantic energy. [9] X Research source Orange peels or blossoms encourage a healthy heart and clarity. [10] X Research source The amount of each ingredient you use is entirely up to you! Add 1 ⁄ 4 cup (12 tsp) of hibiscus for a lustful and pungent floral tea, or use 2 teaspoons (0.042 c) of dill leaves for a subtle earthy taste to uplift your energy."
    },
    {
      "title": "Add water to the pot and simmer on low for 3 to 5 minutes.",
      "content": "Add water to the pot and simmer on low for 3 to 5 minutes. Cover the ingredients in the saucepan with water. Bring the water up to a simmer on low heat for no more than 5 minutes. [11] X Research source As you do this, think about why you're making this love potion. What do you hope to gain from drinking the tea? Setting intentions while the tea brews gives the potion its magical and energetic properties. You might say something like, “I welcome new and empowering relationships into my life” or “I am worthy of love and respect.”"
    },
    {
      "title": "Turn off the heat and let the tea steep for 10 minutes.",
      "content": "Turn off the heat and let the tea steep for 10 minutes. After the water has simmered for a few minutes, turn off the heat, cover the saucepan, and let the tea sit. The herbs need at least 10 minutes to infuse the water with their healing properties; otherwise, you’ll have ordinary flavored water. [12] X Research source The longer your tea steeps, the stronger it’ll be. If you like weaker teas, leave the saucepan uncovered while it steeps."
    },
    {
      "title": "Strain the herbs from the tea with a mesh strainer.",
      "content": "Strain the herbs from the tea with a mesh strainer. Pour the potion through the strainer directly into a cup or move it to a different saucepan or container. Consider filling lidded glass jars or bottles with tea to store in the fridge for later. [13] X Research source"
    },
    {
      "title": "Drink or bathe in your love potion.",
      "content": "Drink or bathe in your love potion. The beauty of this specific potion is that you can ingest or soak in it. Either way, it’ll help refuel your energy and confidence to help you attract more love into your life. Fill a mug with the delicious, warm beverage to enjoy with breakfast, or add a cup or two of the tea to a full bath. Think about the intentions you set over the tea while you drink or bathe in it. Remember, you manifest your own magic!"
    },
    {
      "title": "Pour 2 cups (470 mL) of apple juice into a pot.",
      "content": "Pour 2 cups (470 mL) of apple juice into a pot. In witchcraft, apples are symbols of love, lust, and fertility. Having the base of your potion be the juice of this magical fruit can help you attract your most tempting desires. [14] X Research source"
    },
    {
      "title": "Add 125 grams (4.4 oz) of brown sugar and 125 grams (4.4 oz) white sugar to the juice.",
      "content": "Add 125 grams (4.4 oz) of brown sugar and 125 grams (4.4 oz) white sugar to the juice. Not only will this sweeten the potion, but it’ll also help sweeten your love for yourself and whoever you hope to attract. Try using a flavored sugar, like vanilla or lavender sugar , for extra sweetness. [15] X Research source"
    },
    {
      "title": "Stir your potion and set your intentions.",
      "content": "Stir your potion and set your intentions. Before adding more ingredients, take some time to think about why you’re making this potion. Do you want to attract a specific person? Are you hoping to learn to love yourself? Whatever your intentions, speak them over the potion until the sugar is thoroughly mixed. [16] X Research source Try saying something like, “I am capable of loving others,” “I have a strong heart and welcome new experiences,” or “I feel loved and cherished in my relationship.”"
    },
    {
      "title": "Toss 2 cinnamon sticks, 5 cloves, 1 star anise, and vanilla bean into the pot.",
      "content": "Toss 2 cinnamon sticks, 5 cloves, 1 star anise, and vanilla bean into the pot. These spices can help flavor your magical drink and heat up your love life. Add as much or little as you like to fit your witchery needs. [17] X Research source Cinnamon is believed to stimulate psychic powers and open the third eye, allowing you to see the world more clearly. [18] X Research source Cloves can boost your confidence, giving you the courage to talk to your crush. Star anise is said to bring good fortune and luck. Vanilla bean is a comforting flavor that’s believed to promote happiness, harmony, and intimacy."
    },
    {
      "title": "Heat your love potion on the stove until the sugar dissolves.",
      "content": "Heat your love potion on the stove until the sugar dissolves. Keep a close eye on your potion and make sure it doesn’t boil, as this could disrupt its magical properties. Heat the drink just enough to infuse the flavors of the spices and melt the sugar. [19] X Research source"
    },
    {
      "title": "Take the potion off the heat and strain out the spices.",
      "content": "Take the potion off the heat and strain out the spices. Let the potion cool, and then place a sieve or mesh strainer over a jar or mug and pour out the contents of the pot. Sip on the potion while it’s warm to welcome soothing energy, or drink it over ice to invigorate compassion. [20] X Research source Bottle your love potion in a jar or container with a lid to store in the fridge for later."
    },
    {
      "title": "Fill a jar with love-seeking herbs and intention.",
      "content": "Fill a jar with love-seeking herbs and intention. Not only is a love honey potion tasty, but it’s also customizable. Choose whichever herbs fit you and your needs, and then set an intention over them as you place them in your chosen jar to charge them with magic. Simply say or think what you hope each herb will do for you. [21] X Research source Add cinnamon sticks to your potion to speed up romance or intimacy. Use passion flowers to increase passion and bring peace to your relationship. Sprinkle in some rose petals to encourage love. Include cloves to strengthen friendships. Add hibiscus to induce loving feelings. Put in cardamom to encourage romantic attraction. Toss in vanilla extract or powder to amplify loving vibrations and energy."
    },
    {
      "title": "Pour honey over the herbal ingredients.",
      "content": "Pour honey over the herbal ingredients. The type of honey you use is entirely up to you—choose something local or opt for your favorite store-bought brand. Fill the jar with the honey just below the brim. [22] X Research source"
    },
    {
      "title": "Twist on the lid and let the honey sit for 1 to 2 weeks.",
      "content": "Twist on the lid and let the honey sit for 1 to 2 weeks. As the honey sits, the enchanted herbs will infuse into the honey and create your love potion. Set the jar on a warm windowsill and let the magic do its thing. [23] X Research source The longer the potion sits, the more flavorful it’ll be."
    },
    {
      "title": "Strain the honey and enjoy.",
      "content": "Strain the honey and enjoy. Once the potion has been infusing for a week or more, separate the honey from the herbs with a mesh strainer. Use a spoon to help the honey drip into a new container. [24] X Research source Take a spoonful of the honey each day to boost your confidence and energetic power. Drizzle this honey over oats, use it to sweeten tea, or take it by the spoonful to help attract more love into your life."
    }
  ]
}