{
  "url": "https://www.wikihow.com/Make-Aglets",
  "title": "How to Make Aglets",
  "steps": [
    {
      "title": "Select a clear, basic adhesive tape to make the aglet.",
      "content": "Select a clear, basic adhesive tape to make the aglet. Get a single-sided adhesive tape you can easily use to wrap up the ends of your laces. Make sure it’s at least 3 in (7.6 cm) wide so that the new aglet is long enough to protect the shoelace. Adhesive tape is strong enough to create a durable, long-lasting aglet. It’s also transparent, so it won’t look out of place. [1] X Research source For example, electrical tape is a little stretchier but comes in a wide variety of colors. Duct tape and gaffer’s tape can also be used. Note that other types of tape, such as duct tape and gaffer’s tape, will leave you with a bigger aglet. Select a regular adhesive tape for a regular-sized aglet."
    },
    {
      "title": "Lay a strip of adhesive tape sticky-side up on a flat surface.",
      "content": "Lay a strip of adhesive tape sticky-side up on a flat surface. Start peeling the tape off from its roll. Spread it out flat over the table without folding it or letting any sort of debris get on it. Roll out a short length, such as about 6 in (15 cm), but don’t cut it from the roll yet. [2] X Research source Roll the tape out gently, making sure the tape doesn’t pick up any debris off the table. If it gets dirty, it may not stick to the shoelace."
    },
    {
      "title": "Place the shoelace about 1 in (2.5 cm) from the end of the tape.",
      "content": "Place the shoelace about 1 in (2.5 cm) from the end of the tape. Lay the lace perpendicular to the tape. Position it so it is level with the tape’s upper edge. If your lace is frayed on the end, position it so the frayed ends are off of the tape. You will have a chance to cut the frayed ends off afterward. [3] X Research source Secure the tape to only the parts of the lace you want to keep. Anything that isn’t underneath the tape will be exposed and possibly fray later."
    },
    {
      "title": "Fold the small flap of tape back over the shoelace.",
      "content": "Fold the small flap of tape back over the shoelace. Pick up the small 1 in (2.5 cm) margin of tape to the left or right of the lace. While folding it, press it gently against the lace. Wrap the lace up tightly before sticking the flap onto the opposite length of tape. [4] X Research source Work slowly so the tape fits well over the shoelace. It should be completely wrapped around the end of the shoelace. The initial wrap is meant to compress the lace so it’s easier to cover with tape. If it isn’t wrapped tightly enough, the aglet could be too large or harder to hold together."
    },
    {
      "title": "Roll the shoelace in the tape 2 to 3 times.",
      "content": "Roll the shoelace in the tape 2 to 3 times. Use the remaining length of tape to cover over the initial layer. Roll the lace up as tightly as you can so that it’s compressed and well-covered. Cut the tape from the roll with a pair of scissors when you’re done. [5] X Research source"
    },
    {
      "title": "Spread super glue underneath the tape to secure it in place.",
      "content": "Spread super glue underneath the tape to secure it in place. Before completely flattening out the loose end of the tape, place a couple of drops of super glue underneath it. Use the tip of the glue bottle to spread it out as much as possible without getting it on the rest of the new aglet or the exposed ends of the shoelace. Then, press the tape flat. Wipe up any glue that comes out from underneath the tape. Let the glue dry for 10 to 30 minutes before wearing your shoe. You can trim the shoelace down while you’re waiting."
    },
    {
      "title": "Trim the end off of the shoelace with scissors if it is frayed.",
      "content": "Trim the end off of the shoelace with scissors if it is frayed. Use a sharp pair of scissors to remove any part of the lace emerging from the top of the new aglet. Cutting it will leave the lace with a flat top that looks almost as good as an aglet on a new shoe. The new aglet should look clean and consistent while keeping the lace covered. For additional security, spread some super glue through the top of the aglet. After giving it about 2 hours to dry, trim off the excess length."
    },
    {
      "title": "Select a shrink tube that fits easily over the shoelace.",
      "content": "Select a shrink tube that fits easily over the shoelace. In most cases, shrink tubes with a diameter of 5 ⁄ 32 in (0.40 cm) to 3 ⁄ 16 in (0.48 cm) work perfectly. If you’re unsure about what size to get, measure the diameter of your shoelace. Hold the lace up, then position a ruler across its width. Choose a shrink tube that is a couple sizes bigger than the lace. [6] X Research source Shrink tubes shrink to about half of their original size. Use tubes that are 20% to 30% wider than your lace to get a nice, tight aglet. If you want the aglet to be less noticeable, use a clear shrink tube. You can also use colored shrink tubes to create a multi-colored aglet."
    },
    {
      "title": "Cut the shrink tube to length with a sharp pair of scissors.",
      "content": "Cut the shrink tube to length with a sharp pair of scissors. Trim it to the length you want the finished aglet to be. If you have an old aglet on hand, you can use it for comparison. Try cutting it to around 1 ⁄ 2 in (1.3 cm) to 3 ⁄ 4 in (1.9 cm) in length. [7] X Research source The length of the shrink tube won’t change when you heat it. The length you cut it to now is the same length the finished aglet will be."
    },
    {
      "title": "Slip the shrink tube over the end of the shoelace.",
      "content": "Slip the shrink tube over the end of the shoelace. While sliding the tube into place, twist it so the end of the lace doesn’t fray at all. If your lace is in good shape, keep the end of the tube even with the edge of the lace. If you’re planning on shortening the lace, position the tube where you want the aglet to be. [8] X Research source If your shoelace still has its old aglet, try sliding the shrink tube over the aglet. It’s easier to move onto the lace when the old aglet is still there. For additional security, you could spread super glue inside the shrink tube before sliding it in place. If the old aglet is still there, you can easily bind the tube to it this way. You could also slip pieces of stiff wire between the tube and the shoelace to make the aglet a little stronger. While you can do it if the old aglet is there, it’s a little tougher since you have less space to work with."
    },
    {
      "title": "Use a heat gun to shrink the tubing around the shoelace.",
      "content": "Use a heat gun to shrink the tubing around the shoelace. Hold a heat gun about 3 to 6 in (7.6 to 15.2 cm) from the tube. Move the gun back and forth along the tube to get it to shrink. Then, rotate the lace to heat the tube’s opposite side. Heat it as evenly as possible until it’s tight against the underlying shoelace. [9] X Research source If you don’t have a heat gun, you could use an open flame, but be careful to avoid burns. Work in a well-ventilated area away from flammable objects. Don’t let the flame linger too long in one spot."
    },
    {
      "title": "Select a piece of 1⁄8 to 5⁄32 in (3.2 to 4.0 mm)-wide metal tubing for the aglet.",
      "content": "Select a piece of 1 ⁄ 8 to 5 ⁄ 32 in (3.2 to 4.0 mm)-wide metal tubing for the aglet. You can get different types of small-gauge metal tubing depending on the kind of aglet you wish to create. Brass and copper are good choices for durability. Aluminum is another common option, but it’s softer. You could also get flashier metals like silver, gold, or even platinum. [10] X Research source Shop online or visit local hobby stores in your area for tubing. Craft stores and some hardware stores have tubes as well. Jewelry stores may stock tubes made from the more expensive metals. You could also purchase pre-made metal aglets to avoid having to cut tubing. They are available online. Metal tubing is the most durable material for aglets, but it is also the most expensive and difficult to install option."
    },
    {
      "title": "Measure the old aglet’s length with a ruler to size the new one.",
      "content": "Measure the old aglet’s length with a ruler to size the new one. Making a brand new aglet is easier when the old aglet is intact. If it is still on the shoelace, leave it there. Measure from the tip to the opposite end lower on the lace. Then, transfer this measurement to the metal tube with a permanent marker. [11] X Research source If you don’t have an old aglet available, plan on trimming the metal down to the size you desire. Try measuring the shoelace to figure out a comfortable aglet length that will look nice over your shoe."
    },
    {
      "title": "Put on a dust mask and safety glasses when you cut metal.",
      "content": "Put on a dust mask and safety glasses when you cut metal. Always wear safety glasses or a full face mask, even if you already wear glasses. It will shield you from possible fragments splintering off the metal as you cut it. A simple painting dust mask can protect you from metal dust released by the blade. Also, wear long pants and a long-sleeved shirt for additional protection. You can also wear a pair of work gloves to cover your hands while you’re sawing. However, take care not to get them caught under the saw blade. To reduce the mess inside your home, try working outdoors or in a well-ventilated area. If you’re staying indoors, open nearby doors and windows to let out some of the dust and then vacuum up afterward."
    },
    {
      "title": "Trim the tubing to size using a Dremel tool.",
      "content": "Trim the tubing to size using a Dremel tool . Fit the Dremel with a metal-cutting blade. Lower it over the top end of the tool to lock it in place. Then, carefully hold the edge of the blade over the tubing. Lower it down gradually to cut through the tubing, creating the perfectly-sized aglet for your shoelace. [12] X Research source For example, use a 1 1 ⁄ 2 in (3.8 cm) metal cut-off rotary wheel. Double-check that the blade works on the type of metal you’re using for the aglet, since hard metals like iron require stronger blades. You could also use a fine-toothed hacksaw to easily cut through metal tubing."
    },
    {
      "title": "Fill the aglet with super glue to bind it to the shoelace.",
      "content": "Fill the aglet with super glue to bind it to the shoelace. Hold the aglet in one hand with the open end face up. Squeeze in 3 to 4 drops. Then, stick the tip of the super glue tube inside the aglet to help spread the glue. Try coating the entire inner part of the aglet evenly so it stays stuck to the shoelace. [13] X Research source Keep the aglet away from your shoe and other surfaces. If the glue dries on something, such as part of your shoe, it can be tough to clean off. Use glue sparingly so you don’t end up with a sticky mess. Add a few drops, spread it around, then check to see if you need more."
    },
    {
      "title": "Slip the metal aglet over the end of the shoelace.",
      "content": "Slip the metal aglet over the end of the shoelace. If your shoelace has an old aglet on it, leave it in place. If not, twist together any loose threads at the end of the lace to prevent it from fraying further. Pinch the end of the lace so it’s compressed enough to fit inside the aglet. Slide the tube down until its end is flush with the end of the shoelace. [14] X Research source If you’re planning on cutting the shoelace shorter, position the aglet where you want it to be. Trim off the excess length of material after the glue has had a chance to dry. If you bought a pre-made aglet, it may come with a mounting screw. To install it, hold the screw against the end of the shoelace, then slide the aglet onto the screw."
    },
    {
      "title": "Wait at least 2 hours for the glue to dry before wearing the shoe.",
      "content": "Wait at least 2 hours for the glue to dry before wearing the shoe. Disturbing the aglet too early could cause it to fall right back off the shoelace. Give it as much time as possible to dry. Leave your shoe in an open area with plenty of air circulation so the glue dries out as quickly as possible. [15] X Research source You could also use a crimping tool on the end of the aglet. Squeeze it with the crimping tool to lock it in place against the shoelace."
    }
  ]
}