{
  "url": "https://www.wikihow.com/Harvest-Cauliflower",
  "title": "How to Harvest Cauliflower",
  "steps": [
    {
      "title": "Harvest your cauliflower in the fall if you planted in the spring.",
      "content": "Harvest your cauliflower in the fall if you planted in the spring. Cauliflower is a cold-weather crop, but you may be able to grow it in your spring garden if you live in an area where the temperature remains under 85 °F (29 °C) during the spring and summer. If you planted your cauliflower in late April or May, you can harvest it in late August or early September. [1] X Research source"
    },
    {
      "title": "Harvest your cauliflower in the winter if you planted it in the fall.",
      "content": "Harvest your cauliflower in the winter if you planted it in the fall. Since cauliflower is a cold-weather crop, you should grow it in a cool season, depending on your area's climate. In warm climates, fall is often the best option, as long as the temperatures remain below 85 °F (29 °C). If you plant your cauliflower in late August or early September, you can harvest it in November or December. [2] X Research source The optimal growing season for cauliflower depends on your climate."
    },
    {
      "title": "Harvest when the head grows to 6–8 in (15–20 cm) and is white and firm.",
      "content": "Harvest when the head grows to 6–8 in (15–20 cm) and is white and firm. Healthy cauliflower grows 1 large head in the center of the plant. When the head of your cauliflower is compact and sizable, it is are ready for harvest. Avoid harvesting them too early before the head is completely white. Also, avoid waiting to harvest until the head of the cauliflower spreads out. [3] X Research source Your cauliflower will taste bitter and tough if you harvest them before or after they are ready. If you see a flower emerging from the plant, you’ve waited too long to harvest. Cauliflower requires consistent temperatures around 60 °F (16 °C). If the temperatures are warm, the plant will form small \"button\" heads rather than a large white head."
    },
    {
      "title": "Chop your cauliflower head at the base of the plant using a sharp knife.",
      "content": "Chop your cauliflower head at the base of the plant using a sharp knife. To harvest your cauliflower, make a cut at a 45-degree angle close to the bottom of the plant. You can leave 4–6 in (10–15 cm) of stalk with your cauliflower so it’s easier to prepare. The plant will continue to grow small cauliflower heads where you make your cut. You can harvest these, as well."
    },
    {
      "title": "Remove any remaining leaves to either dispose of or cook with.",
      "content": "Remove any remaining leaves to either dispose of or cook with. The head of the cauliflower plant grows directly in the center, and many large, dark leaves grow around the head. After you cut off the head, you should remove the leaves as well. Rip the leaves off with your fingers, or use garden shears to snip them off where they meet the stem. [4] X Research source This helps the plant continue to grow new cauliflower. You can sauté the leaves as a hearty side or look for cauliflower leaf recipes, for instance. Cook them as you would any other type of greens. If you are disposing of the leaves, consider using a compost bin ."
    },
    {
      "title": "Continue giving your plants water every week.",
      "content": "Continue giving your plants water every week. Your cauliflower plant will continue to grow even after you cut off the head. To maintain your plant, give it 1–1.5 in (2.5–3.8 cm) of water once a week. Along with normal rainfall, this should be plenty to keep your plants healthy. [5] X Research source"
    },
    {
      "title": "Harvest cauliflower florets as they grow.",
      "content": "Harvest cauliflower florets as they grow. After you harvest the main head of the cauliflower, your plant is not necessarily finished growing. The plant continues to produce small florets after the main head is chopped off. To cut these off, use a sharp knife and make a slice 1–3 in (2.5–7.6 cm) from the top of the florets. Shoots start to grow where you made your main cut, and after 2-4 weeks you may find additional cauliflower to harvest."
    },
    {
      "title": "Harvest the remaining leaves after your plant stops producing flowers.",
      "content": "Harvest the remaining leaves after your plant stops producing flowers. After your cauliflower grows additional florets, it will stop developing decently sized side shoots. At this point, the plant is finished growing for the season. To harvest the leaves, rip them off with your hands or use gardening shears to cut them at the base of the stem. You can then cook with the leaves or add them to a compost pile. Cauliflower is a biennial plant, so it will grow to size in 2 years, provided that it doesn't die over the winter."
    },
    {
      "title": "Cut off the stalk and remove any remaining leaves.",
      "content": "Cut off the stalk and remove any remaining leaves. Use a sharp knife and firm pressure to remove the stalk where it meets the head of the cauliflower. Then, make small cuts to get rid of any light green leaves that remain around the cauliflower head. [6] X Research source This way, you can easily cook it when you are ready."
    },
    {
      "title": "Wash your cauliflower",
      "content": "Wash your cauliflower thoroughly with cool water and vinegar. Use cool water from your faucet, and let it run for 30-60 seconds. You can use a vegetable wash to thoroughly clean the cauliflower. Mix 1 ⁄ 2 cup (120 millilitres) of white vinegar with 2 cups (470 millilitres) of water, and soak your cauliflower for 5-15 minutes. Then, rinse the cauliflower again. [7] X Research source This removes dirt and debris from your cauliflower. Alternatively, you can use a commercial vegetable wash product."
    },
    {
      "title": "Set it on a clean towel to air dry.",
      "content": "Set it on a clean towel to air dry. After your cauliflower is clean, let it dry completely before you store it. This way, your cauliflower stays as fresh as possible. It should dry in about 5-10 minutes. [8] X Research source You can use a clean kitchen towel or a paper towel."
    },
    {
      "title": "Place your cauliflower in a plastic bag and refrigerate it for up to 1 week.",
      "content": "Place your cauliflower in a plastic bag and refrigerate it for up to 1 week. Use a large produce bag or freezer bag to house your cauliflower until you prepare it. Squeeze out any extra air, and securely close the top. Then, be sure to place the bag in the fridge. [9] X Research source Your cauliflower will stay fresh in the fridge for 4-7 days."
    },
    {
      "title": "Freeze your cauliflower if you want a long-term storage option.",
      "content": "Freeze your cauliflower if you want a long-term storage option. If you want to keep your cauliflower longer than 1 week, your best option is the freezer. Simply take your bagged cauliflower, and place it in a spot in your freezer. When you want to it, take it out of the freezer 1-2 hours early to thaw. [10] X Research source You can thaw your cauliflower in the fridge or at room temperature. As an alternative, you can chop up your cauliflower before you freeze it. You can then pull out the amount you need and toss it into the dish you're preparing, using it the same way you would use commercially frozen vegetables. You may not even need to thaw it, depending on the recipe."
    }
  ]
}