{
  "url": "https://www.wikihow.com/Know-if-Your-Relationship-Is-Holding-You-Back",
  "title": "How to Know if Your Relationship Is Holding You Back",
  "steps": [
    {
      "title": "Check for codependency.",
      "content": "Check for codependency . A codependent relationship describes an unbalanced partnership in which one partner sacrifices themselves in the name of helping or “rescuing” the other. Such dysfunctional relationships can hinder personal growth in various ways, depending on who’s doing the enabling. If you are the enabler, constantly accommodating your partner’s unhealthy or irresponsible behavior may require so much of your energy that there is little left over for your own individual growth. On the contrary, if your partner is enabling you, staying in this relationship could be building an attitude of learned helplessness within you. [1] X Research source There may be more subtle forms of codependency at play as well. Consider if you are hesitant to push yourself out of your comfort zone — if you relationship is based mostly on feeling comfortable, with little growth happening. If you notice signs of codependency in your relationship, you should seek professional counseling right away. Signs may include lack of personal boundaries, people-pleasing, and excessive control. [2] X Research source"
    },
    {
      "title": "Identify power struggles.",
      "content": "Identify power struggles. Feeling powerless in life or in the relationship can lead to one partner exerting undue power over the other. To prove their power, your partner may place unrealistic demands on you. Insecurity, fear of abandonment or concern about their own lack of accomplishment can show up as lack of support or even jealousy. [3] X Research source For instance, if you come home with a great idea or good news, does your partner ask, “Why would you want that? Why can’t you be happy with how thing are?” This could be a sign of your partner using guilt-trips or control to keep you stagnant."
    },
    {
      "title": "Question if your partner is open-minded.",
      "content": "Question if your partner is open-minded. Do you feel like you have to conform to your partner’s expectations or preferences? [4] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Narrow-minded people can be terribly difficult to deal with in general, but a narrow-minded partner can feel suffocating. When one partner is narrow-minded, it can feel like you are being held back from exploring new aspects of life. For example, you share a dream of traveling the world, and your partner is outraged. “We can’t afford that! It’s too dangerous to travel now-a-days!” Their response makes you less likely to explore and share your interests and dreams. A healthy relationship features two partners who have both mutual and separate interests. If you find yourself having to give up passions because they differ from your partner’s, you could be being held back."
    },
    {
      "title": "Notice commitment issues.",
      "content": "Notice commitment issues. [5] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Consider whether you are ready for a deeper commitment but your partner is not. Sometimes, being held back means one person wants to move forward in the relationship while the other person is happy where they are. If you and your partner have been together for some time, yet they refuse to advance the relationship to the next level, this could translate into you being held back from getting the fulfillment you desire in a partnership. [6] X Research source"
    },
    {
      "title": "Look for a lack of empathy.",
      "content": "Look for a lack of empathy. Perhaps you are held back in the way that your partner isn’t able to provide the emotional support you need. You keep waiting around for them to build you up or support you, but it never happens. If your partner is emotionally detached or immature, you could be missing out on the opportunity to be with someone who can be vulnerable and empathetic with you. [7] X Research source"
    },
    {
      "title": "Determine if you have a clear sense of self.",
      "content": "Determine if you have a clear sense of self. [8] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Do you feel defined by your partner or the relationship? Everyone changes during the course of a relationship; however, if you feel like your relationship stole your sense of identity, it’s common to feel held back. This can be an easy fix. You can develop separate interests and pursue new friendships to regain a sense of self in the relationship; however, if your partner stands in the way of this, this could indicate a bigger problem. [9] X Research source Pursue your individual hobbies and make sure you both have friends outside of the relationship. You may want to plan an evening each week in which you each hang out with your own group of friends (sometimes this is in the form of a \"girls night\" or a \"poker night\")."
    },
    {
      "title": "Ask yourself whether you are going after your dreams.",
      "content": "Ask yourself whether you are going after your dreams. Has being in a relationship caused you to think small? Did you once have wild dreams that have now disappeared? During the course of a relationship, it’s normal to modify your dreams and goals to run parallel with your partner’s. But, if you have given up your personal aspirations for the sake of the relationship, you could be being held back from reaching greater heights. [10] X Research source Or, ask yourself if you have put aside your own aspirations to support your partner's dreams. Do you want to write a novel, but you spend all your free time going to your partner's shows to support their musical career?"
    },
    {
      "title": "Check for hopelessness.",
      "content": "Check for hopelessness. A clear sign that your relationship is holding you back is letting go of dreams and no longer trying to progress in certain areas of your life. If you feel hopeless that things will get better, or you have to convince yourself of the light at the end of the tunnel, your relationship could be a detriment to both your personal growth and your mental health. A healthy partnership should enrich your life, not make you question “Is this all there is?” Hopelessness can be a sign of depression. If you believe your relationship is making you depressed, talk to your doctor as soon as possible. [11] X Research source"
    },
    {
      "title": "Make sure you have actually been communicating your needs.",
      "content": "Make sure you have actually been communicating your needs. [12] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Losing your identity, giving up on your dreams and feeling hopeless can all make you feel stuck, but these obstacles can be overcome. If you haven’t been communicating your dissatisfaction with your partner, then you can’t justly blame your relationship for your unhappiness. Have you sat down and clearly communicated your thoughts and feelings to your partner? If you haven’t, then you need to pencil in a time to talk. Your partner may be willing to work with you to make the relationship more satisfying. If you have talked to your partner about your feelings and there was no change, it may be time to move on from this relationship in order to find greater fulfillment. Reader Poll: We asked 369 wikiHow readers what social skill they struggle with most, and 53% of them agreed on openly sharing their thoughts and emotions. [Take Poll] Remember, your partner can’t read your mind! Make sure to sit down and tell them how you’re feeling before making any rash decisions."
    },
    {
      "title": "Be honest with yourself.",
      "content": "Be honest with yourself. See if you are confusing being held back with your own complacency or fear. In some cases, you can fall prey to the notion that “the grass is always greener on the other side.” You believe your relationship is holding you back when, in fact, you’re immobilized because you’re comfortable where you are or you’re afraid to try something new. Assess your expectations. Have you been blaming your partner for a lack of progress in your own life? Are you placing the key to your happiness in your partner’s hands? Keep in mind that you are the only one who can make you happy. [13] X Research source You may want to take a solo day or weekend trip to gain some perspective. Ask if you are taking responsibility for your own happiness and fulfillment. A solo getaway provides you with the time and space to self-reflect without the influence of your partner."
    },
    {
      "title": "Talk to a friend.",
      "content": "Talk to a friend. A little perspective can help you get to the bottom of your relationship quandary. Reach out to a close friend or family member who knows you well. Ask this person what they think. You might say, “Hey, Don, I’m concerned that my relationship with Toni is holding me back. I don’t feel like she supports me or encourages me to push towards my goals. What’s your opinion?” Your friend may shed some insight that you didn’t notice. For instance, they may respond, “Well, I obviously don’t know what’s going on behind closed doors, but I am concerned that she doesn’t want you to hang out with friends. She seems very controlling.” [14] X Research source"
    },
    {
      "title": "Decide what you want to do.",
      "content": "Decide what you want to do. After you have considered the aspects of your relationship that make you unhappy and sought advice from a friend, you have to make a decision. Will you express your feelings to your partner? Will you come up with ways of growing while maintaining your current relationship? Or do you want to end the relationship?"
    },
    {
      "title": "Communicate with your partner.",
      "content": "Communicate with your partner. [15] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Whichever route you choose, you will need to have a forthright conversation with your partner about your feelings. Pull your partner aside and let them know that you want to talk. Schedule a time when you both can dedicate your full attention to the discussion. Turn off your phones and remove any distractions. If this is your first time bringing this up, you might say, “I feel like I am not being supported by this relationship. I feel held back. I wanted to share my feelings so we can brainstorm options to improve the relationship.” If you are choosing to end the relationship, you might say, “I have put a lot of thought into this, and I think we should break it off. We have completely different goals for our futures. By staying together, we are sacrificing our goals for the relationship. I want us both to achieve our dreams, so I think it’s best if we break up.”"
    },
    {
      "title": "See a couples therapist",
      "content": "See a couples therapist . If you both want to work on the relationship and find ways to make it mutually satisfying, you should consult with a couples therapist. A therapist can help you identify roadblocks that are hindering your growth (individually or together) and help you overcome these barriers. Find a couples therapist by searching for one in your local area through resources like Psychology Today. [16] X Research source"
    }
  ]
}