{
  "url": "https://www.wikihow.com/Handle-Angry-Customers",
  "title": "How to Deal With Difficult and Angry Customers",
  "steps": [
    {
      "title": "Remain calm and adjust your mindset.",
      "content": "Remain calm and adjust your mindset. No one likes to get confronted by a yelling, heated person in a public space. However, your job in this situation is to stay cool and collected. While you may have the urge to yell right back at them, fight the urge! Yelling and getting angry will only escalate the situation. Instead, put on your best customer service attitude and buckle down--it’s time to get to work. [1] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Never use sarcasm or obviously faked politeness. Behaving in such a way will only fuel the customer’s rage and will make the situation a whole lot worse."
    },
    {
      "title": "Listen actively to what the customer is saying.",
      "content": "Listen actively to what the customer is saying. An angry customer generally just wants someone to vent their anger to and today, you are that person. That means that you need to do your best to listen carefully to what they are saying. [2] X Expert Source Art Lewin Entrepreneur Expert Interview. 11 June 2021. Give the customer your undivided attention--do not look around, space out or let other things distract you. Look at the speaker and really listen to what they are saying. [3] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source When you listen to them, listen for the answers to these questions: What happened to make them upset? What do they want? What can you do to help? While asking open-ended questions can also be an important part of active listening, focus on what the other person is saying first (rather than what you’re going to say next). Reader Poll: We asked 440 wikiHow readers how they like to show that they’re actively listening, and only 12% of them said that they like to ask thoughtful questions. [Take Poll]"
    },
    {
      "title": "Separate your feelings from the situation.",
      "content": "Separate your feelings from the situation. If the customer is particularly angry, he or she may say something (or several things) that are really rude. Keep in mind that you should not take it personally--he or she is upset with the business, the product, or the service they have been provided with--they are not upset with you as a person. You will have to set your personal feelings aside. [4] X Expert Source Art Lewin Entrepreneur Expert Interview. 11 June 2021. Keep in mind though, that if the customer becomes too abusive, or seems really threatening, you should tell them that you will go get your supervisor or someone else to help you resolve this problem. When you are walking back to the customer, fill your supervisor or helper in on the situation and explain why you felt you needed to come get them (ie. you felt really threatened, etc.) If worse comes to worse, you will have to ask the customer to leave. Know your organizations policy on when to call the authorities and how to document any encounter like this where noting specific details might be necessary for follow up."
    },
    {
      "title": "Repeat the customer’s concerns.",
      "content": "Repeat the customer’s concerns. Once the customer is done venting, make sure you know exactly what it is they are upset about. If you are still feeling a little unclear, repeat what you think the customer is upset about, or ask him questions. Repeating the problem back to the customer will show him that you were listening, and will also let you confirm the problem that needs to be fixed. A good way to make sure that you know exactly what the problem is, is to use calm and collected wording like “I understand that you are upset, and rightly so, that the pizza was delivered an hour late to your house.”"
    },
    {
      "title": "Actively sympathize.",
      "content": "Actively sympathize. Showing empathy will help make the customer understand that you really are trying to help them. Once you have confirmed what the problem is, show them that you feel really bad about it, and completely understand why they are upset. Say something like [5] X Research source : “I completely understand your frustration--waiting for a pizza, especially when you’re really hungry, is a horrible feeling.” “You are right to be annoyed--delivery delays can throw off all whole night of plans.”"
    },
    {
      "title": "Apologize.",
      "content": "Apologize. Let the customer know that you are genuinely sorry that this happened to them--regardless of whether or not you think they are being a bit dramatic about the situation. Along with empathizing, apologizing can go a long way. Sometimes upset customers just want to have someone apologize to them for the bad service. Hopefully the customer will cool down a bit once you apologize on behalf of the company. [6] X Expert Source Art Lewin Entrepreneur Expert Interview. 11 June 2021. Say something like, “I am so sorry your pizza was not delivered on time. It’s incredibly frustrating when that happens and I completely understand why you are annoyed. Let’s see what we can do to make this right.”"
    },
    {
      "title": "Call your manager over if the customer asks you to.",
      "content": "Call your manager over if the customer asks you to. If you are in the process of handling a situation and the customer demands that you call your manager or supervisor over, it is best to follow the wishes of the customer. However, if you can avoid having to get your manager involved, do it. Handling a situation on your own will show your supervisor that you have the wherewithal to deal with angry customers in a calm and collected manner."
    },
    {
      "title": "Offer a possible solution (or solutions).",
      "content": "Offer a possible solution (or solutions). Now that you have heard what the customer is upset about, you should come up with a solution to provide them with. If you feel like you know a solution that will make your customer happy, then present it to her. [7] X Expert Source Art Lewin Entrepreneur Expert Interview. 11 June 2021. For instance, in the situation with the late pizza, you might present something like, “I totally understand that you are upset your pizza was delivered late. I would like to refund your order and offer you a voucher for a free pizza. I will personally make sure that your next pizza gets delivered to you with the utmost haste.”"
    },
    {
      "title": "Ask the customer for feedback.",
      "content": "Ask the customer for feedback. If you are not completely sure what would make your customer happy, then simply ask her. What would she like to have be done about the problem? Is there an outcome that would make her satisfied? Say something like [8] X Research source “What would you like to have happen? If it is within my power, I will see that it gets done.”"
    },
    {
      "title": "Take action immediately.",
      "content": "Take action immediately. Tell your customer what you will do next to ensure that the problem is resolved. Give her your contact information, particularly if you are speaking with her over the phone, so that she can contact you if the problem arises again."
    },
    {
      "title": "Take several minutes to yourself after the ordeal.",
      "content": "Take several minutes to yourself after the ordeal. Once your customer has left or you have hung up with her, take a few minutes to process what just happened and allow yourself to calm down. Even if the customer left happily, these sort of situations can be really stressful. Take a few moments to destress and clear your mind. Documenting what happened is recommended- date, time, place, the events, and how it was resolved."
    },
    {
      "title": "Follow up with the customer.",
      "content": "Follow up with the customer. Give your customer a call once the problem has been resolved. Ask him if everything is going smoothly. When you can, go the extra mile by sending a handwritten apology or by giving him a discount on his next purchase. [9] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    }
  ]
}