{
  "url": "https://www.wikihow.com/Grow-Banana-Trees-in-Containers",
  "title": "How to Plant, Grow & Care for Banana Trees in Pots",
  "steps": [
    {
      "title": "Choose a dwarf variety of banana tree.",
      "content": "Choose a dwarf variety of banana tree. A standard banana tree can grow over 20 feet (6 m) in height, so it can become too large for a regular pot. When purchasing a banana tree, opt for a dwarf variety, instead. These trees only grow to around 5-13 feet (1.5 to 4 m), can be grown indoors, and aren’t likely to outgrow the pot that you put them in. [1] X Research source Look online for different varieties of dwarf banana tree corms for sale. Types of dwarf banana trees include the Dwarf Red, Dwarf Brazilian, Dwarf Cavendish, Williams Hybrid, and Dwarf Lady Finger."
    },
    {
      "title": "Purchase a banana tree, corm, or seed online or at the store.",
      "content": "Purchase a banana tree , corm, or seed online or at the store. The corm is the base of the banana tree and contains the tree's roots. [2] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source If you don't want to plant the corm and wait for the tree to grow, you can buy a young banana tree or a banana tree sucker (commonly called a pup). This will bypass having to grow new suckers from the corm, and may make it easier to plant your tree. Or, choose to grow a banana tree from a seed. [3] X Research source If a friend or neighbor has a banana tree, ask them if you can take a pup from the mother tree. You may also be able to buy young banana trees or banana corms at a local nursery."
    },
    {
      "title": "Get well-draining, mildly acidic soil for the tree.",
      "content": "Get well-draining, mildly acidic soil for the tree. Banana trees thrive in well-draining soil . When looking for the right type of soil, consider ones with a good mix of peat, perlite, and vermiculite. A cactus or palm tree soil mixture is an excellent choice for banana trees. You can purchase bags of this soil at most home and gardening stores. [4] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Some soil is not beneficial for banana tree growth, such as standard heavy potting soil or soil that's found in your yard. Your banana tree will do best in soil with a pH of 5.6 to 6.5."
    },
    {
      "title": "Choose a deep pot with adequate drainage.",
      "content": "Choose a deep pot with adequate drainage. Start your nursery plant, corm, pup, or seed off in a 6 inch (15 cm) pot or 8 inch (20 cm) pot that has drainage holes. Just make sure the pot is deep so that the banana tree roots have room to expand. Never plant your banana tree in a pot that doesn't have good drainage, as these plants don’t like to sit in water. [5] X Research source Choose a sturdy pot material so it can accommodate the size and weight of your banana tree. For instance, select a ceramic, heavy plastic, metal, or wood pot. When your tree outgrows its pot, transport it to a larger pot. Increase the size of your pot by 4 to 6 inches (10-15 cm) every 2 to 3 years. [6] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Grow mature banana plants in 15 to 20-gallon (57-76 L) containers , or 18 to 25 in (46-61 cm) pots. For instance, plant it in a large barrel or grow bag. [7] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source"
    },
    {
      "title": "Rinse the banana corm thoroughly with lukewarm water.",
      "content": "Rinse the banana corm thoroughly with lukewarm water. If you’re growing your banana tree from a corm, it's important that you rinse it off before planting it to remove any pests that might be on it. Rinsing the corm will also help remove any bacterial or fungal growth. [8] X Research source"
    },
    {
      "title": "Fill a pot with soil and dig a small hole for the corm, pup, or plant.",
      "content": "Fill a pot with soil and dig a small hole for the corm, pup, or plant. Fill a deep pot with well-draining potting mix . Then, use a spade to dig a small hole in the center of your pot about 3 inches (8 cm) deep. You may have to dig a deeper hole to accommodate the size of your corm, pup, or nursery plant. [9] X Research source Make sure to leave about 3 inches (8 cm) of space around the pot so you can plant the banana tree deep into your pot and its roots have enough space to grow. To test if your pot has enough space, place the corm in the hole and make sure that the top 20% of it sticks out of the hole. This portion of your tree should remain exposed until new leaves start sprouting."
    },
    {
      "title": "Set the corm, pup, or plant in the hole and cover the roots with soil.",
      "content": "Set the corm, pup, or plant in the hole and cover the roots with soil. Take your corm, pup, or nursery plant and place it in the hole that you just dug, roots side down. Then, fill in any gaps in the pot with soil to ensure the roots are covered. Just make sure the stem and any leaves are not buried. If you’re planting a corm, the top 20% of the corm should be exposed until the banana tree starts to grow leaves. [10] X Research source When shoots or suckers start to grow from your corm, you can cover the rest of the corm with compost."
    },
    {
      "title": "Water your tree and keep the soil moist.",
      "content": "Water your tree and keep the soil moist. Water your plant thoroughly with a hose when you first plant it, making sure to saturate all of the soil. Just bring your tree outside or place it in your sink to allow the water to drain through the drainage holes. After this initial watering, use a watering can to keep the soil moist, but not overly wet. [11] X Research source Do not put your pot on a saucer because the pool of water can lead to bacteria and rot."
    },
    {
      "title": "Keep your plant indoors or outside where it’s warm and sunny.",
      "content": "Keep your plant indoors or outside where it’s warm and sunny. Find a spot for your banana plant that gets bright, direct sunlight for most of the day. If it’s at least 50° F (10° C) outside, feel free to leave your plant outdoors to grow. Just bring it inside if the temperatures drop below 50° F (10° C), as banana trees can’t withstand cold temperatures. [12] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source If you don’t have a sunny spot indoors, place a grow light over your plant. If you’re leaving your banana tree outside, place it in a spot where it’s sheltered from the wind so it won’t blow over. Banana trees grow best in temperatures between 78 to 82°F (26-28° C). They grow fairly slowly in temperatures between 50 to 60° F (10-15° C) [13] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source"
    },
    {
      "title": "Soak the seed in warm water for 24 hours.",
      "content": "Soak the seed in warm water for 24 hours. Purchase banana seeds online or at your local plant nursery. Then, use a coarse piece of sandpaper or a metal file to lightly scratch the sides of the seed. Place it in a glass of warm water and let it soak for 24 hours. [14] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Scratching and soaking the seed helps “wake it up” and tell it that it’s time to germinate. Note : You cannot grow banana trees from a banana fruit. Most commercial bananas are seedless. If they do have seeds, they’re infertile. [15] X Research source"
    },
    {
      "title": "Plant the seed ½ inch (1 cm) deep in a pot of soil.",
      "content": "Plant the seed ½ inch (1 cm) deep in a pot of soil. Fill a 6 inch (15 cm) pot that has drainage holes with regular potting soil or seed compost . Then, push the seed about ½ inch (1 cm) deep into the soil. [16] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Water the soil and put the pot in a warm, sunny spot.",
      "content": "Water the soil and put the pot in a warm, sunny spot. Water the soil thoroughly so it’s moist but not waterlogged. Then, place the pot in a spot that gets bright, indirect light. Ensure the spot stays warm at around 70 to 75˚ F (21-24˚ C). [17] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Place a heat mat under the pot to keep the seed at a consistently warm temperature."
    },
    {
      "title": "Keep the soil moist and wait for the seed to sprout.",
      "content": "Keep the soil moist and wait for the seed to sprout. Check the soil every few days by sticking your finger about 1 inch (2.5 cm) deep into the pot. If it feels dry, water your plant. [18] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Just continue to keep the soil moist until the seed sprouts, which can take between 3 to 12 weeks. [19] X Research source"
    },
    {
      "title": "Water your tree regularly to keep the soil moist.",
      "content": "Water your tree regularly to keep the soil moist. Make sure that your banana tree’s soil remains moist each day, as banana trees need a lot of water to grow. Simply test this by pushing your finger about 1 inch (2.5 cm) deep into the soil to see how dry it is. If the soil feels dry, give your plant a drink of water so the roots stay hydrated. During the warmer months, you may need to water your plant every day. [20] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source In the winter, cut back your watering. Only water your banana plant’s soil when it completely dries out. [21] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Be careful of overwatering your tree. Ensure that the soil stays moist, but not waterlogged and soggy."
    },
    {
      "title": "Make sure that your tree gets bright, direct sunlight.",
      "content": "Make sure that your tree gets bright, direct sunlight. Banana trees thrive in full sun, though they can still grow well in partial shade. If you live in a cooler climate, put your banana tree outside during the summer months when it's warm. Rotate the container regularly to make sure that all sides of the plant are receiving sunlight. If your tree is indoors, put it next to a large window so it gets adequate sunlight. [22] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Make sure to position the tree next to a structure or surrounding foliage that can block out the wind. The ideal temperature for banana growth is 78 to 82°F (26-28° C). If the temperature is below 50° F (10° C), most banana trees will stop growing."
    },
    {
      "title": "Bring your tree inside when temperatures drop below 50° F (10° C).",
      "content": "Bring your tree inside when temperatures drop below 50° F (10° C). Cold and heavy winds aren't healthy for your banana plant and can disrupt its growth and fruit development. If the seasons are changing, bring your tree inside before it starts to get cold out. If you know that your yard gets cold winds, bring your banana plant inside or insulate it with rows of trees. [23] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Banana trees stop growing at 50° F (10° C). If they’re exposed to freezing temperatures (32° F or 0° C), they may die."
    },
    {
      "title": "Fertilize your tree weekly in the spring and summer.",
      "content": "Fertilize your tree weekly in the spring and summer. Use a general-purpose, liquid fertilizer that's high in magnesium, potassium, and nitrogen to promote the growth of your tree. Combine the fertilizer with water according to the directions and water your plant with it . Or, sprinkle the top of the soil with a general-purpose granular fertilizer once in the spring and summer. [24] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source If you can't find a soluble fertilizer that is made specifically for tropical plants, get a balanced 20-20-20 fertilizer . [25] X Research source Regularly fertilizing the plant provides the roots with the proper nutrients and minerals, promoting your tree's growth. Popular fertilizer companies include Agrium, Haifa, PotashCorp, and Yara International."
    },
    {
      "title": "Prune off the suckers (pups) and dead leaves regularly.",
      "content": "Prune off the suckers (pups) and dead leaves regularly. After 6 to 8 weeks of sustained, healthy growth, prune your banana tree . When banana trees grow, suckers (pups) start to pop out of the soil around your plant. Your goal is to eliminate all but one of the suckers from your banana tree. Choose the healthiest and largest sucker from your plant and use a spade or gardening shears to carefully cut off the rest of the suckers from the corm. You may have to dig into the soil to completely remove the suckers. Then, use clean shears to cut off any dead or dying leaves. [26] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Suckers look like shoots that grow out of the corm and have leaves. [27] X Research source To propagate your banana tree, plant the suckers you removed into a pot. A new banana tree will grow from the sucker. [28] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source When your tree grows fruit, prune it back. After harvesting the fruit, cut down the tree so it's 2.5 feet (0.76 meters) from the ground, without damaging the main sucker. The tree will grow more fruit after you prune it."
    },
    {
      "title": "Repot your banana tree when it outgrows its container.",
      "content": "Repot your banana tree when it outgrows its container. Transplant your tree to a larger container before it becomes root-bound. You can tell when your tree is ready for a larger container when it stops growing vertically or you see its roots growing out of the bottom of the pot. Simply choose a pot that’s 4 to 6 inches (10-15 cm) larger than the original and that has drainage holes. [29] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source To repot your banana tree , lay the tree on its side and slide it out of the container. Put soil in your new pot and place the tree in the bigger pot. Then, fill the rest of the pot with soil. Be careful not to damage the roots when transplanting your tree. If your tree is not coming out of its pot, tap on the sides of the container."
    },
    {
      "title": "Most banana trees start to fruit after 10 to 15 months.",
      "content": "Most banana trees start to fruit after 10 to 15 months. Banana trees typically flower after 10 to 15 months of growth from a corm, sucker, or nursery plant. After the flower fully forms, the petals start to roll back, which exposes the banana fruits. [30] X Research source Harvest the bananas when the fruits are plump but still green; the bananas will continue to ripen after they’re picked from the tree. [31] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Most banana trees have around 30 leaves by the time they flower."
    }
  ]
}