{
  "url": "https://www.wikihow.com/Look-Up-Judgements-Against-You",
  "title": "How to Look Up Judgements Against You",
  "steps": [
    {
      "title": "Look up the local court's website.",
      "content": "Look up the local court's website. Some courts have online access for judgments and other court records. If you know which court you were probably sued in, you might be able to track down the judgment that way. If you're looking for a judgment against you, it's usually going to be in the court of the county where you live. However, if you've recently moved from another state or county, you might want to check there too."
    },
    {
      "title": "Search the court's database for your name.",
      "content": "Search the court's database for your name. Since you don't know the docket number of the case or even if you have a judgment against you, searching by your first and last name is usually your best bet. If you've recently changed your name, look under both versions. Some courts require you to sign up for an account and pay a fee before you can access the court database."
    },
    {
      "title": "Download electronic documents if you can.",
      "content": "Download electronic documents if you can. If you find a listing in your name, you might be able to download the electronic documents directly from your computer. This would enable you to find out everything you needed to know about the judgment, including who sued you and when the judgment was entered. [2] X Research source Some courts only provide a summary of the judgment. If you want access to the full court record, you'll have to visit the clerk's office."
    },
    {
      "title": "Contact the clerk's office if you don't have full access to the records.",
      "content": "Contact the clerk's office if you don't have full access to the records. Not all courts provide full access to electronic records from their website. Some courts, especially in smaller towns and rural areas, only keep paper records. Others may require you to prove your identity before you can get copies of the full records. [3] X Research source You can find contact information for the clerk's office on the website. You might be able to call and have the records mailed to you, but usually, you'll need to make a trip to the courthouse. Some courts charge a small copying fee for records, typically a few cents a page."
    },
    {
      "title": "Ask your bank or employer if a writ has been executed.",
      "content": "Ask your bank or employer if a writ has been executed. If your bank account is frozen or your wages are being garnished, you have a judgment against you that has already been executed. Your bank or employer can give you a copy of the paperwork that was given to them. [4] X Research source You can find out from your paystub if your wages are being garnished. However, it typically won't have any details about the garnishment or the judgment your wages are being garnished to satisfy. If your bank or employer is going to mail you a copy of the paperwork, expect to wait a few days to get it."
    },
    {
      "title": "Get the name of the court off of the execution documents.",
      "content": "Get the name of the court off of the execution documents. When a writ is executed, a sheriff's deputy gives your bank or employer a copy of documents showing that they have the right to take money from your account or your paycheck. These documents usually include a copy of the original judgment. The name of the court that issued that judgment will be at the top of that page. [5] X Research source If you don't have a copy of the original judgment, look on the writ. It will typically have information about the judgment as well, including the name of the court and the docket number."
    },
    {
      "title": "Visit the clerk's office in person to get a copy of the court record.",
      "content": "Visit the clerk's office in person to get a copy of the court record. Go to the clerk's office during regular business hours. Give the clerk your name, the name of the case, or the docket number. They'll look up the case and retrieve the record for you. [6] X Research source If you don't know whether you have a judgment against you, the clerk can look up this information for you. Typically, you'll only need to give them your name and they can search the system. Some courts charge a small fee to print court records. This usually amounts to a few cents per page. The full court record for a default judgment will usually only be a few pages."
    },
    {
      "title": "Request the full case record from the court clerk.",
      "content": "Request the full case record from the court clerk. If you haven't already, call or stop by the clerk's office and ask for the full case record. They can typically look this up by your name or the docket number (if you have it). [7] X Research source Look over the case record carefully. It will tell you who sued you, what they sued you for, and when they got the default judgment. The case record also includes documents proving that you were notified of the lawsuit."
    },
    {
      "title": "Check the affidavit of service if you don't remember seeing court papers.",
      "content": "Check the affidavit of service if you don't remember seeing court papers. Anyone who sues you is required to give you notice of the lawsuit so you have time to respond and show up in court to defend yourself. If you never got notice of the lawsuit, you might be able to get the judgment vacated. [8] X Research source You might also be able to get the judgment vacated if you have a good excuse for not showing up to court, such as if you were in the hospital. Different courts have different rules about what excuses they'll accept. Talk to a lawyer if you think you can get the judgment vacated. The person who sued you will likely sue you again — they'll just take extra care to make sure you have notice this time. However, it does give you a chance to defend yourself in court, which you were denied the first time."
    },
    {
      "title": "Contact the person who has the judgment against you.",
      "content": "Contact the person who has the judgment against you. Call or write to the person who has the judgment against you (or their attorney) as soon as possible — especially if they haven't executed the judgment yet. You have time to potentially work out a deal with them. [9] X Research source If the court records list an attorney, contact them first — don't contact the person who sued you if they were represented by counsel. The attorney will let you know if you should instead contact their client directly."
    },
    {
      "title": "Make arrangements to pay the judgment in full.",
      "content": "Make arrangements to pay the judgment in full. If the person with the judgment against you is willing, go over your budget and figure out how much you can pay them per month until the judgment is satisfied. If you're able to pay a lump sum, they might even be willing to settle for less than the total amount of the judgment. [10] X Research source Get any payment or settlement arrangements in writing before you start making payments. Otherwise, you run the risk that they could file a writ of execution against you anyway."
    },
    {
      "title": "Get a copy of the satisfaction of judgment form.",
      "content": "Get a copy of the satisfaction of judgment form. Once the judgment is satisfied, the person with the judgment files a satisfaction of judgment form with the court. This form lets the court know that they've gotten their money as ordered by the judge. [11] X Research source If they agree to take less money than the judge originally awarded them, make sure the settlement agreement is included on the satisfaction of judgment. Make copies of this form and keep them in a safe place. If anyone brings up the judgment again, you can show them this form as proof that you paid it."
    }
  ]
}