{
  "url": "https://www.wikihow.com/Heal-a-Rib-Muscle-Strain",
  "title": "How to Heal a Rib Muscle Strain",
  "steps": [
    {
      "title": "Avoid straining yourself or lifting heavy objects until your rib muscle has healed.",
      "content": "Avoid straining yourself or lifting heavy objects until your rib muscle has healed. Doing too much activity when you’re already injured could prolong your recovery time or re-strain the muscle. Take it easy and rest as much as you can. Most of the time, you won’t need to go on full bed rest, but you should definitely avoid strenuous physical activity. [1] X Research source If your work requires physical labor, your doctor can give you a note to excuse you from the work. If you can’t afford to take more than a few days off work, your boss may be able to set you up with something less physically taxing until your rib muscle is back to normal. If you choose to lie in bed for the first day or 2, get up every hour or so and walk around for at least 5 to 10 minutes to prevent any complications from inactivity. Get as much sleep as you can during your recovery period, since a lot of tissue repair happens while you’re sleeping. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Keep your torso elevated, and avoid twisting your body or reaching for things.",
      "content": "Keep your torso elevated, and avoid twisting your body or reaching for things. Moving your torso and arms can be painful with a strained rib muscle. Recline in a comfortable position with your torso slightly elevated, and try to focus on your breathing. [3] X Research source A pulled rib muscle can take several weeks to fully heal, so try to rest as much as possible to avoid stretching the muscle any further. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source When you go to sleep, position 2 to 3 pillows under your head and 1 under your upper back to slightly elevate your torso. This will help relieve any swelling and can make it less painful to breathe."
    },
    {
      "title": "Apply a cold pack to your ribs for 20 minutes at a time.",
      "content": "Apply a cold pack to your ribs for 20 minutes at a time. Wrap a bag of ice in a thin towel and hold it onto your ribs for 20 minutes at a time several times a day or as needed. Even a bag of frozen veggies wrapped in a towel will do the trick. [5] X Research source Avoid applying an ice pack or ice bag directly to your ribs because the excessive cold can burn your skin. Wait at least 60 minutes between icing sessions to avoid over-icing, which reduces blood flow to the area."
    },
    {
      "title": "Use heat therapy after 48 hours to relax your muscles.",
      "content": "Use heat therapy after 48 hours to relax your muscles. Apply a heating pad or warm towel to your ribs to help your muscles relax and ease any stiffness in your torso. Only do this after the first 2 to 4 days because applying heat too soon can increase any swelling. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Heat should only be used once the initial swelling has gone down, which can take more or less time depending on the severity of your injury. Infrared saunas are also great for speeding up the recovery of strained muscles. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take over-the-counter painkillers to ease pain.",
      "content": "Take over-the-counter painkillers to ease pain. OTC medications like ibuprofen, naproxen, or acetaminophen can help ease your inflamed rib muscles and any muscles around them that may be swollen to compensate. Most people should take 1 to 2 capsules every 4 to 6 hours, but read the instructions on the package to find your proper dosage depending on the formula. [8] X Research source Don't take 2 different types of OTC pain medications at the same time. Talk to your doctor about taking ibuprofen or an alternative if you take blood thinners or antidepressants. Combining these drugs with ibuprofen may cause gastrointestinal or bleeding issues. If you've ever had a stomach ulcer, heart failure, kidney failure, or liver problems, don't take naproxen. Don't take acetaminophen if you have or have ever had liver disease."
    },
    {
      "title": "Use a cough suppressant if coughing caused your strain.",
      "content": "Use a cough suppressant if coughing caused your strain. A severe or persistent cough can sometimes strain or injure the muscles around your ribs. If your strain was caused by a cough, talk to your doctor about using a cough suppressant to help prevent your strain from getting worse. [9] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source Common cough suppressants include dextromethorphan (Robitussin), benzonatate (Tessalon), and codeine (a prescription opioid)."
    },
    {
      "title": "Soak in a hot Epsom salt bath after the first 48 hours.",
      "content": "Soak in a hot Epsom salt bath after the first 48 hours. Add 2 cups (256 grams) of Epsom salts to your hot bathwater and relax for 15 to 20 minutes. This is part of your heat therapy, so don't do it sooner than 2 days after your rib strain. [10] X Research source Epsom salts contain magnesium, a mineral that supports your muscle functioning. As an alternative, fill a large mixing bowl with 1/2 cup (64 grams) of Epsom salt and 16 cups (3,800 mL) of hot water. Soak a towel in it, stirring it around to dissolve as much of the salt as possible. Lay the towel over your pulled rib muscle for 15 to 20 minutes or until the towel is no longer warm. Try adding a few drops of lavender oil to your bath to promote relaxation and relieve pain and inflammation. [11] X Research source"
    },
    {
      "title": "Perform deep breathing exercises every hour.",
      "content": "Perform deep breathing exercises every hour. Hold a pillow against your injured ribs and breathe in through your nose as slowly and as deeply as you can. Hold your breath for 3 to 4 seconds before letting it out slowly through your mouth. Repeat this sequence 5 to 10 times to complete the exercise. [12] X Research source Use your diaphragm to hold the air—your lower belly should noticeably rise and fall with each inhale and exhale. It may hurt to breathe with a strained rib muscle, but prolonged periods of shallow breathing can cause other problems like an infection or pneumonia. Some people find that the Wim Hof method, which is a type of deep breathing exercise, can help reduce pain and inflammation. [13] X Research source Wim Hof also recommends staying hydrated, getting plenty of sleep, and eating protein to help your muscles heal faster. [14] X Research source"
    },
    {
      "title": "Stick to anti-inflammatory foods while you heal.",
      "content": "Stick to anti-inflammatory foods while you heal. Anti-inflammatory foods can promote faster healing and reduce stress on your body. Try foods rich in antioxidants, such as berries, leafy greens, beets, beans and lentils, whole grains, avocados, and green tea. Spices like ginger and turmeric are also great anti-inflammatories, as are healthy fats (like those in fish, nuts, and vegetable oils). [15] X Research source Avoid red meats, greasy foods, processed foods, and foods rich in refined carbs and sugars, which can promote inflammation and slow down the healing process. Get your carbs from foods with a low glycemic index, such as beans and lentils, sweet potatoes, non-starchy fruits and vegetables, and whole grains. Avoid starchy foods like white potatoes and bread made from bleached flour."
    },
    {
      "title": "Schedule a doctor’s appointment if your pain is severe.",
      "content": "Schedule a doctor’s appointment if your pain is severe. If the pain is so bad that you can’t rest, see your doctor as soon as you can. They may prescribe you muscle relaxants or painkillers so you can get much-needed rest and be more comfortable during your recovery. [16] X Research source They can also perform some non-invasive tests and tell you the severity of the strain and how long your recovery will be."
    },
    {
      "title": "Seek immediate medical care if you have trouble breathing.",
      "content": "Seek immediate medical care if you have trouble breathing. If taking a single breath is so excruciatingly painful that you're only able to take shallow breaths, call an ambulance. There's a chance your rib muscle could be completely torn or you have a fractured rib. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Don't try to drive yourself to the hospital; call an ambulance or have someone else drive you."
    },
    {
      "title": "Tell your doctor about how you think the injury happened.",
      "content": "Tell your doctor about how you think the injury happened. If you play sports or if you've been involved in a recent car accident, let them know. How it happened can give them a clue as to how severe the strain is. They'll likely examine and touch tender parts of your torso, so be prepared for that. [18] X Research source Any repetitive motion can strain your rib muscle, from chopping wood to painting or playing sports like golf, tennis, rowing, or baseball."
    },
    {
      "title": "Allow your doctor to test your range of motion.",
      "content": "Allow your doctor to test your range of motion. To figure out the scope of your injury, your doctor may want you to lift your arms and move your torso around. You'll need to rate your level of pain on a scale from 1 to 10 (1 being no pain and 10 being excruciating pain). It may be very uncomfortable, but remember to breathe through any pain. [19] X Research source For instance, you may be instructed to twist or bend your torso from side to side or lift your arms and cross them over your body. Your doctor will assess your strain on a scale of 1 to 3—1 being a mild strain (2 to 3 weeks recovery time), 2 being damaged muscle fibers (2 to 3 months recovery time) and 3 being a complete muscle rupture that may require surgery. Your doctor may opt to inject your rib area with lidocaine or corticosteroids to ease any extreme pain and swelling. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Book an appointment to get a CT scan if your doctor suggests it.",
      "content": "Book an appointment to get a CT scan if your doctor suggests it. A CT scan can show the doctor an image of your injured rib muscles. From this, they can decipher the severity of the sprain and recommend a course of treatment. If your doctor works in a hospital setting, they may be able to take the CT scan that same day. [21] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source You may need to avoid drinking or eating anything 3 hours before the procedure. If this is the case, your doctor will let you know beforehand. Wear loose, comfortable, metal-free clothing to your appointment. If you are pregnant, tell your doctor—they'll use an ultrasound or MRI machine to take an image instead."
    },
    {
      "title": "Take a muscle relaxant if your doctor prescribes one to you.",
      "content": "Take a muscle relaxant if your doctor prescribes one to you. Muscle relaxants depress your nervous system, which can relieve spasms and acute, short-term pain. Take the recommended dose (usually 1 or 2 pills) 30 minutes before bed because they'll probably make you tired. The effects last anywhere from 4 to 6 hours depending on the dosage and strength of the prescription. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source As an alternative to prescription muscle relaxants, you may be able to take 250-500 mg of magnesium citrate to help control painful muscle spasms. [23] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Talk to your doctor about whether this is a safe or effective treatment for you. Don't drink alcohol when you're taking muscle relaxants because the combination can exacerbate any side effects (particularly drowsiness and dizziness). Don't drive or operate any heavy machinery when you're taking muscle relaxants. Muscle relaxants can be addictive, so talk to your doctor about alternatives if you have a history of substance abuse."
    },
    {
      "title": "Ask your doctor to refer you to a physical therapist.",
      "content": "Ask your doctor to refer you to a physical therapist. A physical therapist can guide you through exercises to ease your discomfort and speed up your recovery. They can also answer any questions you have about sleeping or stretching so you can go about your day with less pain. [24] X Research source Refer to your healthcare plan to see if physical therapy is covered and, if so, how much. If it’s covered, you still may end up paying a co-pay for each session."
    }
  ]
}