{
  "url": "https://www.wikihow.com/Get-a-Fish-Bone-Out-of-Your-Throat",
  "title": "How to Get a Fish Bone Out of Your Throat",
  "steps": [
    {
      "title": "Cough hard when you first feel the bone in your throat.",
      "content": "Cough hard when you first feel the bone in your throat. You'll likely have this response automatically, as your body wants to get that thing out of there! Let your body do what it's supposed to do by coughing hard in response. The fishbone may just pop out of your throat."
    },
    {
      "title": "Visit the emergency room if the fishbone seems stuck.",
      "content": "Visit the emergency room if the fishbone seems stuck. If you can't get the fishbone out, you're going to need to go to the doctor. The bone could cut into your esophagus, causing an infection, so medical attention is important. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The bone can still damage your throat even when you're using home remedies."
    },
    {
      "title": "Expect to have an x-ray or CT scan.",
      "content": "Expect to have an x-ray or CT scan. Most hospitals will want to do a scan to see where the bone is. However, not all fish bones will be picked up on an x-ray, so the doctor may want to do another type of scan instead. [2] X Research source A CT scan is a series of x-ray images combined into one. Neither of these scans will hurt."
    },
    {
      "title": "Discuss an endoscopy to get a more detailed image.",
      "content": "Discuss an endoscopy to get a more detailed image. This is usually only necessary in about 10 to 20% of cases, but if you are drooling then this may indicate an esophageal obstruction, which will require an endoscopy as soon as possible. Ask your doctor if this is an appropriate procedure for you. Even if the x-ray didn't show a bone, you could still have one in your throat, so trust your doctor if they want this procedure as well. [3] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source With this procedure, the doctor puts a tube down your throat. The tube has a small camera attached so the doctor can see what's going on. They can also use this tube to help remove the object, as it gives them guidance for their instruments. Before the procedure, they will likely give you a sedative to make you more comfortable, as well as a numbing agent for your throat."
    },
    {
      "title": "Ask whether surgery is needed or not.",
      "content": "Ask whether surgery is needed or not. In most cases, you won't need surgery to remove the bone. Surgery is only needed about 1% of the time, but it is crucial to get the bone out within the first 24 hours to prevent complications. If the bone is lodged in a bad place or it seems particularly sharp, your doctor may want to do minor surgery to remove it. For this procedure, they will likely put you under anesthesia. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source They will make a small incision near where the bone is lodged and pull it out. Then, they will sew the area back up."
    },
    {
      "title": "Try flushing the bone out with water.",
      "content": "Try flushing the bone out with water. Try drinking several large gulps of water. In fact, try to down a whole glass. The force of the water on the bone may help it slip down your throat into your stomach. [5] X Research source Other liquids will work just as well, such as juice or milk."
    },
    {
      "title": "Slurp down a thick, delicious milkshake to dislodge the bone.",
      "content": "Slurp down a thick, delicious milkshake to dislodge the bone. The thickness of the milkshake may help to push the fishbone further done into your body, helping it pass. Go for the thickest kind you can find; generally, ones that are made from scoops of ice cream rather than just pulled from a machine are thicker. [6] X Research source In addition, the iciness will help soothe the pain from the fishbone."
    },
    {
      "title": "Eat a peanut butter sandwich to push the bone down your throat.",
      "content": "Eat a peanut butter sandwich to push the bone down your throat. Slather the peanut butter on thickly. Take a large bite and chew it up enough that it gets thick in your mouth. Swallow the bite to help push the bone down and take a few bites this way to try to dislodge it. [7] X Research source"
    },
    {
      "title": "Try swallowing a large marshmallow.",
      "content": "Try swallowing a large marshmallow. Pop a large marshmallow into your mouth and chew it just enough so it gets sticky. Swallow it whole. The stickiness may grab the bone and help pull it down into your stomach. [8] X Research source A ball of sticky rice will work in a similar fashion."
    }
  ]
}