{
  "url": "https://www.wikihow.com/Make-Eyeglass-Cleaner",
  "title": "4 of the Best DIY Glasses Cleaners for Uncoated & Coated Lenses",
  "steps": [
    {
      "title": "Pour distilled water into a spray bottle and add a drop of dish soap.",
      "content": "Pour distilled water into a spray bottle and add a drop of dish soap. Dish soap is not only a safe and effective way to remove oil and get streak-free lenses, it can help prevent your glasses from fogging up while you’re wearing them. [1] X Research source To make your own eyeglass spray, fill a small spray bottle with distilled water and add a drop of regular dishwashing soap. Swirl or shake the bottle until the soap is fully incorporated into the water, then spray it on the back and front of your glasses. Wipe the lenses in small circular motions with a microfiber cloth until they’re clean and free of smudges or streaks. [2] X Research source This method is safe on both coated and uncoated lenses."
    },
    {
      "title": "Mix 1 part distilled water with 1 part witch hazel in a spritz bottle.",
      "content": "Mix 1 part distilled water with 1 part witch hazel in a spritz bottle. Witch hazel is a popular astringent believed to treat acne and skin inflammation. [3] X Research source If possible, use witch hazel that includes alcohol in it—this will help break down the oil and grime on your glasses and leave them streak-free. Mix equal parts water and witch hazel in a small spray bottle. [4] X Research source Witch hazel is sometimes said to have antiseptic properties, however, there is no conclusive evidence that this is true. [5] X Research source This approach is safe for both coated and uncoated lenses."
    },
    {
      "title": "Add 2 to 3 drops of dish soap to the bottle, shake it, and spray on your lenses.",
      "content": "Add 2 to 3 drops of dish soap to the bottle, shake it, and spray on your lenses. To tackle fingerprints and other oily marks that may get on your lenses, add a couple of drops of regular dish soap. Place the cap back on the bottle and shake it gently to mix all the ingredients together. [6] X Research source To use it, spritz the solution onto both sides of your glasses and wipe with a microfiber cloth."
    },
    {
      "title": "Combine 2 parts vinegar with 1 part water in a spray bottle.",
      "content": "Combine 2 parts vinegar with 1 part water in a spray bottle. White distilled vinegar is one of the many household items that can be used as a green cleaner on all kinds of surfaces, including glass. Pour 2 ⁄ 3 c (160 mL) of white vinegar and 1 ⁄ 3 c (79 mL) of water in a small spray bottle. [7] X Research source After the solution is made, spritz a pump of the cleaner on the front and back of the lenses on your glasses. Use a microfiber cloth to gently wipe away the smudges. [8] X Research source For extra cleaning power, mix equal parts vinegar, distilled water, and alcohol in a spray bottle. Shake it to mix, then spray and wipe your lenses as normal. [9] X Research source Try to avoid using undiluted vinegar—the acid could be harsh on coated lenses and strip them away over time. [10] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Vinegar may be too acidic for coated lenses. If your glasses have a coating on them, it may be best to try a different method."
    },
    {
      "title": "Fill a spray bottle with equal parts rubbing alcohol and distilled water.",
      "content": "Fill a spray bottle with equal parts rubbing alcohol and distilled water. Rubbing alcohol can help sterilize your glasses and remove any oil on the lenses. Remove the cap from the small (2 fl oz (59 ml)) spray bottle and pour 1 part rubbing alcohol and 1 part distilled water into it. [11] X Research source Rubbing alcohol is probably not safe on coated lenses. While some optometrists advise against using it because it can strip the finish, others believe the damage is minimal. To prevent damaging your glasses, make sure to dilute the rubbing alcohol by at least 50% as this recipe does."
    },
    {
      "title": "Add 1 drop of dish soap and shake the bottle until combined.",
      "content": "Add 1 drop of dish soap and shake the bottle until combined. Squirt a drop of gentle dish soap into the bottle and screw the spray lid on. Shake the bottle of cleanser so the rubbing alcohol and soap mix with the water. [12] X Research source Try to avoid shaking the cleanser too vigorously or the dish soap may foam up. Spritz both sides of each eyeglass lens with some of your cleaning solution. Then, take a clean microfiber cloth and gently rub the lenses until they're clean and dry. [13] X Research source As long as you're using rubbing alcohol that isn't close to expiring, your eyeglass cleaner should last for a few months. Store it at room temperature."
    },
    {
      "title": "Fill the sink or a wide bowl with warm soapy water.",
      "content": "Fill the sink or a wide bowl with warm soapy water. Fill a bowl or sink with warm water. Squirt 1 or 2 drops of gentle lotion-free dishwashing soap into it, then swish the water with your hands to distribute the soap. [14] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Alternatively, fill the sink with warm water, rinse your glasses, and apply the soap directly to the lenses. [15] X Research source Make sure the water isn’t hot—heat can warp your frames. [16] X Research source"
    },
    {
      "title": "Put the eyeglasses in the bowl and rub the lenses with your fingers.",
      "content": "Put the eyeglasses in the bowl and rub the lenses with your fingers. Place the glasses in the soapy water so they're submerged. Then, gently rub your fingers over both sides of each eyeglass lens to loosen any grime. For more cleaning power, squirt a dollop of dish soap on the front and back of each lens and rub it into a lather. [17] X Research source Rub the nose pads and hinges with your fingers. If you have wood frames, gently wipe them with the soapy water mixture instead of submerging them. [18] X Research source"
    },
    {
      "title": "Rinse the glasses with water and wipe them with a microfiber cloth.",
      "content": "Rinse the glasses with water and wipe them with a microfiber cloth. Take the glasses out of the soapy water and turn on the tap. Run warm water over both sides of each lens to remove all of the soap and grime. Wipe them clean with a microfiber cloth. [19] X Research source Remember not to touch the lenses after you've rinsed them or you could smudge them again. Although you can air dry your glasses, the water may form water spots as it dries."
    },
    {
      "title": "Use an optometrist-approved eyeglass cleaner.",
      "content": "Use an optometrist-approved eyeglass cleaner. Although homemade lens cleaners can be cheap and convenient, Dr. Felsted recommends using an approved lens spray. If you’re on a budget, he says that “most optomic or optometric glasses counters give away free lens sprays” you can use. The best eyeglass cleaners for coated and uncoated lenses include: [20] X Research source Koala Eyeglass Lens Cleaner spray CareTouch Lens Cleaning Wipes ZEISS Lens Wipes [21] X Research source OPTIX 55 Anti-Fog Spray"
    },
    {
      "title": "Store your glasses in a firm case when you’re not using them.",
      "content": "Store your glasses in a firm case when you’re not using them. To take care of your glasses, comprehensive ophthalmologist Dr. David Felsted says to keep them in a padded case. “I always like to keep a microfiber cleaning cloth wrapped around the glasses when I put them in the case,” he adds. If you don’t like the case that your glasses came with, there are plenty of other hard cases that may work for you. [22] X Research source When you lay your glasses on a surface, make sure the lenses are face-up. [23] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Wash your microfiber cloth regularly to ensure it’s oil-free.",
      "content": "Wash your microfiber cloth regularly to ensure it’s oil-free. Over time, the cloth you clean your glasses with can cause more smears than it clears. To make sure your glasses are clean when you’re out and about, try to wash the microfiber cloth about once a week. [24] X Research source Wash your microfiber cloth, simply toss it in the washing machine with the rest of your clothes or hand wash it with laundry soap and warm water. You may keep a separate microfiber cloth on hand to switch your regular one out with while it’s in the washing machine."
    },
    {
      "title": "Try to avoid using your clothing to clean your lenses.",
      "content": "Try to avoid using your clothing to clean your lenses. Although using your shirt seems convenient, Dr. Felsted says it’s not ideal. “Most high end optics will have a bunch of special coating on the lens,” He says. “If you're rubbing your glasses [on fabric], it's going to have a different index of friction and it's going to scratch that off its surface.” Paper towels, tissues, and toilet paper can also scratch or smear your lenses. [25] X Research source Try to only wipe your lenses when they’ve been sprayed with an eyeglass cleaner. Cleaning your lenses while they’re dry could cause scratches. [26] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Use distilled water to clean your glasses, not hard tap water.",
      "content": "Use distilled water to clean your glasses, not hard tap water. Hard water contains magnesium, calcium, and other minerals that can cause white spots or film on glass. [27] X Trustworthy Source U.S. Geological Survey U.S. government agency responsible for conducting scientific research on the nation's land, natural resources, and natural disasters Go to source While they don’t harm the glass, these spots can be extremely hard to remove safely. [28] X Research source To protect your lenses over time, try to only use distilled water when washing them. If your water is super soft, it may be safe enough to use on your lenses."
    },
    {
      "title": "Wear protective eyewear when playing sports.",
      "content": "Wear protective eyewear when playing sports. Goggles not only prevent your glasses from getting broken, but they keep your eyes safe from sports-related injuries. [29] X Research source Wear protective goggles over your glasses along with a well-fitting helmet. [30] X Research source For the best protection, choose eyewear made out of ultra-strong polycarbonate . [31] X Research source Sports with a high risk for eye injuries include baseball, basketball, hockey, paintball, boxing, and softball."
    }
  ]
}