{
  "url": "https://www.wikihow.com/Make-People-Think-You-Are-Confident",
  "title": "14 Ways to Look and Act Confident (Even When You Don’t Feel That Way)",
  "steps": [
    {
      "title": "Show confidence by putting your shoulders back.",
      "content": "Show confidence by putting your shoulders back. Keep your chin level, with your face pointed straight ahead. Walk like you own the world, even if you don't feel like you do. Doing this can help you look poised and confident. [1] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. Pretend you’re hanging from a string attached to the top of your head. [2] X Research source"
    },
    {
      "title": "Hold someone’s gaze when you’re talking to them to show dominance.",
      "content": "Hold someone’s gaze when you’re talking to them to show dominance. Maintaining eye contact while you’re talking, as well as when another person talks, is a sign of confidence and interest. [3] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. Avoid checking your phone, staring at the floor, or scanning the room, which can make you appear rude, anxious, or uncomfortable. [4] X Research source Try to keep eye contact for at least half of your interaction. [5] X Research source As a start, try to make eye contact with someone long enough to find out what color eyes they have. [6] X Research source"
    },
    {
      "title": "Anxious people often fidget, so try to avoid this to seem confident.",
      "content": "Anxious people often fidget, so try to avoid this to seem confident. Try standing with your feet hip-width apart so you can balance your weight between both legs. [7] X Research source This can help you from shifting your weight, fidgeting, or tapping your feet. Keep your legs balanced even when you're sitting. You may appear anxious if your legs are twisted around or tapping."
    },
    {
      "title": "Fight the urge to make yourself smaller.",
      "content": "Fight the urge to make yourself smaller. Avoid leaning forward in your chair or tucking your arms under your armpits. Instead, be expansive and fill out the space around you. This is called power posing. Studies have shown that people who power-posed before interviews felt and came across as more confident. [8] X Research source Here are a few simple power poses to try: When sitting down, lean back in your chair and use the armrests if they're available. Stand with your legs shoulder-width apart and place your hands on your hips. Lean against walls instead of slouching. This will unconsciously make it appear as though you own the wall or room."
    },
    {
      "title": "Place your hands behind your back, in your pockets, or in your lap.",
      "content": "Place your hands behind your back, in your pockets, or in your lap. While standing or sitting, keep your hands mostly still. To display confident body language, keep the front of your face and body open instead of closing them off from others. Here are a few suggestions: [9] X Research source Clasp your palms together behind your back or head. Stick your hands in your pockets, but show your thumbs. Steeple your fingers together and rest your elbows on a table. This is a very assertive position, best used for negotiations, interviews, and meetings."
    },
    {
      "title": "Give a solid handshake to come across as confident and self-assured.",
      "content": "Give a solid handshake to come across as confident and self-assured. Extend your hand to offer the handshake as you approach someone. Grip the other person's hand firmly but not painfully. Pump up and down slightly for 2 or 3 seconds, then release. [10] X Expert Source Sandra Possing Life Coach Expert Interview. 15 July 2020. If you get sweaty palms, keep a tissue in your pocket and discreetly wipe your hand before you offer it."
    },
    {
      "title": "Try not to talk with your hands too often.",
      "content": "Try not to talk with your hands too often. Emphasizing every word with a hand gesture can come across as anxious or energetic, depending on your culture. Go with occasional, controlled gestures instead. Keep your arms at waist level and make most of your gestures within that space to make you look more credible and professional. [11] X Research source Use an open, relaxed palm in social contexts. A rigid palm or fist is very aggressive or dominant, typically used by politicians. Keep your elbows at your side, and gesture with your hands slightly to one side to avoid blocking your body."
    },
    {
      "title": "Pause a second or two before you speak to show control.",
      "content": "Pause a second or two before you speak to show control. If you tend to jumble words in an attempt to rush through what you're saying, especially when you’re nervous, slow down. Taking a breath before you speak gives you time to plan your response, making you appear more relaxed and confident. [12] X Research source As empowerment expert Nicolette Tura explains, “Nerves are when you're not present, and you're not trusting, and you're not surrendering, and you're not allowing, which blocks the flow of your breath. So, what can you do to address nerves? Breathe.” [13] X Expert Source Nicolette Tura, MA Empowerment Coach Expert Interview. 23 January 2020."
    },
    {
      "title": "Flash a bright smile to appear warm, friendly, and approachable.",
      "content": "Flash a bright smile to appear warm, friendly, and approachable. Studies have shown that people like and remember other people who smile at them. [14] X Research source As life coach Sandra Possing explains, “When you smile, it changes your brain chemistry, and you will feel happier as a result.” [15] X Expert Source Sandra Possing Life Coach Expert Interview. 15 July 2020. If you have trouble keeping a natural smile, just give a brief smile and return to a more neutral expression. Laughter is another good way to display and boost confidence when appropriate. However, avoid a constant giggle, which can come across as nervous or overbearing."
    },
    {
      "title": "Believe in yourself and your choices to feel more confident.",
      "content": "Believe in yourself and your choices to feel more confident. If you constantly apologize, even for trivial things, do your best to break the cycle. When you catch yourself saying, “I’m sorry,” ask yourself why—why are you apologizing? It may be necessary to apologize in certain situations, but you don’t have to apologize for being yourself. [16] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For instance, say you have a question during a work meeting; rather than saying, “I’m sorry, but can you clarify…?” try, “Can you clarify…?” This response shows that you’re confident in your question."
    },
    {
      "title": "Respect others",
      "content": "Respect others to show that you’re a confident individual. Treating others with respect shows that you value them as people, you're not threatened by them, and you're confident in who you are. Instead of gossiping about someone, avoid engaging in the drama. This shows that you're comfortable with your own opinions and beliefs. [17] X Research source"
    },
    {
      "title": "Take good care of yourself",
      "content": "Take good care of yourself to feel confident in your own skin. Your hygiene, attire, and health are all worth the effort, and not just for yourself, but for others as well. First impressions are very powerful, and looking sharp can help you appear confident right away. Plus, if you look confident on the outside, it can help boost your self-esteem so you feel confident on the inside. [18] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source This isn’t to say you must look a certain way to appear confident. Simply wear what you want to wear to feel your best! Spend time each day pampering yourself to boost your confidence."
    },
    {
      "title": "Learn to love yourself build self-confidence.",
      "content": "Learn to love yourself build self-confidence . Confidence and power come from within you, so build your confidence by loving yourself. Remember, you are a special, talented person, and plenty of people want to see you thrive. [19] X Research source If you're struggling to believe in or love yourself, make a list of your accomplishments and greatest attributes. Leah Morris, a life and relationship transition coach, suggests telling yourself positive affirmations in the mirror. Try saying how “You're going to nail this; you're going to be fine at the end of all this; everything is happening just as it should for you; you're smart; you're capable.” [20] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020."
    },
    {
      "title": "Take a deep breath and tell yourself, “I can do this.”",
      "content": "Take a deep breath and tell yourself, “I can do this.” People who lack confidence are often afraid of making a mistake. When you start to doubt yourself, remind yourself of how strong you are. Everyone makes mistakes, but it’s how you come back from them that really matters. Instead of looking at a mistake as a failure, look at it as an opportunity to learn and grow. [21] X Research source Try deep breathing exercises to help calm your nerves in the moment and appear more confident. [22] X Research source Start a journal to put stressful and anxious thoughts on paper. [23] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. Practice meditating and mindfulness to help boost your self-esteem and ease stress. [24] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Reader Poll: We asked 1931 wikiHow readers, and 55% said that being in a group of new people causes them a lot of stress or anxiety. [Take Poll] So if you also experience those feelings when you’re meeting new people, you’re definitely not alone!"
    }
  ]
}