{
  "url": "https://www.wikihow.com/Make-Copper-Sulfate",
  "title": "How to Make Copper Sulfate",
  "steps": [
    {
      "title": "Assemble your safety gear.",
      "content": "Assemble your safety gear. You will need eye protection, a lab coat or heavy long sleeve shirt to protect yourself from splashes, and acid-resistant (latex or nitrile) gloves. You should also keep a box of baking soda (sodium bicarbonate) on hand to neutralize any acid spills. Sulfuric acid is highly corrosive. Be careful not to spill or splash it. If you get sulfuric acid on your skin, immediately flush your skin with soap and cool water for at least 15 minutes, and seek medical attention. If you splash sulfuric acid in your eyes, flush your eyes for at least 30 minutes with cool water and seek medical attention. WEAR GOGGLES to prevent this from happening! If you spill acid on a surface, cover the spill with baking soda. Wait for the bubbling to stop. Then carefully wipe up all affected surfaces with a sponge or paper towels, and wash all of the material collected down the sink with plenty of water."
    },
    {
      "title": "Assemble your equipment.",
      "content": "Assemble your equipment. You will need a glass beaker or jar to perform the experiment in, and a glass measuring cup with milliliter gradations, or a glass eyedropper. You may also need a glass stir stick or spatula for retrieving excess copper pieces from the solution, and a scale to weight the copper. Do not use metal or plastic measuring spoons, as they will react with the acid."
    },
    {
      "title": "Find a suitable workspace.",
      "content": "Find a suitable workspace. This experiment will put off hydrogen (h 2 ) gas, which is extremely combustible, and should only be done outdoors or under a laboratory vent hood, away from any open flames or ignition sources. You should also set up your experiment on an acid resistant surface, preferably one that is glass, or specifically chemical resistant. [2] X Research source If you don't have a chemical-resistant surface to work on, you should at least put a sheet of thick cardboard under your work area. The sulfuric acid will dissolve the cardboard, but slowly enough that you can neutralize the spill with baking soda before it eats clear through."
    },
    {
      "title": "Assemble your materials.",
      "content": "Assemble your materials. For this you will need 30% hydrogen peroxide, and concentrated (98%) sulfuric acid. Both of these can be purchased at a scientific supply company, although the hydrogen peroxide can also be ordered from major online retailers. You will also need a few inches of copper wire, or some chunks of copper pipe, available at any hardware store. [3] X Research source"
    },
    {
      "title": "Create the acid solution.",
      "content": "Create the acid solution. Place 10 milliliters (0.34 fl oz) 30% hydrogen peroxide in a beaker. Then add 3 milliliters (0.10 fl oz) concentrated sulfuric acid. This is called \"Piranha solution\" and will heat up quickly, so be extremely careful. Never attempt to cover a beaker or vessel containing Piranha solution; it can explode."
    },
    {
      "title": "Add the copper.",
      "content": "Add the copper. Carefully place about 3g of copper wire or metal chunks into the solution. Do not use pennies for this experiment, as they contain a lot of metals besides copper and may cause unexpected reactions. [4] X Research source"
    },
    {
      "title": "Watch the reaction take place.",
      "content": "Watch the reaction take place. Bubbles will begin to form around the copper, and the clear liquid in the jar will begin to turn blue. Leave the copper in the solution until the bubbles stop forming. This can take several minutes, depending on the temperature and concentration of your solution. Carefully lift out any remaining copper with a glass spatula or stirring rod. You should now be left with an aqueous copper sulfate solution."
    },
    {
      "title": "Let the solution evaporate.",
      "content": "Let the solution evaporate. If you wish to collect the copper sulfate crystals, pour the copper sulfate solution into a shallow glass dish and leave it exposed to air for several days while the remaining liquid evaporates. Remember that the solution is still caustic, and use care in handling it. [5] X Research source You can then use your copper sulfate crystals in various experiments, or to grow larger crystals. [6] X Research source"
    },
    {
      "title": "Dispose of excess copper sulfate solution correctly.",
      "content": "Dispose of excess copper sulfate solution correctly. Copper sulfate is toxic to fish, plants, and other wildlife and should not be poured into lakes or streams, or rinsed down the storm drain. Copper sulfate is a common ingredient in many drain cleaners, and small quantities, like what this experiment will yield, can be safely diluted with water and rinsed down the sink."
    },
    {
      "title": "Assemble your safety gear.",
      "content": "Assemble your safety gear. Nitric acid is considerably more hazardous than sulfuric acid, so be very cautious during this experiment. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You will need eye protection, acid-resistant gloves and a lab coat."
    },
    {
      "title": "Find a suitable work space.",
      "content": "Find a suitable work space. Because of the risks involved with using nitric acid, this experiment should only done in a laboratory setting. As this experiment will put off toxic fumes (NO 2 gas), it must be done under a fume hood."
    },
    {
      "title": "Assemble your equipment.",
      "content": "Assemble your equipment. You will need a glass beaker or jar to perform the experiment in, a glass measuring cup with milliliter gradations, or a glass eyedropper, and a glass stirring rod or spatula to remove excess copper chunks, and a scale to measure the copper."
    },
    {
      "title": "Assemble your materials.",
      "content": "Assemble your materials. For this you will need water, nitric acid (70%), and concentrated (98%) sulfuric acid. These can be purchased at a scientific supply company. You will also need a few inches of copper wire, or some chunks of copper pipe, available at any hardware store. [8] X Research source"
    },
    {
      "title": "Create the acid solution.",
      "content": "Create the acid solution. First place 30 milliliters (1 fl oz) of water in the beaker. Then add 5 milliliters (0.17 fl oz) of nitric acid and 3 milliliters (0.10 fl oz) concentrated sulfuric acid. [9] X Research source"
    },
    {
      "title": "Add the copper.",
      "content": "Add the copper. Carefully drop about 6g of copper wire or metal chunks into the solution. Stand back away from the fumes, and watch the reaction take place. A brown gas will form, bubbles will form as the copper dissolves, and the liquid in the beaker will turn blue. The reaction is complete when the bubbling stops. The gas that results from the reaction is toxic, and should not be inhaled."
    },
    {
      "title": "Let the solution evaporate.",
      "content": "Let the solution evaporate. If you wish to collect the copper sulfate crystals, pour the copper sulfate solution into a shallow glass dish and leave it exposed to air for several days while the remaining liquid evaporates. Remember that the solution is still caustic, and use care in handling it. [10] X Research source You can then use your copper sulfate crystals in various experiments, or to grow larger crystals. [11] X Research source"
    },
    {
      "title": "Dispose of excess copper sulfate solution correctly.",
      "content": "Dispose of excess copper sulfate solution correctly. Copper sulfate is toxic to fish, plants, and other wildlife and should not be poured into lakes or streams, or rinsed down the storm drain. Copper sulfate is a common ingredient in many drain cleaners, and small quantities, like what this experiment will yield, can be safely diluted with water and rinsed down the sink."
    },
    {
      "title": "Assemble your safety gear.",
      "content": "Assemble your safety gear. You will need eye protection, a lab coat or heavy long sleeve shirt to protect yourself from splashes, and acid-resistant (latex or nitrile) gloves. You should also keep a box of baking soda (sodium bicarbonate) on hand to neutralize any acid spills. Sulfuric acid is highly corrosive. Be careful not to spill or splash it. If you get sulfuric acid on your skin, immediately flush your skin with soap and cool water for at least 15 minutes, and seek medical attention. If you splash sulfuric acid in your eyes, flush your eyes for at least 30 minutes with cool water and seek medical attention. WEAR GOGGLES to prevent this from happening!"
    },
    {
      "title": "Find a suitable workspace.",
      "content": "Find a suitable workspace. This experiment will put off hydrogen (h 2 ) gas, which is extremely combustible, and should only be done outdoors or under a laboratory vent hood, away from any open flames or ignition sources. You should also set up your experiment on an acid resistant surface, preferably one that is glass, or specifically chemical resistant. [12] X Research source If you don't have a chemical-resistant surface to work on, you should at least put a sheet of thick cardboard under your work area. The sulfuric acid will dissolve the cardboard, but slowly enough that you can neutralize the spill with baking soda before it eats clear through."
    },
    {
      "title": "Assemble your equipment.",
      "content": "Assemble your equipment. You will needs a 6-volt battery, a glass jar or beaker, 2 lengths of copper wire, concentrated sulfuric acid solution (available at scientific supply stores), a glass measuring beaker or eyedropper, and water. If you do not have access to concentrated sulfuric acid solution, you can use battery acid, which is 30-35% sulfuric acid and is available at hardware and auto parts stores."
    },
    {
      "title": "Create the sulfuric acid solution.",
      "content": "Create the sulfuric acid solution. Add 30 milliliters (1 fl oz) of water to the beaker, and 5 milliliters (0.17 fl oz) of concentrated sulfuric acid. If you are using the less concentrated battery solution, add 15 milliliters (0.51 fl oz) of acid to 20ml of water."
    },
    {
      "title": "Set the two wires in the solution so that they are not touching each other.",
      "content": "Set the two wires in the solution so that they are not touching each other. The wires should be an inch or so apart, depending on the size of your container, and should not be touching each other. [13] X Research source"
    },
    {
      "title": "Connect the wires to the 6-volt battery.",
      "content": "Connect the wires to the 6-volt battery. One wire should be wrapped around the positive terminal, and one should be wrapped around the negative terminal."
    },
    {
      "title": "Watch the reaction take place.",
      "content": "Watch the reaction take place. You should see bubble forming at the anode (the wire connected to the negative terminal) but not the cathode, and the solution will begin to turn blue as the copper sulfate is formed. Let the reaction run until the solution is quite blue, and then remove the wires from the solution and disconnect them from the battery."
    },
    {
      "title": "Evaporate the solution to recover the crystals.",
      "content": "Evaporate the solution to recover the crystals. You can evaporate the solution by pouring it into a shallow glass dish that is exposed to the air for several days. You can also speed the process up by boiling the solution carefully in a heat-resistant (pyrex or borosilicate) pan, and then pouring off the last bit of sulfuric acid that does not evaporate. Be careful, as the solution in question is caustic and should be handled with great care."
    },
    {
      "title": "Dispose of excess copper sulfate solution correctly.",
      "content": "Dispose of excess copper sulfate solution correctly. Copper sulfate is toxic to fish, plants, and other wildlife and should not be poured into lakes or streams, or rinsed down the storm drain. Copper sulfate is a common ingredient in many drain cleaners, and small quantities, like what this experiment will yield, can be safely diluted with water and rinsed down the sink."
    }
  ]
}