{
  "url": "https://www.wikihow.com/Get-a-High-Score-on-Subway-Surfers",
  "title": "How to Get the Highest Score in Subway Surfers: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Build up your multiplier.",
      "content": "Build up your multiplier. The best way to get a higher score quicker is to improve your multiplier. When you first begin playing, your multiplier will be set at x1. Every time you beat a set of missions, you will level up, and your multiplier will permanently increase by one, up to x30. This means that your score will be 30 times what it would normally be if you have a full multiplier. Missions include collecting a specific number of coins, jumping a certain number of times, picking up specific power-ups, and more. You can see your active missions by tapping the Missions button at the top of the main menu. If there's a mission that you just cannot do for whatever reason, then you can skip it in the shop for a certain number of coins, depending on what level you are on. Your multiplier will still go up like normal if it is the last mission that you need to level up."
    },
    {
      "title": "Upgrade your power-ups.",
      "content": "Upgrade your power-ups. The Coin Magnet, Jet Pack and 2X Multiplier are the most powerful pickups for increasing your score. The Coin Magnet will pick up any coin you run past, even if it isn’t in your lane. The Jet Pack will launch you above the course, where you are free to collect coins without worry. The 2X multiplier will double your current multiplier, up to 60x. [1] X Research source You can upgrade these powerups by spending coins that you earn on runs. Increasing the effectiveness of these powerups can dramatically increase the amount of coins that you earn when you are using them. Upgrade your Coin Magnet and Jet Pack first. This will help you early on in the game as you earn coins to unlock more upgrades and complete missions. Once your Multiplier is close to 30x, start upgrading the 2X Multiplier powerup. This will really start to significantly boost your scores. [2] X Research source"
    },
    {
      "title": "Stock up on hoverboards.",
      "content": "Stock up on hoverboards. These can be purchased for coins or won in prize boxes. Hoverboards last for 30 seconds, but their true power comes in taking a hit for you. If you hit an object while riding a hoverboard, your run won’t end. Instead, you’ll be back on foot, continuing your run and increasing your score. You should always have a good stock of hoverboards to use in emergencies when you can’t avoid hitting something. Moving forward is one of the two primary ways that you earn score. Hoverboards ensure that you keep moving forward, and your score keeps increasing. Have 600 to 900+ boards. Use them when your character already runs too fast for you to handle."
    },
    {
      "title": "Collect keys.",
      "content": "Collect keys. Keys are a currency that allows you to continue your run when you hit an object. Keys can be found while running through the course, in mystery boxes, or from weekly missions. You can also buy keys for real money. Having a good stock of keys can help keep a good run going a long time. [3] X Research source Only use keys when you hit something without a board, at 500k+ score."
    },
    {
      "title": "Grab a lot of coins.",
      "content": "Grab a lot of coins. It may seem obvious, but it can’t be stressed enough. For a really high score, you need to be grabbing as many coins as possible. This means using your powerups to their maximum effectiveness, performing perfect runs and lane changes, and not missing the timing of your jumps."
    },
    {
      "title": "Practice often.",
      "content": "Practice often. Since every run is different, you can’t just memorize the level and do the same thing over and over until you have the high score. You need to practice so that you can see the patterns coming and react in time. You probably won’t get a very high score when you first start, but after a few weeks of practice, you’ll start to see it creeping closer and closer to that elusive 1,000,000 point total. Keep at it!"
    }
  ]
}