{
  "url": "https://www.wikihow.com/Make-Banana-Jam-or-Jelly",
  "title": "How to Make Banana Jam or Jelly",
  "steps": [
    {
      "title": "Look at the ingredients list to find what you need.",
      "content": "Look at the ingredients list to find what you need. Put all those things out in front of you."
    },
    {
      "title": "Take the bananas.",
      "content": "Take the bananas. Slice the banana into very thin pieces. This is a must if you want the Jam to turn out right. Put them aside in a bowl for later."
    },
    {
      "title": "Fill the pot with 1 cup of sugar.",
      "content": "Fill the pot with 1 cup of sugar. Stir continuously. Cook until brown. Medium heat. You can't step away for more than 10 seconds.This will burn if not watched carefully."
    },
    {
      "title": "Add 1/3 a cup of water and the banana slices you put aside once brown.",
      "content": "Add 1/3 a cup of water and the banana slices you put aside once brown. Add the water then the bananas."
    },
    {
      "title": "Keep stirring on low heat.",
      "content": "Keep stirring on low heat. When soft and no banana pieces are noticeable, turn off heat."
    },
    {
      "title": "Put in a container or covered bowl and put in the fridge until chilled.",
      "content": "Put in a container or covered bowl and put in the fridge until chilled."
    },
    {
      "title": "Slice 3 bananas.",
      "content": "Slice 3 bananas."
    },
    {
      "title": "Pour water into the saucepan.",
      "content": "Pour water into the saucepan. Add the sugar until it is above the water level."
    },
    {
      "title": "Heat the mixture.",
      "content": "Heat the mixture. Stir it until it thickens."
    },
    {
      "title": "Add the sliced bananas to the thickened sugar solution.",
      "content": "Add the sliced bananas to the thickened sugar solution. Stir and cook until thoroughly softened."
    },
    {
      "title": "Remove from the heat.",
      "content": "Remove from the heat. Allow to cool."
    },
    {
      "title": "Place in a tumbler.",
      "content": "Place in a tumbler. Freeze."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}