{
  "url": "https://www.wikihow.com/Make-a-Dance",
  "title": "How to Make a Dance",
  "steps": [
    {
      "title": "Pick a piece of music.",
      "content": "Pick a piece of music. One of the most crucial parts of choreographing a dance is picking out the music. Pick a piece that you love, that makes you feel emotional and that inspires you to want to dance yourself. Don’t worry about how long the piece is – you can always edit it to be longer or shorter using a program like GarageBand. Take a long walk and listen to the music you have on your iPod or phone. Make sure to pick a song that you like listening to. You’re going to be hearing it a lot."
    },
    {
      "title": "Figure out your audience.",
      "content": "Figure out your audience. Your audience, in this case, is who you will be teaching the dance to. Your audience is important because it will guide your choreographic choices, based on the audience's preference and skill levels. For instance, you wouldn't teach the same dance to a group of experienced ballerinas that you would to an informal senior citizen's dance group. Consider tailoring your dance to a specific group. If you're trying to create a new dance fad, you may want to go on the simple side, as most people's dance skills are amateur."
    },
    {
      "title": "Find your inspiration.",
      "content": "Find your inspiration. Dances don’t just appear out of nowhere – they are born from a choreographer’s thoughts and points of view. There are many ways to go about getting inspired to create a dance. Here are a few options: Look at abstract designs and try to create movement that mimics what’s on the paper. Read a book and let a line from the book inspire movement. Try listening to the music you selected over and over and improvising a dance. Pick a mood or emotion and let that inspire the dance. Watch a movie and try to recreate a scene from the movie through movement. Let a story, a relationship or an abstract concept serve as the inspiration for the piece."
    },
    {
      "title": "Determine the style of the dance.",
      "content": "Determine the style of the dance. The age and skill level of your dancers will determine a great deal about the dance. After all, it’s almost impossible to teach a hip hop routine to a bunch of 5-year-olds who have only ever taken ballet. [1] X Research source Think about how old the dancers are and how much dance experience they have. Then pick a style of dance that the dancers will be able to confidently execute. It’s okay to add in moves from different styles of dance. Decide how many people will be performing in the dance. Is it going to be a solo or a duet? Will there be a whole line of people? Decide if you yourself will be dancing or just choreographing."
    },
    {
      "title": "Choreograph in short spurts.",
      "content": "Choreograph in short spurts. It’s much harder to choreograph an entire dance piece in one go. Instead, try breaking the song into verses or measures and creating sequences of movement for these smaller portions. [2] X Research source If you have a distinct movement, try to bring it back at different intervals throughout the piece. Make sure the movements you’re choreographing aren’t too hard for your dancers to perform. Write your notes down so you don’t forget them!"
    },
    {
      "title": "Give yourself a dance prompt.",
      "content": "Give yourself a dance prompt. Instead of fruitlessly trying to come up with new movements, assign yourself a simple task, like walking the dog or eating breakfast. Then improvise movements based on that task. [3] X Research source Once you have the movements for your simple task down, try drawing them out or speeding them up so they feel more like dance. Rearrange the moves to create a new, more interesting sequence of movements."
    },
    {
      "title": "Have fun and be true to yourself.",
      "content": "Have fun and be true to yourself. Dance, like all art, is subjective. Don’t get caught up in whether your dance looks like every other dance – just create a dance that showcases your point of view as a choreographer. [4] X Research source It’s okay to be inspired by other dances, but don’t steal a dance move for move. Don’t get upset if your dance doesn’t come out exactly how you envisioned – there’s no such thing as a perfect dance."
    },
    {
      "title": "Find the right space.",
      "content": "Find the right space. To teach a dance to a group of people, you're going to need a decent amount of space so that people can move around. A studio space with a mirror is ideal, so that your students can see themselves in the mirror. If you can't get a studio, a gym is also a good space. Another option is an outdoor tennis or basketball court."
    },
    {
      "title": "Experiment with chunking.",
      "content": "Experiment with chunking. Chunking is a method in which you divide the dance into sections and give each section a name. This method is especially helpful when teaching longer dances to your dancers. This will also be helpful when you want to rerun sections. Instead of trying to describe the movement, you can say “Go to the ‘Windmill’ section.” People remember better in small portions, so chunking will also help your dancers retain the choreography more easily."
    },
    {
      "title": "Allow your dance to adapt.",
      "content": "Allow your dance to adapt. Just because you’ve sketched out a clear sequence of steps doesn’t mean that sequence can’t change in rehearsal. Allow your dancers to experiment with adding their own unique flair to the dance. [5] X Research source However, even if your dancers aren't skilled enough to add new moves, you still need to be willing to adapt. For instance, if a transition proves to be too difficult for the group, you may need to modify it a bit to make it easier. Watch as the dancers perform, and if they’re doing something you like, make a note of it and add it to your choreography. Keep in mind, it’s easier to be flexible and change choreography if you’re working with a smaller group of dancers. Always pay attention to how the dance is working. Sometimes, certain sequences just don't work in a group, or a group doesn't have the skill level to execute what you want."
    },
    {
      "title": "Use visual feedback.",
      "content": "Use visual feedback. One way to help your dancers see what they're doing wrong is to use visual feedback. You can record dancers individually with a smartphone, and then play it back for them. Alternatively, you can break up in pairs and have each person record the other. [6] X Research source One plus of using pairs is the partners can film individual sequences over and over again until each person gets it right. If you film each student, try reviewing the video one-on-one with each student to encourage them and help them figure out how to do better."
    },
    {
      "title": "Don’t get frustrated.",
      "content": "Don’t get frustrated. Some people have dance backgrounds while others are reluctant dancers at best. Be patient when teaching the choreography and don’t worry if some of your dancers are struggling with the moves. [7] X Research source Tell the dancers to practice the choreography before the next rehearsal. The more the dancers run the moves, the more comfortable they will get and the better the dance will look."
    },
    {
      "title": "Select the costumes.",
      "content": "Select the costumes. Costumes are a great way to help set the mood and create the world that your dance will live in. Costumes can take a great deal of time to create and can be very expensive, so determine a monetary and time budget before beginning. [8] X Research source If you don’t want to spend a great deal of time and money, ask your dancers to come dressed in their own clothes. Make sure they wear clothing they can easily move in. You can also buy costumes at a thrift shop or work with an artistic friend to make them from scratch. If your dancers will be dancing in a big venue, make sure they wear stage makeup so their faces can be seen clearly."
    },
    {
      "title": "Have a dress rehearsal.",
      "content": "Have a dress rehearsal. Dress rehearsal is the perfect time to run through the dance, in costume, with any props. It’s important to make the dress rehearsal mimic the show as closely as possible so the dancers will be prepared. [9] X Research source If the dancers have never performed in front of an audience before, invite some friends to the dress rehearsal so the dancers can get used to it. If possible, hold the dress rehearsal in the same space as the show. Make sure to practice using the lights and the audio during the dress rehearsal."
    },
    {
      "title": "Let go of control and have fun.",
      "content": "Let go of control and have fun. Whether you’re dancing in your dance or watching from the wings, the performance of your dance will be nerve-wracking. Channel your nervous energy into excitement and enjoy the show! [10] X Research source Don’t worry if someone falls or makes a mistake. The show will go on. Take pictures or ask someone else to. Creating a dance is a big accomplishment and you’ll want to remember it."
    }
  ]
}