{
  "url": "https://www.wikihow.com/Host-an-All-Nighter-with-Friends",
  "title": "How to Host an All Nighter with Friends",
  "steps": [
    {
      "title": "Plan ahead.",
      "content": "Plan ahead. Each night has separate parts determined by time. The main six parts are: Early night. (6pm to 8pm) Dusk (9pm to 11pm) Midnight (12am to 1am) Twilight (2am to 5am) Dawn (6am to 7am) Morning (8am to 12pm)."
    },
    {
      "title": "Determine what will happen during each of these six parts.",
      "content": "Determine what will happen during each of these six parts."
    },
    {
      "title": "Make sure to have flashlights for the all-nighter.",
      "content": "Make sure to have flashlights for the all-nighter. This will help to alleviate fears in the dark."
    },
    {
      "title": "Plan what will happen during the all-nighter.",
      "content": "Plan what will happen during the all-nighter. Games are a big part of a successful all-nighter. Here are plenty of examples for you to be inspired by: [1] X Research source Hide and Go seek in the dark. Pros: It's fun, time consuming, and keeps you awake. Cons: It may be a bit loud or hard to find a good spot. Plus, if the seeker takes really long, you might dose off. Scary stories Pros: It's fun, gets you so scared you have to stay awake, makes you think of stories to tell. Cons: You may get a little too scared, or you or person may be so scared you have to stay awake. For days. Internet Pros: Very time consuming, and keeps you awake. A lot of fun and lots of things to do. Cons: It may be too loud, make you laugh a little too loud, or can't find anything else to do. Video Games Pros: Very time consuming and a lot of fun. Cons: Depending on what game you play, it can get boring fast, or it might be too loud. Make-up Pros: Time-consuming and many things to do. Cons: Not everyone likes makeup, or it might get messy. Music Pros: It'll keep you awake, and you can sing, too. Cons: May get too loud. Truth or Dare Pros: Fun and time-consuming, requires creativity. Cons: May get too wild, Most dares won't work because it'll make noise, and requires creativity. Gossip or just chat Pros: Exiting and fun, usually time-consuming. Cons: May hurt somebody's feelings, or get boring fast. Watch TV Pros: Time consuming depending on what show, interesting. Cons: Not everyone may like the show, too loud, or could get boring fast."
    },
    {
      "title": "Rest up before the event.",
      "content": "Rest up before the event. Before your friend's arrival, if you have enough time, take a nap! It might sound ridiculous, but it actually works. If you can't seem to doze off, or stand still, then don't. If you force yourself to take a nap, you'll get more tired and exhausted, and you'll waste time. [2] X Research source If you don't have much time, or they're on their way, try not to fool around. Get everything ready before they end up on your doorstep. They probably won't want to help set up a sleepover, after all, you are the host!"
    },
    {
      "title": "Get on with the party from the start time.",
      "content": "Get on with the party from the start time. If it turns out somebody will be a bit late, or somebody showed up early, then don't sit around and wait. Begin doing activities while you wait for your friends. Once all of the guests arrive, start doing the good stuff. In other words, get this party started!"
    },
    {
      "title": "Be quiet when using other rooms during the all-nighter.",
      "content": "Be quiet when using other rooms during the all-nighter. This is especially important if the all-nighter isn't really condoned by the parents. If you need to go to the bathroom, but can't because you'll wake everyone up, don't go crazy, but don't flush. If you really have to no matter what, tell your friends and they'll pretend they're asleep, and mess up your hair so you have bedhead. You can also block the crack of the door with a towel or other object that will drown out the sound, that way your friends won't need to pretend to be asleep. If you accidentally drop something, make some kind of noise or hear footsteps, stop, drop and get into sleeping positions. Once you all are in a sleeping position, stay completely quiet and count 10 seconds. If you hear footsteps, pretend you are asleep, If you count 10 seconds and hear no footsteps, you're usually good. Need to use the microwave for something while your guardians are sleeping and it's loud? No fear, there's a solution for that. When you're going to put the food into the microwave, try to open it slowly. If you have to jerk it open, put your elbow on it and pull the handle. (That works for doors too) When you put it in, close the microwave slowly and wait at least 10 seconds. If you hear nothing, enter the numbers in. Make sure to put it in a couple of seconds ahead, so you can open it before it ends and starts beeping, and Voila! You have your cooked food."
    },
    {
      "title": "Deal with scared guests as best you can.",
      "content": "Deal with scared guests as best you can. Give scared people a flashlight and do some fun or funny things to help them feel better. They definitely don't want to be left out because they are scared. If that doesn't work, try making them feel better by turning on the lights, or if you can't do that, then explain how that could never happen. If silliness doesn't work, hopefully logic will. [3] X Research source"
    },
    {
      "title": "Do your best to stay awake.",
      "content": "Do your best to stay awake. If you or your friends are feeling sleepy, do some more activities. If you are doing activities, either you aren't occupied enough, it's not very active, or the game is boring. [4] X Research source A good tip to keep awake is to eat spicy or sour foods. They mess with your taste buds and the sugar will keep you up. Same goes with caffeinated drinks such as soda, coffee, Monster, Red Bull, or any other brand names. If you can't eat, or that doesn't work, try stepping things up a bit. Pillow fights, scary movies, or other time consuming interesting and fun things. If fun's not the problem, you may just need to splash some water on your face."
    },
    {
      "title": "Eat well the next morning.",
      "content": "Eat well the next morning. Once you and all your friends have finally stayed up or finished the sleepover, be sure to have a good breakfast and send your guests off with a smile! Just be sure to tell them to make up the hours of sleep they lost, especially if it's during the school year!"
    }
  ]
}