{
  "url": "https://www.wikihow.com/Get-a-Guy%27s-Phone-Number",
  "title": "How to Get a Guy's Phone Number",
  "steps": [
    {
      "title": "Ask him for his number.",
      "content": "Ask him for his number. Directly asking a cute guy for his number is more than little nerve wracking, but the risk is worth the reward. When you have worked up the confidence to ask for his phone number, consider using a cheesy pick-up line, a cute video, or a note. Your boldness may capture his attention and score you his number. [1] X Research source When approaching a stranger for his phone number, you can be more bold, daring, and memorable. By him a drink and ask the server to write your name and phone number on the cup. Tell him you are playing the phone number game and you need his digits to beat your friend. [2] X Research source When you ask an acquaintance or close friend for his number, there is more at stake because the chances of you encountering him again are significantly higher. Instead of asking him directly for his number, request his digits in a joking way. Ask him if you can check of his phone. After a few minutes, hand it back to him. Tell him “your phone is pretty cool but it is missing one thing: my phone number.” If he is interested in exchanging numbers, he will ask for yours. [3] X Research source If you met him through work and it is not appropriate to ask directly for his number, consider asking for his business card instead. [4] X Research source"
    },
    {
      "title": "Give him your number.",
      "content": "Give him your number. One of the surest ways of getting a cute guy’s number is to offer up your own. This may prompt him to offer up his own number on the spot or he may choose to text or call you later. There are several ways you can pass along your number: Write your number on a napkin and give it to him. [5] X Research source If you meet him while working at a restaurant or store, write your name and number on his cup or receipt. If he is your waiter, leave your number on a comment card or receipt. [6] X Research source"
    },
    {
      "title": "Tell him you would like to “keep in touch.”",
      "content": "Tell him you would like to “keep in touch.” When you meet an adorable guy and really hit it off, it is natural and acceptable to want to remain in contact. Express that you would like to get to know him more or want to continue the conversation. If he seems interested but doesn’t immediately give you his number, don’t panic. Consider handing him your business card, writing down your number for him, or asking him to put his number in your phone. [7] X Research source"
    },
    {
      "title": "Ask a mutual friend for his number.",
      "content": "Ask a mutual friend for his number. Whether you are struggling to strike up the nerve to ask a guy for his number or you missed your window of opportunity to do so, consider asking a mutual friend for his number. When you contact the guy, tell him where you met and who gave you his number. [8] X Research source If your friend asks you to explain why you would like the number, don’t be alarmed—it is normal for people to be protective of their own or their friend’s privacy. Provide your friend with a reasonable explanation, such as “I think he is cute,” “I want to get to know him better,” “he left before I could ask him myself,” or “I need it to invite him to a party.”"
    },
    {
      "title": "Create a reason to exchange numbers.",
      "content": "Create a reason to exchange numbers. Sometimes, it is necessary to create opportunities to exchange numbers with a cute guy. Potential opportunities include: Asking him to study. After you express interest in reviewing for a test or exam with him, ask to exchange numbers so you can plan a study session. [9] X Research source Making plans. Casually invite him to hang out with a group of friends or ask if he would be interested in doing an activity that just the two of you enjoy. [10] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. If he expresses interest in spending more time with you, whether in a group setting or one-on-one, ask to exchange numbers so you can text or call him to hang out. [11] X Research source"
    },
    {
      "title": "Call or text yourself from his phone.",
      "content": "Call or text yourself from his phone. If the opportunity arises for you to have access to his phone, take advantage of it. Ask to use his phone to make an call or send a text. When he gives you his phone, ring or text yourself. Save his contract information in your phone. [12] X Research source You could also ask to use his phone to help locate your “lost” phone. As you search for your phone, have him dial your number or text you. Once you find your cell, you can save his contact information. Never steal someone’s phone. Always ask for permission."
    },
    {
      "title": "Friend him on social media.",
      "content": "Friend him on social media. After you meet a cute guy, don’t hesitate to send him a friend request on social media. When he accepts your request, you will have access to his profile, which contain his phone number. If his number isn’t listed, send him a message or chat with him online instead. [13] X Research source"
    },
    {
      "title": "Respond to his request for phone numbers.",
      "content": "Respond to his request for phone numbers. When people get new phones, they will often post a message on social media requesting their friends’ phone numbers. If your crush sends out a similar message, don’t hesitate to respond. It is the perfect excuse to exchange numbers with a guy. [14] X Research source"
    },
    {
      "title": "Ask for his number via social media.",
      "content": "Ask for his number via social media. It can be extremely stressful to ask for a guy’s number face-to-face. Fortunately, social media provides you with several alternative ways to communicate with your crush: Instead of asking for your crush’s number in person, send him a private message requesting his number. Chat with your crush online. After talking for a while, explain that you have to get going and ask if you can continue talking with him via text instead. Send flirty tweets back and forth with your crush. Once you capture his attention, ask for his number. [15] X Research source"
    }
  ]
}