{
  "url": "https://www.wikihow.com/Get-an-11-Year-Old-Boy-to-Like-You",
  "title": "How to Get an 11 Year Old Boy to Like You",
  "steps": [
    {
      "title": "Don’t be afraid to talk to him.",
      "content": "Don’t be afraid to talk to him. A lot of girls your age may not have a ton of experience talking to boys yet, so you can make yourself stand out by simply taking the time to talk to the boy you like. You don’t have to come up to him and start an intense conversation, especially if you’ve never spoken before, but just making the move to say “hi,” give him a small wave, or ask a question about class can give you the opening to start talking. He’ll be impressed that you’re so confident and will want to talk to you more. At first, you can just say “hi” to him in a group setting or even introduce yourself. You can build your way up to talking to him the next time. If you’re shy , you can think of something to say to him in advance, like asking how he likes the class you have together or how his baseball game went."
    },
    {
      "title": "Smile",
      "content": "Smile at him. You don’t have to hide under your desk or ignore him every time he passes you by. Just smiling at him will lead him to wonder who you are and will make him want to know more about you. Guys also like girls who are friendly because they put them at ease and make them feel more comfortable. You may think that they really like girls who are cool and quiet, but that’s just a myth; just the act of smiling at the guy will get him to notice you and to want to get to know you more. [1] X Research source Smile at him when you make eye contact. You don’t have to seek the guy out just to smile at him."
    },
    {
      "title": "Let him see you having a good time.",
      "content": "Let him see you having a good time. Another way to get the guy to notice you is to make sure that he sees you having fun . Whether you’re talking to your friends, playing in the street with your neighbors, or standing in the cafeteria line, he should see that you’re a positive person who generally enjoys herself no matter where she goes. Seeing that you’re a fun, pretty happy person who likes what she’s doing will attract the guy and will make him want to get to know you. If he always sees you scowling or staring at your phone, then he may not think you’re a very fun person to spend time with. This doesn’t mean that you should fake it. If you’re having a terrible day, you don’t have to laugh loudly to get the guy’s attention. But in general, you should make a point of being a person who is happy and easy to be around . If he sees you smiling and laughing, he’ll want to spend more time with you to soak up your positive energy."
    },
    {
      "title": "Have confident body language.",
      "content": "Have confident body language. If you carry yourself in a confident manner , then the boy will think that you’re confident in who you are. You should keep up good posture whether you’re standing or sitting and make sure not to slouch. Avoid folding your arms across your chest or you’ll look unfriendly or insecure. Instead, keep your arms out at your sides and sometimes use them to gesture when you speak. When you’re walking or talking to people, look straight ahead instead of down at the floor. Another way to have confident body language is to turn your body towards the person you’re talking to. If you’re talking to the boy you like, turn toward him, to show that you’re comfortable talking to him."
    },
    {
      "title": "Impress him with your confidence.",
      "content": "Impress him with your confidence . Guys like girls who are confident and who are happy with who they are and how they look. Though many eleven-year-olds can be insecure, as their bodies and ideas of the world change, you can work on being confident in the person you are and the changes you are going through. Talk loudly enough to be heard without being obnoxious and avoid putting yourself down in conversation. You don’t have to seem like you think you’re the greatest thing since sliced bread, but you should generally give off the impression that you like who you are if you want to get the guy to like you. To be confident, don’t say anything bad about yourself, unless you’re playfully poking fun at yourself and make it clear you’re only joking. Talk about the things you really care about or are good at. This will show that you’re happy with who you are. You don’t have to be perfect to be confident. However, you should be aware of your flaws and should want to work on them."
    },
    {
      "title": "Be friendly with everyone.",
      "content": "Be friendly with everyone. Don’t go thinking that a guy will only like you if you’re popular and mean to a lot of people. If you pick on people who you think are “less cool” than you just to make yourself look good, any nice guy won’t like that. You can work on building a positive image by being friendly and nice to everyone who deserves it, instead of being selectively mean or nice. If you’re friendly with pretty much everyone in school, then the guy will want to get to know you because he’ll see that you must be cool if you click with so many people. Become friends with his family, especially his siblings. With them on your side, getting him to be yours will be a lot easier. Boys tend to hate drama. It’s much easier for them to like girls who are friends with everyone than girls who are constantly feuding with people. If there’s a new girl in school, take it upon yourself to take her under your wing. If you throw a party, try to be inclusive and invite everyone you like instead of leaving people out just to be mean."
    },
    {
      "title": "Stand out to him.",
      "content": "Stand out to him. If you want to get the guy to notice you , then you have to find a way to stand out to him. This doesn’t mean you have to dye your hair pink or apply beauty cream on your face. It does, however, mean that something about you has to seem different to him. It could be your quirky sense of humor. It could be your awesome fashion sense. It could be the way you can start a conversation with literally anyone. Find your thing and make sure he notices it.Try learning to play an instrument,for example guitar.A girl playing guitar will get attracted by him. It can be anything from your love for singing and dancing to the jewelry that you make for your friends. It’s important that you’re passionate about something, but it doesn’t matter what it is. Of course, you should stand out for something positive, not for being mean to your teachers or starting drama."
    },
    {
      "title": "Make him laugh.",
      "content": "Make him laugh. Don’t be afraid to show off your sense of humor , even if you think it’s a little quirky or offbeat for his taste. Girls are sometimes afraid to show boys their sense of humor because they think it’s not “cute”; the truth is, many guys love nothing more than a girl who can make them laugh. You can playfully tease him, even go out on a limb and tell him a corny joke, or just make funny observations about your teachers, TV shows, or your mutual friends. He’ll be even more interested in you once he sees you can crack him up. [2] X Research source Really, talking to a boy you like isn’t different from talking to one of your girlfriends. Don’t try to censor yourself in the humor department and just be your same old funny self."
    },
    {
      "title": "Give him a small compliment.",
      "content": "Give him a small compliment. Another way to get a guy’s attention is to give him a little compliment. This can mean telling him you like his shirt, or compliment a hat with his favorite sports team’s logo on it while saying you’re a fan of the team, or going to his basketball game with a few of your friends and telling him he did a great job afterwards. You don’t have to mention anything that may be too forward, like telling him he has nice eyes, or that may make him blush a little too much. But mentioning something he’s good at or something he’s wearing may make him notice you. [3] X Research source Don’t go overboard. Just say something like, “Nice job in the game today” or “I like your new shoes” to get his attention."
    },
    {
      "title": "Don’t take yourself too seriously.",
      "content": "Don’t take yourself too seriously. Another way to keep the boy interested is to show that you don’t take yourself super seriously at all and that you’re able to take a joke. You can lightly make fun of yourself without sounding insecure, or just talk about how much fun you’re having on your soccer team without worrying about how good you are. There’s no need to be super stressed about school, your friendships, or your outside activities, and you should show that you can roll with the punches. Guys like it when girls are motivated but also when they don’t worry too much, because it’s more fun to loosen up and have a good time. Try to avoid talking worrying about how you come off all the time and focus on enjoying the moment. It’s much more important to enjoy yourself than to have a perfect image. Focus on talking about all the good things you’re looking forward to doing, instead of worrying about everything that can go wrong for you."
    },
    {
      "title": "Ask him about himself.",
      "content": "Ask him about himself. If you want to keep the guy interested, then you have to show him that you’re interested in who he is as a person. You don’t need to interrogate him, but you should make an effort to get to know him, from talking about his siblings to his favorite bands or TV shows. Make sure that there’s a balance between talking about yourself and asking the guy a few questions, and give him time to open up. Here are some great things you can ask him questions about: His favorite TV shows, bands, or movies His favorite sports teams His hobbies or interests His pets His weekend or summer plans"
    },
    {
      "title": "Don’t use your friends to give him messages.",
      "content": "Don’t use your friends to give him messages. If you want the guy to really like you and even to see you as a potential girlfriend, then you shouldn’t get your friends to talk to him for you or to text him or give him notes. Though it may be less scary to communicate with him this way, he’ll be much more impressed if you’re mature enough to talk to him yourself. If you have something important to say to him, then take a deep breath and muster up the courage to say it yourself. Your friends may even offer to talk to him for you. It may be tempting, but you should gently turn them down, explaining that you’d rather talk to him yourself."
    },
    {
      "title": "Let him know what you like about him.",
      "content": "Let him know what you like about him. If you want to keep the boy’s interest, then you should let him know what makes him special. This doesn’t mean you have to give him a list of all of your favorite things about him, but it can help if you show him that you really notice what makes him stand out. You can mention how much you like his sense of humor, how easy it is to talk to him, or just a reason why he’s not like the other boys he knows. Once you get to know each other and it’s pretty clear you like each other, then letting him know how you feel can make him see that you really get him. You can say something like, “It’s so easy for you to talk to almost anyone. How do you do that?” You can also say, “You never fail to crack me up.” You can also say, “I feel like you really understand me. It’s easy to tell you anything.”"
    },
    {
      "title": "Find something you have in common.",
      "content": "Find something you have in common. Though wowing a guy with your charm and confidence can go a long way, if you want to keep him interested, then you have to find common ground so you can find something to talk about. You don’t have to have everything in common, but it would be nice if you liked some of the same bands, TV shows, sports teams, celebrities, or even outdoor activities. Work to find something that you like and find a way to explore that interest together, like going to a baseball game, watching a movie together, or even reading the same book and then talking about it. Here are some things you can have in common: Favorite bands Favorite TV shows Favorite movies Similar upbringing Having siblings Favorite foods or restaurants Shared sense of humor"
    },
    {
      "title": "Be friendly with his friends.",
      "content": "Be friendly with his friends. It can be a little tricky to make friends with boys when you’re only eleven, but it’s important to try to be nice to the boy’s friends if you want to make his affection last. You don’t have to be best friends with his friends, but you should at least be friendly and kind, so that they have nice things to say to him about you. If you come off as standoffish or mean, then they’ll try to tell the boy not to hang out with you, and some boys tend to listen to their friends at that age. When you see his friends, say “hi” and ask how they’re doing. Get to know them a little bit to show that you really care about their friend. If you don’t like one of his friends, don’t tell him that. It’ll only cause a rift between you."
    },
    {
      "title": "Show him some affection.",
      "content": "Show him some affection. Since you’re only eleven, you don’t need to think about getting too intimate with the boy. Still, some light affection can help your relationship stay strong. You can hold hands, whether you’re walking together or watching a movie. You can give him a hug when you see him, or even have him put his arm around you if you’re hanging out together. Just a little bit of affection can go a long way in keeping your relationship strong. Just remember that a lot of eleven-year-old boys aren’t into publicly showing affection, even if they like somebody a lot. Start slow with showing affection publicly and see what he’s comfortable with."
    },
    {
      "title": "Don’t overwhelm him.",
      "content": "Don’t overwhelm him. You may see hearts, rainbows, and butterflies whenever you lay eyes on the boy, but you may want to keep that to yourself. You should let him know you like him without saying that you think you want to marry him and that you’re totally in love with him, or you’ll be scaring him off a bit. Remember that, when you’re eleven, it’s important to keep the relationship light and fun instead of getting intense too soon. This is good advice, in fact, for the beginning of any relationship at any age! You can write him notes to say hi and to tell him that you’re thinking of him. However, you don’t have to feel compelled to tell him the fifty things you like the most about him."
    },
    {
      "title": "Don’t put too much pressure on your relationship.",
      "content": "Don’t put too much pressure on your relationship. You should enjoy spending time with the boy and living in the moment instead of thinking about the future too much. Just enjoy it for what it is instead of worrying about what will happen next year, over the summer, or when Valentine’s Day rolls around. Instead, focus on getting to know the boy and having a good time together, and you’ll see that you’ll be able to have a great time without overthinking it. [4] X Research source At first, avoid asking the boy what he thinks about you in the long term, or what will happen to you over the summer or as you transition to middle school, if that’s coming up soon. You’ll cross that bridge when you get there."
    },
    {
      "title": "Always make time for your friends.",
      "content": "Always make time for your friends. If you want the relationship to truly last, then you have to make sure you find a balance between spending time with your new boy and your old friends. Your friends will always be there for you, and you don’t want to kick them to the curb just because there’s a new love interest in your life. Finding a healthy balance between your boy and your other friends will keep your relationship strong and meaningful. If you spend time with your friends in addition to the boy, then you’ll have more time to miss each other. Balancing your relationship with your friendships is a skill that it may take years to master, so why not start early? Having time for all the people you care about is important to your happiness. [5] X Research source"
    },
    {
      "title": "Find new things to do together.",
      "content": "Find new things to do together. To make your relationship last , you should avoid falling into the same old routine. Though there are some limits to things you can do together when you’re eleven, you can try to keep things interesting by trying new restaurants, going to school dances together, or even watching sports together. It can be nice to find a routine that you both like while also keeping the relationship fresh with new and exciting activities. Go to the pool, a lake, or a beach together with the boy and a bunch of your friends. Check out an old comic book store together. Have a retro day and hang out on the playground. Play kickball with a bunch of your friends. Invite some friends over for a pizza and movie night. Sometimes, you can have the most fun just by taking a walk together and talking about life."
    }
  ]
}