{
  "url": "https://www.wikihow.com/Grow-a-Choko-Vine",
  "title": "How to Grow a Choko Vine",
  "steps": [
    {
      "title": "Start a sprout from a healthy, mature fruit.",
      "content": "Start a sprout from a healthy, mature fruit. Choose a fruit that’s hard, green, and smooth. It should be free of wrinkles, dents, or blemishes. Larger, mature fruits are the best choice, as small, immature fruits may just rot instead of sprout. [1] X Research source If you can’t find choko fruit at a local grocery store, you could try searching online for a mail order company. Seeds are hard to separate from the fruit and aren’t often sold on their own, but you might be able to track some down online. [2] X Research source"
    },
    {
      "title": "Place the fruit on its side in a soil-filled container.",
      "content": "Place the fruit on its side in a soil-filled container. Fill a gallon-sized (about 4 liters) container with potting soil, and make a little hole in the soil for the fruit. Place the fruit on its side in the soil so the tip of the stem points at a 45 degree angle. Cover the fruit with soil, but make sure the tip of the stem still shows. [3] X Research source"
    },
    {
      "title": "Keep the container in warm, dry place.",
      "content": "Keep the container in warm, dry place. Find a dark place with good ventilation to store the fruit until it sprouts. If possible, keep the temperature between 80 and 85 degrees Fahrenheit (about 27 to 29 degrees Celsius). Water it occasionally, or when the soil completely dries out. The sprout should emerge in about one month. [4] X Research source A pantry, under the sink, or a closet (with the door cracked) are all good spots to sprout your fruit."
    },
    {
      "title": "Plant your sprout when there’s no threat of frost.",
      "content": "Plant your sprout when there’s no threat of frost. When the sprout is about 5 to 7 centimeters (2 to 2.75 inches) in length and has three to four sets of leaves, it’s ready to be transplanted outside. Choko vines are frost tender, so plant your sprout outdoors in the spring three to four weeks after the last frost. [5] X Research source"
    },
    {
      "title": "Choose a well-lit spot in your garden with plenty of space.",
      "content": "Choose a well-lit spot in your garden with plenty of space. Choko vines love lots of sun. While they can grow in partial shade, less sun will result in a smaller harvest. They can grow aggressively, so make sure you give your vines plenty of space. [6] X Research source Once the roots are mature, a perennial choko vine can grow at least 30 feet (almost 10 meters) in a single season! If you live in a hot, arid climate, it’s wise to offer your vines some protection from the fierce afternoon sun and drying winds. Look for a spot in your yard that gets plenty of light in the morning, but becomes more shaded later in the day, when the sun is more intense. [7] X Research source"
    },
    {
      "title": "Fertilize your planting site.",
      "content": "Fertilize your planting site. Turn the soil at a 4 by 4 foot (about 1.25 by 1.25 meters) planting site with a garden tiller or shovel. Mix 20 pounds (about 9 kilograms) of manure with the soil. If you have poor draining soil, such as heavy clay, add mature, well-rotted compost to improve drainage and aeration. [8] X Research source"
    },
    {
      "title": "Transplant your choko sprout.",
      "content": "Transplant your choko sprout. Dig a hole 4 to 6 inches (10 to 15 centimeters) deep. Carefully remove the sprouting fruit from the container and bury it in the hole. Cover the fruit with soil, but leave the sprout above ground level. [9] X Research source Water the sprout well after transplanting it."
    },
    {
      "title": "Provide a wooden trellis or fence to support your vines.",
      "content": "Provide a wooden trellis or fence to support your vines. When it matures, your choko will grow into a heavy mass of vines. Place a strong trellis or other support next to your sprout, and hammer its stakes deep into the ground so it doesn’t topple once the vines become heavy. [10] X Research source You could also choose a planting site next to a sturdy fence to support your vines. Avoid using a metal support, which can get too hot and damage the vines."
    },
    {
      "title": "Keep the soil from drying out completely.",
      "content": "Keep the soil from drying out completely. If you don’t get a lot of rain, keep the soil from drying out and water it regularly. [11] X Research source When vines don’t receive enough water, they produce stringy fruit. If you do get lots of rain, add compost every month to maintain an intact top layer. [12] X Research source"
    },
    {
      "title": "Train the vines to grow on the support.",
      "content": "Train the vines to grow on the support. The vines will start to grow wildly, so you’ll need to train them to grab onto the trellis or fence. Wrap loose vines around the support’s bars regularly to keep them from spreading everywhere. [13] X Research source"
    },
    {
      "title": "Harvest the first crop in autumn.",
      "content": "Harvest the first crop in autumn. After 120 to 150 days, or by the late summer and early autumn, the vines will start to flower and produce fruit. Cut fruit from vines with a knife or pruner before the skin gets too hard. Mature fruit are between 4 and 6 inches (10 and 15 centimeters) in length. [14] X Research source Don’t let fruit sit on the ground, or they’ll start to split and germinate. [15] X Research source You can use chokos in a variety of recipes, including salads, stir fries, and chutneys."
    },
    {
      "title": "Cut back the vines and add a thick layer of mulch before winter.",
      "content": "Cut back the vines and add a thick layer of mulch before winter. In temperate climates, cut back the vines to three or four short shoots after the fruiting season. If you live in a frost-prone climate, cut the vines to just above ground level. Cover the planting site with 10 to 15 inches (25 to 38 centimeters) of mulch or pine straw to protect the roots during the winter. [16] X Research source Since it’s a perennial, choko will grow back from its roots in the spring."
    }
  ]
}