{
  "url": "https://www.wikihow.com/Get-a-Free-Uber-Ride",
  "title": "The Best Ways to Save Money on Your Uber Rides",
  "steps": [
    {
      "title": "No, Uber’s current promo system doesn’t offer any free ride promos.",
      "content": "No, Uber’s current promo system doesn’t offer any free ride promos. In the past, Uber offered free rides as a promotion for new customers and featured free rides as part of their referral programs. Unfortunately, Uber no longer offers free rides for new customers and has since updated their referral program to no longer offer free rides."
    },
    {
      "title": "Ask a friend or family member to gift you a free ride.",
      "content": "Ask a friend or family member to gift you a free ride. Uber offers an in-app gifting system that allows users to send gift cards for free Uber rides (or free Uber Eats). If you’re strapped for money at the moment, try cashing in a favor with someone and see if they’d be willing to gift you a free ride. To send a gift, go to the Account page on the app, followed by Send a gift . Then, follow the onscreen instructions."
    },
    {
      "title": "See if your community partakes in free Uber or Lyft ride programs.",
      "content": "See if your community partakes in free Uber or Lyft ride programs. Certain communities and neighborhoods (like college campuses) partner with Uber and Lyft to offer free rides for a certain period, usually at night. Check with your school (or local community) to see what programs are available. In 2018, for instance, Washington Township in New Jersey had a free Uber ride promo for patrons of specific bars within a certain geographical zone. [1] X Research source Several well-known universities (like the University of Texas) have partnered with Lyft to give students free rides in the evening. [2] X Research source"
    },
    {
      "title": "Get paid to take surveys and use your earnings for Uber rides.",
      "content": "Get paid to take surveys and use your earnings for Uber rides. Taking free surveys isn’t particularly lucrative, but with enough time and dedication, it can earn you enough pocket change for an Uber ride (depending on how far you’re hoping to go). Here are a few free survey apps to consider: Eureka Surveys Zap Surveys Swagbucks Qmee Survey Pop"
    },
    {
      "title": "Save 50% on 2 rides with Uber’s referral code system.",
      "content": "Save 50% on 2 rides with Uber’s referral code system. Navigate to the Account page of the Uber app, followed by the Refer friends to get deals . Then, tap Invite friends and choose your preferred way to send out the invite code (e.g., over text, social media, etc.). Once your friend uses the referral code, both they and you will get up to a 50% discount on your next 2 Uber rides. This benefit stacks for every friend you successfully refer to Uber. So, if you referred 2 friends, you’d get a discount on your next 4 rides."
    },
    {
      "title": "Keep an eye out for new promo codes.",
      "content": "Keep an eye out for new promo codes. Promo codes are always changing, so there’s no telling what sort of savings could be just around the corner! While Uber doesn’t have a page dedicated to coupons on their website, it’s easy to shop for the best deals online. Check out popular coupon websites for the latest and greatest deals: Coupons.com Groupon WorthePenny"
    },
    {
      "title": "Opt for the Uber Share option.",
      "content": "Opt for the Uber Share option. For some routes, you might see a Share option pop up in your available rides. The Share option is essentially carpooling, but it gives you a discount on your final ride price (in exchange for riding with strangers). [3] X Research source"
    },
    {
      "title": "Check out Lyft rates before buying an Uber ride.",
      "content": "Check out Lyft rates before buying an Uber ride. While Uber and Lyft are similar in a lot of ways, their rates often differ slightly. Before settling on an Uber fare, pull up the same route in Lyft and see if it’s a little cheaper."
    },
    {
      "title": "Reserve Uber rides long before you have to travel.",
      "content": "Reserve Uber rides long before you have to travel. Uber lets you schedule Uber rides long before you actually set foot in the car, which can help you save money from potentially higher rates. Tap the Reserve and relax option on the main page of the Uber app to start reserving your ride."
    },
    {
      "title": "Sign up for Uber One if you use Uber a lot.",
      "content": "Sign up for Uber One if you use Uber a lot. Uber One offers benefits for both Uber and Uber Eats and can be worthwhile if you use both services frequently. Besides 6% Uber Cashback on your rides, Uber One can get you: [4] X Research source Free Uber Eats delivery Discounts on Uber Eats orders Special promo codes Cost: Currently, Uber One is $10 a month."
    }
  ]
}