{
  "url": "https://www.wikihow.com/Make-a-Guy-Stop-Bothering-You",
  "title": "How to Make a Guy Stop Bothering You",
  "steps": [
    {
      "title": "Be honest.",
      "content": "Be honest. Honesty is almost always the best policy. Be honest with a guy who likes you that’s bothering you. Don’t say, “I don’t know” if you know you don’t like him. Tactful honesty will help you say what you feel and not hide anything. [1] X Research source If a guy makes an effort to see you between classes or waits to catch up with you yet you don’t like this, let him know. He might feel hurt, but he would feel hurt at some point once he realizes you don’t like his presence."
    },
    {
      "title": "Keep it simple.",
      "content": "Keep it simple. If you’re telling the guy you don’t like him or you want to stop talking for the first time, keep it simple. Don’t focus on telling him why or making excuses. Simply tell him you’re not interested and don’t feel the need to apologize. For example, if a guy keeps calling or texting you, respond with, \"I'm really not interested in you. Please stop contacting me.\""
    },
    {
      "title": "Say clearly that you don’t want to be bothered.",
      "content": "Say clearly that you don’t want to be bothered. You have the right to feel respected. If you feel like someone is bothering you, you can tell them directly and not have to sugar-coat it. If you’ve tried being indirect by being nice or hinting yet it didn’t work, you might want to be more direct. It’ll be clear what you mean and will minimize misunderstanding. [2] X Research source For example, he might keep asking you to go on a date or go to an event together If you’ve already let him down but he hasn’t got the hint, say, “I don’t want to go with you” or, “I’m not interested in you that way.”"
    },
    {
      "title": "Stop giving him any attention.",
      "content": "Stop giving him any attention. If a guy likes you and you don’t like him back, be clear and don’t give him any mixed signals. If you’ve been clear that you don’t like him yet he still texts you, calls you, or wants to talk to you, stop responding to him. You might feel mean, but remember that he hasn’t gotten the hint. For example, stop responding to his texts and don’t pick up his phone calls. If he seems upset, tell him you don’t want to hear from him."
    },
    {
      "title": "Speak firmly if you want to say something.",
      "content": "Speak firmly if you want to say something. If you feel harassed, look the person in the eye and look disapproving. If you choose to say something, use a clear and firm voice. Don’t insult the guy or fire back an insult. Say what you need to say to feel empowered. [3] X Research source For example, if someone harasses you on the street, say, “Do not speak to me that way” or, “Stop bothering me, that’s harassment.”"
    },
    {
      "title": "Don’t engage if you want to avoid more harassment.",
      "content": "Don’t engage if you want to avoid more harassment. Sometimes, it’s best to keep walking or not say anything. This is especially true if someone is verbally harassing you. Keep your head up without acknowledging the person or the comment. While you may feel empowered in responding back, it can lead to further remarks, teasing, or other abusive behavior."
    },
    {
      "title": "Quickly walk away.",
      "content": "Quickly walk away. If you’re in public or you have an escape route and you’d rather not be bothered, get away from the person. [4] X Expert Source Collette Gee Relationship Coach & Certified Violence Prevention Specialist Expert Interview. 1 May 2020. Whether you respond back to their comments or you ignore them, walk away quickly. The harasser doesn’t deserve your time, attention, or company. Keep moving. If you’re worried about the guy following you, dart into a building with people in it nearby or go somewhere quickly where you feel safe. You can also grip your keys in your hand to use as a weapon if needed. If your car has an alarm, then you could also press the panic button on your keys to set off the alarm. Try to find a group of women to join if you're out in public, like at a bar. A guy might be less likely to follow and bother you if there are more women around who could call him out for it. [5] X Expert Source Collette Gee Relationship Coach & Certified Violence Prevention Specialist Expert Interview. 1 May 2020."
    },
    {
      "title": "Remove their hands if they are inappropriately touching you.",
      "content": "Remove their hands if they are inappropriately touching you. If you feel physically or sexually violated, move away from the guy or take his hands off of your body. [6] X Expert Source Collette Gee Relationship Coach & Certified Violence Prevention Specialist Expert Interview. 1 May 2020. You do not deserve to have your personal space invaded. Do what you can to reclaim your space and ensure your safety. For example, if a co-worker touches you in a way that feels inappropriate to you, move away and show your disgust. Keep in mind that this could put you into an unsafe situation if you are alone. Take note of your surroundings and who is around. Try to stay close to a friend or someone else you trust. If you are alone, then you might also call a friend and put them on speaker phone as an additional measure for safety."
    },
    {
      "title": "Get help.",
      "content": "Get help. If you feel threatened, get help. Go to a crowded place and find someone to help you or call emergency services for you. You can also find a security officer if you’re in a public place. If you’re too shaken up, ask someone to help you or contact security or the police. Go to one person and ask, “Will you help me? There’s someone following me and I feel unsafe.” If you're at a bar or club, go up to one of the bartenders and let them know that a guy is bothering you. [7] X Expert Source Collette Gee Relationship Coach & Certified Violence Prevention Specialist Expert Interview. 1 May 2020. Consider whether you have a routine route that you frequently take home or that you use to get to and from other places. If you do, then change it up. Changing the route you take will confuse someone who is stalking you and knows your route. This will make it more difficult for him to follow you. If the situation is severe, then place a restraining order on the person as soon as possible. Make sure to call the police immediately if there is any violation of the restraining order."
    },
    {
      "title": "Make a scene.",
      "content": "Make a scene. If you feel threatened or scared by the guy, bring attention to yourself. Yell, scream, or make some noise. When you speak out, other people may be alerted and come to see what’s happening. They will either intervene or report him. If they report him, then they might even restrain him before they do this. You can say what’s going on. For example, “Get away from me, you perv! Stop touching me!”"
    }
  ]
}