{
  "url": "https://www.wikihow.com/How-Long-to-Get-over-a-Breakup",
  "title": "How Long Does It Take to Get Over a Breakup?",
  "steps": [
    {
      "title": "It usually takes about 6 months to get over a breakup.",
      "content": "It usually takes about 6 months to get over a breakup. Conventional wisdom says it can take half a year or longer to move on from an ex-partner and relationship. Relationship coach Amy Chan agrees, saying it takes most people about 6 months to 2 years. And the data agrees, too: a national survey of 2,000 people found that, on average, respondents felt like their old selves 6 months after the end of a serious relationship. Another study of college students who’d gone through a breakup in the past 11 weeks (3.5 months) indicated that the students had begun to feel more positive emotions by the time of the study. [1] X Research source"
    },
    {
      "title": "Experts say the post-breakup timeline varies by situation.",
      "content": "Experts say the post-breakup timeline varies by situation. Of course, it’s not going to take everyone exactly 6 months to get over their ex , so don’t sweat it if it takes you longer—or shorter. Nothing’s wrong with you! [2] X Research source The truth is that there are a number of factors that affect the breakup timeline, and how long someone grieves for can vary quite a bit depending on the length of the relationship, its quality, their own personality, and other factors. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Length of the relationship",
      "content": "Length of the relationship The longer your relationship lasted, the more attached you became to your partner, and so the harder it may be to move on. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source A relationship that lasted several years will probably end in more heartbreak than one that lasted only a few weeks. Plus, longer relationships lead to routines, and it can be hard to strike up a new routine when the old, comfortable one ends, contributing to hard feelings. Also, one study suggests that women tend to be more hurt by breakups, but recover more fully, while men tend to feel less hurt immediately, but may have lingering feelings even long after the breakup. [5] X Research source"
    },
    {
      "title": "Quality of the relationship",
      "content": "Quality of the relationship Your relationship’s quality can affect your breakup, similar to your relationship’s length. If, before the breakup, your relationship was harmonious and easy, then the aftermath may be harder to cope with than if the relationship was difficult, like if you and your partner often fought. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You’ll likely miss “the good old days” of the relationship and want them back, which can impede your own ability to move one. For example, research suggests that it may take 1-2 years or more to recover from a divorce, given that marriage often implies a greater commitment than other relationships. [7] X Research source"
    },
    {
      "title": "How things ended",
      "content": "How things ended If you were on the receiving end of a breakup, you’ll likely feel more emotions like confusion or betrayal, which can add some time to your post-breakup grieving period. [8] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source On the other hand, if you initiated the breakup, you might feel emotions more akin to relief, especially if you felt like it was a long-time coming, and so moving on may be easier. That said, initiating the breakup can also hurt, leading to feelings like guilt or regret. Remember, all your post-breakup feelings are totally normal! Infidelity can also be a factor, since it tends to damage your trust and self-esteem, which may take more time to rebuild ."
    },
    {
      "title": "Your own mental health",
      "content": "Your own mental health A bad breakup can contribute to poor mental health, especially if you were already struggling beforehand. You might slip into a depression, or feel your insecurities a little more prominently. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Sometimes, though, you might find that the relationship itself contributed to your poor mental health, and starting fresh can be the restart you needed."
    },
    {
      "title": "Having a support system",
      "content": "Having a support system A supportive team of friends and family can be the difference between a breezy breakup and a prolonged one. If you have people to talk to, and who can offer sympathy and advice, it’s much easier to pick yourself up from the loss of just 1 person. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source But if you feel alone, you’re shouldering that burden by yourself, and it’s harder to see that there are other people rooting for you. Even if you don’t think you have a support system, remind yourself that there are always people wishing you the best, be they coworkers, acquaintances, or even strangers on the bus."
    },
    {
      "title": "Feel your feelings, and avoid setting a timeline for your grief.",
      "content": "Feel your feelings, and avoid setting a timeline for your grief. Chan recommends taking a few days totally to yourself after a breakup, to let yourself get it all out and survive those first few days . “It’s normal to take time to grieve, process and get back to an equilibrium,” she says. Let your emotions flow freely, and try not to question or invalidate them: however you feel is your reality, and deserves care and attention. Keep in mind that suppressing emotions just means you’ll have to deal with them later, when they become too strong to ignore. Also, avoid thinking that your grief needs a deadline. If you’re constantly worried about getting over it in a “normal” amount of time, you’ll be too worried to actually work through it."
    },
    {
      "title": "Detach yourself from your ex, online and in-person.",
      "content": "Detach yourself from your ex, online and in-person. Chan suggests unfollowing and even blocking your ex online, deleting or archiving old photos of them, and wiping their contact, so that it’s easier to forget about them . And definitely don’t entertain the idea of post-breakup sex, which is the oldest trap in the book and lands you right back where you started—unhappy with someone who hurt you. If you can, also avoid your ex in person, and try to hang with separate friend groups, at least until your heartache subsides. You might also throw away (or put in storage) physical reminders of your ex, like their leftover belongings or gifts, so that they aren’t constantly reminding you of your pain."
    },
    {
      "title": "Take comfort in friends and family.",
      "content": "Take comfort in friends and family. Ask yourself: Who loves and values me right now? Then, make an effort to spend time and speak with them, and speak with them about your breakup, if you can. You don’t have to do this alone, and a supportive ally who can listen to your perspective and offer advice, or even just sympathy, can help take some weight off your shoulders. [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Or, put your energy into finding new friends and loved ones. Meeting new people to cherish is a great way to remind yourself that there’s always people entering your life, even if some end up leaving. If you find that the pain is too much to handle, consider seeing a therapist , who can coach you through your breakup and come up with personalized strategies for moving on."
    },
    {
      "title": "Find purpose in your hobbies and personal life.",
      "content": "Find purpose in your hobbies and personal life. Chan says that now is the time to “use the pain as fuel to your fire to create the life and love you desire.” This is your chance to become a new and better you, all on your own. Dive into your hobbies, sign up for a class, set a fitness goal. Whatever you do, make a new purpose for yourself outside of your relationship, and it’ll be that much easier to wake up and start moving toward that purpose each day."
    },
    {
      "title": "Remind yourself why you broke up.",
      "content": "Remind yourself why you broke up. Sometimes, it can help to examine your relationship and remind yourself of the reasons why it wasn’t meant to be, so that you don’t end up romanticizing it. Ask yourself: Why did you break up? Were there things your partner did that hurt you? Were you truly compatible? Often, the evidence is clear and hard to argue with, and knowing that it wasn’t ever going to work can offer some solace. [12] X Research source Even if the breakup came out of the blue, the breakup itself is evidence that your ex wasn’t ready to commit, and wasn’t mature enough to reveal their own feelings beforehand."
    },
    {
      "title": "Keep up with your physical health, and treat yourself.",
      "content": "Keep up with your physical health, and treat yourself. Your physical health is closely tied to your mental health. The better your body feels, the better your mind will feel. Try to get 30 minutes of moderate exercise, even if that’s just a walk outside, and eat 3 square meals a day. But also, go the extra mile! Take a hot bath, listen to good music, throw on that nice cologne or perfume. You, your body, and your mind, all deserve it. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Also aim for 8 solid hours of sleep each night. A well-rested mind is a healthy mind."
    },
    {
      "title": "You don’t feel bitter about your ex.",
      "content": "You don’t feel bitter about your ex. It’s totally natural to feel some negative feelings about your relationship or your ex for quite a while. But, according to Chan, you’ve officially moved on when you no longer feel “charged” toward them. Thinking about them doesn’t spike your heart rate, make you see red, or go on bitter mental journeys. When you can think about the relationship with a level head, you’ve made it."
    },
    {
      "title": "You’re living in the present moment.",
      "content": "You’re living in the present moment. There will always be things that remind you of people you’ve lost, but Chan tells us there’s a difference between wallowing in the past and processing it. If you’re constantly being transported back to the days of your relationship and dwelling on it, you’ve probably got more work to do. But if you wake up each morning focused on the day ahead, rather than the good old days behind you, you’re on the right track."
    },
    {
      "title": "You feel ready for the future.",
      "content": "You feel ready for the future. Relationships can be hard to let go, since they’re also a way of life. After a breakup, it can feel like your life just got pulled out from under you, and you can’t seem to find a way forward. With a little time and healing, though, you come to understand that you can still build the life you want, even without your ex, and you become excited all over again for that future and what it holds for you. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Initial grief",
      "content": "Initial grief This stage happens in the moments and days immediately after a breakup, when it might feel like all you can do is cry and eat through your feelings. It’s the toughest stage of a breakup , but also the shortest, and tends to give way to more productive feelings. The messy feelings just have to work their way through you, first. [15] X Research source"
    },
    {
      "title": "Reminiscing and denial",
      "content": "Reminiscing and denial After you’ve cried your heart, the more abstract emotions usually begin. You’ll likely start remembering all the good times you had with your ex, and won’t quite believe they’re over. As a result, you might start to bargain or feel tempted to try and get them back, even if you know deep down it’s not a great idea. [16] X Research source"
    },
    {
      "title": "Anger",
      "content": "Anger Once you come to terms with the fact that things are, indeed, over, you may start to get a little bitter. You might resent your ex for wasting your time, or come to realize all the ways they’ve hurt you. You could be tempted to lash out or get back at them. Mostly, though, and perhaps most important, you'll realize that you deserve so much more. [17] X Research source This stage often occurs within a few days after the breakup, and may last for weeks."
    },
    {
      "title": "Acceptance",
      "content": "Acceptance Once all the ugly emotions have subsided, you’re usually able to view the relationship with a clear head. Things that once hurt you to think about gradually become trivial or even funny, and you'll likely realize that the relationship was just one phase of your life, and was even a growing opportunity that taught you more about yourself. [18] X Research source This stage comes after some weeks of processing and thinking through your emotions, and only after you’ve readjusted to life without your ex."
    }
  ]
}