{
  "url": "https://www.wikihow.com/Get-a-Calendar-on-Your-Desktop",
  "title": "The Easiest Ways to Add a Calendar to Your Computer's Desktop",
  "steps": [
    {
      "title": "Open the Microsoft Store.",
      "content": "Open the Microsoft Store. You can do this by clicking the Win key and then clicking the shopping bag icon in the Start menu. Unfortunately, none of the calendar widgets for Windows 10 or 11 have the ability to add events or sync with your Windows calendar or other calendars. However, you can quickly access the built-in Windows calendar by clicking the date and time in the taskbar. Click the plus (+) to add a new event or sync another calendar service with your Windows calendar."
    },
    {
      "title": "Type Widget Launcher in the search bar and press ↵ Enter.",
      "content": "Type Widget Launcher in the search bar and press ↵ Enter . You'll see all the apps that match your search."
    },
    {
      "title": "Hover your mouse over the app and click Get.",
      "content": "Hover your mouse over the app and click Get . At first, the app says \"Free\" next to it, but when you hover over it, the tile will enlarge. \"Free\" changes to \"Get.\""
    },
    {
      "title": "Open Widget Launcher.",
      "content": "Open Widget Launcher. After downloading, you can either click Open in the Microsoft Store or click the Widget Launcher icon in the Start menu. In the MS Store, if you are looking at tiles of search results, hover your mouse over the app to see \"Installed\" and change to \"Open.\" You will immediately see the \"Open\" option if you are looking at the Widget Launcher page."
    },
    {
      "title": "Click Calendar.",
      "content": "Click Calendar . This will add a widget with a calendar to your desktop, but you need to choose some options first. There are other widgets you can also add, like a CPU Meter. However, you can only add up to 2 objects."
    },
    {
      "title": "Customize your calendar and click Launch Widget.",
      "content": "Customize your calendar and click Launch Widget . You can pick the colors that appear, like the background, border, and so on, as well as the transparency. If you see an ad, wait for it to finish, then click Launch Widget again."
    },
    {
      "title": "Click and drag the calendar widget.",
      "content": "Click and drag the calendar widget. You can place the Calendar widget anywhere you want on your desktop by clicking and dragging it. To change the size of the calendar, click and drag the dots next to the lower right corner."
    },
    {
      "title": "Click the \"x\" and Yes to close the calendar.",
      "content": "Click the \"x\" and Yes to close the calendar. The small x appears when you hover your mouse over the calendar and will open a window centered on your screen. Click Yes to continue to close the calendar widget."
    },
    {
      "title": "There's no built-in calendar widget on Windows 11.",
      "content": "There's no built-in calendar widget on Windows 11. Even though the Windows 10 calendar widget isn't available in Windows 11, you can install an alternative called Calendar Flyout to bring the old Windows 10 calendar back to your taskbar. Calendar Flyout syncs with your Microsoft and Google accounts, so you can easily keep an eye on your agenda from your desktop. To check it out, open the Widgets panel by pressing ⊞ Win + W . Click the gear at the top-right, then click + Discover New Widgets to add more widgets. From there, you can search calendar flyout and click its price ($3.99) to install it, or just search for calendar to explore alternatives to having a calendar on your desktop."
    },
    {
      "title": "Open the Calendar app in Outlook.",
      "content": "Open the Calendar app in Outlook. Even though your calendar will open in Outlook, this is a free alternative to installing additional software. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source To open the calendar, click the calendar icon on the left side of the screen. You can also use the Outlook app on either a Mac or a PC to view a calendar."
    },
    {
      "title": "Click .",
      "content": "Click . This gear icon is near the top right corner of the app window."
    },
    {
      "title": "Click Add Account.",
      "content": "Click Add Account . You'll see this in the Accounts tab."
    },
    {
      "title": "Enter your account and press ↵ Enter.",
      "content": "Enter your account and press ↵ Enter . Once you enter the account that you want to add, click Continue and sign into that account in your web browser when prompted. Click Continue again, then select all or just Calendar to add that account to your Outlook. After you've signed in, return to the Calendar view."
    },
    {
      "title": "Make your added calendar appear.",
      "content": "Make your added calendar appear. In the panel on the left, you'll see the name of the account you just added. Click it to expand it, then click \"Calendar\" to select the circle next to it. You'll see events from that calendar appear in your main calendar. You can change how your calendar events appear between accounts by clicking the ••• next to the calendar's name on the left. Leave the app open to quickly refer to your calendar whenever you need to!"
    },
    {
      "title": "Go to your Google Calendar in Chrome.",
      "content": "Go to your Google Calendar in Chrome. Use this method on a Mac or PC desktop or mobile laptop if you don't want to open Outlook or a third-party app. Go to https://calendar.google.com/calendar/u/0/r to find your Google Calendar. Sign in if prompted. You can make desktop shortcuts using any web browser, but using Google Chrome is the easiest."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . This three-dot menu icon is in the top right corner of your browser window."
    },
    {
      "title": "Hover your mouse over Cast, save, and share and click Create shortcut.",
      "content": "Hover your mouse over Cast, save, and share and click Create shortcut . You can rename the shortcut to anything you will recognize, then click Create . Look at your Desktop, and the shortcut will be there. Double-click it to open your Google Calendar in a Chrome page. [2] X Research source Alternatively, highlight the URL while you're looking at your Google Calendar, then drag it to your Desktop. You can also use this technique to create shortcuts in other browsers like Safari."
    },
    {
      "title": "Click the time and date in the menu bar on your Mac.",
      "content": "Click the time and date in the menu bar on your Mac. Doing this will open the Notification Center. You can use this method to get a calendar on your Mac desktop computer or MacBook."
    },
    {
      "title": "Click Edit Widgets.",
      "content": "Click Edit Widgets . You'll see this at the bottom of Notification Center."
    },
    {
      "title": "Search for a calendar widget or browse categories.",
      "content": "Search for a calendar widget or browse categories. Once you find the calendar widget, continue to the next step."
    },
    {
      "title": "Add the widget to the Notification Center.",
      "content": "Add the widget to the Notification Center. You can do either of these: Drag the widget to the upper-right corner of your Desktop Click the widget and the Add button + icon. [3] X Research source"
    },
    {
      "title": "View your calendar by clicking the time and date in the menu bar.",
      "content": "View your calendar by clicking the time and date in the menu bar. You'll see a quick calendar, but if you need more details about an event, click on it. [4] X Research source"
    },
    {
      "title": "Open the Calendar app.",
      "content": "Open the Calendar app. You'll find it in your Dock. This opens the Apple Calendar app. [5] X Research source"
    },
    {
      "title": "Click the Calendar menu and select Add Account.",
      "content": "Click the Calendar menu and select Add Account . You'll see the Calendar option on the menu bar, and Add Account will appear in the drop-down menu. This displays a window with a list of services you can add. [6] X Research source"
    },
    {
      "title": "Select a service and click Continue.",
      "content": "Select a service and click Continue . There are several calendar services you can add to Apple Calendar. You can add an iCloud account, Exchange, Google, Facebook, Yahoo, AOL, or Other CalDAV account. Click Continue in the lower-right corner of the window when you are ready."
    },
    {
      "title": "Sign in to your account.",
      "content": "Sign in to your account. The sign-in screen is going to be a little different depending on which service you want to add. You will most likely need to enter the email address and password associated with the account you want to sign in to. For example, if you want to add a calendar associated with your Google account, you would sign in with the email address and password associated with your Google account."
    },
    {
      "title": "Click the checkbox next to \"Calendar\" and click Done.",
      "content": "Click the checkbox next to \"Calendar\" and click Done . You can also add email, contacts, and notes to your Apple services. Check Calendar to add your calendar and click Done in the lower-right corner. This adds the calendar to your Apple Calendar app. You can click the different calendars you have added in the sidebar to the left. To add an event to the Apple Calendar, click a time slot below a date and fill out the form in the pop-out window."
    }
  ]
}