{
  "url": "https://www.wikihow.com/Make-Oat-Flour",
  "title": "How to Make Oat Flour",
  "steps": [
    {
      "title": "Measure out a portion of oats.",
      "content": "Measure out a portion of oats. The type of oats traditionally used for oat flour are called \"rolled oats.\" These can be bought for cheap at many grocery stores, but are not always available. Luckily, you can use instant, quick-cook, or steel cut as well -- the only difference is grain size, and you're grinding them all up anyway.. Don't use oats that have been flavored in any way, as this flavor will work into your final dish. Plain oats are best. If you're going to be using your oat flour in a recipe immediately, measure out more oats than the recipe calls for. Once you turn them into flour, they'll settle and take up a smaller volume. You'll generally end up with about 3/4 of the volume of oats you started with."
    },
    {
      "title": "Pulse the oats in a food processor.",
      "content": "Pulse the oats in a food processor. Any standard blender or \"Magic Bullet\"-type device will also work well.In a pinch, you could use a coffee grinder. Be sure to clean it out first unless you want coffee-flavored flour. [1] X Research source Pulse for 30 seconds or until the oats reach a fine, powdery consistency. [2] X Research source They should look a lot like traditional plain, all-purpose wheat flour. No blender? There are a variety of ways to make manual flour, but you need to know they will take a while. You could try: Mincing: Using your sharpest knife, rock it back and forth over a small pile of oats to quickly chop them up. They will be a little bigger than a real flour, but will still work. Grinding: Using a mortar and pestle, grind the oats into a powder. Mashing: A last-ditch effort, put the oats in a resealable plastic bag, squeeze the air out, and start crushing as if washing clothing by hand. Note that this will likely take a long time."
    },
    {
      "title": "Stir to mix in any stray oats, then pulse again.",
      "content": "Stir to mix in any stray oats, then pulse again. It can be hard to tell whether any extra oats remain in your flour, so open the food processor or blender and stir the powder a few times to be safe. Pulse again for 10 seconds or so."
    },
    {
      "title": "Use or store your oat flour at once.",
      "content": "Use or store your oat flour at once. Your oat flour is ready to use right away. You can use it roughly how you would use plain flour ordinarily, substituting it into recipes. If you need to save some, use the same rules you would use for ordinary flour. Keep it in a cool, dry place in an airtight container. Oat flour lasts for about 3 months in the cabinet and 6 months in the freezer. [3] X Research source These are only estimates, and oat flour will never keep as long as whole oats. Only make as much as you can use in the next few weeks. Hot and humid environments will lower the shelf life of your flour. Cold and dry areas may be able to store their oat flour a little longer without problems. [4] X Research source"
    },
    {
      "title": "Use for its subtle oat flavor.",
      "content": "Use for its subtle oat flavor. The taste difference between plain flour and oat flour won't immediately jump out at you, but it's somewhat noticeable. Oat flour gives the baked goods a nutty flavor and a chewy texture, different from plain flour but not overwhelmingly so. This is perfect for certain dishes — specifically, savory-sweet baked goods tend to benefit from this taste profile. The classic example, Oatmeal Raisin Cookies, are taken to the next level with oat flour. In most recipes, you only need 3/4 cup flour for every 1 cup of plain flour. If a cookie recipe calls for 2 cups normal flour, you should use 1 1/2 cup oat flour. [5] X Research source except in raised yeast breads that need gluten to give them structure. If you're unsure how a baked good will respond, mix and match the flours. Instead of 1 cup of plain flour, try 3/4 oats and 1/4 wheat to get the textural benefits of gluten (it gives loaves of bread shape) without eating too much of it."
    },
    {
      "title": "Use to reduce the gluten in recipes.",
      "content": "Use to reduce the gluten in recipes. One of the most popular ways oat flour is used today is as a gluten-free alternative to plain flour. Because gluten is a protein that naturally comes from wheat, using oat flour instead of all-purpose flour will usually remove the gluten from baked goods. Note: The rolled oats you can buy at the store aren't always 100% gluten free. Small amounts of wheat can get mixed into the oats (usually, because the equipment used to process them is also used to process wheat). This can make a difference for people with Celiac disease or gluten intolerance, so be sure to use oats that are advertised as gluten-free to fully protect friends with Celiac disease."
    },
    {
      "title": "Use oat flour to give baked goods a lighter texture.",
      "content": "Use oat flour to give baked goods a lighter texture. Compared to plain flour, oat flour is slightly less dense, which makes foods baked from it a little fluffier than they normally would be. This can be used to make wonderfully light muffins and biscuits, though it's also great for giving a unique texture to thicker pastries like scones and soda bread. You don't need to substitute all of the flour to get this effect. To add lightness without losing the taste or consistency of plain flour, use a half-and-half mixture. Try using oat flour in our scone recipe for a lighter version of this delicious breakfast treat."
    },
    {
      "title": "Use to coat or dredge foods.",
      "content": "Use to coat or dredge foods. Just like ordinary flour, oat flour can be used as a coating for a wide variety of foods. For instance, if you're frying breaded cuts of meat, you can coat them with oat flour (instead of plain flour) before dipping in an egg wash and tossing with the breading. Oat flour can also be dusted on proved loaves (loaves that have finished rising, but aren't cooked yet) to create an attractive, crunchy crust. Another excellent idea is to use oat flour when kneading bread dough to keep it from sticking to your work surface. Because of its lighter texture, it won't make the dough stiff if you incorporate too much."
    },
    {
      "title": "Use oat flour for its nutritional benefits.",
      "content": "Use oat flour for its nutritional benefits. Oat flour is great for your body even if you don't have gluten intolerance. Oats are naturally rich in protein, fiber, and help your body burn fats. They are lower in carbohydrates than most grains and are known to have minor cholesterol-reducing properties. [6] X Research source This makes oat flour an excellent choice for your recipes — even if there isn't a special reason to use it. Oat flour has high levels of magnesium, making it very helpful for women going through menopause or menstruation. Magnesium deficiencies are a common cause of profuse menstrual bleeding."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}