{
  "url": "https://www.wikihow.com/Inspect-a-Newly-Purchased-Vehicle-Before-Delivery",
  "title": "How to Inspect a Newly Purchased Vehicle Before Delivery",
  "steps": [
    {
      "title": "Make sure the seller provides Insurance and Vehicle registration.",
      "content": "Make sure the seller provides Insurance and Vehicle registration. Never finalize the sale without receiving this documentation."
    },
    {
      "title": "Be cheerful and act cordially with staff.",
      "content": "Be cheerful and act cordially with staff. Be Patient. Minor delays are sometimes unavoidable. If you find anything not up to your mark during inspection, simply note it down on a piece of paper and bring it to the notice of staff. Your aim should be to rectify any faults and not to create any unpleasant scene during what should essentially be a joyous occasion for you. Exchange business cards with salesperson, and service personnel."
    },
    {
      "title": "Buying a car is an investment and giving it due time is expected.",
      "content": "Buying a car is an investment and giving it due time is expected."
    },
    {
      "title": "You should be aware of all functions before you take it to your inspection.",
      "content": "You should be aware of all functions before you take it to your inspection."
    },
    {
      "title": "Usually, anything below 40 km (25 miles) is acceptable.",
      "content": "Usually, anything below 40 km (25 miles) is acceptable. Though, this would vary depending on how your vehicle is delivered to the dealer from manufacturer's yard. [1] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Ensure you do it in daylight and in open space.",
      "content": "Ensure you do it in daylight and in open space. Take your time and note down the smallest of imperfections. It is very difficult to justify scratches and minor dents to staff at later stage."
    },
    {
      "title": "Check all seams, panel gap consistencies, and door line.",
      "content": "Check all seams, panel gap consistencies, and door line. Be sure that they are aligned and match acceptable standards."
    },
    {
      "title": "They should open and shut properly.",
      "content": "They should open and shut properly. In addition, all rubber linings should be soft (not cracked or brittle)."
    },
    {
      "title": "Check fluid levels and engine compartment cleanliness.",
      "content": "Check fluid levels and engine compartment cleanliness. Also look for any cuts or splits in electrical wiring and connections. Also, check that the ECU of car is properly shielded."
    },
    {
      "title": "Usually, most trusted brands of batteries have indicators showing the health of the battery.",
      "content": "Usually, most trusted brands of batteries have indicators showing the health of the battery. If not, ask service staff to confirm the health of battery and perform a battery test. [2] X Research source"
    },
    {
      "title": "Usually a new tire will have coloured stripes in centre.",
      "content": "Usually a new tire will have coloured stripes in centre. These wear off once the tire is used for some time."
    },
    {
      "title": "Check the windshields for any cracks, scratches or spots that may be difficult to remove later.",
      "content": "Check the windshields for any cracks, scratches or spots that may be difficult to remove later. Check wiper operations. Check and operate all windows. Ensure Power windows (if applicable) work properly."
    },
    {
      "title": "Especially look out for any kind of soiling on the seats, upholstery and carpets.",
      "content": "Especially look out for any kind of soiling on the seats, upholstery and carpets. Make sure the cloth or leather of the interior is intact. [3] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "The car should start smoothly.",
      "content": "The car should start smoothly. Ensure that no warning lights are flashing on the instrument cluster. Ensure that fuel level is adequate and engine temperature is within acceptable range."
    },
    {
      "title": "Lookout for any weird sound from engine compartment.",
      "content": "Lookout for any weird sound from engine compartment. It is advisable to crank the engine and then step out of the vehicle to inspect the sound of the vehicle. While you are at it, also check the emission levels from exhaust."
    },
    {
      "title": "Let it run for a moment.",
      "content": "Let it run for a moment. Ensure it provides you with sufficient cooling / heating."
    },
    {
      "title": "Try to operate and test all of them to ensure they work.",
      "content": "Try to operate and test all of them to ensure they work."
    },
    {
      "title": "Confirm that they operate properly.",
      "content": "Confirm that they operate properly. Ensure that headlights focus properly. [4] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "If the car is old, use your favourite CD or tape to test the sound system.",
      "content": "If the car is old, use your favourite CD or tape to test the sound system. Otherwise, be sure that the bluetooth or other sound connection features work."
    },
    {
      "title": "Buckle Up and ensure the seatbelts work.",
      "content": "Buckle Up and ensure the seatbelts work. At this point, switch off the music system and put the air-conditioning on low speed so that you can listen to any abnormality."
    },
    {
      "title": "Ensure that they slot properly.",
      "content": "Ensure that they slot properly. Also check if the vehicle has decent acceleration."
    },
    {
      "title": "On your test drive, ensure that there are no rattles and NVH (Noise, Vibration and Harshness) levels are acceptable.",
      "content": "On your test drive, ensure that there are no rattles and NVH (Noise, Vibration and Harshness) levels are acceptable. [5] X Research source"
    },
    {
      "title": "On a straight stretch, drive at a speed of 60 km/h and check that vehicle is properly aligned to road and there is no unusual vibration.",
      "content": "On a straight stretch, drive at a speed of 60 km/h and check that vehicle is properly aligned to road and there is no unusual vibration. [6] X Research source"
    },
    {
      "title": "Park the vehicle.",
      "content": "Park the vehicle. Step out and open the hood. Check for any fluid leaks that may have popped up during trial."
    },
    {
      "title": "Meet the service manager and get all possible information regarding service schedules.",
      "content": "Meet the service manager and get all possible information regarding service schedules. You can also ask about good driving etiquette for your car. [7] X Research source"
    },
    {
      "title": "Do this calmly and clearly.",
      "content": "Do this calmly and clearly. If you are not sure about something, mention it anyway."
    },
    {
      "title": "Note down the Chassis number and the Engine number of vehicle and confirm that it matches with the paperwork",
      "content": "Note down the Chassis number and the Engine number of vehicle and confirm that it matches with the paperwork"
    },
    {
      "title": "Before you drive away, make sure the tire pressure is at an appropriate level and consistent between all tires.",
      "content": "Before you drive away, make sure the tire pressure is at an appropriate level and consistent between all tires. [8] X Research source"
    },
    {
      "title": "This could include a spare tire, CD Changer, tool kits, chains, or warning triangles.",
      "content": "This could include a spare tire, CD Changer, tool kits, chains, or warning triangles."
    },
    {
      "title": "You are now ready to go!",
      "content": "You are now ready to go! But, before you leave, thank and take a picture with your purchase and all those people who made your dream car a reality."
    },
    {
      "title": "Don't be afraid to show off your new car!",
      "content": "Don't be afraid to show off your new car!"
    }
  ]
}