{
  "url": "https://www.wikihow.com/Hang-MDF-Board",
  "title": "How to Hang MDF Board",
  "steps": [
    {
      "title": "Get a set of wall brackets designed for MDF.",
      "content": "Get a set of wall brackets designed for MDF. Search online or at the hardware store for brackets strong enough to support MDF. There are some products designed to hold the extra weight of an MDF board. Since MDF is a popular medium for artists, arts and crafts stores may carry suitable brackets as well. [1] X Research source Some brackets might say if they're meant specifically for MDF, but it's more important to check that any brackets you use can support the weight of the board. MDF boards can be over 50 pounds (23 kg). Any product that can hold enough weight will work. Check the board's weight by weighing yourself, then weighing yourself again holding the board. Subtract the first number from the second number to get the board's weight. These sets should come with 2 brackets, 1 for the board and 1 for the wall, and any screws or other hardware you need. If they don't, use wood screws 1 ⁄ 2 in (1.3 cm) long."
    },
    {
      "title": "Find the center line on the back of the board.",
      "content": "Find the center line on the back of the board. Use a ruler or tape measure and measure the width of the board. Divide that measurement in half to get the center point. Put a mark at that point 1 inch (2.5 cm) from the top of the board. [2] X Research source If the board is 10 inches (25 cm) wide, 10 divided in half is 5. Put a mark at the 5 in (13 cm) point."
    },
    {
      "title": "Drill pilot holes into the center of the board 1 inch (2.5 cm) from the top.",
      "content": "Drill pilot holes into the center of the board 1 inch (2.5 cm) from the top. MDF can split if you drive screws into it directly. Start by using a sharp drill bit 85-90% as wide as the screw root diameter. Hold the screw up to the bit to confirm the sizing. Drill slowly until you’ve reached the distance that the screw will go. Make as many holes as you need to attach the bracket. [3] X Research source If you're using 1 ⁄ 2 in (1.3 cm) screws, then drill pilot holes that deep. Try holding the screw against the drill bit for a reference on how far you should drill. Don’t drill holes closer than 1 inch (2.5 cm) from the edge of the board. MDF edges are weak and the board could splinter or break under the weight. The board will be strong enough in any spots that are at least 1 inch (2.5 cm) from the edge. You should always pre-drill any kind of material before drilling it, whether it's MDF, wood, or plastic."
    },
    {
      "title": "Screw one bracket onto the back of the board.",
      "content": "Screw one bracket onto the back of the board. Hold the bracket against the board and line it up with the pilot holes. Insert a screw into each hole slowly. [4] X Research source"
    },
    {
      "title": "Find a stud",
      "content": "Find a stud where you want the top of the board to sit. Find the general area that you want the board to hang in. Use a stud finder to locate the nearest stud in the area. Then find the height along that stud where you want to place the bracket. Remember that wherever you place the bracket is where the top of the board will sit. [5] X Research source Don’t try to hang MDF without finding a stud. It’s too heavy for regular drywall to hold. [6] X Research source You can also find a stud by tapping on the wall. A hollow sound means that there is no stud in that spot, and a solid sound means you found one. If you're mounting the board on brick or concrete, don't worry about finding a stud. The masonry will support the board's weight."
    },
    {
      "title": "Screw the other bracket into the wall stud.",
      "content": "Screw the other bracket into the wall stud. Hold the bracket against the stud at the correct height. Make sure the bracket is straight. Then, drill screws through the support holes to attach the bracket to the wall. [7] X Research source If you're attaching the bracket to brick or concrete, use a masonry drill bit and screws so they don't break. Drill pilot holes first, then hold up the bracket and insert the screws. [8] X Research source"
    },
    {
      "title": "Check that the bracket is level.",
      "content": "Check that the bracket is level. Before mounting the MDF, hold a level up against the bracket. If the bracket is level, then go on hanging the board. If not, remove the screws and reattach the bracket so it’s level. [9] X Research source Removing screws is easy. Just run the drill in reverse. You can fill old drill holes with spackle and repaint them, or just let the board cover them."
    },
    {
      "title": "Connect the brackets to hang the board.",
      "content": "Connect the brackets to hang the board. Lift the MDF board and bring it up to the wall bracket. Slide the brackets together to mount the board onto the wall. [10] X Research source Since the MDF board is so heavy, you might need someone to help you lift it. Let go of the board slowly so you know that the bracket is supporting it."
    }
  ]
}