{
  "url": "https://www.wikihow.com/Get-to-Know-a-Girl",
  "title": "How to Get to Know a Girl",
  "steps": [
    {
      "title": "Have lots of short conversations first.",
      "content": "Have lots of short conversations first. Aim for many quick conversations instead of one long one, at first. If you want to be flirtatious and get a girl interested in getting to know you back, try to talk to her regularly. Talk in the hall during passing period at school. Exchange a few quick sentences, then say, \"Talk to you later.\" Always establish that you'll talk again soon. This will help to ensure that you're thinking about her, and you'll both be thinking about each other. Walk up to her and say, \"hey\". Hopefully, she responds and you can say one of these things listed or make something else up: \"What's your name?\" or \"How's your day so far?\""
    },
    {
      "title": "Listen when she speaks.",
      "content": "Listen when she speaks. One of the best ways to get a girl to open up more to you is to be a good listener. Focus on being a good listener. Show that you're interested in what she has to say. Don't dominate the conversation. Ask a question instead of launching into a story. Look at her while she talks and nod your head to show that you're paying attention. After she finishes, summarize what she said and use her name while you talk. This helps to show that you're giving her your personal attention. Reader Poll: We asked 138 wikiHow readers and 49% of them agreed that the best way to get to know a woman is to listen openly and patiently to her feelings and thoughts . [Take Poll]"
    },
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. Eye contact is very important in establishing a good conversation. If you want to get to know a girl better, practice making better eye contact while you're speaking and while she's speaking. If you struggle to keep eye contact, or it makes you feel awkward, then practice. When you watch TV, practice holding the gaze of the TV actors as long as possible, or practice picking a spot on the face near the eyes, like the nose, the eyebrow, or another spot to hold your gaze."
    },
    {
      "title": "Smile to put her at ease",
      "content": "Smile to put her at ease . If you want someone to open up to you, put them at ease by smiling. Even if you're feeling nervous, or feeling serious, or feeling the serious feelings about this girl, you need to relax yourself and relax her by flashing those pearly whites. Make your flirty talking face a smile. Even if you don't want to get to know this girl better romantically, it's still good to establish that you like talking to her and you enjoy her presence. A smile goes a long way in doing just that."
    },
    {
      "title": "Read her body language.",
      "content": "Read her body language. It's important to make sure you're not bugging someone by approaching them and asking questions. Make sure that your presence is ok by learning to read a girl's body language. If she's not into talking, she'll display some of the following body language, which means you should just end the conversation and leave her alone: Crossed arms Frowning Looking down and avoiding eye contact A furrowed brow or confused face Turning away from you Very brief answers to questions"
    },
    {
      "title": "Relax.",
      "content": "Relax. If you're nervous every time you strike up a conversation with a girl, learn to calm yourself down in the moment. Be as natural as possible. Keep it simple and straightforward by keeping the conversation short. Lots of times, you'll be nervous because you think you won't have anything to talk about, or you'll say something dumb. We'll cover that in the next section."
    },
    {
      "title": "Ask questions instead of talking about yourself.",
      "content": "Ask questions instead of talking about yourself. Lots of people, especially guys, talk too much about themselves in conversation. If you tend to do that when you're nervous, try to switch tactics. Instead, ask more questions and keep her talking about herself. This helps to take the pressure off of you and lets you learn a bit more about her. Make your questions complication and probing, but relatively light. It's always good to ask, \"What did you think of that test in chemistry? Did you feel good about it?\" Immediately asking a deep question about what she thinks of religion might be a little awkward. Use open-ended questions. If you ask, \"How are you today?\" it's easy to answer \"Fine,\" which doesn't give you much to work with. Ask a specific question that will take some time to answer: \"How's soccer going this year?\""
    },
    {
      "title": "Look for something you have in common.",
      "content": "Look for something you have in common. If you want to start a conversation and get to know a girl better, look for something that you share. This helps to build trust and companionship. If you can talk about something regularly, she'll know she can come to you about that subject. If you're in class together, you've always got that to talk about. Talk about how you're doing, how dull the teacher's lectures are, and other class-related topics. Try to study together. You at least know you probably live in the same town and can discuss things related to where you are. Talk about local things, hang-outs, and topics specific to where you live."
    },
    {
      "title": "Try to understand her sense of humor.",
      "content": "Try to understand her sense of humor. It's much easier to talk to someone when you know what makes them laugh. Is she sarcastic? Goofy? Does she appreciate a good random line? try to find out more about what she thinks is funny. Check out her Facebook page or other social media. What movies does she seem to like? What makes her write \"lol\"? Be careful. If you want to get to know a girl in a real way, complimenting her \"space pants\" or asking her if it hurt when she fell from Heaven usually isn't the way to go. Pick-up lines, while sometimes funny, are the most shallow way possible to start a conversation. Unless you want eye-rolls, avoid using with lines. [1] X Research source"
    },
    {
      "title": "Follow up on something she has already said.",
      "content": "Follow up on something she has already said. Sometimes, the second and third conversation can be a lot more difficult than the first. Once you've covered the basic topics, what do you talk about? Learning to follow up is an essential conversational skill. Ask about what she's been doing since you talked last. \"How did that test go?\" or \"How was your weekend?\" are good follow ups. Even just asking, \"Hey, it's been a while. What have you been up to since we talked?\" If you talk about a movie, band, or some other subject, do a little research and bring it back up. \"I listened to that band you mentioned. I really like their second record. What's your favorite?\""
    },
    {
      "title": "Don't argue, even to be funny.",
      "content": "Don't argue, even to be funny. Picking on a girl you like is what kids do in elementary school. It's not a good way to get to know someone on a more personal level. If you like someone and want to get to know them better, avoid controversial topics and avoid an argument. A common pick-up artist tactic is to try to \"subtly insult\" girls to make them more vulnerable. This isn't a good way to get to know someone. Eventually, you can and should disagree with people that you like. If you know her well, you don't have to always be agreeable. But at first, don't make a point of picking on someone, or they may get defensive or offended."
    },
    {
      "title": "Don't write a script.",
      "content": "Don't write a script. When you get nervous, sometimes it seems like having a script would be helpful. Most of the time, this will come across as more awkward and uncomfortable than talking more naturally. Even if you're not a great conversationalist, don't be a robot reading a script."
    },
    {
      "title": "Befriend her.",
      "content": "Befriend her. After you start talking to her, you should try to become her friend. Go to one of her friends and try to be friends with them first. It helps by letting the girl who you want to know that you can get along with her friends and make her trust you more. If she doesn't have any friends, then just focus on the girl. If you have classes with her, try to talk with her before the teacher starts teaching and when class ends. If you have to walk past her next class, then walk with her and talk."
    },
    {
      "title": "Tell her about yourself.",
      "content": "Tell her about yourself. Not giving her information about yourself will make you seem like a stalker or a creep. So if she asks a question, then give her the answer unless it's extremely personal. And you shouldn't ask personal questions either. Here's what not to ask or tell: Address Phone number Zip code How much money you/she have/has"
    },
    {
      "title": "Know what questions you are comfortable with answering.",
      "content": "Know what questions you are comfortable with answering. This should include your favorite color, sexuality, favorite food, best friend(s), favorite teacher, favorite book, and favorite movie."
    },
    {
      "title": "Be careful with some things you do.",
      "content": "Be careful with some things you do. These might ruin your chances. Never give gifts as a friend on any other day besides birthdays, vent without asking, ask to date a week after you meet, ask to go over your house after only a week, and hardcore flirt over pick-up lines."
    },
    {
      "title": "Spend some time together one-on-one.",
      "content": "Spend some time together one-on-one. It's hard to get to know someone well in a group. If you want to deepen your bond, spend time alone together. Go somewhere you can have a quiet talk, like a coffee shop or a restaurant in the middle of the day. If you go to school together, just finding a quiet place to sit, away from other students, can be a great way to have a private conversation. It doesn't have to be a \"date,\" and calling it one can put a lot more pressure on things. Just find an excuse to hang out together and talk."
    },
    {
      "title": "Ask more complicated questions.",
      "content": "Ask more complicated questions. Eventually, your conversation needs to deepen beyond talk of school and bands and movies, if you want to get to know someone better. Ask about her opinions on serious issues. Find about what she thinks about. Talk the real talk. Stay informed about world events and politics. Ask about her opinions regarding recent elections, or talking points. Find out what she cares about. Ask about her anxieties and fears. What kind of a person is she? What keeps her up at night?"
    },
    {
      "title": "Talk about the future.",
      "content": "Talk about the future. What does she want to do with her life? Where does she want to be in ten years? What makes her happy? These are important questions that will be good to talk about down the road, if you want to get to know someone. If you're in school together, talk about your future in school. Is she hoping to go to college? What will she study? What does she want to be beyond school? If you're beyond school, talk about where you'd like to progress in life? Where do you want to live? Are you satisfied in your job? Do you want a family? Kids?"
    },
    {
      "title": "Open yourself up, as well.",
      "content": "Open yourself up, as well. Your job isn't to impress a girl, or \"wow\" her with your accomplishments. [2] X Research source Your job is to be real if you want to get to know someone. Be yourself. Conversation is a give and take. Share deeper feelings and anxieties that you have, if you want to her learn about hers. Open up and put yourself out there. It's possible to go too far with all the questions and come off as kind of a creep. If you never bring anything to the table, but want to know whether or not she wants kids, it won't seem like a conversation. It'll seem like an interrogation. You've got to talk about things, too. Let her ask questions as well, but don't wait for her too. You should both be sharing about an equal amount. But if she wants to talk more, let her."
    },
    {
      "title": "Get to know her family.",
      "content": "Get to know her family. Seeing how someone interacts with their family can be a very telling experience. If you want to really see what someone is like, see how they interact with their parents. See how they treat their brothers and sisters. See how their family gets along. This might take a while, but if you've been hanging out with someone a lot, coming over for dinner, or a quick hang-out is pretty common. Let her ask you first, don't invite yourself over. Introduce yourself to her family, and see how they react to you as well. Learning about someone's parents can be just as revealing as learning about someone. Ask her a question. Most people can be very open to start getting to know somebody, Other's can be a little shy, But don't worry! Just take a deep breathe and try starting a conversation! Girls love it when you get into interesting topics!"
    }
  ]
}