{
  "url": "https://www.wikihow.com/Get-a-Plumbing-Apprenticeship",
  "title": "How to Get a Plumbing Apprenticeship",
  "steps": [
    {
      "title": "Consider your skills and talents to make sure you have the aptitude for a plumbing career.",
      "content": "Consider your skills and talents to make sure you have the aptitude for a plumbing career. Most licensed plumbers will look for an apprentice who is: good at math, able to move around on the ground with dexterity, mechanically inclined, and able to solve problems. Interpersonal skills are also desirable, as plumbers are constantly working with different types of people – clients, other tradespeople, suppliers, and so forth. An apprenticeship usually takes 4-5 years to complete, so make sure this career path is something you really want."
    },
    {
      "title": "Take math and science courses in middle school and especially in high school.",
      "content": "Take math and science courses in middle school and especially in high school. You don’t need to be a math or science genius to pursue a plumbing career, but you should try to establish a solid foundation in these subject areas. Algebra and geometry are particularly important in terms of mathematics, while physics is the most relevant type of science. [1] X Research source You would also benefit from courses in drafting and computers. If your high school does not offer drafting, consider taking a community level course in the subject, as this will enhance your desirability as a plumbing apprentice."
    },
    {
      "title": "Complete your high school education.",
      "content": "Complete your high school education. A high school diploma is a basic requirement to become a plumber’s apprentice. If you did not graduate, complete a General Educational Development (GED) test. While the GED is often an acceptable alternative, many employers prefer a high school diploma given the increasingly competitive nature of the field."
    },
    {
      "title": "Build an appropriate resume.",
      "content": "Build an appropriate resume. Your resume should include everything relevant to plumbing, including courses in math and science, knowledge of drafting and computers, and any work experience in construction, the trades, and/or customer service. Avoid making things up because your skills will eventually be tested as an apprentice. A plumbing company or union would rather work with an inexperienced apprentice than with an apprentice who lies and cuts corners."
    },
    {
      "title": "Obtain a driver’s license (if you don’t already have one).",
      "content": "Obtain a driver’s license (if you don’t already have one). You will need a valid driver's license for most apprenticeship programs, so maintain a good driving record. Also avoid encounters with the law and substance abuse. You may need to pass a drug test, as well as a criminal background check."
    },
    {
      "title": "Consider completing coursework in plumbing at a trade school or vocational college before applying for a plumbing apprenticeship.",
      "content": "Consider completing coursework in plumbing at a trade school or vocational college before applying for a plumbing apprenticeship. While such coursework is not required, it may give you an advantage over other applicants when applying for an apprenticeship. Bear in mind that all apprenticeships entail some amount of coursework. So by completing classes at a trade school or vocational college, you’ll cut down on the number of classroom hours required later on, and impress potential employers. [2] X Research source Another advantage is that many schools and colleges will help match you with a with a plumbing company, labor union, or master plumber offering apprenticeships. Make sure that the school you attend is accredited, and offers appropriate classes in drafting, math, plumbing codes, etc."
    },
    {
      "title": "Prepare for the aptitude test",
      "content": "Prepare for the aptitude test . Some plumbing apprentice programs require you to take and pass an aptitude test in order to be considered. Make sure that you study for this test before you take it. The test may include a few different sections, such as general plumbing knowledge, reading comprehension, and math. If possible try to obtain a practice test or a study guide for the aptitude test. Ask your instructor or the apprenticeship provider if one is available to use as a study aid."
    },
    {
      "title": "Apply for a plumber’s union apprenticeship.",
      "content": "Apply for a plumber’s union apprenticeship. This is the most common and potentially easiest method. Many unions provide all of the necessary training and coursework in-house, and they employ administrators who will pair you with a licensed journeyman or master plumber. This means you won’t have to search for an individual plumber willing to take you on as an apprentice. Another benefit of a union apprenticeship is that they offer greater benefits such as sick leave, medical insurance, disability insurance, etc."
    },
    {
      "title": "Apply to a private plumbing company that is willing to hire an apprentice.",
      "content": "Apply to a private plumbing company that is willing to hire an apprentice. This option may require more work. Indeed, while you only need to apply once to a union representing hundreds or thousands of plumbers, you may have to apply to many dozens of small plumbing companies before finding a match. Other drawbacks include the fact many private sector apprenticeships are: less structured and formalized unable to offer in-house training less interested in or capable of teaching new plumbers relatively low paying."
    },
    {
      "title": "Start preparing for your licensing exam right away.",
      "content": "Start preparing for your licensing exam right away. Depending on the rules in your state, you will need to work as an apprentice for two to five years before you are eligible to take the exam. [3] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source However, these exams are challenging and it is wise to start studying as soon as you start working as an apprentice. The written portion of the exam may include sections that test your knowledge of codes, technical procedures, and the plumbing trade in general. Some exams also have a practical section that requires you to perform some common plumbing tasks, such as cutting pipes or identifying installation problems with water heaters."
    },
    {
      "title": "Develop your customer service skills.",
      "content": "Develop your customer service skills. Plumbers deal with all sorts of different people, so having excellent customer service skills will make it easier to succeed at your job. [4] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source Focus on things like being punctual, being friendly, listening to your customers, asking questions to understand the problem better, and thanking them for their business."
    },
    {
      "title": "Learn more about business.",
      "content": "Learn more about business. Good business skills are also crucial to succeed in plumbing. [5] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source Consider taking a couple of business courses at your local community college to learn more about things like management styles, marketing, and bidding on jobs."
    },
    {
      "title": "Hone your mechanical skills.",
      "content": "Hone your mechanical skills. Use your time as an apprentice to perfect your mechanical skills. [6] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source Observe the master plumber that you are assisting, ask for feedback on your technique, and listen to advice about how to improve. Try to be patient with yourself as you learn. Some mechanical skills can be difficult to master and it may take a while before you are able to perform these skills with ease."
    },
    {
      "title": "Improve your physical strength.",
      "content": "Improve your physical strength. Being a plumber is physically demanding, so it is important to stay in good shape in order to perform your job. [7] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source If you don’t exercise, start a routine and try to incorporate a couple of strength training sessions every week."
    }
  ]
}