{
  "url": "https://www.wikihow.com/Get-a-Rusted-Trailer-Hitch-Ball-Off",
  "title": "How to Get a Rusted Trailer Hitch Ball Off",
  "steps": [
    {
      "title": "Spray the hitch receiver opening with penetrating fluid.",
      "content": "Spray the hitch receiver opening with penetrating fluid . Fit the straw of the penetrating fluid into one of the corners between the hitch and the receiver. Press the button on top of the can to spray the fluid so it can soak into the rust. Spray into each corner of the hitch receiver and let it soak in overnight. The fluid may lubricate the hitch enough so you can pull it out by hand the next day. [1] X Research source Penetrating fluid acts as a lubricant that works well for eating through rusted metal. Apply a little penetrating fluid every day if you aren’t able to pull your hitch out right away. That way, it will loosen up and be easier to remove with other methods too."
    },
    {
      "title": "Try tapping the hitch out with a rubber mallet or sledgehammer.",
      "content": "Try tapping the hitch out with a rubber mallet or sledgehammer . Start by hitting the back of the trailer hitch right behind where the ball is mounted to push it out of the receiver. If that doesn’t work, try hitting the sides of the receiver to help break the rusted metal apart and loosen the hitch. [2] X Research source Be careful on your backswing so you don’t accidentally hit or damage your vehicle. If you’re able to get underneath your vehicle, check if the back of the receiver is hollow. If it is, fit a pipe in the hole and tap it with your hammer to push the hitch out. You may need to remove the spare tire if it’s kept underneath your vehicle."
    },
    {
      "title": "Hit the sides of the receiver with an air hammer to break the rust.",
      "content": "Hit the sides of the receiver with an air hammer to break the rust. An air hammer uses compressed air to quickly move the hammer bit up and down. Attach the hammer to an air compressor and set the air pressure to 90 PSI so the tool works properly. [3] X Research source Hold the hammer bit against the side of the receiver and squeeze the trigger for about 15 seconds. Move the air hammer over the outside of the receiver so the rust breaks apart and makes your hitch looser. [4] X Research source You can also use a chisel-shaped bit on your air hammer. Put the edge of the chisel bit between the hitch and the receiver and turn it on to cut through the corroded metal."
    },
    {
      "title": "Cut out an extremely stuck hitch with a reciprocating saw and chisel.",
      "content": "Cut out an extremely stuck hitch with a reciprocating saw and chisel . If the hitch still won’t budge, then it may be easier just to cut it out. Use a reciprocating saw with a steel-cutting blade and hold it next to the edge of the receiver. Support the saw with both hands and slowly cut through the hitch, leaving the rusted-in portion inside the receiver. Then, you can use a chisel or an air hammer with a chisel bit to knock out the pieces of the hitch still inside. [5] X Research source Wear safety glasses and work gloves while you’re working to protect yourself from sharp metal shrapnel. Heat the rusted metal with a blow torch to make it easier to remove. Wear safety glasses and work gloves, and only point the flame at the hitch so you don’t damage any part of your vehicle. Pull the hot metal out with pliers or tap it out with a chisel."
    },
    {
      "title": "Spray penetrating fluid on the nut and threads on the trailer ball.",
      "content": "Spray penetrating fluid on the nut and threads on the trailer ball. Point the nozzle of the penetrating fluid where the ball connects to the hitch and on the mounting nut underneath. Press the button on the can and spray enough fluid onto the ball until it’s soaked. Let the penetrating fluid work into the rust and metal overnight so it lubricates the threads. [6] X Research source You could also try soaking the entire hitch in vinegar to eat away at the rust. [7] X Research source If the hitch is attached to your vehicle, fill a plastic bag with vinegar and tie it around the hitch ball."
    },
    {
      "title": "Try turning the mounting nut with a long-handled wrench.",
      "content": "Try turning the mounting nut with a long-handled wrench . Choose the wrench you own with the longest handle and secure it on the mounting nut on the bottom of the hitch ball. Hold onto the end of the handle and try turning the mounting nut counterclockwise to loosen it. With a longer handle, you might be able to get enough leverage to break through the rust and loosen the nut. [8] X Research source Try sliding a pipe over the handle of the wrench to add additional length so you can get even more leverage. If the trailer ball spins when you turn the wrench, grip it with a second wrench and turn it in the opposite direction."
    },
    {
      "title": "Use a blow torch to heat up the mounting nut that won’t budge.",
      "content": "Use a blow torch to heat up the mounting nut that won’t budge. Put on a welding mask and work gloves to protect yourself while you’re working. If you can, put the hitch in between the jaws of a vise . Turn the vise’s handle to tighten the jaws and hold the ball steady. Use your blow torch and point the flame at the nut until it starts to turn red. When it’s lightly glowing, turn off your torch and immediately try turning the nut with a wrench. [9] X Research source Since heat makes metal expand, the blow torch helps loosen the nut from the threading on the ball."
    },
    {
      "title": "Cut through the nut of a stubborn trailer ball with an angle grinder.",
      "content": "Cut through the nut of a stubborn trailer ball with an angle grinder . An angle grinder has a rotating metal-cutting blade that can slice through the nut as a last resort. Put on safety glasses and work gloves before you use your angle grinder . Hold the angle grinder with both hands so you have the most support, and turn it on. Once the blade is up to full speed, gently push it into the nut to cut into it. Work slowly until you slice completely through the nut and can easily turn it with a wrench. [10] X Research source Remove the hitch mount from the receiver if you can so you don’t have to cut the ball off while it’s attached to your vehicle."
    }
  ]
}