{
  "url": "https://www.wikihow.com/Hide",
  "title": "How to Hide",
  "steps": [
    {
      "title": "Stay out of your pursuer's line of sight.",
      "content": "Stay out of your pursuer's line of sight. People tend to look left to right when they're searching for something. For this reason, it's best to choose a spot that's either above or below eye-level. This will help you choose a less obvious hiding spot and also help make your movements less noticeable. When you enter an area, pay attention to where your eyes fall naturally and pick out a place away from that zone."
    },
    {
      "title": "Make yourself as small as you can.",
      "content": "Make yourself as small as you can. As soon as you decide on a hiding spot, crouch, stoop, or sit down and draw your arms and legs in. If you're tucked away in a narrow space, stand up straight and put your arms down at your sides. The less room you take up, the harder you'll be to see. It's still a good idea to get nice and compact even if your hiding spot offers complete concealment. If you're lurking behind a couch, for example, you're less likely to be spotted if you're curled up in a ball as opposed to stretched out."
    },
    {
      "title": "Be still.",
      "content": "Be still. Once you get situated and you've shrunk down as much as possible, freeze yourself in place. Imagine that you're a statue or a piece of furniture. Do your best not to move until you know your pursuer is a safe distance away. Resist the urge to scratch an itch or adjust your hair or clothing, no matter how uncomfortable you are. The human eye detects movement before anything else, especially when it's dark. All it takes is one wrong move to accidentally signal where you are."
    },
    {
      "title": "Stay quiet.",
      "content": "Stay quiet. While you're in hiding, avoid making any unnecessary noise. Try not to cough, sneeze, clear your throat, or do anything else that might get you caught. Even rustling your clothes too loudly could give away your position. [1] X Research source Stifle your breathing by opening your mouth and taking deep, slow breaths . This is far less audible than panting nervously or breathing through your nose. If you and another person are hiding in the same spot, don't talk. Not only will the sound carry, you may also be too distracted to notice if someone is approaching."
    },
    {
      "title": "Camouflage yourself with nearby objects.",
      "content": "Camouflage yourself with nearby objects. You won't always be able to sneak into a closet or stow yourself under a table. When you're caught in an open space with no large items to hide behind, lie down, reach for whatever's around, and pull it on top of you. Your cover will keep you out of sight until you can find a better spot. [2] X Research source You might bury yourself under a pile of blankets or dirty laundry if you're hiding in your bedroom, or dive into a pile of leaves if you're hiding outside. Found objects can provide temporary cover, but they're not recommended for a long-term hiding."
    },
    {
      "title": "Be prepared to leave your spot if you're in danger of being found.",
      "content": "Be prepared to leave your spot if you're in danger of being found. No matter how good your hiding spot is, there's a chance someone may stumble across it sooner or later. If you suspect it's only a matter of time until the game is up at your current spot, wait for an opening and make a run for it or move to another secret location. [3] X Research source Moving can create quite a commotion, so wait until your pursuer is far enough away not to hear you light out. Rather than rushing to your next hiding spot, slow down and move as fluidly as you can . It may sound counterintuitive, but you'll make less noise that way and prevent yourself from tripping or accidentally bumping into something."
    },
    {
      "title": "Crawl under the bed.",
      "content": "Crawl under the bed. If you're in a bedroom and need to vanish quickly, get down on all fours and shimmy beneath the frame of the bed. Then, lie flat on your belly or back and be as still as possible. When your pursuer peeks into the room, they won't see anything out of place. If the bed sits on a frame that's high up off the ground, the person looking for you may be able to see you or your shadow. Hiding under the bed is a pretty common tactic, so be ready to make a run for it if you happen to get spotted."
    },
    {
      "title": "Duck into a closet.",
      "content": "Duck into a closet. Closets are tried-and-true hiding places. They're big enough for most people to fit into easily, and sometimes even contain coats and other items of clothing that can provide extra cover. And since most people don't open closets very often, it's possible that they won't think to look for you there. Be sure to open and close the closet door softly to cover your tracks. If you're involved in a heated game of hide-and-seek , don't go for the closet unless you have no other option. Closets are a somewhat obvious hiding spot."
    },
    {
      "title": "Get behind the couch.",
      "content": "Get behind the couch. If your hear the person you're trying to avoid about to come into the room, dive behind the couch and kneel down to make yourself smaller. Chances are, they'll take a quick look around and leave thinking that you're not there. Make sure the couch you're hiding behind faces the entrance of the room so you won't be visible. You might also curl up behind a loveseat, easy chair, or futon if there's not a full-sized couch around. Since their backsides are completely exposed, couches don't make great long-term hiding spots."
    },
    {
      "title": "Slip behind the curtains.",
      "content": "Slip behind the curtains. Insert yourself into the space between the curtains and the window and pull the curtain in front of you. Stand up straight and keep your arms pinned to your sides so the person looking for you won't catch a glimpse of any suspicious lumps behind the drapery. [4] X Research source Your feet will likely be visible under the bottom of the curtains, so consider moving to another hiding spot after a short time."
    },
    {
      "title": "Jump in the shower.",
      "content": "Jump in the shower. If the shower has a solid curtain, pull it closed in front of you. Otherwise, lie down so that the lip of the tub blocks you from sight. When you're trying to get away from someone who's casually looking around for you, getting in the shower or tub just may do the trick. Steer clear of shower stalls with glass doors, as these don't offer any kind of cover. Be careful not to knock over a bar of soap or a bottle of shampoo while you're in the shower, or you're as good as caught!"
    },
    {
      "title": "Squeeze yourself into a tight space.",
      "content": "Squeeze yourself into a tight space. If you're on the small side, see if there's a cabinet, alcove, or out-of-the-way shelf nearby that you can fit in. Most buildings have at least a few unseen nooks and crannies in them, so you should have quite a few options available to you if you're willing to get a little cramped. [5] X Research source Other examples of clever hiding places are storage trunks, cardboard boxes, and laundry hampers. Never hide in a container if there is a lock or you have to de-latch something to open it. You could lock yourself inside and suffocate, especially if you are alone and no one can hear you. Never try to force yourself into a hiding space that's too small for you. If you get stuck, you'll have bigger problems on your hands than being discovered."
    },
    {
      "title": "Head for the attic or basement.",
      "content": "Head for the attic or basement. These spaces tend to be crammed full of boxes, old furniture, and little nooks and crannies, which can make excellent hiding places of their own. Most people won't go to the trouble of inspecting behind, under, and around each and every object, so you're likely to get away unnoticed. Some people are too afraid to venture into attics and basements at all, meaning there's a chance they won't even be willing to go in after you. Basements and attics tend to be dusty, so breathe through your mouth to prevent a bout of noisy sneezing."
    },
    {
      "title": "If you are spotted, move immediately to a new location.",
      "content": "If you are spotted, move immediately to a new location. You should have planned a new hiding spot, that should be your new location. Make sure your new location is out of sight of your original location, so if you were spotted slightly, they will not be able to find you. If you make any noise, and the individual does not find you, make a noise elsewhere to divert suspicion, or reduce it by making it seem normalized."
    },
    {
      "title": "Climb a tree",
      "content": "Climb a tree . Look around for trees with thick canopies—these will provide the best cover. Since you'll be well above the average person's line of sight, the person hunting for you will likely be too busy checking all the usual ground-level spots to figure out where you've gone. [6] X Research source If you're perched on one of the lower branches, don't let your feet dangle where they can be seen. The same basic rules of hiding apply when you're in a tree: remain quiet and still. Rustling leaves can be a dead-give away."
    },
    {
      "title": "Crouch in a bush.",
      "content": "Crouch in a bush. You don't actually have to get inside the bush. In most situations, simply getting low and staying behind it will be good enough. Just like with trees, though, avoid making any sudden movements that might cause the bush to shake, or you could end up blowing your cover. Watch out for bushes with thorns or spiky leaves. If you're not careful, you could get scraped up as you climb in or out."
    },
    {
      "title": "Retreat into a garage or shed.",
      "content": "Retreat into a garage or shed. These places tend to be dark and a little scary, which means the person looking for you is less likely to venture into them after you. Best of all, there are often so many tools, vehicles, and pieces of equipment around that you'll have access to multiple hiding spots within your hiding spot. Don't hide in a shed or garage on someone else's property. You could get in trouble if you're caught trespassing. It's not a good idea to hide underneath a car or truck, either."
    },
    {
      "title": "Sneak under the porch.",
      "content": "Sneak under the porch. On many houses, the areas under the front and back steps have open spaces built into them for storage. Look for a way to get under the porch or deck of the house where you're laying low. There may be a small door or gate, or you may be able to squeeze into an opening around the edge of the house. Watch out for potentially dangerous creatures while you're down below. Dark, damp spaces are often home to snakes , spiders, mice, and other creepy-crawlies. [7] X Research source"
    },
    {
      "title": "Lie in wait in a pile of leaves.",
      "content": "Lie in wait in a pile of leaves. Fallen leaves make excellent natural camouflage. Dive into a freshly-raked mound and pull the loose leaves on top of yourself until you're completely concealed. Your friends will never suspect a thing—unless you decide to pop out and scare them senseless! [8] X Research source Drop a rock or stick into the leaf pile before you climb in to make sure there are no wild animals already hiding in it. Leaf piles can be breeding grounds for mold and bacteria, especially when they're wet, so avoid completely covering your face and try not to spend too much time inside."
    },
    {
      "title": "Move under the cover of darkness.",
      "content": "Move under the cover of darkness. Darkness is the ultimate concealment. If you have nowhere else to post up, stick to the shadows, where you'll be practically invisible to your pursuers. Even if you're not completely blocked from view, you'll still be able to fade into the background and move stealthily from place to place. [9] X Research source Wearing dark clothes will help you blend in with your surroundings even more. If the person looking for you is using a flashlight, try to find a large object to stand behind when they get close."
    }
  ]
}