{
  "url": "https://www.wikihow.com/Know-if-a-Coworker-Has-a-Crush-on-You",
  "title": "8 Signs Your Coworker Has a Crush on You (& What to Do About It)",
  "steps": [
    {
      "title": "They enter your personal space.",
      "content": "They enter your personal space. If they like you, they may try to get physically close. Observe if your coworker enters your personal space to touch you on the shoulder or “accidentally” bump into you repeatedly. [1] X Expert Source John Keegan Dating Coach Expert Interview. 11 November 2019. If a coworker has a crush on you , they may move into your personal space more than if they had no feelings for you. Beware not to confuse “close talkers” or other people who don’t understand or respect personal space with people who have feelings for you. Check to see if your coworker invades everyone’s personal space: if so, it might not be personal. [2] X Research source"
    },
    {
      "title": "They keep finding reasons to be around you.",
      "content": "They keep finding reasons to be around you. Someone who likes you will go out of their way to get near you. Observe whether the person finds reasons to be around you. If they do, it might be a sign that they’ve got a crush on you. If someone has no useful or practical reason to be around you, yet they always are, they might have feelings for you. If someone is around you a lot, but is around you out of necessity, they might not have feelings for you."
    },
    {
      "title": "They’re always looking at you.",
      "content": "They’re always looking at you. Staring is a big indicator your coworker is into you. Like Frankie Valli says, “You’re just too good to be true, can’t take my eyes off of you.” If this sounds like your coworker, they may have feelings for you—especially if they look away awkwardly every time you catch them staring. [3] X Expert Source John Keegan Dating Coach Expert Interview. 11 November 2019. Mixed with other signals, looking at you may mean that they have a crush on you. A crushing colleague may steal glances at you throughout the day for no apparent reason, and if they’re so brazen as to wink or check out your physical features, you can be fairly certain they’re trying to flirt a little. Reader Poll: We asked 941 wikiHow readers about the strongest indicator that someone thinks of you as more than a friend, and only 8% of them said if they point their hips and toes toward you . [Take Poll] Instead, see if they make repeated eye contact or get close to you."
    },
    {
      "title": "They display open, receptive body language.",
      "content": "They display open, receptive body language. Observing someone’s body language is a fairly reliable way to tell how they feel, since it’s usually unconscious. If your coworker generally faces you (even when they’re not interacting with you) and maintains an open, relaxed posture, they could be interested in you. [4] X Expert Source John Keegan Dating Coach Expert Interview. 11 November 2019. If their arms and legs are open and their posture is relaxed, and if they lean toward you when they interact with you, they might be interested in you . [5] X Research source Does your coworker send signals that they’re closed off from you? If they stand with arms crossed or withdrawn, they could either be nervous or not interested in you at all."
    },
    {
      "title": "They compliment you a lot.",
      "content": "They compliment you a lot. Flattery is a big sign of interest. The occasional “Nice work on that report!” might not mean much, but if your coworker goes out of their way to shower you in compliments—especially compliments not pertaining to your work—they might have a crush on you. [6] X Research source If your coworker consistently compliments the job you’re doing at work, it might mean that they just respect you as a coworker, but if they remark on your physical looks or other things that are not related to work, it might mean that they have romantic interest in you. Don’t take compliments by themselves as an indication of your coworker having a crush. Evaluate compliments in the context of other factors."
    },
    {
      "title": "They talk about personal stuff with you.",
      "content": "They talk about personal stuff with you. Getting down to the nitty gritty means they trust you. When you chat with your coworker, does the subject always seem to go somewhere personal and non-work-related, like childhood dreams or your love lives? The subject of your conversations with your coworker can give you pretty solid cues about their feelings for you, especially if they’re the one initiating personal conversations. Does your coworker talk sex, being intimate, or romantic interests? This might be a way of getting your attention in a romantic way. [7] X Research source Note that it’s possible your coworker just thinks of you as someone they can confide in, even if it’s just platonic."
    },
    {
      "title": "They invite you to activities outside work.",
      "content": "They invite you to activities outside work. Someone with a crush won’t only want to see you during work hours. If your coworker asks you about your weekend plans, it might not mean anything. But if they invite you along, it’s a sign that they definitely see you as more than just a coworker. Depending on the context, it could be a sure sign they’re interested in you romantically. [8] X Expert Source John Keegan Dating Coach Expert Interview. 11 November 2019. If they invite you out alone with them, it might be a date, especially if the activity is romantic or seems like a get-to-know-you activity, like a walk in the park or a coffee. If they invite multiple people in your workplace to the same event, they may just be being friendly, so be sure to judge this sign alongside other signs, and don’t jump to any conclusions too fast."
    },
    {
      "title": "They tell you they’re into you.",
      "content": "They tell you they’re into you. A direct admission of their feelings is sort of hard to ignore. It’s obvious, but if your colleague tells you they see you as more than a coworker, it’s pretty clear they see you as more than a coworker. Whether they admit this freely or you ask them and they spill, saying “I’m into you” is pretty much the ultimate sign they’re, y’know, into you. If, after watching for other signals, you feel confident they like you, take the plunge and ask your coworker if they have a crush on you—just be careful not to violate any workplace etiquette or policies. Ask them in an oblique way by saying something like, “Do you think our relationship goes beyond work?” Or try using humor to offset your question. Perhaps make a joke about how other employees avoid you, then say, “You don’t seem to hate me like everyone else.” Be careful about suggesting you want more than a work relationship, especially if you don’t. Even if you do, if you’ve incorrectly gauged your coworker’s feelings, you could make them feel uncomfortable or even unsafe. Even if you both have feelings for each other, be careful being public about it if your company frowns on workplace relationships."
    },
    {
      "title": "Learn about your company’s policies about workplace relationships.",
      "content": "Learn about your company’s policies about workplace relationships. Before even engaging in activity to find out if your coworker has a crush on you, you need to figure out what your company’s policies are regarding workplace romances. [9] X Expert Source John Keegan Dating Coach Expert Interview. 11 November 2019. This is important even if you don’t want a relationship, because even the rumor of two people being involved could cause problems. Check your employee handbook, if you have one, for policies on workplace relationships. Talk to a human resource representative, if you can’t find information elsewhere. Tell your superiors if you begin a formal, mutually-recognized relationship. [10] X Research source"
    },
    {
      "title": "Avoid anything that could be construed as sexual harassment.",
      "content": "Avoid anything that could be construed as sexual harassment. When trying to find out if your coworker has a crush, you need to make sure that you avoid any conversation or activity that may be construed as sexual harassment. Know that what you may perceive to be a harmless comment could be taken as something much more. Never make a blatantly sexual or romantic comment to anyone you are not in a formal, mutually-recognized relationship with. Don’t touch other employees unless invited to do so, and never do so at work in a sexual or romantic way even if you are in a mutually-recognized relationship. If you think someone has a crush on you, and you’re uncomfortable letting them know you’re not interested, consider contacting human resources. If someone makes unwanted advances toward you despite your signals to stop, contact management or human resources immediately. [11] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source"
    },
    {
      "title": "Avoid making assumptions about your coworker’s feelings.",
      "content": "Avoid making assumptions about your coworker’s feelings. Perhaps the most important thing to do when trying to determine if a coworker has a crush on you is to avoid making assumptions. By making assumptions, you'll jump to conclusions about things without being properly informed. When you do this, you may do something or say something that could get you into trouble or hurt someone else’s feelings. Make sure you always have the correct information when making a decision about what to do. Don’t treat someone differently because you think they have a crush on you. Don’t expect a date, sexual favors, or anything of the sort from someone you think has a crush on you."
    }
  ]
}