{
  "url": "https://www.wikihow.com/Guidance-5e",
  "title": "Everything You Need to Know About D&D 5e's Guidance Cantrip",
  "steps": [
    {
      "title": "Guidance is a divination cantrip that affects ability checks.",
      "content": "Guidance is a divination cantrip that affects ability checks. Gameplay in D&D 5e is full of ability checks which require you to roll a d20 and add a relevant skill bonus to the result. It’s a matter of luck; sometimes you roll high (and pass the check), while sometimes you roll low (and fail). However, Guidance is a handy cantrip that can improve your odds of success by adding 1d4 to a single ability check. [1] X Research source Casting time: 1 action Range: Touch Target: One willing creature Components: Verbal and somatic Duration: Up to 1 minute (Concentration) Cantrips are the lowest level of spell available in 5e. They don’t require spell slots to cast, so known cantrips can be cast at will at any time."
    },
    {
      "title": "Choose a willing target within reach of your PC.",
      "content": "Choose a willing target within reach of your PC. Guidance has 4 main requirements to cast: first, it has a verbal and somatic component, meaning your PC (player character) needs to be able to speak and make hand gestures. Then, they need to be close enough to touch whoever they’re casting Guidance on—and their target must be willing. [2] X Research source A “willing” target simply means the creature you cast Guidance on must accept the spell. If they don’t want Guidance to be cast on them, the spell won’t work. You can also cast Guidance on your own PC; any spell with a “Touch” range in 5e can be cast this way."
    },
    {
      "title": "Maintain concentration on Guidance for the spell’s duration.",
      "content": "Maintain concentration on Guidance for the spell’s duration. Because Guidance is a concentration spell, that means your PC needs to focus on keeping it active after casting it. To do so, avoid conditions that break concentration, including casting a new concentration spell, being incapacitated (or killed), or taking damage (and failing a subsequent Constitution saving throw). [3] X Research source Luckily, maintaining concentration on Guidance may not always be an issue. It only lasts until the target creature adds the spell’s bonus to an ability check, which usually takes less than a minute. Therefore, you probably won’t have to maintain concentration on Guidance for a full minute often."
    },
    {
      "title": "Add 1d4 to an ability check of your choice.",
      "content": "Add 1d4 to an ability check of your choice. When someone casts Guidance on your PC (or you cast it yourself), you essentially get to add 1d4 to any ability check within the next minute of in-game time (before the spell ends). You can also choose to add this bonus before or after making the initial ability check. [4] X Research source For example, say you ask the DM if you can make an arcana check to examine a strange rune—and cast Guidance on your PC before making the check. Then, say you get a 13 on the check. You might decide to add the 1d4 Guidance bonus if you’re unsure whether a 13 will pass the check. So, if you roll 1d4 and get a 13, that means you can add 3 to the arcana check for a total of 16 (3 + 13). The higher the result, the more likely you are to pass an ability check—so 16 is a better result than 13!"
    },
    {
      "title": "Clerics, druids, and artificers can cast Guidance.",
      "content": "Clerics, druids, and artificers can cast Guidance. Guidance is automatically present on 5e’s cleric, druid, and artificer spell lists, which means you can add it to your PC’s repertoire if you’re playing either class (regardless of the subclass you choose). However, a couple of other classes and subclasses can get the cantrip, including: [5] X Research source Divine Soul Sorcerers: Because they have access to the entire cleric spell list, Divine Souls can learn and cast Guidance. Bards: While Guidance isn’t on the bard spell list, bards can opt to learn it using their Magical Secrets feature."
    },
    {
      "title": "Guidance buffs skill checks without using spell slots or components.",
      "content": "Guidance buffs skill checks without using spell slots or components. There are very few downsides to keeping the Guidance cantrip handy. Because it’s a cantrip, it won’t consume spell slots, meaning you can cast it as often as you like without any consequences. It might not always save a low ability check, but there’s no harm in casting it to see if it can help! [6] X Research source Some spells require material components (meaning your PC might need a physical ingredient to cast with), but Guidance is purely verbal and somatic. That means you won’t need to worry about keeping any extra spellcasting materials on hand to cast it in a pinch."
    },
    {
      "title": "Guidance often isn’t as useful in combat.",
      "content": "Guidance often isn’t as useful in combat. Guidance is specific to ability checks only. Since combat in D&D 5e mostly consists of attack rolls and saving throws (which aren’t the same as ability checks), you probably won’t need Guidance much. [7] X Research source Keep in mind that Guidance also doesn't stack—meaning you can't have multiple guidance spells on your PC at the same time. You can cast it repeatedly one after the other, however. Attack rolls determine your PC’s ability to hit creatures with a weapon or spell attack, while saving throws determine their ability to resist negative effects. Meanwhile, skill checks measure their ability to use specific skills (like Persuasion or Insight) throughout the game, making them distinct from attack rolls and saving throws."
    },
    {
      "title": "There are plenty of ways to restrict Guidance if you feel it’s too strong.",
      "content": "There are plenty of ways to restrict Guidance if you feel it’s too strong. Some DMs feel that Guidance is overpowered, but that’s not necessarily true. If you’re a DM, you might decide to let your players use Guidance on any check, or you might limit when Guidance can be used. For example: [8] X Research source Time limit: You may declare that Guidance can only be used on ability checks that would take less than 1 minute to complete. No reactions: You might also rule that Guidance can’t be used on skill checks that are part of a reaction. If a PC can’t tell that they’re about to make a check, how would they know to cast Guidance? Situational casting: You might stop players from casting Guidance in social scenarios when it’d be unacceptable to start casting spells (or enforce consequences for doing so)."
    }
  ]
}