{
  "url": "https://www.wikihow.com/Make-Origami-Animals",
  "title": "How to Make Origami Animals",
  "steps": [
    {
      "title": "Fold a square piece of paper in half along the diagonal.",
      "content": "Fold a square piece of paper in half along the diagonal. Lay the paper so that it’s in a diamond shape. Bring the bottom onto the top corner and run your finger along the fold to crease it. [1] X Research source You can use any size, color, and type of paper, as long as it’s a perfect square. If you’re using paper that has a pattern on one side, start with the pattern facing down."
    },
    {
      "title": "Fold the paper in half again, then unfold only this 2nd fold.",
      "content": "Fold the paper in half again, then unfold only this 2nd fold. Pull the left corner onto the right corner, creasing the fold down the middle. Then open it back up to the previous triangle shape. [2] X Research source Don’t unfold the paper all the way back to a square."
    },
    {
      "title": "Fold the left and right corners up at a 45 degree angle from the center.",
      "content": "Fold the left and right corners up at a 45 degree angle from the center. These folds will create the ears of the cat. Pull the tips up so they’re at least even with the top corner. [3] X Research source Try to keep the ear folds the same on both sides. Make the head as symmetrical as possible."
    },
    {
      "title": "Pull the top corner down, folding it to flatten the top of the head.",
      "content": "Pull the top corner down, folding it to flatten the top of the head. The bigger the piece that you fold down, the smaller your cat’s head will be. A good rule of thumb is to bring the top corner down about 1/3 of the way. Crease it so that the point stays down. [4] X Research source The amount that you fold over at the top also affects the size of the ears. If you fold over a larger section, the ears will be more exposed and appear bigger."
    },
    {
      "title": "Flip the paper over and add any finishing touches you’d like.",
      "content": "Flip the paper over and add any finishing touches you’d like. This side is the front of the cat’s face. If you want to round out the face, fold the corners on the side under slightly. Similarly, if you want to flatten the cat’s chin instead of having it come to a point, fold the bottom corner back to create a straight line. [5] X Research source You can also draw eyes, whiskers, and a nose on the cat’s face with a marker or paint. For a 3D craft, glue googly eyes on the front and use pipe cleaners as whiskers."
    },
    {
      "title": "Fold a square piece of paper on both diagonals, unfolding it in between.",
      "content": "Fold a square piece of paper on both diagonals, unfolding it in between. Bring 2 opposite corners together, creasing the diagonal fold. Then open the paper back up and repeat with the other 2 corners. [6] X Research source Your paper must be square with all of the edges the exact same length. Any size, color, or type of square paper will work."
    },
    {
      "title": "Fold the paper in half, then unfold it again.",
      "content": "Fold the paper in half, then unfold it again. Place the left edge of the paper onto the right edge. Make a crease by pressing firmly along the fold and then open the paper back up to a square. [7] X Research source If you need help creating a fold that isn’t crooked, use a straight edge like a ruler or the edge of a counter to fold along."
    },
    {
      "title": "Bring the 2 sides of the crease together so the paper folds into a triangle.",
      "content": "Bring the 2 sides of the crease together so the paper folds into a triangle. Take the left side and pull it in to meet the right side. As you do this, the paper should collapse into a triangle shape along the diagonal folds you created earlier. [8] X Research source If your paper doesn’t collapse easily or correctly, try re-folding the diagonals and the center fold. The more you crease those lines, the easier the paper should fold onto itself."
    },
    {
      "title": "Fold the top layer of both corners into the center.",
      "content": "Fold the top layer of both corners into the center. This will create a square shape in the middle of the triangle. Line up the edges of the corners so that they’re perfectly perpendicular to the bottom of the triangle, straight down the middle. [9] X Research source Avoid overlapping the edges of the folded corners. They should just touch each other."
    },
    {
      "title": "Take the corners of the small square and fold them into the center.",
      "content": "Take the corners of the small square and fold them into the center. This is a similar fold to what you just did, and it will turn the tiny square into a kite shape. The edges of the folds should line up in the center. [10] X Research source Crease the folds firmly so they stay in place."
    },
    {
      "title": "Flip the paper over and fold the 2 corners into the center.",
      "content": "Flip the paper over and fold the 2 corners into the center. The left and right corner will meet at the bottom of the frog, creating a point. Align the long edges in the center so they’re touching, but not overlapping. They should form a line down the middle. [11] X Research source Avoid leaving a gap between the 2 edges. If they aren’t slightly touching, start the fold over."
    },
    {
      "title": "Fold the 2 bottom corners slightly outward to create the legs.",
      "content": "Fold the 2 bottom corners slightly outward to create the legs. The long edge that was in the center should now line up with the outer edge of the folded triangle. Run your finger firmly along the fold to hold it in place. [12] X Research source It helps to hold the frog in place at the top tip while you make this fold."
    },
    {
      "title": "Fold about 1/3 of the bottom of the frog up towards the top.",
      "content": "Fold about 1/3 of the bottom of the frog up towards the top. You’re beginning the folds that will let your frog jump. Bring the legs and bottom of the body up, creasing it securely. [13] X Research source Don’t fold the shape completely in half or it won’t look like a frog."
    },
    {
      "title": "Fold the bottom of the frog back onto itself, flipping the legs down.",
      "content": "Fold the bottom of the frog back onto itself, flipping the legs down. Make another fold near the bottom, this time folding the paper away from you. This is similar to making a pleat. The legs will untuck and point down, away from the head. [14] X Research source Add googly eyes to the top of the frog or glue on red paper tongues if you’d like."
    },
    {
      "title": "Fold a square piece of paper in half diagonally.",
      "content": "Fold a square piece of paper in half diagonally. Bring 2 opposite corners together and crease the fold. This will form a triangle shape. [15] X Research source You can use any type, color, or size of square paper. Origami paper is best for beginners because it is easiest to fold."
    },
    {
      "title": "Bring the 2 bottom corners of the triangle up to the top corner.",
      "content": "Bring the 2 bottom corners of the triangle up to the top corner. Your paper will now be in a smaller square. Line up the edges in the center as you fold the corners. [16] X Research source Make sure the edges are just slightly touching. You don’t want them to overlap, but you also don’t want there to be a gap between them."
    },
    {
      "title": "Fold the 2 sides of the square backwards along the diagonal.",
      "content": "Fold the 2 sides of the square backwards along the diagonal. Bring the 2 corners on either side of the open fold together behind the square. You’ll now have a triangle shape again, with 2 flaps. [17] X Research source If it’s easier, you can flip the paper over to make the fold."
    },
    {
      "title": "Fold the side with open edges 1/3 of the way towards the other corner.",
      "content": "Fold the side with open edges 1/3 of the way towards the other corner. This side will be one of the sides formed by the right angle of the triangle. Line up the bottom of the fold with the edge on the bottom of the triangle. Crease it firmly to hold it in place. [18] X Research source The bigger the section that you fold over, the bigger the fox’s head will be."
    },
    {
      "title": "Pull open the corner of the flap on the piece you just folded.",
      "content": "Pull open the corner of the flap on the piece you just folded. There should be 2 layers on your folded-over section. Take the bottom corner of just the top layer and pull it back in the opposite direction of the fold. [19] X Research source Be gentle when pulling the corner to avoid ripping the flap."
    },
    {
      "title": "Fold the tip in the center down to create the head.",
      "content": "Fold the tip in the center down to create the head. As you pull open the flap, there will be a small triangular piece in the middle that automatically begins folding down. Run your finger along the fold to crease it so it doesn’t pop back up. [20] X Research source If you want to decorate your fox, add a face with markers, paint, or googly eyes."
    }
  ]
}