{
  "url": "https://www.wikihow.com/Make-a-Firework-Rocket-in-Minecraft",
  "title": "How to Make a Firework Rocket in Minecraft",
  "steps": [
    {
      "title": "Make sure that you have a crafting table available.",
      "content": "Make sure that you have a crafting table available. You'll need a crafting table in order to create your firework's components. You can create a crafting table with four wood planks. If you want to use blue or green dye in your firework's explosion, you'll also need a furnace"
    },
    {
      "title": "Know the components of a firework rocket.",
      "content": "Know the components of a firework rocket. To create a stack of three rockets, you will need one piece of paper and one lump of gunpowder; you will also need a firework star, which consists of one gunpowder lump and one unit of dye, to create an actual explosion. [1] X Research source"
    },
    {
      "title": "Kill Creepers for gunpowder.",
      "content": "Kill Creepers for gunpowder. Creepers are the green, armless monsters that hiss and explode when you get too close. For this reason, you will need to be very aggressive when attacking a Creeper; if it starts hissing, back away as quickly as possible to avoid the brunt of the blast. You'll usually need to hunt Creepers at night. This is dangerous, so make sure that you have plenty of healing items (e.g., cooked food). Creepers don't always drop gunpowder. You'll likely need to kill several Creepers to net one or two lumps of gunpowder."
    },
    {
      "title": "Harvest sugarcane for paper.",
      "content": "Harvest sugarcane for paper. Sugarcane is a tall, light-green plant that grows near water. You will need three sugarcane units to create a stack of three pieces of paper. [2] X Research source"
    },
    {
      "title": "Obtain a dye source.",
      "content": "Obtain a dye source. To add a visual effect to your fireworks, you'll need dye. You can find the following colors of dye in nature: Red - Collect any red flower, then place it on a crafting table. Yellow - Collect any yellow flower, then place it on a crafting table. Green - Collect cactus, then smelt the cactus in a furnace. Blue - Mine Lapis Lazuli blocks, then smelt the Lapis Lazuli ore in a furnace. These are dark-blue-freckled rocks that are usually found quite deep underground."
    },
    {
      "title": "Find fuel for your furnace.",
      "content": "Find fuel for your furnace. If you're smelting dye, you'll need some wood planks or coal for your furnace. Skip this step if you're using only red and/or yellow dye."
    },
    {
      "title": "Open your crafting table.",
      "content": "Open your crafting table. Right-click the table (PC), tap the table (PE), or face the table and press the left trigger (console). The crafting table interface will open. If you don't want your firework rocket to have any explosive effect, skip to the next part . If you're crafting green or blue dye, open the furnace instead."
    },
    {
      "title": "Place your dye source in the crafting table.",
      "content": "Place your dye source in the crafting table. Click and drag the dye source (e.g., a flower) into any square in the crafting table. If you're smelting dye, the source must instead go into the top square, and you'll have to put your fuel source in the bottom square. In Minecraft PE, tap the dye source, then tap the crafting table. If you're smelting, tap the source and then tap the \"Input\" square, then tap your fuel source and tap the \"Fuel\" square. On consoles, press the right shoulder button six times, select the \"Dye\" tab, scroll down to select your dye, and press A or X . If you're smelting, select the dye and tap Y or triangle, then repeat with the fuel source."
    },
    {
      "title": "Retrieve the dye.",
      "content": "Retrieve the dye. Click the dye to select it. If you smelted dye, hold down ⇧ Shift and click the dye, then exit the furnace and open the crafting table. In Minecraft PE, tap the dye, then tap your inventory. On consoles, the dye goes straight to your inventory when you create it. If you smelted the dye, select it and press Y ."
    },
    {
      "title": "Craft your firework star.",
      "content": "Craft your firework star. Place one lump of gunpowder in any square of the crafting grid, then place your dye in any empty square of the crafting grid. On consoles, you'll select the firework-shaped tab on the left side of the screen by pressing a trigger repeatedly, then scroll down until you find the correct dye and press A or X ."
    },
    {
      "title": "Retrieve your star.",
      "content": "Retrieve your star. Now that the star is in your inventory, you can create the firework rocket itself."
    },
    {
      "title": "Open your crafting table.",
      "content": "Open your crafting table. Right-click the table (PC), tap the table (PE), or press the left trigger while facing the table (consoles)."
    },
    {
      "title": "Place the paper in the crafting table.",
      "content": "Place the paper in the crafting table. Click the paper, then click an empty space in the crafting table grid. In Minecraft PE, tap the paper icon and then tap a square in the crafting grid. Skip this step on consoles."
    },
    {
      "title": "Place the gunpowder in the crafting table.",
      "content": "Place the gunpowder in the crafting table. Click the gunpowder, then click an empty space in the crafting table's grid. In Minecraft PE, tap the gunpowder icon and then tap an empty square in the crafting grid. Skip this step on consoles."
    },
    {
      "title": "Place your star(s) in the crafting table.",
      "content": "Place your star(s) in the crafting table. You can place your firework star in any empty square in the crafting grid. Skip this step if you're just creating a rocket without an explosion. In Minecraft PE, tap your star, tap an empty square in the crafting grid, and repeat with any other colors that you want to use. On consoles, press the left or right trigger until you open the rocket-shaped tab on the left side of the screen, press the right shoulder button twice to open the rocket section, press right on the D-pad to select the \"Star\" field, and press Y or triangle to add your star."
    },
    {
      "title": "Retrieve the rockets.",
      "content": "Retrieve the rockets. Hold down ⇧ Shift and click the rocket stack to the right of the crafting grid to move the rockets into your inventory. You can fire off your rockets by selecting them in your equip bar and then selecting the ground in front of you. In Minecraft PE, tap the rocket stack and then tap your inventory. On consoles, press A or X to create the rockets and place them in your inventory."
    }
  ]
}