{
  "url": "https://www.wikihow.com/Have-Fun-With-Your-New-Cockatiel",
  "title": "How to Have Fun With Your New Cockatiel",
  "steps": [
    {
      "title": "Give your cockatiel time to adjust to your home.",
      "content": "Give your cockatiel time to adjust to your home. When you first bring your new cockatiel home, he may need anywhere from a few days to two weeks to get comfortable in his new environment. [1] X Research source [2] X Research source Limit your interactions with him during this time. [3] X Research source Having a comfortable cage will help your cockatiel adjust to your home. Make sure the cage is large enough for him to spread his wings without touching the sides of the cage. Also, a square or rectangular cage is preferable, since a round cages tend to make birds feel nervous. [4] X Research source Put his cage in a busy part of your home. Since cockatiels thrive on interaction, getting him used to human activity will help him acclimate to your home. [5] X Research source Place wood perches of variable diameters in his cage to give his feet good exercise. His food and water dishes should go at the height of the perches to prevent them from getting contaminated by his droppings. [6] X Research source When you first bring him home, consider sitting with him for about 20 minutes in the room where you have placed his cage— without putting him in his cage. By doing this, he will learn that the space outside of his cage is safe, making it easier for you to take him out of his cage later on."
    },
    {
      "title": "Schedule regular interactions with your cockatiel.",
      "content": "Schedule regular interactions with your cockatiel. Your new cockatiel will need daily interaction with you. Plan to spend one hour per day interacting with him. This interaction can involve different types of activities, such as talking to him, petting him, or teaching him new tricks (e.g., ‘step up’). Pay attention to what your cockatiel likes to do. This can give you ideas on how to interact with him. For example, if he likes to toss a toy with his beak, roll a toy towards him and let him toss it back to you. [7] X Research source Interacting with him in a way that he enjoys will deepen your bond with him and let you have even more fun with him."
    },
    {
      "title": "Talk your cockatiel.",
      "content": "Talk your cockatiel. Talking to your new cockatiel is a great way to interact with him. You can even teach him how to talk! When you talk to him, associate your words with something very specific. For example, say the name of a particular food (e.g., ‘apple’) as you are feeding it to him. [8] X Research source You can also say ‘good morning’ when you get greet him in the morning and say ‘bye bye’ as you walk out the door. [9] X Research source Your cockatiel is more likely to learn words or phrases that are spoken enthusiastically. Whichever words or phrases you want your cockatiel to learn, say with them energy and enthusiasm. [10] X Research source With repetition, your cockatiel will start saying the words back to you, even if it sounds more like a whistle initially. Keep in mind that male cockatiels are more likely to talk than female cockatiels. [11] X Research source"
    },
    {
      "title": "Teach your cockatiel how to dance.",
      "content": "Teach your cockatiel how to dance. Interestingly, cockatiels have rhythm. When you have him perched on your finger, turn on some music and gently move your hand up and down to the beat of the song. Watch with amusement as your cockatiel starts to bob his head to the beat. [12] X Research source"
    },
    {
      "title": "Let your cockatiel out of his cage.",
      "content": "Let your cockatiel out of his cage. Your new cockatiel will enjoy being able to interact with you when he is outside of his cage. If you have not had his wings clipped, he will enjoy having the space to fly around the room and your home. If his wings are clipped, he may be perfectly content to sit on a perch. Portable perches are available at your local pet store. Wood play pens are also available that you could set up outside of your cockatiel’s cage. If you have a skittish or nervous cockatiel, he may prefer to stay inside his cage. Do not force him to come out of his cage for the sake of interacting with you."
    },
    {
      "title": "Eat with your cockatiel.",
      "content": "Eat with your cockatiel. In the wild, cockatiels will eat together. To foster this same type of social interaction, consider feeding your cockatiel when you are eating. This will make him feel like he is eating with you, even if he is not eating off your plate. [13] X Research source Make sure to wash your hands after feeding him and before eating your own meal. [19] X Research source www.petland.ca/pages/caring-for-your-cockatiel"
    },
    {
      "title": "Feed treats to your cockatiel.",
      "content": "Feed treats to your cockatiel. Another way to have fun with your cockatiel is to feed him treats. There is a variety of treats that you can feed him, such as packaged seed treats and spray millet. [20] X Research source www.petland.ca/pages/caring-for-your-cockatiel Some healthy treats include strawberries, mangoes, and yellow peppers. Keep in mind that treats should be only a small part of your cockatiel’s diet. Feeding him too many treats could lead to health problems such as obesity. Make you hold the treat by its sides to prevent your bird from biting your fingers. [16] X Research source"
    },
    {
      "title": "Leave the television or radio on.",
      "content": "Leave the television or radio on. Environmental enrichment is very important to your cockatiel’s health and well-being. The happier he feels in his environment, the more fun you will have with him. For the times when you are away from home, leaving the television or radio on for him will keep him mentally and visually stimulated until you get home. [17] X Research source Channels that your bird might enjoy are the Travel Channel and Discovery Channel. [18] X Research source Animal Planet is another good channel for your bird to watch. Other than the television or radio, you could also play a CD with bird or nature sounds. [19] X Research source"
    },
    {
      "title": "Provide your cockatiel with a variety of toys.",
      "content": "Provide your cockatiel with a variety of toys. As with other pets, cockatiels can become bored when playing with the same toys. Giving your cockatiel a variety of toys (e.g., wooden toys, puzzler toys) will provide him with good physical and mental exercise. You do not have to spend a fortune on toys, though—rotating out the toys every few days will give him what seems like an endless array of toys from which to choose. Cockatiels especially like toys they can shred and destroy. A balled-up piece of newspaper or notebook paper is perfect for your cockatiel and will save you money. Cockatiels have a natural instinct to chew. Select chew toys made of either wood or leather. [20] X Research source Chew toys have the added benefit of keeping your cockatiel’s beak trimmed down. Foraging toys encourage your cockatiel to exhibit his natural foraging behavior. By requiring him to put in extra effort to get his food, foraging toys also provide good mental stimulation and physical exercise. [21] X Research source Rope preening toys are also available that will satisfy your cockatiel’s natural urge to preen and prevent him from feather picking and self-mutilation. [22] X Research source Comfort toys (e.g., snuggle perches) are toys that your cockatiel could snuggle up against, especially if he does not have a cage mate. [23] X Research source Exercise toys, such as swings and bungees, will provide your cockatiel with plenty of physical exercise. [24] X Research source"
    },
    {
      "title": "Move your cockatiel’s cage to a different location.",
      "content": "Move your cockatiel’s cage to a different location. This will give your cockatiel a change of scenery, which would keep him visually stimulated. Select a new location that is on the periphery of activity, rather than in the center of it. This would give your bird a chance to observe the different activity, but also have some peace and quiet. [25] X Research source Determine if your bird will be able to tolerate a change of scenery. If your bird is older or timid, a change in location could cause him to start feather picking. [26] X Research source"
    },
    {
      "title": "Provide your cockatiel with a cage mate.",
      "content": "Provide your cockatiel with a cage mate. Since cockatiels are such social animals, your cockatiel may be happier if he has a cage mate with whom he can interact. [27] X Research source If you spend a lot of time away from home, providing your cockatiel with a cage mate will keep him entertained and busy while you are not home. Make sure that the new bird is well socialized and friendly. [28] X Research source Be mindful that you will need to have frequent interaction with both birds. [29] X Research source Having two birds in the same cage could have its downsides. For example, the birds could start to exhibit aggressive behavior. Also, when the birds reach reproductive maturity, they may begin to start feather picking because of hormonal stress. [30] X Research source If your bird is older and has become accustomed to the solitary life, giving him a cage mate may not be ideal. [31] X Research source Consult with your avian veterinarian if you are considering getting a cage mate for your cockatiel."
    }
  ]
}