{
  "url": "https://www.wikihow.com/Install-Parquet",
  "title": "How to Install Parquet",
  "steps": [
    {
      "title": "Clean the subfloor.",
      "content": "Clean the subfloor. Remove any paint, wax, sealants, adhesives, and debris. Be sure the subfloor is completely dry before beginning to install the parquet flooring."
    },
    {
      "title": "Level the subfloor.",
      "content": "Level the subfloor. Use a belt sander to sand any high areas and/or fill any sunken areas with cement leveling compound."
    },
    {
      "title": "Replace any damaged areas in the subfloor.",
      "content": "Replace any damaged areas in the subfloor. The subfloor needs to be smooth and level to ensure the overlaid parquet floor is level."
    },
    {
      "title": "Tighten any loose areas of the subfloor.",
      "content": "Tighten any loose areas of the subfloor."
    },
    {
      "title": "Mark the center of each wall.",
      "content": "Mark the center of each wall. Use a marker to indicate the center of each wall and draw straight chalk lines connecting opposite walls."
    },
    {
      "title": "Lay the parquet panels down on the floor.",
      "content": "Lay the parquet panels down on the floor. Start from the center point where the perpendicular chalk lines intersect out to the walls along each line. Do not apply adhesive yet. Adjust the lines if more than one-half of the last row of panels needs to be cut."
    },
    {
      "title": "Apply adhesive.",
      "content": "Apply adhesive. Use a notched trowel held at a 45-degree angle to apply enough adhesive on the subfloor for the area to be covered by the first parquet panel. Lay the first panel, aligning it with the chalk lines."
    },
    {
      "title": "Add enough adhesive on the subfloor to lay the next 8 panels on both sides of the first panel.",
      "content": "Add enough adhesive on the subfloor to lay the next 8 panels on both sides of the first panel."
    },
    {
      "title": "Align the flooring.",
      "content": "Align the flooring. Holding each parquet panel at a 45-degree angle, align the tongue-and-grooves between the new panel and the adjacent panel already laid on the subfloor and tap into place with a rubber mallet. One the panels are aligned, lay the new panel into the adhesive. Repeat until all 8 parquet panels have been laid."
    },
    {
      "title": "Repeat applying areas of adhesive and laying parquet panels until all except the last row of parquet panels have been laid.",
      "content": "Repeat applying areas of adhesive and laying parquet panels until all except the last row of parquet panels have been laid."
    },
    {
      "title": "Measure and cut the last row of parquet panels using a jigsaw.",
      "content": "Measure and cut the last row of parquet panels using a jigsaw. Lay the last row of parquet panels."
    },
    {
      "title": "Set the parquet flooring firmly by rolling the newly laid panels with a 150-pound (68.04 kg) floor roller within a few hours of completing the installation.",
      "content": "Set the parquet flooring firmly by rolling the newly laid panels with a 150-pound (68.04 kg) floor roller within a few hours of completing the installation."
    }
  ]
}