{
  "url": "https://www.wikihow.com/Install-a-Graphics-Card",
  "title": "How to Install a Graphics Card (GPU) in Your Windows PC",
  "steps": [
    {
      "title": "Find cards that are recommended for your interests.",
      "content": "Find cards that are recommended for your interests. Different cards are best suited for different applications, though most cards excel at being jack-of-all-trades. Be sure to read as many reviews as possible before deciding on a card. There are lots of resources online for finding the best performance for your budget. Sites such as Tom's Hardware will publish comparison charts ranking the current most popular cards in all price ranges, and customer reviews on sites such as Newegg can provide insight into the average person's experience with the card. Some popular graphics cards in 2023 and 2024 include: Nvidia GeForce RTX 4090 : This is one of the best high-end cards at the moment that can handle pretty much anything you throw at it at 4K. It has a price to match too - about $1600 for the Founders Edition and $1750 for the overclocked models. AMD Radeon RX 7600 : This is a low-end card that can handle most games at 1080p High settings. You can snag this card for less than $280. The similarly performing Nvidia GeForce RTX 4060 can be had for $30 more, though it has lower power usage. AMD Radeon RX 7900 XTX : This is an excellent all-around card that can run most games at 4K Ultra settings without breaking a sweat. You can usually find these for around $1000. The similarly performing Nvidia GeForce RTX 4080 can be had for $200 more, though it has lower power usage."
    },
    {
      "title": "Strike a balance between price and power.",
      "content": "Strike a balance between price and power. Graphics cards can get expensive. At a certain point, the average user won't be gaining any benefits from the increased cost of higher-end cards. Examine the applications you intend to use your card with and find a card that gives you the best power and reliability for your buck. [1] X Research source The more expensive cards are typically geared towards graphics card overclockers and users who want to use dual- or quad-card configurations . If you are focused on graphic design, look for cards with more onboard memory, such as 12 or 16 GB. These will be more expensive but will increase your rendering and encoding speeds. Check the system requirements for your favorite games. See what graphics card is recommended to get the best performance out of the games you love, and also keep in mind the needs of future games."
    },
    {
      "title": "Look at the card's display capabilities.",
      "content": "Look at the card's display capabilities. As display technology improves, so does the number of options available on graphics cards. Your new card may support HDMI, DVI, DisplayPort, VGA, or any combination. Check what your monitor uses to connect, and purchase your card accordingly. For the best possible quality, you will want to connect via HDMI or DisplayPort. If you want to run multiple monitors, ensure the graphics card can support multiple monitors with quality ports."
    },
    {
      "title": "Open your case.",
      "content": "Open your case. To install your new graphics card (also called a GPU), you'll need to open your computer's case. Most modern cases have thumbscrews on the back that allow you to easily remove the side panels, but you may need a Phillips-head screwdriver to remove the screws on older cases. You should shut down your PC and disconnect the power cable and all peripherals before removing the side panels. Remove the panel on the opposite side of the motherboard. If you look at the back of your computer, you will see a panel on one side that contains a variety of ports, including USB, Ethernet, display ports, and more. This is the motherboard I/O panel and will help you see which side the motherboard is located on. You can lay your computer on this side and remove the opposite panel to access the motherboard easily."
    },
    {
      "title": "Ensure that your power supply is up to the task.",
      "content": "Ensure that your power supply is up to the task. Powerful graphics cards require a power supply that can give them the juice they need. If you're running an old power supply or have many other components drawing power, your power supply might not make the cut. If this is the case, consider upgrading your power supply at the same time that you upgrade your graphics card. There are a variety of sites online that help you calculate power requirements by analyzing all of the hardware currently installed or that you're planning to install. Search for \"power supply calculator\" using your favorite search engine. Your power supply will also need PCI-E connectors. This usually isn't an issue if your power supply is newer, but power supplies older than ten years may not have the appropriate connectors. Your power supply's maximum wattage should be printed on a sticker affixed to the power supply. You may need to remove the power supply to find it."
    },
    {
      "title": "Ensure that your motherboard supports the card.",
      "content": "Ensure that your motherboard supports the card. Virtually all graphics cards are PCI-E these days, so you will need to ensure that you have at least one of these slots. They are typically located closest to the processor in the row of PCI slots. If you don't have any PCI-E slots, you may need to install a new motherboard if you want to upgrade your graphics card. [2] X Expert Source Yaffet Meshesha Computer Specialist Expert Interview. 10 February 2021 Refer to your motherboard's documentation to find the layout diagram. This will help you identify where the PCI-E slots are located. Note: Most laptops do not allow you to upgrade the graphics card."
    },
    {
      "title": "Make sure that the card will fit.",
      "content": "Make sure that the card will fit. Many modern graphics cards are quite large and will take the space of two PCI slots in the computer. They can also be fairly tall and long, so you'll need to ensure enough vertical and horizontal clearance. Use a tape measure to note the vertical and horizontal clearance you have available. Nearly all cards will have their dimensions listed in their product descriptions, allowing you to ensure that it will fit before you purchase it."
    },
    {
      "title": "Uninstall your old drivers if switching between GPU brands.",
      "content": "Uninstall your old drivers if switching between GPU brands. One of the biggest potentials for errors and problems stems from driver incompatibility. Before installing your new card, it is highly recommended that you uninstall the drivers that Windows is currently using to display graphics if you're moving from AMD to Nvidia or vice versa. The quickest way to uninstall your drivers is to open the Device Manager and uninstall from there. To open the Device Manager, search for it in the Start menu or press ⊞ Win + X and select it from the menu (Windows 8 only). Once in the Device Manager, expand the Display Adapters section. Right-click on your current display adapter and click Uninstall. Follow the prompts to remove the driver from your computer. Your display will likely revert to low quality, with large icons and blurry text. Power down your computer after uninstalling the drivers. If you're staying within the AMD or Nvidia family, you likely will be okay if you don't uninstall your drivers before starting."
    },
    {
      "title": "Ground yourself.",
      "content": "Ground yourself. Whenever working with sensitive computer components, you should always ensure that you are properly grounded. Electrostatic discharge can damage or destroy your components, rendering them useless. Preferably, you will be using an anti-static wrist strap attached to exposed metal in your case. If you don't have one, you can ground yourself by touching a metal water tap. Make sure that the open computer is not resting on carpet, and that you are standing on tile or linoleum when working inside the computer. Make sure that the computer is unplugged from the wall before you begin working on the insides."
    },
    {
      "title": "Identify the old card.",
      "content": "Identify the old card. You can find your old graphics card inserted into the PCI-E or AGP slot on your motherboard (AGP cards are typically found on older computers). Most graphics cards are large and will likely be the largest card installed in your system. They often have fans and heatsinks attached to them. If your computer used integrated graphics before (your monitor was connected directly to the motherboard), there will be no card to remove."
    },
    {
      "title": "Remove your existing card.",
      "content": "Remove your existing card. If you are upgrading graphics cards, you will want to remove the old card before installing the new one. Unscrew the screw that is connecting the card to the chassis. Most newer cards have a tab underneath near the back of the PCI slot that will need to be released to pull the card out. When removing the card, pull it straight up so you don't damage the PCI slot. Make sure to disconnect any displayed plugged into the old card before removing it."
    },
    {
      "title": "Clean out any dust.",
      "content": "Clean out any dust. With the old card out, this would be a great time to clean out some of the dust that's accumulated. Use compressed air to clear the dust from the crevices around the PCI slot. Dust can build up and cause your components to overheat, so staying on top of cleaning will help your computer run for a long time."
    },
    {
      "title": "Insert the new card.",
      "content": "Insert the new card. Gently remove the card from its antistatic bag, avoiding touching any of the contacts or circuitry. Insert it straight into the empty PCI-e slot and apply even pressure to the top until it is fully seated. If you have a clip for your PCI-E slot, you will hear it click into place. [3] X Research source You may need to remove the neighboring panel if your graphics card is two panels wide. Make sure no cables or any other components are in the way before completely seating the card."
    },
    {
      "title": "Secure the card.",
      "content": "Secure the card. Use case screws to secure the graphics card to the chassis. If the graphics card is two panels wide, you will want to secure it with two screws, one for each bay. Make sure the card is inserted completely before securing the screws."
    },
    {
      "title": "Connect the power supply.",
      "content": "Connect the power supply. Most modern cards will have power supply connector ports built into the top or the back of the card. You will need to connect one or two PCI-E connectors from the power supply, which are typically 6-pin cables. Without connecting the power supply, these cards will not work properly. Many graphics cards come packaged with adapters that will change your existing connectors into ones that will fit into the graphics card."
    },
    {
      "title": "Close up your computer.",
      "content": "Close up your computer. After you've verified that the card has been seated properly, secured, and connected to the power supply, you can close up the case. Make sure to connect your display to the new graphics card. If you were using onboard video before, the monitor was likely plugged into the motherboard. To take advantage of your new card, your display will need to be connected to it. For best results, use HDMI or DisplayPort to connect your display to your graphics card. If your monitor or card does not support HDMI or DisplayPort, the next best choice is DVI, followed by VGA."
    },
    {
      "title": "Power on your computer.",
      "content": "Power on your computer. Your operating system will most likely detect the new card and attempt to adjust your display so that it is using the optimal resolution and color depth. Accept the changes and enter the operating system. If your monitor does not display any picture at all, you need to troubleshoot your installation. Check to make sure you have the card properly installed and connected. An irregular, jagged-looking or distorted picture might indicate a problem with your graphics card. Check that your card is installed correctly before contacting the manufacturer."
    },
    {
      "title": "Insert your driver disc or download the drivers.",
      "content": "Insert your driver disc or download the drivers. If your graphics card came with a driver disc, you can insert it now to begin the driver setup process. If your card did not come with a disk, or you want to ensure you have the latest release of the drivers possible, you can download the drivers directly from Nvidia or AMD (depending on your card)."
    },
    {
      "title": "Install the drivers.",
      "content": "Install the drivers. The driver installation process is mostly automatic, though you may be asked if you want to install additional graphics card management software. This additional software is optional, but can help ensure that your drivers stay up to date. Your display will most likely flicker and reset during the installation process. Drivers contained on a disc are almost always out of date by the time they are purchased, so you will most likely be asked to update after installing them."
    },
    {
      "title": "Start up a game.",
      "content": "Start up a game. Before starting to play, explore the game's Video settings menu. Turn all the settings up as high as they can and give the game a whirl. If it performs smoothly, then you're good to go. When setting the resolution, you should always try to keep it at your monitor's resolution. For most flat-screen monitors, this is 1920x1080, though newer monitors have a higher native resolution than that. If the game is choppy or otherwise performing badly, start lowering settings one by one. Don't worry too much if your card can't handle the Ultra settings. Sometimes games come out that don't work right with any card! A game's performance is affected by more than just the graphics card. Your processor, RAM, and even hard disk speed will all play a part in how the game performs."
    }
  ]
}