{
  "url": "https://www.wikihow.com/Make-Up-an-Excuse-to-Get-Off-the-Phone",
  "title": "How to Make Up an Excuse to Get Off the Phone",
  "steps": [
    {
      "title": "Tell the caller that you just heard someone knocking at your door or ringing the doorbell and that you need to go see who it is.",
      "content": "Tell the caller that you just heard someone knocking at your door or ringing the doorbell and that you need to go see who it is. Tell them you will call them back after you deal with it. [1] X Research source To make this excuse more realistic, knock on something wooden to make it sound like a knock on your door, or quietly open your front door and ring the doorbell."
    },
    {
      "title": "Make up any household task or errand that you might realistically be doing.",
      "content": "Make up any household task or errand that you might realistically be doing. Tell the caller it’s not a good time to talk and that you will have to talk to them later. [2] X Research source For example, you could say you are in the middle of cleaning, grocery shopping, cooking, getting dressed, or anything else you can think of on the spot."
    },
    {
      "title": "Tell the caller you just sat down for a meal, so it’s not a good time to talk.",
      "content": "Tell the caller you just sat down for a meal, so it’s not a good time to talk. Ask them to call you back later or tell them you will call them back when you’re done eating. [3] X Research source If the caller persists, say something like: “My food is getting cold, I will talk to you later after I eat.” or “I am sitting down to eat with friends and I don’t want to be rude, so I have to go.” Keep in mind that this excuse will work best if you use it around a typical meal time."
    },
    {
      "title": "Put on your best sleepy voice and say you are about to go to bed or that you are in the middle of taking a nap.",
      "content": "Put on your best sleepy voice and say you are about to go to bed or that you are in the middle of taking a nap. Ask the caller to call you back another time when you are awake enough to talk to them. [4] X Research source Try adding a fake yawn or act super drowsy and half-asleep for an extra touch. Make sure you adapt this excuse to the time of day. For example, it would make most sense to say you are going to bed at night around a normal bedtime, whereas saying you are taking a nap would be more believable if it is the middle of a Sunday afternoon."
    },
    {
      "title": "Check the time quickly and say you have a meeting or conference call at the next quarter of the hour so it’s believable.",
      "content": "Check the time quickly and say you have a meeting or conference call at the next quarter of the hour so it’s believable. Tell the caller you have to get ready and need to hang up. For example, if it is 4:22, say you have a conference call at 4:30 and need to organize yourself for it. This excuse will be most believable if you use it during standard business hours."
    },
    {
      "title": "Interrupt the caller and say that you just remembered something you need to take care of urgently.",
      "content": "Interrupt the caller and say that you just remembered something you need to take care of urgently. Act like you are in a rush, say you will talk to them later, and hang up the phone. [5] X Research source For instance, you could say something like: “I just remembered I have to pick up my nephew from soccer practice in 15 minutes, I have to go, bye!” or “Oh no, I just realized I have to go pick up my suit from the dry cleaner before they close at 5, I need to get going, bye!”"
    },
    {
      "title": "Tell the caller you urgently need to go to the bathroom.",
      "content": "Tell the caller you urgently need to go to the bathroom. Ask them to call back later or say that you will call them back. [6] X Research source This is a great excuse to get off the phone fast. Most people will feel pretty awkward when you tell them you urgently need to go to the bathroom and won’t try to keep you on the line."
    },
    {
      "title": "Say that someone just texted you about a death in the family or someone in the hospital and you need to hang up immediately.",
      "content": "Say that someone just texted you about a death in the family or someone in the hospital and you need to hang up immediately. Use this as a last resort excuse. Most callers will not try to keep you on the line after you say something like this. Be very careful who you use this excuse to get off the phone with. Don’t use it on anyone that you are close to who it could affect emotionally."
    },
    {
      "title": "Pretend like someone else is calling you and that you need to take the call.",
      "content": "Pretend like someone else is calling you and that you need to take the call. Then say that you will call them back later and hang up the phone. [7] X Research source If you are talking on your mobile phone and have a landline nearby, you can turn up the ringer volume on the landline so it makes a ringing sound that the caller can hear through your mobile phone."
    },
    {
      "title": "Act like you just checked your battery and it is getting low so your phone might die.",
      "content": "Act like you just checked your battery and it is getting low so your phone might die. Say you need to hang up to preserve the battery because you can’t plug it in to charge it right now. [8] X Research source If you are really desperate to get off the phone, say your phone is about to die and then hang up right away. Turn your phone off or on airplane mode so that if the caller calls back it will seem like your phone really did die."
    },
    {
      "title": "Say you are on the move and your signal is getting weak.",
      "content": "Say you are on the move and your signal is getting weak. Tell the caller you can’t hear them well and will have to call them back when you have better service. [9] X Research source You can turn up the drama on this excuse and act like you don’t hear anything they are saying, then hang up. Say something like: “Hello, hello? Are you there? I think I’m losing service. I can’t hear…” Then hang up."
    },
    {
      "title": "Say your phone is making weird sounds or the screen is acting strangely.",
      "content": "Say your phone is making weird sounds or the screen is acting strangely. Tell the caller that you need to hang up to figure out what is wrong. [10] X Research source For example, say something like: “I’m really sorry, but the audio on my phone sounds weird and it’s really hard to hear you. Can I hang up and call you back later after I figure out what’s wrong?”"
    }
  ]
}