{
  "url": "https://www.wikihow.com/Increase-Your-Short-Term-Memory",
  "title": "Proven Ways to Boost Your Short-Term Memory",
  "steps": [
    {
      "title": "Do puzzles or play games that target your memory.",
      "content": "Do puzzles or play games that target your memory. Some studies show that brain training games can have a significant impact on cognitive functioning, including memory. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source There are lots of apps out there with an array of brain training exercises. Choose games or activities that teach you something new, are challenging, have skills you can build on, and are rewarding. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try DIY options like studying flash cards or memorizing a string of cards in a deck of cards. Alternatively, have someone set a bunch of everyday items on a table. Look at the table for about 10 seconds, then turn around and see how many of the items you can recall. Though there isn't a consensus in the scientific community on if or how much these types of games improve memory, it certainly doesn't hurt to try them! Brain training exercises have different effects on different people, so test them out and see if you notice an improvement. [3] X Research source"
    },
    {
      "title": "Regular mental stimulation may benefit your brain health and memory.",
      "content": "Regular mental stimulation may benefit your brain health and memory. [4] X Expert Source Michael R. Lewis Business Advisor Expert Interview. 29 May 2019. Just like your muscles weaken from physical inactivity, brain inactivity may lead to mental decline. It stands to reason that a more active brain is likely to be a more healthy brain, and that having a healthy brain will benefit your short term memory. [5] X Research source The simple act of having a conversation with another person can benefit your brain health and memory. In addition to talking, consider playing chess, doing puzzles together, or engaging in other activities that challenge your brain to work harder. Stimulate your mind when you’re alone as well. Instead of passively watching TV, try reading a book or writing a letter to an old friend."
    },
    {
      "title": "Healthy food choices are good for your brain and may improve your memory.",
      "content": "Healthy food choices are good for your brain and may improve your memory. By and large, the healthy, balanced diet you should strive to achieve for overall health is also what is needed for a healthy brain that is better primed to encode memories. Eat plenty of fresh fruits and vegetables, add in lean proteins and whole grains, and cut back on saturated fats, sodium, and sugars. [6] X Expert Source Michael R. Lewis Business Advisor Expert Interview. 29 May 2019. The MIND diet (which is a hybrid of the DASH diet and Mediterranean diet) appears to slow down cognitive decline. It prioritizes leafy vegetables, berries, nuts, olive oil, occasional fish consumption, and reduced red meat consumption. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Drink plenty of water as well. Dehydration negatively impacts the brain along with the rest of the body."
    },
    {
      "title": "Exercise increases blood flow to your brain, which benefits it overall.",
      "content": "Exercise increases blood flow to your brain, which benefits it overall. Regular exercise, even as simple as walking, boosts the flow of blood—and with it, oxygen and nutrients—your brain needs to be healthy and strong. Moderate-intensity aerobic exercise, which gets your heart pumping faster and increases your breathing rate, even seems to increase the size of the part of your brain that’s responsible for memory. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source In general, adults should aim for at least 150 minutes of moderate-intensity aerobic exercise per week for overall health benefits."
    },
    {
      "title": "Good sleep habits increase your focus and may help encode memories.",
      "content": "Good sleep habits increase your focus and may help encode memories. It’s easy to see how being tired and groggy makes it harder to remember things. On the other side of the coin, being alert and focused—thanks to getting adequate, high-quality sleep—improves your short term memory capabilities. In addition, research indicates that high quality sleep helps to encode existing memories so that they “stick” much better. Sleep needs vary by person, but, in general, getting 7-9 uninterrupted hours of sleep each night will allow your brain and body to adequately rest and recharge."
    },
    {
      "title": "Focusing intently for 15-30 seconds may help the memory stick.",
      "content": "Focusing intently for 15-30 seconds may help the memory stick. Scientifically speaking, short term memory only lasts around 15-30 seconds—after that, the information is either discarded or moved to long term memory. Therefore, focusing closely on a new piece of info for 15-30 seconds can keep it in your short term memory and may help transfer it to your long term memory. [9] X Research source To remember the server’s name at a restaurant, then, give them your full focus when they introduce themselves, then work to keep repeating and thinking about their name for around 15-30 seconds."
    },
    {
      "title": "Using your senses increases focus and builds memory-helping associations.",
      "content": "Using your senses increases focus and builds memory-helping associations. When you meet someone new, listen carefully and look directly at them as they state their name. Repeat their name immediately afterward. Shake their hand and feel their grip. Even take notice of their perfume or cologne! The more sensory associations you build, the more firmly the memory is encoded. [10] X Research source Repeating a name, or anything else you want to remember, out loud is always a good way to help strengthen a particular short term memory. Listen to yourself saying the word or phrase, and keep doing so with regularity."
    },
    {
      "title": "These visual and verbal techniques really help with multiple bits of information.",
      "content": "These visual and verbal techniques really help with multiple bits of information. Do you still remember learning “Roy G. Biv” in school to keep track of the order of colors in the rainbow? Mnemonic devices can really stick in your memory! Try constructing colorful, even silly visualizations or verbalizations to help encode a group of things in your short-term memory. [11] X Research source For instance, picture a pile of trash falling onto your head when the clock strikes six to remind you to take out the trash each evening. Or, if you’re trying to remember the name of your new co-worker Peggy, imagine her dressed as a pirate with a “peg leg.” Singing the “ABC Song” to the tune of “Twinkle, Twinkle, Little Star” is a familiar childhood mnemonic that uses an auditory cue. Mnemonic devices can use a wide range of number, color, and other cues."
    },
    {
      "title": "Break up more complex things into manageable, organized pieces.",
      "content": "Break up more complex things into manageable, organized pieces. Chunking is related to mnemonics and is the principle behind using hyphens to break up 10-digit phone numbers in the U.S.—remembering individual groups of 3, 3, and 4 numbers is easier than recalling a single string of 10. It works even better when you can create associations within each “chunk” — for instance, maybe the “3015” section of a phone number contains the jersey numbers of two of your favorite athletes. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Remembering a grocery list might be a challenge, but can be made more manageable by grouping the items by category—dairy, produce, meat, etc. Six smaller shopping lists is easier to recall than one larger one."
    },
    {
      "title": "Memorize the primary pieces of info and how the secondary pieces relate to them.",
      "content": "Memorize the primary pieces of info and how the secondary pieces relate to them. In other words, prioritize remembering the most vital information, but also focus on memorizing the structure that connects this vital info to the less important material you also want to remember. Essentially you’re creating a mental “bubble map” [13] X Research source —where the central bubble contains the main info and is connected by lines to surrounding bubbles containing supporting info. [14] X Research source For instance, say you’re at a family reunion and are struggling to keep track of the names of four distant cousins, each of whom also has a spouse and kids. For each family group, commit the name of your cousin to memory first (the “central bubble”), then build associations (“lines”) with that name to the names of the other family members (the “surrounding bubbles”)."
    },
    {
      "title": "Both illnesses and treatments for illness can impact your memory abilities.",
      "content": "Both illnesses and treatments for illness can impact your memory abilities. In the same way that a healthy body fosters a healthy mind and therefore healthy memory abilities, unhealthiness and illness can hamper your memory skills. Any circulatory problem that affects blood flow to the brain—high blood pressure, for instance—can have a negative effect on short term memory. But other conditions like diabetes, thyroid problems, cancers, and so on can likewise have an impact. [15] X Research source Depression can also negatively impact memory abilities, particularly because it can impede your ability to focus. Some medications are known to have short term memory problems as part of their side effects. Talk to your doctor if you’re concerned that your medication may be a factor in your memory issues. While it's true that short term memory loss is one of the first signs of Alzheimer's disease, the significant majority of people with short term memory problems do not have that condition."
    },
    {
      "title": "Tricks like taking notes help cut back on your memory workload.",
      "content": "Tricks like taking notes help cut back on your memory workload. Simple techniques like jotting down notes, keeping a voice recorder handy, or tying strings on your fingers can really help you make it through your daily routines. Using them won’t directly improve your short term memory, but they can reduce the demands on your memory and therefore reduce your chances of forgetting something. [16] X Research source Sometimes the best way to remember something is to let a sticky note or your smartphone calendar do the “remembering” for you!"
    }
  ]
}