{
  "url": "https://www.wikihow.com/Go-to-Siargao-Island",
  "title": "How to Go to Siargao Island",
  "steps": [
    {
      "title": "Visit Siargao Island during September and early October for the best surfing.",
      "content": "Visit Siargao Island during September and early October for the best surfing. Typhoon season is from September to early October, which is the best time for surfing. Of course, that also means there will be an increase in ticket prices during this time period, especially when surfing competitions are running. [1] X Research source Look for travel packages that offer hotels and surfing lessons."
    },
    {
      "title": "Take your trip between May and August to save money.",
      "content": "Take your trip between May and August to save money. For non-surfers, visiting between May and August is your best bet for reasonable prices. Just remember: if you want to surf, waves will be flattest during this period. [2] X Research source Check for promotional airline fares from June to September."
    },
    {
      "title": "Plan your accommodations at a hotel or hostel in General Luna.",
      "content": "Plan your accommodations at a hotel or hostel in General Luna. There's quite a range of accommodations in Siargao, from high-end hotels to cheaper, bargain-priced rooms. Almost all of them are located in General Luna, which is the main tourist area, so be sure to decide on your accommodations ahead of time. Prices are as low as 400 PHP and go up into the thousands. [3] X Research source Ask your airline provider for packages that include accommodations and compare their pricing with all of your available options."
    },
    {
      "title": "Pack a traveling kit to ensure you travel as safe as possible.",
      "content": "Pack a traveling kit to ensure you travel as safe as possible. To make sure you have the best time possible and stay safe, pack a first aid kit. After you have a proper kit, focus on other important items like a hammock, lightweight sleeping bags, hats, sunscreen, and reef shoes. For clothing, anything beach-friendly works—board shorts, lightweight shirts, breezy pants, maxi dresses, and sun dresses. [4] X Research source To be safe, pack some denim jeans and warmer clothes for the nighttime temperature dips. Although temperatures never drop very low in Siargao, it does get occasional rainy periods. Pack an umbrella in case of rain, especially during January, which is the wettest month. Make sure your first aid kit includes bandages, antiseptic, sting relief spray, calamine lotion, anti-fungal cream, and a water filtering tablet."
    },
    {
      "title": "Visit your doctor 6 to 8 weeks in advance and ask about vaccinations.",
      "content": "Visit your doctor 6 to 8 weeks in advance and ask about vaccinations . When travelling to the Philippines, it is recommended to receive the following vaccinations: hepatitis A, hepatitis B, typhoid, rabies, cholera, influenza, and Japanese encephalitis. [5] X Research source Make sure to ask your doctor about all of the locations you plan to travel to on your trip to Siargao island."
    },
    {
      "title": "Apply for a passport at least 6 to 8 weeks in advance if you need one.",
      "content": "Apply for a passport at least 6 to 8 weeks in advance if you need one. If your passport has expired or you don't have one, be sure your give yourself enough time to apply for one. Passports can take as long as 2 months to arrive, so avoid applying last minute. [6] X Research source Ask the passport agency about emergency applications if you're tight on time. For an additional fee, you can get it sent express. If you're already in the Philippines, a standard photo ID should be fine since there typically no internal passports checks within the country."
    },
    {
      "title": "Fly into the airport in Barangay Del Carmen if you're traveling by air.",
      "content": "Fly into the airport in Barangay Del Carmen if you're traveling by air. As of now, Skyjet Airlines and Cebu Pacific are the only two airlines that offer flights directly to Siargao Island's Sayak Airport. This airport is located in Siargao's Barangay Del Carmen, which is about 45 minutes away from tourist attractions and facilities. Look at available options and select from one-way and roundtrip tickets. SkyJet offers flights from Basco Airport, Busuanga Airport, Manila Domestic Airport, Caticlan Airport, and Surigao Airport. Cebu Pacific offers flights from Ninoy Aquino International Airport and Mactan-Cebu International Airport. Visit the Skyjet Airlines website here: https://www.flyskyjetair.com/ . Visit the Cebu Pacific website here: https://www.cebupacificair.com/ ."
    },
    {
      "title": "Travel to Surigao City via bus or car if you're on the mainland.",
      "content": "Travel to Surigao City via bus or car if you're on the mainland. When traveling from the mainland, follow the Pan–Philippine Highway, also known as the Maharlika Highway or Asian Highway 26 PH, and then head east into Siargao City. If you're traveling by bus, Surigao City is accessible by Butuan and Davao City. The 3H bus from Butuan ends at the Surigao Bus Terminal Bus (3H) and costs about 170 PHP per person. From Davao City, Buses 9 to 10 run to Surigao City and cost about 600 PHP."
    },
    {
      "title": "Head to the Surigao City Port and Ferry Terminal to travel by water.",
      "content": "Head to the Surigao City Port and Ferry Terminal to travel by water. Aside from flying, the only way to get to Siargao Island is by water. If you're driving, take the Pan–Philippine Highway—also know as the Maharlika Highway or Asian Highway 26 PH—to the Surigao City Port and Ferry Terminal. You can also take a multicab or tricycle. Be sure to tell your multicab or tricycle driver if you intend to use the RoRo Ferry or trigger boat, as they use different ports."
    },
    {
      "title": "Take a RoRo Ferry to the Dapa Port of Siargao for comfort.",
      "content": "Take a RoRo Ferry to the Dapa Port of Siargao for comfort. The RoRo Ferry is considered to be the comfier option and often have a basic canteen and air-conditioned rooms. They can also accommodate trucks and cars. In terms of pricing, the RoRo Ferry costs about 210 PHP per person. [7] X Research source Ferries usually leaves at 5:30 AM and the latest at about 12:00 PM."
    },
    {
      "title": "Travel to the Dapa Port of Siargao via a trigger boat for a quicker ride.",
      "content": "Travel to the Dapa Port of Siargao via a trigger boat for a quicker ride. Trigger boats are less comfortable, but they get to the Dapa Port of Siargao in about 2 to 3 hours. Prices can vary from 210 PHP to 350 PHP depending on the quality of the boat. Most trigger boats leave the port at around 6 AM, so be sure to wake up early enough."
    },
    {
      "title": "Head to General Luna via van, tricycle, or motorbike.",
      "content": "Head to General Luna via van, tricycle, or motorbike. Once you get to Sayak Airport in Barangay Del Carmen, you need to get to General Luna—the tourist destination. Transport vans at the terminal can escort you for about 150 PHP per person, tricycles are as low as 500 PHP per four people, and motorbikes are as low as 400 PHP for two people. [8] X Research source Regardless of the transportation you choose, try to bargain with your driver! Ask your airline provider or hotel about packages that include transportation to General Luna."
    },
    {
      "title": "Travel to local islands like Daku Island, Naked Island, and Guyam Island.",
      "content": "Travel to local islands like Daku Island, Naked Island, and Guyam Island. Most resorts offer tours that travel to all of these islands in a day—contact them and ask about dates and pricing. For example, Kermit Resort offers island hopping day-trips priced at around 750 PHP per person, which includes a lunch. [9] X Research source Although Sugba Lagoon, typically requires a full day, it's great day-trip for anyone that wants to swim. Full day-trips are about 2,000 PHP per person including lunch."
    },
    {
      "title": "Enjoy fresh, locally caught seafood.",
      "content": "Enjoy fresh, locally caught seafood. Siargao is known for its delicious seafood, and most resorts and hotels are full of them. For cheaper eating, head to the public market in General Luna and try some unprepared seafood or fish. Tuna costs about 120 to 150 PHP per kilogram. [10] X Research source If you're staying at a resort, purchase local tuna from the market and the cooks will prepare it for a small fee. Go to the public market in the morning—this is when everything is fresh!"
    },
    {
      "title": "Visit Magpupungko Pool for swimming and a beautiful view.",
      "content": "Visit Magpupungko Pool for swimming and a beautiful view. Magpupungko Pool is located in the Pilar municipality, which is around 1 hour north from General Luna by vehicle. It costs about 50 PHP to get in, but it's definitely worth it. [11] X Research source Walk along the reef when the sea is calm during low tide."
    },
    {
      "title": "Go surfing and enjoy the waves!",
      "content": "Go surfing and enjoy the waves! Most resorts offer board rentals and training, as well as stand-alone rentals. In general, it's about 500 PHP for each hour of longboard use with a trainer. For just a board rental, it's around 300 PHP for half of a day and 500 PHP for the whole day. [12] X Research source The most popular surf spots are: Cloud 9, Quicksilver, Stimpy's, Rock Island, Daku Reef, Cemetery, and G1."
    },
    {
      "title": "Explore the island via a motorbike or tricycle driver.",
      "content": "Explore the island via a motorbike or tricycle driver. Rent a motorbike for 350 PHP per day and explore any part of the island you want at your own leisure. If you want something more relaxing, hire a tricycle driver for 800 to 1000 PHP per day. Make a list of all the attractions you want to visit before hitting the road."
    }
  ]
}