{
  "url": "https://www.wikihow.com/Make-Clear-Glue",
  "title": "How to Make Clear Glue",
  "steps": [
    {
      "title": "Whisk flour with sugar and 3⁄4 cup (180 ml) of the water.",
      "content": "Whisk flour with sugar and 3 ⁄ 4 cup (180 ml) of the water. Put a saucepan on the stove and pour 1 cup (120 g) of all-purpose flour into it along with 1/3 cup (67 g) of sugar and 3 ⁄ 4 cup (180 ml) of the water. Whisk the mixture to make a smooth paste. [1] X Research source Don't worry if you see a few lumps since you can strain them out later."
    },
    {
      "title": "Stir in the remaining 3⁄4 cup (180 ml) of water and vinegar.",
      "content": "Stir in the remaining 3 ⁄ 4 cup (180 ml) of water and vinegar. Slowly pour in the rest of the water while you whisk. Then, mix in 1 teaspoon (4.9 ml) of vinegar. The vinegar is a very mild preservative that helps your homemade glue last a little longer. [2] X Research source It doesn't matter which type of vinegar you use, especially since you won't smell the vinegar after you cook and cool the glue."
    },
    {
      "title": "Heat the glue over medium and simmer it for 5 minutes.",
      "content": "Heat the glue over medium and simmer it for 5 minutes. Turn the burner to medium and whisk the glue while it cooks. Keep whisking as it bubbles gently and cook the glue until it's thick. [3] X Research source Although the glue looks white, it dries clear so it's great for most craft projects."
    },
    {
      "title": "Strain the glue into an airtight storage container.",
      "content": "Strain the glue into an airtight storage container. Turn off the burner and set a fine-mesh strainer over your storage container. Carefully spoon the glue into the strainer and push it through using the back of the spoon. Then, use the glue or put the lid on it and store it at room temperature for up to 2 days. [4] X Research source If your glue doesn't look lumpy, you can skip this step and transfer the glue directly to your storage container. Clean the saucepan and strainer in hot, soapy water as soon as you finish making the glue. Once you've used the glue in the container, soak it for 30 minutes before scrubbing it with hot, soapy water."
    },
    {
      "title": "Mix 3⁄4 cup (180 ml) of the water with corn syrup and vinegar.",
      "content": "Mix 3 ⁄ 4 cup (180 ml) of the water with corn syrup and vinegar. Set a saucepan on the stove and pour in 3 ⁄ 4 cup (180 ml) of the water. Add 2 tablespoons (40 g) of corn syrup and 1 teaspoon (4.9 ml) of vinegar. Then, stir the mixture until the corn syrup dissolves. [5] X Research source You can use any type of vinegar in this glue recipe."
    },
    {
      "title": "Bring the mixture to a boil over medium heat.",
      "content": "Bring the mixture to a boil over medium heat. Turn the burner to medium and keep the lid off of the pan so you can see when the liquid begins to boil. Stir the mixture occasionally and heat it until it comes to a full rolling boil. [6] X Research source"
    },
    {
      "title": "Mix the remaining water with cornstarch in a small bowl.",
      "content": "Mix the remaining water with cornstarch in a small bowl. Pour the remaining 3 ⁄ 4 cup (180 ml) of water into a small mixing bowl and add 2 tablespoons (15 g) of cornstarch. Use a spoon or a whisk to mix the cornstarch until it dissolves in the water. [7] X Research source The cornstarch makes the glue thick and easier to spread."
    },
    {
      "title": "Whisk the cornstarch into the pan and boil it for 1 minute.",
      "content": "Whisk the cornstarch into the pan and boil it for 1 minute. Slowly pour the cornstarch mixture into the pan with the boiling liquid. Keep whisking the whole time you pour so the cornstarch doesn't clump. Bring the glue to a boil and continue to whisk for 1 minute. [8] X Research source It's really important to whisk constantly so the glue becomes smooth. Wash the pan immediately in hot, soapy water so the glue doesn't have a chance to harden."
    },
    {
      "title": "Turn off the burner and cool the glue to room temperature.",
      "content": "Turn off the burner and cool the glue to room temperature. Set the pan on a cool burner so the glue stops cooking and leave it to sit until it's cool enough to handle. This should take around 20 minutes. Then, use your glue or store it for later. [9] X Research source To store the flour-free glue, spoon it into an airtight container and keep it at room temperature for up to 2 days. Once you've used the glue and need to clean the container, soak it in hot, soapy water for 30 minutes before you scrub it out."
    },
    {
      "title": "Put 2 tablespoons (16 g) of flour into an airtight container.",
      "content": "Put 2 tablespoons (16 g) of flour into an airtight container. Find a small container that you'd like to use to store the glue and put the flour into it. If you'd like to double or triple the recipe, use a larger container. [10] X Research source Since this glue only lasts 1 day, make just as much as you need for your project."
    },
    {
      "title": "Stir in 1⁄4 cup (59 ml) of water and 1 pinch of salt.",
      "content": "Stir in 1 ⁄ 4 cup (59 ml) of water and 1 pinch of salt. Slowly whisk in the water 1 spoonful at a time to prevent large lumps from forming. Then, mix in a pinch of salt. Keep mixing until the flour is hydrated and you have a sticky paste. [11] X Research source"
    },
    {
      "title": "Whisk in more water until the glue is the consistency you want.",
      "content": "Whisk in more water until the glue is the consistency you want. If you'd like a clear paste, you may not need to add more water. To make thinner glue that you can spread with a brush, whisk in a spoonful of water at a time. [12] X Research source Add up to an extra 1 ⁄ 4 cup (59 ml) of water for thin, clear glue."
    },
    {
      "title": "Refrigerate the glue for 10 to 15 minutes if you want to make thick paste.",
      "content": "Refrigerate the glue for 10 to 15 minutes if you want to make thick paste. Although you can use the clear glue as soon as you've mixed it, stick it in the fridge to chill if you want a thicker paste. Then, stick a popsicle or craft stick into the paste to spread it on your project. [13] X Research source Store your no-cook glue or paste at room temperature for up to 1 day. If you keep it in the fridge for more than 15 minutes, it will dry out and harden. To clean out the container, soak it in hot, soapy water for 30 minutes before you wash it."
    }
  ]
}