{
  "url": "https://www.wikihow.com/Make-a-Paper-Christmas-Tree",
  "title": "How to Make a Paper Christmas Tree",
  "steps": [
    {
      "title": "Assemble your materials.",
      "content": "Assemble your materials. You can keep your tree simple, or get as elaborate as you like by decorating it with paint, glitter, stickers, paper cutouts, or anything else you can think of. This is a great project to do with a group. Supply the construction paper and a variety of decorative materials, and let everyone’s imagination run wild! [1] X Research source Green construction paper (or any color you like). Scissors. A marker. Clear tape. Decorations for your tree; popular choices include glitter, stickers, ribbon, colored paper, confetti, etc. Craft glue or glue dots to affix the decorations. A hot glue gun and glue stick to affix the topper (optional)."
    },
    {
      "title": "Cut two identical tree shapes out of construction paper.",
      "content": "Cut two identical tree shapes out of construction paper. Begin by stacking two pieces of construction paper together and folding them in half. Then use a marker to draw a half-tree shape on the outside of your paper stack. Finally, cut along the lines through both sheets of paper. You will now have two identical tree shapes. You can make a large tree by using two full-size sheets of construction paper, or you can cut one piece of paper in half."
    },
    {
      "title": "Cut slits in the tree shapes for joining them together.",
      "content": "Cut slits in the tree shapes for joining them together. First, find and mark the vertical center of each tree by folding it in half vertically (fold the pointed tip of the tree down to the base of the tree,) then lightly crease or mark the center. Finally, cut a slit in one tree from the top down to the center mark, and cut a slit in the other tree from the bottom up to the center."
    },
    {
      "title": "Join the two shapes and form the tree.",
      "content": "Join the two shapes and form the tree. Slide the two pieces together along the slits so that the middles match. Then use a few small piece of clear tape at the top and bottom of the tree to hold it all together. Finally, fold the tree open so that it stands on its own."
    },
    {
      "title": "Have fun decorating your tree!",
      "content": "Have fun decorating your tree! The sky is the limit with this step; be as creative as you like. You can use paint or glitter glue to add sparkle, or even “flock” you tree. Cut ornaments out of colored paper using scissors or a hole punch, and glue them to the tree. Create a garland out of metallic thread or ribbon, and don’t forget a tiny star or angel on top. You can use the same 3d cutting/splicing method you used to create the tree to make a 3D star or angel for the top. Hot glue works best for attaching things to the point of the tree."
    },
    {
      "title": "Assemble your materials.",
      "content": "Assemble your materials. This tree begins as a simple paper cone that can be decorated as simply and elegantly, or as elaborately as you like. These trees can be made any size, and you can use any decorative paper that you have on hand, or decorate plain paper before beginning. Decorative paper. Use green construction paper for a traditional look, or use a patterned craft paper or gift wrap to create beautiful, modern trees. Avoid using very lightweight paper. A dinner plate, bowl or other large round object that can be used to create a circle template. Craft glue, glue dots, or a hot glue gun and glue stick. Scissors. Decorations for your trees."
    },
    {
      "title": "Cut out the cone shapes.",
      "content": "Cut out the cone shapes. Begin by tracing your plate, bowl or other circular object onto your desired piece of paper, then cut out the circle. Then fold the circle into quarters by first folding it in half and creasing it, then folding it half and creasing it, again. Now open up the circle and cut it into quarters along the crease lines. Each circle of paper will create four cones. Use different sizes of plates/templates to create different cones of different heights and sizes. You can create a larger circle template by using piece of string that is half the size you want your circle to be. Tie a pencil to one end of the string, and hold the other end fast in the center using tape, a pin, or a helper. Then pull the string taut, and swing the pencil around to draw a perfect circle. [2] X Research source"
    },
    {
      "title": "Form the cones.",
      "content": "Form the cones. Hold one of the quarter-circle pieces with the point at the top, and wrap it around to form a cone. Then use the adhesive of your choice to secure the seam. Be sure to hold the cone in place long enough for the glue to dry. You can also use tape, or even staples for this step, it just won’t look quite as neat."
    },
    {
      "title": "Decorate the cones!",
      "content": "Decorate the cones! Decorate the paper surface with markers, paints, glitter glue, or rubber stamps. Then use glue dots or craft glue to affix various ornaments and other decorations to the tree. These paper-cone Christmas trees look especially nice with the addition of a textured or 3D component, so try using buttons, sequins, beads, or craft gems to decorate your trees. You can also create a star to top the tree using metallic chenille stems (pipe cleaners), or by making a bow out of shiny ribbon. Hot glue works best to affix items to the point of the tree."
    },
    {
      "title": "Place your paper Christmas trees around your home, and get ready for the compliments to come pouring in!",
      "content": "Place your paper Christmas trees around your home, and get ready for the compliments to come pouring in! Arrange a row of trees along a mantle, or use a cluster of varying-sized trees to make a beautiful and festive centerpiece."
    }
  ]
}