{
  "url": "https://www.wikihow.com/Make-Your-Mascara-Look-Great",
  "title": "How to Make Your Mascara Look Great",
  "steps": [
    {
      "title": "Choose the right mascara formula.",
      "content": "Choose the right mascara formula. The first step in making your mascara look great is making sure to use the right formula. Mascaras are designed to do different things for your lashes, so if you use a lengthening mascara when you want thicker-looking lashes, you’ll probably be disappointed. Check to make sure that the formula you’re using meets your needs. [1] X Research source A lengthening or defining mascara is meant to help your lashes look longer. A volumizing or thickening mascara is meant to help your lashes look thicker. A curling mascara is meant to help lift and bend straight lashes. A tubing mascara contains special polymers that form tubes around your lashes that make them longer and thicker. A fiber mascara contain fiber filaments that adhere to your natural lashes so they appear thicker and longer. Some mascara formulas are designed to lengthen and thicken for an overall improved look for the lashes. If you’re not sure what you want out of mascara, opt for this type of multipurpose formula. Depending on your needs, you may want to use a combination of mascaras in different formulas. For example, you may do a first coat with a volumizing mascara and then add a second coat of a lengthening mascara to separate and define your lashes."
    },
    {
      "title": "Consider the mascara’s brush or wand.",
      "content": "Consider the mascara’s brush or wand. In addition to the mascara formula itself, the type of brush or wand that a mascara has makes a big difference in the finished look of your lashes. Some brushes feature nylon bristles, while others are made of molded plastic. The shape and layout of the brush affects how the mascara is applied as well. Work with a brush or wand that suits your needs. [2] X Research source For thick, fluttery lashes, look for a mascara with a brush that is thick and densely bristled. For long, defined lashes, look for a mascara with a brush that has sparse, short bristles. For the lower lashes, choose a mascara with a small brush head."
    },
    {
      "title": "Opt for a waterproof formula.",
      "content": "Opt for a waterproof formula. If you want to ensure that your mascara looks great all day, it’s important to use a waterproof version. It holds up well to tears, sweat, and any other kind of moisture, and also helps lock the curl into your lashes. Use a waterproof mascara so you don’t have to worry about running, smudging, or flaking beneath the eyes. [3] X Research source The drawback to waterproof mascara is that it can be tough to remove. Make sure that you have a waterproof eye makeup remover on hand to take it off at the end of the day. If you wear contacts or have sensitive eyes, be sure that your mascara is also hypoallergenic so you don’t have to worry about the formula irritating your eyes."
    },
    {
      "title": "Keep your mascara fresh.",
      "content": "Keep your mascara fresh. Like all makeup, mascara can actually go bad over time. An old mascara can not only cause eye irritations and infections, but it can make your lashes look clumpy. That’s because mascara dries out as it gets old so it can become thick and crusty. Make sure the mascara that you’re using is less than 3 months old. If you have multiple tubes of mascara and it’s difficult to keep track of how old they are, consider putting labels on them. Write the date that you opened the tube on the label, and stick it on the mascara so you’ll know when your 3 months are up."
    },
    {
      "title": "Use a black mascara.",
      "content": "Use a black mascara. For the best, most intense look, you should use a black mascara. It does the best job of making lashes look thicker and longer, so be sure to choose the blackest mascara you can find. Save colored mascaras, such as blue, purple, or green, for adding a fun pop of color to your lower lashes. [4] X Research source If you have extremely fair skin, you may prefer to use a black brown mascara so it doesn’t look as harsh."
    },
    {
      "title": "Condition your lashes nightly.",
      "content": "Condition your lashes nightly. For your mascara to look as good as possible, you must start with soft, healthy lashes. You can purchase a lash conditioner product that helps moisturize your lashes. Apply it nightly after you’ve removed all of your mascara and other eye makeup to wake up with healthy lashes. [5] X Research source If you don’t want to purchase a specialty lash conditioner, you can use petroleum jelly, vitamin E, or coconut oil. Dip a clean spoolie into one of them, and coat your lashes before going to bed."
    },
    {
      "title": "Curl your lashes before applying mascara.",
      "content": "Curl your lashes before applying mascara. Your mascara will look better if your lashes are curled. That’s because curling your lashes lifts them and helps them look a little fuller. However, it’s important to use your lash curler before you apply mascara. If your lashes are wet, they can stick to the curler and you may pull some out while you’re curling. [6] X Research source If you don’t have an eyelash curler or aren’t comfortable using one, you can apply your mascara first. When your lashes are still wet, gently push them upward to create and curl. Hold them like that for 10 to 15 seconds."
    },
    {
      "title": "Start with a lash primer.",
      "content": "Start with a lash primer. After curling your lashes, it helps to apply a lash primer before using your mascara. A primer conditions and coats the lashes so they appear thicker and longer. They’ll also provide a base for the mascara to cling to."
    },
    {
      "title": "Blot the mascara wand.",
      "content": "Blot the mascara wand. When you pull the mascara wand out of the tube, it will be loaded with product. If you apply it to your lashes right away, your lashes may look clumpy. Instead, wipe the wand off on a tissue or napkin to remove the excess mascara. [7] X Research source If you don’t have a tissue handy, try wiping the wand off on the side of the tube’s opening."
    },
    {
      "title": "Wiggle the wand back and forth at the base of the lashes.",
      "content": "Wiggle the wand back and forth at the base of the lashes. When you’re ready to apply the mascara, start by holding the brush right at the root of your lashes. Gently wiggle it back and forth to ensure that you apply a generous coat at the root. [8] X Research source Make sure to wiggle the brush left to right rather than up and down for the best looking lashes."
    },
    {
      "title": "Use a zigzag motion to cover your lashes.",
      "content": "Use a zigzag motion to cover your lashes. After you’ve applied mascara to the base of your lashes, move the wand in a zigzag motion from the roots to the tips of your lashes. This technique creates a more fluttery look for your lashes. [9] X Research source For your lower lashes, hold the wand vertically so you can coat each lash individually."
    },
    {
      "title": "Comb through your lashes after applying the mascara.",
      "content": "Comb through your lashes after applying the mascara. Once you’ve applied the first coat of mascara, allow your lashes to dry for 3 to 5 seconds. Next, take a clean lash comb and run through your lashes to remove any clumps and fan out your lashes. [10] X Research source If you don’t have a lash brush or comb, you can use a clean toothbrush or disposable spoolie to comb through your lashes."
    },
    {
      "title": "Add additional coats if necessary.",
      "content": "Add additional coats if necessary. If your lashes don’t appear as long or thick as you’d like after your first coat of mascara, apply additional coats. Keep in mind that the more mascara you add, the more likely your lashes are to clump so don’t overload on mascara. [11] X Research source Be sure to comb your lashes after each coat of mascara that you apply to avoid clumps."
    }
  ]
}