{
  "url": "https://www.wikihow.com/Get-a-Blank-Pfp",
  "title": "How to Make an Invisible Profile Pic: TikTok & Discord Tutorial",
  "steps": [
    {
      "title": "Go to https://www.remove.bg in web browser.",
      "content": "Go to https://www.remove.bg in web browser. To get an blank profile picture, you need to make an invisible image and save it as a PNG file. This free tool makes it easy, and you can use it in a desktop or mobile browser. If you don't want to use this website, you can use any photo editing app, such as Canva, Procreate, Sketchbook, Gimp , or another program."
    },
    {
      "title": "Select Upload Image.",
      "content": "Select Upload Image . This is the blue button."
    },
    {
      "title": "Select an image.",
      "content": "Select an image. Try using an image that's just a solid color or has a large background. The website will remove it to make an invisible image. If you don't have a very plain image, you can just take a screenshot of any solid color and upload that image."
    },
    {
      "title": "Select Done.",
      "content": "Select Done . This removes the background from the picture, turning it into a blank image. If you're using a desktop browser, you may need to select Remove Background ."
    },
    {
      "title": "Select Download.",
      "content": "Select Download . This is the blue button below the transparent image. The image will be downloaded to your device. You can now upload the blank profile picture to TikTok or Discord ."
    },
    {
      "title": "Open TikTok and tap your profile picture.",
      "content": "Open TikTok and tap your profile picture. This is in the bottom-right corner of TikTok. Your profile will open."
    },
    {
      "title": "Tap Edit profile.",
      "content": "Tap Edit profile . You can find this below your following."
    },
    {
      "title": "Tap your profile picture and tap Upload photo.",
      "content": "Tap your profile picture and tap Upload photo . This will let you change your profile picture."
    },
    {
      "title": "Select the transparent image.",
      "content": "Select the transparent image. If needed, zoom into the image so the circle shows only the transparent section. If you don't have your photo permissions enabled for TikTok, you'll need to enable it first."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . If you don't want to post the new photo to your Story, uncheck the option for Post this photo to Story . Your profile picture will be transparent."
    },
    {
      "title": "Make your name invisible (optional).",
      "content": "Make your name invisible (optional). You can make your name invisible by using an invisible character that is recognized by TikTok. Tap Edit profile . Tap Name . Copy and paste \" \" into the field (without quotations). Tap Save ."
    },
    {
      "title": "Open Discord and click the cog icon.",
      "content": "Open Discord and click the cog icon. This is at the bottom-left corner, next to your username. On mobile, tap your profile picture in the bottom-right corner."
    },
    {
      "title": "Click Edit User Profile.",
      "content": "Click Edit User Profile . This is near the top. [1] X Research source On mobile, this is Edit Profile ."
    },
    {
      "title": "Click your profile picture and select Change Avatar.",
      "content": "Click your profile picture and select Change Avatar . A new window will open. On mobile, skip this step."
    },
    {
      "title": "Click Upload Image and select your .PNG image.",
      "content": "Click Upload Image and select your .PNG image. If needed, you can use the slider bar to resize the image so the circle shows only the transparent section."
    },
    {
      "title": "Click Apply.",
      "content": "Click Apply . This will set your profile picture as transparent."
    },
    {
      "title": "Make your name invisible (optional).",
      "content": "Make your name invisible (optional). You can make your display name invisible by using an invisible character that is recognized by Discord. Erase your current Display Name . Copy and paste \" \" into the field (without quotations). Click Save Changes ."
    }
  ]
}