{
  "url": "https://www.wikihow.com/Invest",
  "title": "How to Invest",
  "steps": [
    {
      "title": "Open a money market account.",
      "content": "Open a money market account. Money market accounts are savings accounts that typically require a higher minimum balance, but pay a much higher interest rate. Often, this rate is in line with the current market interest rates. [1] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source Your money is typically fairly accessible, although the bank may place limits on how much you can withdraw and how often. A money market account shouldn't be used for your emergency fund. If you have an existing relationship with a bank, that may be a good place to open a money market account. However, you might also want to shop around for the best interest rate and minimum deposit requirements that meet your needs and your budget. Many credit card companies, such as Capital One and Discover, also offer money market accounts that you can start online."
    },
    {
      "title": "Hedge your investments with a certificate of deposit (CD) account.",
      "content": "Hedge your investments with a certificate of deposit (CD) account. A CD holds a set amount of your money for a set period of time. During that period of time, you can't access your money. At the end of the time period, you get your money back plus interest. [2] X Trustworthy Source Investor.gov Website maintained by the Securities and Exchange Commision’s Office of Investor Education and Advocacy providing free resources about investing. Go to source CDs are considered one of the safest options for saving and investing. The longer the term of the CD, the higher the interest rate typically will be. All FDIC-insured banks offer CDs with different terms and minimum deposits, so you can easily find one that suits your needs. Some online banks, such as Ally, offer CDs with no minimum deposit requirement. [3] X Research source When you open a CD account, read your disclosure statement carefully. Make sure you understand the interest rate, whether it is fixed or variable, and when the bank pays interest. Check the maturity date, and evaluate any penalties for early withdrawal."
    },
    {
      "title": "Pick stocks in companies and sectors you understand.",
      "content": "Pick stocks in companies and sectors you understand. As a beginning investor, you don't need a broker to start investing in the stock market. You can use a dividend reinvestment plan (DRIP) or direct stock purchase plan (DSPP) to bypass broker fees and commissions and purchase stock directly from the company. [4] X Research source As a beginner, you can start investing small amounts, even as little as $20 or $30 a month, using these direct plans. There is a list of companies that offer direct investing with no fees at https://www.directinvesting.com/search/no_fees_list.cfm . If you buy into companies that you already know and understand, your research will be fairly easy. You can recognize when the company is doing well, and you can tell what trends are going to work in the company's favor."
    },
    {
      "title": "Diversify your portfolio with a mutual fund.",
      "content": "Diversify your portfolio with a mutual fund. Mutual funds are a collection of stocks, bonds, or commodities that are bundled together and managed by a registered investment advisor. Because of their inherent diversification, they have a low risk and are appropriate for long-term investment. [5] X Research source In some cases, you may be able to buy shares directly from the fund. However, typically you'll go through a broker or financial advisor to buy shares in a mutual fund. Mutual funds are a relatively inexpensive way to diversify your portfolio when you're just starting out. You can get mutual fund shares far more cheaply than what you would pay for a piece of all the assets in the fund."
    },
    {
      "title": "Open a retirement account.",
      "content": "Open a retirement account. Retirement accounts allow you a tax-free way to save for retirement. The most common options are the 401(k) and the IRA. A 401(k) is set up through your employer, while you open an IRA individually. Many employers match your contributions to your 401(k), up to a certain amount. Aim to always contribute at least as much to your 401(k) as your employer will match, so you don't miss out on that free money. With a traditional IRA, you can contribute up to $5,500 yearly tax-free. You'll pay taxes when you withdraw money during retirement. You also have the option of a Roth IRA, which is not tax-free at the time you contribute. However, retirement withdrawals from a Roth IRA are tax free. All IRAs generate compound interest, which means the interest your money earns is re-invested into your account, generating still more interest. For example, if you make a one-time contribution of $5,000 to a Roth IRA when you are 20 years old, your account will be worth $160,000 when you retire at age 65 (assuming an 8 percent return) without you having to lift a finger."
    },
    {
      "title": "Buy bonds to generate steady income.",
      "content": "Buy bonds to generate steady income. Bonds are fixed rate securities. Essentially, a company or government borrows the face value of the bond and agrees to pay that money back with interest. This produces income for you regardless of what happens in the market. [6] X Research source For example, suppose Bella Bakery issues a 5-year bond worth $10,000 with a coupon (interest) rate of 3 percent. Ivan Investor buys the bond, giving his $10,000 to Bella Bakery. Every 6 months, Bella Bakery pays Ivan 3 percent of $10,000, or $300, for the privilege of using his money. After 5 years and 10 payments of $300, Ivan gets his $10,000 back. The face value of most bonds is at least $1,000, so you typically won't be able to move into the bond market until you have a little more money to invest. Series I Savings Bonds give interest plus hedge against inflation. You can buy direct from the government, online. [7] X Trustworthy Source Treasury Direct Website run by the U.S. Bureau of Fiscal Service that allows individuals to buy U.S. Treasury securities Go to source When interest rates are low, Series I bonds can give better rates than money market accounts or CDs and they're perfectly safe. They safeguard your investment against inflation."
    },
    {
      "title": "Use gold or silver to hedge against inflation.",
      "content": "Use gold or silver to hedge against inflation. Investing in precious metals provides permanence and stability for your portfolio. Since gold and silver tend to move in the opposite direction of the market, they can work as a hedge for your other investments. [8] X Research source Gold and silver prices tend to rise during times of uncertainty. Geopolitical events and instability play a role in this. At the same time, the stock market doesn't react well to uncertainty and instability, and may plummet. Precious metals aren't subject to tax, and can be stored and traded fairly easily. However, be prepared to spend a bit on secure storage if you decide to start buying physical quantities of gold and silver."
    },
    {
      "title": "Dive into real estate for longer-term investing.",
      "content": "Dive into real estate for longer-term investing. Your real estate investment can be active or passive. Active investment, such as trading properties or flipping houses, is more risky because property isn't particularly liquid. If you need to get rid of it, you may not be able to find a buyer. [9] X Research source Passive investment is less risky, and may be a good place to start real estate investment. A popular option is to buy shares in a real estate investment trust (REIT). Each share represents a diverse bundle of properties, kind of like a mutual fund for real property. You can purchase shares through a broker."
    },
    {
      "title": "Move into the currency market if you like a challenge.",
      "content": "Move into the currency market if you like a challenge. Forex , the international currency exchange market, is the largest financial market in the world. Currencies rise and fall in relation to each other, primarily based on the strength of each country's economy. To successfully trade currency, you need a strong understanding of geopolitical trends and events. Be prepared to read a lot of international news every day so you can spot opportunities. It's usually smart to focus on one or two currencies so you can thoroughly research those countries' economies and keep up with the latest news."
    },
    {
      "title": "Trade options to limit your exposure.",
      "content": "Trade options to limit your exposure. An option is a contract that gives you the right to buy or sell an asset at a certain price at a set point in the future. Since you don't have the obligation to buy or sell at that point, your potential losses are limited to the price you paid for the contract. [10] X Research source To trade options, open a brokerage account, either online or with a traditional broker. The brokerage firm will set limits on your trading ability, based on your experience investing and the amount of money you have in your account."
    },
    {
      "title": "Practice hedging to lower your risk.",
      "content": "Practice hedging to lower your risk. If you get into riskier investments, a solid hedging strategy will help protect your portfolio. The basic concept of hedging is to offset a possible loss in one security by simultaneously investing in another security that is likely to move in the opposite direction. [11] X Research source Most passive investors, who are simply investing for retirement or a long-term goal (such as money for their kids' college), have no use for hedging. However, if you're making aggressive or risky investment choices, hedging can provide a sort of insurance that lessens the impact of losses, particularly from short-term market fluctuations. A financial planner or advisor is essential if you start to move into more aggressive, shorter-term investment strategies. They will help design your hedging strategy and make sure the bulk of your portfolio is protected."
    },
    {
      "title": "Diversify your portfolio with commodities.",
      "content": "Diversify your portfolio with commodities. Commodities can be used to hedge against risk, because they tend to behave differently than stock markets and currencies. However, they are risky because they respond to a variety of different factors, many of which are completely outside of human control. [12] X Research source There are hard commodities, including precious metals, and soft commodities, such as wheat, sugar, or coffee. You can invest in commodities in 3 different ways: physically buying the commodity itself, buying shares in a commodity company, or buying futures contracts. You can also invest in commodities more passively through investment funds. Exchange-traded funds (ETFs) may have shares in commodity companies, or may track a commodity index."
    },
    {
      "title": "Build up an emergency fund.",
      "content": "Build up an emergency fund . Set aside 3 to 6 months worth of living expenses so you're covered if disaster strikes. This money should be easily accessible, but separate from any of your investment accounts. [13] X Research source Keep your emergency fund in a savings account (that way it will earn at least a little interest) separate from your main checking account. Get a debit card specifically for your emergency fund so you can access the money quickly when you need it. Avoid investing with money that you may need in the near future in case of an emergency. [14] X Expert Source Priya Malani Financial Advisor Expert Interview. 23 March 2020."
    },
    {
      "title": "Pay off high-interest debt.",
      "content": "Pay off high-interest debt. Any interest you earn from investing will typically be less than 10 percent. If you have credit cards or personal loans with an interest rate greater than that, you'll eat up all your investment earnings trying to get out of debt. [15] X Research source For example, suppose you have $4,000 to invest, but you also have $4,000 in credit card debt at 14 percent interest. Even if you realized a 12 percent return on your investments, you'll only make $480. Since your credit card company charged you $560 in interest during that time, you're still $80 in the hole, despite your smart investment strategies. Not all debt is created equal. You don't necessarily have to pay off your mortgage or your student loans before you start investing. These typically carry lower interest rates and can ultimately save you money if you deduct the interest on your taxes."
    },
    {
      "title": "Write down your investment goals.",
      "content": "Write down your investment goals. Your investment goals determine your investment strategy. If you don't know how much money you want to make, and how soon you're going to need it, you can't be sure you've chosen the right strategy. [16] X Research source You'll likely have short-, mid-, and long-term goals. Decide how much money you'll need for each, and how long you have to make that money. Defining your goals also helps you choose your investment vehicles. With some investment accounts, such as a 401k, you are penalized if you withdraw funds early. You wouldn't want to use that sort of account for a short-term goal because you wouldn't have easy access to the money."
    },
    {
      "title": "Consult a financial planner.",
      "content": "Consult a financial planner. You don't necessarily need a financial planner to invest. However, someone who knows market trends and studies investment strategy can be a good person to have on your team – especially if you're just starting out. [17] X Research source Even if you decide not to stay with a planner or advisor in the long term, they can still provide you with tools to get you started on the right path. Bring your list of goals and discuss them. A financial planner can provide you with options that will help you meet those goals as efficiently as possible."
    }
  ]
}