{
  "url": "https://www.wikihow.com/Make-Your-Hair-Look-Short",
  "title": "How to Make Your Hair Look Short",
  "steps": [
    {
      "title": "Put your hair up in a ponytail or bun.",
      "content": "Put your hair up in a ponytail or bun. Let the shorter layers of your hair hang loose, creating a \"short\" look, while the bulk of your longer hair is pulled back and out of the way. From the front, it will look like you have a shorter cut. The ponytail can either be left as it is or rolled up and pinned against the back of your head. [1] X Research source Putting your hair in a bun is also a great way to disguise length. If all your hair is wrapped up, nobody will know how long it is. [2] X Research source You can also just tie long hair into a half-bun, leaving some strands hanging loose. Sweep the extra loose hair onto your shoulders and out of the way. [3] X Research source This usually looks best if you have a layered cut to begin with. Talk to your stylist about a layered cut if necessary. [4] X Research source"
    },
    {
      "title": "Braid your hair.",
      "content": "Braid your hair. If you braid the hair tightly, it will appear shorter than if it was just hanging down your back. There are a variety of styles of braids such as the regular three-strand braid, fish braid and French braid. If you're going for a looser look but want it to still seem shorter, leave some pieces out in the front near your face. [5] X Research source If you have protective braids, like micro braids, you can make your hair appear even shorter by styling these braids in ponytails, buns, and more."
    },
    {
      "title": "Roll your hair under.",
      "content": "Roll your hair under. Place a headband around your head with the back of the band pushed down near the top of your neck. Starting just behind the ear, roll your hair under and tuck your hair into the band. Secure it with a few bobby pins. Keep tucking until you reach the other ear. Use hairspray to hold it in place. [6] X Research source"
    },
    {
      "title": "Curl your hair.",
      "content": "Curl your hair. Try curling your hair with foam rollers, bobby pins, fabric, or whatever tools you want to use. Do it while the hair is wet and use conditioner, setting lotion, hair spray or any other hair products that set and hold curls. If you can, let your curls set in rollers overnight so your hair completely dries without the use of your hair dryer. [7] X Research source If you want really short, bouncy curls, let your hair dry naturally. When you let your hair air dry, it dries at a slower rate and your finished hairstyle turns out with much more defined curls that have a tighter hold, which makes your hair look shorter."
    },
    {
      "title": "Pin your hair under with bobby pins.",
      "content": "Pin your hair under with bobby pins. Part your hair from ear to ear in a headband shape. Keep the parts about 1 centimeter (0.4 in) wide. Use an elastic band to keep each part out the way. Split the rest of your hair into four or five sections. Bring the first section up so that it drapes over your face. Bobby pin it, then flip it back over to your shoulders and bobby pin it. [8] X Research source Repeat with the rest of the sections. Part the \"headband\" you started with, then pin it back over your head over the bobby pins. Try to hide them and bobby pin the cover piece in place."
    },
    {
      "title": "Clip your hair under.",
      "content": "Clip your hair under. If you have layered hair, clip the bottom of your hair like as in the \"bobby pin method.\" Roll the longest layers, then clip them at the base of your neck so that they appear shorter. Then let the top layers of hair cascade over the bottom. It will appear as if your top layers are your longest layers."
    },
    {
      "title": "Curl your hair.",
      "content": "Curl your hair. Curling your hair will give your hair texture, which will be very helpful in making your hair look shorter. Curling your hair also will make the bob appear more realistic because people will be less able to tell it's a faux-bob. Curl your hair however you like. [9] X Research source Use a curling iron. Sleep in rollers or use steam rollers. Or, use a setting lotion spray and set the hair on rollers. Then, let it dry naturally overnight for a deeper hold. [10] X Research source"
    },
    {
      "title": "Divide your hair from ear-to-ear.",
      "content": "Divide your hair from ear-to-ear. You want to create a top layer and an underlayer. Wrap the top layer (the hair above your ears) into a ponytail while you work on the underlayer. Leave the underlayer out to shorten into faux-bob. [11] X Research source"
    },
    {
      "title": "Divide your underlayer into three sections.",
      "content": "Divide your underlayer into three sections. They don't have to be perfect or even, but you want a section of hair from the left side of your head and some from the right. Leave some hair in between the right and left sections on the back of your head. Separate the three sections with a clip."
    },
    {
      "title": "Tease out each section of hair.",
      "content": "Tease out each section of hair. Teasing your hair will give it extra texture and lift,making it easier for you to pull off this faux bob style. Grab one of the three sections of your hair and tease it. Place the comb a few inches away from the scalp and start back combing the hair by pushing it up toward the roots. This will bunch the hair up at the scalp. (It will look messy kind of like a bird’s nest.)Then do the same for the other two sections."
    },
    {
      "title": "Braid each section.",
      "content": "Braid each section. For this step you will need hair-ties. Braid each individual section of hair with a regular three-strand braid. Do not start braiding your hair from the scalp, but braid your hair about an inch or two down from the scalp. When you're done braiding, secure each braid with a hair tie. Lightly pull the strands of your braid to get ready to pin them in place."
    },
    {
      "title": "Pin the braids up in place using bobby pins.",
      "content": "Pin the braids up in place using bobby pins. Grab the bottom part of one of your braids and bobby pin it up under to the base of your head. Make sure the bobby pin is secure, then do the same to the other two braids."
    },
    {
      "title": "Let the top layer of your hair out.",
      "content": "Let the top layer of your hair out. The top layer should be shorter than the rest. Make sure the bottom layer is completely hidden by the top then curl or straighten the hair as desired. Be careful not to way down the top layer with too much product or your hair will look flat and greasy. Lift up the roots by teasing them slightly for added volume at the crown, which is a common look with a bob."
    },
    {
      "title": "Wear a stylish hat.",
      "content": "Wear a stylish hat. Put your hair in a ponytail at the base of your neck, then loop the ends of your hair around each other to form a bun. Tuck your hair under a stylish summer hat, or a knitted cap in the wintertime. You'll need to smooth out the hair to make it even across the entire neckline. Grab any stray hairs and tuck them up and under as well."
    },
    {
      "title": "Get a layered haircut.",
      "content": "Get a layered haircut. Ask your hairdresser if he or she can do something with your haircut to make your hair look shorter, without actually cutting the longest layers. Layers can be very effective in styling your hair to look shorter, even if it's long. If none of these styles suit you, consider just letting your hairdresser cut your hair. Even if you're nervous about a short cut, the great thing about hair is that it always grows back. [12] X Research source"
    },
    {
      "title": "Wear a short wig.",
      "content": "Wear a short wig. If you love your natural hair, it's easy to find a wig in a short style that suits your face and matches your hair color. Make sure to get a high-quality wig made of human hair. Synthetic wigs burn easily when you style them with hot tools, and they don’t last as long. A poor quality wig will often look tacky, unkempt or fake, and it can cause minor skin problems on people with sensitive skin. Synthetic wigs are usually harder to care for and groom. Each wig should come with instructions on how to wear them and ensure they stay in place. Some require glue to secure them, while others have clips that clip on to your hair at the roots. In any case, ensure that your natural hair is pinned securely and flat on your head. Wear a wig cap if necessary. [13] X Research source Don't forget that some wigs are not waterproof. Check the label for care instructions. Overall remember to have fun with your hair and all the different styles you can wear it."
    }
  ]
}