{
  "url": "https://www.wikihow.com/Make-a-Minecraft-Server-With-Hamachi",
  "title": "How to Make a Minecraft Server With Hamachi",
  "steps": [
    {
      "title": "Download Hamachi.",
      "content": "Download Hamachi. Go to https://www.vpn.net/ in your computer's web browser, then click the green Download now button in the middle of the page. The Hamachi setup file will download onto your computer. If you're on a Mac and VPN.net prompts a Windows file to download, click the Mac link below the Download now button to force the Mac version to download. [4] X Research source"
    },
    {
      "title": "Install Hamachi.",
      "content": "Install Hamachi. Once you've downloaded Hamachi, install it according to your operating system: Windows — Double-click the Hamachi setup file, select a language and click Next , check the \"I have read\" box and click Next , click Next , and click Install . Click Yes if prompted at any point in the installation, then click Finish when prompted. Mac — Open the ZIP folder, double-click the extracted Hamachi setup file, click Open , verify the download if necessary, check the \"I have read\" box, and click Install . Enter your password if prompted, then click Finish when prompted. [5] X Research source"
    },
    {
      "title": "Download the Minecraft server file.",
      "content": "Download the Minecraft server file. Go to https://www.minecraft.net/en-us/download/server in your computer's web browser, then click the minecraft_server.1.15.2.jar link in the middle of the page. This will prompt the Minecraft Java server file to download onto your computer."
    },
    {
      "title": "Create a folder on your desktop.",
      "content": "Create a folder on your desktop. This is the folder in which you'll place and run your Minecraft server. To create an empty folder, do the following: Windows — Right-click the desktop, select New , click Folder , type in Minecraft Server , and press ↵ Enter . Mac — Click File , click New Folder , type in Minecraft Server , and press ⏎ Return ."
    },
    {
      "title": "Place the Minecraft server file in the folder.",
      "content": "Place the Minecraft server file in the folder. Click and drag the downloaded Minecraft server file onto the new folder's icon, then release it there. [6] X Research source You can also copy it by clicking the server file, pressing Ctrl + C (Windows) or ⌘ Command + C (Mac), opening the new folder, and pressing Ctrl + V or ⌘ Command + V ."
    },
    {
      "title": "Make sure that you have the latest version of both Minecraft and Java.",
      "content": "Make sure that you have the latest version of both Minecraft and Java. The easiest way to do this for Minecraft is by double-clicking the Minecraft launcher and waiting for it to update itself if necessary. For Java , open Internet Explorer, go to https://www.java.com/en/download/uninstalltool.jsp , click Agree and Continue , and follow any on-screen prompts. If nothing happens, your Java is up-to-date. Since most modern browsers don't support Java, using Internet Explorer is the best way to ensure you don't run into any errors."
    },
    {
      "title": "Open the Minecraft server folder.",
      "content": "Open the Minecraft server folder. Double-click the folder to do so."
    },
    {
      "title": "Double-click the server file.",
      "content": "Double-click the server file. Doing so will prompt the server files to begin unpacking inside of the folder. Make sure you double-click the server launch file, which resembles a gear on a white background, rather than the text document."
    },
    {
      "title": "Agree to the Minecraft server terms of use.",
      "content": "Agree to the Minecraft server terms of use. Once the \"eula\" file appears, double-click it to open it in Notepad , then delete false from the \"eula=false\" line and type in true . You can then press Ctrl + S to save the changes and exit Notepad. The edited \"eula\" file should now read \"eula=true\" instead of \"eula=false\""
    },
    {
      "title": "Double-click the server file again.",
      "content": "Double-click the server file again. This will prompt the server to resume unpacking."
    },
    {
      "title": "Close the \"Minecraft server\" window when it finishes loading.",
      "content": "Close the \"Minecraft server\" window when it finishes loading. Once you see \"Done\" in the line of text at the bottom of the window, click the X in the top-right corner of the window. At this point, you're free to configure Hamachi ."
    },
    {
      "title": "Make sure that you have the latest version of both Minecraft and Java.",
      "content": "Make sure that you have the latest version of both Minecraft and Java. The easiest way to do this for Minecraft is by double-clicking the Minecraft launcher and waiting for it to update itself if necessary. As of June 2018, the latest version of Java is version 8 Update 251. You can download it from Java's website by going to https://www.java.com/en/download/ and clicking the Free Java Download button."
    },
    {
      "title": "Double-click the Minecraft server file.",
      "content": "Double-click the Minecraft server file. This will cause it to begin unpacking inside of your new folder."
    },
    {
      "title": "Agree to the Minecraft server terms of use.",
      "content": "Agree to the Minecraft server terms of use. Once the \"eula\" file appears, double-click it to open it in TextEdit, then delete false from the \"eula=false\" line and type in true . You can then press ⌘ Command + S to save the changes and exit TextEdit. The edited \"eula\" file should now read \"eula=true\" instead of \"eula=false\""
    },
    {
      "title": "Double-click the Minecraft server file again.",
      "content": "Double-click the Minecraft server file again. It will resume unpacking files inside of the folder."
    },
    {
      "title": "Close the \"Minecraft server\" window when it finishes loading.",
      "content": "Close the \"Minecraft server\" window when it finishes loading. Once you see \"Done\" in the line of text at the bottom of the window, you can click the red circle in the top-left corner of the window to close it. At this point, you're free to configure Hamachi ."
    },
    {
      "title": "Open Hamachi.",
      "content": "Open Hamachi. Open Start (Windows) or Spotlight (Mac), type in hamachi , and click or double-click LogMeIn Hamachi in the search results. On a Mac, Network is a menu item at the top of the screen."
    },
    {
      "title": "Click the \"Power\" icon.",
      "content": "Click the \"Power\" icon. This is at the top of the Hamachi window. Doing so will turn on Hamachi and prompt a login window to appear."
    },
    {
      "title": "Sign up for Hamachi.",
      "content": "Sign up for Hamachi. Click the Sign up link in the upper-right corner of the window, then enter your email in the \"email\" text box, type a password into the \"password\" text box, re-type your password into the \"retype password\" box, and click Create account ."
    },
    {
      "title": "Click the Network tab.",
      "content": "Click the Network tab. It's at the top of the Hamachi window. A drop-down menu will appear."
    },
    {
      "title": "Click Create a new network….",
      "content": "Click Create a new network… . It's in the drop-down menu. Doing so prompts a pop-up window to appear."
    },
    {
      "title": "Enter a name for your server.",
      "content": "Enter a name for your server. In the \"Network ID\" text box, type in whatever you want to name your server. If you select a server name which has already been used, Hamachi will alert you that the name is already taken."
    },
    {
      "title": "Enter a password for your server.",
      "content": "Enter a password for your server. Type your preferred server password into the \"Password\" text box, then re-type the password into the \"Confirm password\" text box."
    },
    {
      "title": "Click Create.",
      "content": "Click Create . It's at the bottom of the window. This will create your server."
    },
    {
      "title": "Paste your Hamachi IP address into your server folder.",
      "content": "Paste your Hamachi IP address into your server folder. This is how the server will know to use Hamachi: Right-click (or Control -click) the IP address at the top of the Hamachi window. Click Copy IPv4 address Rename the \"server.properties\" text file in your Minecraft server folder to \"serverproperties\". Double-click the \"serverproperties\" file, then confirm or click your computer's text-editing app. Click to the right of the \"server-ip=\" text line. Press Ctrl + V (Windows) or ⌘ Command + V (Mac). Save the file by pressing Ctrl + S or ⌘ Command + S , then exit the text editor."
    },
    {
      "title": "Go online.",
      "content": "Go online. Right-click (or Control -click) the server name, then click Go online in the drop-down menu. If you see Go offline in the drop-down menu, your server is already online."
    },
    {
      "title": "Have your friends join your server.",
      "content": "Have your friends join your server. If you want to have some people join your server, they will have to download and install Hamachi before doing the following: Open Hamachi. Click Network Click Join existing network... Enter the server's name and password in the \"Network ID\" and \"Password\" text fields, respectively. Click Join"
    },
    {
      "title": "Run the server file.",
      "content": "Run the server file. Double-click the Java server file in your Minecraft Server file. This will open the server file's command window. You'll also want to ensure that your Hamachi server is running before proceeding. To give yourself moderator privileges, type /op username (where \"username\" is your Minecraft username) into the text field at the bottom of the server run window and press ↵ Enter ."
    },
    {
      "title": "Open Minecraft.",
      "content": "Open Minecraft. Open the Minecraft launcher by double-clicking or clicking the grass block-shaped Minecraft app icon, then click PLAY at the bottom of the window."
    },
    {
      "title": "Click Multiplayer.",
      "content": "Click Multiplayer . It's in the middle of the main menu."
    },
    {
      "title": "Click Add Server.",
      "content": "Click Add Server . You'll find this option at the bottom of the window."
    },
    {
      "title": "Enter your server's name.",
      "content": "Enter your server's name. In the \"Server Name\" text box, type in the name of the server as it appears in Hamachi."
    },
    {
      "title": "Paste in your server's address.",
      "content": "Paste in your server's address. Click the \"Server Address\" text box, then press either Ctrl + V (Windows) or ⌘ Command + V (Mac). You should see the IPv4 address you copied earlier appear here."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . It's at the bottom of the window. This will prompt Minecraft to begin searching for your server."
    },
    {
      "title": "Select your server.",
      "content": "Select your server. Once your server appears in the search results, click its name once to select it."
    },
    {
      "title": "Click Join Server.",
      "content": "Click Join Server . This option is at the bottom of the window."
    },
    {
      "title": "Wait for the server to load.",
      "content": "Wait for the server to load. Once the server finishes loading, you'll be placed as a player in the world, at which point you can begin playing as you normally would. You may be prompted to enter a password before your world finishes loading. If so, type in the password you used to create your server when you configured Hamachi."
    }
  ]
}