{
  "url": "https://www.wikihow.com/Make-Basic-Biscuits",
  "title": "How to Make English Biscuits: Step-by-Step Guide",
  "steps": [
    {
      "title": "Preheat your oven to 190*c.",
      "content": "Preheat your oven to 190*c."
    },
    {
      "title": "Mix the butter and sugar in a bowl.",
      "content": "Mix the butter and sugar in a bowl. Do this until the mixture is light and fluffy."
    },
    {
      "title": "Crack your egg into your mix and slowly begin to beat it in, making sure it is all mixed together.",
      "content": "Crack your egg into your mix and slowly begin to beat it in, making sure it is all mixed together."
    },
    {
      "title": "Add in the flour using a sieve.",
      "content": "Add in the flour using a sieve. Place the sieve above the bowl and hold in place while you shake the flour through it, removing any lumps. Alternatively to plain flour you could use self-rinsing flour or white Lilly flour."
    },
    {
      "title": "Mix the flour into the paste.",
      "content": "Mix the flour into the paste. Slowly but surely your mix will become a dough. Add more flour if the mix is too soggy. Your mix should be a dough."
    },
    {
      "title": "Dust the worktop with flour, so that when you roll the dough it doesn't stick.",
      "content": "Dust the worktop with flour, so that when you roll the dough it doesn't stick."
    },
    {
      "title": "Flour the rolling pin and then place the dough on the worktop.",
      "content": "Flour the rolling pin and then place the dough on the worktop. Begin to roll the dough until it's as thick as cardboard. Once rolled out, begin to cut out the circles. Any left over dough can be reclustered to repeat the procedure."
    },
    {
      "title": "Grease your cooking tray with butter and place the biscuits on top.",
      "content": "Grease your cooking tray with butter and place the biscuits on top."
    },
    {
      "title": "Cook the biscuits for 15min-25min.",
      "content": "Cook the biscuits for 15min-25min."
    },
    {
      "title": "Let the biscuits cool off before adding any kind of decoration.",
      "content": "Let the biscuits cool off before adding any kind of decoration."
    }
  ]
}