{
  "url": "https://www.wikihow.com/Make-Matar-Paneer",
  "title": "How to Make Matar Paneer",
  "steps": [
    {
      "title": "Combine all the ingredients for the masala paste in a bowl.",
      "content": "Combine all the ingredients for the masala paste in a bowl. Grind together - there is no need to add water. Grind until not even a small piece of cashew is left."
    },
    {
      "title": "Heat the oil in a pan.",
      "content": "Heat the oil in a pan. Add cumin seeds and cook them until they splutter."
    },
    {
      "title": "Add the masala paste to the pan.",
      "content": "Add the masala paste to the pan. Be careful while sauteing as it will splutter. If it splutters a lot, cover it partly with a pan lid. Mix it in. Saute for 15 minutes on a low flame."
    },
    {
      "title": "Add all the spice powders, turmeric, red chili, and garam masala to the pan.",
      "content": "Add all the spice powders, turmeric, red chili, and garam masala to the pan. Mix them in."
    },
    {
      "title": "Add the cream and mix it in.",
      "content": "Add the cream and mix it in. Saute well."
    },
    {
      "title": "Add the peas next and mix them in.",
      "content": "Add the peas next and mix them in. Saute well until they become soft."
    },
    {
      "title": "Add water and salt and transfer the mixture to a pressure cooker.",
      "content": "Add water and salt and transfer the mixture to a pressure cooker. Cook for about 2 to 3 whistles. When the pressure drops on its own, open the lid. If it appears thin, simmer to thicken it until it approaches the desired consistency. If it appears too thick, add water, then simmer."
    },
    {
      "title": "Add the paneer cubes.",
      "content": "Add the paneer cubes. Cook till they are soft - don't overcook them as they can become hard."
    },
    {
      "title": "Garnish the completed dish with coriander.",
      "content": "Garnish the completed dish with coriander. Serve hot with chappatis, rice, or naan bread."
    }
  ]
}