{
  "url": "https://www.wikihow.com/Make-Edible-Slime",
  "title": "How to Make Edible Slime",
  "steps": [
    {
      "title": "Combine the sweetened condensed milk, sugar, and cornstarch.",
      "content": "Combine the sweetened condensed milk, sugar, and cornstarch. Open a 14 ounce (396 g) can of sweetened condensed milk and spoon it into a small saucepan. Stir in 1 tablespoon (12 g) of cornstarch and 2 tablespoons (25 g) of sugar."
    },
    {
      "title": "Stir and cook the slime for 10 to 15 minutes.",
      "content": "Stir and cook the slime for 10 to 15 minutes. Turn the burner to medium-high and stir the slime constantly as it cooks. It should thicken slightly and become stretchy once it's cooked long enough. Keep in mind that the longer you cook the slime, the closer to playdough it will become. Cook it less for a wetter slime."
    },
    {
      "title": "Mix in food coloring if desired.",
      "content": "Mix in food coloring if desired. If you want to make your edible slime a fun color, stir in about 10 drops of your choice of food coloring. Mix the food coloring until it's completely distributed through the slime."
    },
    {
      "title": "Cool the slime completely before using it.",
      "content": "Cool the slime completely before using it. Turn off the burner and let the slime come to room temperature before you scoop it onto a play surface. The slime may thicken a little as it cools."
    },
    {
      "title": "Refrigerate the slime for up to 5 days.",
      "content": "Refrigerate the slime for up to 5 days. Once you've finished playing with the sweetened condensed milk slime, put it in an airtight container or resealable plastic bag. Store the slime in the refrigerator and use it within 5 days. The slime will begin to toughen and become hard the longer it's stored."
    },
    {
      "title": "Put the mini-marshmallows and oil in a bowl.",
      "content": "Put the mini-marshmallows and oil in a bowl. Measure 1 cup (50 g) of mini-marshmallows into a microwave-safe bowl. Pour 2 tablespoons (30 ml) of vegetable or liquid coconut oil over the marshmallows. [1] X Research source"
    },
    {
      "title": "Microwave the marshmallows for 10 seconds at a time until they melt.",
      "content": "Microwave the marshmallows for 10 seconds at a time until they melt. Put the bowl with the oiled marshmallows into the microwave. Heat the marshmallows for 10 seconds and then stir the marshmallows. Keep heating the marshmallows for 10 seconds at a time until the marshmallows are sticky and melted. [2] X Research source Use caution when stirring the hot marshmallows."
    },
    {
      "title": "Stir 4 to 5 drops of food coloring into the marshmallows.",
      "content": "Stir 4 to 5 drops of food coloring into the marshmallows. If you'd like to tint the edible slime a color, add 4 to 5 drops of food coloring to the bowl. Stir the sticky marshmallows until the color is completely mixed in. [3] X Research source Add more food coloring if you want a brighter colored slime."
    },
    {
      "title": "Combine the powdered sugar and cornstarch on a plate.",
      "content": "Combine the powdered sugar and cornstarch on a plate. Set a large plate on the counter and put 2 tablespoons (16 g) of powdered sugar and 2 tablespoons (25 g) of cornstarch on it. Mix them together with a spoon. [4] X Research source"
    },
    {
      "title": "Transfer the marshmallows to the plate and mix it.",
      "content": "Transfer the marshmallows to the plate and mix it. Scoop the marshmallows onto the cornstarch and powdered sugar mixture on the plate. Once the marshmallows are cool enough to touch, use your hands to knead the slime until it's easy to handle. [5] X Research source"
    },
    {
      "title": "Mix in sprinkles, if desired.",
      "content": "Mix in sprinkles, if desired. If you'd like to make even more colorful slime, mix 1 tablespoon (10 g) of sprinkles into the marshmallow slime. [6] X Research source"
    },
    {
      "title": "Use and store the marshmallow slime for up 5 days.",
      "content": "Use and store the marshmallow slime for up 5 days. Play with your edible slime and store it in an airtight container or bag in the refrigerator. Use it within 5 days or it will become too hard to play with. [7] X Research source"
    },
    {
      "title": "Microwave the gummy bears for 30 seconds.",
      "content": "Microwave the gummy bears for 30 seconds. Put 1 cup (200 g) of gummy bears into a microwave-safe bowl and heat them for 30 seconds. [8] X Research source If you want your slime to be a bright color, use gummy bears that are the same color instead of a variety."
    },
    {
      "title": "Stir and microwave the gummy bears for 10 second intervals.",
      "content": "Stir and microwave the gummy bears for 10 second intervals. Carefully stir the hot gummy bears and heat them for another 10 seconds if they haven't melted. Continue to stir and heat the gummy bears for 10 second intervals until they're smooth. Stirring will also help the melted gummy bears cool once they've melted."
    },
    {
      "title": "Mix the cornstarch and powdered sugar on a plate.",
      "content": "Mix the cornstarch and powdered sugar on a plate. Measure 2 tablespoons (25 g) of cornstarch and 1 tablespoon (8 g) of powdered sugar onto a large plate. Mix them until they're combined and set aside half of the mixture."
    },
    {
      "title": "Pour the melted gummy bears onto the plate and let it cool.",
      "content": "Pour the melted gummy bears onto the plate and let it cool. Leave the gummy bear mixture until it's cool enough to touch."
    },
    {
      "title": "Mix the gummy mixture into the cornstarch and powdered sugar.",
      "content": "Mix the gummy mixture into the cornstarch and powdered sugar. Use your hands to knead the gummy bears into the dry ingredients. The slime won't be as sticky once you incorporate the dry ingredients. Knead in the rest of the reserved powdered sugar and cornstarch."
    },
    {
      "title": "Knead 1⁄2 tablespoon (7.4 ml) of vegetable or coconut oil into the slime.",
      "content": "Knead 1 ⁄ 2 tablespoon (7.4 ml) of vegetable or coconut oil into the slime. Pour the oil onto the gummy slime and use your hands to mix it in. You should notice the slime become stretchier."
    },
    {
      "title": "Play with the gummy bear slime.",
      "content": "Play with the gummy bear slime. As soon as the slime is as gooey as you like, you can play with it. If it starts to harden, stick it in the microwave and heat it for 10 to 30 seconds. Avoid reheating the slime more than once and don't store it because it will harden very quickly."
    }
  ]
}