{
  "url": "https://www.wikihow.com/Get-Your-Ex-Girlfriend-Back",
  "title": "How to Get Your Ex Girlfriend Back",
  "steps": [
    {
      "title": "Get your life back on track",
      "content": "Get your life back on track . So you've been in a relationship for some time, and maybe your girlfriend has just broken it off. It's a sad and lonely time for you right now, but focus on the things you can change about yourself before you move back on to her. Girls want to see self-improvement from guys. Maybe your girlfriend complained about something you did while you two were in your relationship. Maybe there's something that you know you can improve simply because it will make you a better person. Well, now's the time to strike. Cut your video game playing down to a reasonable time, if that's what she wants, or start wearing cleaner clothes when you're around her. If you focus on being a better person while apart, you can go back to her with the \"evidence\" that you're a new guy. Recover emotionally. You don't stand a chance of getting your ex back if you're not emotionally calm and controlled. [1] X Research source Women dislike needy, clingy, desperate men - so you need to pull your own life together before attempting to draw her back into it. Like it or not, showing her that you can deal with life on your own will attract her back to you. That's because girls like men who are self-sufficient and independent. So go out to the gym, visit the movies with friends, or start an adventure. If you're having a great time, she'll want to be there with you. Get some new clothes. New times call for new duds. It's a subtle change in you, but the importance will be clear to her: your new outer shell will signal deeper changes underneath. Get that new shirt that you've been wanting to buy, or those new pair of jeans. Looking sharp is an important aspect of physical attraction, and if she sees you looking great in unfamiliar clothes, she'll sense that there's been forward movement, if not wholesale change."
    },
    {
      "title": "Get the right attitude.",
      "content": "Get the right attitude. Getting your ex-girlfriend back starts with finding the right attitude . Girls, for the most part, want to see mature [2] X Research source , independent guys who like to have fun and know what they're good at. We know that's a lot to work, so start small if you're feeling overwhelmed. Stop being jealous . Being jealous will get you nowhere. Jealousy is associated with fear and anxiety [3] X Research source , two unattractive traits to have. Plus, what you're non-verbally telling her is that you want to control her. No one wants to be controlled. So learn to fight your jealousy if you can, and focus on being non-threatening. You'll get more bees with honey than you will with vinegar. Act like nothing's wrong. Even if your guts are tumbling like clothes in a washing machine, try not to let her know. She's probably not going to want you back if you're acting depressed, mopey, or sulky. Make sure you're laughing and genuinely trying to have a good time. You might find that you've become a happier person along the way. If you are feeling depressed, surround yourself with friends or family. Don't wait alone in a corner and just hope for her to come back to you. Develop a playful sense of humor . What do girls say they look for most in guys? A sense of humor and a playful attitude These two traits are attractive because they tell other people that we're youthful and not aggressive. So learn a few jokes if you can (friends are always good to try them out on) and keep the ones that work and throw away the ones that don't. Learn to make fun of yourself a little, in a confident way — not a mopey way. And, for goodness sake, be playful , especially when you're around her. Tease her lovingly, or play a small prank on a friend. You'll notice the difference in her."
    },
    {
      "title": "Leave her alone.",
      "content": "Leave her alone. At least for a little while, give her some time to think about the relationship. If you had a great relationship, she'll think about all the good things that you did for her and feel the absence of you in her life. [4] X Expert Source Michele Fields Matchmaker & Dating Coach Expert Interview. 17 August 2021. Cut off all communication. Maybe you don't talk to her for a couple weeks, or perhaps a month. This is tough and it will hurt, but really it's killing her more. This will also let your tempers cool down if things were heating right when you broke up. It's a good idea to always move slowly. If no one cheated or there was no abuse, things probably can be worked out. [5] X Expert Source Michele Fields Matchmaker & Dating Coach Expert Interview. 17 August 2021. You need to give her space for three reasons: 1) People simply need space; if you can't give her any space, maybe that's something you can work on to show her that you've changed. 2) She'll get an opportunity to realize how good you are; not that she doesn't know this already, but she may not feel it in her bones. 3) You'll show her how independent you are on your own; the \"rebel\" is so attractive to women because he's totally on his own and doesn't need other people. [6] X Research source That said, be a friend and keep in touch regularly so you don't leave her mind. [7] X Expert Source Michele Fields Matchmaker & Dating Coach Expert Interview. 17 August 2021."
    },
    {
      "title": "Start talking to another girl.",
      "content": "Start talking to another girl. Don't do anything with her, but strike up a friendship. You want to raise your own stock by showing her that other girls like you and are attracted to you. Don't get this step confused with pursuing another girl. You want to hang out and talk, do fun things together, but not hook up. If you hook up with another girl, your chances of getting back together with your ex are greatly diminished. Go out with a group of girls. Show your ex that attentive girls like being around you. These girls will be your wing-women. If you can pull together a big group of popular, intelligent, smart girls, chances are your ex is going to feel more interested, maybe without even noticing it."
    },
    {
      "title": "Tap your inner alpha male.",
      "content": "Tap your inner alpha male. The alpha male, in nature, is the male in a group of primates that has the highest rank, and gets his pick of the females. [8] X Research source Most girls are attracted to the alpha male for deep biological reasons: They believe he can provide for them better, protect them better, and give her biologically fit children. Even if you don't think that alpha males are your ex's type, subtle changes might work on her: pump out your chest a bit, make an effort to work out your arms and thighs , and project strength."
    },
    {
      "title": "Give her an apology",
      "content": "Give her an apology . Whether you broke up with her, or she broke up with you, an apology is almost always in order. An apology shows her that you're capable of swallowing your ego, and that you care enough to tell her you were wrong. If done correctly, an apology will work wonders. Send her flowers. Girls love flowers, for reasons men still don't know. They die after a week, and they just sit around gathering dust. Well, odds are your ex probably loves them, because they smell pretty and look good and she gets to show them to her friend and brag about how much someone cares for her. You want to be that someone. Send her a letter. Girls also love letters, because they take a lot of time and you have to express your feelings. Start off by saying something like: \"I know this letter doesn't fix what's broken between us, and maybe it never will. But I want you to know that I care deeply about you, and I always will. That part has never changed. The part that's changed is that I realize how stupid I was to let you go.\" Tell her in person, asking directly without playing games. [9] X Expert Source Michele Fields Matchmaker & Dating Coach Expert Interview. 17 August 2021. Set a time to meet in a public place, or a place that you know she'll feel comfortable in. When the time is right, say: \"I know I made some mistakes during our relationship, and I wanted to take full responsibility for those. I shouldn't have done [whatever it is you did] to you, and I feel horrible now. But the biggest mistake I made was losing you. I don't expect anything from you, I just want you to know that.\""
    },
    {
      "title": "Slowly work up to friendship.",
      "content": "Slowly work up to friendship. Maybe some trust was broken in your relationship, and now it's time for you to start repairing it. Trust for girls is a big thing. You want to show her that she can trust you again , that you are worthy of her trust. Do something nice for her without expecting her to pay you back. If she's studying late for an exam, pop by with her favorite tea or coffee and let her know that you know she's going to kill it tomorrow. If one of her friends gets in an accident, stop by and pay your respects (the friend will definitely let your ex know you stopped by). If your ex mentions she wanted to see a movie, buy her two tickets for her and her friend to see, and don't butt in. Your time will come soon. Go out for coffee or tea together. Ride your bikes into town. Hang out at the pool. Have conversations about things both of you find funny, or like talking about. Remember to act confident, be funny, and get that playfulness out so that she can see it."
    },
    {
      "title": "Tell her you still have feelings for her.",
      "content": "Tell her you still have feelings for her. Once you've apologized and become her friend again, you can finally tell her you want her back. Try to pick a romantic spot to do this, and try to tell her when it's just you two. It won't hurt if you're looking your best. Be honest about how you feel, within reason. Don't tell her what she might have done wrong in the relationship. Instead, focus on you. Let her know that you've thought a lot about where things went wrong, and show her all the ways in which you've changed. Tell her how you've become more patient , more forgiving, more aware of your own shortcomings, and be sure to back it up with action. If you say you've become more forgiving, be able to show her that you're not as quick to point out other peoples' faults. You can say something like: \"After we broke up, I realized I was looking for love in the wrong places. I realized that you gave me exactly what I need, and it's really a shame that I had to realize that after we broke up. But I realize it now, and I'd be stupid not to try to get you back, because you're exactly what I need.\" Or you can say something like: \"You may not like it, but most of what I do now, I do it for you. You've made a better person. I understand what it means to care for someone now that I've been with you. I want to share that with you again, this time better. Because I can't deny that I still have feelings for you. I'd be lying to myself and lying to the world.\" Assure her that you both can fix the issues that led to your breakup. Remember why you guys broke up in the first place, so you can learn from your own mistakes. Have a plan ready, and discuss that plan with her. It's no use in getting back together if you go through the same issues all over again. If you didn't listen to her feelings enough, be sure that you're listening when you tell her you like her. If you didn't get along with her friends, make an extra effort to get along with them. Have a plan to attack what's likely to go wrong, and you'll impress the socks off of her. [10] X Research source"
    }
  ]
}