{
  "url": "https://www.wikihow.com/Keep-Squirrels-Out-of-Flower-Pots",
  "title": "How to Stop Squirrels from Digging in Flower Pots",
  "steps": [
    {
      "title": "Stones, gravel, and pebbles can hide dirt from curious squirrels.",
      "content": "Stones, gravel, and pebbles can hide dirt from curious squirrels. Keep your potted plants looking nice by adding a 1-inch (2.5 cm) layer of decorative stones or rocks to the top. Not only will this hinder squirrels from digging, but it’ll look super cute! [1] X Research source Try matching the rocks to your garden pathway. Opt for small to medium-sized stones as larger rocks could stop water from reaching the soil."
    },
    {
      "title": "The strong odor of coffee grounds and cayenne pepper repulses squirrels.",
      "content": "The strong odor of coffee grounds and cayenne pepper repulses squirrels. Simply sprinkle the grounds or spice on or around plants before or after they bloom. This won’t affect your plants but will give the squirrels an awful smell and taste if they try to dig. [2] X Research source Garlic powder, ground chili flakes, and pepper flakes also work. Try using a blend of these spices to make a heavy-duty mixture squirrels will absolutely hate. Squirrels also hate the smell of their predators' urine. Both fox and coyote urine will scare away squirrels so you don't have to worry about them."
    },
    {
      "title": "Bone meal",
      "content": "Bone meal adds nutrients to the soil but deters squirrels. Your plants will love the added vitamins bone meal gives them. Squirrels? Not so much. The natural fertilizer has a strong scent that scares away squirrels. Simply add bone meal powder to your soil before planting your seeds or bulbs. [3] X Research source Bone meal can be toxic to dogs and cats, so avoid using it if you have furry friends. [4] X Research source"
    },
    {
      "title": "A mixture of fresh mint, cayenne pepper, and garlic repels squirrels.",
      "content": "A mixture of fresh mint, cayenne pepper, and garlic repels squirrels. Squirrels are sensitive to strong and spicy smells. Making a non-toxic repellent spray out of items you probably have in your pantry can help them from digging while not hurting your plants. Follow these steps to create a DIY squirrel repellent: [5] X Research source Muddle a handful of mint leaves into a medium-sized container. Pick fresh leaves from your garden or buy some at the store. Add 2 tbsp (28.3 g) of cayenne pepper. Add 2 tbsp (28.3) of garlic powder or 3 to 4 minced large cloves. Cover the ingredients with about 4 c (512 g) of boiling water or to the top of your container. Mix everything together, cover, and steep for at least 24 hours. Strain the mixture into a spray bottle and spritz onto leaves and soil. Squirrel repellents can also be purchased online or at a gardening store if you don’t have the supplies to make your own."
    },
    {
      "title": "Adding a metal or plastic layer of protection can stop squirrels from digging.",
      "content": "Adding a metal or plastic layer of protection can stop squirrels from digging. Chicken wire keeps curious squirrel paws out of your soil, as the wire basically locks them out. Simply lay the wire over the top of the pot after you plant. Then, weave the shoots through the wire once they’ve sprouted. [6] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Hardware cloth and plastic bird netting also work for this trick. For a heavy-duty solution, make cylinder cages for your potted plants to place over them when you’re not around or cover them with netting. This can hinder the curb appeal but keep your plants happy. [7] X Research source"
    },
    {
      "title": "Bamboo skewers",
      "content": "Bamboo skewers give pesky squirrels a sharp shock if they start digging. If a squirrel steps or lands on something sharp, they’ll naturally jump away to avoid it. Try putting bamboo sticks (typically used for making kabobs) into the soil with the pointy end straight up. Leave the sharp point sticking out of the soil. [8] X Research source Consider surrounding the entire plant with skewers, so the squirrel can’t rest comfortably on any area of soil."
    },
    {
      "title": "Squirrels detest nasturtiums, marigolds, and mustard flowers.",
      "content": "Squirrels detest nasturtiums, marigolds, and mustard flowers. If you’re holding vegetables in your flower pots or want to add a bit of color to your porch, consider using these vibrant flowers to deter squirrels. These flowers are natural repellents because of their strong aroma. Try adding a flower or two to your pot to keep squirrels away. [9] X Research source Consider filling a smaller pot with repelling flowers to place near larger pots if you want to keep one plant in a pot."
    },
    {
      "title": "The smell of animal hair can keep squirrels out of your garden.",
      "content": "The smell of animal hair can keep squirrels out of your garden. All you have to do is save the hair from your dog after you brush it. Then, tuck it into the top layer of soil or under a layer of mulch. [10] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source This trick also works with human hair, so consider sprinkling the hair from your trim over your plants."
    },
    {
      "title": "An ultrasonic repellent device emits sounds humans can’t hear to deter squirrels.",
      "content": "An ultrasonic repellent device emits sounds humans can’t hear to deter squirrels. These devices are placed under the soil or staked into the pot and detect movement. When a squirrel jumps on the pot, a high-frequency noise sounds that causes the squirrel to run away. These devices are safe for pets, as they’re usually unbothered by the high-frequency noise. [11] X Research source However, if your pet starts acting differently after installing the device, remove it and try another repelling technique."
    }
  ]
}