{
  "url": "https://www.wikihow.com/Make-a-Sarong",
  "title": "How to Sew a Sarong Skirt at Home: Quick & Easy Steps",
  "steps": [
    {
      "title": "Use flowy, draping fabrics to make your sarong.",
      "content": "Use flowy, draping fabrics to make your sarong. Stop by your local fabric store and pick up a light, breezy material like silk crepe, chiffon, rayon, or fluid cotton. Stay away from stiff fabrics, like organza or heavy linens; unfortunately, these materials don’t drape very well, and aren’t great options overall. [1] X Research source"
    },
    {
      "title": "Purchase 3 1⁄2 yd (3.2 m) of material.",
      "content": "Purchase 3 1 ⁄ 2 yd (3.2 m) of material. Pick up 1 3 ⁄ 4 yd (1.6 m) of 2 light, flowing fabrics, each in a different color. You’ll layer and sew these fabrics together to make a colorful, dual-toned sarong. [2] X Research source For example, you might pick out yellow and orange fabrics for a warm, tropical look, or combine teal and purple for a cooler vibe. If you’d like, you can pick identical fabric colors for a monochromatic sarong."
    },
    {
      "title": "A typical sarong is about 66 by 45 in (170 by 110 cm).",
      "content": "A typical sarong is about 66 by 45 in (170 by 110 cm). Some people use slightly different dimensions, like 64 by 40 in (160 by 100 cm). [3] X Research source Ultimately, pick a fabric dimension that fits somewhere in that range. If you’d like to be extra precise, take your hip measurement and add 36 in (91 cm)—this total will be the ideal length for your sarong."
    },
    {
      "title": "Grab a sewing machine, thread, pins, a sewing needle, and a pair of scissors.",
      "content": "Grab a sewing machine, thread, pins, a sewing needle, and a pair of scissors. Making your own sarong is very simple, and doesn’t require a lot of sewing know-how. You can find all of these supplies online, or at your local craft store. [4] X Research source Choose a thread that matches 1 of your fabric colors."
    },
    {
      "title": "Cut both fabric colors into 64 by 40 in (160 by 100 cm) rectangles.",
      "content": "Cut both fabric colors into 64 by 40 in (160 by 100 cm) rectangles. Unroll your fabric onto a flat surface, and mark off the dimensions with a fabric marker. Then, cut out both rectangles and set them aside. [5] X Research source When you’re finished, you should have 2 rectangles: 1 in each color."
    },
    {
      "title": "Fold each rectangle in half and cut the front edge into a curve.",
      "content": "Fold each rectangle in half and cut the front edge into a curve. Fold the fabric width-wise, creating a smaller rectangle that’s about 32 by 40 in (81 by 102 cm). Then, sketch a steep, curved line next to the outer edge, on the opposite side of the fold. Cut along this curved line with a pair of scissors. Repeat this folding and trimming process with the other piece of fabric, as well. [6] X Research source Look here for an exact diagram for your fabric’s curve: https://www.threadsmagazine.com/2021/04/21/make-a-simple-sarong ."
    },
    {
      "title": "Stack and align both fabric sections with the right sides touching.",
      "content": "Stack and align both fabric sections with the right sides touching. Pin the fabrics together all the way around the edge, so the material doesn’t shift while you sew. [7] X Research source"
    },
    {
      "title": "Sew the edges together with a 3⁄8 in (0.95 cm) seam allowance.",
      "content": "Sew the edges together with a 3 ⁄ 8 in (0.95 cm) seam allowance. Secure the pinned edges of your sarong under the foot of your sewing machine. Then, slowly sew around the perimeter of the sarong, creating a straight, consistent row of stitches as you go. Stop sewing about 6 in (15 cm) before your starting point, leaving a large, unstitched gap. [8] X Research source You can also serge the edges together with your sewing machine, if you’d like."
    },
    {
      "title": "Turn your sarong right-side-out.",
      "content": "Turn your sarong right-side-out. Using the 6 in (15 cm) gap along your fabric, pull out and untuck your sarong. Now, the seams should be completely hidden, with the right side of the fabric facing out. [9] X Research source"
    },
    {
      "title": "Stitch the 6 in (15 cm) gap closed.",
      "content": "Stitch the 6 in (15 cm) gap closed. Pick up a needle and thread, grabbing the same color that you used in your sewing machine. Slip-stitch the gap together so your sarong is completely secure. You’re now ready to have some fun in the sun with your new garment! [10] X Research source"
    },
    {
      "title": "Transform your sarong into a breezy skirt.",
      "content": "Transform your sarong into a breezy skirt. Hold your sarong horizontally in front of your hips and legs. Pull the left side of your sarong over and around your right hip, and tug the right side over and around your left hip. Then, tie the top left and top right corners of fabric together in front of your waist to hold your skirt in place. [11] X Research source"
    },
    {
      "title": "Tie the sarong behind your neck to create a halter-style dress.",
      "content": "Tie the sarong behind your neck to create a halter-style dress. Drape your sarong behind your back, pulling both sides of the fabric forward beneath your armpits. Then, pull the top-right corner of your sarong around and behind the left side of your neck, and tug the top-left corner around the right side of your neck. Knot both corners together to create an easy, breezy cover-up dress! [12] X Research source"
    },
    {
      "title": "Turn your sarong into a one-shoulder dress.",
      "content": "Turn your sarong into a one-shoulder dress. Fold your sarong vertically along the right side of your body, centering the fabric beneath your armpit, over your hips, and down your right leg. Tie the top 2 corners of fabric together on your left shoulder to hold the sarong in place. [13] X Research source"
    },
    {
      "title": "Twist and fold the sarong into a jumpsuit.",
      "content": "Twist and fold the sarong into a jumpsuit. Drape the fabric vertically in front of you, knotting the top right and left corners together beneath your shoulder blades. Then, pull the dangling, leftover fabric backward between your legs. Loop the bottom left fabric corner up and over your left thigh, and bring the bottom right corner around your right thigh. Knot these corners around your waist to finish off this chic look. [14] X Research source"
    }
  ]
}