{
  "url": "https://www.wikihow.com/Get-an-App-ID-on-Facebook",
  "title": "How to Get an App ID on Facebook: Developer & User Guide",
  "steps": [
    {
      "title": "Open Facebook for Developers.",
      "content": "Open Facebook for Developers. Go to https://developers.facebook.com . If you're not already signed in, you will be prompted to sign in now. To get an app ID, you will need to have: [1] X Research source A Meta developer account (free) An icon for your app (between 512 x 512 and 1024 x 1024 pixels) in the JPG, GIF, or PNG file format If doing business in the EU, contact info for your Data Protection Officer The URL to your app's privacy policy The URL to a page that allows users to delete their data from the app"
    },
    {
      "title": "Click Create App.",
      "content": "Click Create App . You'll see this below any other apps you've already created. If you see a splash page, click Create App again until you get to the \"App details\" page."
    },
    {
      "title": "Fill out the app name and email address and click Next.",
      "content": "Fill out the app name and email address and click Next . You will need to provide a name for the app now, but you can always change it later."
    },
    {
      "title": "Select one or more use cases and click Next.",
      "content": "Select one or more use cases and click Next . Select any of the options that describe how you'll be using this app. If you don't see anything that describes your use case, select Other . If prompted to select an app type, select either Business or Consumer to continue."
    },
    {
      "title": "Click Create app.",
      "content": "Click Create app . If you have a business portfolio you want to associate this app with, you can select it from the menu first. Once you click Create app , your App ID will be generated, and you'll be taken to a page that allows you to add products to the app. You'll see your App ID on the top-left corner of the page."
    },
    {
      "title": "Open Facebook for Developers.",
      "content": "Open Facebook for Developers. Go to https://developers.facebook.com . If you're not already signed in, you will be prompted to sign in now."
    },
    {
      "title": "Click the My Apps tab.",
      "content": "Click the My Apps tab. You'll see it in the upper-right corner of the page. This displays all apps associated with your account."
    },
    {
      "title": "Search for your app.",
      "content": "Search for your app. If you've already created the app on Facebook, it will be in this list. Scroll down to browse the list, or use the Search field at the top to find an app by name quickly. If you don't see the app, it may be under a different Business portfolio—use the \"Business portfolio\" menu on the left to select a different option."
    },
    {
      "title": "Find the app ID below the app's name.",
      "content": "Find the app ID below the app's name. You will see the 15-digit App ID right below the app's name. This number is unique to your app. You may need your unique App ID when you're setting up analytics, creating ads , launching a Facebook game, using the Threads API, setting up Facebook authentication for your mobile app , and more. [2] X Research source"
    },
    {
      "title": "Find your secret key on Facebook.",
      "content": "Find your secret key on Facebook. If an app you're using requires your App ID and secret key, you can also find your secret key on Facebook for Developers. Here's how: Click the name of your app. Expand the App settings menu on the left. Click the Basic tab. On the right side of the page, you'll see \"App secret.\" Click Show to display your secret key. You will usually need to enter your Facebook password to view it."
    },
    {
      "title": "Click the Facebook menu and select Settings & privacy.",
      "content": "Click the Facebook menu and select Settings & privacy . If you need support or customer service for a Facebook game you play or an app you use, the support team may ask you to provide your user ID for that app. If you're using the mobile app, tap the three-line menu at the upper-right or bottom-right corner, depending on your platform, then select Settings & privacy ."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . This displays your Facebook settings."
    },
    {
      "title": "Scroll down and tap Apps and websites.",
      "content": "Scroll down and tap Apps and websites . If you're using a computer, it'll be in the left panel. On a phone or tablet, you'll see it under \"Your activity.\" [3] X Research source"
    },
    {
      "title": "Select the app.",
      "content": "Select the app. On a phone or tablet, just tap the app's name. On a computer, click View and Edit to view the app's info."
    },
    {
      "title": "Find your user ID at the bottom of the page.",
      "content": "Find your user ID at the bottom of the page. This numeric code is unique to your Facebook account for this app. You can click or tap the ID to copy it to your clipboard."
    }
  ]
}