{
  "url": "https://www.wikihow.com/Make-a-Simple-Paper-Puppet",
  "title": "How to Make Paper Puppets (with Pictures)",
  "steps": [
    {
      "title": "Fold a piece of construction paper into thirds lengthwise.",
      "content": "Fold a piece of construction paper into thirds lengthwise. Use construction paper that's 12 by 18 in (30 by 46 cm) . First, take one of the longer edges of the paper and fold it up a third of the way. Then, repeat with the opposite long edge. Fold the paper so that you have 3 equal sections. [1] X Research source Don’t worry if your folds aren’t perfectly equal. Since 1 flap will be at the bottom of the puppet, no one will notice if the edges don’t align exactly."
    },
    {
      "title": "Glue the top flap down to hold the folds in place.",
      "content": "Glue the top flap down to hold the folds in place. Open up the top fold and squirt glue along the entire inside of the flap. Then press it down onto the other folded third so that the folds won’t come undone. The paper should now look like a long, narrow rectangle. [2] X Research source Squeeze the glue in dots or thin lines down the length of the paper. Avoid using too much or applying a thick layer, or it will make the paper soggy. You can use white school glue or a glue stick to make your paper hand puppet."
    },
    {
      "title": "Rotate the rectangle so it's vertical.",
      "content": "Rotate the rectangle so it's vertical. After you rotate it, the short sides of the rectangle should be at the top and bottom. Keep the paper rectangle oriented like this as you continue to fold it."
    },
    {
      "title": "Fold the rectangle in half, bringing the 2 short edges together.",
      "content": "Fold the rectangle in half, bringing the 2 short edges together. Pull one of the shorter edges up so that it aligns with the other short edge. Crease the paper at the fold to hold it in place. [3] X Research source To avoid any sloppy seams from showing on your puppet, fold the paper so that the glued edge is on the inside of the folded paper, not the outside."
    },
    {
      "title": "Fold each flap down so the edges line up with the center fold.",
      "content": "Fold each flap down so the edges line up with the center fold. After you’ve folded the rectangle in half, bring one of the flaps back down. Align the edge with the bottom fold, then crease the fold so the paper stays down. Repeat with the other side. [4] X Research source Try to line up the edges as perfectly as possible so your puppet isn’t crooked."
    },
    {
      "title": "Glue the 2 outside folds down.",
      "content": "Glue the 2 outside folds down. Squirt dots or a thin line of glue around the inside of the 2 flaps you just folded. Press the flaps down firmly once you’ve applied the glue to secure them in place. The side view of your folded paper should now look like a “V.” [5] X Research source Hold the paper down for about 20 seconds to let it dry before you remove your hand. Leave the very center fold of the paper unglued. This will be the mouth of your puppet."
    },
    {
      "title": "Decorate the puppet however you’d like.",
      "content": "Decorate the puppet however you’d like. Use crayons, markers, or paint to add colorful designs to the puppet. You can also glue on 3D decorations like ribbon, sequins , or googly eyes . [6] X Research source If you’re using heavier decorations, like gems or popsicle sticks, consider gluing them on with hot glue instead of school glue for a stronger hold."
    },
    {
      "title": "Place your fingers in the 2 openings to use your paper puppet.",
      "content": "Place your fingers in the 2 openings to use your paper puppet. First, put your thumb in one of the openings along the outside of the center crease. Then, insert the rest of your fingers into the opening next to it. To open and close your puppet’s mouth, simply open and close your hand while your fingers are inside the paper. Keep in mind that it’s easier to use the puppet with your dominant hand. For example, if you’re right-handed, put your puppet on your right hand."
    },
    {
      "title": "Select a paper lunch bag to use as your puppet.",
      "content": "Select a paper lunch bag to use as your puppet. With a paper bag puppet , you don't need to fold or cut anything to use your puppet! Just stick your hand into it and use your fingers to move the bottom of the bag up and down like it's a talking mouth. Simply find a bag that best fits your hand and preferences. Opt for a paper lunch bag that’s a standard brown shade or more colorful. If you can’t find colorful bags, paint the bag yourself with acrylic or spray paint. [7] X Research source"
    },
    {
      "title": "Use googly eyes and yarn to make a doll puppet.",
      "content": "Use googly eyes and yarn to make a doll puppet. To turn your paper puppet into a person, glue googly eyes on top of the puppet (the bottom of the paper bag) along with strands of yarn for hair. Draw on a nose and lips, glue paper ears on the side, and/or design an outfit on the bottom half—let your creativity run wild! If you don’t have yarn, you can use ribbon or fabric for the hair. To make braids, cut strips of fabric and weave them together just like you were braiding real hair. For clothes, glue on things like fabric scraps , buttons, or a paper bow tie. Make jewelry out of string and beads."
    },
    {
      "title": "Use construction paper details to make a dog or cat puppet.",
      "content": "Use construction paper details to make a dog or cat puppet. Cut out your puppet’s ears, nose, eyes, paws, and any other markings or features out of construction paper . Glue or tape the features onto your paper bag to make your puppet come to life! [8] X Research source Try using a pipe cleaner to give your puppet a tail. Make a collar using a piece of ribbon with a bead or charm on it. Reference a picture of your favorite pet or animal to help inspire your puppet creation."
    },
    {
      "title": "Create a monster puppet with craft supplies and your imagination.",
      "content": "Create a monster puppet with craft supplies and your imagination. For an extra spooky or silly puppet, decorate the front of the bag in bright colors or patterns, like stripes and polka dots, using paint or markers. Then, glue on oversized eyes and pointy fangs cut out of construction paper. You can also add ears, horns, or a long tongue—don’t be afraid to get creative with it! [9] X Research source Use things like glitter, feathers , or pieces of wrapping paper to make your puppet more unique and creative. Googly eyes and colorful sequins can be the perfect addition to a silly monster puppet."
    }
  ]
}