{
  "url": "https://www.wikihow.com/Know-if-a-Computer-Has-a-Wireless-Networking-Card",
  "title": "How to Detect Wi-Fi Card Drivers on a PC: Windows, Mac, and Linux",
  "steps": [
    {
      "title": "Open Device Manager.",
      "content": "Open Device Manager. Press the Windows key to open your taskbar, type device manager , and click the Control Panel result."
    },
    {
      "title": "Click the arrow next to Network adapters.",
      "content": "Click the arrow next to Network adapters . This expands the menu. Your network adapters will be listed here. If you have a wireless adapter, it should be obvious from the name of it (it might say Wireless or Wi-Fi). If it is not, you can do an internet search for the name of the device to learn whether it is wireless. [1] X Research source"
    },
    {
      "title": "Press and hold the ⌥ Opt key and click the Apple menu.",
      "content": "Press and hold the ⌥ Opt key and click the Apple menu. When you hold down the Option key and click the Apple menu, you'll see different options than you would otherwise."
    },
    {
      "title": "Click System Information.",
      "content": "Click System Information . This opens a report that covers the hardware in your Mac. The shorter report may not list your Wi-Fi card, so make sure you have File > Show More Information selected."
    },
    {
      "title": "Look under \"Network\" to find a Wi-Fi card.",
      "content": "Look under \"Network\" to find a Wi-Fi card. If your Mac desktop or MacBook has a wireless network card, it will be listed here. [2] X Research source"
    },
    {
      "title": "Open a Terminal window.",
      "content": "Open a Terminal window. Press Ctrl + Alt + T to open a Terminal if you haven't already. [3] X Research source"
    },
    {
      "title": "Type sudo lshw and press ↵ Enter.",
      "content": "Type sudo lshw and press ↵ Enter . When prompted, enter your account password to run the command. If your computer has a wireless card, you will see the information with \"Wireless Card.\" [4] X Research source"
    }
  ]
}