{
  "url": "https://www.wikihow.com/Make-Water-Gel",
  "title": "How to Make Water Gel",
  "steps": [
    {
      "title": "Get some sodium polyacrylate.",
      "content": "Get some sodium polyacrylate. Sodium polyacrylate is an absorbent polymer that can absorb up to 400 times its weight. It is found in many absorbent products, such as diapers, and you can buy it online. It is occasionally sold as \"water gel powder,\" \"slush powder,\" or \"instant solid powder.\" [1] X Research source"
    },
    {
      "title": "Put on some safety goggles.",
      "content": "Put on some safety goggles. You will be working with chemicals, so putting on a pair of safety goggles is a must. [2] X Research source Polymers absorb water, so this is not something that you want to get in your eyes. [3] X Research source"
    },
    {
      "title": "Measure 5 to 7 grams (0.18 to 0.25 oz) of sodium polyacrylate into a glass container.",
      "content": "Measure 5 to 7 grams (0.18 to 0.25 oz) of sodium polyacrylate into a glass container. This may seem like a tiny amount, but you don't need much to turn water into gel. The polymer will swell up once you add the water. [4] X Research source"
    },
    {
      "title": "Add 300 milliliters of water.",
      "content": "Add 300 milliliters of water. Try to pour the water quickly, and from about 12 inches (30 cm) or even higher; this will cause the water to mix into the polymer better. [5] X Research source If you have access to it, use deionized water for best results."
    },
    {
      "title": "Watch as the water turns into gel.",
      "content": "Watch as the water turns into gel. Sodium polyacrylate has both carboxylate anion protons and sodium cation protons. Since water is attracted to sodium ions, it enters the polymer through osmosis. This causes the sodium carboxylate to ionize and the polymer to swell. Meanwhile, the anionic carboxylates repel each other, causing further swelling, which traps the water, and results in a gel. [6] X Research source"
    },
    {
      "title": "Stir some salt into the to reverse the process.",
      "content": "Stir some salt into the to reverse the process. This is not a required part of the experiment, but it is an interesting follow-up. NaCL (sodium chloride, also known as table salt) increases the number of electrolytes (ions) in the water. This prevents the carboxylates from repelling each other and causes the polymer to contract and expel the water. [7] X Research source Start with about 5 to 7 g (1 to 1.25 teaspoons) of salt, then add more as needed. Keep adding salt and stirring until the gel turns back to water. Use a glass stirring rod or stick for this."
    },
    {
      "title": "Discard the gel.",
      "content": "Discard the gel. If your lab has a waste bin for chemicals, you can pour the gel in there. You can also stir salt into it, as indicated in the previous step, to return it to a liquid state, then pour it down the drain. [8] X Research source"
    },
    {
      "title": "Measure out 3⅓ cups (80 grams) of agar powder into a large saucepan.",
      "content": "Measure out 3⅓ cups (80 grams) of agar powder into a large saucepan. Make sure that you are using agar powder and not agar flakes. Also, make sure that the saucepan is big enough to hold at least 2 liters (0.53 US gal) of water. [9] X Research source"
    },
    {
      "title": "Gradually stir 8 cups (2 liters) of water into the saucepan.",
      "content": "Gradually stir 8 cups (2 liters) of water into the saucepan. Do not add the water all at once. Instead, start with just enough water to turn the powder into a paste. Then add the rest of the water in about four increments, stirring between each one. [10] X Research source"
    },
    {
      "title": "Boil the agar water.",
      "content": "Boil the agar water. Set the saucepan on the stove, and turn the heat up to medium. Cook the agar water for 3 to 5 minutes, or until it reaches 176°F (80°C)."
    },
    {
      "title": "Chill the agar water in an ice bath.",
      "content": "Chill the agar water in an ice bath. Fill a larger container (ie: a sink) with cold water, then add some ice. Set the saucepan into the water, then stir the agar water until it turns cold and clear. [11] X Research source The water level in the ice bath needs to reach the agar water level in the saucepan."
    },
    {
      "title": "Pour the agar into your desired mold(s).",
      "content": "Pour the agar into your desired mold(s). You can use silicone baking or ice cube trays, regular ice cube trays, or even candy making molds. You can even use regular jelly molds."
    },
    {
      "title": "Refrigerate the agar water for 2 hours.",
      "content": "Refrigerate the agar water for 2 hours. As the agar water continues to cool down, it will solidify into a gel. It will be slightly foggy, but still clear enough to see through. [12] X Research source"
    },
    {
      "title": "De-mold and serve the gel.",
      "content": "De-mold and serve the gel. The gel won't taste like much, so it would be a good idea to pour some sugar water or simple syrup over it before digging in. You can even use honey or a flavored simple syrup instead. [13] X Research source"
    }
  ]
}