{
  "url": "https://www.wikihow.com/Learn-to-Behave-Socially",
  "title": "How to Learn to Behave Socially",
  "steps": [
    {
      "title": "Think about who you’re around.",
      "content": "Think about who you’re around. An “audience” doesn’t necessarily mean a group of people watching you perform (literally), but in many ways, our social interactions are a type of performance. You may find that you act differently around close family members or friends than you do around people you don’t know very well. You may act differently around co-workers alone than when your boss is around. Or, you may act differently around kids than around elderly people. Consider the reasons for this. Be sensitive toward those around you. Take into consideration who you’re talking to before you say something. Watch for vague statements that could be taken the wrong way by certain people. [1] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Notice how others interact.",
      "content": "Notice how others interact. This is especially helpful in new environments, like a new job or a new social circle. By hanging back and observing for a bit, you can get an idea of appropriate ways people interact in different types of situations."
    },
    {
      "title": "Be open to new and different people and experiences.",
      "content": "Be open to new and different people and experiences. This may be especially helpful if you are young or if you have not been around many differences in your lifetime yet. Be accepting of unfamiliar cultures and of differing levels of abilities. [2] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. Be friendly and respectful toward all people, regardless of how they are different from you. If they seem uncomfortable at first, it may be because you are just as different to them as they are to you. Take the first step and be polite. You may end up learning much about the many differences in the world. In the words of Dale Carnegie (author of How to Win Friends and Influence People) try to, “Focus outward, not inward.” [3] X Research source"
    },
    {
      "title": "Avoid statements that generalize certain groups of people.",
      "content": "Avoid statements that generalize certain groups of people. For instance, statements that generalize all women or men, all people of various races or sexual orientations, or all people of an age group. Stereotyping, or making racist or sexist comments, can be quite offensive, even if you’re talking to a group that doesn’t include the people you’re commenting on."
    },
    {
      "title": "Read social cues.",
      "content": "Read social cues. Social cues are things we pick up on from others that they haven’t directly told us. Example: You are busily working on a project and someone approaches you to talk. You quickly acknowledge them but then continue working. If they continue trying to have a conversation with you, they have not read your social cue, which is that you are too busy right now to talk. Another example: You’re at a party, or a bar. A person you don’t know approaches you and starts flirting. You turn away and continue talking to your friends. The person who approached doesn’t leave, and instead repeatedly tries to get your attention. This person has not read your social cue, which is that you’re not interested. The importance of reading social cues is that it can be frustrating for the person who has given the cue if it is not interpreted. Reading social cues is often something that we learn as children. Cultural differences can sometimes interfere with the reading of social cues, as can certain disabilities such as autism, ADHD, and depression."
    },
    {
      "title": "Use everyday manner words.",
      "content": "Use everyday manner words. Regardless of who you’re around, saying basic words like “please,” “thank you,” and “excuse me,” shows the respect that everyone deserves when you are talking to them. [4] X Research source"
    },
    {
      "title": "Play it safe and be polite.",
      "content": "Play it safe and be polite. If you’re not sure what to say in a certain situation, saying as little as possible in a polite manner is best. Making small talk is fine, especially with people you don’t know very well. [5] X Research source"
    },
    {
      "title": "Sit and stand up straight.",
      "content": "Sit and stand up straight. Lean in slightly toward the person you are talking with. Slouching back and/or crossing your arms sends out a signal that you are bored or perhaps upset by a conversation. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. When you’re talking to someone, or they are talking to you, looking in their eyes shows confidence and that you are fully engaged in talking with them. If someone isn’t making eye contact with you, don’t jump to conclusions. Cultural differences sometimes deem eye contact inappropriate, or it could be a sign that someone is intimidated by you. Give it time and see if you can figure out the cause. [7] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Avoid staring.",
      "content": "Avoid staring. There is a difference between making eye contact and staring at someone. You definitely don’t want to watch what someone else is doing if you are not directly having a conversation with that person at that time. It may be intimidating to that person, and is considered rude and sometimes creepy by most people."
    },
    {
      "title": "Smile.",
      "content": "Smile. People feel much more at ease around someone who smiles. We don’t mean plaster a fake smile on your face at all times, but during a conversation, it helps to smile occasionally – especially if someone said something interesting or funny. [8] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source"
    },
    {
      "title": "Think before you speak.",
      "content": "Think before you speak. This is also covered in the first section, but it’s always good to think about what you’re going to say before you say it. [9] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. Avoid statements that are heavy with value-judgments. For example, instead of saying, “The mayor sure is a moron, huh?” say, “What do you think of the mayor’s rebuilding proposals (or whatever the topic is)?” [10] X Research source"
    },
    {
      "title": "Control your pitch while speaking.",
      "content": "Control your pitch while speaking. Getting too loud or high in pitch can be startling to others, or they can easily misread your emotions."
    },
    {
      "title": "Take your turn.",
      "content": "Take your turn. Listen and don’t interrupt others. [11] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. This can be difficult if you suddenly get really excited to say something, or if there is one person in a group dominating a whole conversation, but try to resist the urge to cut someone off mid-sentence. [12] X Research source"
    },
    {
      "title": "Avoid yelling and swearing if you’re angry.",
      "content": "Avoid yelling and swearing if you’re angry. Everyone gets angry sometimes, and if you’re angry with someone the best way to handle it is to calmly explain to them why you are angry, or to walk away from the situation and discuss it when you are less angry. No one, neither close friends and relatives nor casual acquaintances, responds well to being yelled at. It is frightening and most likely will only make the conflict worse."
    },
    {
      "title": "Ask questions and show interest.",
      "content": "Ask questions and show interest. If someone tells you something, ask them more about it. For instance, your friend says he was out of town last week. Ask where he went and if he had fun. Questions also go really well together with compliments. If you compliment someone, follow it with a question. Examples: Those are cool shoes! Are they new? Or, Where did you get them? He’s such a cute dog! What’s his name? What kind of dog is he? It’s easier to keep conversation rolling with someone if you contribute, ask questions, are interested in the answers, and then add more it. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Don’t show off.",
      "content": "Don’t show off. Sometimes people who are naturally funny or good at many things are tempted to dominate conversations with jokes or stories of their own achievements. Don’t be that person! Many people may be turned off by it. Again, the more interested you act in the other person, the more likely that person is to want to have more conversations with you. Even if you don’t care about having more conversations with that person, you probably want to avoid making them think you are self-centered and vain. Some types of humor or jokes are not appropriate for most situations. Making others feel bad, or jokes at the expense of others, will most likely make others uncomfortable, especially if you don’t know them very well. [14] X Research source"
    },
    {
      "title": "Be positive.",
      "content": "Be positive. People naturally gravitate toward those with a positive outlook and upbeat personality. Instead of always just complaining or criticizing, think of the positive things about a situation or about constructive ways to help solve a problem. Look at that glass as half full! [15] X Research source"
    },
    {
      "title": "Think about where you are going.",
      "content": "Think about where you are going. Are you going to a nice restaurant? To a ball game or a picnic? To a wedding or holiday party? [16] X Research source The type of clothes you wear to a certain event tells others that you care about your appearance and will help you feel more confident. If you’re going to a restaurant, try looking it up online to see if you can tell how fancy it is. For casual places, and for picnics or ball games, jeans and t-shirts or business casual clothes are just fine. For fancier restaurants, weddings, or holiday parties, you’ll want to dress up a bit more (a nice dress or skirt and blouse for women; a suit or dress shirt and dress pants for men) keeping in mind the exact location of the event to determine how “dressy” to be."
    },
    {
      "title": "Always have good hygiene.",
      "content": "Always have good hygiene. Wear clothes that are clean and ironed, regardless of where you’re going. Shower each day, wash your hair, brush your teeth, and wear deodorant. Keeping up with hygiene may sound obvious, but letting it slack can be pretty detrimental to your social interactions, as well as put you at higher risk for getting sick. [17] X Research source"
    },
    {
      "title": "Ask someone else’s opinion.",
      "content": "Ask someone else’s opinion. If you’re unsure, it never hurts to ask a trusted friend or relative what they think regarding an outfit you’re deciding on. You can get some helpful advice, especially if you’re going to a new place and your friend has been somewhere like it before. Or, if you’re just unsure how formal a certain occasion is (ex. weddings can be either extremely formal or quite informal) it’s a good idea to ask someone."
    }
  ]
}