{
  "url": "https://www.wikihow.com/Know-if-a-Person-Is-Getting-Bored-of-You",
  "title": "How to Know if a Person Is Getting Bored of You",
  "steps": [
    {
      "title": "Consider how much time they’ve been spending with you.",
      "content": "Consider how much time they’ve been spending with you. This is a common concern—you go from being practically inseparable to seeing each other a handful of times per week, or even less. Everyone gets busy, of course, but if your partner seems to be staying busier a lot more than usual, or if they’re constantly giving you reasons why they can’t get together, you may have an issue. [1] X Research source It could be that your partner just needs a little more time to themselves and is reluctant to tell you so directly. Put them at ease by letting them know that they’re entitled to have a life of their own, and that you’re fine with them flying solo every now and then. Keep in mind also that the amount of time you spend together (and the quality of that time) will fluctuate occasionally as you move forward in your relationship. This is totally normal, and shouldn’t be viewed as a cause for alarm unless it’s a sudden, significant difference. [2] X Research source"
    },
    {
      "title": "Be wary if they no longer seem interested in what’s going on in your life.",
      "content": "Be wary if they no longer seem interested in what’s going on in your life. When someone is into you, one of the ways they’ll usually show it most clearly is through curiosity—they’ll feel an itch to know more about you and be involved in the things you’re involved in. If you don’t even get so much as a “How was your day?” anymore, it could be that the roaring fire of your romance has died down to a flickering flame. [3] X Research source Try being the one to start the discussion that you want to have. If they respond well, it may just not have occurred to them to bring it up themselves. If you get short, unenthused responses, it’s possible that they’ve checked out mentally or emotionally. Though it’s not a very comforting thought, one reason your partner may be getting bored with you is that you’ve become, well, boring. If you feel like your life has gotten somewhat monotonous, try switching up your normal routine, learning a new skill, or doing some traveling to broaden your horizons. That way, you and your partner will have more to talk about. [4] X Research source"
    },
    {
      "title": "See whether they’re on their phone more often.",
      "content": "See whether they’re on their phone more often. People sometimes use their devices as a means of escape when they’re bored with what’s going on around them. When your boyfriend or girlfriend always has their nose in their phone, it could be because they’re more interested in what’s on the screen than they are in their present company. [5] X Research source To reclaim their attention, come up with ideas for fun and out-of-the-ordinary things to do together, like hit up a drive-in movie, go ice skating, or play laser tag. Even offering to give them a back rub might be enough to snap them out of their electronic trance. [6] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Excessive phone use isn’t necessarily always a red flag. Some people are just more dependent on their phones for entertainment than others. Fret accordingly."
    },
    {
      "title": "Watch for signs that they may be interested in other people.",
      "content": "Watch for signs that they may be interested in other people. In some cases, a passionless relationship can lead to feelings of restlessness. When this happens, your partner may become vulnerable to the pull of outside attraction. Tell-tale signs that your partner may have wandering eyes include a marked decrease in affection, reluctance to share their thoughts and feelings, and jumpiness or defensiveness when asked about why they’re behaving differently. Tell them as gracefully as possible that it makes you uncomfortable when they flirt with other people. If they truly care about you, they’ll understand and take steps to change their behavior. It’s normal to be attracted to someone other than the person you’re with. When that curiosity leads to exploration, however, it can cause serious problems within a relationship."
    },
    {
      "title": "Listen for short, disinterested responses.",
      "content": "Listen for short, disinterested responses. Someone who is engaged with what you’re saying will generally let you know by acknowledging your remarks with enthusiasm and readily offering their own input. If you continually receive passive or absent-minded replies, chances are good that the person you’re talking to is losing interest. [8] X Research source Perfunctory responses like, “Yeah?”, “Huh,” or “That’s cool” ordinarily just serve as a way for the listener to convey that they’re holding up their end of the conversation. You can’t blame someone for being bored with you if you’re actually being a bore. Play it safe and avoid the kinds of subjects that people often fall back on when they don’t know what else to talk about, like the weather or work. You’re probably just as sick of talking about that kind of stuff as they are, anyway."
    },
    {
      "title": "Pay attention when your listener’s questions become less inquisitive.",
      "content": "Pay attention when your listener’s questions become less inquisitive. It’s common for people who don’t really care about what they’re being told to resort to using one- and two-word questions—like, “When?”, “Where?”, or “For real?”—as placeholder responses. They’re not asking them in order to clarify something you’ve said or elicit further detail—they’re just trying to be polite. [9] X Research source By contrast, an attentive listener will typically pose more sophisticated questions, such as “What do you mean by that?” or, “Was this before or after you moved into the new house?” These sorts of questions are designed specifically to draw more information out of you. The amount of interrogating your listener is doing can also help you gauge their level of curiosity. The more interested they are in you or your thoughts on the matter, the more questions they’re likely to ask."
    },
    {
      "title": "Note how often you’re being interrupted.",
      "content": "Note how often you’re being interrupted. Someone who’s contented with your dialogue won’t cut you off to make an unrelated point. Frequent interruptions could be a sign that your listener is impatient for a turn to talk themselves, or trying a little too hard to seem like they’re pulling their conversational weight. [10] X Research source When some people are really jazzed about a certain subject, they may have a tendency to interrupt out of eagerness rather than rudeness. You should be able to tell the difference easily. [11] X Research source Being a good conversationalist often comes down to being a good active listener . If the person you’re talking to wants to say something bad enough to warrant interrupting you, it may be best to just give them the floor."
    },
    {
      "title": "Observe when your listener seems to be reluctantly carrying the conversation.",
      "content": "Observe when your listener seems to be reluctantly carrying the conversation. They could be doing most of the talking because they feel like they have to. Starting off every question with “So…” or, “Anyway…” is a clear indicator that the person is desperately groping for a foothold in the conversation. [12] X Research source If things start to feel one-sided, reconsider your own responses. If you find yourself repeatedly making dead-end responses like “Yeah,” “I don’t know,” or, “I guess so,” it may be time to walk away or change things up and start asking the questions instead. People who enjoy talking about themselves, or talking for the sake of talking, will never run out of things to talk about."
    },
    {
      "title": "Check to see if your listener is facing you head-on.",
      "content": "Check to see if your listener is facing you head-on. Most of the time when someone is truly present and connected with you, they’ll stand with their head, shoulders, knees, and toes pointed towards you. Turning or leaning away from the person you’re speaking to often points to a subconscious desire to escape from the interaction. [13] X Research source Other signs of “closed” body language include slouching or hunching, crossing one’s arms, or looking down or away. [14] X Research source Interested girls in particular may stand a little closer to you and act a bit more relaxed. [15] X Expert Source Elvina Lui, MFT Marriage & Family Therapist Expert Interview. 15 March 2019."
    },
    {
      "title": "Judge whether the person seems to be avoiding eye contact.",
      "content": "Judge whether the person seems to be avoiding eye contact. The eyes behave similarly to the body during conversation. If your listener’s eyes are locked onto yours, it means that you’ve got their attention. But if they’re evasive, downcast, or wandering around the room, they may be searching for a more stimulating pastime. [16] X Research source Another thing to watch for is when your listener’s eyes start to “glaze over,” or take on a spacey, far-away look. They may be looking right at you and not hear a word you’re saying if their mind is somewhere else. [17] X Research source Make sure you don’t come across like you’re staring the person down. If they weren’t off-put before, they may be after one too many long looks."
    },
    {
      "title": "Look for an absence of movement.",
      "content": "Look for an absence of movement. As a general rule, people who have become bored with an underwhelming chat won’t waste the energy required to talk with their hands. Instead, they’ll probably appear somewhat subdued. For the most part, they’ll be sitting or standing quite still, with few gestures, flourishes, or pronounced facial expressions to go along with their words. [18] X Research source On the flipside, if your listener is moving around excitedly, you can be fairly certain that they’re enjoying talking with you. Much of a person’s non-verbal behavior, of course, simply depends on their personality. Introverts, for example, typically aren’t as animated as more outgoing individuals. Do your best to feel your listener out based on what you know about them. [19] X Research source"
    },
    {
      "title": "Take frequent nodding as a hint that your listener is invested.",
      "content": "Take frequent nodding as a hint that your listener is invested. It’s a common misconception that people smile and nod when they’re pretending to listen to something that bores them. In reality, nodding several times can actually be a positive sign, as it demonstrates an attitude of contemplation and a willingness to understand. [20] X Research source Many social scientists claim that 3 is the magic number when it comes to nodding. A single tip of the chin may be a polite gesture, but a trio of head bobs likely means that your listener is really taking in what you’re telling them. Emphatic nodding is often accompanied by strong eye contact. It’s only when someone nods continuously without meeting your gaze or even seeming to hear what you’ve said that you need to worry."
    }
  ]
}