{
  "url": "https://www.wikihow.com/Learn-to-Sing",
  "title": "How to Sing: A Beginner's Guide to Improve Your Vocals",
  "steps": [
    {
      "title": "Exercise your body and stretch your vocal cords to prevent injury.",
      "content": "Exercise your body and stretch your vocal cords to prevent injury. Vocal experts recommend moving your body around to get the blood flowing before you do vocal warm-ups . By stretching your vocal cords, you keep them loose so it's easier to make sound. [1] X Expert Source Amy Chapman, MA Voice & Speech Coach Expert Interview. 18 October 2019. Plus, if you warm-up your vocal cords, you're less likely to injure them. Here are a few simple warm-ups to get you started: [2] X Research source Exhale completely, relax your stomach muscles, open your mouth, and let all the air back into your lungs. Repeat this, and make an \"sss\" or \"fff\" sound when you release the air. These sounds exercise different vocal cords. Hum or sing high notes, alternating with low notes to help stretch out your voice. Exhale as you tilt your head down to 1 shoulder. Then, breathe in as you bring your head back up. Repeat this in the opposite direction. Practice singing a short, 5-note scale. Go slowly and really focus on clearly singing each note."
    },
    {
      "title": "Stand straight and tall so you can make the best sounds possible.",
      "content": "Stand straight and tall so you can make the best sounds possible. It's hard to produce clear rich sounds if you're hunched over and your lungs can't expand. Instead, plant your feet and imagine that a string is pulling you up from the top of your head. Keep your knees loose and bring your shoulders down. Try to release all tension from your muscles. [3] X Research source Keep your head level so you stare straight ahead and your chin doesn't jut upward. [4] X Expert Source Amy Chapman, MA Voice & Speech Coach Expert Interview. 18 October 2019. If your muscles are tense, it's hard to produce a deep beautiful sound. While improving your posture for singing might feel strange at first, if you practice, you'll get used to relaxed, but good posture."
    },
    {
      "title": "Your vocal range reveals the notes you can sing between a high and low point.",
      "content": "Your vocal range reveals the notes you can sing between a high and low point. Most people have a range of around 1 to 2 octaves. To find your vocal range , drop your voice and sing or hum the lowest note you can—hold the note for 3 seconds. Then, bring your voice up until you reach the highest note you can sing or hum and hold the note for 3 seconds. The span of notes in between your highest and lowest notes is your vocal range. [5] X Expert Source Amy Chapman, MA Voice & Speech Coach Expert Interview. 18 October 2019. Download apps like Vocal Coach or Swiftscales to help you find your range. You could also sit at a piano and match your highest and lowest notes using the keyboard. Keep in mind that your range might vary a little bit from day to day, especially if you're ill or tired."
    },
    {
      "title": "Sing scales starting from your low point to your high point.",
      "content": "Sing scales starting from your low point to your high point. In order to sing higher without your voice cracking or to sing lower more comfortably, practice singing your highest note before going down the scale by half notes. Then, glide your voice back up. Repeatedly singing your scales can expand your vocal range over time. [6] X Expert Source Amy Chapman, MA Voice & Speech Coach Expert Interview. 18 October 2019. You can use any word to sing your scales or go with the classic \"do-mi-sol-do-sol-mi-do.\""
    },
    {
      "title": "Stop your voice from cracking by improving your breathing for high notes.",
      "content": "Stop your voice from cracking by improving your breathing for high notes. Start by opening your mouth and throat wide as though you're yawning. Don't try to sing louder—just breathe steadily as you aim for high notes. It might help to imagine you're jumping on a trampoline as you hit the high note. [7] X Research source Again, singing your scales also goes a long way in helping you hit the high notes."
    },
    {
      "title": "Create deep resonant sounds when you sing from your abdomen.",
      "content": "Create deep resonant sounds when you sing from your abdomen. If your sounds are mainly coming from your throat or nasal cavity, focus more on filling your body with sound. Place a hand on your abdomen and try to engage your lungs as you sing. This really helps your sound resonate and become clear. [8] X Research source Your chest should feel like it's gently vibrating as you sing. Remember, try to keep your body loose and relaxed so you're not holding tension."
    },
    {
      "title": "Do breathing exercises to support your voice and prevent gasping.",
      "content": "Do breathing exercises to support your voice and prevent gasping. It's no surprise that singers who can breathe deeply and consistently get better mileage out of their voices. For a simple breathing exercise that you can practice anytime, open and close your jaw as though you're a fish out of water. Flex your facial muscles a few times and take a few deep breaths. Let the breath fall to your belly before you steadily exhale. [9] X Expert Source Amy Chapman, MA Voice & Speech Coach Expert Interview. 18 October 2019. To challenge yourself, time your breathing—breathe in and see how long you can hold the breath. Then, steadily release the breath for the same amount of time. With practice, this strengthens your lungs. To exercise different muscles, make a hissing sound as you exhale."
    },
    {
      "title": "Join a choir",
      "content": "Join a choir to pick up useful singing skills. While singing lessons are great, don't worry if you can't afford them. You can gain valuable singing skills by joining a local choir or community chorus. Plus, you'll make connections and develop friendships with people who are also passionate about singing. [10] X Research source If you're looking for individual feedback, record yourself singing a song and upload your video to YouTube . Then, read through the constructive comments to find ways to improve."
    },
    {
      "title": "Taking several slow deep breaths can steady your voice if you're nervous.",
      "content": "Taking several slow deep breaths can steady your voice if you're nervous. It's totally normal to be a little anxious when you start singing in front of other people—even your friends or family! To sing without a shaky voice, breathe in deeply and slowly let it out with a hissing sound. This gives you great breath support and slows your oxygen intake to calm your nerves before you perform. [11] X Expert Source Amy Chapman, MA Voice & Speech Coach Expert Interview. 18 October 2019. Remind yourself to take deep breaths whenever you notice your breathing become shallow and fast."
    },
    {
      "title": "Try singing along to a song that you like with a voice recorder nearby.",
      "content": "Try singing along to a song that you like with a voice recorder nearby. Make sure the music is quiet and your voice is the real thing that the recorder picks up. After you're done singing, check if you are singing on key. Also, listen to find out if you're articulating the words. [12] X Research source If you're worried about performing a song, focus on memorizing the lyrics and getting the tune down before you work on your singing technique."
    },
    {
      "title": "Practice singing every day to develop your singing skills.",
      "content": "Practice singing every day to develop your singing skills. Make time to warm up your vocal cords, do breathing exercises, and practice singing songs. If singing becomes part of your daily routine, you will notice an improvement in your skills! [13] X Expert Source Amy Chapman, MA Voice & Speech Coach Expert Interview. 18 October 2019. If it helps you practice, set a goal for yourself like singing at your school's talent show or performing a song for your parents."
    },
    {
      "title": "Drink water",
      "content": "Drink water and rest when you're sick. Make it a habit to have your water bottle close by and drink from it throughout the day. Water produces mucus that loosens and lubricates your vocal cords. If you're not feeling well, give your vocal cords a break and take some time off from singing until you feel better. [14] X Research source Avoid drinking dairy products or thick drinks like smoothies right before you sing If you use cough drops for a sore throat, avoid ones that contain menthol since it actually causes throat irritation."
    }
  ]
}