{
  "url": "https://www.wikihow.com/Make-Hopia-Baboy",
  "title": "How to Make Hopia Baboy",
  "steps": [
    {
      "title": "Mix together the oil dough.",
      "content": "Mix together the oil dough. Combine 1 cup (250 ml) all-purpose flour with 1/3 cup (80 ml) vegetable oil, mixing until evenly combined into a smooth dough. If desired, you can also add 1/4 tsp (1.25 ml) red or yellow food coloring after combining the oil and flour. Mix until the color is even throughout the dough. The addition of food coloring is strictly optional, though. [1] X Research source Set the oil dough aside for now."
    },
    {
      "title": "Combine the flour and sugar for the water dough.",
      "content": "Combine the flour and sugar for the water dough. Mix together 2 cups (500 ml) all-purpose flour with 3 Tbsp (45 ml) white granulated sugar in a medium bowl. Using a fork to mix the dry ingredients can minimize the number of lumps that may form in the flour."
    },
    {
      "title": "Cut in the lard.",
      "content": "Cut in the lard. Add the chilled lard to your water dough and cut it into the dry ingredients using a pastry cutter. [2] X Research source If you do not have a pastry cutter, cut the lard into small bits and sprinkle these bits over the dry ingredients evenly. Use a fork or knife to \"cut\" these lard bits into the dry ingredients until dry, coarse crumbs form."
    },
    {
      "title": "Add the water.",
      "content": "Add the water. Pour the water into the remaining water dough ingredients. Mix with a fork until evenly combined. If you want to add any food coloring to the water dough, do so when you add the water."
    },
    {
      "title": "Knead well.",
      "content": "Knead well. Turn the water dough out onto a lightly floured counter and knead until the dough is smooth and elastic. If you did not add any food coloring, the dough should change from white to ivory after you knead it completely."
    },
    {
      "title": "Divide and roll.",
      "content": "Divide and roll. Divide the dough into two equal halves, and roll each half into a flat square. The square of dough will be about 12 inches (30.5 cm) long and wide. Roll the dough until it is only 1/8 inch (3 mm) thick, if not thinner. The thinness of the dough is more important than the shape or other dimensions at this point."
    },
    {
      "title": "Spread the oil dough over the water dough.",
      "content": "Spread the oil dough over the water dough. Use your hands to crumble half of the oil dough over one of the water dough halves. Spread the oil dough crumbles evenly over the water dough square. Repeat this same process with the other half of the oil dough and the other half of the water dough."
    },
    {
      "title": "Roll into a cylinder.",
      "content": "Roll into a cylinder. Roll each square of dough into a tight cylinder, as though you were making a jellyroll."
    },
    {
      "title": "Stretch the cylinder.",
      "content": "Stretch the cylinder. Gently roll each cylinder under your palms until the entire thing is only about 1 inch (2.5 cm) in diameter. The finished cylinder should be roughly 16 inches (40.6 cm) long and even in diameter throughout."
    },
    {
      "title": "Divide and chill.",
      "content": "Divide and chill. Divide both cylinders of dough in half, producing a total of four separate portions of dough. Wrap each portion of dough in plastic wrap and refrigerate for 10 to 60 minutes. [3] X Research source Refrigerating the dough will give the lard a chance to harden slightly, making the dough easier to work with when you assemble the hopia. Do not refrigerate it for much longer than an hour, though, since excessive refrigeration can cause the dough to dry out."
    },
    {
      "title": "Combine the pork fat and sugar.",
      "content": "Combine the pork fat and sugar. Place the pork fat in a medium bowl. Sprinkle the sugar over it and toss gently until the pork fat is evenly coated in sugar. [4] X Research source Set the pork fat aside for a few minutes as you prepare some of the other filling ingredients."
    },
    {
      "title": "Heat the oil.",
      "content": "Heat the oil. Pour the oil into a large skillet with deep sides. Heat on the stove over medium-high heat for 1 to 2 minutes."
    },
    {
      "title": "Cook the onion.",
      "content": "Cook the onion. Add the onion to the hot oil in your skillet. Sauté the onions, stirring frequently, for 2 to 4 minutes. The onions should become fragrant and translucent. Do not allow them to burn."
    },
    {
      "title": "Add the sesame seeds.",
      "content": "Add the sesame seeds. Sprinkle the sesame seeds over the onions in the pan. Stir until they coat the onions and cook for 30 seconds. Do not allow the sesame seeds to burn."
    },
    {
      "title": "Mix in the sugared fat and kundol.",
      "content": "Mix in the sugared fat and kundol. Add the sugared pork fat and diced kundol to the contents of the pan. Reduce the heat to medium and simmer until the fat and kundol begin breaking down. You may need to lightly mash the fat and kundol with a fork or mixing spoon as it simmers. Note that kundol is also referred to as \"winter melon.\" The mashed filling should be chunky but somewhat watery at this point. If there is not much liquid in the pan, add 1/2 cup (125 ml) water."
    },
    {
      "title": "Stir in the flour.",
      "content": "Stir in the flour. Sprinkle the flour into the contents of the pan, stirring continuously. Continue cooking for 5 minutes, or until the filling is thick throughout. [5] X Research source Note that no visible traces of flour should remain when done."
    },
    {
      "title": "Cool slightly.",
      "content": "Cool slightly. Remove the pan from the heat and set it aside for 5 to 10 minutes, allowing the filling to cool slightly before you assemble the hopia baboy."
    },
    {
      "title": "Preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius).",
      "content": "Preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius). Prepare two or three baking sheets by lining them with nonstick aluminum foil. [6] X Research source"
    },
    {
      "title": "Stretch the dough.",
      "content": "Stretch the dough. Remove the dough from the refrigerator. Place it on the counter and gently roll it underneath the palms of your hands until it stretches out to a length of 12 inches (30.5 cm). The diameter should be an even 3/4 inch (1.9 cm) throughout. Note that you should work with one cylinder of dough at a time. After rolling, dividing, and filling the dough of one cylinder, move onto the next. Repeat until you make it through all four cylinders of dough."
    },
    {
      "title": "Cut the dough into even pieces.",
      "content": "Cut the dough into even pieces. Cut the cylinder of dough in half, then cut each half into three even pieces. Each of your four original cylinders should give you six pieces of dough, producing a total of 24 pieces. If you want smaller pastries, you can cut each cylinder in half and each half into four even pieces. Each original cylinder should produce eight pieces, giving you a total of 32 pieces altogether."
    },
    {
      "title": "Roll each piece into a rectangle.",
      "content": "Roll each piece into a rectangle. Use a rolling pin to flatten each piece of dough into a small, thin rectangle."
    },
    {
      "title": "Fill each rectangle.",
      "content": "Fill each rectangle. Place 1 heaping Tbsp (15 to 18 ml) of prepared filling in the center of each rectangle. Gather the edges of dough over the filling, covering it completely. You should gently pinch the edges together at the center to prevent the pastry from accidentally opening up."
    },
    {
      "title": "Flatten each piece.",
      "content": "Flatten each piece. Arrange each of the pieces on your prepared baking sheet, placing them seam-side down. Use your fingers to gently pat the pieces into circles, then lightly press down on them to flatten the pieces slightly."
    },
    {
      "title": "Brush with the egg wash.",
      "content": "Brush with the egg wash. Use a pastry brush to lightly coat the tops of each piece with the beaten egg. [7] X Research source"
    },
    {
      "title": "Bake for 20 minutes.",
      "content": "Bake for 20 minutes. Place the hopia baboy in the preheated oven and bake until the bottoms are brown and the tops are golden brown. [8] X Research source Watch them carefully as they bake. Keeping them in the oven a few minutes too long can cause them to burn quickly."
    },
    {
      "title": "Serve.",
      "content": "Serve. Remove the finished hopia baboy from the oven. Let the pieces cool until they can be safely handled with your hands, then enjoy."
    }
  ]
}