{
  "url": "https://www.wikihow.com/Make-Easter-Eggs",
  "title": "How to Make Easter Eggs",
  "steps": [
    {
      "title": "Leave your eggs in boiled water for 10 minutes to make hard-boiled eggs.",
      "content": "Leave your eggs in boiled water for 10 minutes to make hard-boiled eggs. Place the eggs in a pot on the stove. Add enough water to cover them by 1 inch (2.5 cm), and then bring the water to a rolling boil over high heat. When it's boiling, cover the pot and take it off the heat. Set the pot aside for 10 minutes. [1] X Research source Once 10 minutes is up, put the eggs in an ice bath to cool."
    },
    {
      "title": "Cover your table or work surface with newspaper.",
      "content": "Cover your table or work surface with newspaper. Dye can easily stain surfaces so protect the area with a thick layer of newspaper. You can also use paper towels, an old towel you don't mind staining, or even a trash bag in a pinch. [2] X Research source"
    },
    {
      "title": "Add boiling water, vinegar, and food coloring to small bowls.",
      "content": "Add boiling water, vinegar, and food coloring to small bowls. Pour in 0.5 cups (120 mL) of boiling water, 0.5 teaspoons (2.5 mL) of white vinegar, and 10 drops of food coloring for each bowl. Stir to combine. [3] X Research source Make each bowl a different color. You can do the primary colors just by adding 10 drops of red to a bowl, 10 drops of blue to another, and so on. You can also mix colors to get different shades, such as 4 drops of green and 6 drops of blue for a blue-green or 5 drops of red and 5 drops of blue for a purple. If you want your colors to be more intense, add more drops of food coloring. Adding vinegar to the water helps make the dye brighter! [4] X Research source"
    },
    {
      "title": "Soak the eggs in the colors for 5 minutes or more.",
      "content": "Soak the eggs in the colors for 5 minutes or more. Use a spoon to dip the eggs into the dyed water. Let them soak for at least 5 minutes, turning them occasionally to make sure all sides get dyed. If you leave them in for longer, the colors will be darker. [5] X Research source You can also use tongs to hold the egg at an angle and only dye one side. Then, hold the other end in a different dye for a striped effect."
    },
    {
      "title": "Dry the eggs off on paper towels or in the carton.",
      "content": "Dry the eggs off on paper towels or in the carton. Lay the eggs on paper towels so they can dry completely. You can also set them back into the carton to dry off, particularly if you have a cardboard carton. [6] X Research source If you're planning on eating the eggs, don't leave them out of the refrigerator for more than 2 hours. [7] X Research source"
    },
    {
      "title": "Make tie-dye eggs by adding a splash of oil to the dye water.",
      "content": "Make tie-dye eggs by adding a splash of oil to the dye water. Pour in a spoonful of olive oil or other cooking oil in one of the bowls of dye. Mix it around and then lower in an egg. Roll it around for a few minutes so it picks up color in some areas but not others. After a few minutes, pull it out and dry it off. [8] X Research source You can also create a similar effect with vinegar, shaving cream or whipped cream, and food coloring. Soak the boiled eggs in vinegar for 2 minutes and then dry them off. Spread out shaving cream or whipped topping in a baking dish and sprinkle food coloring on top, adding several colors. Swirl the colors around with a toothpick and then roll the eggs in the colors. Let them sit for 10 minutes before washing the mixture off. [9] X Research source"
    },
    {
      "title": "Add stickers or letters before dyeing the eggs.",
      "content": "Add stickers or letters before dyeing the eggs. Put shapes or letters on the eggs in fun designs. Dip the eggs like you normally would. Peel them off when you're done dyeing and the eggs are dry. You'll have fun designs in white left behind surrounded by the dye color! [10] X Research source"
    },
    {
      "title": "Draw on the eggs with a white crayon before dyeing them.",
      "content": "Draw on the eggs with a white crayon before dyeing them. Write fun sayings, draw shapes, or make zigzags all over the egg. You could also make polka dots! Once you're done, dye the eggs as you normally would, and the waxed area won't get dyed. [11] X Research source You can remove the wax if you want by holding the egg over a candle (not too close to the flame!) and then wiping the wax off."
    },
    {
      "title": "Wrap rubber bands around the eggs to make stripes.",
      "content": "Wrap rubber bands around the eggs to make stripes. Use wide and small rubber bands. Wrap them in around the eggs so they cross over each other and are fairly tight. Dye the eggs as you normally would. Once they're dry, take the rubber bands off, and you'll have white stripes in the dye. [12] X Research source"
    },
    {
      "title": "Make natural dyes from spices and plants.",
      "content": "Make natural dyes from spices and plants. Create natural dyes by adding 4 cups (950 ml) of water and 2 tablespoons (30 mL) of vinegar to a pot. Then boil the mixture with spices or plants for 30 minutes to get your desired color. [13] X Research source For instance, use chopped beets for pink, chopped purple cabbage for blue, or yellow onion skins for orange. Add enough to fill the pot but still be submerged. Four yellow, pour in 3 spoonfuls of turmeric. When soaking the eggs in the dye, leave them for 30 minutes."
    },
    {
      "title": "Prepare your molds for the chocolate by polishing and oiling them.",
      "content": "Prepare your molds for the chocolate by polishing and oiling them. Rub the inside the molds with a bit of paper towel to get out any debris and smooth them out. Put a little flavorless kitchen oil on another small piece of paper towel. Smooth the oil lightly into the molds. [14] X Research source The oil will help the chocolate pop out."
    },
    {
      "title": "Chop your chocolate into fine pieces.",
      "content": "Chop your chocolate into fine pieces. If you're using a chocolate bar, use a knife to cut it up into small pieces. Smaller pieces will melt more readily. You can also use small chocolate chips if you'd like. [15] X Research source"
    },
    {
      "title": "Heat the chocolate",
      "content": "Heat the chocolate over a double boiler. Place the chocolate in a heat-safe bowl that will sit on top of a pot. Put water in the bottom of the pot and set it on the stove with the bowl of chocolate on top. Bring the water to a simmer, stirring the chocolate on top to help it melt. [16] X Research source If you have a candy thermometer, heat the chocolate to 110 째F (43 째C). You can also melt your chocolate by placing it in the microwave at 50% power for 15-30 seconds at a time, stirring well each time you heat it. Continue doing this until it's completely melted."
    },
    {
      "title": "Let the chocolate cool once it's completely melted.",
      "content": "Let the chocolate cool once it's completely melted. Remove the bowl from the pot using kitchen gloves. Put it aside to cool. Don't let it cool all the way. It should be about body temperature when it's done. [17] X Research source If you have a thermometer, check for the chocolate to reach 95 째F (35 째C)."
    },
    {
      "title": "Add a large spoonful of chocolate to each half mold and swirl to coat.",
      "content": "Add a large spoonful of chocolate to each half mold and swirl to coat. Move the mold around so that the chocolate coats the inside of the mold. If you need to, use a pastry brush to completely coat it. [18] X Research source Pour any extra chocolate back into the bowl."
    },
    {
      "title": "Leave the eggs to cool for 20 minutes.",
      "content": "Leave the eggs to cool for 20 minutes. This will allow the chocolate to harden in the mold before you add the next layer. Make sure they are laying on a flat surface. [19] X Research source To speed up the process, you can stick them in the refrigerator for 5 minutes instead. [20] X Research source"
    },
    {
      "title": "Clean the edge of the mold with a flat edge.",
      "content": "Clean the edge of the mold with a flat edge. Run a ruler or a table knife around the edge of the mold to make a smooth edge. This process will help the 2 halves of the egg fit together in a moment. [21] X Research source"
    },
    {
      "title": "Add more layers in the same way before chilling for an hour.",
      "content": "Add more layers in the same way before chilling for an hour. Pour in the chocolate and swirl it around. Let it cool and then clean the edge of the egg. Keep going for 2-3 layers so you have a nice, solid layer of chocolate in the egg. [22] X Research source Put them in the refrigerator to set for 1 hour."
    },
    {
      "title": "Unmold the eggs and stick the 2 sides together using heat.",
      "content": "Unmold the eggs and stick the 2 sides together using heat. Gently unmold the eggs so you don't break them. Put a baking sheet in the oven for a few minutes to heat up and then take it out once it's warm. Lay the eggs edge-side down on the pan for just a moment. Once you see they're melted a bit, pull the halves up and press them together to form the egg. [23] X Research source Work quickly as your body heat can melt the chocolate. For extra fun, add surprises in the eggs like truffles or small candies."
    }
  ]
}