{
  "url": "https://www.wikihow.com/Make-Crayon-Candles",
  "title": "How to Make Crayon Candles",
  "steps": [
    {
      "title": "Peel a crayon.",
      "content": "Peel a crayon. If the wrapper does not come away easily, you can cut it off using a craft blade, or you can soak them in water for a few minutes. [1] X Research source If you want to make a striped candle, peel some more crayons. You'll need about one crayon per color. [2] X Research source You will need 6 crayons per 1 cup (225 grams) of wax. [3] X Research source"
    },
    {
      "title": "Break the crayon into smaller pieces and set them aside.",
      "content": "Break the crayon into smaller pieces and set them aside. The smaller pieces you break the crayons into, the easier they will melt. Some people find that grating the crayon into flakes helps it melt faster. [4] X Research source If you are making a striped candle, be careful to keep the colors separate."
    },
    {
      "title": "Place a tabbed wick in the middle of the glass candle holder and secure it with a drop of hot wax.",
      "content": "Place a tabbed wick in the middle of the glass candle holder and secure it with a drop of hot wax. [5] X Research source You can also use a drop of super glue or a piece of double-sided tape. Some tabbed candle wicks will be self-adhesive."
    },
    {
      "title": "Place two sticks to either side of the wick to hold it steady.",
      "content": "Place two sticks to either side of the wick to hold it steady. Lay two sticks (such as pencils or popsicle sticks) across the mouth of the candle holder. Sandwich the wick between the two sticks so that it stands up straight."
    },
    {
      "title": "Measure out enough candle wax to fill your candle holder, plus some extra and set it aside.",
      "content": "Measure out enough candle wax to fill your candle holder, plus some extra and set it aside. Try to get the kind of wax that comes in flake or pellet form. It will melt a lot quicker. If your wax comes in blocks, cut it into smaller pieces so that it melts quicker. You will need to add wax to your candle. Many people find that candles made from pure crayon do not burn well. The wax will \"shrink\" when you melt it, so you will need the extra wax."
    },
    {
      "title": "Set up a double boiler.",
      "content": "Set up a double boiler. Fill a saucepan with 1 to 2 inches of water. Place a heat-safe measuring cup into the pot. [6] X Research source"
    },
    {
      "title": "Place the crayons and wax into the glass measuring cup.",
      "content": "Place the crayons and wax into the glass measuring cup. If you want to make a striped candle, you will need to melt each color in a separate batch. If you plan on making a striped candle, don't do the other colors yet. Wait until the first color layer sets."
    },
    {
      "title": "Melt the crayons and candle wax over medium heat, stirring often.",
      "content": "Melt the crayons and candle wax over medium heat, stirring often. This will help the wax and crayon melt more evenly. You can use a spoon to stir. If you don't want to dirty your spoon, use a popsicle stick or a disposable chopstick."
    },
    {
      "title": "Take the measuring cup out of the water using an oven mitt or pot holder.",
      "content": "Take the measuring cup out of the water using an oven mitt or pot holder. It will be very hot, so be careful. Set it down on a heat-safe surface."
    },
    {
      "title": "Consider adding some fragrance.",
      "content": "Consider adding some fragrance. Once the wax is melted, you can add in a few drops of candle fragrance or essential oil. Be sure to stir the wax well to blend everything together."
    },
    {
      "title": "Pour melted wax/crayon mixture into a candle holder.",
      "content": "Pour melted wax/crayon mixture into a candle holder. If you plan on making a layered candle, don't fill the holder all the way. If you plan on making a solid-colored candle, fill it almost to the top."
    },
    {
      "title": "Let the candle harden before adding other colors and layers.",
      "content": "Let the candle harden before adding other colors and layers. [7] X Research source If you add the second layer too soon, it will mix into the first one, and you might end up with an ugly color. It will take about 20 to 30 minutes for each layer to harden. [8] X Research source"
    },
    {
      "title": "Wait for the candle to harden completely before using it.",
      "content": "Wait for the candle to harden completely before using it. This will take several hours. You can speed up the process by putting the candles in the freezer for two to three hours."
    },
    {
      "title": "Trim the wick down to ¼ inch (0.64 centimeters).",
      "content": "Trim the wick down to ¼ inch (0.64 centimeters). If you don't trim the wick down, it will be too long. It won't burn right and will create a fire hazard."
    },
    {
      "title": "Finished.",
      "content": "Finished. You will now have a beautiful candle."
    }
  ]
}