{
  "url": "https://www.wikihow.com/Make-Your-Boyfriend-Feel-Happy",
  "title": "How to Make Your Boyfriend Feel Happy",
  "steps": [
    {
      "title": "Compliment him.",
      "content": "Compliment him. No matter what he says or how he acts about it, your boyfriend (like everyone else) appreciates hearing nice things about himself. We all seek validation for how we look and what we do, especially when it comes from someone we care about. It’s good for your boyfriend’s ego, his pride, and his happiness. [1] X Research source Don’t make this more complicated than it needs to be. If you like the way he laughs, tell him. If you like the way he styles his hair or treats strangers politely, tell him. If you can compliment him on something you know he really cares about, like his basketball skills or his math grades, all the better."
    },
    {
      "title": "Tell him you appreciate him.",
      "content": "Tell him you appreciate him. Relationships are hard work, and require effort from both parties. Take note of the things he does for you and for the relationship, and let him know that you do notice and are thankful. [2] X Research source Does he work a second job so he can take you out on nice dates or save money for an apartment? Does he go out of his way to pick you up so you don’t have to walk home in the rain? Is he nice to your mother? Specifically say to him “I appreciate that you do [this thing] for me and for us.”"
    },
    {
      "title": "Display your affections.",
      "content": "Display your affections. Even if you have a guy that isn’t big on public displays of affection, there are always subtle ways to let him know how you feel. Actions usually speak louder than words when it comes to demonstrating affection. [3] X Research source Hold his hand, and kiss him for no good reason. If he’s not the hand-holding type, let your hand brush against his from time to time, and maybe just slip him a quick peck on the cheek. Even most modern guys like to feel like protectors, so putting your head on his shoulder or sitting on his lap is a good way to create a sense of him protecting you with his embrace. Reader Poll: We asked 125 wikiHow readers how they like to show love to their partner, and 50% of them said through physical affection, like hugs and kisses. [Take Poll]"
    },
    {
      "title": "Give him your attention.",
      "content": "Give him your attention. Simply spending time together is great, but make sure that you are putting your focus squarely on him for at least some of that time. That means putting your phone down, looking him in the eyes, and listening, talking, or just letting him know you’re there. [4] X Research source Make your time together quality time — something you both enjoy and will remember. Life is busy and only seems to get busier, so don’t take your time together for granted. Go on a surprise day trip. Take a surfing lesson together. Just sit and talk with no distractions. [5] X Research source According to esteemed relationship researcher John Gottman, healthy relationships tend to have a ratio of at least five positive interactions for every negative one. The more often you show interest, concern, appreciation, and affection, all of which start by paying attention, the better your odds of reaching the \"magic number\" of positive interactions. [6] X Research source"
    },
    {
      "title": "Be honest with him.",
      "content": "Be honest with him. No boyfriend, girlfriend, or anyone else in a relationship is going to be truly happy if they don’t feel like they are trusted. Being honest, even when it is difficult, is one of the best ways to show trust. [7] X Research source Sometimes the truth does hurt, and it may cause him distress when you speak honestly. But beneath that pain will be an appreciation that you trusted him enough to be honest with him. Admitting to cheating on your boyfriend, for example, is probably one of the most difficult times to be honest. Don't put it off indefinitely, but do wait for a time when you are both calm and can speak without distractions. Choose your words carefully (practice beforehand if it helps), but don't be so vague that your point is not being made clearly. Start with something along the lines of \"I'm sorry to have to tell you this, but you deserve the truth,\" then admit your transgression without making excuses. Apologize and explain, but don't beg or demand forgiveness; say you hope he can forgive you. If you’re afraid to tell your boyfriend the truth about something because you think he’ll break up with you, or are worried he may do something hurtful, then you may need to question the importance of the relationship anyway. If it can’t be built on trust and honesty, it’s not going to last, and neither of you will end up happy."
    },
    {
      "title": "Give him his space.",
      "content": "Give him his space. Of course, a good boyfriend will want to spend a lot of time with you. But he’ll still want and need some time to himself or with his friends. So long as it doesn’t come to the point where he’s regularly ignoring you, let him have it. [8] X Research source You like to have some time to yourself, right? Well, remember that trust is a two-way street. If you can’t let him have space to do his own thing, why should you expect it in return? Every solid relationship requires some personal space. Some need more than others. So long as he’s with you when it counts — that is, when you need him, for a ride or for a shoulder to cry on — you should be glad. Don’t make him be with you, make him want to be with you."
    },
    {
      "title": "Don’t expect to change him.",
      "content": "Don’t expect to change him. It is a sure thing that your boyfriend isn’t perfect, no matter how great he is. No doubt you find yourself thinking of the little things you’d like to change about him to make him even better. You can inspire people to change, or help them to change, but you should never expect them to change. If you can’t take him as he is, don’t take him. [9] X Research source Maybe your boyfriend is a slob, or is always running late, or takes jokes a bit too far sometimes. You can talk to him about your concerns, and provide support if he wants to become better organized, more reliable, or more sensitive. But if you feel like you need to change the essence of who he is, then you probably aren’t with the right guy."
    },
    {
      "title": "Make him happy.",
      "content": "Make him happy. Yes, many guys do enjoy a good meal, love watching sports, and think about sex almost constantly. But, you aren’t trying to make “many guys” happy — you want to make your boyfriend happy. Showing that you know his particular wants and needs is perhaps the best way into a man’s heart. The advice in this section may be applicable to your boyfriend, or it may not be. Take it with a grain of salt, and rely on your best judgment."
    },
    {
      "title": "Keep up your appearance.",
      "content": "Keep up your appearance. Your boyfriend may be more than content to hang around with you while you’re in sweats, but deep down he probably wants to see you make the effort to get “fancied up” for him at least sometimes. At very least, keeping up with basic hygiene and showing that you care about how you present yourself to the world will probably make him happier. [10] X Research source Yes, there is a superficial element to it, but your boyfriend almost certainly chose to be with you in part because he was attracted to your looks, and he wants to continue to be attracted to them. The longer you’re together, his love for you as a whole person will make your appearance on the outside beautiful to him no matter what. But, the fact that you’re putting in the effort to be attractive can show that you care about both yourself and him."
    },
    {
      "title": "Cook him a nice meal and let him watch sports.",
      "content": "Cook him a nice meal and let him watch sports. This might be the ideal Sunday afternoon for many guys. If your boyfriend likes food and football, indulge him at least sometimes. Maybe he wants you to watch the game with him, or maybe he’d rather just watch it with his friends. Use your knowledge of him to decide what’s best. Of course, maybe your guy hates sports and is on a strict diet. As mentioned, this isn’t “one size fits all” advice. However, the larger principle — giving your boyfriend what makes him happy sometimes, even if it is a bit annoying for you — remains true for most any type of guy. All relationships require some sacrifices and compromises. Sometimes you have to let him have things his way, in spite of your instincts. Of course, you deserve to expect the same from him as well. [11] X Research source"
    },
    {
      "title": "Satisfy his desires.",
      "content": "Satisfy his desires. Yes, we’re talking about intimate relations here. Most guys think about sex a lot, and want it a lot. Odds are, no matter how much (or how often) you give, he’ll want more. While you should never feel obligated to do anything you’re not ready for, satisfying his wants at whatever level of intimacy you are at is part of making him happy. [12] X Research source Many guys have an amazing capacity to ignore tiredness, stress, or a whole host of other obstacles or problems when there’s an opportunity for some romantic action. Your boyfriend may well be “in the mood” far more often than you are. Try to meet him in the middle. Of course, no matter how long you’ve been together, no matter what you’ve done or not done, you always have the right to say no. If he can’t accept that, get a new boyfriend."
    }
  ]
}