{
  "url": "https://www.wikihow.com/Heal-Your-Face-After-Picking",
  "title": "How to Heal Your Face After Picking",
  "steps": [
    {
      "title": "Wash your face gently twice per day with a mild soap.",
      "content": "Wash your face gently twice per day with a mild soap. Use a gentle, fragrance-free cleanser, warm water, and a soft, clean, lint-free towel. Wipe your face gently and dab any scabs or wounds with the towel—don’t scrub your face! Rinse your face by splashing it with lukewarm or cool water. [1] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Wash your face twice per day—when you wake up and when you’re getting ready for bed. Don’t use face scrubs, astringent cleansers, or scented body soaps, unless advised by your primary care doctor or dermatologist. Resist the urge to wash your face repeatedly in the hopes of clearing your skin faster. You’ll simply strip away moisture and needed oils from your skin. Healing your skin takes time, but it will happen!"
    },
    {
      "title": "Dry your washed face by patting it with a soft, clean towel.",
      "content": "Dry your washed face by patting it with a soft, clean towel. Choose a lint-free towel that hasn’t been used since last being laundered. Dab it softly over your face, taking special care to be extra gentle on any scabs or wounds. Don’t worry about getting your face completely dry. Just remove any surface moisture."
    },
    {
      "title": "Apply an OTC antibiotic ointment or petroleum jelly to any scabs or wounds.",
      "content": "Apply an OTC antibiotic ointment or petroleum jelly to any scabs or wounds. Use a clean finger or the tip of a cotton swab to apply just enough ointment to cover the scab or wound with a very thin coating. Just dab the ointment on—you don’t need to rub it in. Apply the ointment once or twice per day, right after washing and drying your face. [2] X Research source Only apply the ointment to scabs and wounds—not all over your face. Common OTC antibiotic brands include Neosporin and Polysporin."
    },
    {
      "title": "Cover larger scabs and wounds with bandages, at least overnight.",
      "content": "Cover larger scabs and wounds with bandages, at least overnight. Wounds heal faster when they’re cleaned, covered, and moist from antibiotic ointment or petroleum jelly. Additionally, a bandage will make an antibiotic ointment more effective. Ideally, it’s best to wear bandages over wounds and scars until they’re healed, but that may not be practical on your face. Apply bandages after washing your face at night and change them daily. [3] X Research source You may find that using sterile gauze with small strips of medical tape is gentler on your skin and easier to use than adhesive bandages. Replace the bandages every time you wash your face, but at least once per day in any case."
    },
    {
      "title": "Moisturize your face gently, if desired, when not wearing bandages.",
      "content": "Moisturize your face gently, if desired, when not wearing bandages. Apply a thin layer of a fragrance-free, oil-free, gentle moisturizer in the morning, for instance, instead of applying antibiotic ointment and bandages. Keeping your skin (and scabs) softer and more hydrated promotes healing. [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Consult your dermatologist or primary care physician if you’d like advice on choosing a gentle face moisturizer."
    },
    {
      "title": "Skip wearing makeup while your face heals.",
      "content": "Skip wearing makeup while your face heals. This one’s tough, because you’ll want to cover up those scabs! However, coating scabs and wounds with makeup slows the healing process and may even encourage infections. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you really want to put on some makeup—for a special event, for instance—apply it right beforehand and remove it as soon as possible. Use as little makeup as is necessary. Instead of using makeup, try wrapping a bag of ice in a clean cloth and holding it to your face for 10-15 minutes. This may reduce the redness and swelling, at least temporarily."
    },
    {
      "title": "Change your diet to see if it helps heal your skin.",
      "content": "Change your diet to see if it helps heal your skin. Blood sugar spikes cause inflammation in your body and may trigger acne flare-ups. Eating a low-glycemic index diet may help control these spikes. Build your meals around lean protein, fresh fruits and veggies, and whole grains. Additionally, avoid refined carbohydrates, processed foods, and sugary treats. [6] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source Since intermittent fasting may help balance your blood sugar, it's possible that it will also help improve your skin. If you want to try intermittent fasting, eat all of your meals in an 8-12 hour window each day and fast for the remaining hours. For instance, a typical time frame for meals is 10:00 a.m. to 6:00 p.m. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Consult your doctor if you notice signs of infection.",
      "content": "Consult your doctor if you notice signs of infection. Cleaning and covering your wounds and scabs greatly reduces the chance of them becoming infected. However, get in touch with your doctor if you notice any of the following symptoms: [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Increased or severe pain, swelling, or redness. Streaks of redness around the scab or wound. Yellowish-green discharge coming from the scab or wound. A foul odor coming from the scab or wound. Persistent bleeding. A fever at or above 38 °C (100 °F) for 4+ hours."
    },
    {
      "title": "Cover your blemishes or your hands to create picking barriers.",
      "content": "Cover your blemishes or your hands to create picking barriers. While you’re at home, take small pieces of medical tape and stick them on the pimples or other blemishes that you’re tempted to pick at. The tape serves as both a picking barrier and a reminder (when you touch it with your finger) not to pick. [9] X Research source Alternatively, put on lightweight gloves—like stretchy knit winter gloves. It’s much harder to pick when your fingernails are covered!"
    },
    {
      "title": "Keep your hands occupied with other activities.",
      "content": "Keep your hands occupied with other activities. This is particularly effective if you pick your face out of boredom or as an unconscious habit. Try holding a stress ball, grip strengthener, or fidget spinner in your picking hand—or both hands if needed! Avoid unhealthy activities to keep your hands occupied, like smoking."
    },
    {
      "title": "Follow a good skin care routine so you have less reason to pick.",
      "content": "Follow a good skin care routine so you have less reason to pick. This is always a good idea, but especially if you tend to pick at pimples or other skin blemishes. Try the following to keep your skin more clear and less pick-worthy: [10] X Research source Use a gentle skin cleanser twice per day. If you need an acne-fighting cleanser, ask your primary care doctor or dermatologist for recommendations. Apply a fragrance-free, lightweight, oil-free, non-comedogenic (non-pore-blocking) moisturizer after cleansing your face. For added protection, look for a moisturizer with sunscreen. Change your pillowcases and bed sheets at least twice per week. Eat a healthy diet , exercise regularly, and get enough sleep . These are all great for your skin and the rest of your body!"
    },
    {
      "title": "Trim your nails so they cause less damage when you do pick.",
      "content": "Trim your nails so they cause less damage when you do pick. No matter how hard you try, you’re still going to pick your face sometimes—you’re only human after all! If you keep your nails trimmed short, you’ll greatly reduce your chances of breaking your skin. Bacteria also like to hide under your nails, so you’ll reduce your odds of infecting any wounds on your face. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Use nail clippers to cut back the length and remove any sharp corners, and a nail file to smooth out any jagged edges. Make sure your clippers and file are clean. Sanitize clippers and metal files by soaking them in rubbing alcohol for 5 minutes, then rinsing them with clean water."
    },
    {
      "title": "Investigate when and why you pick at your face.",
      "content": "Investigate when and why you pick at your face. Do you scratch your face a lot because it gets really itchy? Do you pick at your face when you’re stressed out, or because you feel like you can get rid of those blemishes by picking them off? Or, do you pick out of boredom? Take notes on when and why you tend to pick as the first step toward finding a solution. [12] X Trustworthy Source International OCD Foundation Non-profit organization dedicated to helping everyone affected by Obsessive Compulsive Disorder and related disorders to live full and productive lives. Go to source Skin picking disorder (dermatillomania) is a real thing experienced by many people, but it may not be the cause of your face picking. You may have a skin condition that causes discomfort or another physical or psychological reason for picking. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Spend less time looking in the mirror if it triggers picking.",
      "content": "Spend less time looking in the mirror if it triggers picking. You may notice that you pick your face while looking in the mirror (or right afterward), especially if you have blemishes that bother you. Reducing your time in front of mirrors may eliminate one of your major triggers for face picking. Cover up or remove non-essential mirrors in your home. You might even consider covering your bathroom mirror except for when you actually need to use it. Set a timer when you need to look in the mirror, such as when getting ready in the morning. Give yourself only a set amount of time—such as 5 minutes—to use the mirror."
    },
    {
      "title": "Use positive affirmations when you feel the urge to pick.",
      "content": "Use positive affirmations when you feel the urge to pick. It’s natural to scratch your face occasionally when you have an itch, and there’s no reason to beat yourself up over that. If you get frequent urges to scratch or pick, though, remind yourself that you don’t have to or need to, and that it is something you can control. Try quietly saying affirmations like the following to yourself when you get the urge to pick or look in the mirror: “My skin is fine, and I don’t need to pick at it.” “Everyone has blemishes, and mine will go away on their own if I take good care of my skin.” “I want my skin to be healthy, so I choose not to pick at it.” “It’s okay that I was just picking at my face. I will keep working on not picking.”"
    },
    {
      "title": "Schedule a doctor’s visit to diagnose and treat any medical issues.",
      "content": "Schedule a doctor’s visit to diagnose and treat any medical issues. If you have a skin condition that drives your urge to pick at your face, getting an appropriate diagnosis and treatment plan may provide the solution you’re looking for. Visit your primary care doctor or dermatologist, and bring along your notes on when and why you tend to pick, along with any other questions or concerns that you have. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you have a skin condition like eczema, for instance, your doctor may prescribe a topical corticosteroid or other medication. Treating the cause of your skin discomfort may cut back on your urge to pick. Similarly, getting medical treatment for severe acne may reduce your urge to pick at blemishes."
    },
    {
      "title": "Work with a mental health professional to address psychological factors.",
      "content": "Work with a mental health professional to address psychological factors. Removing physical temptations to pick at your face won’t solve the problem if it’s primarily psychological. Get a referral from your doctor and meet with a mental health professional who can help you develop strategies for managing skin picking disorder or related conditions. Your therapist may use cognitive behavioral therapy (CBT), for example, to help you replace your picking habit with other positive habits. In some cases, you may be prescribed antidepressants or other medications in order to deal with the psychological roots of your picking behavior. Never feel ashamed to get help! Skin picking disorder is very real and usually very treatable—if you get the right help."
    }
  ]
}