{
  "url": "https://www.wikihow.com/Make-Tape",
  "title": "How to Make Tape",
  "steps": [
    {
      "title": "Adhere strips of clear double-sided tape to wax paper.",
      "content": "Adhere strips of clear double-sided tape to wax paper. Tear a sheet of wax paper that is as long as you’d like your finished rolls of faux washi tape to be—6–12 in (15–30 cm) is a good length range. Then, unroll strips of double-sided tape and stick one side of each strip along the length of the wax paper. [2] X Research source Clear double-sided tape comes in rolls just like single-sided clear tape. You can easily fit 6-8 strips of tape across a sheet of wax paper. True washi tape is made of paper derived from trees and shrubs native to Japan. It has a masking tape-like texture, but is better known for having intricate decorative designs on it."
    },
    {
      "title": "Trim the excess wax paper around each strip of tape.",
      "content": "Trim the excess wax paper around each strip of tape. Use scissors to cut the wax paper between each strip of tape, then cut around the edges of each strip of tape. Get as close as you can to the edges of the tape—sharp crafting scissors are best for this job. [3] X Research source The wax paper is just there to preserve the sticky side of your finished tape."
    },
    {
      "title": "Press the sticky side of each strip of tape onto a sheet of tissue paper.",
      "content": "Press the sticky side of each strip of tape onto a sheet of tissue paper. Gather up several sheets of tissue paper with designs that catch your eye, and lay them flat on the table. Adhere your tape strips to the tissue paper and press them down firmly. [4] X Research source If you don’t mind making shorter rolls of tape, you can unfold decorated napkins and use them instead. Scrapbook paper is another option. If you’re not concerned with your tape having a washi-style papery feel, you can use wrapping paper."
    },
    {
      "title": "Trim off the excess tissue paper around the tape strips.",
      "content": "Trim off the excess tissue paper around the tape strips. In this case, you may be able to simply tear the paper away around the edges of each tape strip. Or, as with the wax paper, you can use crafting scissors. [5] X Research source Work carefully to create neat edges along your tape strips. Most people use washi tape for decorative purposes, so you want the design pattern to look good."
    },
    {
      "title": "Wrap the tape around a cut-to-width paper towel roll tube.",
      "content": "Wrap the tape around a cut-to-width paper towel roll tube. Use scissors to cut an empty paper towel roll tube into several smaller tubes. Make each one no more than 0.5 in (1.3 cm) wider than your tape strips. Then, wrap each strip of your decorated tape around one of these tubes, with the waxed paper side down. [6] X Research source You can secure the rolled tape in place with a twist-tie or string. Just feed the string or tie through the hole in the tube and around the tape roll near its end, then tie or twist it in place. When you're ready to use the tape, just unroll the length you need, cut it, and peel away the wax paper backing to reveal the sticky side."
    },
    {
      "title": "Unroll lengths of toilet paper to match your planting rows.",
      "content": "Unroll lengths of toilet paper to match your planting rows. For instance, if your garden has 6 planting rows that are each 8 ft (2.4 m) long, unroll 6 strips of toilet paper that are each that length. Lay the strips out on an open area of flooring—preferably in a garage, basement, or workshop. However, if your garden has narrow planting rows (less than 1 ft (30 cm) apart), you only need half as many toilet paper strips as you have planting rows, because you'll be cutting the strips in half lengthwise. You’ll be working with glue and permanent marker, so you may not want to do this job on your nice living room rug. Save any empty toilet paper roll tubes. In fact, try to save up empty tubes for several weeks beforehand, so you have as many tubes as planting rows."
    },
    {
      "title": "Trim the paper lengthwise if you have narrow planting rows.",
      "content": "Trim the paper lengthwise if you have narrow planting rows. If your rows will be spaced at least 1 ft (30 cm) apart, leave the toilet paper as-is. If your row spacing is narrower, cut each strip of toilet paper in half lengthwise with scissors. Alternatively, you could cut a length of paper towel into 3-4 thinner strips for use in narrow planting rows."
    },
    {
      "title": "Measure and mark your ideal seed spacing along each paper strip.",
      "content": "Measure and mark your ideal seed spacing along each paper strip. If, for instance, you’re using seeds that should be planted 6 in (15 cm) apart, use a ruler and permanent marker to place dots every 6 in (15 cm) along the strip. Center the dots widthwise on the toilet paper. Look on the seed package for the recommended spacing. If you don’t have a package, search online for the best spacing for that particular seed."
    },
    {
      "title": "Place a small dab of all-purpose glue on each marker dot.",
      "content": "Place a small dab of all-purpose glue on each marker dot. The same white glue that kids use in school (also known as PVA glue) is ideal for this job. Apply just a tiny dot of glue on top of each marker dot along the length of each toilet paper strip. Glue sticks, paste, and rubber cement will shred the delicate toilet paper, while super glue might soak through the paper and stick to your floor."
    },
    {
      "title": "Stick a single seed to each glue dab.",
      "content": "Stick a single seed to each glue dab. Pour your seeds out on a plate, then use your fingers or tweezers to pick up a single seed at a time. Drop the seed onto the first dot of wet glue along your paper strip, and keep going until you’ve “seeded” every glue dot. You’ll have around 10-15 minutes to work before the glue dries. If you don’t think you can stick all your seeds in place by then, only add glue to a single strip of toilet paper at a time."
    },
    {
      "title": "Roll up the seed tape after the glue dries.",
      "content": "Roll up the seed tape after the glue dries. Give the glue at least 15 minutes to dry thoroughly. Test it with your finger to confirm it’s dry. Then, roll each seed tape strip onto an empty toilet paper tube. Label each rolled-up strip with a marker if you have several different types of seed strips. Store the seed tapes in a cool, dry place—for instance, in a paper lunch sack in your pantry—until you’re ready to plant them. This is a good job to do within about a month of when you intend to plant the seeds."
    },
    {
      "title": "Unroll, cover, and soak the paper strips to plant the seeds.",
      "content": "Unroll, cover, and soak the paper strips to plant the seeds. When it’s time to plant, simply unroll each strip of paper over its intended planting row. Then, cover the paper lightly with soil, to the recommended depth on the seed package (for instance, 0.5 in (1.3 cm)). Water the area thoroughly and keep it moist (as per the seed instructions) until you see seedlings appear. You can unroll the paper seed-side up or down—it doesn’t make a difference. If it’s a breezy day, use small rocks to keep the seed strips from blowing away while you unroll them."
    },
    {
      "title": "Cut a 2 in × 4.5 in (5.1 cm × 11.4 cm) rectangle from an index card.",
      "content": "Cut a 2 in × 4.5 in (5.1 cm × 11.4 cm) rectangle from an index card. You can also use thin cardboard for this task. If the duct tape you’ll be using is wider or narrower than 2 in (5.1 cm), cut the card to that width instead. [7] X Research source Most standard duct tape rolls sold in the U.S. are 2 in (5.1 cm) wide. You can make the card a bit longer or shorter than 4.5 in (11 cm) if desired, but this is a good pocket-size length. You can use an expired or used-up gift card as the base for your pocket-size duct tape roll, instead of a cut index card."
    },
    {
      "title": "Wrap a length of duct tape around the entire card.",
      "content": "Wrap a length of duct tape around the entire card. Cover the entire card (both sides) lengthwise in a single strip of duct tape, allowing the tape to overlap itself by about 1 in (2.5 cm). Press the tape firmly onto the card and itself at the overlap. [8] X Research source This piece of tape is a permanent application, intended to make it easier to dispense the tape you’ll add on top of it."
    },
    {
      "title": "Wrap a single strip of tape around the card several times.",
      "content": "Wrap a single strip of tape around the card several times. Work your way around the card lengthwise as many times as you prefer. Press the tape lightly to the layer beneath it as you work. [9] X Research source You can probably fit around 15 ft (4.6 m) of tape on the card before it becomes too bulky for your convenience. Simply peel and tear the tape as needed to use it. You can refill the card with tape as often as you like."
    }
  ]
}