{
  "url": "https://www.wikihow.com/Get-Your-Ex-to-Fall-for-You-Again",
  "title": "How to Get Your Ex Back Quickly",
  "steps": [
    {
      "title": "Check if your ex is still available.",
      "content": "Check if your ex is still available. Before you launch into a quest to get your ex back, check to see what their relationship status is. After all, if it’s been a while since the two of you broke up, your ex might’ve moved on and started seeing someone else. If that’s the case, it’s better to avoid any drama and start pursuing other people instead. [1] X Research source Steer clear of reuniting with your ex if they’re seeing someone else. Focus on your own hobbies and interests, see other people, and be patient."
    },
    {
      "title": "Consider why you want your ex back.",
      "content": "Consider why you want your ex back. While the relationship might’ve been great, sometimes it’s better to leave an old dynamic in the past or let go of a former partner. Before you start trying to get your ex back, consider your motivations. [2] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. Some honest self-reflection can help you avoid reigniting a relationship that’s toxic or that doesn’t serve your best interests. [3] X Research source Good reasons for getting back together: Your timing was off the first time you were together. You needed more time to get over a previous relationship. You have developed a new appreciation for your ex. Bad reasons for getting back together: You’re scared of being alone. (Of course, it’s natural to be lonely after an old relationship goes south, but that doesn’t mean you should plunge back into that relationship.) You miss what’s familiar to you. (Again, this is a completely normal feeling, but that doesn’t mean you should get back together.) You’re jealous of their new relationship. (This is a totally understandable experience, but it’s not exactly a healthy reason to start afresh with an ex.) Enlist a trusted friend, family member, or therapist to consider why you want to get back with your ex. They can help you tease out some less-than-stellar reasons and might even help you move on."
    },
    {
      "title": "Determine if the relationship was healthy and worth reviving.",
      "content": "Determine if the relationship was healthy and worth reviving. In addition to reviewing the reasons for wanting to reunite with an ex, reflect on your old relationship. Did it bring out the best or the worst in each of you? Were you both encouraging to one another and positive forces in each other’s lives? If you broke up because the relationship was negative for one or both of you, you may want to hold off on getting back together. [4] X Research source For example, if you two fought all the time or did not actually enjoy spending time together, then it’s probably best for you and your ex to part ways. Some couples are so focused on getting back together that they don't acknowledge the issues and problems that prevented them from having a functional relationship. Try to give your past relationship a sober and realistic assessment. It’s okay to recognize that it wasn’t healthy and to cut your losses."
    },
    {
      "title": "Make a list of pros and cons if you’re unsure about reuniting.",
      "content": "Make a list of pros and cons if you’re unsure about reuniting. If you have a lot of mixed feelings about getting back together with your ex, take a moment to sort out the negative and positive aspects of your dynamic. Take out a pen and paper or a word doc and make a list with two categories: pros and cons. Be honest with yourself as you make this list and don’t omit anything just because it seems small or insignificant. List everything you can to get a good picture of how you and your ex function together: [5] X Research source Pros They use my love language, praise and words of affirmation. They are very warm and affectionate. They're kind to my friends and family. They're creative and interesting. Cons Sometimes they're flaky. They aren't that great with logistics. They don't notice when I'm having a hard time. They aren't that motivated or driven."
    },
    {
      "title": "Go “no contact” for 30 days.",
      "content": "Go “no contact” for 30 days. Keep your distance and allow some time for things to settle. [6] X Expert Source Connell Barrett Dating Coach Expert Interview. 24 September 2019. Take this opportunity to process the breakup, reflect on your emotions, and prepare to move on. Who knows—after this period, you might decide that you don’t actually want your ex back. What’s most important is that you empower yourself and heal from the breakup. [7] X Research source When you go silent, you’ll also create a sense of intrigue and mystique. Your ex might wonder what you’re up to and start to pine for you. Avoid texting your ex or responding to their texts until you’ve had enough time to process the breakup. It may be hard to resist staying in contact with them, but it’s for the best—you’re better off talking to your ex when you’re in a good headspace."
    },
    {
      "title": "Focus on yourself.",
      "content": "Focus on yourself. Even if you’re 100% sure that you want to get back together with your ex, it’s important to put yourself first. Let loose and put your ex on the backburner for a bit—it’ll be worth it in the end. [8] X Expert Source Julia McCurley Certified Professional Matchmaker Expert Interview. 30 September 2021. After all, it’s incredibly alluring to be confident and empowered. Use the extra time that you have to improve yourself. Some ways you might prioritize yourself include: [9] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Taking up a new hobby. Improving your health with a new exercise and diet regimen. Starting a journal to record your thoughts and feelings. Spending more time with your friends. Reader Poll: We asked 302 wikiHow readers what change they would want to make before trying to date their ex again, and 62% agreed that they want to focus on maturing as a person . [Take Poll] The best way to return to the relationship is as a healthier, happier version of you who's grown during the time apart."
    },
    {
      "title": "Reestablish contact with your ex.",
      "content": "Reestablish contact with your ex. Start off slow—all you need to do is send a super chill text, which is a lot more low-key and low-pressure than a phone call or a long email. [10] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. Feel free to be friendly since a positive tone is always endearing. Throw in an emoji or two to lighten things up. [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Keep the message light and casual. [12] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. Don’t say anything intense like, “I can’t live without you.” Tell your ex about something funny that happened to you or something interesting that reminded you of your ex. For example, you might say, “I dominated at Scrabble the other night! 😝 Probably because you weren’t there to upstage me!” or “Hey, stranger. 😉 There’s a new drive-in theater in town. It reminded me of my favorite movie buff.” Make sure that you’re sober when you reconnect with your ex. Drunk texts or calls are a recipe for disaster."
    },
    {
      "title": "Act casual when you talk to your ex.",
      "content": "Act casual when you talk to your ex. As you continue to communicate with your ex, hold off on telling them that you want to get back together. Remember—right now, you’re just testing the waters. You’ll have a better chance with your ex because you’ll seem calm and like you’re in a good place. Your easygoing attitude will be incredibly attractive. [13] X Research source If you happen to bump into your ex, the same rules apply: be laidback. Engage in some small talk, and avoid any chats about reigniting your relationship. Your ex will probably be impressed by how well you’re doing after the breakup."
    },
    {
      "title": "Meet up for coffee or lunch.",
      "content": "Meet up for coffee or lunch. Get together during the day, which is less serious and intimate than a nighttime meeting—you don’t want to give off the impression that you want to be romantic just yet. Break the ice, catch up, and build rapport. During this time, you can decide if you’d like to keep pursuing your ex. [14] X Research source Make sure you look fantastic: wear your best outfit , put on a signature scent, and style your hair. It’s totally fine to look your best when you reunite. When your ex sees you, you might fire up a strong attraction right away. Kick things off with a conversational starter. For example, ease into things with a simple, “Thanks for coming to see me! How’ve you been lately?”"
    },
    {
      "title": "Remind your ex of happy memories.",
      "content": "Remind your ex of happy memories. Getting really nostalgic about the good times you shared together is an excellent way to rekindle an old flame. [15] X Expert Source Connell Barrett Dating Coach Expert Interview. 24 September 2019. Steer clear of any discussions about what went wrong, and instead dive into what felt right. Whether it was a camping trip or all the times you cooked together, talking about any warm and romantic moments are a great way to make your ex miss your relationship. [16] X Research source Later, you can have a really practical conversation about ways you’d need to improve on your relationship. Right now, just reminisce about positive experiences."
    },
    {
      "title": "Be the person your ex fell in love with.",
      "content": "Be the person your ex fell in love with. Consider what attracted them to you in the first place and play those assets up. [17] X Expert Source Connell Barrett Dating Coach Expert Interview. 24 September 2019. For example, was your ex nuts about your sense of humor and all the ways you made them laugh? Were you really witty and analytical? Whatever the case is, showcase parts of yourself that they adored and they’ll be smitten all over again. [18] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Although it might be hard, it’s important to wait things out. Bear in mind that your dynamic is different right now and that things won’t be like a committed relationship right away. Even if your ex doesn’t respond to your texts right away or doesn’t always want to hang out, stay optimistic. Any contact with your ex is a good sign that things can develop. [19] X Research source"
    },
    {
      "title": "Watch for signs of interest.",
      "content": "Watch for signs of interest. Is your ex warm, friendly, and excited to hear from you? Do they make an effort to reach out, and are you both equally invested in spending time with one another? [20] X Expert Source Erika Kaplan Dating Coach Expert Interview. 1 October 2020. If the answer to all these questions is “yes,” then it’s safe to assume that you have a shot with your ex. [21] X Research source Paying attention to body language can also clue you in on their feelings. [22] X Expert Source Lisa Shield Dating Coach Expert Interview. 11 March 2021. If they blush around you or give you PDA, like lots of hugs or light touches, they're probably flirting with you. [23] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source To save yourself from disappointment, just make sure not to set your expectations too high. Right now, your ex might just want to be friends. Wait for them to speak up about what kind of dynamic they want."
    },
    {
      "title": "Say what’s on your mind.",
      "content": "Say what’s on your mind. At some point, in order to move past just a friendship, you’ll have to confess how you feel. Starting this conversation might be a little awkward, but it’ll be worth it so you can put everything out in the open. If your ex doesn’t bring up the possibility of getting back together, do it yourself. Be sensitive and warm, and indicate a willingness to work on things—your authenticity may really win them over. [24] X Research source Try saying something like, “Since we have had some time apart, I’ve really grown and I think that I’d like to give our relationship another chance. Does that interest you at all?"
    },
    {
      "title": "Discuss what went wrong the first time you were together.",
      "content": "Discuss what went wrong the first time you were together. Inevitably, you and your ex will need to address the reasons why you broke up. Since your ex may be skeptical of your growth or willingness to change, you may need to reassure them. Make sure to share how you’ve improved upon yourself and taken action to fix anything that was a problem, like a failure to communicate. Your honesty and openness will help your ex realize that the relationship won’t hit the same snags the second time around. [25] X Research source Use \"I\" language so that you focus on what you were responsible for in the relationship: \"I know that I was very spotty with communication and left you in the dark on several occasions. I was not as present and available as I should have been.\" Be solution-oriented so your ex feels optimistic: \"I will make sure to touch base every day and be an active listener. You deserve someone who's open to talk to you about what you're struggling with. I want to be that person for you.\""
    },
    {
      "title": "Commit to change.",
      "content": "Commit to change. If you’ve told your ex that you’ll alter your behavior in some way, keep true to your promises. Your follow-through and dedication to positive habits, like giving your ex more praise or attention, will make a good impression on your ex. Make sure you and your partner are clear on what you both need to work on. For you both to stand the test of time, you’ll have to be a team. [26] X Research source Other topics you both may wish to discuss are how to improve your communication, how to listen better, or how to establish better boundaries. [27] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018."
    },
    {
      "title": "Be willing to accept rejection.",
      "content": "Be willing to accept rejection. In some cases, reconciliation just isn’t possible. If your ex isn’t willing to give your relationship another try, respect them for being honest with you. Don’t pressure them to get back together: simply thank them for stating their truth. Chances are, their decision is for the best, and it’s a great time for you to move on and see what else is out there. [28] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source If your ex establishes boundaries, then respond respectfully. For example, say, \"Thank you for telling me where you're at. I wish you the best.\" Work on moving on from your relationship so that you can end an attachment to an ex who no longer wishes to stay in touch."
    }
  ]
}