{
  "url": "https://www.wikihow.com/Handle-a-Mother-Dog-Refusing-to-Stay-with-Her-Puppies",
  "title": "How to Handle a Mother Dog Refusing to Stay with Her Puppies",
  "steps": [
    {
      "title": "Place the whelping box in a spot that's near you so she feels at ease.",
      "content": "Place the whelping box in a spot that's near you so she feels at ease. If your dog has a close bond with you or suffers from separation anxiety, they may be leaving the whelping box to stay near you. While generally the whelping box should be located in a quiet and calm part of the home, if you suspect that this is the problem, you might want to relocate the box to an area where you spend most of your time. [1] X Research source"
    },
    {
      "title": "Aid the dam in nursing.",
      "content": "Aid the dam in nursing. Nursing releases hormones that helps bond the mother and the puppies. If the mother initially appears disinterested in her puppies, you might be able to start the production of these hormones by introducing the puppies to her teat. To do this, command the dam to lay down and gently ease her to her side so that the teats are exposed. Hold her down gently. Be sure to comfort her with kind words and petting. Have another person introduce the puppies one by one to her teats to nurse. After a few times, you may be able to convince the mother to nurse on her own. [2] X Research source If the dog snarls, growls, or appears aggressive towards the puppies, remove them immediately from this situation. If this does not work, you will have to feed the puppies by hand, using a bottle or syringe. If the dog nurses her puppies but refuses to warm or stay by their side, you will have to keep them warm yourself."
    },
    {
      "title": "Talk to your vet.",
      "content": "Talk to your vet. Your vet may have specific instructions to help your dog based on her medical history, breed, and environment. If stress or anxiety is the problem, your vet can prescribe medication that might help your dog accept her puppies. You should tell the vet whether the mother dog is aggressive or indifferent to her puppies. Try to determine when the mother abandoned her puppies. For example, did she reject them at birth or did she stop paying attention to them after a week or two?"
    },
    {
      "title": "Create a calm environment.",
      "content": "Create a calm environment. If the area where the whelping box is located is noisy or busy, the dam might become stressed. This may cause her to stop nursing or to ignore the puppies. To help encourage a calm environment, make sure that the whelping box is in a quiet part of your home. There should not be much traffic through this room. [3] X Research source Try to keep the whelping box clean to create a comfortable environment for both the mother and the puppies. If you have other pets, you should block their access to the whelping box. The presence of other animals may stress the dam out. You can start introducing your other pets to the puppies around 5 or 6 weeks."
    },
    {
      "title": "Check the dam’s nipples.",
      "content": "Check the dam’s nipples. Carefully look over the mother’s teats on her underside. If you notice redness, swelling, pus, abscesses, or discolored milk, the dam might have mastitis. Mastitis occurs when the mother’s milk ducts become inflamed. This makes lactation and nursing very painful for the mother dog. If it is severe, the mother can become aggressive towards the puppies or refuse to nurse. A vet can treat mastitis with antibiotics. [4] X Research source You can relieve the pain of mastitis by applying warm water compresses to the mother’s teats. You can help stimulate the flow of milk by gently pressing the teat between your forefinger and thumb. Be aware that if the dog is in extreme pain, she may become aggressive."
    },
    {
      "title": "Watch for restlessness or spasms.",
      "content": "Watch for restlessness or spasms. If your dog refuses to nurse and starts pacing excessively, she may have milk fever. Milk fever, also known as eclampsia, may cause the mother to refuse the puppies. Symptoms begin with restlessness or anxiety. The mother may start to walk with a stiff or wobbly gait. This can develop into tremors, spasms, heavy panting, and fever. If you suspect that the dam is suffering from these symptoms, take her to the vet immediately. If untreated, it can lead to death. [5] X Research source Symptoms of milk fever typically begin between three and five weeks after the puppies are born. [6] X Research source"
    },
    {
      "title": "Take the dogs to the vet.",
      "content": "Take the dogs to the vet. Even if you do not notice the symptoms of mastitis or milk fever, there may still be an underlying medical cause for the mother’s abandonment. Take both the mother and the puppies to the vet. The vet will do bloodwork and other tests to determine what is going wrong. Occasionally, something might be wrong with the puppies, causing the mother to abandon them. Your vet may be able to help them thrive. [7] X Research source If the vet determines that there is no medical cause, they can help you try to encourage the mother dog to accept the puppies. The vet may also recommend that you feed and care for the puppies yourself."
    },
    {
      "title": "Place a DAP collar on the dam.",
      "content": "Place a DAP collar on the dam. Dog Appeasing Pheromone (DAP) is a natural chemical signal that a mother dog releases when lactating to help calm and soothe her puppies. It has also been shown to reduce stress and anxiety in adult dogs. If your mother dog is refusing to nurse her puppies, placing a DAP collar on her can help encourage her to accept her puppies. [8] X Research source DAP also comes in spray bottles. You can spray parts of the whelping box, but you should not spray the dam or the puppies directly with it. You can buy DAP sprays, diffusers, and collars online or at some pet stores. Your vet may also carry them."
    },
    {
      "title": "Feed the puppies",
      "content": "Feed the puppies every 2 hours. Puppies require around-the-clock care and feeding. They need to be fed a puppy-milk substitute every 2 to 3 hours. Puppies can be bottle or tube fed. Special puppy bottles are available from vets or pet stores, although bottle feeding can take significantly longer than tube feeding. Tube feeding is generally recommended, although you should have a vet show you the proper technique so that the puppies do not accidentally inhale and choke on the milk substitute. To feed the puppy, make sure that they are positioned with their tummy facing down. Hold the bottle slightly tilted down towards the puppy. The puppy should latch on. Let the puppy suckle until they are full. If the puppy starts to cough or if you notice milk coming out of their nose, stop feeding immediately. Cow or goat milk is not appropriate for puppies. You should use a store-bought puppy milk substitute. Some puppies may try to nurse and suckle each other in place of the mother. This may hurt the other puppies. If this happens, you may want to separate the puppies into different whelping boxes."
    },
    {
      "title": "Massage the puppies to encourage elimination.",
      "content": "Massage the puppies to encourage elimination. For the first 3 weeks of life, puppies are not able to move their bowels on their own. The mother will lick them to encourage elimination and urination. In the absence of the mother, you will need to do this for the puppy. After each feeding, wet a cotton ball or take a pre-moistened baby wipe. Massage the anus and genitals. After a minute or 2, the puppy should urinate and poop. [9] X Research source If the puppy does not respond well to this after a feeding, you might try doing it before a feeding. Puppies will start to go on their own by three weeks of age."
    },
    {
      "title": "Keep the puppies warm.",
      "content": "Keep the puppies warm. Puppies cannot regulate their body temperature. Without their mother’s heat, they may fail to thrive. You can suspend a 25-watt light bulb over one part of their box to keep them warm. Heating pads may also be used to raise the temperature. Wrap the heating pad in towels or sheepskin. Always supervise the puppies while they are on the heating pad. [10] X Research source The temperature in the room should be 85 °F (29 °C) for the first 2 weeks. It can be lowered to 80 °F (27 °C) after 2 weeks and 75 °F (24 °C) after 4 weeks."
    },
    {
      "title": "Find a foster mother if possible.",
      "content": "Find a foster mother if possible. The mother is responsible for socializing her puppies. It might help to find another dam who gave birth around the same time as your dam did. Introduce the puppies one at a time to her, and see if she accepts them. If she does, she may be willing to foster the puppies as her own. [11] X Research source You might contact breeders in your area or a local shelter to see if they know of a dog that might be an appropriate foster dam. If you cannot find a foster dam, start introducing the puppy to other people after a few weeks to help the puppies socialize. Encourage them to play with each other as well."
    }
  ]
}