{
  "url": "https://www.wikihow.com/Make-a-Moisturizing-Deep-Treatment-for-Hair",
  "title": "How to Make a Moisturizing Deep Treatment for Hair",
  "steps": [
    {
      "title": "Mix up the ingredients in your blender.",
      "content": "Mix up the ingredients in your blender. Make sure the mixture is very smooth, or it will get stuck in your hair. If you're working with any fruits (banana or avocado), lots of honey, and other natural ingredients, it's better if they're well blended. Cut up fruits like bananas so they blend well. If the mixture is too thick, you can always add more conditioner."
    },
    {
      "title": "Wet your hair.",
      "content": "Wet your hair. Moisture will penetrate your hair better, and you hair will retain more water, when it's wet. You can also wash your hair if you like, but you may need to rewash after the treatment."
    },
    {
      "title": "Smooth the mixture all over your hair.",
      "content": "Smooth the mixture all over your hair. Combing it out is good if your hair is not tangled, but if it is, leave it be. You may want to section your hair so that you ensure that the treatment reaches everywhere."
    },
    {
      "title": "Cover your hair with plastic wrap or a disposable shower cap.",
      "content": "Cover your hair with plastic wrap or a disposable shower cap."
    },
    {
      "title": "Add heat.",
      "content": "Add heat. You can use a heated shower cap, use your blow-dryer to heat up your hair or warm up a towel in the dryer. Just make sure to heat up your hair--this also helps the moisture penetrate the hair shaft better."
    },
    {
      "title": "Insulate the hair.",
      "content": "Insulate the hair. This will help retain the heat."
    },
    {
      "title": "Leave the treatment in for 30 minutes to an hour.",
      "content": "Leave the treatment in for 30 minutes to an hour. The longer the better. You can also leave it in overnight."
    },
    {
      "title": "Rinse out the treatment.",
      "content": "Rinse out the treatment. Shampoo and condition your hair. Don't use a clarifying shampoo, as this may strip too much of the moisture that you have just added to your hair. Make sure to brush thoroughly to remove any particles left behind."
    },
    {
      "title": "Style as usual and enjoy your moisturized hair.",
      "content": "Style as usual and enjoy your moisturized hair. It should be soft and refreshed."
    }
  ]
}