{
  "url": "https://www.wikihow.com/Make-a-Guinea-Pig-Toy",
  "title": "How to Make a Guinea Pig Toy",
  "steps": [
    {
      "title": "Get a brown cardboard paper towel or toilet paper roll.",
      "content": "Get a brown cardboard paper towel or toilet paper roll. Don’t use the white cardboard rolls because these have been bleached. The untreated brown cardboard rolls are perfectly safe for guinea pigs to munch on."
    },
    {
      "title": "Stuff the tube with timothy hay.",
      "content": "Stuff the tube with timothy hay. Get some timothy hay from a pet shop and fill the cardboard tube with it. Timothy hay is the recommended hay for guinea pigs. You shouldn’t stuff the tubes with alfalfa because it is too high in calcium for guinea pigs to consume in large quantities. Use alfalfa in small quantities as a treat for adult guinea pigs."
    },
    {
      "title": "Place the stuffed cardboard rolls in your guinea pig’s cage.",
      "content": "Place the stuffed cardboard rolls in your guinea pig’s cage. Your guinea pigs will munch on these tubes and eat all of the hay inside. This will help them keep their teeth filed down and keep them entertained and happy. You can shove a treat in the middle of the hay inside of the tube to provide an extra incentive for your guinea pigs to reach the middle! Save your old cardboard rolls to make new toys once your guinea pigs finish all the hay and chew up the rolls."
    },
    {
      "title": "Find a clean old sock that you don’t need anymore.",
      "content": "Find a clean old sock that you don’t need anymore. Save all those old socks that you can’t find the partner to. Put them through the wash first if you aren’t sure whether they are clean. Long socks will be easier to tie off after you stuff them."
    },
    {
      "title": "Stuff the sock with hay and tie off the open end.",
      "content": "Stuff the sock with hay and tie off the open end. Fill the sock up with timothy hay from the pet store. Tie off the end of the sock around itself, with a piece of fabric, or with a piece of wool or cotton string. You should be able to tie off long socks around themselves. If it is difficult to tie off the sock, you could cut off a strip of fabric from the end of the sock to use to tie it closed."
    },
    {
      "title": "Cut out some holes in different places of the sock.",
      "content": "Cut out some holes in different places of the sock. Use scissors or a knife to carefully cut some small slits in a few places on the sock. Pull out a bit of hay through each hole to give your guinea pigs something to pull on. You could stuff a guinea pig treat or two inside the sock as well for them to try to reach."
    },
    {
      "title": "Lay the sock down in your guinea pig's cage.",
      "content": "Lay the sock down in your guinea pig's cage. They will enjoy pulling the hay out through the different holes to munch on. They will even drag the sock around and play with it like a ball. You should remove the sock from the cage once they have pulled all of the hay out, or if it looks like it’s getting dirty."
    },
    {
      "title": "Get a brown cardboard shoebox with as little printing on it as you can find.",
      "content": "Get a brown cardboard shoebox with as little printing on it as you can find. Your guinea pig will chew on the box. Brown, unprinted cardboard is the safest cardboard for your guinea pigs to gnaw on. Make sure the boxes don’t have any glue or another residue on them. Cut off and remove any parts that do."
    },
    {
      "title": "Cut some holes in the sides and top of the cardboard box.",
      "content": "Cut some holes in the sides and top of the cardboard box. Use scissors or a knife to carefully cut holes big enough for your guinea pig to run in and out of. A hole in the top will allow them to poke their head out and climb up on top of the box. You can even use multiple cardboard shoe boxes or other cardboard boxes to create bigger houses with multiple rooms and levels for your guinea pigs to explore."
    },
    {
      "title": "Put some hay, treats, and chew toys in the shoebox house.",
      "content": "Put some hay, treats, and chew toys in the shoebox house. Add some timothy hay to the house for the guinea pigs to snack on and hide some treats in the hay for them to find. Add other chew toys, like cardboard rolls stuffed with hay, that they can play with, then introduce your guinea pigs to their new playhouse! Be sure to let your guinea pigs play in the house in an area of your home that it is safe for them to run around in or within a closed playpen."
    },
    {
      "title": "Get a piece of fleece that will fit in your guinea pig’s cage.",
      "content": "Get a piece of fleece that will fit in your guinea pig’s cage. Buy a few pieces of fleece from a craft supply store, or cut up an old fleece blanket into some rectangular strips. Cut a rectangular piece of fleece approximately 14 in (36 cm) wide by 30 in (76 cm) long. [1] X Research source The measurements are just a general guideline and you can modify them to whatever fits in your guinea pigs cage."
    },
    {
      "title": "Cut strips on either side of the rectangular piece of fleece.",
      "content": "Cut strips on either side of the rectangular piece of fleece. Cut the strips every 2 in (5.1 cm) on the shorter sides of the fleece. Make them about 12 in (30 cm) long so that there is a connecting piece in the middle that you will drape over the cage. [2] X Research source Think of the curtains that you drive through at the car wash. This is what your fleece forest should resemble."
    },
    {
      "title": "Put the fleece piece over the top of the cage with the strips hanging down.",
      "content": "Put the fleece piece over the top of the cage with the strips hanging down. Place the middle piece of the fleece somewhere on top of the cage so that the strips you cut dangle down into the cage to create your fleece forest curtain. Your guinea pigs will enjoy running through it and hiding in it. You can make several fleece curtains and hang them in the same part of the cage to create a denser forest for your guinea pigs."
    }
  ]
}