{
  "url": "https://www.wikihow.com/Look-up-a-Bible-Verse",
  "title": "How to Look up a Bible Verse",
  "steps": [
    {
      "title": "Identify the book of the verse.",
      "content": "Identify the book of the verse. When Bible verses are listed, the first thing you’ll see is the name of a book. Use the table of contents in your Bible to locate that book within it. The table of contents is at the beginning of the Bible. Locate the name in the table of contents and turn to the page associated with the start of the book. The name of the book might be abbreviated or spelled out completely. Some books include: Exodus (Ex) Genesis (Gen) Numbers (Num)"
    },
    {
      "title": "Identify the chapter.",
      "content": "Identify the chapter. After the book name, you’ll see two numbers. The first number is the chapter. For example, in “John 3:16”, “3” is the chapter number. Look at the verse and determine which chapter it is from in the book. Some people may cite Bible verse using abbreviations and Roman numerals. For example, Lev. xx:13 is the same as Leviticus, chapter 20, verse 13. Locate that chapter within the book. You may be able to find the location of that chapter in the table of contents. If not, you can thumb through the specific book until you see that chapter. As with other books, it should clearly say, “Chapter __” at the beginning of each chapter. In addition, many versions clearly say, <Book name> <Chapter>:<Verse> at the top of each page indicating the first verse on that page. Some also note the last verse on the page."
    },
    {
      "title": "Identify the verse number.",
      "content": "Identify the verse number. The second number after the book name is the verse number. This number should come after a colon (:). In the case of John 3:16, 16 would be the verse number. If you're looking up a longer passage, there may be two numbers, separated by a hyphen (-). For example, in John 3:16-18, you're looking for verses 16,17, and 18."
    },
    {
      "title": "Locate the verse within the chapter.",
      "content": "Locate the verse within the chapter. Once you’ve found the chapter, go through it until you find the verse. The verses go in numerical order, just like chapters. There should be a small number at the beginning of each sentence or a small group of sentences. This is the verse number. If you're looking for multiple verses, such as John 3:16-18, 17 and 18 would follow directly after 16."
    },
    {
      "title": "Choose a concordance.",
      "content": "Choose a concordance. A concordance is a book that lists every instance of a word’s appearance in the Bible. This is a great tool if you remember the verse, or part of the verse, but you don’t know which book or chapter it came from. [1] X Research source Concordances can be found through religious retailers or online. Your church may also have one that you can borrow."
    },
    {
      "title": "Search for a word from the verse.",
      "content": "Search for a word from the verse. Remember an important word from the verse. Look it up in the concordance the same way that you would look it up in a dictionary. Concordances are alphabetized. [2] X Research source Choose a distinctive word that may have limited occurrences, such as “flood,” “mountain,” or “rubies.” If you choose something like “love” or “evil” you’re likely to find an enormous number of results."
    },
    {
      "title": "Search for other words if necessary.",
      "content": "Search for other words if necessary. If you find too many results, or you don’t see the verse you’re looking for, try searching for another word. For example, if you remember the phrase, “love must be sincere” and you searched “love” but found too many results, try looking up, “sincere.” [3] X Research source"
    },
    {
      "title": "Locate the verse from the concordance list.",
      "content": "Locate the verse from the concordance list. The concordance will list all of the places where that word is found in the Bible. A complete concordance will give you some context so that you can be sure it’s the verse you’re looking for. Use the location that the concordance gives you (for example, Romans 12:9) to look up the complete verse and its context in your bible."
    },
    {
      "title": "Try another translation if necessary.",
      "content": "Try another translation if necessary. Concordances are specific to translations. If you can’t find the verse you’re looking for, try a concordance for a different translation. For example, if your Bible translated a word to the English word “praise,\" but your concordance is for a Bible that translated that word as “worship,” it will be impossible to look up the verse. [4] X Research source"
    },
    {
      "title": "Search the verse number online.",
      "content": "Search the verse number online. Choose a search engine, or go to a website dedicated to Bible study. Type the name of the book and the chapter and verse numbers into the search engine. Type the verse number in the generally accepted format if you can. For example, you'll get more accurate results if you type, \"John 3:16,\" than, \"Chapter 3 16 John.\""
    },
    {
      "title": "Remember what you can about the verse.",
      "content": "Remember what you can about the verse. Do you remember a certain phrase of the verse? Maybe you remember one or two words and the name of the book it came from. Even if you can’t remember very much, you can likely still look up the verse. [5] X Research source"
    },
    {
      "title": "Enter what you know into a search engine.",
      "content": "Enter what you know into a search engine. Type in everything you can remember. You should also include the words “Bible” and “verse” to make sure that you get results that are relevant to your search. [6] X Research source Your search terms may be something like, “Bible verse about wives in Psalms,” or “Bible verse chapter 7 desert.”"
    },
    {
      "title": "Use a site designed for Bible searches.",
      "content": "Use a site designed for Bible searches. There are plenty of sites online that catalog Bible verses by subject or by book. You can use one of these websites to search for the verse. Type in a keyword or a subject. You may also be able to do an advanced search by book or chapter. [7] X Research source These online tools can be great ways to find other verses that may be relevant to you or helpful in your studies or prayers."
    },
    {
      "title": "Search related words.",
      "content": "Search related words. If you can’t remember any exact words from the verse, or your search is not going well, search related words. For example, if you searched for “stars” and didn’t find anything, you could search for “night” or “sky” or “heavens” to see if the verse shows up. It’s possible you’re using a different translation or that you misremembered details about the verse. [8] X Research source"
    }
  ]
}