{
  "url": "https://www.wikihow.com/Make-Low%E2%80%90Protein-Dog-Food",
  "title": "How to Make Low‐Protein Dog Food",
  "steps": [
    {
      "title": "Brown 1 pound of ground pork.",
      "content": "Brown 1 pound of ground pork. Drain any fat. You can substitute 1 pound of ground beef (80% lean)."
    },
    {
      "title": "Choose a vegetable.",
      "content": "Choose a vegetable. You can use canned (no sodium/salt added) or you can steam or boil any of these. Prepare 3 cups cooked. [2] X Research source Carrots (diced or sliced) Sweet potato (diced or sliced) Green beans Beets (diced or sliced)"
    },
    {
      "title": "Choose a starch.",
      "content": "Choose a starch. Cook according to package directions. Prepare 2 cups cooked. [3] X Research source Rice (white) Macaroni Malt O Meal (original not chocolate flavor)"
    },
    {
      "title": "Choose an organ meat.",
      "content": "Choose an organ meat. Organ meat is an essential part of this diet. It contains vitamins, nutrients and minerals your dog needs. You need 3 ounces total. Dice finely before or after cooking. You can cook this with the ground meat. [4] X Research source Beef or calves liver Chicken livers Pork liver"
    },
    {
      "title": "Chose a calcium supplement.",
      "content": "Chose a calcium supplement. Go to the human vitamin section of your store. You need a total of 1,000 mg in this recipe. You can use one TUMS ULTRA in place of calcium. Crush the tablet in between two spoons until it is fine powder."
    },
    {
      "title": "Choose a fish oil capsule.",
      "content": "Choose a fish oil capsule. You can get this in the same place you got the calcium. Do not use cod liver fish oil capsules. These capsules are coated with gelatin and liquid inside. You need 1,000 mg in this recipe. Take a push pin, safety pin, needle and poke a hole in the end of it. Squeeze contents into meat mixture."
    },
    {
      "title": "Mix all of the above together into any container you can seal tightly.",
      "content": "Mix all of the above together into any container you can seal tightly. Store in refrigerator. Feed 1/2 cup of this daily for every 8 pounds of dog. If your dog weighs 5 pounds, feed him half a cup. If he weighs 10 pounds, feed 1 cup. Every dog is different and you will need to adjust according to each. Some dogs may need less to maintain weight, some may need more. [5] X Research source"
    }
  ]
}