{
  "url": "https://www.wikihow.com/Keep-Blue-Hydrangeas-Blue",
  "title": "How to Keep Blue Hydrangeas Blue",
  "steps": [
    {
      "title": "Know that blue hydrangeas grow in acidic soil, while pink hydrangeas grow in alkaline soil.",
      "content": "Know that blue hydrangeas grow in acidic soil, while pink hydrangeas grow in alkaline soil. Hydrangeas are rather unique garden plants because of their ability to change color according to the pH level of your soil. This means the color of hydrangeas in your garden will depend on how acid or alkaline the soil type is. [1] X Research source The scientific reason behind this is that different levels of aluminum become available to the plant depending on the soil's acidity level (also known as pH). Acidic soils have a high aluminum content, turning the flowers blue. An alkaline soil will produce pink blooms in hydrangeas; an acid soil will cause the same plant to bear blue flowers. The exception to this is white or green hydrangeas, which are unique varieties and don't change color. You won't have any success trying to change a white hydrangea to pink or blue!"
    },
    {
      "title": "Test the pH level of your soil.",
      "content": "Test the pH level of your soil. To see whether the soil in your garden is alkaline or acidic, you will need to test the pH levels. This will help you to predict the likelihood of growing blue hydrangeas. [2] X Research source Soil with a pH lower than 5.5 will result in bright blue hydrangea flowers. When the pH is 5.5 to 6.5 the flowers will be an odd purple color. Soil with a pH higher than 6.5 will cause the flowers to be pink."
    },
    {
      "title": "Use white vinegar to gauge whether the soil is alkaline or acidic.",
      "content": "Use white vinegar to gauge whether the soil is alkaline or acidic. You can get a fairly good indication of whether your soil is alkaline or acidic using distilled white vinegar. Just grab a handful of your soil, pour the vinegar on top and wait for a reaction. If the vinegar fizzes and bubbles when it comes in content with the soil, this means that the soil is alkaline and will produce pink hydrangeas. The more intense the fizzing, the more alkaline the soil. If nothing happens when the vinegar comes in contact with the soil, this means that the soil is either neutral or acidic and is more likely to produce blue hydrangeas. [3] X Research source"
    },
    {
      "title": "Test the pH of your soil scientifically.",
      "content": "Test the pH of your soil scientifically. If you want to find out the exact pH value of your soil, you can test it using an at-home pH testing kit. These are widely available at gardening centers or online - just follow the instructions on the packaging. Alternatively, you can take a sample of your soil to a local gardening center where they will test the pH of the soil for you."
    },
    {
      "title": "Sprinkle elemental sulfur over the soil.",
      "content": "Sprinkle elemental sulfur over the soil. [4] X Research source In order to keep your hydrangeas blooming in blue, elemental sulfur should be sprinkled over the soil around the shrub to lower the pH to below 5.5. The exact amount of elemental sulfur required will vary, depending on the soil type and how much the pH needs to be adjusted. Loam or silt loam soil will require a ¾ pound of elemental sulfur to lower the soil pH in a 25 square foot area by one unit. In other words, it will take ¾ pound to lower the pH from 6 to 5. Sandy or sandy loam soil, on the other hand, will require less than ¼ pound of elemental sulfur to lower the pH by one. Start sprinkling the elemental sulfur about 2 feet (0.6 m) beyond the shrub drip line or outer edge of the shrub. Spread it evenly over the soil up to about 4 to 6 inches (10.2 to 15.2 cm) away from the stems. This is the area where most of the roots grow and absorb water and nutrients. Use a small hand rake to mix the elemental sulfur into the top 1 to 2 inches (2.5 to 5.1 cm) of soil, then water the area generously to help wash the sulfur into the soil. The elemental sulfur will probably need to be re-applied from time to time in order to keep the blue hydrangea blue."
    },
    {
      "title": "Use acidic compost and aluminum sulfate powder.",
      "content": "Use acidic compost and aluminum sulfate powder. To plant hydrangeas into a garden with alkaline soil and still get a blue flower, you will need to incorporate plenty of acidic compost and aluminum sulfate into the ground when planting and continue with regular applications over the lifetime of the plant. You can buy acidic compost at the gardening center - it is usually labeled as \"ericaceous\". Aluminum sulfate is available as a powder from garden centers or online outlets. It's often labeled as ‘blue hydrangea powder'. Be careful not to apply the powder directly to the root of a plant, as it will scorch the tissue. Instead, add one tablespoon of aluminum sulfate to one gallon of water and use this solution to water fully-matured hydrangeas throughout the growing season. Don't be tempted to apply a stronger concentration as this can burn the roots. [5] X Research source"
    },
    {
      "title": "Apply a fertilizer that is low in phosphorus and high in potassium.",
      "content": "Apply a fertilizer that is low in phosphorus and high in potassium. All hydrangeas benefit from fertilization. To produce or maintain blue flowers on a hydrangea bush, use a fertilizer that is low in phosphorus and high in potassium. This fertilizer may be labeled as an appropriate fertilizer for azaleas, camellias and rhododendrons. [6] X Research source Avoid using fertilizers such as bone meal, as this will make the soil more alkaline, undoing all of your hard work."
    },
    {
      "title": "Use organic matter to increase the acidity of the soil.",
      "content": "Use organic matter to increase the acidity of the soil. If you don't fancy using chemicals in your garden, an application of certain organic matters such as grass clippings, fruit, and vegetable scraps or used coffee grounds can turn the soil mildly acidic. Used coffee grounds are particularly effective, just make sure that they have cooled completely before working them into the soil around the base of your plant. [7] X Research source You can also incorporate coffee grounds into the soil when planting a new hydrangea shrub – perhaps ask your local café if you can take some away, they are usually happy to oblige. Keep in mind that organic matter changes the acidity of your soil more slowly than chemical powders and fertilizers, so you'll need to be patient if you decide to go down this route."
    },
    {
      "title": "Water your hydrangeas with rainwater.",
      "content": "Water your hydrangeas with rainwater. Try to use rainwater (rather than tap water) to water your hydrangeas. If you use a hard tap water on your blue hydrangeas, this will counteract the soil acidity and the flowers will gradually turn pink. For information on how to collect rainwater, see this article ."
    },
    {
      "title": "Consider growing your hydrangeas in a separate pot.",
      "content": "Consider growing your hydrangeas in a separate pot. Rather than attempting to change the acidity of the soil in your garden, it may be easier to just plant new hydrangea bushes in a pot containing acidic (\"ericaceous\") soil. You can encourage a blue bloom even further by watering your potted hydrangea with an aluminum sulfate solution, as described above."
    },
    {
      "title": "Avoid planting hydrangeas in chalky soil.",
      "content": "Avoid planting hydrangeas in chalky soil. [8] X Research source Altering the pH of your soil will only work if you have chalk-free soil. You'll know if you have a chalky soil if you can see white clumps of chalk or flint. You'll find water drains easily and doesn't form puddles. The ground will also be very dry in summer, as water drains away without being retained. If you're faced with a chalky soil, you won't have much luck altering the soil pH so it's best to grow your hydrangeas in containers using purchased compost rather than any dug out of the ground in your garden."
    },
    {
      "title": "Don't plant hydrangeas near any concrete structures.",
      "content": "Don't plant hydrangeas near any concrete structures. You'll find that having concrete near your flower bed (such as a concrete fence base or concrete walkway) can affect soil pH. Concrete is likely to turn soil more alkaline, which will hinder the growth of blue hydrangeas. If you can, plant hydrangeas well away from concrete structures to maintain their blue color."
    }
  ]
}