{
  "url": "https://www.wikihow.com/Make-Plastic",
  "title": "How to Make Plastic",
  "steps": [
    {
      "title": "Get the right ingredients.",
      "content": "Get the right ingredients. For this method, you're basically melting styrofoam in paint-thinner, creating a semi-hard plastic-type substance that you can use to mold in different shapes and forms. To do it, you'll need: [1] X Research source Acetone or paint thinner, commonly available at hardware stores A mason jar, or other glass container Styrofoam cups, or some other kind of expanded polystyrene Gloves Eye protection"
    },
    {
      "title": "Pour some acetone into the glass jar.",
      "content": "Pour some acetone into the glass jar. To complete the job, you'll need a half-inch or at least a few centimeters of acetone at the bottom of the jar. Put on your gloves and glasses at all times when handling acetone, which is quite dangerous. Avoid breathing in the fumes and make sure you do this in a well-ventilated area with adult supervision, if you're under 15."
    },
    {
      "title": "Break up the styrofoam into small pieces.",
      "content": "Break up the styrofoam into small pieces. Whether you've got some old packing styrofoam or styrofoam cups lying around, start tearing them into pieces small enough to fit into the glass and push all the way to the bottom. [2] X Research source"
    },
    {
      "title": "Push the styrofoam to the bottom of the cup.",
      "content": "Push the styrofoam to the bottom of the cup. You should start to see the reaction relatively quickly, so it's important to keep your safety glasses and gloves on while you do this. Put the cap on the top of the jar, or cover it with a heavy object like a book and let the jar sit for several minutes while the acetone breaks down the styrofoam. The more you wait, the more solid the melted product will become. In general, it's at a good moldable consistency between 3 and 5 minutes."
    },
    {
      "title": "Remove the plastic.",
      "content": "Remove the plastic. When you remove the styrofoam from the jar, you'll have a weirdly moldable plastic substance you can shape and mold, much like clay. Keep your gloves on and mold it into a shape you'd like, then let it dry. [3] X Research source In about 12-24 hours it should be fully formed and solid."
    },
    {
      "title": "Sculpt it into a fun shape.",
      "content": "Sculpt it into a fun shape. Use your imagination and mold your new plastic into a fresh shape, making a small plastic sculpture you'll be able to paint later, or some other cool design. This is a fun science project for kids and students, providing them with a cool souvenir for later."
    },
    {
      "title": "Assemble the right ingredients.",
      "content": "Assemble the right ingredients. Polymers are somewhere between a liquid and a solid, molding to the shape of their container, but stretchy and moldable like a solid. [4] X Research source To make a basic polymer from simple ingredients, you'll need: White craft glue, like Elmer's 2 cups Water Borax powder (laundry detergent) Plastic spoon"
    },
    {
      "title": "Dissolve borax in one of the cups.",
      "content": "Dissolve borax in one of the cups. Add a small spoonful of borax to the cup and enough water to dissolve it. Stir it up until it dissolves completed, then set aside."
    },
    {
      "title": "Prepare the glue.",
      "content": "Prepare the glue. In the other cup, add a small amount of glue. A few spoonfuls, three or so, of water to the glue and stir it up, thinning it out some. If you want to color your polymer, you can also add a few drops of food coloring and mix it up to create a fun color."
    },
    {
      "title": "Add a spoonful of the borax solution to the glue.",
      "content": "Add a spoonful of the borax solution to the glue. As you stir, you should notice a slimy texture start to form in the glue, and it may start to stick to the spoon some. Let it sit for 30 seconds, then remove it from the spoon. The slimy polymer plastic is fine to touch with your bare hands. Play with it, stretch it, mold it, make crazy shapes. It's difficult to get it to hold it's shape, but it makes a great creepy plastic alien goo for kids to play with."
    },
    {
      "title": "Keep it away from the air.",
      "content": "Keep it away from the air. To store the plastic slime, keep in a sealed plastic bag. It'll last a while if you take care of it, or you can make some more the same way!"
    },
    {
      "title": "Assemble the right ingredients.",
      "content": "Assemble the right ingredients. To make a simple and natural plastic-like substance from simple household ingredients you've probably already got in your kitchen, assemble the following: [5] X Research source 1 cup of whole milk or heavy cream, fatter is better Vinegar or lemon juice Saucepan Strainer"
    },
    {
      "title": "Heat the milk.",
      "content": "Heat the milk. In the saucepan, heat the milk gently and bring it just to a simmer. Be very careful not to boil the milk, which will ruin the reaction. [6] X Research source"
    },
    {
      "title": "Add the vinegar.",
      "content": "Add the vinegar. Adding a few tablespoons at a time, stir in the vinegar with a spoon until the milk starts to separate into solids and liquids. This is basically the cheese-making process of separating and creating curds."
    },
    {
      "title": "Strain the mixture.",
      "content": "Strain the mixture. Remove from heat and pour the milk through the strainer when it's cool enough to handle. The rubbery and soft stuff in the strainer is the \"milk plastic,\" called casein, an essential part of cheese-making. By heating the milk and adding the vinegar, you started a chemical reaction that brought out the natural polymers of the milk, and made a natural plastic-like compound."
    },
    {
      "title": "Harden the plastic by freezing.",
      "content": "Harden the plastic by freezing. See how your plastic stuff reacts when pinched, stretched, or dropped. If you let it sit for a while, or put it in the freezer, it will get hard. You could also pour it into candy molds or other shapes and allow it to harden in a fun shape. If you haven't painted it already, paint it to make holiday ornaments or natural jewelry as a fun project for kids. The plastic will be good for a few days, but has the basic shelf-life of food. Throw it away before it molds."
    }
  ]
}