{
  "url": "https://www.wikihow.com/Make-Homemade-Deer-Food",
  "title": "How to Make Homemade Deer Food",
  "steps": [
    {
      "title": "Mix equal parts corn and whole oats.",
      "content": "Mix equal parts corn and whole oats. Cracked corn, whole kernels, or ground corn all work well for deer treats. Mix an equal amount of your corn with your whole oats. Amounts will vary depending on how much deer food you want to make. [1] X Research source"
    },
    {
      "title": "Pour in the molasses.",
      "content": "Pour in the molasses. The amount of molasses you will need varies depending on how much of the oat mixture you made. As a general rule of thumb, add a quarter cup (60 mL) of molasses for very two and a half cups (595 mL) of your oat mixture. [2] X Research source"
    },
    {
      "title": "Mix your ingredients.",
      "content": "Mix your ingredients. Use a spoon to mix all your ingredients together. Keep mixing until you have a thick paste and all the ingredients are evenly mixed. [3] X Research source"
    },
    {
      "title": "Place the feed in a deer feeder.",
      "content": "Place the feed in a deer feeder. You can place the feed in a deer feeder, which you can purchase at any hardware store, in your backyard. The feed will likely not go bad, as deer go through feed very quickly. Remake feed as needed as the feeder gets empty. [4] X Research source"
    },
    {
      "title": "Mix equal parts molasses and honey in a bowl.",
      "content": "Mix equal parts molasses and honey in a bowl. In a large bowl, mix equal parts molasses and honey until both ingredients are mixed together evenly. The amounts of each you'll use depends on how big your food blocks are. You will add the molasses/honey mixture as needed as you make your other ingredients. [5] X Research source"
    },
    {
      "title": "Pour your molasses mixture over stale bread.",
      "content": "Pour your molasses mixture over stale bread. Break some stale bread into small, cube-like pieces. Place them in a large bowl. Drizzle your honey and molasses mixture on the stale breed, adding enough that the bread pieces are saturated. [6] X Research source"
    },
    {
      "title": "Add dry corn kernels.",
      "content": "Add dry corn kernels. Add about one and a half cups (350 mL) of dry corn kernels. Use a spoon to mix this into the stale bread until everything is evenly combined. [7] X Research source"
    },
    {
      "title": "Transfer the mixture to a baking pan.",
      "content": "Transfer the mixture to a baking pan. Pour the mixture into a baking pan. The size of the pan will depend on how much you make. Simply transfer the batter to the pan and flatten the back of it using a spoon or spatula the same way you would make something like a cake. [8] X Research source"
    },
    {
      "title": "Bake the mixture in a pan for 200 °F (93 °C).",
      "content": "Bake the mixture in a pan for 200 °F (93 °C). Place it in the oven and cook it in the oven at 200 °F (93 °C). Baking times vary depending on how big of a block you're making, so check the oven every 10 minutes or so. Remove the pan from the oven as soon as the block is completely dry. [9] X Research source"
    },
    {
      "title": "Set the mixture out for your deer.",
      "content": "Set the mixture out for your deer. Remove the mixture from the pan and set it out somewhere in your yard where deer congregate. If you want, you can break the mixture up into smaller chunks, but there is no need to do so as deer will break up the mixture on their own while they're eating. [10] X Research source"
    },
    {
      "title": "Mix corn and oats in equal proportion.",
      "content": "Mix corn and oats in equal proportion. Deer tend to be drawn to things like corn and oats. Mix your choice of dry ingredients together in equal proportion. [11] X Research source If you're only using one dry ingredient, you can skip this step."
    },
    {
      "title": "Add a sticky substance, such as peanut butter, as a binding agent.",
      "content": "Add a sticky substance, such as peanut butter, as a binding agent. Pour a sticky substance, such as peanut butter or molasses, over your dry ingredients. Start with a small amount and mix it in. Keep adding tiny amounts of your sticky ingredients until you have a consistent, spreadable paste. [12] X Research source"
    },
    {
      "title": "Mix in water to make the substance spreadable.",
      "content": "Mix in water to make the substance spreadable. Add a small amount of water to the mixture. You don't need to add a lot. Add just enough that the mixture becomes a little more liquid-like, making it easier to spread. [13] X Research source"
    },
    {
      "title": "Spread the mixture on trees and buildings.",
      "content": "Spread the mixture on trees and buildings. Find structures roughly at a deer's level around your hunting camp, such as benches and trees. Spread the mixture over these areas. Apply a lot of your mixture to create a strong smell that will lure deer. [14] X Research source"
    }
  ]
}