{
  "url": "https://www.wikihow.com/Give-Insulin-Shots",
  "title": "How to Give Insulin Shots",
  "steps": [
    {
      "title": "Get your supplies ready.",
      "content": "Get your supplies ready. Before giving yourself or your child a shot, you need to gather together your little insulin bottle (vial), syringe and alcohol pads. Check the label to make sure you have the right kind of insulin, as it's available in short-acting, intermediate and long-acting varieties — your doctor will explain what type is best for you. [3] X Research source There are different devices used to inject insulin, including various sized syringes, insulin pens, pumps and jet injectors. Syringes are the most common method of insulin delivery. They’re inexpensive and most insurance companies pay for them. Syringes vary by the amount of insulin they hold and needle size. Most are made of plastic (made for one-time use) and have the needles already attached to the end. [4] X Research source As a general rule: use a 1mL syringe if your dose is 50 to 100 units of insulin; use a 0.5mL syringe if your dose is 30 to 50 units of insulin; use a 0.3mL syringe if your dose is less than 30 units of insulin. [5] X Research source Insulin needles used to be 12.7mm in length, but shorter needles (4mm – 8mm) are just as effective and lead to less discomfort."
    },
    {
      "title": "Take the insulin out of the fridge.",
      "content": "Take the insulin out of the fridge. Insulin is typically stored in the refrigerator because the colder temperature deters it from spoiling or going bad — the cold essentially preserves it longer. However, you should only give insulin shots once the insulin is at room temperature. [6] X Research source As such, take the vial of insulin out of your fridge about 30 minutes prior to injecting it in order to give it enough time to warm up. Never microwave or boil it to get it warmer quicker as that will destroy the hormone. Injecting cold insulin into your body is usually a little more uncomfortable and the insulin can lose a little of its potency or effectiveness. Always use at room temperature for best results. Once you open and start using a vial of insulin, it can be kept at room temperature for up to a month before there's any concern of it expiring or becoming less potent."
    },
    {
      "title": "Fill the syringe with one type of insulin.",
      "content": "Fill the syringe with one type of insulin. Before filling the syringe, check that you have the correct insulin type and that it's not expired. Liquid insulin should never have clumps in it. [7] X Research source Sanitize your hands before removing the plastic cover from the insulin vial, then wipe the top of the vial with an alcohol wipe to disinfect it. Next, take the cap off the needle, pull back the syringe plunger to the mark that corresponds to how much insulin you want, then put the needle through the rubber top of the vial and push the plunger down. Keep the needle in the vial and turn it upside down, then pull back the plunger again to get the correct dose of insulin into the syringe. Short-acting insulin is clear with no particles in it. Don't use it if there are clumps or particles in the vial. Intermediate-acting insulin is cloudy and must be rolled between your hands to mix it — don't shake the vial as it can cause the insulin to clump. Check the syringe for air bubbles, as there shouldn't be any. If there are, tap the syringe so the bubbles float to the top and inject them back into the insulin vial. If you see no air bubbles put the loaded syringe down carefully and then proceed to select your injection site."
    },
    {
      "title": "Fill the syringe with two types of insulin.",
      "content": "Fill the syringe with two types of insulin. Some types of insulin can be mixed, but not all, so never do so unless you are told to and shown by your doctor. Once you doctor has told you how much of each type you need, add their individual totals up to get one total volume and proceed to fill your syringe as described above by pulling it back. Your doctor will also tell you which insulin to draw up into the syringe first — always do it in that order. [8] X Research source Usually, short-acting insulin is drawn into the syringe before intermediate varieties and the intermediate types before the long-lasting ones. Since short-acting insulin is clear and long-acting insulin is cloudy, you can use the following to help you remember the order when drawing insulin up: always start clear and end cloudy. Insulin mixing is done to provide both immediate and long-lasting effects in dealing with high blood glucose levels. Using syringes allow you to mix different types of insulin, whereas other injection methods (such as insulin pens) don't. Not all diabetics need to mix different types of insulin to effectively treat their condition and some find the procedure too complicated or time-consuming. Usually, this is an evolution of process; as diabetes worsens over time, more insulin is needed to adequately treat the patient. The physician prescribing the insulin should train you on this method of insulin delivery so that you can practice under her supervision before doing it on your own."
    },
    {
      "title": "Choose where to give the insulin shot.",
      "content": "Choose where to give the insulin shot. Insulin should be injected into the fatty tissue just below your skin, which is called subcutaneous fat. [9] X Research source As such, the most common injection sites are areas that tend to have a good layer of subcutaneous fat, such as the abdomen, thigh, buttocks or underneath the upper arm. People who get insulin shots every day need to rotate their injection sites to prevent injury. You can rotate to different injection sites within the same body part (keep at least an inch between sites) or switch to different body parts. If you inject insulin deeper into muscle tissue, it'll get absorbed too quickly and potentially lead to dangerously low blood sugar levels (hypoglycemia). Injecting too much into the same site can trigger lipodystrophy, which leads to either a breakdown or build-up of subcutaneous fat. This is important to know because this can affect insulin absorption and if this happens, it will not work as well in injected in the area where lipodystrophy forms. This is why it is important to alternate injection sites. Keep your shots at least 1 inch away from scars and 2 inches away from your belly button. Never inject into an area that's bruised, swollen or tender. [10] X Research source"
    },
    {
      "title": "Inject the insulin.",
      "content": "Inject the insulin. Once you've chosen the site, it's time to inject the insulin. The site should be clean and dry — wash it with soap and water (not alcohol) if it's unclear. Pinch your skin and fat together and gently pull it away from underlying muscle, then insert the needle at a 90° angle (perpendicularly or straight up / down) if your tissue is thick enough. If you're lean (common with type 1 diabetics), insert the needle at a 45° angle for more comfort. Insert the needle all the way in, then let go of the skin and inject the insulin slowly and steadily by pushing the plunger until it's all gone from the syringe. When you're finished, place the needle / syringe in a designated plastic container and keep it away from children. Never reuse needles or syringes. [11] X Research source Keep a chart of places you have used for injection sites. Your doctor may be able to provide you with an illustrated chart / diagram to keep track."
    },
    {
      "title": "Leave the needle in place for about five seconds.",
      "content": "Leave the needle in place for about five seconds. After injecting the insulin into a chosen site, it's a good idea to leave the needle / syringe in place for at least 5 seconds to allow all of the hormone to absorb into the tissue and prevent it from seeping back out. [12] X Research source While the needle is in place, try not to move your body part in order to prevent discomfort. If needles always make you feel a little queasy or weak in the knees, then look away for the 5 seconds before proceeding to remove it. If some insulin leaks from the injection site, press down on your skin for 5-10 seconds with a clean tissue to absorb it and stop the flow. Remember to pull the needle out at the same angle it went in to avoid any tissue injury — either a 90° or 45° angle."
    },
    {
      "title": "Consider using an insulin pen instead.",
      "content": "Consider using an insulin pen instead. Insulin shots with regular syringes / needles are not as painful as most people think, although using insulin pens is often more comfortable and convenient. Other advantages include: there's no need to draw the insulin from a vial; doses can be easily dialed into the pen, and it can be used for most insulin types. [13] X Research source The main disadvantage is that you can't mix different kinds of insulin together if that's what your doctor prescribes. The pen may be the best choice for school-aged children who must deliver injections at school as it is easy for them to carry the pen with them and there's no need to retrieve their insulin from a refrigerator. [14] X Research source There are different insulin pens for you to choose from — some are disposable while some use replaceable insulin cartridges and needles. [15] X Research source Pens and cartridges may be more expensive than syringes and insulin vials."
    },
    {
      "title": "Prepare the pen.",
      "content": "Prepare the pen. Check your pen to make sure it is the right prescription and that it has not expired. Wipe the tip of the pen with an alcohol swab. Remove the protective tab from the needle and screw it onto the pen. Your doctor should have given you a prescription for both the pen and the needles. [16] X Research source If you are using short-acting insulin, it should appear clear, with no particles, discoloration, our cloudiness. [17] X Research source Open the pen to expose the needle and clean the needle with an alcohol swab. Intermediate- or long-acting insulin will appear cloudy, and will need to be mixed before injection. [18] X Research source Gently roll the pen between your hands and turn the pen up and down ten times to mix the insulin sufficiently. [19] X Research source"
    },
    {
      "title": "Remove the caps.",
      "content": "Remove the caps. Remove the outer needle cap, which you can reuse, and the inner needle cap, which can be discarded. Never reuse a needle for an injection. [20] X Research source"
    },
    {
      "title": "Prime the pen.",
      "content": "Prime the pen. Hold the pen with the needle pointing toward the ceiling and tap the pen to force any air bubbles to the top. Turn the dosage knob, usually located near the injection button, to \"2,\" then press the injection button until you see a drop of insulin appear on the tip of the needle. [21] X Research source Air bubbles can cause you to inject the wrong amount of insulin. [22] X Research source"
    },
    {
      "title": "Select the dosage amount.",
      "content": "Select the dosage amount. Again, locate the dosage knob on the end of the pen, near the plunger. This allows you to control the amount of insulin you inject. Set the dial to the dosage amount prescribed by the doctor."
    },
    {
      "title": "Choose where to give the insulin shot.",
      "content": "Choose where to give the insulin shot. Insulin should be injected into the fatty tissue just below your skin, which is called subcutaneous fat. [23] X Research source As such, the most common injection sites are areas that tend to have a good layer of subcutaneous fat, such as the abdomen, thigh, buttocks or underneath the upper arm. People who get insulin shots every day need to rotate their injection sites to prevent injury. You can rotate to different injection sites within the same body part (keep at least an inch between sites) or switch to different body parts.If you inject insulin deeper into muscle tissue, it'll get absorbed too quickly and potentially lead to dangerously low blood sugar levels (hypoglycemia). Injecting too much into the same site can trigger lipodystrophy, which leads to either a breakdown or build-up of subcutaneous fat. Keep your shots at least 1 inch away from scars and 2 inches away from your belly button. Never inject into an area that's bruised, swollen or tender. [24] X Research source"
    },
    {
      "title": "Give yourself the shot.",
      "content": "Give yourself the shot. Wrap your fingers around the pen with your thumb on the injection button. Place the needle against your skin fold at either a 45 or 90-degree angle (ask your doctor which is best for the pen you are using) and press and hold the injection button for at least 10 seconds. [25] X Research source"
    },
    {
      "title": "Dispose of the needle.",
      "content": "Dispose of the needle. Cap and unscrew the needle tip of the pen and dispose of it, but don't throw away the pen until it runs out of insulin — they typically last 28 days depending on the type of insulin. Do not leave the needle on the pen between shots. [26] X Research source As with syringes, you should have a designated area for your discarded needles. Store them in a hard plastic or metal container (make sure it is labeled). When it is full, tape the container shut and dispose of it appropriately in health products disposal site. You may call your local trash or public health department in regards to sharps disposal programs in your area."
    },
    {
      "title": "Distinguish between diabetes types.",
      "content": "Distinguish between diabetes types. Diabetes is a disease in which your blood glucose (sugar) levels are too high (hyperglycemia) due to a lack of insulin or a tissue insensitivity to it. [27] X Research source In general terms, type 1 diabetes is more serious because your body (pancreas) doesn't make any insulin, whereas with the type 2 variety your body doesn't make or use insulin efficiently. Both forms can be fatal if not treated. All type 1 diabetics need insulin shots on a daily basis, whereas a large proportion of type 2 diabetics can manage their condition with special diets, weight loss and exercise. Type 2 diabetes is much more common and is linked to obesity, which causes tissues of the body to be less sensitive to the effects of insulin — essentially ignoring its impact. Insulin can't be taken by mouth (orally) in order to lower blood glucose levels because stomach enzymes interfere with its action.."
    },
    {
      "title": "Recognize the symptoms of type 1 diabetes.",
      "content": "Recognize the symptoms of type 1 diabetes. People with type 2 diabetes tend to be overweight and develop their symptoms slowly, whereas type 1 diabetics experience symptoms quickly and they tend to be more severe. [28] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The most common symptoms of type 1 diabetes include: increased thirst, frequent urination, extreme hunger, unexplained weight loss, sweet smelling breath (due to ketone breakdown), severe fatigue, irritability, blurred vision, slow-healing sores and frequent infections. Type 1 diabetes can develop at any age, although it usually appears during childhood or adolescence. Diabetic kids are usually very thin, gaunt and tired looking. Type 2 diabetes can develop at any age, although it's most common in people older than 40 who are obese. Without insulin treatment, diabetes can progress and lead to nerve damage (neuropathy), heart disease, kidney damage, blindness, numbness in limbs and various skin conditions."
    },
    {
      "title": "Understand the risks of injecting insulin.",
      "content": "Understand the risks of injecting insulin. Having diabetes and needing to inject insulin on a daily basis is sometimes like walking on a tightrope. Injecting too much insulin can lead to hypoglycemia due to having too much glucose removed from your bloodstream. On the other hand, not injecting enough promotes hyperglycemia as too much glucose is left within the blood stream. Your doctor can estimate the amounts, but it depends on your dietary choices. As such, diabetics must monitor their own blood sugar levels and determine for themselves when to inject. Symptoms of hypoglycemia include: excessive sweating, shakiness, weakness, hunger, dizziness, headaches, blurred vision, heart palpitations, irritability, slurred speech, drowsiness, confusion, fainting and seizures. [29] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Skipping meals and exercising too much can also promote hypoglycemia. Hypoglycemia can be treated at home in most cases by consuming quickly absorbed carbohydrates, such as fruit juice, ripe berries, white bread with honey and/or glucose tablets."
    }
  ]
}