{
  "url": "https://www.wikihow.com/Judge-a-Debate",
  "title": "How to Judge a Debate",
  "steps": [
    {
      "title": "Learn your schedule.",
      "content": "Learn your schedule. There are usually several rounds to a tournament. Often, judges will oversee preliminary rounds on their own. When the tournament proceeds to more advanced rounds, however, there will usually be a panel made of several judges. Checking in with the tournament organizer before the debate gives you the chance to have any deviations from the norm explained to you. [1] X Research source"
    },
    {
      "title": "Get your ballots from the organizer.",
      "content": "Get your ballots from the organizer. Ballots are forms that debate judges use to record their notes on and scores for various competitors. Read over the ballots and make sure you understand how to complete the scoring and where to leave feedback for the competitors. [2] X Research source Make sure you return all of your ballots when you are done with them so that the competitors and/or schools can use your feedback to try and improve."
    },
    {
      "title": "Double-check the timing of debate sections.",
      "content": "Double-check the timing of debate sections. The structure of debates can vary a bit depending on the type of tournament and the association overseeing in. Usually, each competitor or team will present their sides on an issue, followed by questions for clarification and rebuttals. Ask the tournament organizer about the time limit for each section, since it is the responsibility of the judges to signal the beginning and end of each. [3] X Research source You may be asked to call time by raising your hand, ringing a buzzer, or some other means. Some debate types may have additional sections that will need to be accounted for in the timing."
    },
    {
      "title": "Ask the organizer how results should be delivered.",
      "content": "Ask the organizer how results should be delivered. Sometimes, judges are asked to give an oral critique, or immediate feedback to both competitors or teams. In addition, you may be asked to disclose, or reveal right away which side won. Alternatively, you may simply complete the ballots and return them, so that winners can be announced later. [4] X Research source"
    },
    {
      "title": "Leave your opinions at the door.",
      "content": "Leave your opinions at the door. Even experienced judges benefit from reminding themselves that they are there to assess the delivery, structure and argumentation presented by different competitors, regardless of whether or not they agree with the content. Keep in mind that competitors may be asked to articulate and defend positions they may not personally agree with, either. [5] X Research source Remind yourself to focus on the ballot and use it, not personal beliefs, as a guide to assess the debate."
    },
    {
      "title": "Flow the debate.",
      "content": "Flow the debate. Taking notes as you watch the debate is known as “flowing.” While competitors and teams are in action, watch for how they present their ideas and refute their opponents’. [6] X Research source Record your thoughts on a “flow sheet.” However, be sure not to “fill in” for speakers. You can only assess them on exactly what they say, not what you think they meant to say."
    },
    {
      "title": "Allow prep time, when requested.",
      "content": "Allow prep time, when requested. Most styles of debate allow sides to ask for time to prepare. The competitors or teams are responsible for notifying you that they would like some time, and for letting you know when they are done. As a judge, you are responsible for officially allowing and announcing prep time. [7] X Research source"
    },
    {
      "title": "Make sure rules are followed.",
      "content": "Make sure rules are followed. As you monitor the different sections of the debate, be on the lookout for any violations to the rules of tournament and style. In particular, cross examination should only be used to clarify positions, not to articulate new ones. Likewise, no new arguments should be presented in the rebuttal section. [8] X Research source If you notice violations, make a note of them on your flow sheet and/or ballot, and score accordingly."
    },
    {
      "title": "Interject only when necessary.",
      "content": "Interject only when necessary. If your debate style requires you to, call out the violations as they occur. Otherwise, you shouldn’t normally need to interrupt debaters. You may ask them to speak up, if necessary, however. One typical exception to this guideline is that you may interject if a competitor says something offensive."
    },
    {
      "title": "Check the rubric against your flow sheet.",
      "content": "Check the rubric against your flow sheet. The scoring rubric should break potential points into several categories. Award points for each category based on the notes you took during the debate. Typical categories for assessment ask you consider if the competitor: Directly addressed the topic. Understood the basic issue. Clearly explained their position. Made a convincing case, complete with specific evidence. Explained the other side’s weaknesses. Responded directly to the other side’s critique. Used appropriate body language, volume, speed, and diction. Was courteous to the other side."
    },
    {
      "title": "Style your feedback consciously.",
      "content": "Style your feedback consciously. Competitors and schools look to your feedback as a way to learn and coach participants. As a judge, you should model decorum, courtesy, and clarity when writing your feedback. The language of your feedback should also be inclusive. For example: [9] X Research source Avoid feedback like “The competitor’s presentation was boring and seemed pointless. It seems to me like they’ve never even studied the basics of American government.” Instead, offer the critique more constructively: “For future debates, I recommend focusing on making delivery more animated to underscore main points. A review of Congressional argumentation procedure may also be useful.” Likewise, avoid unnecessary exclusions of gender, age, and other aspects of identity. For example, rephrase “I always advise a young competitor that he should observe experienced competitors in action” as “I always advise participants to closely observe other competitors in action.”"
    },
    {
      "title": "Complete the ballot and turn it in.",
      "content": "Complete the ballot and turn it in. After you have completed scores for each category of the rubric, you can tally up to get the final score. Determine the winner according to the highest score. Double-check that your feedback is complete, and turn the ballots in to the tournament organizer. [10] X Research source Keep in mind that the organizer may also ask you to give an oral critique or to disclose the results."
    }
  ]
}