{
  "url": "https://www.wikihow.com/Look-Healthier",
  "title": "How to Look Healthier",
  "steps": [
    {
      "title": "You expose your body to ultraviolet (UV) rays anytime you’re in the sun.",
      "content": "You expose your body to ultraviolet (UV) rays anytime you’re in the sun. In addition to increasing your risk of skin cancer,UV rays cause the skin to look older and more worn out. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you must be in the sun, be sure to cover up your skin with long sleeves/pants and a brimmed hat whenever possible. It's also important to choose a sunscreen that will protect you from UV radiation. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Use a broad-spectrum sunscreen that protects against both UVA and UVB rays. Be sure your sunscreen has an SPF rating of at least 30, [3] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source and reapply sunscreen at least once every two hours. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try to avoid being in direct sunlight between 10:00 AM and 2:00 PM. That four hour window is when the sun's UV rays are strongest. Sunburns can begin with just 15 minutes of exposure. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Choose protective clothing that offers UV protection. You can also buy a laundry additive that will coat your clothing with a layer of UV protection. Check online or ask your local retailer about UV protective clothing and laundry additives. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Smoking",
      "content": "Smoking is one of the biggest causes of premature skin aging. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source That's because daily exposure to cigarette smoke constricts the blood vessels in your skin's outer layers, decreasing blood, oxygen, and nutrient supplies to your skin. Smoking also reduces your skin's elasticity by reducing your body's collagen and elastin, and pursing the lips or squinting the eyes while smoking can cause premature wrinkles over time. [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Daily exposure to smoke and the facial expressions associated with smoking cigarettes can, over time, cause the skin to appear leathery and wrinkled. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source The best way to protect your skin from the effects of cigarette smoke is to quit or avoid starting altogether. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Talk to your doctor about a treatment plan that can help you kick your habit."
    },
    {
      "title": "Poor shaving habits can stress and irritate your skin.",
      "content": "Poor shaving habits can stress and irritate your skin. Some simple, everyday practices to help protect your skin during shaving include: Use warm or cool water, rather than hot [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Use shaving cream or lotion, rather than using soap or attempting a \"dry shave\" [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Change your razor blades frequently so you always use a clean and sharp razor [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The ingredients in many soaps can quickly clog razors and dull the blades. Shave in the direction hair grows, rather than against the grain [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Pat your skin dry to prevent excess moisture after shaving [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Keeping your skin moisturized",
      "content": "Keeping your skin moisturized is an important part of maintaining a healthy appearance. That's because dried-out skin cells shrivel and constrict, causing wrinkles, fine lines, and potentially reducing blood and oxygen flow to your skin. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Moisturizing your skin will help your skin look healthier and maintain elasticity. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Anti-wrinkle creams can help your skin look healthier.",
      "content": "Anti-wrinkle creams can help your skin look healthier. Keep in mind that these products won't instantly fix wrinkles or sun-damaged skin, but they may help improve elasticity and reduce wrinkles over time as part of a larger skin-care regimen. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have dry or sensitive skin, be cautious when using these products. Some common ingredients in wrinkle creams include: Retinol, a vitamin A compound that helps neutralize free radicals and prevent skin cells from breaking down prematurely [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Vitamin C , which may help protect the skin from damage caused by the sun's UV rays [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Hydroxy acids (alpha-, beta-, and poly-hydroxy acids) are exfoliants that help remove dead skin cells and allow new, smoother skin cells to grow [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Coenzyme Q10 can help reduce wrinkles, especially around the eyes, and may reduce or prevent damage caused by the sun [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Tea extracts contain antioxidants, and may have anti-inflammatory properties that can soothe irritated or damaged skin [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Grape seed extracts also have antioxidant and anti-inflammatory properties, and may help wounds heal faster [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Niacinamide is related to vitamin B3 and can help prevent the skin from drying out, which improves the skin's elasticity and appearance [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Taking care of your teeth can go a long way towards having a healthier appearance.",
      "content": "Taking care of your teeth can go a long way towards having a healthier appearance. Poor dental hygiene can lead to plaque, gum disease, tooth decay, and bad breath. Brush your teeth twice each day. [26] X Research source Squeeze out a pea-sized drop of toothpaste onto your toothbrush and scrub the inside, outside, and underside of each tooth's surface. It should take you about two minutes to thoroughly brush your teeth. [27] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Use dental floss . Flossing helps remove food debris stuck between your teeth and can also reduce gum disease and halitosis. [28] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Take a strand of dental floss about 12 to 18 inches (30 to 45 centimeters) in length, wrap the ends around each index finger, and gently work the floss up and down as well as side-to-side between each tooth. Unroll a little floss from one finger while tightening the wrap on the other to ensure that you are not simply spreading plaque and debris from one tooth to the next. [29] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Use mouthwash , especially a mouthwash that contains fluoride. This will help kill germs, get rid of bad breath, and prevent tooth decay. [30] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Measure out about a half-cap to a cap full of mouthwash from the bottle, swish it around in your mouth, and spit it out without swallowing any. [31] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Healthy hygiene",
      "content": "Healthy hygiene keeps you clean and healthy. A shower or bath is ideal, but a sponge bath (wiping down with a wet sponge or washcloth) is a good alternative if usual ways are not available. Use soap or body wash that you like. Try to balance fragrance with moisturizing capabilities so that your skin does not become irritated by the soap. Be aware that daily bathing is a social norm, and not necessary for health or hygiene. In fact, some dermatologists say that daily washing strips your skin of natural oils and beneficial bacteria. Most adults can stay clean and healthy by washing every other day."
    },
    {
      "title": "Clean hair helps you look healthier and feel more confident.",
      "content": "Clean hair helps you look healthier and feel more confident. It's important to wash your hair with shampoo or soap at least once each week, though many people prefer to wash their hair on a daily basis. Wet your hair thoroughly. [32] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Squirt a glob of shampoo into the palm of your hand. A quantity about the size of a quarter should be sufficient, though if your hair is very long you may need more shampoo. [33] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Try using a moisturizing shampoo if you tend to have dry, frizzy hair. Look for hair care products that contain natural oils like olive oil, or other moisturizing agents like glycerin and shea butter. Avoid products containing mineral oil and petroleum, as these may further dry out your hair. [34] X Research source Rub the shampoo into your hair and gently massage your scalp. Don't scrub your scalp too hard, though, as this may cause pain and irritation. [35] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Rinse all the shampoo out of your hair. Make sure there is no more shampoo remaining in your hair, as this may cause irritation. [36] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Let your hair air dry, or use a towel to gently dry off your head. Try to avoid using a hair dryer whenever possible, as it can dry out or irritate your hair and scalp. [37] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Clothes can carry dirt, germs, and unpleasant body odors.",
      "content": "Clothes can carry dirt, germs, and unpleasant body odors. Re-wearing clothes multiple times can cause you to appear dirty or unhealthy. For best results, wash your clothes with laundry detergent any time they become soiled or have been worn more than once. [38] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Using a dryer or hanging your clothes directly in the sun can help kill germs that may have lingered through the washing machine. If you are using an unclean water source to wash your clothes, you also run the risk of carrying microscopic parasites in your clothing, even after washing. Use heat or direct sunlight, rather than simply air-drying your clothing indoors, to prevent the spread of germs and parasites. [39] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Good nutrition helps you both look and feel healthy.",
      "content": "Good nutrition helps you both look and feel healthy . That's because the nutrients you receive through food are used by your body to grow and make new cells. [40] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source If you consistently eat an unhealthy diet, your body may not be getting the nutrients it needs, which can result in bodyweight issues like obesity, or in deficiencies like anemia. [41] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Anemia can cause a pale appearance, fatigue, and other health problems. Get two to seven ounces of lean protein each day. Protein can come from lean meats (like salmon, tuna, or low-fat chicken) or meat alternatives (like tofu or seitan). You can also get protein from nuts, beans, and eggs. [42] X Trustworthy Source Dairy Council of California Resource center focused on providing nutrition education to help consumers make healthy choices about eating and lifestyle habits. Go to source Be sure to get at least five servings of fruits and vegetables each day. [43] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Keep your fat intake below 30 percent of your total energy intake. [44] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Try to consume only “good” fats that are unsaturated and are especially beneficial to improving your skin's appearance . These fats can be found in: fish and shellfish, flaxseed, hemp oil, soya oil, canola oil, chia seeds, pumpkin seeds, sunflower seeds, leafy vegetables, walnuts, sesame seeds, avocados, salmon and albacore tuna. [45] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Aim for two to three servings of dairy products each day. [46] X Trustworthy Source Dairy Council of California Resource center focused on providing nutrition education to help consumers make healthy choices about eating and lifestyle habits. Go to source Eat three to eight ounces of grains each day. Whenever possible, choose whole grains, such as whole-grain bread or pasta. [47] X Trustworthy Source Dairy Council of California Resource center focused on providing nutrition education to help consumers make healthy choices about eating and lifestyle habits. Go to source Avoid foods and drinks with added sugar, including processed and packaged foods . [48] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source"
    },
    {
      "title": "Exercise",
      "content": "Exercise can help you look and feel healthier. [49] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source A rigorous workout routine can help you lose and manage health conditions like cardiovascular disease, type 2 diabetes, depression, anxiety, and arthritis. [50] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For best results, try to get at least 30 minutes of exercise each day. [51] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Talk to your doctor about starting a workout program that's right for you. You can also ask your doctor for specific workout recommendations that will help you meet your goals. [52] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Drinking water",
      "content": "Drinking water has plenty of health benefits. It helps your heart pump blood more efficiently, which in turn helps your muscles work better. Hydration can also reduce inflammation like swollen feet and prevent painful symptoms like headache or dizziness. [53] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source A general rule is that you should drink eight 8-ounce glasses of water each day. However, if you are physically active and/or live in a warmer climate, you may need considerably more water each day. Monitoring your urine is the best way to gauge dehydration. If your urine comes out clear or pale yellow, you are adequately hydrated. If the color of your urine is a darker shade of yellow, or if you produce little to no urine while going to the bathroom, that is a sign that you may already be dehydrated."
    },
    {
      "title": "Posture is the general term for the ways you hold your spine, neck, and shoulders upright.",
      "content": "Posture is the general term for the ways you hold your spine, neck, and shoulders upright. Your posture affects the way you walk, stand, sit, and lie down. It also has an impact on your digestive system and your heart and lung function. Poor posture can result in misaligned bones/joints, arthritis, pain, and fatigue. [54] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Practicing good posture will help you look and feel healthy and remain active. [55] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source When standing, try to pull in your abdomen and keep your back somewhat straight. Let your shoulders relax, but don't let them slouch down or forward - instead, try to keep them back somewhat, so your arms fall straight at your sides. Balance your weight across both feet, and try to keep a stance approximately hip-distance apart. [56] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When sitting upright, keep your back straight and your shoulders pressed back. Try to keep your knees bent at a 90-degree angle and your feet flat on the floor. Avoid sitting in the same position for more than 30 minutes without standing, stretching, or adjusting your position. [57] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try to sleep in a posture that allows for some curvature of the back. For example, lying on your side with your knees slightly bent is a good and natural position, whereas lying on your side with your knees pulled up towards your chest will be painful and uncomfortable. [58] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you need to pick something big and heavy off the floor, practice good lifting posture. Squat down in front of the object with a wide stance, then grab hold of the object and stand straight up, using your legs (and not your back) to lift your body and the object upright. Avoid twisting your back while lifting, and never bend at the waist to lift something off the floor, as these acts may cause serious injury. [59] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Proper ergonomics is important to maintain back health."
    },
    {
      "title": "Slimmer clothing has a tendency to highlight one’s body shape in a more flattering way.",
      "content": "Slimmer clothing has a tendency to highlight one’s body shape in a more flattering way. While overly baggy clothing may appear \"frumpy,\" slimmer clothes can emphasize the hips, legs, or overall figure of the person wearing them. [60] X Research source At the same time, though, some fashion experts caution that wearing clothes that are too tight may cause a person to look larger than they actually are. [61] X Research source The trick may be finding the right degree of tightness for a slim, tailored look. Pairing skinny jeans with a slightly looser shirt is one way of balancing your wardrobe to highlight your body's features without causing the wardrobe to appear constrictive. [62] X Research source"
    },
    {
      "title": "A well-balanced outfit can make all the difference.",
      "content": "A well-balanced outfit can make all the difference. It's fine to wear tighter, low-rise jeans or a tight crop top, but if your body stores excess fat in the midsection and you combine low-rise pants and a crop top, your clothing will squeeze your body into a distorted shape. This may cause you to look heavier or more out of shape than you are, which may, in turn, affect your self-confidence. [63] X Research source If you are more comfortable and feel better about yourself wearing a certain style of clothing - say, tighter jeans or a more cropped top - then, by all means, continue to dress the way you're comfortable. Making simple changes like the color of your clothing can make a big difference no matter what style of clothing you wear. [64] X Research source"
    },
    {
      "title": "Try matching your shirt's color to your skin tone to achieve a healthy, natural appearance.",
      "content": "Try matching your shirt's color to your skin tone to achieve a healthy, natural appearance. [65] X Research source Often times the colors of a shirt, dress, or blouse have a stark contrast with the skin color of the person wearing those clothes. While this may be intentional and could have a positive effect on some individuals, it could also make your skin appear very pale or discolored, which may look unhealthy or malnourished to the untrained eye. [66] X Research source"
    }
  ]
}