{
  "url": "https://www.wikihow.com/Harvest-Dates",
  "title": "How to Harvest Dates",
  "steps": [
    {
      "title": "Look for soft, brown fruit.",
      "content": "Look for soft, brown fruit. Dates are ripe when they start turning brown. They'll also be slightly soft to the touch. Once you start seeing these changes, it's time to pick the ripe fruit. [1] X Research source Very immature dates will be green. They'll turn pinkish or orange as they are starting to get riper. Dates will ripen off the tree, so if your dates are being eaten by birds, you may want to harvest them early. You can also put netted bags over the fruit to keep the birds from eating them."
    },
    {
      "title": "Check for wrinkles.",
      "content": "Check for wrinkles. As dates ripen, they also start to wrinkle. They almost look like a large raisin. When checking for ripe dates, look for wrinkles, as well. [2] X Research source"
    },
    {
      "title": "Look for ripe dates throughout the season.",
      "content": "Look for ripe dates throughout the season. Dates ripen at different times. To maximize how many dates you get off the tree, you need to check it at least once a week for ripe dates. [3] X Research source Watch for the pink-orange fruit, as they will ripen in about a week."
    },
    {
      "title": "Climb the tree.",
      "content": "Climb the tree. The dates grow near the top of the tree, underneath the fronds. Grasp the triangular-shaped bark for handholds. You may want to use gloves. Many date-pickers climb barefoot, but that may not be a good idea if you're not used to it. If you do wear shoes, pick ones where you can get a good grip while climbing. [4] X Research source Another option is an electronic tree lift, which allows you to go up and view the dates without climbing the tree. It also allows easier access to the dates, as they hang outward away from the tree."
    },
    {
      "title": "Consider using a harness to climb the tree.",
      "content": "Consider using a harness to climb the tree. To protect yourself while climbing, use a harness . Date trees get very tall, and a harness can stop your fall. Basically, these harnesses are similar to climbing harnesses. However, you'll use a static rope instead of a stretchy dynamic rope. [5] X Research source A certain type of knot, the Blake's Hitch, creates friction and stops you if you begin to fall. You should also use a climbing helmet, which you can find at most sporting goods stores. Typically, tree harnesses have better seating and more padding than climbing harnesses since you spend more time in them. [6] X Research source"
    },
    {
      "title": "Pull gently on the date to pick it.",
      "content": "Pull gently on the date to pick it. A ripe date will simply pull off its stem with very little resistance. Pick dates one at a time so you don't bruise or damage them by yanking too many at once. [7] X Research source Check throughout the season to harvest the ripe dates. If you don't have a lift, you may need to cut the stalks off before harvesting. Some dates, particularly those classified as \"soft\" dates, are very fragile. You can't just toss them in a bag. You need to gently place them in a container. Medjool dates, for instance, are considered soft dates."
    },
    {
      "title": "Cut the stalk off once most of the dates have ripened.",
      "content": "Cut the stalk off once most of the dates have ripened. Near the end of the season, all of the dates on the frond will ripen. At that point, it's easiest to cut the stalk down, and harvest the dates from it off the ground. [8] X Research source To cut the stalk, take a sharp knife or machete to the base of the stalk near the tree. Hold on to the stalk as you cut, then lower it to the ground. [9] X Research source"
    },
    {
      "title": "Allow unripened dates to ripen in the sun.",
      "content": "Allow unripened dates to ripen in the sun. Spread out the yellow-pink dates on a tarp on a hot day. Leave them out there until they turn brown and soft so you know they're ripe. [10] X Research source If you're worried about birds, you can cover the dates with a light mesh. Alternatively, you can ripen dates by putting them in a brown paper bag."
    },
    {
      "title": "Rinse the dates and freeze them for at least 24 hours.",
      "content": "Rinse the dates and freeze them for at least 24 hours. Once the dates are off the trees, run them under water to rinse off anything that might be on them. Let them dry in a single layer, and then gently put them in a container to freeze for 24 hours. [11] X Research source The freeze takes care of bacteria that might be on the fruit."
    },
    {
      "title": "Keep fresh dates at room temperature for a few days.",
      "content": "Keep fresh dates at room temperature for a few days. Fresh dates, like Bahri dates, are somewhat different from the more dried varieties of dates. You can keep them at room temperature for a few days, though they will ripen more as they sit. [12] X Research source Dates are considered a dried fruit, but they aren't actually dried. They come off the tree that way."
    },
    {
      "title": "Refrigerate dates up to a month.",
      "content": "Refrigerate dates up to a month. Dates can be stored in airtight containers in the fridge. They will stay tasty for about 30 days using this method. After that time, they may still be edible, but they may not taste as good. Air is the enemy of dates, so place a layer of thin plastic on top of the dates if there's extra room in your container. [13] X Research source"
    },
    {
      "title": "Store dates up to a year in the freezer.",
      "content": "Store dates up to a year in the freezer. Dates have a much longer shelf life in the freezer. Put them in ziplock bags and push all the air out before placing them in the freezer. [14] X Research source To thaw dates, remove them from the freezer a few hours before you want to use them. [15] X Research source Another way to thaw dates is to place them in lukewarm water for 30 minutes."
    }
  ]
}