{
  "url": "https://www.wikihow.com/Grow-Nasturtiums",
  "title": "How to Grow Nasturtiums",
  "steps": [
    {
      "title": "Choose a suitable nasturtium variety for your garden.",
      "content": "Choose a suitable nasturtium variety for your garden. The variety will depend on what you expect from the nasturtium, as well as the space you have available: [1] X Research source Indian Cress - this is a vigorous trailing grower, good for a large garden; it's also known as the common garden nasturtium. The flowers come in shades of orange, yellow and red and it should flower all summer. This is an ideal plant to train up a trellis or fence. Dwarf nasturtium - a small bush variety, better for a smaller garden space. It has a wide range of flower shades and is easy to control in the garden. Peach Melba - has yellow flowers with orange-red centers, a popular addition to salads. Salmon Baby - has a unique orange-pink hue that looks great in the garden."
    },
    {
      "title": "Consider starting the seeds indoors.",
      "content": "Consider starting the seeds indoors. Nasturtiums are commonly started indoors so they'll begin to flower as soon as possible in the spring, after the last frost has passed. If you want to start your seeds indoors, plan to do so four to six weeks before the last spring frost. To start the seeds indoors, Plant each seed in a peat pot, which can be transplanted directly to the ground to avoid disturbing the roots. Use seed substrate, rather than potting soil. Keep the seeds in a bright window, and keep the peat moist. Plant the seedlings after the last frost of the spring has passed."
    },
    {
      "title": "Select a good planting spot.",
      "content": "Select a good planting spot. Nasturtiums like full sun, but they need to be shielded from midday summer heat. Since they're so low maintenance, nasturtiums are excellent for growing in spots that need covering up or for those stark, unloved parts of your garden. [2] X Research source Nasturtiums don't mind growing in a container; they'll flower just as profusely in a container as in the ground. Hanging baskets are also an ideal choice."
    },
    {
      "title": "Prepare the soil.",
      "content": "Prepare the soil. Nasturtiums like loose, well-drained soil that retains moisture. They prefer soil that is not rich, so don't use fertilizer. If there is too much fertilizer in the soil, nasturtiums focus on producing more leaves rather than flowers. Avoid any area with heavy, wet clay soil. [3] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Direct sow or transplant seedlings after the last frost.",
      "content": "Direct sow or transplant seedlings after the last frost. If you're direct sowing seeds, plant them 10 inches apart and about ½ inch deep. If you're transplanting seedlings, keep them in their peat seed starters and plant them directly in the ground. This will prevent root damage. Keep the planting bed evenly moist. You can nick the seeds or soak them in warm water overnight to help them germinate more quickly. Direct sown seeds should sprout in seven to ten days."
    },
    {
      "title": "Water only when the soil dries out.",
      "content": "Water only when the soil dries out. There's an old saying that goes, \"be nasty to nasturtiums.\" They like poor soil and not too much water, and giving them fertilizer and lots of fresh water will cause them to die. That said, nasturtiums do need water when the soil dries out. They should be watered deeply a few times a week. [4] X Research source Press your finger into the soil to see if it's time to water. If the soil feels dusty and dry, it's time. If it feels moist just below the surface, wait a day or two. Water around the roots, rather than from above. Water in the morning so the plants dry out completely before nightfall. Too much moisture around nightfall could cause the plants to grow mold."
    },
    {
      "title": "Weed the area carefully.",
      "content": "Weed the area carefully. Nasturtiums look a little like common weeds before they begin to flower. You may want to mark the planting site with a label to prevent accidentally pulling up the seedlings. Once you're sure what's a flower and what's a weed, keep the garden bed weed-free so the nasturtiums don't have to compete for water and nutrients."
    },
    {
      "title": "Pick off aphids and other pests.",
      "content": "Pick off aphids and other pests. Nasturtiums are very prone to getting attacked by aphids, cucumber beetles, cabbage butterflies, and other common garden pests. Picking the bugs off one by one and dropping them into a pail of soapy water is a great organic solution. You can also spray the flowers with water or wipe them with soapy water to deter pests. Many gardeners plant nasturtium on the borders of their gardens to keep pests away from crops like cabbage, squash, and eggplant. Gardeners who employ this method should be sure to check the plant for pests once a week and remove them as necessary."
    },
    {
      "title": "Cut off dead or faded flowers.",
      "content": "Cut off dead or faded flowers. This will encourage new, healthy growth. Deadhead the plants often in order to keep your plants flowering as long as possible through the season."
    },
    {
      "title": "Harvest the flowers and leaves throughout the growing season.",
      "content": "Harvest the flowers and leaves throughout the growing season. Both nasturtium flowers and leaves are edible. Use a pair of scissors to snip off what you need. Try not to take too much from one plant. Nasturtiums have a strong taste, and a little goes a long way. [5] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Use the nasturtiums in salads and as garnishes.",
      "content": "Use the nasturtiums in salads and as garnishes. Nasturtium petals and leaves have a strong, peppery taste that pairs wonderfully with all sorts of dishes. Try nasturtium as part of the following items: [6] X Research source Eat the leaves and petals as part of a mixed green salad. Pair them with sweeter greens, like spinach, to offset the peppery taste. Mix chopped leaves or petals into potato or egg salad. Add leaves or petals to vegetarian sandwiches. Use whole flowers as a garnish for salads, pastas and even sweet desserts, like cupcakes."
    },
    {
      "title": "Save the seeds for next year.",
      "content": "Save the seeds for next year. Toward the end of the growing season, nasturtiums will produce seeds that will mature and drop. Brush off the dirt and store the seeds in a paper bag in a cool, dark place over the winter. In the spring, you can plant them in the garden again."
    }
  ]
}