{
  "url": "https://www.wikihow.com/Make-Cookies-in-the-Microwave",
  "title": "How to Make Cookies in the Microwave",
  "steps": [
    {
      "title": "Cream together brown sugar and butter.",
      "content": "Cream together brown sugar and butter. In a small bowl, mix together 2 tablespoons of brown sugar with 1 tablespoon of butter. You can combine them using the tines of a fork. Cream the sugar and butter until they're light and fluffy. [1] X Research source It will be easier to cream the butter if it's at room temperature. If you need to, soften the butter in the microwave in 5 second increments."
    },
    {
      "title": "Mix in vanilla and milk.",
      "content": "Mix in vanilla and milk. Pour in 1/4 teaspoon of vanilla extract and 1/2 teaspoon of whole milk to the creamed butter and sugar in your bowl. You can use a fork or small spatula to mix the liquids into the creamed mixture. [2] X Research source Once you've stirred in the liquids, your batter should be mostly runny."
    },
    {
      "title": "Add the dry ingredients.",
      "content": "Add the dry ingredients. You'll want to add 3 tablespoons of flour, but start my stirring in just one tablespoon. Then add a pinch of salt and a pinch of baking powder. Add the last 2 tablespoons of your flour and stir until the dry ingredients are just combined. Stir in 2 tablespoons of chocolate chips. [3] X Research source Avoid over mixing the batter or the cookie might be tough."
    },
    {
      "title": "Set the dough on parchment.",
      "content": "Set the dough on parchment. Cut out a square of parchment paper that's about 6 inches by 6 inches. Scoop your chocolate chip cookie dough onto the center of the parchment so it roughly looks like a ball. Lightly press down on the dough ball to flatten it a little. [4] X Research source Slightly flattening the cookie will help it spread out and bake evenly in the microwave. You can place a few extra chocolate chips on top of the cookie if you want it to look and taste even more chocolaty."
    },
    {
      "title": "Microwave your cookie.",
      "content": "Microwave your cookie. Place the parchment with your cookie dough onto a microwave-safe plate. Microwave the cookie for 40 seconds. If the cookie still looks doughy, microwave it for 5 second intervals until it looks baked. Let it cool a minute before removing the cookie from the parchment. [5] X Research source This cookie is best if served or eaten immediately. If you let it sit too long, it may harden."
    },
    {
      "title": "Melt butter",
      "content": "Melt butter . Select a small mug to make your cookie in. It should have room to expand as it bakes, so use a mug that holds about 8 ounces. Place 1 tablespoon of butter in the mug and microwave it until it melts. [6] X Research source It will only take a little time in the microwave for the butter to melt. Try 5 seconds before adding more time. You don't want to boil the butter or it will start sputtering in your microwave."
    },
    {
      "title": "Add the sugar, vanilla and salt.",
      "content": "Add the sugar, vanilla and salt. Stir in 1 tablespoon of granulated sugar, 1 tablespoon of packed brown sugar, and one pinch of salt. You can use a spoon, a fork or a small spatula to stir. Ensure that the mixture is completely combined and that there are no lumps of brown sugar. [7] X Research source You can use 2 tablespoons of just one kind of sugar, if you like. The brown sugar will give a richer flavor because it's flavored with molasses."
    },
    {
      "title": "Add the egg yolk.",
      "content": "Add the egg yolk. Crack 1 egg and separate the yellow yolk from the egg white. Throw away the egg white since you won't need it for this recipe. Add the egg yolk to the mug with your creamed butter and sugar mixture. Stir in the egg yolk until it's completely combined. [8] X Research source You could store the egg white in the refrigerator to use in another recipe. Just use it within a few days."
    },
    {
      "title": "Add the flour and chocolate chips.",
      "content": "Add the flour and chocolate chips. Add a little less than 1/4 cup of flour and stir it into the mug just until you can't see the flour anymore. Add 2 full tablespoons of chocolate chips and stir it again so the chocolate chips are evenly distributed in the mug. [9] X Research source Avoid eating any of this cookie dough before cooking it since it does contain raw egg yolk."
    },
    {
      "title": "Microwave the cookie in the mug.",
      "content": "Microwave the cookie in the mug. Place the mug of cookie dough in the microwave and cook it for 40 seconds. Check to see if the cookie is done. If it is, the cookie will look dry. If it looks runny or raw, microwave the cookie in 10 second intervals until it looks cooked. Serve or eat the cookie immediately. [10] X Research source Avoid microwaving the cookie for more than 1 minute total. The cookie will keep cooking as it cools, so you don't want to microwave it too much."
    },
    {
      "title": "Cream the butter and sugar.",
      "content": "Cream the butter and sugar. Place 1/2 cup of softened butter and 3/4 of a cup of packed brown sugar into a mixing bowl. Use a spoon or hand mixer to cream the butter and brown sugar until they're light and fluffy. [11] X Research source If the butter is hard, you can set it on a plate or in a bowl and soften it using the microwave. Just ensure that you don't melt the butter."
    },
    {
      "title": "Add the liquids.",
      "content": "Add the liquids. Stir in 1 egg, 1 tablespoon of milk, and 1 teaspoon of vanilla extract. Mix the ingredients until they're completely combined. Check to make sure that the egg has been completely beaten into the other ingredients. [12] X Research source If you don't have vanilla extract, consider substituting almond extract or you could just omit it."
    },
    {
      "title": "Stir in the dry ingredients and chocolate chips.",
      "content": "Stir in the dry ingredients and chocolate chips. Add 1 1/4 cup of flour, 1/2 teaspoon of baking powder, and 1/8 of a teaspoon of salt to the creamed mixture in the mixing bowl. Use a spoon or the hand mixer to mix in the dry ingredients until they're just combined. Gently stir in just 1/2 a cup of the chocolate chips. [13] X Research source Avoid mixing the dough too much or the chocolate chip cookie bars will be tough."
    },
    {
      "title": "Spread the dough in your pan.",
      "content": "Spread the dough in your pan. Grease and flour an 8-inch square baking dish that's safe to use in the microwave. Scoop your dough into the dish and spread it evenly using a rubber spatula or spoon. Sprinkle the remaining 1/2 cup of chocolate chips over the cookie dough. [14] X Research source You can also use cooking or baking spray to prepare the baking dish."
    },
    {
      "title": "Microwave the chocolate chip cookie bars.",
      "content": "Microwave the chocolate chip cookie bars. Cook the chocolate chip cookie bars in the microwave on high for 3 1/2 minutes. Check the bars to see if they're dry and feel firm. If they're still raw, cook them in 20 second increments, checking frequently to see if they're done. Let the bars cool before you cut and serve them. [15] X Research source Your microwave should rotate the bars as they cook. If your microwave doesn't have a rotating tray, turn the baking dish a quarter turn after every minute it cooks."
    }
  ]
}