{
  "url": "https://www.wikihow.com/Get-a-Six-Pack-Without-Any-Equipment",
  "title": "How to Get a Six Pack Without Any Equipment",
  "steps": [
    {
      "title": "Target all three abdominal areas.",
      "content": "Target all three abdominal areas. To get a six-pack, you must exercise your upper abs, lower abs, and obliques (side abdominals). Aim to work your abs at least 1–2 times per week, but you can try including core exercises in your routine up to 5–6 times. [1] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. While you cannot target each area exclusively, each abdominal exercise emphasizes a particular area. The following exercises will help get you started."
    },
    {
      "title": "Exercise your lower abs.",
      "content": "Exercise your lower abs. People often find this area hardest to get in shape, so it may require the most attention. Try these exercises to target these muscles. Scissors: Lie on your back with your legs raised in the air at a 45 to 90 degree angle, depending on flexibility. Place your hands at your sides, and lower your right leg slowly until it is a few inches above the ground. Return to the original position, and then repeat the movement with your left leg. Continue alternating between legs. Try to do at least 10 reps without pausing. [2] X Research source Leg lifts: Lie on your back with your legs elevated a few inches off the ground. Keeping your knees straight, slowly raise your legs until they are perpendicular to the floor. Slowly return to the original position without letting your feet touch the ground. Repeat the exercise. Torso twists: Sit cross-legged and stretch your arms out in front of you with the fingertips of each hand touching the other. Inhale. With your abdominal muscles tight, slowly rotate your upper body about 45 degrees to the right. Exhale. Return to the center and repeat on your left side. Repeat the exercise. Note that when doing the leg lifts or scissors, your lower back should remain on the ground at all times. [3] X Research source Otherwise, you may suffer a back injury."
    },
    {
      "title": "Work your upper abs.",
      "content": "Work your upper abs. The upper abdominal muscles are those right below your sternum. They also must be strengthened to achieve a solid six pack. [4] X Research source Here are some exercises that target these muscles. Crunches with feet on the floor: Lie on your back with your knees bent at a 45 degree angle and your feet flat on the floor. Cross your arms over your chest or place your hands behind your head without touching it. Inhale as you use your core muscles to lift your head and shoulders off the ground and toward your knees. Your lower back should remain flat on the ground. Then, exhale as you slowly lower yourself back to the ground. [5] X Research source Crunches with elevated legs: Get in the crunch position, but instead of placing your feet on the ground, raise your legs in the air, keeping your knees bent. Holding your legs still and keeping your lower back on the floor, raise your upper body toward your legs while exhaling. Then, inhale as you slowly lower back to the floor. Repeat. [6] X Research source Hip lifts: Lie on your back with your arms crossed over your chest. If you are a beginner, you can also place your hands by your side with the palms facing down. Then, raise your legs so that the soles of your feet face straight up. Lift your hips upward off the floor, lifting with your abs. Repeat."
    },
    {
      "title": "Work your obliques.",
      "content": "Work your obliques. Last but not least, you'll need to strengthen your oblique muscles. Failure to do so will result in an imbalanced core and a six pack that looks strange or misshapen. Here are some exercises that will help strengthen your side abdominal muscles. Side bends: Stand up straight with your feet shoulder-width apart. Place your hands on your waist, and then slowly bend sideways at your waist, moving your upper body to the right. Return to the original position, and then repeat the movement on the left side. For a more rigorous workout, do this with your hands at your sides and a heavy object such as a jug of water your hand as you bend. [7] X Research source Oblique crunches: Lie on your back with your legs elevated and your knees bent at a 45 degree angle and hip-width apart. You may find it easiest to rest them on a flat surface such as a bench. Then, place your hands behind your head, and use your core to lift your head and shoulders off the floor, touching your right elbow to your left knee. Return to the original position, and then repeat the movement so that your left elbow touches your right knee. Exhale as you rise up, and inhale as you return to the starting position. Oblique twists (Russian twists): Lie down on the floor, bending your knees and placing your feet under a heavy object. Raise your upper body from the floor. Fully extend your arms, perpendicular to your torso, and twist your torso to one side while exhaling. Return to the starting position while inhaling. Repeat, twisting to the other side. For a more rigorous workout, do this while holding a heavy object such as a jug of water, a sack of flour, or a large dictionary. [8] X Research source"
    },
    {
      "title": "Do planks.",
      "content": "Do planks. Plank exercises are important for any abdominal muscle workout because they work all the ab muscles together, plus many other muscle groups. To do this exercise, get in push-up position, using your elbows for support rather than your hands. Keep your body in a straight line, making sure that your hips do not sag. Contract and pull in all the muscles around your middle, and do not let your belly drop. Hold for as long as you can. Keep your head relaxed and looking at the floor. [9] X Research source Start off holding this position for 10 seconds at a time, and work your way up to longer intervals. [10] X Research source To make sure that your body is straight, do this exercise in front of a mirror."
    },
    {
      "title": "Assess your belly fat.",
      "content": "Assess your belly fat. Excess fat has a tendency to accumulate around your belly. Since abdominal muscles lie underneath this belly fat, you will need to shed excess fat if you want your abdominal muscles to be visible. [11] X Research source Thus, unless you are already very trim, chances are you'll need to burn some belly fat first."
    },
    {
      "title": "Reduce your caloric intake.",
      "content": "Reduce your caloric intake. [12] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. To reduce fat, you must burn more calories than you are taking in. There are a few simple ways to reduce calories: Reduce your portion size, but don't skip meals. Not eating for long periods of time signals your body to store fat. Stay away from high calorie, low-nutrition foods. Specifically, cut out extra sugar. Excess sugar tends to be stored as fat in the midsection. Read food labels and beware of hidden sugars in bread, sauces, dressings, soda, and alcohol. [13] X Research source To curb your sweet tooth, opt for healthy choices like dark chocolate, honey, and fruit. [14] X Research source Keep track of your caloric intake by using an online calorie calculator, reading food labels, and/or keeping a food journal. Many apps exist for tablets and smartphones that can help you calculate the amount of calories you should be eating and keep track of how many you are eating."
    },
    {
      "title": "Eat lean proteins.",
      "content": "Eat lean proteins. Protein is an essential nutrient for building muscle, because your muscles are primarily composed of protein. [15] X Research source The US government recommends that, depending on your body weight and activity level, about 1/4 of your food intake should be lean proteins. [16] X Research source Your body also burns more calories in digestion of proteins than carbohydrates. Healthy options include chicken, fish, and turkey. Vegetarian options include tofu, tempeh, and seitan."
    },
    {
      "title": "Eat fruits and vegetables.",
      "content": "Eat fruits and vegetables. These foods fill you up quickly, and are rich in the vitamins and nutrients you need to maintain an active lifestyle. The US government recommends making sure that at least half of your food intake should be fruits and vegetables. [17] X Research source The remaining 1/4 of your intake (after protein, fruits, and vegetables) should be grains. Whole grains are best and should make up at least half your grain consumption. [18] X Research source Foods that are high in Vitamin C, such as oranges, kiwis, and kale help your body turn fat into fuel and balance stress-related cravings. [19] X Research source"
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. Staying properly hydrated will improve your energy and mood levels, and will help keep you full between meals. Medical studies have shown that drinking two cups of water before each meal leads people to eat less, and reduces consumption of sugary drinks. [20] X Research source Doctors recommend women should drink about 9 cups of water a day, and men about 13. [21] X Research source"
    },
    {
      "title": "Do cardiovascular exercise.",
      "content": "Do cardiovascular exercise. [22] X Expert Source Laila Ajani Fitness Trainer Expert Interview. 31 October 2019. To burn lots of calories, you should do 30-60 minutes of cardiovascular exercise (exercise that keeps your heart rate up) per day. [23] X Research source Coupled with an improved diet, these exercises can help you shed pounds. Choose an aerobic activity that you genuinely enjoy. If you enjoy your workout, you will be more likely to stick with it. There are many options for aerobic exercise that don't require a gym membership, such as walking, running, hiking, biking, dancing, and swimming. If you don't have time to do a 30-minute workout, there are simple ways to make your daily routine more active. If you work a desk job, use your break time to take a brisk walk outside. Take the stairs instead of the elevator. Do chores around the house or yard for 20-30 minutes, or walk to your destination instead of driving."
    },
    {
      "title": "Keep a food and exercise journal.",
      "content": "Keep a food and exercise journal. For any exercise program, a journal is a good way to keep track of your goals and whether or not you are meeting them. [24] X Research source Keep careful notes of everything you eat and all the exercises you do each day. An exercise journal can help you see which areas of your diet and exercise regimen need improvement."
    },
    {
      "title": "Measure your waist circumference.",
      "content": "Measure your waist circumference. Since muscle weighs more than fat, these measurements will be more important indicators of your progress than pounds on the scale. Weekly measurements of your waist will keep you accountable and highlight the progress you've made. [25] X Research source For an accurate measurement using an ordinary measuring tape, measure just above your upper hip bone. [26] X Research source Don't measure over your clothes. Relax your muscles and don't suck in your gut."
    },
    {
      "title": "Take before and after pictures.",
      "content": "Take before and after pictures. Since we look at ourselves in the mirror every day, it can be hard to notice our own overall progress without pictures. Take a photo of yourself every two weeks and compare it to the previous photographs. The changes you see will help keep you motivated. [27] X Research source"
    }
  ]
}