{
  "url": "https://www.wikihow.com/Get-an-Illinois-Driver%27s-License",
  "title": "How to Get an Illinois Driver's License",
  "steps": [
    {
      "title": "Present the required forms of identification at a Secretary of State driving facility.",
      "content": "Present the required forms of identification at a Secretary of State driving facility. Locate the nearest Secretary of State driving facility and appear in person to submit your paperwork. In order to apply for a driver's license, you will need to provide proof of your written signature, date of birth, social security number, and Illinois residency. For a full list of required documents refer to the state of Illinois's website, Cyber Drive Illinois. [1] X Research source To verify your written signature, bring a copy of a canceled check, a debit or credit card, your driver's education certificate, a passport, or a court order. For birthdate verification, bring a copy of your birth certificate, a naturalization certificate, a passport, or your military service record. To verify your social security number, bring a copy of your social security card or a military driver's license or ID card. To prove you are a resident of the state of Illinois, bring a canceled check, a bank statement, a copy of your deed/title to your house or rental/lease agreement, a pay stub, or a copy of a utility bill."
    },
    {
      "title": "Complete an adult driver's education course.",
      "content": "Complete an adult driver's education course. If you are a first-time driver between the ages of 18 and 20, you'll need to provide a certificate of completion for a state-approved adult driver's education course in order to obtain a license. If you are at least 21 years of age, a driver's education course is optional but the state strongly recommends that you do it. [2] X Research source For convenience, new adult drivers are eligible to take a driver's education course online. The course must last 6 hours and be on the list of state-approved driver's education courses. Access a list of state-approved courses online. [3] X Research source A new adult driver may be exempted from the driver's education course requirement if they can provide a high school transcript that proves they took a driver's education course in high school. Once you complete your driver's education course, you will receive an email from the Secretary of State with your completion certificate. Bring this when you apply for your license at a Secretary of State facility."
    },
    {
      "title": "Study, then pass the required exams.",
      "content": "Study, then pass the required exams. Be prepared to pass a vision test and possibly a written and road skills test. Study for the exams by reading Illinois's \"Rules of the Road\" and taking practice exams on the state of Illinois's website. Whether or not you will be required to pass a written or road skills exam will depend on your past driving experience. [4] X Research source Usually, people have testing anxiety. You may be anxious about the driving exam. So it is better to preview the testing area and the testing instrument to prepare yourself. Practice with someone with whom you do not normally drive. It will give you a mock experience of what it will feel like when the examiner gets in your car. If you have a valid out of state driver's license, you probably won't have to take a written or driving exam. The vision test will ensure that you are able to see properly before operating a motor vehicle. If your vision does not meet the necessary requirements, you may be required to get contacts or glasses before obtaining your license."
    },
    {
      "title": "Have your photo taken.",
      "content": "Have your photo taken. Smile and pose for a photograph in front of the approved background. This photo will be placed on the front of your new driver's license for identification purposes. [5] X Research source There will be a bright flash, so focus on not blinking! Tilt your chin down slightly for a more attractive photo angle."
    },
    {
      "title": "Pay the necessary fees.",
      "content": "Pay the necessary fees. Using a credit card or cash, pay the required fee in order to obtain your license. License fees vary depending on your age and the type of license you are obtaining. Commercial driver's licenses are more expensive, for example. [6] X Research source The basic license fee for drivers between 21 and 68 years of age is $30. A reduced fee of $5 is available for drivers between the ages of 18-20 and 69-80. The driver's license fee is waived for individuals over the age of 87."
    },
    {
      "title": "Wait for your license to arrive by mail.",
      "content": "Wait for your license to arrive by mail. You will be given a temporary, secure paper license once you have completed all of the requirements. Your temporary license will be valid for 90 days. [7] X Research source You will be able to use your temporary license for identification and driving purposes. The Department of Homeland Security will accept your temporary license along with your expired ID as proof of identification in order to board a plane. Your permanent license will arrive in the mail within 15 business days. If you haven't received your license within 15 days, check the status of your ID online at https://www.ilsos.gov/dlstatus , or by calling 217-782-7044."
    },
    {
      "title": "Enroll in a driver's education course once you are at least 15 years old.",
      "content": "Enroll in a driver's education course once you are at least 15 years old. Locate a state-approved driver's education course online that is in the same district as where you attend school. The course will typically last for the length of a semester. You may enroll in a course anytime after you turn 15. If you haven't enrolled in a driver's education course by the time you turn 18, you may be eligible to enroll in an online driver's education course for adults. [8] X Research source Most public schools offer driver's education courses. If you attend a private school, you will be permitted to enroll in a driver's education course at a public school or through a third party provider. The driver's education course will teach you how to be a safe and responsible driver as well as how to drive in hazardous road conditions."
    },
    {
      "title": "Apply for a learner's permit and pay a fee.",
      "content": "Apply for a learner's permit and pay a fee. Present your social security card or passport, and a certified copy of your high school transcript in order to verify your birth date, social security number, residency, and written signature when applying for a learner's permit. You will also be required to present proof of enrollment in a driver's education course. Use cash or credit card to pay the $20 learner's permit fee. [9] X Research source You must either be enrolled in a driver's education course or 30 days away from beginning your course in order to apply for a learner's permit. Consult the state of Illinois's Secretary of State website for a complete list of acceptable forms of identification."
    },
    {
      "title": "Pass a vision test and a written driving exam.",
      "content": "Pass a vision test and a written driving exam. Study for your written driving exam by reading the Illinois driving manual, \"Rules of the Road,\" and by taking online practice exams. If you do not pass the vision exam you will be required to get contacts or glasses before obtaining your learner's permit. [10] X Research source You will take the written exam at a Secretary of State driving facility. If you do not pass the exam on the first try, you will be able to return and repeat the exam on another day. Once you pass the exam and present the required documents, you will be awarded a learner's permit. Your learner's permit will be valid for 2 years."
    },
    {
      "title": "Complete and log 50 hours of practice driving.",
      "content": "Complete and log 50 hours of practice driving. Practice driving for at least 50 hours while accompanied by an adult over the age of 21 with a valid license, once you obtain your learner's permit. You will need to practice driving at night for at least 10 of these hours. Make sure to log your hours on the required form, which can be found on cyberdriveillinois.com, and have your adult driving supervisor vouch for your hours by signing the form. [11] X Research source Keep in mind that you will need to follow the driving restrictions in place for teens driving with a learner's permit. You will not be eligible to drive between 10 p.m. and 6 a.m. from Sunday through Thursday and 11 p.m. and 6 a.m. on Friday through Saturday. [12] X Research source You are not permitted to use your cell phone to either call or text at any point while driving. If you commit any traffic violations while you have a learner's permit, you will be required to wait an additional 9 months before applying for an initial driver's license."
    },
    {
      "title": "Apply for an Illinois initial driver's license and pay a fee.",
      "content": "Apply for an Illinois initial driver's license and pay a fee. Present your learner's permit, your completed 50-hour practice driving log, a signed permission form from your parent or guardian, a certificate verifying your completion of a driver's education course, and proper forms of identification in order to apply for your initial driver's license. [13] X Research source Use the same proof of identification that you used to apply for your learner's permit. You are eligible to apply for an initial license if you are at least 16 years old and have held your learner's permit for at least nine months without any traffic violations. If your learner's permit has expired by the time you apply for your initial license, you will be required to pay a $30 fee."
    },
    {
      "title": "Pass a driving test.",
      "content": "Pass a driving test. You will need to pass a behind-the-wheel driving test at your local Secretary of State facility. Your driving exam will test you on the skills you learned and practiced during your driver's education course. It will either take place on a closed course or city street. [14] X Research source Make sure to bring your vehicle registration and proof of liability insurance for the vehicle you will be driving during the test. Once you pass the driver's test, you will be awarded an initial driver's license."
    },
    {
      "title": "Follow the initial license driving restrictions to obtain a full driver's license.",
      "content": "Follow the initial license driving restrictions to obtain a full driver's license. Follow all of the driving restrictions associated with this provisional license carefully. Failure to follow the rules will keep you from obtaining a full driver's license once you turn 18. [15] X Research source For the first 12 months after obtaining your initial license, you are permitted to drive with only one passenger under the age of 20 who is not part of your immediate family. You are not permitted to drive between the hours of 10 p.m. and 6 a.m. from Sunday through Thursday and 11 p.m. and 6 a.m. on Friday and Saturday Once you turn 18 and you have not committed any driving violations in the past 6 months, your initial license will convert to a full license! You will no longer have a curfew or restrictions placed on your ability to drive with passengers."
    }
  ]
}