{
  "url": "https://www.wikihow.com/Live-a-Long-Life",
  "title": "How to Live a Long Life",
  "steps": [
    {
      "title": "Prepare your body for a long life by exercising.",
      "content": "Prepare your body for a long life by exercising. Exercise benefits both your physical and mental health. The physical activity strengthens your body, helps you control your weight, and improves your balance and coordination. Simultaneously, your body releases endorphins which will help you relax and feel good. Endorphins can also reduce pain and improve your mood. Try to do both aerobic exercise and strength training. Aerobic exercise gets your heart rate up and improves your endurance. Possible activities include jogging, fast walking, swimming, and many types of sports. Try to do 75 to 150 minutes per week. Strength training, like weight lifting, will improve your bone density and build muscle. Try to do it two times per week."
    },
    {
      "title": "Be proactive about identifying and treating health problems.",
      "content": "Be proactive about identifying and treating health problems. Preventative care is important for identifying health problems before they become a major concern. It is also important to identify lifestyle factors, familial history, and work exposures that may lead to the development of a disease or dysfunction. If you skip doctor’s appointments, you increase the chances of not catching a developing health problem right at the start. This means that it will likely be more complicated and harder to treat. Have a checkup once a year. If your doctor recommends other screenings, do them. If you have a chronic condition, talk to your doctor about how to manage it to either improve it or prevent it from getting worse. Know what health problems may run in your family and get screened regularly."
    },
    {
      "title": "Avoid high risk behavior.",
      "content": "Avoid high risk behavior. Accidents, including during sports or driving, are frequent causes of head trauma and spinal cord injuries. Drive carefully, wear your seat belt, and obey speed limits. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Use caution when crossing the street as a pedestrian. Look both ways to see if there are any cars around. Wear appropriate protective and safety gear when playing sports, particularly risky sports like football, horseback riding, rock climbing, bungee jumping, skydiving, skiing, and snowboarding."
    },
    {
      "title": "Avoid toxic substances.",
      "content": "Avoid toxic substances. It is important to avoid substances that may increase your chances of developing health problems. This includes pollutants, pesticides, chemical fumes, and asbestos."
    },
    {
      "title": "Avoid excessive alcohol intake.",
      "content": "Avoid excessive alcohol intake. If you do drink, daily recommendations are that women should drink no more than one drink per day and men no more than one or two drinks per day. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Drinking alcohol in low amounts should be ok for your health as long as you are healthy and don’t overdo it. Excessive drinking can make you more likely to get cancers of the digestive tract, heart problems, strokes, high blood pressure, liver disease, and to suffer injuries in accidents. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you do drink, be careful not to mix alcohol with medicines, including over-the-counter medicines, that may interact. Don’t drink and drive."
    },
    {
      "title": "Quit smoking",
      "content": "Quit smoking and using nicotine products. Even if you’ve smoked or used other nicotine products for many years, quitting will still improve your health and help you live longer. Smoking greatly increases your risks of: Lung diseases, including cancer Cancer of the esophagus, larynx, throat, mouth, bladder, pancreas, kidney, and cervix Heart attacks Strokes Diabetes Eye disorders like cataracts Respiratory infections Gum disease"
    },
    {
      "title": "Avoid street drugs.",
      "content": "Avoid street drugs. Street drugs are risky for multiple reasons. Not only may the drug itself harm you - it may also be mixed with other harmful substances. The health risks include: [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Dehydration Confusion Memory loss Psychosis Seizures Coma Brain damage Death"
    },
    {
      "title": "Support your body’s ability to heal by eating enough protein.",
      "content": "Support your body’s ability to heal by eating enough protein. Your body uses protein to make new cells. This means that it is important for repairing tissue damage in your body. [5] X Research source Though meat and animal products are common sources of protein, you can also get all of the proteins you need from plant foods, such as lentils, beans, hemp seeds, quinoa, chia seeds, seeds, and nuts. Proteins are found in meat, milk, fish, eggs, soy, beans, legumes, and nuts. Adults should eat 2 to 3 servings of high protein foods per day. Childrens’ needs will vary according to their ages."
    },
    {
      "title": "Keep your vitality by enjoying a diet with diverse fruits and vegetables.",
      "content": "Keep your vitality by enjoying a diet with diverse fruits and vegetables. Fruits are foods that grow from the flower of plants while vegetables are foods that come from the stems, flower buds leaves, and roots. Both are excellent sources of the vitamins and minerals your body needs to stay healthy throughout a long life. Fruits include berries, beans, corn, peas, cucumber, grains, nuts, olives, peppers, pumpkin, squash, sunflower seeds, and tomatoes. Vegetables include celery, lettuce, spinach, cauliflower, broccoli, beets, carrots, and potatoes. Fruits and vegetables are low in calories and fat, but high in fiber and vitamins. Eating a diet that is high in fruits and vegetables can reduce your risks of developing cancer, heart problems, high blood pressure, strokes, and diabetes. Try to eat 4 servings of fruits and 5 servings of vegetables per day."
    },
    {
      "title": "Eat healthy amounts of carbohydrates.",
      "content": "Eat healthy amounts of carbohydrates. Carbohydrates are abundant in nature, such as in fruits and vegetables. Carbohydrates include sugars, starches, and fiber. Your body obtains energy by breaking down these compounds. Simple sugars are digested more quickly than complex sugars. [6] X Research source Focus on getting most of your carbohydrates from natural sources like fruits and vegetables and reduce your intake of carbohydrates from items like baked goods and other processed foods. Simple sugars are found in fruits, milk, milk products, vegetables, and processed sweets. Complex carbohydrates are in beans, peas, lentils, peanuts, potatoes, corn, green peas, parsnips, whole-grain breads. About half of your daily calories should come from carbohydrates, with most of it coming from complex carbohydrates as opposed to simple sugars."
    },
    {
      "title": "Eat a controlled amount of fat.",
      "content": "Eat a controlled amount of fat. Your body needs some fat to help it absorb fat soluble vitamins, control inflammation, assist with muscle repair, clot blood and maintain proper brain function, but too much is not good. [7] X Research source Common sources of fats are butter, cheese, whole milk, cream, meats, and vegetable oils. Eating too much fat increases your chances of high cholesterol, heart problems, and strokes. You can reduce your fat consumption by eating lean meats, poultry, fish, and drinking low-fat milk. [8] X Research source Many restaurants enhance the flavor of their foods with ingredients that are high in fat such as cream, whole milk, or butter. By cooking your food yourself, you can control the amount of fat in your food. Don't choose fat-free or low fat foods. You need fat. Contrary to popular beliefs, dietary fat does not make you fat [9] X Research source [10] X Research source . However, don't eat too much fat as it is unhealthy."
    },
    {
      "title": "Get enough vitamins and minerals through a healthy diet.",
      "content": "Get enough vitamins and minerals through a healthy diet. If you are eating a balanced diet, you are probably getting sufficient vitamins and minerals. These substances are vital for your body to function properly, repair itself and grow. [11] X Research source Vitamins and minerals occur naturally in many foods, especially fruits, vegetables, whole grains, meats, and dairy. If you are concerned that you may not be getting enough vitamins and minerals, talk to your doctor about adding some multivitamin and multi-mineral supplements to your diet. The needs of pregnant women and children may differ from the needs of others."
    },
    {
      "title": "Eat a low salt diet.",
      "content": "Eat a low salt diet. While your body needs some salt too so that you maintain muscle and nerve function and manage your blood volume and pressure and blood volume, too much over a long period of time is unhealthy. [12] X Research source The CDC recommends keeping your sodium intake below 2,300 milligrams per day. [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Too much salt can cause high blood pressure and aggravate heart, liver, or kidney conditions. Most foods contain some salt naturally and many have salt added to enhance the flavor. Adults should consume no more than about a teaspoon of salt per day. If you have a health condition, you may need to eat much less. Avoid fast food. Not only is it high in fat, but it is also usually very high in salt."
    },
    {
      "title": "Cleanse your body by drinking enough water.",
      "content": "Cleanse your body by drinking enough water. Drinking enough water will help your body flush out toxins, maintain your bodily functions, and keep your kidneys healthy. [14] X Research source Drink at least eight 8-ounce glasses of water per day to stay hydrated, and drink more if you are sweating, such as from exercising or doing physical labor. The amount you need will be influenced by your body weight, your activity level, and the climate you live in. The best way to stay hydrated is to drink enough water that you don’t feel thirsty. If you urinate infrequently or pass dark or cloudy urine, you probably need to drink more."
    },
    {
      "title": "Protect your psychological well-being by maintaining close social relationships.",
      "content": "Protect your psychological well-being by maintaining close social relationships. Friends and family will make relaxation fun when things are good and they can provide you with support and distraction when life is hard. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Maintain your social network though corresponding by writing, telephone, or in person. Using social media can also help people stay connected. Regular social interaction will help you relax and take your mind off your stress. If you feel isolated, consider locating a support group or counselor to help you."
    },
    {
      "title": "Stay resilient by sleeping enough.",
      "content": "Stay resilient by sleeping enough. By not getting enough sleep you are compounding the psychological stressors in your life with the physical stress of sleep deprivation. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When you sleep, your body can put more energy into fighting off infections and healing. Try to get at least 7 to 8 hours of sleep per night. Some people may need even more."
    },
    {
      "title": "Stay excited about life through hobbies.",
      "content": "Stay excited about life through hobbies. This will give you something to look forward to and prevent you from dwelling on the things that are stressing you out. Look for something that is inexpensive which you can do all year long. Possibilities include reading, listening to music, art or photography, crafts, or sports. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Avoid competitive activities that will put additional pressures on you."
    },
    {
      "title": "Set aside time for relaxation.",
      "content": "Set aside time for relaxation. Whether this involves simply free time or a formal relaxation technique, do what works for you. Or try several until you find the one you like the best: [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Visualization of calming images Progressive muscle relaxation in which you concentrate on tensing and then relaxing each muscle group in your body Meditation Yoga Massage Tai chi Music or art therapy Deep breathing"
    },
    {
      "title": "Cultivate happiness.",
      "content": "Cultivate happiness. Take time to enjoy life and do the things that make your life meaningful to you. Do activities that give you a sense of purpose. Many people enjoy volunteer work in their free time. Nourish your brain with intellectual stimulation. Whether it comes from friends, family, or taking informal courses, or taking up a new craft, learning will keep you enthusiastic about the world around you. Connect with others. For some people it is with family, friends, a religious organization, or the community around them, but whoever the people close to you are, they will help you stay happy and young of heart."
    }
  ]
}