{
  "url": "https://www.wikihow.com/Know-if-Garlic-Is-Bad",
  "title": "How to Know if Garlic Is Bad",
  "steps": [
    {
      "title": "Look for rotten spots on the outside of the head or unpeeled cloves.",
      "content": "Look for rotten spots on the outside of the head or unpeeled cloves. If your garlic has gone very bad, it will start to show through the skin. You may see brown or black spots, for instance, or just discoloration in general. [1] X Research source Toss the garlic if it's reached this stage."
    },
    {
      "title": "Feel for mushiness through the peel.",
      "content": "Feel for mushiness through the peel. Garlic should be firm to the touch if it's still good, much like an onion. If it feels soft or gives way as you try to peel off a clove, it's gone bad. Similarly, if you notice any liquid, that's a sign it's way past its expiration date. [2] X Research source Throw garlic at this stage in the trash."
    },
    {
      "title": "Check for a yellow hue and bad spots once you peel the garlic.",
      "content": "Check for a yellow hue and bad spots once you peel the garlic. Even if it seems fresh from the outside, you may find it's not once you peel it. Fresh garlic should be white, and if it's starting to take on a yellow hue, it's definitely on it's way out. Plus, you may see little brown spots on the clove, another indication it's going bad. [3] X Research source If it doesn't seem soft or have bad spots, you may be able to use the yellow garlic, but it won't be as good as white. Use your best judgment about whether it's time to toss it."
    },
    {
      "title": "Smell your garlic to see if it still has its scent.",
      "content": "Smell your garlic to see if it still has its scent. It should have a strong garlicky smell once you've peeled it. If it doesn't, it's not as fresh as it should be. It may also develop a rancid, sour, vinegary smell, which means it's starting to rot. [4] X Research source If the scent has faded but not developed a sour smell, it's likely fine to use, but it won't be as pungent. Throw out garlic that has a bad smell."
    },
    {
      "title": "Peel away the green bits if your garlic is sprouting.",
      "content": "Peel away the green bits if your garlic is sprouting. Look at the top of the cloves, and you may see little green tips, which mean the garlic is sprouting. At this point, your garlic will be sharper in flavor, but not necessarily bad. [5] X Research source Some people don't like to use garlic at this stage. However, as long as you peel or cut away the green parts, it's fine to use, and you can experiment to see if it's to your tastes. The green parts are bitter, so you don't want to eat them. In fact, sprouted garlic may have more healthy antioxidants than the fresher variety. [6] X Research source"
    },
    {
      "title": "Keep whole garlic heads for up to 6 months out of the refrigerator.",
      "content": "Keep whole garlic heads for up to 6 months out of the refrigerator. Fresh garlic is partially dried and preserved by its natural layers of skin. Therefore, it can keep quite a long time at room temperature. Pick a cool, dark cabinet, for instance, or stick it in a paper bag in a cool part of the kitchen. However, it can go bad as quickly as 3 months after it's been harvested, so keep an eye on it. [7] X Research source Once you pull off a clove, it will last for a couple of months as long as you haven't peeled it yet. For maximum freshness, keep it in a cool, dark place. Store it someplace with plenty of air circulation; don't keep it in a sealed container! Avoid storing it in the fridge as it does better closer to room temperature."
    },
    {
      "title": "Keep peeled cloves for about a week in the refrigerator.",
      "content": "Keep peeled cloves for about a week in the refrigerator. If you're peeling garlic, you may want to save yourself some trouble later by doing more cloves than you need. After all, peeling is one of the most tedious parts of using fresh garlic. The good news is you can work ahead as long as you put those peeled cloves in the fridge and use them within about a week. [8] X Research source Keep in mind this only holds true if you don't crush or damage the clove itself. Some peeling methods ask you to crush the clove or cut off the ends, for instance. If that's the case, it will last about as long as fresh, chopped garlic."
    },
    {
      "title": "Use fresh chopped garlic within a few days.",
      "content": "Use fresh chopped garlic within a few days. If you've gone to the trouble of chopping garlic, you don't want to waste any that's leftover! However, it will go bad very quickly. If you cover it with a layer of olive oil, it should be good up to 3 days in the refrigerator. Otherwise, you should toss it after about 1 day. [9] X Research source"
    },
    {
      "title": "Check the expiration date for chopped garlic in a jar from the store.",
      "content": "Check the expiration date for chopped garlic in a jar from the store. You can also buy chopped garlic in a jar, and this kind has preservatives to keep it fresh for longer. Usually, you can keep it in the refrigerator for 2-3 months, but it does depend on the brand. [10] X Research source Don't just look for the expiration date; check for the \"once opened\" date. That is, some jars will have a note that says something to the effect of, \"Use within 1 month once opened.\" The expiration date sometimes refers to the date the unopened jar goes bad."
    },
    {
      "title": "Try sprouted garlic in stock or broth.",
      "content": "Try sprouted garlic in stock or broth. While some recipes will call for the distinct taste of very fresh garlic, the long cooking time and additional flavor in stocks can help hide the sharper taste. Just remember to cut off the green parts, and then you can throw it in with the rest of your stock or broth vegetables. [11] X Research source This is a great place to use other kitchen scraps. Keep a bag in your freezer for clean vegetable scraps, such as carrot peels, onion roots and tops, parsley stalks, celery leaves, tomato peels, and so on. Put them all in a pot and cover them with water. Cook the vegetables for at least 30 minutes before straining."
    },
    {
      "title": "Put sprouted cloves in dishes where you only use 1-2 cloves.",
      "content": "Put sprouted cloves in dishes where you only use 1-2 cloves. In other words, pick dishes where garlic is not the main flavor. If you need 1-2 cloves for a sauce, soup, or casserole that are heavily flavored with other herbs and spices, sprouted cloves (without the sprout) should be fine. [12] X Research source Skip using sprouted cloves when garlic is the star, such as 40-clove chicken, garlic bread, or a garlic pasta sauce."
    },
    {
      "title": "Plant sprouted garlic",
      "content": "Plant sprouted garlic in a pot or your garden. Use a pot that's at least 8 by 12 inches (20 by 30 cm). Put the garlic cloves in the soil with the sprouts facing up and place them about 4 inches (10 cm) apart. Cover the clove with dirt except for the sprouts, and then water the soil until it's damp to start the growing process. [13] X Research source Put the container in a sunny area. When it gets dry outside, give your garlic some water, and make sure to keep the weeds out of the garlic pot or bed. The best time to plant garlic outside is in the fall. Unless you have very cold winters, it will grow throughout the winter. In the summer, the leaves will yellow, and you can pick and cure your garlic by hanging them up to dry. [14] X Research source"
    }
  ]
}