{
  "url": "https://www.wikihow.com/Identify-a-Deer-Tick",
  "title": "What Does a Deer Tick Look Like?",
  "steps": [
    {
      "title": "Remove the tick from its host, if necessary.",
      "content": "Remove the tick from its host, if necessary. The best way to remove the tick is to use pointy-edged tweezers, angling the points to ensure that the head of the tick is removed along with the body. [2] X Research source Old-fashioned methods, such as soaking it with petroleum jelly or painted the affected site with nail polish, should be avoided as they traumatize the tick, which may then regurgitate its stomach contents (including bacteria) into the dog's bloodstream. Did you remove the whole tick? If you've jerked or twisted the tick while removing it, the mouth-parts may break off and remain in the skin. You may be able to remove the mouth-parts separately using clean tweezers. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You should still be able to identify the tick without the mouth-parts. Put the tick in a vial or lidded jar, or place it on a piece of white paper and use a piece of clear tape to cover it."
    },
    {
      "title": "Confirm that it's a tick.",
      "content": "Confirm that it's a tick. How many legs does it have? Ticks, like other arachnids, will have eight legs in the nymph and adult stage, but will have only six legs in the larval stage. [4] X Research source If you've put the tick in a jar or vial, watch it move. If it is a tick, it will crawl, but will not be able to fly or jump. Ticks have flattened, tear-shaped bodies at all stages of growth. When engorged, the tick's body will be rounded and its color will be lighter. Deer ticks are smaller than their counterparts, the dog and lone star ticks. Deer tick nymphs are typically the size of a poppy seed, 1 to 2 mm (.039 to .078 inches) in diameter, while adults range from 2 to 3.5 mm (.078 to .137 inches) and are roughly the size of a sesame seed. An engorged tick may be about 10 mm long. [5] X Research source Hard ticks, such as the deer tick, have a scutum or shield covering the body. [6] X Research source Soft ticks do not have this feature."
    },
    {
      "title": "Examine the tick's \"scutum,\" or shield.",
      "content": "Examine the tick's \"scutum,\" or shield. A magnifying glass can be helpful, as ticks in pre-adult stages are quite small. The scutum is the hard section behind the tick's head. A deer tick will have a solid-color scutum, while the shield of other ticks is patterned. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source The scutum can also provide information about the gender of the tick.The scutum of the adult male will cover most of the body, while that of the female will be much smaller. If the tick is engorged (after feeding) it can be hard to identify by other characteristics. An engorged deer tick will be rust- or brown-red in color, while the color of other engorged ticks may be pale gray or greenish-gray. [8] X Research source However, the scutum will remain unchanged."
    },
    {
      "title": "Identify the tick by its markings.",
      "content": "Identify the tick by its markings. Unfed adult female deer ticks have a unique bright orange-red body surrounding the black scutum. Adult males are dark brown to black in color. [9] X Research source The name \"wood tick\" is used for a number of different ticks, including the deer tick, lone star tick, and American dog tick. All three ticks tend to live in wooded or recently cleared areas, and crawl up from the ground. You'll need to look to their markings to tell them apart. Brown dog ticks will have mottled brown and white markings on their scutums, which deer ticks do not have. The lone star tick has a distinctive white star-like marking on its scutum. The deer tick is about half the size of the brown dog tick, both in its pre-fed state and when engorged. Brown dog ticks rarely attach to humans. [10] X Research source However, they are one of the few ticks that can infest a home. As the name implies, they're frequently carried by dogs, and can be found in kennels, around veterinary offices, and outdoor areas frequented by infected animals."
    },
    {
      "title": "Look at the length of the tick's mouthparts, or \"capitulum.",
      "content": "Look at the length of the tick's mouthparts, or \"capitulum. \" It may look like a head, but this is the part of the tick that attaches to the host in order to feed. It consists of two leg-like sensory structures that detect the presence of a host, a pair of knife-like structures that allow the tick to cut through the skin, and a single barbed structure (the \"hypostome\") that enters this opening. [11] X Research source The capitulum on the deer tick is much longer than in other common ticks, such as the dog tick. The capitulum is positioned to the front, and visible from above. [12] X Research source The female deer tick has a larger capitulum than a male deer tick. Adult male deer ticks do not feed."
    },
    {
      "title": "Consider where you found the tick.",
      "content": "Consider where you found the tick. Deer ticks are particularly well-established along the Eastern and Upper Midwestern United States, but can be found as far south as Texas and into Missouri, Kansas, and parts of Oklahoma. [13] X Research source Deer ticks are most active in the spring, summer and fall. However, they may be active whenever the temperature is above freezing. Other forms of ticks, such as the dog tick, are generally most active in spring and summer months only. [14] X Research source The adult form of the deer tick lives in woody, brushy habitats. They prefer low-lying shrubs, not trees. The Western Blacklegged Tick is another form of the deer tick, found along the Pacific Coastal regions. It is especially active in Northern California. This form of tick rarely attaches to humans. [15] X Research source"
    }
  ]
}