{
  "url": "https://www.wikihow.com/Kiss-Your-Crush-out-of-the-Blue",
  "title": "How to Kiss Your Crush out of the Blue",
  "steps": [
    {
      "title": "Try to connect with them during shared activities or classes.",
      "content": "Try to connect with them during shared activities or classes. Use events or meetings you’ll both already be attending as an opportunity to bond with your crush. This will create an opportunity to flirt. [1] X Research source For example, if you’re both going to be taking Chemistry together, try sitting close to them so you can ask questions."
    },
    {
      "title": "Invite them to do things in a group.",
      "content": "Invite them to do things in a group. After you’ve been getting along in settings where you both have to be somewhere, you should invite your crush to do something fun in a group. Group activities, such as having lunch out or playing softball, are great because your crush can get to know you without the pressure of a date. Try to pick an activity that fosters conversation. Pick a game night instead of a movie, for example, so you can talk to each other more. For example, you could say, “My friends and I are trying a new BBQ place downtown this weekend for lunch. Do you want to come?” Be sure to mention that you are going in a group. After one successful group hang out, your goal should be to schedule more. Try to integrate your crush into a social aspect of your life. This way when kiss them out of the blue it feels more like the exciting culmination of building anticipation rather than a rude surprise. Be patient. This process can take time."
    },
    {
      "title": "Try one-on-one activities.",
      "content": "Try one-on-one activities. After a few successful group hang outs, ask your crush to hang out one-on-one. It’s not necessary to define this as a date. The goal is for your crush to enjoy spending time with just you, so they can begin to consider you in a romantic way, setting up your surprise kiss. [2] X Research source For example, to ask your crush out, you could say, “It’s supposed to be a nice day Saturday. Want to go play putt putt golf with me?” or “I’ve been meaning to try that new Café on Green street. Want to grab a bite on Thursday?” Try to avoid something overtly date-oriented like dinner and a movie, which will create expectations around your kiss. A competitive activity can be fun and will keep your crush guessing. If your crush rejects your offer to hang out one-on-one or seems unreceptive, understand that not all crushes are requited. You probably should not try to kiss them if they feel uncomfortable hanging out just you two together."
    },
    {
      "title": "Read their body language.",
      "content": "Read their body language. Your crush’s body language can tell you a lot about how they are feeling when you are together. More open postures like legs set wider and hands on hips indicate comfort. More closed postures, knees crossed or arms crossed over their chest indicate unease. [3] X Research source [4] X Research source Try to read your crush’s body language to gauge their physical comfort with you. This can help you read if a moment for an unexpected kiss is right."
    },
    {
      "title": "Try to hold hands.",
      "content": "Try to hold hands. If your crush’s body language tells you they are feeling comfortable with you, try some physical contact, like brushing their arm or even holding hands. This can help you feel out if a kiss they aren’t anticipating will go over well or not. Men like it when a girl makes the first move. [5] X Research source They appreciate a touch, a smile, and flirting in general. [6] X Research source"
    },
    {
      "title": "Attempt a cheek kiss.",
      "content": "Attempt a cheek kiss. If you’re afraid your kiss out of the blue may be rejected by your crush, try kissing them on the cheek. If they are comfortable with that, they could be receptive to more intimate kissing from you."
    },
    {
      "title": "Linger at the end of a one-on-one outing.",
      "content": "Linger at the end of a one-on-one outing. At the end of a one-on-one outing, linger with your crush just a little longer than normal. Attempt to draw out natural pauses in your speech. Even if you’re nervous, try not to fill every moment with words. This allows a natural moment of anticipation to build. [7] X Research source Creating more anticipation for the kiss will make it seem more exciting and out of the blue."
    },
    {
      "title": "Practice good oral and personal hygiene.",
      "content": "Practice good oral and personal hygiene. If you want to make yourself as kissable as possible, be sure your breath is fresh and that you don’t have any body odor. It’s also helpful to apply an unflavored lip balm for soft lips. Brush your teeth twice a day (especially your tongue) and floss regularly to keep your mouth ready for kissing. Always wear deodorant. It’s especially important if you find you get nervous and sweat a lot around your crush."
    },
    {
      "title": "Try to minimize the physical distance between you.",
      "content": "Try to minimize the physical distance between you. This will signal that you’re hoping for a more intimate moment without being too obvious, enhancing the element of surprise. If you’re walking your crush to their door, for example, don’t trail far behind. Walk with them. If there are steps, you can even level a height difference between you by stopping a stair above or below where they do."
    },
    {
      "title": "Say something kind and unexpected.",
      "content": "Say something kind and unexpected. Now that you’ve created a moment of physical closeness, it’s time to bridge any emotional distance. Say something sweet and surprising to make them feel close to you. It’s important that you believe the thing you say here, as the emotion behind your sentiment will be obvious. [8] X Research source For example, making eye contact, you could say, “I felt really attracted to you today.”"
    },
    {
      "title": "Pause and look at their lips.",
      "content": "Pause and look at their lips. Don’t say anything after your sincere surprise comment. Simply draw out the moment. Shoot a brief glance at their lips, not longer than two seconds, and then make eye contact with them. [9] X Research source Try to keep your mouth gently parted, receptive to a kiss, during this look. If they look at your lips too, that is a great sign."
    },
    {
      "title": "Lean in for the kiss, gently pressing your lips against theirs.",
      "content": "Lean in for the kiss, gently pressing your lips against theirs. If your crush feels the same way, they will meet your kiss. If they turn away, don’t force them to kiss. Respect them and understand that they may not share your feelings. [10] X Research source If you’re feeling unsure about whether your crush will be receptive, lean in for the kiss very slowly. This gives your crush time to stop the kiss if they do not want it or realize that, however unexpected, you want to kiss them."
    }
  ]
}