{
  "url": "https://www.wikihow.com/Make-Roblox-Audio",
  "title": "How to Make Roblox Audio",
  "steps": [
    {
      "title": "Meet the minimum requirements.",
      "content": "Meet the minimum requirements. To create an audio, you need to have Robux , or a digital currency. This will cost real money to purchase."
    },
    {
      "title": "Download or create an audio of your own.",
      "content": "Download or create an audio of your own. Make sure you aren't infringing copyright laws."
    },
    {
      "title": "Open an audio software.",
      "content": "Open an audio software. You'll need to manipulate the audio a bit."
    },
    {
      "title": "Open the audio file, and then shorten it to the time you want it to be.",
      "content": "Open the audio file, and then shorten it to the time you want it to be. (7 minutes is maximum ROBLOX allows)"
    },
    {
      "title": "Make sure that the audio doesn't contain profane or offensive language, or else moderators will remove it.",
      "content": "Make sure that the audio doesn't contain profane or offensive language, or else moderators will remove it. Just remove the word by cutting out that particular area. You could fade it out or reverse it; it's completely up to you."
    },
    {
      "title": "Add some effects if you want to.",
      "content": "Add some effects if you want to. Like a fade in at the start, and at the end a fade out. It's up to you."
    },
    {
      "title": "Export it as an mp3.",
      "content": "Export it as an mp3. It's important that the file is correct. Make sure less that 7 minutes."
    },
    {
      "title": "Go to ROBLOX Home.",
      "content": "Go to ROBLOX Home . Login or make a Free Account. You are required to have an account to make an audio."
    },
    {
      "title": "Once logged in, go to Create tab.",
      "content": "Once logged in, go to Create tab."
    },
    {
      "title": "Click the Audio menu in the left side of the page.",
      "content": "Click the Audio menu in the left side of the page."
    },
    {
      "title": "Upload the Audio file.",
      "content": "Upload the Audio file. Click Choose File Button ."
    },
    {
      "title": "Choose the Audio File you created.",
      "content": "Choose the Audio File you created. When a Dialog box opened, search for the Audio File you created with Audacity Software and click \"Open\"."
    },
    {
      "title": "Now upload the file to ROBLOX:",
      "content": "Now upload the file to ROBLOX: remember that this will cost Robux! Get Robux to upload an audio."
    },
    {
      "title": "Insert a title.",
      "content": "Insert a title. Once it goes through, click on the audio and go to configure. Put the description. Consider putting the YouTube link, if you got it from YouTube. (i.e Music Video) Put tags, etc."
    },
    {
      "title": "Remember, if you want everyone to use the audio, put it for sale!",
      "content": "Remember, if you want everyone to use the audio, put it for sale! To do this, go to the configure tab on your audio. It should have two tabs; go to the sales tab and select \"Put on Sale\" and your audio is now visible to everyone!"
    }
  ]
}