{
  "url": "https://www.wikihow.com/Install-a-Car-Starter",
  "title": "How to Install a Car Starter",
  "steps": [
    {
      "title": "Disconnect the battery.",
      "content": "Disconnect the battery. Use an appropriate sized hand or socket wrench to loosen the nut that secures the cable on the negative terminal on the battery. You don’t need to remove the nut completely; once its loose simply slide the cable up and off the terminal. Tuck the cable to the side of the battery to ensure it won’t touch the terminal as you work. You will not need to remove the positive cable on the battery. Always disconnect the battery before servicing the electrical system in your vehicle."
    },
    {
      "title": "Jack up the vehicle if need be.",
      "content": "Jack up the vehicle if need be. In some applications, you may need to jack up the vehicle in order to access the starter. In such instances, place a jack beneath one of the designated jack points for the front of the vehicle and raise and lower or turn the handle in order to lift it off of the ground. Ensure you jack the vehicle up on firm, level ground. Place jack stands beneath the vehicle once it’s at the appropriate height."
    },
    {
      "title": "Locate the starter.",
      "content": "Locate the starter. The starter will have a wire running to it from the battery or fuse box, and looks like a large cylinder with a smaller one attached to it. If you are unable to locate the starter in your vehicle, refer to the service manual for your specific year, make and model vehicle for guidance. The smaller cylinder attached to the starter is the starter solenoid. A wire should run directly from the positive terminal on the battery or from the fuse box under the hood to the top terminal on the starter solenoid."
    },
    {
      "title": "Disconnect the wiring to the solenoid.",
      "content": "Disconnect the wiring to the solenoid. Depending on the application, there could be a few different types of connections transferring power from the electrical system of the vehicle to the starter. Use the appropriate hand tools to disconnect any connections going to the starter. In some cases, it may just be clips you need to disconnect for the wiring. On some starters, you will need to loosen bolts or screws that hold the wires in place."
    },
    {
      "title": "Remove the starter retaining bolts then the starter.",
      "content": "Remove the starter retaining bolts then the starter. Most starters have two retaining bolts that hold the starter in place against the side of the motor where it meets the transmission. Use a socket of the appropriate size to remove the bolts in order remove the starter. Be sure to use the correct size socket, otherwise you risk damaging the bolts. You may need to pull on the starter with a bit of force in order to remove it from the engine once the bolts have been removed."
    },
    {
      "title": "Compare the new starter to the old one.",
      "content": "Compare the new starter to the old one. Place the old starter side by side with the new one on a table and compare them for similarities and differences. The two should look nearly identical and the holes for the starter retainer bolts should be in the exact same place. The starter solenoid may have four terminals instead of two, but that won’t be an issue. If the two starters don’t look mostly identical, it may not be the correct starter for your vehicle. New starter solenoids often come with four terminals, but can be used with only two."
    },
    {
      "title": "Slide the starter into place.",
      "content": "Slide the starter into place. Insert the starter into the same mounting location you removed the old one from. Depending on the vehicle, you may need to do so from above or below the engine. Ask a friend to hold the starter in place if you can. You may need to snake the starter down and around other components of the engine to place it properly."
    },
    {
      "title": "Insert the starter retainer bolts.",
      "content": "Insert the starter retainer bolts. With the starter in place, slide the two retainer bolts through the bracket on the engine and the starter. Thread them in by turning them clockwise by hand until you’re sure they are threading properly, then use the appropriate socket and wrench to tighten them the rest of the way. If the bolt does not thread properly, unscrew it and try again. Make sure the bolts are tight so they can’t vibrate loose while the engine is running."
    },
    {
      "title": "Connect the wiring to the starter solenoid.",
      "content": "Connect the wiring to the starter solenoid. With the starter secured in place, reconnect the wiring you disconnected from the old starter onto the terminals on the new one. If your new solenoid has four terminals but your old one had two, only utilize the top and bottom terminal on the new solenoid. If your old one had four and the new one does as well, connect them to the same terminals they were connected to on the old one. Refer to the service manual for your specific vehicle if you are unsure as to which wire connects to which terminal."
    },
    {
      "title": "Reconnect the battery.",
      "content": "Reconnect the battery. With the starter installed and wired, reconnect the black cable to the negative terminal on the battery and tighten it in place. Insert the key into the ignition and attempt to start the vehicle. If the vehicle fails to start with the new starter in place, ensure the battery is fully charged. Check to ensure all of the wires are securely connected at either end, then start the vehicle again."
    },
    {
      "title": "Listen to the vehicle as you attempt to start it.",
      "content": "Listen to the vehicle as you attempt to start it. As you turn the key in the ignition, listen for the sounds the engine makes to help determine if you have an issue with your starter. If the engine makes no sound whatsoever, or you hear only a faint clicking, it may be because there isn’t enough power reaching the electric starter motor. [2] X Research source If the engine attempts to turnover but fails, it could be another issue. If the engine does nothing, the battery may just be dead."
    },
    {
      "title": "Ensure the battery terminals are clean and secure.",
      "content": "Ensure the battery terminals are clean and secure. Check the battery terminals to ensure there is a strong connection between the terminals and the cables. The cables should be securely held in place and should not be able to wiggle or be removed from the terminal without loosening the nut on each cable. Clean corroded battery terminals with a steel toothed brush to ensure a strong connection. [3] X Research source A weak connection from the battery can prevent the engine from starting. Wear gloves when cleaning battery terminals to avoid getting battery acid on your skin."
    },
    {
      "title": "Charge your vehicle’s battery.",
      "content": "Charge your vehicle’s battery. If you suspect the battery may simply be low on power, try charging it using either a trickle charger or another vehicle to jump start it . Be sure to connect the red cable to the positive terminal on each vehicle and the black to the negative. [4] X Research source Leave the other vehicle running when jump starting the vehicle and allow it to charge the battery in yours. If using a trickle charger, be sure to leave the battery charging in a safe area that won’t be rained on."
    },
    {
      "title": "Check to see the starter solenoid is bad.",
      "content": "Check to see the starter solenoid is bad. The starter solenoid transfers power from the battery to the electric motor that starts the engine. If it fails to transmit the electricity, the starter motor will fail to function. Test the starter solenoid by touching a test light to the lower terminal on the starter, then ground the negative cable to the body of the car. Have a friend turn the ignition key and see if it lights up. [5] X Research source If the test light does not light up, it means power is not reaching the starter motor due to a faulty solenoid or a dead battery. If the test light does light up, it means the solenoid is good, but the starter itself may have failed."
    }
  ]
}