{
  "url": "https://www.wikihow.com/Know-if-You-Have-a-STI",
  "title": "How to Know if You Have a STI",
  "steps": [
    {
      "title": "Look for any signs of atypical vaginal or penile discharge.",
      "content": "Look for any signs of atypical vaginal or penile discharge. Trichomoniasis, gonorrhea, and chlamydia all produce genital discharges. While vaginal discharge is typical and healthy, if you notice it taking on an atypical color or smell, it may be a sign of a bacterial STI. If you notice discharge from your penis at times when you are neither urinating nor ejaculating, this could be a sign of a bacterial STI. [1] X Research source Likewise, be concerned about any vaginal discharge that is green or yellow in color. STIs can also be signaled by vaginal discharge that is atypically white or thick. Pay attention to any foul-smelling or unusual vaginal odors. This may be a symptom of trichomoniasis. Other symptoms include difficulty urinating or pain during intercourse."
    },
    {
      "title": "Note any pain during intercourse, or general pelvic pain.",
      "content": "Note any pain during intercourse, or general pelvic pain. Bacterial STIs like chlamydia and trichomoniasis typically cause localized or general pain during the act of intercourse. Pelvic pain caused by an STI can include any type of discomfort in the pelvic or genital region, including pain during urination. [2] X Research source Men who are infected with an STI often experience testicular pain, even apart from sexual intercourse or ejaculation."
    },
    {
      "title": "Watch for any difficulty or pain while urinating.",
      "content": "Watch for any difficulty or pain while urinating. This may be accompanied by pelvic pain and fever in women or discharge and a burning sensation in men. These can be symptoms of chlamydia or another STI. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Pay attention to irregular vaginal bleeding.",
      "content": "Pay attention to irregular vaginal bleeding. If you notice bloody discharge during a time of the month when you’re not on your period, this could be a sign of an STI. Chlamydia and gonorrhea in particular can produce irregular bleeding. Bacterial infections can also produce an uncommonly heavy flow during your period. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Chlamydia is difficult to diagnose, however, since early infections produce few symptoms. Symptoms do not typically begin to show until as late as three weeks after infection."
    },
    {
      "title": "Watch for open sores on your genitals.",
      "content": "Watch for open sores on your genitals. Painful round lesions may be a sign of herpes, which may last for 2-3 weeks. A painless open sore, called a chancre, on the infected area (typically the genitals) may be a sign of syphilis or chancroid. These sores usually emerge between 10 and 90 days after infection. [5] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Other symptoms of Herpes include fevers, chills, general discomfort (called malaise), and extreme trouble with urination. If left untreated, symptoms of syphilis will worsen: multiple larger sores, fatigue, vomiting, and fever accompanied by a rash. Syphilis progresses along four stages of severity: primary, secondary, latent, and tertiary. The STI is relatively simple to treat in the primary or secondary stages. If you notice any signs of this STI, talk to your doctor and seek professional treatment. Symptoms of chancroid may include fever, chills, and general discomfort. Some people may also have discharge or difficulty urinating. Over time, the initial lesion may break and spread to multiple lesions."
    },
    {
      "title": "Inspect your genital region for small warts or sores.",
      "content": "Inspect your genital region for small warts or sores. Many viral STIs, including genital herpes, can produce little red bumps, blisters, warts, or even open lesions on or around your genitals. These warts or bumps are typically accompanied by a painful itching or burning sensation. [6] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source If you’ve recently had oral or anal intercourse and are concerned about an oral or anal STI, also inspect your lips and mouth, and your buttocks and anal area for warts or bumps. Herpes can stay dormant in your body for prolonged periods of time. Subsequent herpes outbreaks tend to be less painful than the initial outbreak. Infected individuals can have frequent outbreaks for decades. Although oral herpes can be contracted on the genitals (or in the genital region), it’s typically dormant after the initial outbreak."
    },
    {
      "title": "Look for fleshy bumps or blisters.",
      "content": "Look for fleshy bumps or blisters. Fleshy, raised patches of skin or warts in the genital or oral areas can be a sign of genital warts or Human papillomavirus (HPV). HPV is a serious STI, but can be difficult to detect. Certain strains are accompanied by gray swellings on the genitals, which can clump together and take on a cauliflower-like appearance. [7] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source Genital warts, while not a particularly serious STI, are uncomfortable and often itchy. Certain strains of HPV can increase a woman’s risk of developing cervical cancer. If you’re concerned about HPV, speak with your doctor or gynecologist about frequent screenings or gynecological visits to monitor the virus."
    },
    {
      "title": "Pay attention to persistent fever, fatigue, and nausea.",
      "content": "Pay attention to persistent fever, fatigue, and nausea. Although these are general, nonspecific symptoms, they can all be signs of two serious viral STIs: strains of hepatitis, or early HIV. Early HIV can also cause your lymph nodes to swell, and can produce a rash. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Individuals infected with hepatitis (which damages your liver) often also experience lower abdominal pain and dark urine. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Strains of hepatitis and HIV can be transmitted without sexual contact. Either disease can be transmitted by contact with infected blood (or other bodily fluids), or by sharing intravenous needles."
    },
    {
      "title": "Get tested for STIs.",
      "content": "Get tested for STIs. If you suspect that you have an STI, contact your general physician as soon as possible, and request an appointment to get tested for any sexual infections or diseases. Tests are inexpensive and easy, and do not require a referral or specialist consultation. [10] X Research source STI screening will typically include a urine analysis and culture, blood sample analysis, a pelvic exam, and a body tissue sample. [11] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source Do not put off getting tested. Many STIs are uncomfortable or painful. Also, putting off getting tested can increase your risk of contracting another STI, including HIV."
    },
    {
      "title": "Ask about treatment options.",
      "content": "Ask about treatment options. The majority of STIs are very treatable. Bacterial infections can be cured with antibacterial medications, commonly prescribed as pills or tablets, or administered via injection. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Parasite STIs, including scabies and public lice, are treated via a prescribed medicated shampoo. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Even for viral STIs that cannot be treated or cured (which includes both herpes and HIV) your doctor can prescribe medications which will alleviate painful symptoms."
    },
    {
      "title": "Ask your doctor about frequent STI screenings.",
      "content": "Ask your doctor about frequent STI screenings. If you’re sexually active, and especially if you’re not monogamous or change sexual partners with relative frequency, it’s important to get screened for STIs regularly. Some types of STI do not manifest notable symptoms, while the symptoms of other STIs can take weeks or even months to manifest. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source When speaking to your doctor, be explicit in asking for an STI screening. Don’t assume that your doctor will test you for STIs simply because they’re performing a PAP smear or drawing blood. In addition, always ask your partner to get tested for STIs before you engage in sexual activity. This will help prevent the spread of STIs. If you don’t have a regular health care provider, or are concerned about the cost of STI screening and treatment, visit a clinic like Planned Parenthood. Although sexual health clinics will vary by region and by country, they’re typically an affordable option for anyone needing a STI screening."
    }
  ]
}