{
  "url": "https://www.wikihow.com/Italicize",
  "title": "How to Italicize",
  "steps": [
    {
      "title": "Decide what portion of the text should be italicized.",
      "content": "Decide what portion of the text should be italicized. Most software applications let you choose which text you wish to italicize in one of two ways: Select existing text to be italicized. Place your cursor in front of the first letter in a block of text to be italicized. Hold down your left mouse button and drag your cursor over the block of text to highlight it, then release your mouse button. Italicize new text. Place your cursor at the location within the body of text where you want to type new, italicized text. In most cases, this will be at the end of the text."
    },
    {
      "title": "Use the appropriate control.",
      "content": "Use the appropriate control. Within a software application, you can italicize text using either the software’s graphic user interface or with a keystroke command. The applications in Microsoft Office and many similar applications feature either a toolbar or ribbon interface that includes a set of text formatting button controls. Among these controls is a button showing a capital “I” slanted to the right. This is the Italics button. Press the CTRL and I keys on your keyboard at the same time to enable italics in Windows. In MacOS, you can also enable italics by pressing the COMMAND (also called the “Open Apple”) and I keys on your keyboard at the same time. [1] X Research source"
    },
    {
      "title": "Italicize your text.",
      "content": "Italicize your text. Which way you use the software interface or keystroke commands depends on whether you are italicizing selected text or typing italicized text. To italicize selected text, either click the Italics button or use the appropriate italics keystroke command. The selected text will be italicized, and the highlighting around the text will disappear. To italicize as you type, either click the Italics button or use the appropriate italics keystroke command. Begin typing. As you type, your text will be displayed in italics. To turn off italics, click the Italics button or use the appropriate keystroke command again. Your text will no longer appear in italics."
    },
    {
      "title": "Place an italics tag in front of the text you wish to italicize.",
      "content": "Place an italics tag in front of the text you wish to italicize. The italics tag is an upper- or lowercase “I” bracketed by a less than (<) and a greater than (>) sign: <I> or <i>. You can place the tag in front of text you've already typed or type the tag and then type text you want to italicize."
    },
    {
      "title": "Place a close italics tag after the text you wish to italicize.",
      "content": "Place a close italics tag after the text you wish to italicize. The close italics tag looks like the italics tag, except that it has a forward slash between the less than sign and the “I”: </I> or </i>. If you do not place a close italics tag after the text you wish to italicize, all the text following the italics tag will be italicized. A number of websites allow you to enable HTML to support bolded, italicized, and underlined text. They may or may not support other HTML features, however. [2] X Research source"
    },
    {
      "title": "Write the text file using a text editor.",
      "content": "Write the text file using a text editor. LaTeX (pronounced “LAY-tech” or “LAH-tech”) is a typesetting application that converts text files into formatted documents. To use LaTeX, you must first create a document in a text editor program with instructions telling LaTeX what type of document you have and where the actual document text begins. These instructions are command that begin with the backslash (\\) character. Specify the type of document with the “\\documentclass” command, with the type of document specified in braces. For an article, the command would read “\\documentclass {article}”. (Do not include the quotation marks; they are used here to set off the example.) Specify where the text portion begins with the command “\\begin {document}”."
    },
    {
      "title": "Enclose the text to be italicized in braces ({}).",
      "content": "Enclose the text to be italicized in braces ({}). The braces indicate the starting and stopping places for formatting the text as specified by the formatting command. You can nest several formatting commands, such as having a large block of italicized text with a portion within it in boldface. If you do nest commands, be sure to use as many close braces as you do open braces to ensure that the text is formatted the way you want."
    },
    {
      "title": "Precede the text to be italicized with the “\\textit” command.",
      "content": "Precede the text to be italicized with the “\\textit” command. A sentence with the last word italicized would read as follows: “One of the first TV shows to realistically depict the routine of patrol officers was \\textit {Adam-12}.” [3] X Research source"
    },
    {
      "title": "Enclose the text to be italicized in pairs of single quotes.",
      "content": "Enclose the text to be italicized in pairs of single quotes. Two single quotes (apostrophes), placed in front of and behind the text to be italicized, signal Wikipedia’s text editor that the text between them should be displayed in italics. [4] X Research source You may type your text first and go back and place single quotes around the text, or type the first pair of single quotes, your text, and then the second pair of single quotes. Paired single quotes can be distinguished from double quotes by the greater amount of space between them. If your text editor has a “smart quotes” feature, you may need to turn it off for Wikipedia’s text editor to recognize the single quotes as formatting signals. If you have a hyperlink that includes italicized text, the italics flags must be outside the hyperlink bracket indicators if all the hyperlink text is to be italicized. If only part of the hyperlink text is to be italicized, you may place the italics flags around only the text to be italicized. [5] X Research source"
    },
    {
      "title": "Italicize words you want to give particular emphasis to.",
      "content": "Italicize words you want to give particular emphasis to. In simplest terms, this means that any word you would underline in a handwritten letter to emphasize, or would say more forcefully than others when speaking, you would italicize in a word processing document or on a website. For example, “I am the only living only child among my first cousins.”"
    },
    {
      "title": "Italicize foreign words that have not been fully adopted into English.",
      "content": "Italicize foreign words that have not been fully adopted into English. Foreign words and phrases used in English writing for effect are italicized, such as using the German Turnverein in place of the common American term “athletic club.” Foreign words that have become part of the English language through common usage, such as “kindergarten,” are not italicized. The Latin words for the genus and species of an organism are also italicized, as in Homo sapiens ."
    },
    {
      "title": "Italicize technical terms.",
      "content": "Italicize technical terms. This is normally done when the terms are first introduced, particularly if they have a meaning different from what the reader is used to. Physical constants, such as c for the speed of light, and variables in algebra, as in “ n = 2,” are also rendered in italics. [6] X Research source"
    },
    {
      "title": "Italicize block quotations.",
      "content": "Italicize block quotations. A block quotation is a lengthy quotation (typically 100 words or more, or at least 5 to 8 lines of text) set off from the rest of the text and indented. Block quotations are often rendered in italics, or in a different font or point size. [7] X Research source When an item in a block quote would be italicized, and the rest of the block quote is already in italics, the item is commonly rendered in normal text to set it off from the block quote. Large blocks of italicized text can be hard to read on some computer screens. In such cases, you may want to render block quotes in a different font than the surrounding text. [8] X Research source"
    },
    {
      "title": "Italicize the names of named major transportation vehicles.",
      "content": "Italicize the names of named major transportation vehicles. While you do not italicize the make, model, or military designation of a vehicle, vessel, or craft, you do italicize the following named vessels: Trains ( The Golden State Limited ), but not the names of individual cars. Ships, either military or passenger vessels ( USS Lexington , Queen Elizabeth II ). Aircraft names or nicknames not based on construction or performance characteristics ( Memphis Belle or Cutter’s Goose from the TV show Tales of the Gold Monkey , but not the Batplane). Spacecraft, either real or fictional (the Space Shuttle Challenger , the starship Enterprise , the Millennium Falcon ). Space missions, such as Apollo 11, are not italicized."
    },
    {
      "title": "Italicize the titles of certain major creative works.",
      "content": "Italicize the titles of certain major creative works. The following works have their titles rendered in italics, unless a particular style manual (such as AP or MLA) dictates otherwise: Books ( Harry Potter and the Sorcerer’s Stone ), except for the titles of religious books such as the Bible or the Koran. Titles of chapters, sections, and short stories within anthologies are enclosed in double quotes. Magazines ( Collier’s , Reader’s Digest ). Titles of articles (“I Am Joe’s Kidney”) are enclosed in double quotes. Newspapers ( USA Today , The Wall Street Journal ). Plays ( Romeo and Juliet , Who’s Afraid of Virginia Woolf? ). Court cases ( Brown v. Board of Education of Topeka ). Television and radio programs ( Star Trek , The Shadow ). Titles of episodes (“Amok Time,” “Temple Bells of Neban”) are enclosed in double quotes. Record albums ( Mandatory Fun , Red ). Titles of album tracks (“Word Crimes,” “I Knew You Were Trouble”) are enclosed in double quotes. Artwork ( Mona Lisa , The Last Supper ). Punctuation marks that are part of the title are italicized with the rest of the title. [9] X Research source"
    },
    {
      "title": "Italicize a character’s internal dialog.",
      "content": "Italicize a character’s internal dialog. In fiction, when a character’s thoughts are put into words for the sake of the reader, they are commonly rendered in italics, as in “Kate regarded her husband with apprehension. That’s funny, Joe never asks for a second cup of my coffee. ”"
    },
    {
      "title": "Italicize onomatopoeia (word sounds).",
      "content": "Italicize onomatopoeia (word sounds). If you’re attempting to render a sound with a word the way the reader would hear it, italicize the word: “The startled cat gave out an angry Meeeowwwrr! ” If you’re using a word to describe a general sound, you don’t italicize it: “The cat meowed.” [10] X Research source"
    }
  ]
}