{
  "url": "https://www.wikihow.com/Make-Rangoli",
  "title": "How to Make Rangoli",
  "steps": [
    {
      "title": "Choose the design you want to use.",
      "content": "Choose the design you want to use. Rangoli can be made in any number of designs, but whether you choose a simple or complex design, most are symmetrical. You can use a plant or animal for inspiration, or you can create your own geometric design. Depending on your skill level as an artist, you can choose small, basic geometric or floral designs, or venture into designing larger, more complex animals, gods, or goddesses (like the Hindu goddess Lakshmi, who is traditionally honored during Diwali). [1] X Research source Flowers such as the lotus are very popular for Rangoli. Some other traditional designs are fish, snakes, tridents, and the peacock - India’s national bird. You can also buy ready-made stencils to make the application even easier, or you can make your own. Stencils are easy to use and offer a variety of designs."
    },
    {
      "title": "Decide where to draw your Rangoli.",
      "content": "Decide where to draw your Rangoli. You can draw it on a flat, dry floor inside or outside of your home, or you can draw it on paper to display anywhere. The earliest Rangoli were created in small 2x2 patterns, but can now be any size, even covering entire floors. The size of your design can help determine where you should draw your Rangoli. [2] X Research source If you’re just starting out, it is best to create your Rangoli on black paper, since there is more room for error on an erasable surface. The bright colors of your design will stand out beautifully against the black background. If you go this route, glue the paper to a piece of cardboard to give it some backing and structure. If you decide to make your Rangoli on the floor, be sure to do it in a place that won’t disturb normal walking routes."
    },
    {
      "title": "Sketch the design outline on paper.",
      "content": "Sketch the design outline on paper. Use a pencil and eraser to practice drawing the outline of your Rangoli on black or white paper. Keep practicing until you are happy with your design. If you are creating the Rangoli on black paper, feel free to practice the design on the black paper you’re using for the finished piece. Just make sure to sketch lightly so you can easily erase any lines if needed."
    },
    {
      "title": "Draw your design outline in chalk on the floor.",
      "content": "Draw your design outline in chalk on the floor. If you are not making your Rangoli on black paper, you will need to draw a basic outline on the floor, or wherever you are creating your Rangoli. Draw the outline in thin, light chalk lines. Draw the chalk outline lightly just in case you need to erase any mistakes."
    },
    {
      "title": "Thicken the outline of your design with white chalk.",
      "content": "Thicken the outline of your design with white chalk. This is good for beginners, as the white chalk helps cleanly and clearly define the borders of the design. Experienced Rangoli artists can skip this step. If you’ve already drawn a thin outline on the ground, darken it with one more layer of chalk. Using white for the outline is traditional in India. White is a sign of peace and purity, and it will also make the finished Rangoli look brighter and more polished."
    },
    {
      "title": "Create an adhesive surface if you are using black paper.",
      "content": "Create an adhesive surface if you are using black paper. If you’re creating a Rangoli on black paper, you’ll need a surface that the textured materials can stick to. Add a small amount of any cooking oil to your entire design to help the materials stick. [3] X Research source Don’t douse the paper in cooking oil. Just apply a little oil to the tip of a finger and follow the chalk outlines of your design. Then, use the same method to apply a little more oil to the inside of your chalk outline."
    },
    {
      "title": "Give dimension to your outline with a white, textured material.",
      "content": "Give dimension to your outline with a white, textured material. It is customary to use natural substances like semolina, rice, or sand. To easily and cleanly pour the textured material onto your chalk outline, roll a piece of newspaper into a cone, snip a hole in the narrow end, and fill the hole with the material. Using your finger as a stopper with which to control the flow, follow the borders you’ve drawn to outline your design. Experts can add dimension by hand, rubbing the material between the thumb and forefingers and following the lines of the design. [4] X Research source"
    },
    {
      "title": "Choose the materials you will use to fill in your design.",
      "content": "Choose the materials you will use to fill in your design. Rangoli can be filled in with any number of colorful household materials like spices and grains, or with store-bought materials like pre-colored Rangoli powder. It is traditional to use colorful, natural items like turmeric, chilis, grains, and even pasta. You can also use natural materials found outside, like flower petals and dried leaves. [5] X Research source Another option is to use ground up chalk, or even colorful powders specifically designed for making Rangoli (often mixed with white powder for a better consistency)."
    },
    {
      "title": "Fill the inside of your Rangoli with your chosen materials.",
      "content": "Fill the inside of your Rangoli with your chosen materials. Use the paper cone or your fingers to completely fill your Rangoli with the chosen materials. This is the most interesting step, and usually the most fun. To fill in your Rangoli, you may utilize the same paper cone you used to add texture to your outline, or you can use the thumb and forefinger to manually add the materials. In Indian culture, it is important to completely fill in your Rangoli, leaving no open spaces."
    },
    {
      "title": "Mix different textures and colors in your design.",
      "content": "Mix different textures and colors in your design. Using a variety of colors and dimensions will enhance the artistic nature of the final design. The variety is what gives the Rangoli its wow factor. This is where you can get really creative with your Rangoli design. Mix and match different materials until your Rangoli is full and you are pleased with the colors in your design."
    },
    {
      "title": "Add the final touches.",
      "content": "Add the final touches. Place some candles and clay pot-lanterns around your finished Rangoli to light up your design. If you’ve created your Rangoli on black paper, move it outside or to the desired display area. Then you can surround it with any candles or final touches. Use chalk to write in a few wishes if you want to make your Rangoli extra special."
    }
  ]
}