{
  "url": "https://www.wikihow.com/Make-a-Packing-List",
  "title": "How to Make a Packing List",
  "steps": [
    {
      "title": "Make sure it's clear where you are going, how long you will be gone, what the weather will be like, and how you are getting there.",
      "content": "Make sure it's clear where you are going, how long you will be gone, what the weather will be like, and how you are getting there. If you don't know someone or more of these things, you may want to put this off for later."
    },
    {
      "title": "Get a piece of paper and a pen or pull up a blank document on your computer.",
      "content": "Get a piece of paper and a pen or pull up a blank document on your computer. It is best to write on a blank document because you can easily add/edit things, but with pen and paper, you can organize it easily. Write \"Packing List\" neatly on the front of it. If it is for your whole family, you may want to divide the page into equal sections for each family member."
    },
    {
      "title": "Decide if you want to use bullets or create a list for each item (Clothing List, Bathroom List, Entertainment List, etc).",
      "content": "Decide if you want to use bullets or create a list for each item (Clothing List, Bathroom List, Entertainment List, etc). If you are making lists, label the top of where each list will be."
    },
    {
      "title": "Start with clothing.",
      "content": "Start with clothing. If you are going to be gone for 1-7 nights, you may want to consider bringing 1 shirt, 1 pair of pants, 1 pair of underwear, 1 pair of socks, 1 pair of pajamas, and for women, 1 bra, for each night you are staying. If you are washing clothes, you can pack less. If your trip is longer, consider packing 1 outfit and 1 pair of pajamas for every 3-4 days, assuming you will be washing clothes. Remember bathing suits, cover-ups, extra pairs of shoes, scarves, coats, gloves, and other items to keep you comfortable."
    },
    {
      "title": "Move on to Bathroom Items.",
      "content": "Move on to Bathroom Items. If you are going to spend 1-7 nights somewhere, bring your shampoo and body wash, unless it's only one night (sleepover), then consider skipping a shower. Remember to bring toilet paper if you are spending over a week somewhere. For every 2 days, you will be gone, bring one roll of toilet paper, just in case where you are staying doesn't supply it. Don't forget razors, deodorant, hairbrushes, toothbrushes, hair straightener/curling iron, and for women, tampons/pads."
    },
    {
      "title": "Now, start writing down Entertainment items.",
      "content": "Now, start writing down Entertainment items. Books, magazines, MP3s, phones, and CDs all qualify as entertainment. For a quick 1 night's stay, you might only want to bring a magazine instead of two or three books, because you won't get around to reading them overnight. Remember, if where you are staying doesn't have a DVD player, don't make DVDs!"
    },
    {
      "title": "You also need to remember Sleeping items.",
      "content": "You also need to remember Sleeping items. Pillows, blankets, and sleeping bags all should be put down. If you are spending 1-7 nights somewhere, don't plan on washing your sheets. Take what you need for your bed (if it is on a bed or the floor) and maybe an extra sheet, just in case. If you are spending a long time somewhere, take two sets of sheets and rotate them every other week."
    },
    {
      "title": "Next, start writing down Cleaning items.",
      "content": "Next, start writing down Cleaning items. You'll need something to wash your clothes with for long stays. Check with where you are staying to see if they have cleaners, and if so, what kinds."
    },
    {
      "title": "Now, write down financial/identification items.",
      "content": "Now, write down financial/identification items. For most people, this should be your wallet or purse and a passport, if you're leaving the country. If you are just spending the night, you may want to take no money because you probably will not have to buy anything."
    },
    {
      "title": "Start writing down medications and other items for your health.",
      "content": "Start writing down medications and other items for your health. If you have any pills you have to take, write these down. Make sure to take bandages, vitamins, and pain relievers wherever you go, unless it's just a sleepover. Remember things like First-Aid kits, motion sickness remedies, and sleep medications."
    },
    {
      "title": "Now you can write down some 'gadgets' you need to take.",
      "content": "Now you can write down some 'gadgets' you need to take. MP3 and Cell Phone can go here or in the entertainment section. Remember a cell phone charger, camera, alarm clock (if you need to wake up at a certain time), laptop, and walkies-talkies if you need these items."
    },
    {
      "title": "If you are camping or spending time outdoors like on the beach or in swimming pools, add an Outdoor items section.",
      "content": "If you are camping or spending time outdoors like on the beach or in swimming pools, add an Outdoor items section. Sunscreen is a must for almost anywhere you go. Tents, sleeping bags, flotation items, beach towels, buckets, shovels, and things of such are good for spending time at the beach or camping. Remember insect repellant and flashlights for camping."
    },
    {
      "title": "This last section is only needed if you are traveling with the family or with young children.",
      "content": "This last section is only needed if you are traveling with the family or with young children. Wipes, diapers, baby powder, 'sippy cups', and strollers are good for young kids."
    },
    {
      "title": "Add any other items you need for your trip, like pens and pencils, notebooks, GPS (for traveling), or rags.",
      "content": "Add any other items you need for your trip, like pens and pencils, notebooks, GPS (for traveling), or rags."
    },
    {
      "title": "Go back and double-check your list.",
      "content": "Go back and double-check your list. Did you remember everything or did you put on some extra items? Cross off and add on what you need. Remember that if you are traveling far, you can buy some things when you get to your location."
    },
    {
      "title": "Have fun on your trip!",
      "content": "Have fun on your trip!"
    }
  ]
}