{
  "url": "https://www.wikihow.com/Make-Gift-Baskets",
  "title": "How to Create Presentable Gift Baskets Like a Pro",
  "steps": [
    {
      "title": "Decide on a theme.",
      "content": "Decide on a theme. Nearly all gift baskets have some type of theme, and choosing a theme makes it easier to plan the contents of the basket. Choose the theme of your gift basket before you do anything else. Sometimes, the theme is based on an occasion or set of circumstances. For example, you might plan a Christmas-themed basket around the holidays, a \"get well soon\" basket for someone who's ill, or a house-warming basket for couple who recently purchased their first home. Since these baskets are fairly generic, they tend to be easier to plan. Other times, you may determine the theme of the basket based on the receiver's personality or interests. For example, you might plan a spa basket for a workaholic who regularly needs to unwind, a romantic basket for your significant other, or a gardening basket for someone with a green thumb. Since these baskets are not dependent on outside circumstances, they tend to be more versatile."
    },
    {
      "title": "Make or buy the gift items.",
      "content": "Make or buy the gift items. You can include store-bought items, homemade items, or a combination of both in your gift basket. Make sure that the items you choose fit your chosen theme, though. For example, if you choose a food theme, you should only include edible items or related non-edible items in the basket. You shouldn't fill a basket with cheese, crackers, and wines, then throw in a random packet of flower seeds or bottle of scented lotion. To save money, consider shopping at dollar stores and other discount shops. [1] X Research source Gift baskets contain multiple items, and if you don't set a budget for yourself, you can easily overspend while creating them. Curious what to include in a basket for a house-warming? See what wikiHow users have to say at the \"What are some unique housewarming gift ideas that are affordable?\" forum post ."
    },
    {
      "title": "Choose an appropriate basket.",
      "content": "Choose an appropriate basket. While wicker baskets are the most common choice, you can pick from baskets made of different materials. The \"basket\" doesn't even have to be a basket—boxes, bags, and jars may also work, depending on the overall theme. Note that baskets can be made of wood, plastic, fabric, and metal. Wood baskets work well for traditional gifts, but they may not be durable enough for gift baskets given to children. For kids, choose a basket made of plastic or fabric. You can also use gift boxes, gift bags, muslin bags, canning jars, plastic buckets, and wooden crates instead of actual baskets. These may even work better for the theme of the basket. For example, a plastic beach bucket would be perfect for a child's beach-themed gift basket."
    },
    {
      "title": "Layer filler in the bottom of the basket.",
      "content": "Layer filler in the bottom of the basket. Regardless of the basket you choose, you should fill the bottom with crumpled paper or another type of filler before adding the gift items. This filler provides an even, decorative base. Crumpled tissue paper is one of the most common options, but shredded paper, shredded cellophane, and straw can also work well. If you're including any fabric items, consider folding and using the fabric as your filler."
    },
    {
      "title": "Arrange the gift items inside.",
      "content": "Arrange the gift items inside. Place the gift items inside the basket, resting them directly on top of the filler. Stuff additional filler in between the items to help hold them in place. Typically, you'll need to place the tallest gift in the center of the basket. Arrange the other items from tallest to shortest around it, turning them so that they face the outer perimeter. Try to keep the basket looking balanced from all sides. On the other hand, you could arrange the smallest items near the front of the basket, then place the taller items further toward the back. In this case, all items should face the front of the basket. Regardless of how you position the items, make sure that the basket and individual items can remain upright when left alone."
    },
    {
      "title": "Wrap the entire basket.",
      "content": "Wrap the entire basket. Wrapping the basket can secure the individual gift items while also protecting them from moisture or damage. Cellophane, shrink wrap, and tulle are among the most common wrapping options. Cellophane comes in sheets, which must be gathered around the basket from the bottom up, and bags, which hold the entire basket without being gathered. Either way, tie the opening closed with a ribbon. Shrink wraps and shrink bags are placed over the basket from the top to the bottom. Gather the excess beneath the basket, then use a hair dryer or heat gun to shrink the entire wrap from the bottom up. No ribbons are needed. Use tulle only if you don't need to protect the gift items from moisture. Gather the tulle netting around the basket from the bottom up, and tie the opening closed with ribbon. Cheesecloth and twine can also be used in a similar manner."
    },
    {
      "title": "Attach an enclosure card, if desired.",
      "content": "Attach an enclosure card, if desired. You can include a full-size greeting card or choose to omit the card altogether, but gift baskets are commonly accompanied by a 3.5-inch by 2-inch (9-cm by 5-cm) card. You can use themed enclosure cards, blank miniature note cards, card stock, or heavy-duty scrapbook paper. [2] X Research source Include the \"to\" and \"from\" information on the card, as well as a brief message about the occasion or the contents of the basket. Tie the card to the ribbon or tape it to the outer wrappings. If desired, you can also slip it inside the basket itself before wrapping it up."
    },
    {
      "title": "Consider using a toy for the basket.",
      "content": "Consider using a toy for the basket. To maximize the fun of this gift basket, choose a large bucket-like toy instead of using an actual basket. Options worth considering may include wagons, large dump truck toys, plastic beach buckets, plastic treasure chests, or baby doll carriages/strollers. If this isn't an option, try to stick with child-friendly basket options or those marketed toward kids. Brightly decorated plastic baskets, plush animal-shaped baskets, and aluminum buckets decorated with children's characters are common."
    },
    {
      "title": "Think about the receiver's age and personal interests.",
      "content": "Think about the receiver's age and personal interests. These should determine the types of toys you fill the basket with. Make sure that the individual items are safe and appropriately matched to the child's age level, and gear the toys toward the specific child's interests as much as possible. For example, learning toys and toys without small parts are more appropriate for toddlers and other young children. While these toys are safe for all ages, though, they probably wouldn't appeal to an older kid. Try not to assume that the traditional “boy toys” and “girl toys” will appeal to the child in question unless you already know they will. Some boys aren't interested in action figures or toy cars, and some girls may not find dolls or play tea sets particularly enthralling. If you aren't sure about the child's interests, it's best to ask someone who knows him or her before choosing the gift items."
    },
    {
      "title": "Pick one feature toy.",
      "content": "Pick one feature toy. Gift baskets should present the receiver with multiple treasures, but choosing one toy to stand as the focal point of the gift can make the overall basket appear more eye-catching and appealing to a child. For example, the feature toy in a gift basket for toddlers might be an electronic alphabet toy. For an older child, it might be a popular board game (or video game, if you have a larger budget). You might be able to skip the feature toy if the basket itself is a great toy itself. For instance, if you use a wagon as the basket and the child is still young enough to ride around in it, you might consider counting the wagon as both the basket and feature toy."
    },
    {
      "title": "Surround the main toy with smaller trinkets.",
      "content": "Surround the main toy with smaller trinkets. [3] X Research source Regardless of what you choose as the feature toy, you should only pick one. Avoid overloading the entire basket with expensive or elaborate toys, and instead, surround the feature toy with smaller gifts that accentuate it without competing for excitement. Examples for toddlers and young children may include balls, toddler-safe plush toys, and toddler-safe cars. For older children, these toys could include small puzzles, yo-yos, action figures, and dolls. Limit “practical” gift items. It might be tempting to throw in a few gifts for the parents—e.g., clothes or school supplies—but if you include too many of these in the basket, the child might lose interest in it. Limit the amount of practical items to one or two per basket, and try to make them appealing to the child by choosing fun or cool designs."
    },
    {
      "title": "Choose a rustic basket option.",
      "content": "Choose a rustic basket option. Food-themed gift baskets are among the most common, and the traditional wicker basket is an appropriate fit in many cases. If you want to vary from this, however, try to stick baskets or containers that have a comforting, cozy ambiance. For example, you could stack wine and cheese items on a cheeseboard, place gourmet coffees and teas in a burlap gift sack, or arrange fruits and wines in a wooden crate."
    },
    {
      "title": "Narrow down the theme further.",
      "content": "Narrow down the theme further. Knowing that you want to treat the recipient to a basket of delicious food is a good starting point, but “food” is too general to stand as a solid theme. Try to pick a specific type of food or common food pairing and work from there. Popular examples can include: Wine and cheese baskets, containing one or two bottles of wine and several blocks of cheese to accompany the wine; Gourmet tea or coffee baskets, accented with tea biscuits or coffee cake; Chocolate baskets, containing chocolate goodies in multiple forms; Fruit and nut baskets, offering several types of fresh fruit and cans of salted or flavored nuts. Think of the receiver's favorite foods. If the receiver loves chocolate, then some type of chocolate theme is probably a good way to go. On the other hand, that same basket would be a bad choice for someone who lacks a sweet tooth. Consider the time of year. Certain seasons and holidays are associated with different types of food, and you could build a theme around that. For example, autumn is associated with pumpkin, apples, cinnamon, and caramels; winter calls to mind hot chocolate and mint."
    },
    {
      "title": "Use a combination of fresh foods, ready-mixes, and commercially prepared foods.",
      "content": "Use a combination of fresh foods, ready-mixes, and commercially prepared foods. [4] X Research source The exact combination will depend on the theme you choose and your own talents in the kitchen, as well as the amount of time you'll need to wait before delivering the basket. If you plan to present the basket later that same day or the following day, you can probably include more fresh foods like fruits, cheeses, and homemade baked goods. These won't work if you're making the basket a week in advance, though. Opt for preserved foods, commercially prepared foods, or ready-mixes if you need to save the basket for more than a few days. Ready-mixes also work well for recipients who enjoy spending time cooking in the kitchen."
    },
    {
      "title": "Use a metal or plastic basket.",
      "content": "Use a metal or plastic basket. Spa baskets need to have a “clean” appearance, and the use of a metal or plastic basket can accomplish that more effectively than a traditional wicker or wooden basket. Metal and plastic won't absorb moisture, so the recipient should be able to carry the entire packed basket into the bathroom without worry. If you aren't sure where to get a metal or plastic basket, try looking in a home goods store for a shower caddy. Choose one with very few compartments, though, since it can be difficult to fill if there are too many small sections."
    },
    {
      "title": "Add luxurious skin and hair care products.",
      "content": "Add luxurious skin and hair care products. [5] X Research source The recipient should have everything he or she needs to enjoy a relaxing “spa day” at home. As such, you should include a variety of both common and uncommon bath products. Common bath products include anything that most people regularly stock in their bathrooms: shampoo, conditioner, body wash, body lotion, and face wash. Uncommon, luxurious bath products include things that most people may only treat themselves to on rare occasions: bubble bath, effervescent bath tablets, exfoliating body scrubs, and body spray. You can also transform common bath products into luxurious items by splurging and purchasing higher quality versions, homemade products, or organic products. Pick a scent. The products don't need to smell the exact same, but they should all fit within a similar scent family so that the recipient can use all of the products during a single “spa day.” Choose the recipient's favorite fragrance, if you know it, or opt for something that popular like rose, lavender, or vanilla."
    },
    {
      "title": "Provide related products to enhance the experience.",
      "content": "Provide related products to enhance the experience. Think of ways to enhance the “spa day” experience beyond the bathtub, and consider accenting the basket with a few other small items to that effect. For instance, scented candles can create a warm, cozy, and romantic ambiance for the recipient during a bath. Similarly, a small nail care set can help the recipient groom herself or himself further, enhancing the recipient's “spa day” glow even more. Avoid including edible accompaniments, though. Many soaps or effervescent tablets can look like food, and you don't want the recipient to accidentally toss the chocolates into the bath water while biting down on the chocolate-shaped soap."
    }
  ]
}