{
  "url": "https://www.wikihow.com/Make-a-Beyblade-Stadium",
  "title": "How to Make a Beyblade Stadium",
  "steps": [
    {
      "title": "Use a plastic plate or frisbee as a simple playing surface.",
      "content": "Use a plastic plate or frisbee as a simple playing surface. A good Beyblade stadium needs a smooth playing surface with an even, convex center. While there is no official size for a Beyblade stadium, most stadiums are roughly 12–24 inches (30–61 cm) in diameter. Use a round, plastic plate or flip a large frisbee over to use it as a simple playing surface. [1] X Research source Most Beyblade stadiums are round, but you can use a square-shaped playing surface as long as it angles down towards the center. Frisbees make for great playing surfaces because they have built-in rails around the edges. They will also wobble a little, even after adding walls, which will add another layer of complexity to your Beyblade games. Do not use a ceramic or glass plate. Beyblades spin on a thin point, and the pressure and friction from a spinning Beyblade could shatter the glass or ceramic."
    },
    {
      "title": "Use a frying pan or wok for a heavier material.",
      "content": "Use a frying pan or wok for a heavier material. If you want a heftier playing surface, use a frying pan or metal wok. Clean a pan out with warm water and dish soap, and then inspect the surface for dents or debris. The steeper the angle in the middle of your pot or wok, the faster your Beyblade games will end, so choose a pot or wok with a decline that you’re comfortable with. [2] X Research source If you use a pan with a handle, you can use the handle as a center-court indicator in your games. This will make it easy to tell where each player has to start spinning their Beyblades."
    },
    {
      "title": "Line a stiff box with construction paper to build your own surface.",
      "content": "Line a stiff box with construction paper to build your own surface. Take a flat cardboard box and line the interior with white glue. Take a large piece of construction or wrapping paper and lay it over the glue while pressing down with the bottom of your palms to remove air bubbles. Smooth it out with your hand to make a paper playing surface. [3] X Research source You will need to replace the paper playing surface periodically if it rips. Use different colors every time that you replace the playing surface to change the way it looks! You can trim the edges with scissors to your desired length or fold them over the side. The boxes for chess sets, board games, and items of clothing work best."
    },
    {
      "title": "Glue stones or pebbles to the boundaries for a rustic look.",
      "content": "Glue stones or pebbles to the boundaries for a rustic look. Collect or buy a bunch of small stones and pebbles. Wash them off and let them air dry for 2-3 hours before using a strong construction adhesive to cover the rim of your playing surface. Place your stones and pebbles around the edge and press them down firmly to set them in place. [4] X Research source Stones or pebbles will make for an uneven wall which will cause Beyblades to bounce off of them at crazy angles. Use stones or pebbles if you want to make your games more random."
    },
    {
      "title": "Fold thin cardboard around the sides and tape it for a more flexible barrier.",
      "content": "Fold thin cardboard around the sides and tape it for a more flexible barrier. Take a sheet of cardboard and cut it into a rectangular strip that is 2–4 in (5.1–10.2 cm) wide, with the length as long as the circumference of your playing surface. Wrap your cardboard around the playing surface and affix it to the edge of your playing surface by running tape around the outside to hold the shape. Add heavy-duty glue to the interior edge to keep the cardboard in place. [5] X Research source You can also stretch a long rubber band around the outside of the cardboard to keep it in place. Cardboard will absorb a lot of the momentum from a Beyblade that is spinning out of control. Use cardboard walls if you want your games to last a little longer."
    },
    {
      "title": "Place your playing surface in an open box for a simple set of walls.",
      "content": "Place your playing surface in an open box for a simple set of walls. Find a box that fits your playing surface and place your playing surface in the middle to make a simple stadium. If you’re using a plate, you can use the same cardboard box that the item came in. Use scissors to remove the folds at the top or glue them to the sides. [6] X Research source A small pizza box has walls that are the perfect size for a Beyblade tournament since they won’t block the view of spectators. Beyblades are bulky and stick out in the middle, so if they’re heading past the edge of your playing surface, the box will block it from falling off of the side."
    },
    {
      "title": "Place obstacles in your stadium to give it a theme.",
      "content": "Place obstacles in your stadium to give it a theme. You can create a jagged ice environment by putting crumpled pieces of paper all around the playing surface to simulate snow, or you can put erasers and small pencils around the edges to create a school-themed stadium. Beyblade obstacles are infinitely customizable, so look around your home to see what kind of crazy obstacles you can add to your stadium to make games more interesting! [7] X Research source If you’re using an easy-to-clean playing surface like a plate, pan, or frisbee, you can add water to the center to create a splash when you battle. Make sure that you do this outside to avoid making a mess. Obstacles will make for interesting gameplay since they will divert and change the path of battling Beyblades."
    },
    {
      "title": "Add the lines for the court by painting them with a stencil.",
      "content": "Add the lines for the court by painting them with a stencil. Use painter’s tape to section off the center court and lines. Place 2 pieces of painter’s tape flat across the center of your court with 1 inch (2.5 cm) of space open in the middle. Apply a thin layer of acrylic paint with a small brush to the opening in the middle. Wait 30-45 minutes for the paint to dry and then remove the tape. [8] X Research source Paint a perpendicular line using the same method and the same color of paint. You can use a plastic bag to cover the sections you want to keep clean and paint the lines with spray paint if you’d like. Some Beyblade stadiums have a small circle in the middle to mark where the center of the court is. You can glue a small circle in the center or paint it by hand if you want an indicator for center court. Many Beyblade tournaments use the lines on a playing surface to limit players to a section of the court where they can release their Beyblade at the beginning of a game."
    },
    {
      "title": "Place magnets in the center or under your surface for an added twist.",
      "content": "Place magnets in the center or under your surface for an added twist. Beyblades often use magnets underneath the top disk to stabilize it as it moves and attract it to other Beyblades. Place magnets near the center of your playing surface or tape them underneath to add some variety to your Beyblade games. [9] X Research source You can purchase small magnets from any big box store. Play around with different configurations until you find a magnetic pattern that makes for interesting gameplay."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}