{
  "url": "https://www.wikihow.com/Make-Your-Hair-Soft-and-Silky",
  "title": "How to Make Your Hair Soft and Silky",
  "steps": [
    {
      "title": "Make a mask with avocados and banana.",
      "content": "Make a mask with avocados and banana. Avocados and banana may also help to give you soft, silky hair. Mash one avocado and one banana together to form a paste. Massage the paste into your hair, making sure to cover all of your strands. Allow the mask to set for an hour, and then rinse out. [1] X Research source The combination of avocado and banana may also help to reduce the appearance of split ends and add elasticity to your locks."
    },
    {
      "title": "Apply avocados and egg yolks.",
      "content": "Apply avocados and egg yolks. You can also mix an avocado with an egg yolk for a hair softening mask. Mix the avocado and egg yolk together in a bowl until they form a paste. Then apply the mixture to your hair and leave it on for about 30 minutes. Then, rinse the mixture out of your hair with lukewarm water. You may also want to shampoo your hair to remove all traces of the egg yolks."
    },
    {
      "title": "Prepare a mayonnaise mask.",
      "content": "Prepare a mayonnaise mask. Mayonnaise is made of emulsified egg yolks and oil, which can provide your hair with oils to make it soft and shiny. Completely coat your hair in mayonnaise and leave it on for about 30 minutes. Once the mayo has soaked into your hair, rinse it out with warm water followed by a regular wash of shampoo and conditioner. [2] X Research source Use full-fat mayonnaise for the best results. Do not use mayonnaise if you are allergic to eggs."
    },
    {
      "title": "Give yourself a gelatin mask.",
      "content": "Give yourself a gelatin mask. Gelatin can also help to make your hair soft and silky. To restore protein to your hair, mix one tablespoon of unflavored gelatin and one tablespoon of warm water. Then apply the mixture to your hair. Leave the mixture on your hair for about 10 minutes, and then rinse it out. [3] X Research source Follow this treatment up by shampooing and conditioning your hair."
    },
    {
      "title": "Use aloe vera as a hair mask.",
      "content": "Use aloe vera as a hair mask. Aloe vera gel may also help to make your hair soft and silky.You can use aloe that you get directly from a plant or purchase a bottle of 100% aloe vera gel. Apply the gel to your hair, massaging it in around the roots and working towards the tips. Use enough aloe to coat your hair from root to tip. Let the aloe gel sit on your hair for about 30 minutes, and then rinse it out. [4] X Research source Follow up this treatment with a regular hair wash using shampoo and conditioner."
    },
    {
      "title": "Try an applesauce mask.",
      "content": "Try an applesauce mask. Get a cup of applesauce or make your own applesauce by boiling a couple of apples (core and peel removed) in water until they are soften and then draining the water and mashing them. If you make your own applesauce, then make sure that you let it cool down to room temperature before you apply it to your hair. Then, apply the applesauce to your hair from the roots to the tips. Leave it for 30 minutes and then rinse it out. [5] X Research source Finish the treatment by shampooing and conditioning your hair."
    },
    {
      "title": "Make an egg yolk mask.",
      "content": "Make an egg yolk mask. Combine three egg yolks with one tablespoon of olive oil and one tablespoon of honey. Beat the ingredients together until they are well combined. Then, apply the mixture to all of your hair. Let this sit on your hair under a shower cap for 30 minutes. Then, rinse your hair and use shampoo and conditioner to completely remove all traces of the egg. Shower with warm but not too hot water as it may cook the egg yolks in your hair making it difficult to remove. If you do not like the smell or mess of raw eggs, you can also buy a ready egg oil. This also eliminates the risk of salmonella infection or allergy coming from raw eggs. [6] X Research source"
    },
    {
      "title": "Do a hot oil treatment.",
      "content": "Do a hot oil treatment. Heat four tablespoons of coconut, olive, almond, or castor oil in a pan until it is slightly warm to the touch, but not hot. Pour this warmed oil into your hair, and use your fingers to massage it into your roots and scalp. When all of your strands have been coated with the warm oil, put a shower cap over your hair and then wrap the outside of the shower cap with a hot towel. The heat from the oil and the towel will open the pores in your scalp, allowing the oil to soak in and soften your hair. After about 10 minutes, rinse out the oil and wash your hair as usual."
    },
    {
      "title": "Soak your hair in oil at night.",
      "content": "Soak your hair in oil at night. Before you go to bed at night, cover your hair with olive oil or egg oil. Massage the oil into the roots of your hair all the way to the ends and then cover it with a shower cap. You can also wrap a towel or bandana around your head to help keep the shower cap in place. Sleep with your hair wrapped, and then rinse the oil out in the morning. [7] X Research source Follow up by shampooing and conditioning your hair as usual."
    },
    {
      "title": "Rinse your hair with beer.",
      "content": "Rinse your hair with beer. Rinsing your hair with beer may help to make it silky and soft. Try pouring a flat beer over your hair after you have finished washing it. Leave it on your hair for about five minutes and then rinse it out with cool water. Another alternative is to pour some beer into a spray bottle, and spritz it into your hair after you wash your hair. Then leave it in like a leave-in conditioner."
    },
    {
      "title": "Rinse your hair with apple cider vinegar.",
      "content": "Rinse your hair with apple cider vinegar. Apple cider vinegar can also help to make your hair soft and silky. Combine ½ a cup of apple cider vinegar with one cup of warm water. Spritz or pour the apple cider vinegar onto into your hair after you wash it and allow it to sit for about 10 minutes. Then, rinse the apple cider vinegar out of your hair with cool water. [8] X Research source This treatment may also be helpful if you have dandruff or an itchy scalp."
    },
    {
      "title": "Skip a day when you wash your hair.",
      "content": "Skip a day when you wash your hair. Hair follicles produce natural oils that add shine and softness to your hair. Washing your hair repeatedly with harsh chemicals (such as those present in most shampoos) removes these oils. While these oils can build up and become greasy in appearance over time, washing your hair every day can also strip away the healthy oils. Try skipping a day or two between washes to help improve the look and feel of your hair. If your hair is very fine or if you sweat a lot, then you should wash your hair every day. Use dry shampoo between washes to keep your hair looking fresh and clean. People with fine and thin hair should wash their hair every other day while people with coarse or curly hair may only need to wash their hair once or twice a week."
    },
    {
      "title": "Leave some conditioner in your hair.",
      "content": "Leave some conditioner in your hair. Conditioner can give you soft silky hair, so it is a good idea to leave a little on your strands. When you condition your hair, don’t rinse it for too long. Try to rinse your hair until most of the conditioner is out, but your hair still feels slick. This will help to ensure that your hair stays soft and silky all day. [9] X Research source You may also want to wring the excess water out of your hair before you apply conditioner. This will help to ensure that your hair soaks up as much conditioner as possible. For fine or thin hair, only apply conditioner to your strands. Do not apply it to your roots."
    },
    {
      "title": "Use styling products with humectants.",
      "content": "Use styling products with humectants. Humectants are special ingredients that absorb moisture into your hair from the air and environment around you. Read the ingredients label of your hair styling products, and choose products that contain ingredients such as: Glycerin Propylene glycol Butylene Glycol Dipropylene glycol Hexanediol [10] X Research source Honey Agave nectar"
    },
    {
      "title": "Stay away from heat products.",
      "content": "Stay away from heat products. Using blow dryers, flat irons, and curling irons can dry out your hair and create split ends. [11] X Research source This dry, fragile, and broken hair will be difficult to smooth and appear dead and dull. Try using heating tools as little as possible, or avoid them altogether. Always let your hair air dry after you wash it. If you must use a blower, flat iron, or curling iron, apply a leave-in conditioner or spray in a heat protectant first. This will help to protect your hair as you style it. Occasional use of heat products can make your hair feel soft and look great, but repeated use will damage the hair."
    },
    {
      "title": "Trim off split ends.",
      "content": "Trim off split ends. If you do not trim your hair for a long time, then split ends can develop. Split ends can make your hair look damaged and dry. Take time at least once every three to four months to get a hair trim to help prevent split ends and keep your hair looking healthy. [12] X Research source"
    }
  ]
}