{
  "url": "https://www.wikihow.com/I%27m-Being-Blackmailed-on-Snapchat",
  "title": "What to Do If You're Being Blackmailed on Snapchat",
  "steps": [
    {
      "title": "Do not engage with the blackmailer.",
      "content": "Do not engage with the blackmailer. Your first instinct may be to plead or bargain with the blackmailer, maybe even give in to their demands. However, doing so could make the situation worse. Their goal is to manipulate and control you. Cutting off communication with them limits their ability to gather information about you and try to control you. If you give in to their demands, there is no guarantee they will do what they say. It may embolden them to demand more. If you have already paid the blackmailer, contact your financial institution to see if they can help. You may be able to cancel or reverse the transaction. Most payment services, such as Paypal, Cash App, Venmo, etc have methods for canceling a transaction. [1] X Research source"
    },
    {
      "title": "Document all evidence and communication.",
      "content": "Document all evidence and communication. While you may tempted to block them and delete all previous messages, you'll want to document all communication with them first. Take screenshots of all messages they send you. If you sent them any private information or intimate photos, document that as well. If you have made any financial transactions with them, document it. Write down their username. All of this will help when filling out a report."
    },
    {
      "title": "Tighten the privacy settings on all your social media accounts.",
      "content": "Tighten the privacy settings on all your social media accounts. This will help prevent you from getting hacked. Go through the privacy settings on all your social media accounts and make sure they are locked down. Set them so that only friends can contact you. Make sure you have 2-factor authentication enabled and that you are using a separate and strong password for each of your accounts. Use the following steps to set your Snapchat account to friends only : [2] X Research source Open Snapchat on your mobile device. Tap your profile icon. Tap the Gear/Settings icon in the upper-right corner. Tap Two Factor Authentication and follow the prompts to set it up. Scroll down to \"Privacy Control.\" Scroll down and tap Contact Me and set it to \"Friends.\" Tap View My Story and set it to \"Friends Only.\" Tap Activity Indicator and turn it off. Tap See My Location and set it to Ghost mode."
    },
    {
      "title": "Report the blackmailer to Snapchat.",
      "content": "Report the blackmailer to Snapchat. Once you have documented all the evidence, report the user to Snapchat. To report someone on Snapchat, open the Chats screen and tap and hold their username. Tap Manage friendship . Tap Report . Select the reason that best fits the situation and fill out the report."
    },
    {
      "title": "Block the user.",
      "content": "Block the user. Once you have all the evidence you need, go ahead and block the user . To do so, tap and hold their username on the Chats menu. Tap Manage friendship and then tap Block ."
    },
    {
      "title": "Confide in a trusted friend or family member.",
      "content": "Confide in a trusted friend or family member. Dealing with online blackmail can be very stressful. It helps to have a support group. Confide in a trusted friend or family member."
    },
    {
      "title": "File a police report.",
      "content": "File a police report. Contact your local law enforcement and file a report. Bring all the evidence you've gathered. Provide as much information as possible. It's also recommended that you report the crime to the FBI ."
    },
    {
      "title": "Contact a cyber security expert, if necessary.",
      "content": "Contact a cyber security expert, if necessary. In addition to contacting the police, you may want to contact an expert who specializes in online exploitation. This may be an advocacy group, support group, or a lawyer who specializes in online blackmail. They may be able to provide you with resources to help you get through this as well as help you take legal action, if need be. Some resources you can checkout include the following. Cyber Civil Rights Initiative Without My Consent Thorn.org"
    },
    {
      "title": "Catfishing.",
      "content": "Catfishing. Catfishing is when someone creates a fake account and pretends to be someone they are not. They will try and trick their victims into revealing private information or intimate photos by pretending to be someone else. Then they will use that information to extort them."
    },
    {
      "title": "Grooming.",
      "content": "Grooming. Grooming is when a predator tries to earn a potential victim's trust over time. They may target individuals who are younger and more naive who may not understand what information they should and should not share online. They will use that information to blackmail their victim."
    },
    {
      "title": "Hacking.",
      "content": "Hacking. Hacking is when someone gains unauthorized access to your private accounts and data. If you have weak passwords, they may try to steal them, or they gain access through malware, spyware, and keyloggers. They will use the information they find to extort their victims."
    },
    {
      "title": "Phishing.",
      "content": "Phishing. Phishing is a form of hacking where a hacker will set up a fake log-in site. It will look like an official log-in page for a bank, social media platform, or other site. They will message you claiming to be from a bank or company that you have an account with and tell you they need you to log in to fix a problem. When you try to log in, they will steal your password and use that to steal your personal data."
    },
    {
      "title": "Tighten your online privacy settings.",
      "content": "Tighten your online privacy settings. Make sure you set all your social media accounts to private or friends only. Use strong passwords for all your social media accounts and make sure you have 2-factor authentication enabled on all your accounts."
    },
    {
      "title": "Only accept friend requests or messages from familiar people.",
      "content": "Only accept friend requests or messages from familiar people. You should only accept friend requests from people you know. Be extra careful when responding to DMs from people you don't know."
    },
    {
      "title": "Do a background check for people you meet online.",
      "content": "Do a background check for people you meet online. Especially if you are considering a relationship with this person. Google their name and check their online presence. Check their social media posts and make sure they are who they say they are. Reverse image search their profile picture to make sure it actually belongs to them."
    },
    {
      "title": "Be careful what information you share.",
      "content": "Be careful what information you share. Always be careful what you share online. Make sure you do not reveal any personal information online. This could be your address, where you work, where you go to school, your routine, who you associate with, as well as any intimate photos. You may also want to disable Location Services on your phone when you are not using it to keep from revealing your location."
    },
    {
      "title": "Be wary if things are moving too fast.",
      "content": "Be wary if things are moving too fast. Blackmailers may try to start a relationship with you and try to push the relationship to move more quickly. They may do this through love-bombing and flattery. Once they think they have your trust, they will pressure you into revealing personal information or private photos. They will often create a sense of urgency to get you to do what they want."
    },
    {
      "title": "Be wary of demands for secrecy.",
      "content": "Be wary of demands for secrecy. Anyone who tells you not to talk about a situation or wants to keep a conversation confidential is a huge red flag. Especially if you barely know the person. If this person is resistant to answering questions about themselves, that's even more of a red flag."
    },
    {
      "title": "Learn how to spot phishing scams.",
      "content": "Learn how to spot phishing scams. Phishing is when someone tries to trick you into revealing your login information by creating a fake login website. Whenever someone sends you a text or an email claiming to be from a bank, social media platform, or something else that requires a login, check the URL before logging in. Make sure it is the official website. Official sources will never ask for your password. If the message says there is a problem with your account that requires a login, log in using the official app or website instead of the email or text message link."
    }
  ]
}