{
  "url": "https://www.wikihow.com/Make-Friends-in-School",
  "title": "How to Make Friends in School",
  "steps": [
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. If you're shy, it can be hard to meet others' eyes. But doing this can make the difference in others gravitating toward you to make conversation, or being put off by your energy. The correct ratio of eye contact depends on the person, the context, and any cultural factors. Still, maintaining eye contact between 30 and 60% of the time during conversation is preferable. Typically, you must hold eye contact more when you are listening than when speaking. [1] X Research source"
    },
    {
      "title": "Smile.",
      "content": "Smile. Smiling doesn't just feel good to us. Sure, a smile can combat stress and relieve pain, but others are more attracted to you when you do it. Smiles are also contagious; so, you're more likely to get one in return when you give one. [2] X Research source"
    },
    {
      "title": "Be a good listener.",
      "content": "Be a good listener. Improving your listening skills can significantly influence how great a friend you can be. Showing that you are willing to share the talking time makes the other person feel respected and valued. Here are just a few of the habits of good listeners: Good listeners allow the other person to finish talking before inserting a remark. Good listeners ask for clarification when they don't understand the speaker (e.g. “I'm confused…do you mean?”). Good listeners encourage the speaker to continue talking by giving feedback (e.g. “Go on, I hear you.” or “Really?”). Good listeners indicate their attention by using nonverbal gestures such as smiling, laughing, or nodding. Good listeners try to match the emotional energy of the speaker to demonstrate they understand the message (e.g. raising your voice or dropping your jaw to indicate surprise)."
    },
    {
      "title": "Have open body language.",
      "content": "Have open body language. As you can see, the nonverbal parts of communication are often just as important as what actually comes out of your mouth. If your body language is open, you are more likely to be perceived positively by others around you. Open body language consists of legs stretched out, posture relaxed, knees apart, leaning forward, elbows away from the body, and arms and legs uncrossed. [3] X Research source When making conversation, avoid standing when others are sitting (when can be construed as intimidation), fidgeting, or turning away from the person you are talking to. Reader Poll: We asked 7002 wikiHow readers about the biggest tells that someone doesn’t want to talk to you, and only 6% said having a distant body position . [Take Poll] So, it can be okay to keep your distance, but definitely keep your body language open so people know you’re interested in being friends!"
    },
    {
      "title": "Learn to read other's body language and social cues.",
      "content": "Learn to read other's body language and social cues. Sometimes, others may not come off as approachable. Certain kids at school may not want to make friends or have a new kid join their group. Pay attention to the cues of others before entering into new social situations. For example, if a person is exhibiting closed body language - arms and legs crossed and elbows tight near the torso - they may not be willing to engage in conversation. Other social cues may include a frowning or sneering facial expression or taking a step back. People who are interested will usually have a mild or welcoming facial expression and move in close to your personal space. [4] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source"
    },
    {
      "title": "Start slow with small conversation-openers.",
      "content": "Start slow with small conversation-openers. Sometimes, all it takes to initiate a lasting friendship is an interesting story between the two of you. Rather than approaching people and trying to find out every single fact in one go, take small steps by asking intriguing questions that can bridge into a longer conversation. You can ask questions like: [5] X Research source ”How do you know ____ (insert name of a mutual acquaintance)?” ”What was the peak of your day?” ”What movies, books, TV shows have you enjoyed lately?” ”What's your favorite thing to do over the weekend?” ”What was the craziest YouTube video you watched this week?\" \"What sports are you into right now?\""
    },
    {
      "title": "Be yourself",
      "content": "Be yourself . [6] X Research source You may feel pressured to become more like popular people or others who have tons of friends. Picking up a few practical habits through observation can be beneficial, but you should never change who you are to gain friends. Doing so is unfair to you and the other person. There is surely someone out there who will enjoy you for you."
    },
    {
      "title": "Join a club or organization.",
      "content": "Join a club or organization. Your school or community probably sponsors a host of different clubs for children, adolescents or young adults. Research what clubs are available in your area and sign up for one (or many) that sound interesting to you. [7] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. Being in a club lets you spend your time outside the classroom constructively. It also helps you learn valuable skills and gain experiences that can help you win college scholarships. More importantly, these extracurricular opportunities give you the chance to form relationships with peers. [8] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019."
    },
    {
      "title": "Participate in sports.",
      "content": "Participate in sports. There are a multitude of advantages of playing sports at your school. Playing a sport at school offers a lot of benefits. It helps you stay fit, hone your leadership and team-player skills, learn organization and commitment, and make new friends. [9] X Research source Think about what kind of sports you may be interested in, and aim to try-out at the beginning of the school year when appropriate."
    },
    {
      "title": "Volunteer.",
      "content": "Volunteer. Helping out in your local community allows you to give back to others, but you can also get something in return. Volunteering gives you meaningful experiences and helps you look more attractive to colleges and employers down the line. Community service also connects you with people you might not otherwise meet from all walks of life. As a result, you may have greater empathy for others, and therefore, be an even better friend. [10] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. You may be able to participate in volunteer opportunities through clubs or sports. However, you can also visit websites such as Volunteer Match to find a range of options in your area. [11] X Research source"
    },
    {
      "title": "Go outside.",
      "content": "Go outside. If you live in a neighborhood with other nearby families or have a local park, it may benefit you to spend more time outdoors. Doing so enables you to connect with nature and animals, but you might also catch the eye or strike up a conversation with a new bike-riding buddy or catch partner."
    },
    {
      "title": "Ask your parents to host a party or barbecue.",
      "content": "Ask your parents to host a party or barbecue. When your parents open up their home to your classmates, fellow club members, or team members, two things happen. You are encouraged to build lasting friendships where you can let others get closer to you. Your parents have the opportunity to meet and build rapport with your friends, too. Talk to your parents about having some sort of gathering in which you can invite a few friends at school. Extra points if one of your parents has friends who have children about the same age as you – that way everyone gets the chance to socialize."
    },
    {
      "title": "Recruit teachers or club organizers to help with friendship match-making.",
      "content": "Recruit teachers or club organizers to help with friendship match-making. Is there a teacher or other adult in one of your extra-curricular activities with whom you have a good relationship? Enlist this person to help you meet other youth your age who share the same hobbies or interests. [12] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Your teachers or club organizers will have built relationships with an assortment of students. If this person knows you well, he should have a good idea of what kind of person you will click with best."
    },
    {
      "title": "Role-play conversations or scenarios with a parent or sibling.",
      "content": "Role-play conversations or scenarios with a parent or sibling. If social situations make you particularly nervous or you lack confidence in making friends, practicing with someone else could help. Pull aside a parent, a sibling, or other family member and explain the circumstances. This person can walk through different scenarios with you and offer pointers based on areas where you need help. [13] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Suggestions for role-play material might include starting a conversation or asking a potential friend to hang out."
    },
    {
      "title": "Seek professional help.",
      "content": "Seek professional help. If you find that, no matter how hard you try, you cannot seem to connect with others at school, you might need to talk with a mental health professional, such as a psychologist or a psychotherapist. They can work with you to figure out where the roadblocks are in your social abilities. In your sessions, you may role-play and complete exercises that help you feel more confident making new friends."
    }
  ]
}