{
  "url": "https://www.wikihow.com/Know-if-Your-Scale-Is-Working-Correctly",
  "title": "How to Know if Your Scale is Accurate: Digital, Analog, & Kitchen",
  "steps": [
    {
      "title": "Zero out the scale.",
      "content": "Zero out the scale. Sometimes, the scale needs to be zeroed out to be accurate, so it’s important to calibrate your scale each time you use it. [1] X Research source On an analog scale, press down on the scale with your hand and then lift up. The dial should level out to zero. If it doesn't, use the turn wheel, usually located at the bottom of the scale or near the dial, to move the dial to zero while it's resting. Test it again to ensure it is at the right place. [2] X Research source If you have a digital scale, follow the same procedure as with an analog except the balancing will be done with a digital button instead of a turn wheel. Note that the steps in this section are different ways to test the accuracy of your scale. You can try each one, but it usually isn’t necessary to do each test. The steps in this section work for both analog (mechanical) and digital (or smart) scales."
    },
    {
      "title": "Weigh a familiar object.",
      "content": "Weigh a familiar object. One way to check the accuracy of your bathroom scale is to test an object that you already know the weight of. It needs to be large enough to register on your scale but small enough that you can carry it to the scale. Try something like a new, unopened bag of flour or sugar. These generally are 5-10 pounds (2.3-8.6 kg) and should be a consistent weight. [3] X Research source The weight of the paper or plastic bag these things come in shouldn't mess with the weight. If the flour or sugar comes in a heavy sack or metal container, you won't get an accurate reading and you should try another object. Or, try hand weights. The weight of these objects will be written on the side. Test to see if they are the weight they say they are."
    },
    {
      "title": "Reweigh an object multiple times.",
      "content": "Reweigh an object multiple times. Scales may also be inaccurate across multiple weigh-ins. Take an object you know the weight of, such as a hand weight or bag of sugar, place it on the scale, and note the weight. Take the object off, and let the scale return to zero. Then, place the object back on the scale and note the weight again. [4] X Research source Repeat this at least 5 times to make sure that the scale is consistent over multiple weigh-ins. Feel free to weigh the object more than 5 times if you get inconsistent results. Just make sure you do it an odd number of times so you can't have split results."
    },
    {
      "title": "Weigh two objects together.",
      "content": "Weigh two objects together. Weighing two objects together can help test the scale at a higher level, as the weight will be heavier. Place one object on the scale, note its weight, then take it off and let the scale even back out. Then, do the same with the other object. Finally, place both objects on the scale together and note the combined weight. Add the weight of each individual object and see if it matches the combined weight. [5] X Research source If the weights match, the scale is accurate. If it doesn't, try it again and see if it is off by the same number. If it is, your scale might always be off by that amount. This method will also test the accuracy of the scale with an uneven weight distribution, which can be helpful for when you weigh yourself, since you may not always stand with your weight 100% balanced."
    },
    {
      "title": "Weigh yourself while holding an object.",
      "content": "Weigh yourself while holding an object. First, step on the scale alone and note the weight. Then, step on the scale while holding an object whose weight you know, like a 5 pound (2.3 kg) dumbbell or a 1 pound (16 oz) bag of flour. Check to see if the weight goes up by the exact amount that you are holding. If it does, then the scale is accurate. [6] X Research source For example, if you step on the scale and it says 145 lb (65 kg), then it should go up to 150 lb (68 kg) when you step on again while holding a 5 lb (2.3 kg) dumbbell."
    },
    {
      "title": "Change the location of the scale.",
      "content": "Change the location of the scale. A scale can be affected by the surface it sits on. The best surface for a scale is a hard surface such as a flat bathroom or kitchen floor, as carpet and other soft surfaces may make the scale off balance and give you inaccurate readings. Weigh an object in the location you normally keep your scale, then clear the scale and move it to a different, more stable location and weigh the object again. The object should weigh the same in both places. [7] X Research source If you get different readings, one of the locations is causing inaccurate readings. Do a test with an object of known weight to see which one is accurate. Try to keep the scale in the same place every day so that, even if the scale is slightly off, you get the same error each day. Even if the numbers are slightly off, this will still allow you to know how much weight you have gained or lost since your starting point is always the same."
    },
    {
      "title": "Perform a taring check.",
      "content": "Perform a taring check. Taring is a feature on digital kitchen scales that will show you whether or not the scale starts its measurements at zero. First, turn on the scale and see if it starts at zero. If it doesn’t, press down on the scale gently, then release it and see if it returns to zero. If it still doesn’t, press the “Tare” button. This will take the current state of the machine and make it base zero. [8] X Research source To test that the taring process works, place an object, like an apple, on the scale and note the weight. Then, hit the tare button to make it zero. Once it balances, lift the object off the scale. The number that remains, which will be negative, should match the number you measured before. Testing the accuracy of kitchen scales is important, as measuring food is an integral part of many diet plans and will help you track your calorie intake . Kitchen scales are also extremely helpful for recipes and cooking."
    },
    {
      "title": "Use nickels to test a scale that rounds to the nearest gram.",
      "content": "Use nickels to test a scale that rounds to the nearest gram. Coins are small and easy to weigh, so collect a few pennies, nickels, and quarters to test the accuracy of your machine. If your kitchen scale rounds to the nearest gram, use a nickel, which weighs 5 grams (0.2 oz). Turn on your scale and make sure it’s at zero. Place a nickel on the scale and note the weight. Then, add another and note the weight. Add a third nickel and do the same. If the scale is accurate, the weight should go up by 5 grams (0.2 oz) each time. [9] X Research source If the weight doesn’t increase by 5 grams (0.2 oz) each time, try again with a different nickel than the one that gave you the off reading. That nickel may be older and degraded, which can affect the weight. If the weight is still off after that, the scale is likely inaccurate."
    },
    {
      "title": "Use pennies to check a scale that measures tenths of grams.",
      "content": "Use pennies to check a scale that measures tenths of grams. Some scales are so accurate they can measure amounts as small as a tenth of a gram. Pennies work best to test these scales, as they weigh 2.5 grams (0.09 oz) each. Turn on the scale and make sure it is at zero. Place a penny on the scale and note the weight. Add two more pennies, noting the weight in between each one. The weights should be 2.5 grams (0.09 oz), 5 grams (0.2 oz), and 7.5 grams (0.3 oz). [10] X Research source If your reading is off, try a different penny than the one that gave you the wrong weight. If the weight is still off, your scale is likely inaccurate."
    },
    {
      "title": "Use quarters to test a precise scale.",
      "content": "Use quarters to test a precise scale. Some kitchen scales are very precise and measure to the hundredths of a gram. For these machines, use a quarter, which weighs 5.67 grams (0.2 oz). Place one quarter on the scale and check the weight. Place another on it and check the weight again. Two quarters should be enough for this scale since all three places can be read for both weights. [11] X Research source The weights should measure 5.67 grams (0.2 oz) and 11.34 grams (0.4 oz). If they don’t, your scale is likely inaccurate."
    },
    {
      "title": "Wyze X",
      "content": "Wyze X Many consumers report that the Wyze X is one of the best scales for weighing yourself. It is precise, has 13 body-tracking metrics, and comes with an intuitive app all for an affordable price. The downside is that you must be barefoot to get a good reading and the minimum weight is 13 pounds. [12] X Research source"
    },
    {
      "title": "Renpho Bluetooth Body Fat",
      "content": "Renpho Bluetooth Body Fat The Renpho Bluetooth Body Fat smart scale is another highly recommended bathroom scale that offers precise readings, an easy-to-use app, and is compatible with all kinds of health platforms, including Fitbit, Google Fit, Apple Health, and Samsung Health. Users report that it won’t read your weight if you have socks on, though, and it isn’t the best option for people with large feet. [13] X Research source"
    },
    {
      "title": "Etekcity EB9380H",
      "content": "Etekcity EB9380H The Etekcity EB9380H is a standard digital scale, great for those who appreciate accuracy and simplicity. When tested for accuracy, it had a standard deviation of 0.23 lbs (3.68 oz) and was especially accurate for small items. The downside is that it can’t be stored vertically and has limited adjustability. [14] X Research source"
    },
    {
      "title": "What’s the difference between analog and digital scales?",
      "content": "What’s the difference between analog and digital scales? Analog scales weigh things mechanically, using springs, while digital scales use circuits that bend under weight and alter the current coursing through them. In general, digital scales are more accurate than analog ones, as the springs in analog scales may develop wear and tear that can affect accuracy. [15] X Research source Home digital scales have fewer and lower-quality electronic gauges than digital scales used in doctor’s offices and hospitals, so they may be slightly less accurate than these higher-quality scales. A smart scale is a type of digital scale that has additional features so you can see more than just your weight."
    },
    {
      "title": "What factors affect scale quality?",
      "content": "What factors affect scale quality? Scale quality is determined by three factors: resolution, precision, and accuracy. Resolution measures the smallest number of increments between two marks on the scale. Precision refers to how often the scale measures an object and gets the same exact weight each time. Accuracy refers to how close the measurement matches an object’s actual weight. [16] X Research source"
    },
    {
      "title": "How do I weigh myself properly?",
      "content": "How do I weigh myself properly? In addition to making sure your scale is working correctly, there are a few factors that can help ensure your weight is as accurate as possible. Keep the scale on a hard, flat surface so your weight is evenly distributed. Weigh yourself at the same time and place each day, as well, as your weight can fluctuate throughout the day. Most professionals recommend weighing yourself in the morning. [17] X Research source"
    },
    {
      "title": "Why is my scale inaccurate?",
      "content": "Why is my scale inaccurate? Scales can lose accuracy due to many factors, including age, use , and wear and tear. [18] X Research source Analog scales may become inaccurate because their springs are damaged or dirty or because the levers get bent out of shape. Digital scales may be inaccurate if their circuitry malfunctions or if they’re exposed to extreme temperatures or harsh weather conditions. If the scales are not damaged, they may also give an inaccurate reading if they aren’t on a hard, flat surface."
    }
  ]
}