{
  "url": "https://www.wikihow.com/Make-a-Group-on-Roblox",
  "title": "How to Make a Roblox Group for Beginners",
  "steps": [
    {
      "title": "Make sure you have 100 Robux.",
      "content": "Make sure you have 100 Robux. This is mandatory, or else you won’t be able to create a group. You can buy Robux or purchase a subscription."
    },
    {
      "title": "Go to https://www.roblox.com/home in a web browser.",
      "content": "Go to https://www.roblox.com/home in a web browser. You can use any web browser on PC or Mac. If you are not logged in Roblox automatically, enter the username and password associated with your Roblox account, and click Log In ."
    },
    {
      "title": "Click Groups.",
      "content": "Click Groups . It's in the menu bar to the left. This displays all the groups you are part of."
    },
    {
      "title": "Click Create Group.",
      "content": "Click Create Group . It's in the upper-right corner of the page."
    },
    {
      "title": "Fill in the name.",
      "content": "Fill in the name. Use the bar at the top of the form to enter the name of your group. Pick a name that is descriptive and reflects what your group is about. A name cannot be longer than 50 characters."
    },
    {
      "title": "Fill in the description.",
      "content": "Fill in the description. Use the large box to fill in the description of your group. Describe what you do in the group. Include a motto for your group. Find a description that entices players to join your group. If your group speaks a language other than English, be sure to include that in the description as well."
    },
    {
      "title": "Choose an emblem.",
      "content": "Choose an emblem. Choose an emblem that is eye-catching and representative of your group. Use the following steps to select an emblem. Click Chose File below \"Emblem\". Click an image file on your computer. Click Open ."
    },
    {
      "title": "Select \"Anyone can join\" or \"Manual Approval.\"",
      "content": "Select \"Anyone can join\" or \"Manual Approval.\" If you want to allow anyone to join, click the radio button next to \"Anyone can join\". If you want to control who joins your group, click the radio button next to \"Manual Approval.\" This will require you to approve those who request to join. You can also click the checkbox next to \"Players must have Premium\" to require members to have a Premium membership. [1] X Research source"
    },
    {
      "title": "Click Purchase.",
      "content": "Click Purchase . It's the green button at the bottom of the form. This will finalize your group. Note: Creating a group costs 100 Robux. [2] X Research source"
    }
  ]
}