{
  "url": "https://www.wikihow.com/Get-a-Friend-Back",
  "title": "How to Get a Friend Back",
  "steps": [
    {
      "title": "Reflect on what has happened.",
      "content": "Reflect on what has happened. There is most likely a specific reason for the rift in your friendship. Consider the situation as objectively as you can. Does one of you bear a larger portion of involvement? Even if you feel wronged by your friend, consider the possibility that somewhere along the line you have also hurt them in subtle ways that you weren't aware of. On the other hand, if you know you're the one who made a mistake, spend some time reflecting on what you did and why, and how you can prevent doing it again."
    },
    {
      "title": "Beware of assumptions.",
      "content": "Beware of assumptions. If there seems to be no clear reason for your friend's distance, don't jump to conclusions. It may have nothing to do with you; your friend might have something troubling them. [1] X Research source"
    },
    {
      "title": "Be prepared to accept responsibility and/or forgive.",
      "content": "Be prepared to accept responsibility and/or forgive. You may want your friend back, but until you're ready to acknowledge your own mistakes and/or forgive your friend theirs, you won't get anywhere. That said, you may need to have a long talk with your friend before the wounds start to heal. The important thing is to make sure you feel ready and willing to put things back together, rather than nurse a grudge. Your friend may not listen at first, but with time and you showing that you care, they will forgive."
    },
    {
      "title": "Think about what you want to say in advance.",
      "content": "Think about what you want to say in advance. If you feel you need to apologize, be specific about what you're apologizing for. Make sure it's sincere: what are you really sorry about? [2] X Research source For example, if you've been ignoring your friend because you're spending all your time with a new love interest, it isn't appropriate to apologize for spending time with this other person. Instead, talk about how you're sorry you haven't been making time for your friend."
    },
    {
      "title": "Call your friend or ask to meet.",
      "content": "Call your friend or ask to meet. It's probably best to talk in person if you can: body language can communicate a lot more than just your voices and may help avoid misunderstandings. However, if that's not possible, call your friend to talk. If you ask to meet, try to avoid vague phrases like, \"We need to talk.\" These can put your friend on the defensive. Instead, try a more emotionally rooted approach like, \"I miss you,\" or \"I was just hoping we could spend a little time together.\" [3] X Research source"
    },
    {
      "title": "Write a letter.",
      "content": "Write a letter. If you're too shy or your friend won't see you, writing a short note can help break down the barrier. Sometimes expressing yourself on paper is easier than in person. Try to be simple and straightforward; at the end, suggest a casual, no-pressure meeting, such as going for coffee or a walk."
    },
    {
      "title": "Tap into sincerity.",
      "content": "Tap into sincerity. Tell your friend how important they are to you, and that you miss them. While it may be tempting to get this talk over with as soon as possible, cutting corners could work against you. This is the opportunity to wear your heart on your sleeve. Again, avoid one-liners like, \"Let's bury the hatchet\" - such contrived phrases might put your friend on guard. [4] X Research source"
    },
    {
      "title": "Listen to your friend's side.",
      "content": "Listen to your friend's side. Again, it's best if you approach the conversation without preconceived notions of how they're feeling or what they're going to say. Keep an open mind, and give them as long as they need to say whatever it is they need to. [5] X Research source They may need a cue from you, like \"I'm sure I made you feel pretty awful,\" or \"I'd love to be friends again. Do you think that's possible?\" [6] X Research source Listen without interrupting, even if what they say triggers certain responses in you."
    },
    {
      "title": "Give your friend time to think it over.",
      "content": "Give your friend time to think it over. You may have been ready to talk things through, but perhaps your friend wasn't quite. Both of you might need time to process what the other has said. You've made a big, important step initiating this talk - now step back a bit so your friend can consider. This is especially important to keep in mind if you don't receive a positive response at first. In a few weeks or months, your friend may still come around. [7] X Research source It may be difficult to take a step back from your friendship, but it may be necessary for your friendship to heal."
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Your friend may need time, even more time than you expected, to mull things over. Friendships are complex, so don't expect this to mend overnight. [8] X Research source"
    },
    {
      "title": "Talk about things that you'd like to change.",
      "content": "Talk about things that you'd like to change. If you are both ready to resume your friendship, this transition is a good moment to agree on a few basic things if necessary. This is also a chance for both of you to learn and grow from each other. For example, maybe you'll agree to be a better listener and your friend will agree not criticize you so much. [9] X Research source This doesn't mean, however, that you should make drastic changes to yourself to please your friend. If your friend makes demands you're uncomfortable with, you need to consider whether this is really a healthy friendship based on love and mutual respect."
    },
    {
      "title": "Make plans.",
      "content": "Make plans. When you feel you've both talked everything through and things are on the mend, make a plan to see each other again. Suggesting a fun activity that you used to do together (going for a hike, making dinner, going to a movie) prevents dwelling on the problem and can help get your relationship back on track. [10] X Research source"
    }
  ]
}