{
  "url": "https://www.wikihow.com/Help-Around-the-House",
  "title": "How to Help Around the House",
  "steps": [
    {
      "title": "Throw away your garbage.",
      "content": "Throw away your garbage. Sometimes you might get lazy and let garbage or unnecessary stuff pile up around your room. Get a garbage bag and go around your room. Put everything that you could throw away in there. [1] X Research source It can be very helpful to have a little garbage can in your room for you to throw things away into. Make sure you clean it out when it gets full. Not only will this make your room less cluttered, but garbage also attracts bugs and other pests. Plus it smells. Getting rid of it will make your room smell better."
    },
    {
      "title": "Dust the room.",
      "content": "Dust the room. You can use an old rag, or a nicer wipe, and wipe all the dust off the top of your furniture. You’ll probably find a lot of dust on places like nightstands, dressers, and your desk if you have one. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Make your bed",
      "content": "Make your bed . Clear off everything that isn’t your sheets and blanket. Tuck your sheets under the corners with “hospital corners” for a neat look. Place your blanket on top and smooth it down, then fold down the top of the blanket and sheet down. Then you can put back on your pillows or anything else you like to keep on your bed. A good time to make your bed is first thing in the morning. That way you will remember to do it right away. Also, it will make sure that the only time your bed isn’t made is when you are sleeping in it. Your bedsheets should be washed every couple of weeks, so make sure to strip your bed when your parents ask to make sure they stay clean."
    },
    {
      "title": "Sort your clothes.",
      "content": "Sort your clothes. You always want to keep your clothes neat so they will look good when you wear them, and so you know where they are. If you have clothes lying around the room, sort them into clean clothes and laundry. That will help decide where they go next. If your clothes are clean, fold them and hang them up in the closet or put them back in the dresser where they belong. If your clothes are dirty, gather them up, and take them to the laundry room. If your parents let you, you can even do the laundry, and clean your clothes yourself. Just make sure to check with them first. Once they are clean, fold them and put them away properly in your room."
    },
    {
      "title": "Pick up books and toys.",
      "content": "Pick up books and toys. If you have items lying around your room, get them off the floor and find some place to put them away. If they are just lying on the floor, it can be tough to move around without stepping on something. Doing that means you could hurt yourself, or break one of your toys, or both. Don’t just throw things into a pile in your closet. That only moves the mess to another part of your room. Make sure you have a shelf or chest to put things in before starting. If you don’t have enough room for all of your stuff, you may want to ask for something else to store them in, or consider getting rid of stuff you don’t use or play with anymore."
    },
    {
      "title": "Ask other people if they need help.",
      "content": "Ask other people if they need help. Sometimes people, including your parents and siblings, won’t always ask for your help. Instead, you can keep an eye out to see if they might need it. For example, if your dad comes home with groceries, ask if you can help carry them into the house. Or, if your mom is cooking, ask if she needs you to do anything else that will help get dinner ready. Your family may tell you they don’t need your help, and that’s okay. The important thing is that you thought to ask, which they will appreciate."
    },
    {
      "title": "Set the table for meals.",
      "content": "Set the table for meals. Make sure you have all the plates, cups, and utensils you will need to eat your meal. You can also look up proper ways to set the table or fold napkins for something nicer and more creative to look at. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source After meals are over, you can also be helpful by clearing the table. Get all the dishes and silverware into the sink or dishwasher for cleaning."
    },
    {
      "title": "Do the dishes",
      "content": "Do the dishes . After meals, you need to clean off dishes and make sure they get put away. Nobody likes cleaning the dishes, so you can really help your parents out after they’ve put in a lot of work to make meals. Start by scraping off all food scraps, which will make the dishes easier to clean. Remember to use warm water and soap to clean off the whole dish. Clean all the dishes, silverware, cups, anything that you used to eat or make food with. Remember to clean food scraps out of the sink drain when you are finished. Throw them away so they don’t clog the drain. Empty the dishwasher. If your house has a dishwasher, unload it after it finishes. Just give it a few minutes to cool down first, as dishes can be hot. You don’t want to accidentally burn yourself. Be careful when handling sharp objects like knives and other utensils. If you aren’t careful, you can cut yourself, so always pick things up by the handle, and watch where you are reaching. [4] X Research source"
    },
    {
      "title": "Clean the floor.",
      "content": "Clean the floor. Dirt, dust, crumbs, and other things gather on the floor and can attract bugs. Help by sweeping up crumbs into a dustpan and throwing them away. This is especially important after meals, both where you ate, but also where you or your parents made the food. [5] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source If you are older, and your parents let you, use a vacuum to help give the floors a better clean."
    },
    {
      "title": "Take out the trash.",
      "content": "Take out the trash. Taking the garbage bag to a can or bin outside lets someone come and take it away. This is an easy chore, even for young kids. If you notice the trash can getting full, especially in the kitchen or bathroom, take it outside. Just remember to replace it with a new one. [6] X Research source"
    },
    {
      "title": "Get the mail and newspaper.",
      "content": "Get the mail and newspaper. These usually come once a day, though there is no mail on Sundays. It can be a quick walk down to your mailbox to grab whatever you got for the day. [7] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Don’t hide bad news or bad grades. This is not a chance for you to keep your parents from seeing stuff like that."
    },
    {
      "title": "Clean up after yourself.",
      "content": "Clean up after yourself. If you make a mess somewhere, or you are trying to do things like cooking or projects on your own, take care of it yourself. This can mean garbage, crumbs, a spill, or dirty dishes. Cleaning up where you were is a good way to show your parents that you are mature and responsible. There are plenty of other types of messes that can appear around the house. Piles of books, papers, clothes, toys, and dishes can appear at any time. You can be a big help by cleaning them up."
    },
    {
      "title": "Ask for regular chores.",
      "content": "Ask for regular chores. There will always be plenty of things that need to get done around the house, including stuff you might not think about. Asking for a set of regular chores can be a good way to make sure you are helping things to get done. It will also be easier on your parents because they won’t have to remember to ask you to do something, you will just know to do it. Doing regular chores is good for you too. It will help give you a sense of responsibility, and prepare you for the things you will need to do when you are older and don’t live you’re your parents anymore. [8] X Expert Source Wits End Parenting Parenting Specialists Expert Interview. 5 March 2020. [9] X Research source You can help here by giving your parents suggestions of things you would like to do. These can be chores you know you would be good at, or things you would like to get better at doing. In talking with your parents, you may decide that you will have a set list of chores, or maybe you will rotate a list of chores with your siblings. Create a chore chart. This is a good way to help everyone remember what you are supposed to be doing. [10] X Expert Source Wits End Parenting Parenting Specialists Expert Interview. 5 March 2020. The chart should explain what you need to be working on, and how often you should do it. For example, setting the table could be every day, but taking out the garbage would only happen once a week. You can even be creative with the chart, and make something that has fun designs and ways of checking things off. Just remember that it needs to make sense to everyone who uses it. [11] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Remember that chores may not always be divided fairly. If your siblings are too young to do something, you will need to do it until they are old enough. The important thing is to not whine about it, and do what needs to be done."
    },
    {
      "title": "Feed your pet.",
      "content": "Feed your pet. Like you, your pet needs to eat regularly, so make sure he gets his meals on schedule. Make sure you know what kind of food your pet should get, how much of it, and when he should be fed. [12] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source You should only feed him proper pet food, so no table scraps or treats. Don’t forget to make sure your pet also has a supply of clean water. If the dish still has water in it, but it looks dirty, rinse it out and refill it. This is a good thing to talk about with your whole family, so everyone knows who is supposed to feed your pets and when. You don’t want to overfeed or underfeed him."
    },
    {
      "title": "Clean your pet’s home.",
      "content": "Clean your pet’s home. If your pet lives in a cage or tank, make sure you clean it regularly. Replace newspaper in the bottom of bird, rodent, and reptile cages, change the bulbs in heat lamps for reptiles, and clean out the water in fish tanks so that your pet has a comfortable place to live. If you have a place for your pet to use the bathroom, whether in the cage or a litter box, make sure you clean that out regularly as well."
    },
    {
      "title": "Play with your pet.",
      "content": "Play with your pet. Your pet is part of your family, and you should want to spend time with him. This is especially important for active animals like dogs, but also smaller pets like mice or hamsters. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Even cats will want some time with family members, so go ahead and pet him or let him curl up with you for a nap. Make sure you keep an eye on your pets, especially if they are smaller. You don’t want a gerbil or lizard getting loose in the house. Be nice and friendly to your pets. If you are mean or aggressive, your pets won’t like that. They will either become more aggressive to you, which could mean biting or scratching, or they will become afraid, and not want to play with you. [14] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Take your pet for a walk.",
      "content": "Take your pet for a walk. This is another great way to spend time with your pets for exercise, and one less chore for your parents to do. Make sure you have a leash or other equipment to keep a hold of your pet so he doesn’t run away or get into trouble. If you have a dog, or another pet that needs to use the bathroom outside, remember to bring a bag so you can pick up his poop to throw away. [15] X Research source"
    },
    {
      "title": "Clean your pet.",
      "content": "Clean your pet. If your pet has fur or hair, he’ll need a good grooming. Brush or comb him everyday to help get rid of loose or shedding hair, and give him a nice clean look. [16] X Research source When you comb through hair, make sure to check for fleas and ticks, as well as anything else that might be stuck in your pet’s coat. If you see a tick you can try to get it off yourself, or ask your parents for help. Just make sure your parents know you found the tick, so they can call the vet if something needs to happen. You may be able to bathe your dog or cat as well. This can be tough, as your pet may not want a bath, or enjoy splashing. Make sure your parents know you want to give yours a bath. Just don’t overdo it. Once a month for dogs, or once every few months for cats, should be enough. For rodents and reptiles, pets that live in cages, keeping the cage clean should be enough. You don’t need to wash them."
    }
  ]
}