{
  "url": "https://www.wikihow.com/Know-That-Your-First-Period-Is-Coming",
  "title": "Signs and Symptoms That Your First Period Is Coming Soon",
  "steps": [
    {
      "title": "Typically, breasts develop first and menstruation starts 2-3 years later.",
      "content": "Typically, breasts develop first and menstruation starts 2-3 years later. This doesn't necessarily mean when you first started wearing a bra—you might still not be wearing a bra. The initial stage of breast development, \"budding,\" usually happens when you're between 8 and 10 years old. So if you started developing breasts when you were 9, you can figure you'll probably start your period when you're 11 or 12. [2] X Research source Usually, breast budding signals the onset of puberty , but this isn't always true. It's perfectly normal to notice other signs of puberty, such as pubic hair, before breasts. Don't worry if that means you're probably going to start your period later than your friends. Everybody's body is different! Starting your period later doesn't mean that you're less mature or grown-up than your friends."
    },
    {
      "title": "Your first period usually comes about 6 months after a big growth spurt.",
      "content": "Your first period usually comes about 6 months after a big growth spurt. If you're keeping track of your height on a growth chart, you'll notice that changes come really rapidly and then start to slow down. At the point when you start growing more slowly, you can figure you're about 6 months away from having your first period. [3] X Research source Even if you don't have a growth chart, you can still keep track of your growth by looking at how your clothes fit. For example, you might try on a pair of pants that fit well 4-6 months ago and see how they fit now. Then, try something from last year—you'll probably notice a big difference. Speaking of pants, around the same time, you might also notice that your hips are getting wider—that's a part of puberty too, and can also cause your pants to fit a little differently."
    },
    {
      "title": "Thicker discharge means your period is likely 2-3 weeks away.",
      "content": "Thicker discharge means your period is likely 2-3 weeks away. About a year before your first period, you'll start noticing discharge in the crotch of your underwear. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source This is totally normal and doesn't mean you're unclean or have any health problems. At first, the discharge is probably thin and whitish or clear. When it starts looking kind of like egg whites, that's a sign you can probably expect your period in a couple of weeks. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Many people notice that they don't have any discharge in the week before their period, but this isn't the same for everybody. If discharge makes you uncomfortable or embarrassed, talk to a parent about getting panty liners to absorb it. You can get both disposable or reusable panty liners. At this point, it's a good time to put together a period kit if you haven't already. Get a small bag and include a couple of period products with a change of underwear."
    },
    {
      "title": "New pubic hair is a sign your period is coming in about two weeks.",
      "content": "New pubic hair is a sign your period is coming in about two weeks. The pubic hair between your legs starts growing in a wider patch. In the places where you already had it, you might notice that it's thicker or denser than it was before. You'll probably start growing hair under your arms as well, although for some people this doesn't start until after their first period. [6] X Research source Pubic hair is natural and normal, but some people prefer to shave it . If that's something you want to do, talk to a parent about it. They'll help make sure you know how to do it correctly so you don't hurt yourself."
    },
    {
      "title": "If you have a puffy belly, your period might be on its way.",
      "content": "If you have a puffy belly, your period might be on its way. If you notice anything like this or feel a little sick to your stomach, think back to what you've eaten recently. If you haven't eaten anything that might cause you to feel sick, you might be getting your period in a week or two. [7] X Research source Diarrhea or constipation, nausea, and other digestive issues are also pretty common just before you get your period. [8] X Research source If these symptoms are bothering you too much, ask your parents if you can take some over-the-counter medicine to help you feel better."
    },
    {
      "title": "Changes in hormones can cause pimples to appear.",
      "content": "Changes in hormones can cause pimples to appear. Although acne is pretty common for everybody during puberty, it can get out of control about a week or two before your period. Period-related acne can even show up if you're already using anti-acne face wash or other treatments to control breakouts . [9] X Research source On the other hand, if you've never had any acne before and you wake up one morning with a zit, it could mean your period is coming—but it could also just be a normal part of puberty. Unfortunately, it's hard to know with your first period! After having several periods, you'll probably start to notice a pattern."
    },
    {
      "title": "Breast tenderness is a common sign that your period is coming soon.",
      "content": "Breast tenderness is a common sign that your period is coming soon. Your breasts might feel so sensitive that even the slightest touch or pressure hurts. This happens because of the changing hormones in your body around the time of your period and usually means your period is less than two weeks away. [10] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Wearing a sports bra can help with this because your breasts won't move around as much. If you keep them stable you won't notice the soreness as much."
    },
    {
      "title": "Even though you're tired, you can't slow down your brain.",
      "content": "Even though you're tired, you can't slow down your brain. This can be a frustrating part of the hormonal changes that occur in the weeks before you get your period. When you go to bed, you toss and turn as your mind goes in a million different directions. Even if you've had a long day and feel tired, you just can't calm down enough to go to sleep. [11] X Research source If you're able to do so, getting up and walking around for a bit—even if it's just walking in circles in your room—can sometimes help. Work with your parents to set up a good sleep routine . It'll help your body know when it's time to drift off, even when your hormones are out of whack."
    },
    {
      "title": "You feel happy one minute and sad the next, seemingly for no reason.",
      "content": "You feel happy one minute and sad the next, seemingly for no reason. You might find that you get frustrated easily or that things that never bothered you before suddenly bother you a lot. You might even find yourself getting choked up by something as simple as a sappy commercial. This kind of moodiness is often a sign that your period is coming within a week or two. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This can be really hard to deal with because it can feel like you have no control over your emotions. When you start feeling anxious or irritable, it might help to take a few deep breaths and try to relax . If you do end up snapping at someone or saying something you don't mean, just apologize . You might say, \"I'm sorry I snapped at you—my emotions are out of control right now.\""
    },
    {
      "title": "Hormonal fluctuations can make you feel run-down.",
      "content": "Hormonal fluctuations can make you feel run-down. You might almost feel like you're coming down with a cold or the flu. Except, instead of actually getting sick, that tired soreness lingers on. This is typically a sign that you'll be getting your first period within the next week. [13] X Research source A nice warm bath can ease some of that soreness. Throw in your favorite bath bomb and make it a treat! Exercise can actually help too, but it's okay if you feel too tired to exercise. Even just taking a short walk, if you're up to it, can help you feel a little more like yourself."
    },
    {
      "title": "Cramps are one of the most common signs that your period is coming.",
      "content": "Cramps are one of the most common signs that your period is coming. If you've ever had a muscle cramp anywhere on your body before, you know what it feels like. But these cramps affect internal muscles in your lower abdomen and sometimes the vagina and don't go away quickly like a cramp in your leg would. Cramps usually tell you your first period is coming within a day or two. [14] X Research source If your cramps get really uncomfortable, ask your parents for some ibuprofen—that'll help. [15] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    }
  ]
}