{
  "url": "https://www.wikihow.com/Make-Christmas-Cards",
  "title": "How to Make Christmas Cards",
  "steps": [
    {
      "title": "Start early.",
      "content": "Start early. It takes a lot of time to make Christmas cards by hand, so start crafting them early so that they arrive to the recipients by Christmas."
    },
    {
      "title": "Choose a format.",
      "content": "Choose a format. If you're making your Christmas cards by hand, there are a variety of different formats you can use. From handwritten and decorated designs to photo cards, you can personalize each card to its recipient or have one overall design to send everyone on your list. You can get a sense of card formats from different sources including magazines and websites. Publications such as Better Homes and Gardens, Martha Stewart Living, and Real Simple have examples of different card formats you can make, including decorated and handwritten cards. Websites such as Shutterfly have suggestions on picture cards. [1] X Research source [2] X Research source"
    },
    {
      "title": "Sketch a basic design.",
      "content": "Sketch a basic design. If you have a good idea of how you want your card to look, it will be easier to gather the proper supplies and simplify the process of making the cards. Consider a variety of design aspects from color to motif and message and whether each element matches the others. [3] X Research source There are many different Christmas motifs for your card. For example, you could use a Santa or Rudolf the Red-Nosed Reindeer design for children. For adults, you could have a Christmas tree or dangling ornaments, or even a simple message such as “Season's Greetings” or “Noel.” [4] X Research source There are also many different Christmas messages you can write in the card. Perhaps you want to use something traditional and simple such as “Wishing You a Merry Christmas,” or maybe you want to write a personal message in each card. Another option is matching your motif and your message. For example, if you want to use stockings hung by a chimney for your motif, you could write “The Stockings Were Hung…” [5] X Research source [6] X Research source"
    },
    {
      "title": "Choose and buy paper and envelopes for your cards.",
      "content": "Choose and buy paper and envelopes for your cards. Once you have a developed idea for your card, including format and a basic design sketch, choose the paper you want to use. There are many different options of paper type and color from a sturdy cardstock to scrapbook paper. [7] X Research source Don't forget to buy envelopes, either, as you'll need something in which to send the cards! cardstock is a heavier, excellent quality paper that comes in a variety of colors, including holiday favorites red, green, silver and gold. [8] X Research source If you're going to make a photograph card, use cardstock so that holds the weight of the picture. Scrapbooking paper is also a high quality paper that is not as heavy as cardstock. Even though it's called scrapbooking, you can also use it to make Christmas cards. [9] X Research source You might notice that cardstock and sometimes scrapbooking paper is pre-folded. At this stage, you can also decide if you want your card to have a portrait (up and down) or landscape (side to side) orientation. Purchase the paper for your cards at large stores such as Target, or specialty stores like Michael's or Paper Source. It's also possible to purchase your card paper online at retailers including Target, Michael's, and Paper Source. Local printing shops usually have a nice paper selection for your cards."
    },
    {
      "title": "Purchase supplies and decorations.",
      "content": "Purchase supplies and decorations. You'll need various supplies, including glue and scissors, as well as decorations such as glitter, ribbons, and stickers to make your cards. Having a well-stocked selection of supplies and decorations is useful in case you make mistakes or need to change the design. You can purchase both supplies and decorations in stores or online at different retailers including craft supply stores including Michael's or Hobby Lobby, department stores like Walmart or Target, and paper or card stores such as Paper Source or Papyrus. You'll need the following supplies to make your card: glue, tape, scissors, pens for writing your message, and a ruler. Use clear glue and clear tape for the best results. There is a large variety of possible decorations you can use. Some examples include: ribbons, Christmas motif stickers, stick on letters, and glitter. [10] X Research source [11] X Research source One option to consider for decorations are online templates of motifs you would like to use. Martha Stewart Living, for example, provides easy templates that you can download and draw on to your cards. [12] X Research source"
    },
    {
      "title": "Do a test run.",
      "content": "Do a test run. Make one card using your basic design sketch. Doing this will let you see if everything matches and approximately what size writing must be as well as the best placement for your decorations."
    },
    {
      "title": "Write out your messages on the card.",
      "content": "Write out your messages on the card. You can either hand write or print out whatever messages you've chosen for the inside and front of your card. Use a ruler to guide your writing and assure that it is straight. If you have a message for the front of the card, or if it is only one page, write it and make sure to leave enough room for your decorations. For example, if you decided to write “The Stocking Were Hung…” and add some stocking stickers, you'll need to make sure you have enough space to hang your stockings on the card. [13] X Research source Likewise, if you're using a photograph on the front of your card and want to include a message, make sure there is plenty of space for both, or tailor the size of your written message to accommodate the picture. If you don't have the neatest or most beautiful handwriting, print out your message either from a design you like on the internet or one you generate in a Word program on your computer. Write your message on the inside of the card after you've finished the front. Make sure to sign your name, and those of your family members if you like. Make to allow enough time for pens or glue to dry before you start decorating the card."
    },
    {
      "title": "Decorate your cards.",
      "content": "Decorate your cards. Now comes the fun part! Once you've written your messages on the front and inside the card, you're ready to embellish it with decorations. Have your decorations readily available as you work. You might also want to have orange sticks or cotton swabs to fix any mistakes. If you run out of decorations, improvise with other decorative supplies, including your paper, if necessary."
    },
    {
      "title": "Allow cards to set.",
      "content": "Allow cards to set. Before you place your handcrafted Christmas cards in their envelopes to send, allow them to set overnight to make sure that any adhesives don't shift."
    },
    {
      "title": "Choose a format.",
      "content": "Choose a format. If you'd like to make your Christmas cards personal, but don't have the time or money to do it by hand, using an online service such as Shutterfly or PSPrint is an excellent option. There are also a variety of different formats you can use from individualized designs to photo cards. You can get a sense of the different card formats from online services by looking at different websites such as Shutterfly, PSPrint. [14] X Research source [15] X Research source"
    },
    {
      "title": "Choose a basic design or template and online service.",
      "content": "Choose a basic design or template and online service. Once you've had a chance to see the different options of card formats and services available online, decide which one best suits your wishes and needs. Most online services, including Shutterfly and PSPrint, will allow you to customize your messages and designs from a simple template as you like. Make sure to check the prices for the cards. The more elaborate your card, the more expensive it's going to be. Generally, the more cards you buy, the cheaper your order will be."
    },
    {
      "title": "Design the front of your card.",
      "content": "Design the front of your card. After looking at the different motif options for the front of your card, choose one and enter it into the online interface. Write a message on the card if there isn't one. You may also have the option to include an additional message to anything that may already appear as a part of your design. If you are making a photo card on a service like Shutterfly, you'll likely only have one side to your card. If this is the case, add your message to the front. Remember not to put too much on a one-sided card, though. [16] X Research source"
    },
    {
      "title": "Design the inside of your card.",
      "content": "Design the inside of your card. You might want to include additional decorative motifs or a personalized message inside of each card. If there is a pre-formulated message inside the card, you may have the option to rewrite it as you like."
    },
    {
      "title": "Check the final product.",
      "content": "Check the final product. Before you place your order, check each aspect of the card to make sure there aren't any mistakes. If there are, fix them and then check until the card is exactly how you like it. Also check to make sure your designs and messages match one another. You wouldn't want a blue and silver traditional front design with a green and red modern inside motif."
    },
    {
      "title": "Order your cards.",
      "content": "Order your cards. Once you've designed and personalized your Christmas card, place your order with the online service. Print out the confirmation in case there is a problem with your shipment or with the design. When the cards arrive, also check them for any mistakes from your original order."
    }
  ]
}