{
  "url": "https://www.wikihow.com/Inspect-Element-on-Chrome",
  "title": "How to Inspect Element on Chrome",
  "steps": [
    {
      "title": "Open Google Chrome on your computer.",
      "content": "Open Google Chrome on your computer. The Chrome icon looks like a colored ball with a blue dot at the center. You can find it in your Applications folder on a Mac, or on your Start menu on Windows."
    },
    {
      "title": "Click the three vertical dots icon.",
      "content": "Click the three vertical dots icon. This button is located next to the address bar in the upper-right corner of your browser window. It will open a drop-down menu."
    },
    {
      "title": "Hover over More Tools on the drop-down menu.",
      "content": "Hover over More Tools on the drop-down menu. A sub-menu will pop up."
    },
    {
      "title": "Click Developer Tools on the More Tools sub-menu.",
      "content": "Click Developer Tools on the More Tools sub-menu. This will open the Inspector column on the right-hand side of your browser window. Alternatively, you can open the Inspector with a keyboard shortcut. This shortcut is ⌥ Option + ⌘ Cmd + I on Mac, and Ctrl + Alt + I on Windows."
    },
    {
      "title": "Hover over an element on the Inspector column.",
      "content": "Hover over an element on the Inspector column. Moving your mouse to an element or a line in Inspector will highlight the selected element on the web page."
    },
    {
      "title": "Right-click an element you want to inspect on any web page.",
      "content": "Right-click an element you want to inspect on any web page. Your right-click menu will pop up in a drop-down box."
    },
    {
      "title": "Select Inspect on the drop-down menu.",
      "content": "Select Inspect on the drop-down menu. This will scroll the Inspector column up or down to the selected element, and highlight its source code. You don't have to manually open the Inspector column to do this. Selecting Inspect on the right-click menu will automatically open the Inspector."
    }
  ]
}